{"id": "Refugee-staffed meal service aims to bring Syrian food to new Toronto neighbourhoods", "paragraph": "A made-in-Toronto project that began as \"a small gesture of hospitality\" for Syrian refugee families is hoping to expand its reach across the city this month. The Newcomer Kitchen, a take-out food service run out of a commercial culinary space in Dufferin Grove, has partnered with three organizations to bring homemade Syrian meals to more neighbourhoods.\"Since the beginning, it really felt like this idea was much bigger than just this one room,\" said Len Senater, who co-founded the non-profit organization in 2016. Senater is also the owner and proprietor of The Depanneur, a popular breakfast and lunch spot on College Street that provides the space and logistical support for Newcomer Kitchen. Every Wednesday, between six and eight Syrian refugees prepare 50 traditional meals that are made available for pickup to anyone with an appetite. The meals can also be delivered for free through Foodora, though only within three kilometres of The Depanneur.Cooks from 80 different families take turns each week, and the money earned goes back to the women who prepared the meals. To date, Senater estimates the program has put provided up to $120,000 for the families who participated so far.For the first time this month, the meals will be available for pickup or delivery from three other locations spread across Toronto. The Centre for Social Innovation Annex, Paintbox Bistro in Regent Park and The 519 in the Church-Wellesley area will each be a pickup spot for the meals.The idea is that the new locations will help expose more neighbourhoods to the program and allow more people than ever to enjoy real Syrian food. The partnerships are meant to serve as a \"proof of concept\" that could serve as a model for similar initiatives.\"It's intended to be a model for any newcomer community, in any kitchen willing to open its doors, in any city of the world,\" Senater explained in an interview on Sunday. For now, all the prep work and cooking will still be done at The Depanneur because of the immense logistical challenges involved in preparing 50 meals.The partnerships are set to run through December, though Senater hopes it will become a more permanent feature of Newcomer Kitchen. They could also prove essential to the longevity of the project itself.The Depanneur faces a 60 per cent rent hike at the end of the year, according to Senater. The financial reality of that sudden increase has put the future viability of the whole initiative at risk. \"It's been a real struggle to keep afloat already,\" Senater said. Part of the motivation for rotating meal pickups to the other locations is so Senater and his staff at The Depanneur can use the kitchen space on Wednesdays for events that generate revenue. At this point, every dollar earned is critical, he said. Newcomer Kitchen depends almost entirely on crowdfunding campaigns, fundraising drives and sponsorships. \"It's gotten a lot of national and international attention, but it's yet to receive any sort of official funding in any way,\" Senater said. Securing a consistent source of money was the impetus behind incorporating as a non-profit. But finding funding has proven to be more elusive than anyone thought.\"I had imagined it would be more straightforward given the obvious win-win of this idea,\" said Senater. Navigating the bureaucracy has become like a full-time job, he added.\"The large print giveth, and the fine print taketh away,\" he joked. For the complete list of locations and dates for meal pickups, click here.With files from Lucas PowersAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}