{"id": "Chelsie Probert's father sobs in court as murder trial winds down", "paragraph": "The father of a murdered teenager broke down in a Halifax courtroom Wednesday as the Crown started reviewing evidence about how the 18-year-old girl died.\"Oh my God,\" said Jason Probert as the trial for the teen accused of killing his daughter, Chelsie, wound down in youth court.\"Oh, Chelsie,\" he said. \"I'm so f--king sorry.\"Judge Elizabeth Buckle paused the trial as Probert sat sobbing with his head in his hands. He offered to leave the courtroom, as he's done throughout the trial whenever graphic evidence of his daughter's final moments was brought up.\"I don't want you to leave,\" Buckle told him. She explained that she needed to hear the lawyers and asked them to wait until Probert was composed before they continued with their closing arguments.Chelsie Probert was stabbed to death on a walking path in north-end Dartmouth on June 7 of last year in what the Crown has described as a botched robbery attempt.Court has heard that two people were with Probert when she was fatally stabbed: the 17-year-old boy who is charged with second-degree murder in her death and his 20-year-old acquaintance.The teen's identity is protected by a publication ban. The identity of the 20-year-old is also being withheld.In his closing arguments Wednesday, defence lawyer Brandon Rolle said the Crown had failed to prove the case against his client beyond a reasonable doubt.\"The Crown has some real difficulties meeting their burden,\" he said.The 20-year-old was the Crown's key witness but throughout the trial, the defence painted him as an accomplished liar and criminal, and suggested he was actually the killer.The witness previously testified that he is an avid marijuana user, drinks heavily, has abused pills, is a low-level drug dealer and has stolen, threatened someone and wanted to buy a weapon.\"The Crown is asking you to rely on the evidence of a witness of doubtful credibility,\" said Rolle.The Crown countered that it is the 17-year-old boy charged in the case who should not be believed. The accused testified in his own defence and the Crown said there were serious discrepancies in his evidence.\"His story was full of so many holes and illogic precisely because it was a story,\" said Crown prosecutor Steve Deagan.Deagan said there was no evidence to support the teen's claim that he was afraid of his acquaintance and that's why he followed him on the night of the stabbing. Deagan said there were opportunities for the teen to leave but he opted not to because he wasn't afraid at all.Deagan acknowledged there remain questions from that night.\"There doesn't seem to be any real explanation for why this happened,\" he said. \"There doesn't appear to be any glaring motive.\"Family members of the victim and the accused packed the courtroom Wednesday.Some of Probert's family wore T-shirts bearing her image. Buckle addressed them, saying she thought the pictures were a memorial to Probert's life and her death.\"If I thought for a moment they were an attempt to influence my decision, I would not allow it,\" she said.The Crown is expected to finish its closing arguments Thursday morning. There's no schedule yet for when Buckle will deliver her verdict.Blair RhodesReporterBlair Rhodes has been a journalist for more than 35 years, the last 27 with CBC. His primary focus is on stories of crime and public safety. He can be reached at blair.rhodes@cbc.caAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}