{"id": "Saved from a dumpster, Winnipeg museum's new trove of Guess Who recordings could include unreleased music", "paragraph": "A huge find of old recordings by the Guess Who — recently saved from a trip to the city dump after more than a decade in a Winnipeg garage — is finding a new home at the city's St. Vital Museum.The collection, which may include previously unreleased music from one of Winnipeg's most famous bands, was salvaged by Winnipegger Tom Kowalsky this summer.He says he saved the materials just a day before they were slated to be thrown into the garbage.\"There has to be several pieces of music in here that have never seen the light of day,\" said Kowalsky, a local musician who has spent nearly 40 years in the city's music business.\"Who knows — maybe we'll find a little part of American Woman in another song and that's where it was born.\"That's the exciting part of going through this — there'll be many, many rough songs that ... we'll have the privilege of listening to for the first time.\"The collection, made up of more than 100 pieces, includes master tapes of Guess Who recordings, recordings of live performances, video of the group's appearances on U.S. television, and tapes from band practices dating back to the '70s.Kowalsky says the boxes of material had been sitting in a city garage for years before the owner needed to reclaim the space and decided they had to go.He thinks the collection originated with a former band member who needed a place to store it during a move.\"Somehow these recordings moved to someone close to the band, who thought perhaps they would do something with them and ended up leaving them in a relative's garage for what was supposed to be six months and turned into just over a decade,\" he said.\"Of course, when someone's had their stuff in your shed for that long, you need to get it out of there.\"Out of sheer fear and hope that this wouldn't go into the dumpster the said people in possession called me — literally the day before the big chuck into the dumpster.\"That was back in July, and after months of looking for a proper home for the treasure trove of local music history, Kowalsky found out the St. Vital Museum already has a Guess Who exhibit.The museum was happy to accept the collection, which Kowalsky delivered Saturday.\"I think it's just fabulous that it was found and it's going to be preserved,\" said museum president Bob Holliday.\"We're just glad that it was found and not thrown in the garbage.\"Now Kowalsky and museum staff are going through the lengthy process of identifying the music.Kowalsky says the process will take some time because of the number of tapes — many of which can only be played on outdated devices, which the museum has yet to locate.Eventually, the museum hopes to digitize the collection and add selections to its display, which already includes some of the band's awards, and platinum and gold records.\"People are going to be able to get a glimpse into our history,\" said Kowalsky.\"These are pieces of a puzzle and now we're putting the puzzle together to get the whole picture.\"With files from Thomas Asselin.More from CBC Manitoba:Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}