{"id": "Hockey Night in CanadaJets top Coyotes with balanced attack ", "paragraph": "Jacob Trouba was glad to see some different names on the scoresheet Saturday.Trouba's name appeared three times on the scoresheet for a career-high trio of assists, while fellow defencemen Morrissey and Myers also had an assist each. Kyle Connor contributed two helpers. Morrissey and Connor are tied for the team lead in points with seven. \"When everyone gets a goal, it feels pretty good when they score,\" Trouba said. \"It's good to see. You want to see everyone jump in and get in there. It's great to see a lot of names on the scoresheet.\" Jets defeat Coyotes in afternoon tilt: Making his second start of the season for the Jets (5-2-1), backup goalie Laurent Brossoit stopped 42 shots for his second victory.\"We had a little lull in the first [period] and he was there to back us up, especially on those penalty kills,\" Trouba said of Brossoit.\"Both games he's played he's been extremely good and when [Connor Hellebuyck's] been in, he's been good. You definitely can't look at the goaltenders and expect much more.\"Clayton Keller scored twice and Christian Fischer had one goal for Arizona (2-5). Oliver Ekman-Larsson chipped in three assists.Antti Raanta made 27 saves for the Coyotes, who haven't won in Winnipeg since the Jets returned to Manitoba in 2011 (0-10).\"It's good to see some go in,\" Keller said. \"We played hard tonight. We stuck with it. We didn't give up. We were right there. We learned a lot about our team tonight.\"Arizona only had a total of eight goals in their previous six games.The game was tied 1-1 after the first period and Winnipeg led 3-1 after two.The Coyotes were outshooting the Jets 13-2 in the first period with nothing to show for it until Fischer took a pass from Ekman-Larsson and moved the puck around the front of Brossoit before flipping it into the net at 15:37. Winnipeg had two shots on goal at that point.The Jets went almost 14 minutes between their second and third shots, but made a late one count when Morrissey fired the puck from the point and it hit Lowry's blade and went in with 44 seconds left in the period.Arizona had a 16-6 shot advantage in the opening period and went 0 for 2 on the power play.\"Having 16 shots in the first period gets you into it right away,\" Brossoit said. \"But to be honest, I thought even with 16 shots, and they had the majority of the play in our end, I still thought we kept them to the outside and our [defensive] core made it relatively easier on me than the previous game.\"Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}