{"id": "Bullets narrowly miss Toronto boy, 8, as he goes to buy candy", "paragraph": "An eight-year-old boy who was caught in a hail of gunfire in Toronto's Jamestown neighbourhood Saturday night has told CBC Toronto that he was out to buy his friend some candy when shots rang out.CBC Toronto is withholding the boy's name because he is an underage victim of crime.Police released security camera footage of the incident Wednesday. It shows the boy crossing the street after another male. A white SUV then pulls up, with one of two shooters firing in the direction of the boy. The boy runs and hides in an alcove. One person could be seen on the video coming back to pick up a magazine from the gun.Police aren't able to confirm if the other male was the intended target. They also say there is a possibility that the shooting was a random gang shooting  — where a gang member would enter an area and shoot at someone randomly. \"This is absolutely disgusting that we're here watching an eight-year-old possibly being a target and being shot,\" police Supt. Ron Taverner told the media Wednesday. \"It's very outrageous that this has taken place in our community — that people have a total disregard for human life, for children playing in an area.\"Police said earlier that the incident happened in the area of Jamestown Crescent and John Garland Boulevard on Saturday shortly after 9:30 p.m. and that a group of young people was present. Taverner said Wednesday that five to seven children were playing a game called Hide from the Black Car there.\"What that game was, was hiding from black SUVs that might come down the street because traditionally that's the type of vehicle that the shooters have been in that have shot up in that area previously,\" he said. \"It's pretty disgusting to think that young kids that age are playing a game like that.\"No injuries were reported in the shooting.The boy's mother says she hears gunshots in the area all the time. \"I definitely want to get out of here. I didn't want to come here in the first place. I had no choice. I had to move here. Six years now, and it hasn't stopped. It's just getting worse,\" she said. She says she has three kids, and her son is the youngest. She no longer feels safe. \"They see my son right there, and they're still firing shots. They don't care if it had hit him. They don't care.\"Police say they are looking for two shooters who arrived in the white SUV, and the vehicle's driver. The area has been canvassed, police say. Police believe at least two weapons were used. None has been recovered, but 15 shell casings were recovered from different calibre guns.Taverner said police have been in contact with the boy and his family and have been offered victim services. \"He's doing fairly well. Obviously, he and his family are very upset, concerned,\" he said. \"We're continuing to reach out to them and make sure that they're continuing to do OK. But you can imagine how traumatic an experience this is.\" Police say one suspect is described as a black male with a medium build wearing a dark-coloured jacket, a hoodie and dark pants.They describe the suspect vehicle as possibly being a white 2010 or 2011 Toyota Rav4 with a sunroof.Police are asking for the vehicle's driver and witnesses to come forward by contacting police or Crime Stoppers.\"It's a miracle that this young boy wasn't struck,\" Taverner said. \"We want to find out who these individuals are.\"With files from Ali ChiassonAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}