{"id": "IOC stands firm on financial contribution should Calgary win 2026 Olympic Games", "paragraph": "The International Olympic Committee won't contribute more than the $1.2 billion already committed to Calgary if the city wins the bid for the 2026 Winter Games.Alberta Premier Rachel Notley suggested earlier this week that if the IOC wants Calgary in the race for the 2026 Games, it could pony up extra cash to cover any financial gaps.The IOC's executive director of Olympic Games pointed out the $1.2 billion in cash and services is more than the $700 million the province is willing to spend on Calgary hosting the Games.\"The IOC has committed $925 million US, which equates to $1.2 billion (Cdn) at the current rate,\" Christophe Dubi said.\"This is what we can commit at this point in time, which is a substantial contribution when you compare to the local authorities and their commitment at this stage.\"Dubi was in Calgary meeting with business leaders, politicians, Treaty 7 First Nations representatives and media ahead of a Nov. 13 plebiscite.Calgarians will be asked to vote on whether they want the Games a second time after hosting the 1988 Winter Olympics with Canmore, Alta.The plebiscite's result is non-binding on city council, which could pull the plug on a bid at any time.The IOC has invited Calgary, Stockholm and a joint Italian bid from Milan and Cortina d'Ampezzo to be candidates for 2026. The IOC will accept bids in January followed by the election of the host city in June.Of the estimated $5.2 billion that the Calgary 2026 bid corporation estimates it would cost to host the Games, the city, province and Canadian government have been asked for a combined public investment of $3 billion.While the 2010 Winter Games in Vancouver and Whistler, B.C., cost roughly $4 billion to run, the B.C. government's spending on a rail line to the airport and a convention centre completed in time for those Games brought the total to $7.7 billion.Calgary 2026 chief executive officer Mary Moran says since these would also be Canada's Games, Calgarians have been entrusted with making a decision on behalf of the country.\"Calgarians get to make the decision for Canadians,\" she said. \"This will be the Canadian Games. We saw it in Vancouver, we saw it in '88. It is a great nation-building exercise.\"The province has stated what it will contribute, but the city won't declare its share until the Canadian government makes its number known.Under its hosting policy for international sporting events, the feds will contribute \"up to\" half the public investment, which would be a maximum of $1.5 billion in this case.Moran acknowledged Calgarians need to know how the taxpayer pie will be split before the vote, but emphasized hosting the 2026 Games would pump $4.4 billion into the local economy.\"Yes, we are waiting for one piece of information, which is how much will be split between the federal government and the City of Calgary,\" she said. \"That's the only piece of missing information.\"It is really important for Calgarians to understand it is a minimum of $4.4 billion coming into this community to do something great. Not just something great for the 50 days of the Games, but for our long-term future.\"A plebiscite in Switzerland killed a potential bid from the Sion region.\"We shouldn't be concerned about referendums. Democracy is healthy,\" Dubi said. \"Results are immensely important. We want a positive result.\"The 1988 venues still used for domestic and international competition and training are the foundation of a potential second bid.Calgary 2026 says upgrading them to Games readiness again would cost $502 million.The two new sports venues proposed are a fieldhouse and a 5,000-seat arena for a combined cost of $403 million.An athletes' village proposed near the downtown core would be turned into housing post-Games.Calgary 2026 says it has built $1.1 billion in operating and capital contingency funds into its budget to mitigate risk.Dubi said the two biggest misconceptions in Calgary surrounding a 2026 bid are risk and cost over-runs.\"Here, you have it all,\" Dubi said. \"You have the expertise, you have the experience, you have regular hosting and you have the venues.\"You have a team that's been extremely detailed in its work and that gives you safety about the cost because the numbers they (have) right now are not made up.\"There aren't going to be any cost over-runs here, I can tell you.\"Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}