{"id": "'Nothing left to order:' Calgary cannabis stores struggle with stock", "paragraph": "After the initial spark, Calgarians are continuing to shop for cannabis. But supply hasn't stayed steady enough for some retailers to keep regular hours. The week of Oct. 17, when marijuana became legal, one of the city's two retail stores scaled back its planned hours to ensure it wouldn't run out of strains. And now, some retailers have been forced to shut down temporarily while they wait for the next shipment to come in. Since then, more stores have opened, giving customers more options and locations to peruse. But the pickings are slim because of waning weed supplies across the province. Raj Birk, owner of Global Leaf in the city's northeast, said he closed up his store on Friday because he had only a few strains left to sell, and that didn't justify keeping his brick-and-mortar store open. \"It sucks that you have to turn people back, you know,\" he said. \"There's nothing left to order.\"Meanwhile, he's employed some staff to monitor stock online and check to see if there's more to order. He thinks the store will be shut for one or two weeks.From his understanding, every retailer will be allocated a set amount of stock from Alberta Gaming, Liquor & Cannabis (AGLC), so that all of the sellers have an equal opportunity to serve customers. Across town in Sunalta, Ashley Newman, owner of Queen of Bud, had to shut her doors for the weekend. Although the AGLC and licensed producers are doing the best they can to supply cannabis, she said, there's still a shortage. \"It's very disappointing for the business,\" she said. During her interview with CBC News, Newman took several calls from customers, apologizing that the store can't open up until 2 p.m. because of a shipment delay. She said she pays two people, one person during the day and one at night, to refresh the AGLC website to see when stock is ready to snatch up. But Newman said the province does only a weekly delivery and her store missed that deadline — even though there was no stock to purchase — so it took them two weeks to get a shipment they were expecting to have sooner. \"We're losing lots of money,\" Newman said. She said even when her stock arrives sometime this afternoon, she's not expecting to have enough supply to stay open, especially if the cannabis keeps selling at the rate it has been. \"It may last, and we might be OK, but sometimes they don't send the full order,\" she said. \"It's very frustrating, I feel awful.\" Newman said she prides herself on good customer service, great prices and a nice environment for pot shoppers. But the supply issues are a mark on her reputation as a retailer.In an interview earlier this month, Niaz Nejad, a vice-president with the AGLC, said the agency was doing what it could to keep the supply for retailers steady.It's not just a problem in Alberta; other provinces across Canada are also grappling with high demand and supply shortages. \"The real challenge is quite simply we're just not getting enough stock in from the licensed producers, and that's something that all provinces and territories are facing right now,\" said Nejad.The government estimated that by the end of next year, more than 250 retailers will be operating across Alberta.\"Everybody is having challenges, everyone is trying to supply a finite amount of cannabis for a very, very, large initial demand.\"​At that time, she said there was no telling how much time it would take to even out the supply and pace it with demand.With files from Reid SouthwickAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}