{"id": "Manitoba government hasn't become increasingly adversarial, Pallister insists", "paragraph": "As the Manitoba Progressive Conservatives were meeting in Brandon over the weekend, Premier Brian Pallister denied his government is looking to pick fights with the province's political partners.\"If two people are always in agreement, one isn't thinking,\" Pallister told CBC after his speech Saturday at the PCs' annual general meeting. \"We're standing up for Manitoba's interests …​ sometimes we'll have to disagree.\"Pallister was referring specifically to ongoing disputes with the federal government over the imposition of a carbon tax and with the Manitoba Metis Federation over the termination of a pair of agreements.\"I've been married now for three decades. If my wife and I were always in agreement, I think that would be a strange marriage,\" Pallister said.The province last week cancelled the Turning the Page agreement with the MMF and Manitoba Hydro, which laid out terms for $20 million worth of payments to the federation over 20 years. Earlier this year, Pallister cancelled another deal between the three parties, worth $67 million. On Saturday, Pallister reiterated his position that the Turning the Page deal was really a payoff to prevent the MMF from speaking out against Manitoba Hydro projects such as the Bipole III transmission line and Keeyask generation project.\"I have too much respect for Metis people to continue the old outdated approach the previous government used, of paying them to be silent,\" Pallister said, adding the money involved in the deal represents only \"a small fraction of the relationship\" with the Metis people.The premier expressed similar sentiments with regard to a carbon tax. Although he continues to believe the federal government has unfairly judged Manitoba's green plan on the absence of a price on carbon, he said it hasn't poisoned the relationship between the two levels of government.\"We have disagreement on the carbon tax issue, but we agree and are working together on housing issues, agricultural policy, vulnerable children, many, many other issues.\"Pallister also said it's still too premature to say whether or not the province will follow Ontario's lead and intervene in Saskatchewan's court reference case, challenging the federal government's right to impose a carbon tax on provinces that don't comply with its climate change plan.If his government does decide to intervene, Pallister said the case would be strengthened by what he called \"a tremendous, focused effort on getting a green plan for Manitoba\" as well as the \"billions of dollars\" already invested in such efforts.\"Should we be forced to go to court, I guess I would say we have a better case than other provinces do, to defend ourselves and make sure we have control over how we maintain our green reputation and how we strengthen it.\"With files from Gavin BoutroyAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}