{"id": "Indigenous people worry Saskatchewan trespassing plan may stoke racial tensions", "paragraph": "A Saskatchewan grandmother who was confronted by a farmer with a gun says changing trespassing laws probably won't stop crime but could increase racial tension.Angela Bishop, a Métis lawyer, was driving on a rural road in Alberta in September with her two grandchildren who are visibly Indigenous.Sask. throne speech promises new trespassing legislation, commercial driver trainingSask. review considers stricter rules for rural trespassingThey were looking for a place to get out, stretch and go for a short walk during a long drive to Edmonton. She noticed a vehicle driving up behind her, so she stopped.A man got out and started to yell at her to get off his road, she said, despite her attempts to explain why she was there. She said she spotted a gun inside his vehicle.Terrified for her grandchildren, Bishop said she tried to drive away — but the man pursued her.She eventually pulled over, called law enforcement and requested a police escort. Officers told her that, in fact, it was a public road and she could be there.As a rural land owner in Saskatchewan, Bishop said she can sympathize with frustration about property crime, but a life is more important.\"My concern would be that they believe they are legally entitled to take the law into their own hands,\" she said from Quintana Roo state in Mexico.The Saskatchewan throne speech last month included a reference to changing trespassing laws to \"better address the appropriate balance between the rights of rural landowners and members of the public.\"The government said in an emailed statement that Justice Minister Don Morgan is prepared to meet with Indigenous people to discuss their concerns.The province has already sought public input on whether access to rural property should require prior permission from a landowner, regardless of the activity, and if not doing so should be illegal.A lawyer representing the family of Colten Boushie, an Indigenous man fatally shot by farmer Gerald Stanley in August 2016, said she is worried the Saskatchewan Party government is engaged in political posturing which could stoke racial fear.\"Indigenous people aren't feeling safe that the authorities or the police are going to protect them or that they are not going to be shot at,\" Eleanore Sunchild said from Battleford, Sask.\"It seems like there's more of an approval to take vigilante justice in your hands, and if you are an Indigenous victim, nothing is going to happen to the non-native that shot you.\"Stanley was acquitted of second-degree murder after testifying that his gun went off accidentally. He said he was trying to scare away young people he thought were stealing from him. The Crown decided not to appeal.Sunchild said the throne speech sends the message that the farmer was right to shoot the Indigenous man and that trespassing fears are justified.Sunchild wonders what advice she would give her own children if they have car trouble or need help on a rural road.\"Do I tell them to go ask a farmer? I don't think so.\"Heather Bear, vice-chief of the Federation of Sovereign Indigenous Nations, said the Boushie trial and provincial response have many Indigenous people feeling afraid.Saskatchewan recently put out a request for proposals to buy 147 semi-automatic carbines for conservation officers.They currently carry sidearms as well as shotguns to deal with wildlife. Bear, who called the move disturbing and unnecessary, said it could mean more lives lost. Many conservation officers have negative views of Indigenous people and don't understand treaty rights, so arming them could be disastrous, she said.Environment Minister Dustin Duncan said the move is in response to a 2014 shooting in New Brunswick that killed three RCMP officers.\"For anybody to suggest that any member of any community ... is at greater risk because our conservation officers are now being deployed with the appropriate level of firearm ... I just don't think we need that type of commentary in the province,\" he said.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}