{"id": "Dwane Casey woke up thinking about NBA-best Raptors ", "paragraph": "Dwane Casey woke up Monday morning thinking about the Toronto Raptors.But the Detroit Pistons coach said if there was any trepidation about Wednesday's return to Toronto, it was more about facing the league's hottest team and less about being back in the place from which he'd been unceremoniously punted six months ago.\"It will be different being on that side of the bench but I would be disingenuous to say it's not going to feel funny,\" Casey said in a phone interview. \"But the reason I say I woke up this morning is because we stubbed our toe against Charlotte, and I thought about who we have next and it has to be the Toronto Raptors, and I thought 'Oh my goodness, they're a good team.'\"Any human being worth his salt will say it'll be a different feeling, a funny feeling, but I think once the game starts and they throw it up, it will be one of 82 and I'm sure it's going to be the same for the players from the other side too.\"The 61-year-old coach led the Raptors to a franchise-best 59-win season, but paid the price for their second-round dispatch by the Cleveland Cavaliers in the playoffs. A month after his firing, he won the Red Auerbach Trophy as the NBA's coach of the year, and signed a five-year deal with Detroit worth about $7 million US per season.Casey said he hasn't spoken to any Raptors since the season began — both because he has his own team to worry about, and out of respect for Toronto's season. But he's watched from afar, and feels proud of the growth he's seen in the players.During Monday's call, it was announced that Pascal Siakam was the Eastern Conference player of the week.\"I knew from the first day he worked out for us in Buffalo. He couldn't throw rice in the ocean out of a rowboat at that time,\" Casey said in his classic southern, homespun vernacular. \"But now to see him making shots and playing. The kid has an NBA motor, and I knew that, and his heart and spirit are in the right place. The sky is the limit for him.\"Much has been made of the success Casey's successor Nick Nurse has had splitting up centres Jonas Valanciunas and Serge Ibaka, having one of them come off the bench. It was noted Casey used a similar rotation against Cleveland in the playoffs.\"I thought that was something that would help open up the floor as far as the offence was concerned. And defensively . . . and so that was something we did last year and they've taken it this year, and used it to their advantage, so it's an effective weapon,\" Casey said.\"And Jonas has gotten better and improved each and every year. To watch him grow has been beautiful to see, just his maturity and his growth in the league, and everything's easier for him now, and he's letting the game come to him. So he's doing a good job there, and we've just got to figure out a way to slow both of those guys down on Wednesday night.\"Raptors guard Kyle Lowry told ESPN's \"The Undefeated\" last week that Casey's return will be strange. He had kind words for his former coach.\"It was an up-and-down one,\" Lowry said on their partnership. \"But he was like the nicest man in the world. I learned to respect what he did, how he came up and his approach to everything. He landed right back on his feet. So I'm happy for him.\"Casey and Lowry texted during the summer, and the coach has enjoyed watching Lowry play some of the best basketball of his career through 13 games.\"I'm proud of him also, the growth that he's had, and the all-pro season he's having so far,\" Casey said. \"Kyle made me a better coach, as far as learning to give and give in and listen and see different ways to skin a cat. I think vice-versa too. He's been a great leader for that organization and he's done a great job in his time there, and a lot of us owe him a lot for what he's done for that program.\"Casey had considered taking a year off from coaching, but said a phone call from Pistons owner Tom Gores spoke to the lifetime coach in him.\"He convinced me to get back in, I needed to be in, that I was a coach at heart, and when he made that pitch to me, the fact of how important, how I would miss coaching and that I needed to be in coaching, the game, that type of thing, I'd be empty without it, he's right,\" Casey said. \"I don't know what else I would do, just sitting out and not coaching basketball.\"Casey leads a 6-6- Pistons team that has missed the playoffs eight of the past nine seasons, and sees similarities in the Raptors squad he took over in 2011. He's enjoying working with Detroit's staff, including Ed Stefanski and Malik Rose, who he called an up-and-coming front office \"star.\"His wife and two kids have settled into the \"beautiful\" Birmingham/Bloomfield Hills area of Detroit. The city is a big-time sports market that includes an \"entire mix of everything, basketball, football, baseball, hockey, college sports.\"He had dinner with University of Michigan's athletic director Warde Manuel, and the Pistons held training camp there with the help of coach John Beilein. Spartans coach Tom Izzo was there when Detroit played an exhibition game at Michigan State.\"I knew them all in my college coaching life so it's different to step back and visit with them now. It's fun to be around, fun to see their teams practice and play and have them watch our teams practice,\" Casey said. \"It's an excellent market.Clippers owner Steve Ballmer, who grew up in Detroit, recommended the school that Casey's two kids attend.\"Then Isiah Thomas tells me too,\" Casey said.\"I love that the former players are still around and involved. Rick Mahorn is with us, around us every day on the broadcast. Those guys still support the team. That's a big boost for us. Hopefully once we go into free agency, their words and encouragement will be a big plus for us in the free agent market.\"The Raptors don't travel to Detroit until March 3.To encourage thoughtful and respectful conversations, first and last names will appear with each submission to CBC/Radio-Canada's online communities (except in children and youth-oriented communities). Pseudonyms will no longer be permitted.By submitting a comment, you accept that CBC has the right to reproduce and publish that comment in whole or in part, in any manner CBC chooses. Please note that CBC does not endorse the opinions expressed in comments. Comments on this story are moderated according to our Submission Guidelines. Comments are welcome while open. We reserve the right to close comments at any time.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}