{"id": "Nancy Pelosi gets an unlikely endorsement for speaker — from Donald Trump", "paragraph": "As a standoff among Democrats over whether to return Nancy Pelosi to the House speaker's chair continued into the weekend, the California Democrat received an offer for help from an unlikely place — the White House.In a bizarre move, U.S. President Donald Trump said Saturday he could \"perform a wonderful service\" by rounding up Republican votes for Pelosi's candidacy.Trump said he genuinely likes Pelosi and looks forward to working with her, but it's an almost unheard of proposition from the leader of the party that villainized the Democratic leader on the campaign trail.\"I would help Nancy Pelosi if she needs some votes,\" Trump told reporters as he left the White House for a trip to survey the devastation from the California wildfires. \"I like her, can you believe it? I like Nancy Pelosi. She's tough and she's smart, but she deserves to be speaker, and now they're playing games with her, just like they'll be playing with me.\"Pelosi, who was the first woman to become speaker and served from 2007 to 2011, was certain that she will hold that post again. Last week she dismissed a suggestion that she could rely on Republican support to help amass the House majority needed in January when Democrats take control of the chamber after this month's election victory.\"Oh, please, no, never, never, never,\" she said.Trump went so far Saturday to tweet the name of one Republican congressman, Rep. Tom Reed of New York, who has said he could be open to backing Pelosi if she committed to changes that would shift some power from the House leadership. Reed is a part of the Problem Solvers Caucus, whose members have broached the idea as a show of bipartisanship to help reform Congress.\"The president understands Congress is broken,\" said a spokesperson for Reed following the tweet. Reed has said for months \"he's open to voting for anyone who promises to reform the House of Representatives for the American people.\"Pelosi was expected to work the phones from California during the Thanksgiving break after meeting privately with newly elected Democrats who could be crucial to her bid. Her foes were equally confident they have the votes to stop her ascension.\"I think chaos is good if it's productive. I think chaos is bad if it is too disruptive and it divides us too much,\" said Rep. Pramila Jayapal, a Democrat from Washington and co-chair of the Congressional Progressive Caucus, whose leaders were upbeat after meeting with Pelosi this past week.Newly elected lawmakers indicated they were having good meetings with Pelosi, though few said the talks had changed their minds.Watch: There are divisions in the Democratic Party over whether Pelosi should be Speaker:\"It isn't about her, it's about wanting new leadership,\" said representative-elect Abigail Spanberger of Virginia, a former CIA operative who defeated Tea Party Republican Rep. Dave Brat in suburban Richmond. \"There isn't anything she could say, because the decision isn't about her.\"Represenative-elect Jeff Van Drew of New Jersey said he had a \"pleasant\" meeting, but remains a \"no\" on Pelosi. He is among 17 Democrats who have signed on to a letter opposing her. Van Drew said they discussed his districts and which committees he'd like to serve on. \"I don't feel under pressure,\" he said.One question for some Democrats is what, exactly, Pelosi means when she says she intends to be a transitional leader, a bridge to a new generation. She has led the party for 15 years.Pelosi, 78, first became speaker after Democrats took control of the House in midterm elections during former president George W. Bush's second term. With former president Barack Obama, she was pivotal in passage of the Affordable Care Act in 2010.With a narrow Democratic majority, now at 231 seats in the 435-member House, Pelosi does not have much cushion to secure the 218 votes needed, assuming all Republicans vote against her, as expected. Some House races remain undecided and the Democratic majority could grow slightly.There is a chance the math could shift in Pelosi's favour if lawmakers are absent or simply vote \"present,\" meaning she would need fewer than 218 votes for an absolute majority.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}