{"id": "Trump says U.S. ending arms control treaty with Russia", "paragraph": "U.S. President Donald Trump says he will pull the United States from the Intermediate-Range Nuclear Forces Treaty with Russia.Trump says Moscow has violated the agreement, but provided no details.The 1987 pact helps protect the security of the U.S. and its allies in Europe and the Far East. It prohibits the United States and Russia from possessing, producing or test-flying a ground-launched cruise missile with a range of 500 to 5,500 kilometres.\"Russia has violated the agreement. They have been violating it for many years,\" Trump said after a rally in Elko, Nevada, on Saturday. \"And we're not going to let them violate a nuclear agreement and go out and do weapons and we're not allowed to.\"The agreement has constrained the U.S. from developing new weapons, but America will begin developing them unless Russia and China agree not to possess or develop the weapons, Trump said. China is not currently party to the pact.\"We'll have to develop those weapons, unless Russia comes to us and China comes to us and they all come to us and say 'let's really get smart and let's none of us develop those weapons,' but if Russia's doing it and if China's doing it, and we're adhering to the agreement, that's unacceptable,\" he said.U.S. National Security Adviser John Bolton was headed Saturday to Russia, Azerbaijan, Armenia and Georgia. His first stop is Moscow to meet with senior Russian officials at a time when Moscow-Washington relations remain frosty over the Ukrainian crisis, the war in Syria and allegations of Russian meddling in the 2016 presidential race and upcoming U.S. midterm elections.U.S. officials have previously alleged that Russia violated the treaty by deliberately deploying a land-based cruise missile in order to pose a threat to NATO. Russia has claimed that U.S. missile defences violate the pact.In the past, the Obama administration worked to convince Moscow to respect the INF treaty but made little progress.\"If they get smart and if others get smart and they say 'let's not develop these horrible nuclear weapons,' I would be extremely happy with that, but as long as somebody's violating the agreement, we're not going to be the only ones to adhere to it,\" Trump said.The U.S. president also said he is not satisfied with Saudi Arabia's explanation for the circumstances around the killing of journalist and government critic Jamal Khashoggi in Istanbul. However, the U.S. has no plans to stop selling weapons to the Kingdom as doing so \"would hurt us far more than it would hurt them,\" Trump said. With files from ReutersAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}