{"id": "'It was shocking': Pediatrician's sister testifies in incest trial", "paragraph": "The trial of a prominent Winnipeg pediatrician charged with incest got underway in a Manitoba courtroom this morning. Dr. Victor Chernick was charged with incest, buggery, indecent assault and two counts of gross indecency in January 2014. The incidents are alleged to have taken place between 1975 and 1979. Chernick, 82, has pleaded not guilty. The trial was originally set to start in November 2017, but was rescheduled due to a medical issue. Chernick had been admitted to hospital a week before the trial was originally supposed to start. On Wednesday, Chernick's sister Robin Tyler was called to testify. Crown attorney Debbie Buors questioned Tyler about her relationship with her brother and how she first heard of the allegations against him.Tyler said in the early 1980s, Chernick's daughter Sharon and another family member came to visit her in San Francisco and told her about the allegations of molestation. \"It was shocking,\" said Tyler, adding she couldn't imagine it happening in her family.Tyler, 76, also testified that after hearing of the allegations she called her other brother and later travelled to Winnipeg for a meeting with the accused and some other family members. Tyler could not recall the length of the meeting but said it happened at a Winnipeg hotel and that she told the accused to apologize for what he had done. Tyler told the court she heard him apologize in the meeting. She said she didn't go to police at that time because the family didn't want her to, however she said she did meet with family therapists. Defence lawyer Sarah Inness questioned Tyler's recollection about both the meeting and the call Tyler testified that she made to one of her brothers.Richard Chernick and his sister Sharon Chernick filed a civil lawsuit in 2014 against their father, alleging he \"sexually, physically, emotionally and mentally abused, assaulted and traumatized\" them, and committed incest and gross indecency against them for years.In the civil action, Dr. Chernick denied the allegations and said they are made out of spite and ill will, and result from \"fertile imaginations.\" This trial is expected to wrap up next Friday. With files from Dean Pritchard, Vera-lynn Kubinec and Katie NicholsonAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}