{"id": "Rivals for mayor's seat start 'big, big push' for votes on last election campaign weekend", "paragraph": "With fewer than 48 hours to election day, the two top candidates for the mayor's seat spent Saturday traversing the city and preparing their respective ground games before the big vote. John Tory and his chief rival, Jennifer Keesmaat, canvassed throughout the day making multiple stops to speak with residents and make their final pitch to voters. \"This weekend is all about ensuring that people are getting out to vote, knowing that they can change their city to make it better,\" Keesmaat said. The incumbent, Tory, made stops in Scarborough, Parkdale, Beaches-East York, Thorncliffe Park and Willowdale. For her part, Keesmaat visited the Annex, Scarborough, North York, Etobicoke and downtown. Recent public opinion polls indicate that Tory is heading into Monday's vote with a considerable double-digit lead over Keesmaat, a former chief city planner under former mayor Rob Ford and Tory himself. But Tory said he's taking nothing for granted.\"Does it look like I'm coasting?\" he rhetorically asked reporters from an east-end cafe, adding that his messaging has remained consistent throughout the long and turbulent campaign.\"I want to go down to city hall to get things done ... I'm too old to play games. I just want to get things done,\" he said. Joining him at the cafe was Beaches-East York council candidate Brad Bradford, one of just a handful of candidates to receive an endorsement from Tory. In a surprise move last week, Tory also threw his support behind Ward 12 St. Paul's candidate Joe Mihevc. Mihevc, an incumbent, is running in a close race against another city council veteran Josh Matlow. The two were pitted against one another after the provincial unilaterally reduced the number of council seats in Toronto from 47 to 25. Tory acknowledged he will need to build a majority coalition on council if he hopes to pursue his policy agenda. \"I want to have a council that includes people like Brad Bradford, who will help me get things done. Building the transit — we've got the plan, we've got a good chunk of the money, we've just got to build it now. And the same with housing,\" he said. The unexpected change to the size of city council during an ongoing election threw several races into chaos and had some critics wondering if Premier Doug Ford has other plans for Toronto once a new council is elected.Tory said Saturday that he'll have no problem working with Ford to advance Toronto's interests. \"I will take him on if I have to — if he is hurting the interests of Toronto. That's my job, to stand up for Toronto, if I'm the mayor,\" he said. One of the biggest critics of how Tory handled the cut to council was Keesmaat herself. Indeed, she registered to run at the last minute, the day after media reported on the province's plan.She said that she's heard from voters in search of an alternative to another Tory term in office.\"I've been hearing from residents of this city that they are excited for change,\" Keesmaat said. \"We have a phenomenal opportunity as a city to be future-oriented and start building a city that is for absolutely everyone.\"The former bureaucrat has positioned herself as the truly progressive candidate with big city-building ideas, arguing that Tory has failed to deliver on issues like transit and affordable housing. Among her most ambitious proposals is to use three dwindling city-owned golf courses to build new affordable housing units, as well as properties that would be classified as \"rent to own.\" Part of that program would be funded by a tax on luxury homes costing more than $4 million. Keesmaat said that her team is making a \"big, big push\" over the weekend to try to close the gap on Tory. Voters go to the polls on Monday. With files from Talia RicciAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}