{"id": "Health officials investigate salmonella outbreak in 5 provinces", "paragraph": "Public health officials in five provinces are investigating a salmonella outbreak that has affected 45 individuals.The Public Health Agency of Canada (PHAC) said that as of Oct. 19, 37 laboratory-confirmed cases of Salmonella infantis illness were being investigated in British Columbia, with five cases in Alberta, and one each in Saskatchewan, Manitoba and Quebec. The individual from Quebec reported travelling to B.C. before becoming ill, a news release says.NEW OUTBREAK: Cucumbers and other potential sources of illness are being considered in the ongoing investigation into Salmonella illnesses in western Canada. As the investigation evolves we will keep you updated. Learn more: <a href=\"https://t.co/rlaKJYRWLI\">https://t.co/rlaKJYRWLI</a> <a href=\"https://t.co/oMVUSgWldx\">pic.twitter.com/oMVUSgWldx</a>Many of the individuals who became sick reported eating cucumbers, but other potential sources are also being considered. PHAC didn't give any other details on where the foods that may have been behind the outbreak were purchased.Nine people required hospitalization, but no deaths have been reported. All incidents occurred between mid-June and late September. The health agency said the outbreak appears to be ongoing, as illnesses continue to be reported.The Washington State Department of Health said Friday it was investigating six cases of salmonella infections there.In a statement, the agency said five of the six people reported buying and eating English cucumbers from various Costco stores in Washington.The cucumbers linked to the illnesses were sold in three-packs of individually wrapped cucumbers.6 Salmonella illnesses are linked to English cucumbers sold (individually wrapped - 3 packs ) at Costco locations in WA. If you bought these between Aug 18-Sep 10 and still have them in your fridge, throw them away; don’t eat them. <a href=\"https://t.co/c2oTbzqPeW\">https://t.co/c2oTbzqPeW</a> <a href=\"https://t.co/lUGO2u5ARQ\">pic.twitter.com/lUGO2u5ARQ</a>PHAC said it is working with the U.S. to determine whether there are commonalities between these two events that can help to identify the source of the Canadian outbreak.Consumers are reminded to follow safe food-handling tips including:It can take several weeks from the time a person becomes ill to when the illness is reported and testing confirms a link to the outbreak.Symptoms — which can include fever, chills, diarrhea, abdominal cramps, headache, nausea and vomiting — usually last four to seven days. In healthy people, salmonellosis often clears up without treatment but severe illness and hospitalization may occur.People who experience symptoms, or who have underlying medical conditions, should contact their health-care provider if they suspect an infection.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}