{"id": "PQ holds campaign 'post-mortem', tries to chart course back from the brink", "paragraph": "Jean-François Lisée says the Parti Québécois' recent election debacle wasn't his fault.\"I think one of the paradoxes of this campaign is that we ran a good campaign, but we didn't win,\" Lisée said.The former leader instead blames October's result — which saw his party go from 28 to 10 seats in the National Assembly and lose official party status — on Quebecers' desire to get rid of the Liberals at all costs.Lisée says voters saw François Legault's CAQ as the best \"tool\" to accomplish that goal, despite his efforts to woo them to the PQ side.\"It says a lot about the strength and the willingness of the electorate to try a new party to govern,\" said Lisée.But that feeling was not unanimous among PQ members who gathered on Saturday afternoon at Collège de Maisonneuve in Montreal for a campaign post-mortem.About 300 people — MNAs, losing candidates and riding association presidents — participated in the closed-door meeting, which is mandatory in the 60 days following an election, according to the party's statutes.Interim leader Pascal Bérubé, the MNA for Matane-Matapédia called the party's campaign \"not that good.\" He said the first thing the PQ needs to do is do an inventory of what worked, and what didn't.One thing that didn't work, according to the party's youth wing president, was Lisée's surprise attack on Manon Massé, the co-spokesperson of Québéc Solidaire.\"I think it surely didn't help, especially on campus and with the youth,\" said Frédérique St-Jean. \"Many of the youth like Québéc Solidaire.\"During the second French-language debate, Lisée went off topic during a question about health care and instead confronted Massé​.He suggested Massé was not the real leader of QS and that someone was pulling the strings behind the scenes.\"It's doing politics negatively and that's what we tried to go away from,\" said St-Jean.Party members also pointed to the decision to put sovereignty on the back burner as a mistake.During the campaign Lisée pledged a PQ government would not hold a referendum on Quebec independence in a first mandate.Some delegates said that move deflated sovereignist spirits and fractured the coalition of pro-independence voters who have traditionally backed the PQ.\"By pushing back the date of independence people didn't see us as a real pro-independence party,\" said Nicolas Marceau, former PQ finance minister under Pauline Marois, who lost his seat in Rousseau to Louis-Charles Thouin of the CAQ.\"The identity of the Parti Quebecois was no longer clear to voters,\" Marceau said.Saturday's debrief session started with words from party president Gabrielle Lemieux and a speech by Bérubé who invited the party's 10 remaining MNAs to join him on stage.The small contingent was a far cry from the party's glory days, when leaders like René Lévesque and Jacques Parizeau led the PQ to majority governments.There was also a moment of silence for former leader and premier Bernard Landry who died on November 6 at the age of 81.With Lisée out, the PQ will need to find a new boss. Bérubé says he won't run for the leadership.Lisée's deputy leader during the campaign, Véronique Hivon, is seen as a potential successor.Hivon — who held onto her seat in Joliette this election — showed an ability to fire up the sovereignist base during speeches on the campaign trail.The 48 year-old is also seen as being more open to working with Québéc Solidaire.On Saturday, Hivon wouldn't comment on her leadership aspirations: \"What I want right now is for us to give us time,\" Hivon said.\"The last thing we need to rush is into leadership questions and a leadership campaign.\"Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}