{"id": "Canada slides into 1st place at FIFA U17 women's World Cup", "paragraph": "Captain Jordyn Huitema scored in the 59th minute and Canada went on to a 2-0 win over South Korea on Saturday to remain undefeated at the under-17 women's World Cup.The win moved the Canadians into first place in Group D with Spain and Colombia playing later Saturday.Watch highlights from Canada's big win:\"We played a very strong South Korean team and I think we saw that in the first 45 minutes. They definitely were pinning us back in our half in the first half,\" said head coach Rhian Wilkinson. \"This is a team I'm so proud to be the coach of, obviously there was a red card but they also turned the game around and showed who they really were; resilient. Fantastic team performance today.\"After a corner, Huitema's volley of the deflected ball arced over the head of Korean goalkeeper Jiyeon Kang. However, Huitema saw a red card less than 10 minutes later after a mid-air challenge and Canada went down to 10 players.Lara Kazandjian got Canada's insurance goal in the 74th minute when her 20 yard blast after some high Canadian pressure won the ball also went over the head of Kang.\"It's always an honour to represent Canada,\" said Kazandjian, who was named player of the match. \"I wouldn't have been able to accomplish what I did today without the team's belief and they were really strong physically and emotionally.\"To encourage thoughtful and respectful conversations, first and last names will appear with each submission to CBC/Radio-Canada's online communities (except in children and youth-oriented communities). Pseudonyms will no longer be permitted.By submitting a comment, you accept that CBC has the right to reproduce and publish that comment in whole or in part, in any manner CBC chooses. Please note that CBC does not endorse the opinions expressed in comments. Comments on this story are moderated according to our Submission Guidelines. Comments are welcome while open. We reserve the right to close comments at any time.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}