{"id": "Montreal's Black Watch regiment treasures WW I Victoria Cross", "paragraph": "Standing inside the Royal Bank's vault on the second floor of Place Ville Marie, Col. Daniel O'Connor, honorary colonel of the Black Watch of Canada, holds a dark blue safe deposit box.Compared to the other treasures locked away in this vault, the contents of O'Connor's box are relatively scant.All that's inside is a bit of slightly oxidized bronze and a few papers.But when O'Connor opens the box, the man next to him, Black Watch honorary Lt.-Col. Bruce Bolton, lets out a gasp.\"There it is,\" he says. \"It makes your heart palpitate.\"The regiment agreed to show the original to CBC Montreal as it prepared to mark the 100th anniversary of the end of the First World War on Nov. 11.Around 100 Black Watch members will take part in a ceremony next Sunday in Mons, Belgium, a town the regiment helped liberate just hours before the Armistice.For Bolton and O'Connor, it's the first time they've set eyes on the medal in more than a decade.It is the first Victoria Cross ever awarded to a Canadian-born soldier serving in a Canadian unit in the war, Lance-Cpl. Fred Fisher.\"He never got to wear it,\" Bolton and O'Connor say, in turn.They don white cotton gloves before lifting the medal from its case.One side is embossed with the words, \"for valour.\" A date — April 23, 1915 — is engraved on the other.Fisher was just 19 — a quiet, slightly uptight kid from Westmount, Que. — in the middle of the killing fields of the First World War.The son of a banker originally from St. Catharines, Ont., Fisher had been an avid athlete at Westmount High School (then known as Westmount Academy).He was a decent hockey player and swimmer. As captain of the high school football team, he had a reputation for being \"hard as nails,\" according to the school newspaper.The war started the day after Fisher's 18th birthday.It was the preferred unit of Montreal's Anglo elite.Most of its officers were millionaires.As his battalion trained in southern England, Fisher stood out from his fellow soldiers.One officer described him as \"a quiet chap, who never drank, nor swore, nor played cards, and some of the fellows may have thought he was a prig.\"He was given the chance to learn how to use a relatively new weapon of war, the machine gun.By the time the First Canadian Division was posted to Ypres in April 1915, Fisher headed a small detachment that operated a Colt-Browning .303.On April 22, 1915, the Germans pumped 160 tonnes of chlorine gas into the air at Ypres, a light breeze carrying the greenish-yellow cloud toward the Allied lines.It was the first recorded use of the gas in the war, and troops panicked as they began to be asphyxiated.An Algerian contingent protecting the Canadians' left flank was hit particularly hard and fled their position, leaving the Canadians exposed to the advancing Germans.A battery of 18-pound field guns, essential for keeping the Germans at bay, was at risk of falling into enemy hands.When the battery commander issued a desperate plea for help, Fisher volunteered and headed for the front lines in the early hours of April 23.Fisher and his team set up their machine gun in an abandoned building and opened fire on the Germans closest to the battery, forcing them back.But he also attracted enemy fire, and four of his crew were killed. Fisher hustled back to the Canadian lines to find reinforcements, took up a new position and resumed firing at the Germans.Fisher's covering fire allowed other Canadian soldiers to dismantle the field guns and retreat to safety. That's what earned him the Victoria Cross.As fighting continued along the Canadians' exposed flank, Fisher's detachment was redeployed to a trench.As he crawled out to set up the machine gun, Fisher was struck by a bullet.He died instantly.His fellow soldiers buried him in a makeshift grave, but his body was never recovered. He is one of roughly 27,000 Canadian soldiers, from all wars, for whom there is no known grave.Fisher's Victoria Cross was sent to his parents. Later that year, they received a handwritten letter from King George V.\"It is a matter of sincere regret to me that the death of Lance Corporal Frederick Fisher deprived me of the pride of personally conferring upon him the Victoria Cross, the greatest of all Military Distinctions,\" the letter read.Fisher's mother was fond of wearing her son's medal, the Toronto Star noted in 1916.After she died in 1946, Fisher's family gave the medal, as well as the king's letter, to the Black Watch.The storied regiment has kept Fisher's Victoria Cross in a bank vault for the past several years, taking it out only on special occasions — an increasingly rare occurrence because the medal is considered a valuable collector's item and there are always security concerns.A replica is housed in the regiment's headquarters on Bleury Street.Fisher's Victoria Cross continues to have a hold on Black Watch members, past and present.\"Seeing this and touching it is probably one of the most important experiences of my life,\" said Bolton, who has been involved with the regiment for more than 50 years.\"Memorabilia such as this become the heart and soul of a regiment,\" O'Connor said.Fisher's Victoria Cross helps younger Black Watch members identify with the regiment's long history, which reaches back to 1862.As a reservists, active Black Watch soldiers hold down day jobs and serve part-time at night or on weekends.But many have seen combat in recent years in places like Bosnia and Afghanistan, providing reinforcements to regular forces.\"They do so with pride, in part because of memorabilia such as this and the history of the regiment,\" O'Connor said.Jonathan MontpetitJournalistJonathan Montpetit is a journalist with CBC Montreal. He covers politics and social affairs.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}