{"id": "Tegan and Sara talk LGBT issues on Parliament Hill", "paragraph": "Indie recording artists Tegan and Sara Quin want to work with the Canadian government to help strengthen its relationship with the LGBT community — a message they brought to Parliament Hill on Tuesday.The pop duo met with several MPs, including Prime Minister Justin Trudeau, to encourage the government to address issues facing the LGBT community, such as underemployment, mental health concerns and discrimination.\"We really want to see Canada lead in terms of equality,\" said Tegan Quin in an interview with CBC News Network's Power & Politics. \"We're seen as a beacon of hope for LGBTQ people around the world and I think it would be a very sad and terrible thing to see us roll back rights, and we've already done it.\"Tegan described the debate over gay-straight alliances in Alberta and the abandonment of Ontario's planned new sex-ed curriculum as backward steps for LGBT rights. \"I think that we need to step up as adults, but also as people with a platform and power, and say we love our youth and we want to make sure they can feel their best while they're going to school,\" she said. The Calgary-born twins have openly identified as lesbian since their music careers began two decades ago. In 2016, they started the Tegan and Sara Foundation to raise awareness and funds to address inequalities facing LGBT women and girls. \"A lot of the work that we do with the foundation is about leadership, about mentorship, about opportunities that help strengthen our community and address some of the health and mental health concerns that we have for our community\" said Sara Quin.She told Power & Politics host Vassy Kapelos that their political advocacy on these issues came naturally.\"I don't think that this was a sort of light switch moment for us ... because we were so outspoken from the beginning, this feels like a natural fit to us and I think to our audience,\" she said. \"Now we're really part of a campaign of convincing everyone else … we want to be taken seriously as having long-term goals, long-term commitment.\"Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}