{"id": "'Trigger-happy' hunter killed beloved buckskin horse, owner believes", "paragraph": "A farmer in the Drayton Valley area worries that his 26-year-old buckskin saddle horse fell victim to a \"trigger-happy\" hunter who mistook it for a deer.Kevin Seely found his horse Rocky dead on his property on Nov. 4.That day he checked on his dozen horses on his property, which he uses for winter pasture, near Range Road 83 and Township Road 480A, southwest of Drayton Valley, Alta.When he noticed his horses being led by another and not Rocky, he assumed the worst.\"I just looked around and saw all the ravens and crows in the trees from the yard site,\" Seely said. \"I went down there and found my horse.\"It was dead from a bullet wound, about 300 yards away from where Seely's son lives.Seely suspects a hunter mistook his tan horse for a deer.\"I just think it's some trigger-happy hunter that doesn't know what he's shooting at until it's too late,\" he said.He reported the incident to the RCMP, but doesn't expect the person responsible to be found.RCMP confirm they are investigating.Seely's wife rode Rocky on trail rides in the mountains.The horse was gentle and reliable, which made him a good fit for children or inexperienced riders, Seely said.Rocky was born before Seely's children, who are now in their late teens and early 20s.The death has been upsetting for the family, he said.\"You hear about it all the time, people's horses getting shot,\" Seely said. \"It just never happened to me before.\"He hopes whoever is responsible regrets the killing and learns to make sure it doesn't happen again.@TravismcewancbcTravis.mcewan@cbc.caAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}