{"id": "Civil liberties group calls out federal government over appeal of solitary confinement ruling", "paragraph": "A civil liberties group is calling out the federal government for a perceived double standard, questioning how it can appeal a ruling against solitary confinement while at the same time saying it is trying to end the controversial practice. In the B.C. Court of Appeal in Vancouver on Tuesday, Ottawa will attempt to overturn a B.C. Supreme Court decision from January that found isolating inmates for an indefinite amount of time was unconstitutional.It comes a month after Public Safety Minister Ralph Goodale tabled legislation to end the use of solitary confinement in federal prisons.\"If you say that you're going to eliminate solitary confinement and the very same day you give instructions to your lawyers to preserve solitary confinement and fight against the ruling that found it unconstitutional … it makes absolutely no sense,\" said Josh Paterson, executive director the B.C. Civil Liberties Association, the respondent fighting to uphold the original ruling.\"When solitary confinement is indefinite, as it can be in federal prisons, some people are held for months, sometimes years in rooms that are no bigger than someone's small washroom, the court said that is unconstitutional,\" Paterson told The Early Edition host Stephen Quinn.\"There has to be a time limit and there has to be independent oversight over people who are being placed in these conditions.\"According to Goodale's bill, a new system called Structured Intervention Units (SIU) would be implemented to house inmates that are a danger to others or are in danger themselves.While in the units, inmates would be permitted to leave their cells for four hours a day, as well as have access to mental health care and other programs.But there is no cap on how long a prisoner can be kept in an SIU — a requirement of the B.C. Supreme Court ruling.\"As it is now, guards make lots of arbitrary decisions in relation to prisoners. We don't have any reason to trust that in a new system, with a new coat of paint and a new name, that prisoners won't have these opportunities taken away from them arbitrarily and that's why there needs to be [independent] oversight,\" said Paterson.A statement from Goodale's office says the government is committed to addressing the needs of the most vulnerable in the federal corrections system.\"[The proposed bill] will eliminate segregation and establish a fundamentally different system focused on rehabilitative programming and treatment. This new approach will allow us to maintain separation when necessary to maintain safety, and at the same time allow programming and human contact.\"The statement adds that the government is appealing the ruling in order to to seek judicial clarity on the issue.The B.C. Supreme Court ruling by Justice Peter Leask found that the law surrounding administrative segregation jeopardizes prisoner and staff safety and discriminates against mentally ill prisoners.\"I am satisfied the law … fails to respond to the actual capacities and needs of mentally ill inmates and instead imposes burdens in a manner that has the effect of reinforcing, perpetuating or exacerbating their disadvantage,\" Leask wrote.He added that under the existing rules a warden becomes judge and jury in terms of deciding how long to keep an inmate isolated.The appeal hearing is expected to last for two days.Listen to the full interview below:With files from Jason ProctorAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}