{"id": "Magic touch: Edmonton cafe builds gingerbread replica of Hogwarts castle", "paragraph": "If you believe in magic and Christmas and castles, then this gingerbread house might be to your taste.Garner Beggs, co-owner of Duchess Bake Shop, has built a replica of Hogwarts castle of Harry Potter fame.The almost-entirely edible creation (there's some foam used to give shape to the landscape) is a 1:100 scale model that took hundreds of hours and \"a whole bunch of different people\" to construct and decorate, Beggs said Saturday from the cafe at 10720 124th St.\"I was going to do a different project but my business partners put on a two-week, concerted lobby effort to convince me to do Hogwarts. Which I finally accepted, even though I knew it was going to be a daunting task,\" he said.But it was worth it, he added.This version of the turreted gothic castle is based on the model created for one of the Harry Potter movies. One of Beggs' employees had seen the model when it was on display in London and brought back photos that Beggs worked from.The building and decorating materials included sugar for the windows and lake, gum paste for the thousands of roof tiles, paint  made from food colouring and vodka, and ground cover created from mint, pepper and coffee, he said.The near-annual gingerbread house tradition at Duchess is an opportunity to inspire some Christmas generosity for the Bissell Centre.A donation of a pair of socks will get you an entry into a raffle which will be held on Jan. 4. The winner of the raffle will get to bring some friends to a castle-wrecking party to be held the following week.\"You can bring baseball bats and chainsaws and samurai swords,\" Beggs laughs. \"Whatever you want. And have a chance to destroy it. It should be a fun party.\"Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}