{"id": "Errol Greene inquest calls for more medical staff, better training to prevent future in-custody deaths", "paragraph": "The province should expand the availability of medical services at the Winnipeg Remand Centre and improve training for staff to help prevent more deaths like that of Errol Greene, counsel at the inquest into his death recommended on Tuesday.Greene died on May 1, 2016, after suffering two seizures while shackled in a cell at the Remand Centre.The father of three had epilepsy and was prescribed to take valproic acid on a regular basis to control his seizures, but he did not receive his medication during the nearly two days he spent at the Remand Centre after being arrested ​for drinking alcohol, which broke conditions of a prior mischief charge.Testimony at the inquest into his death wrapped up earlier this month. The inquest heard more than 20 days of testimony from corrections officers, nurses, and other inmates at the Remand Centre.\"What we heard was that Manitoba Corrections has dropped the ball, and they've dropped the ball in some cases horrifically,\" said lawyer Corey Shefman, who represented Greene's widow, Rochelle Pranteau, during the inquest.\"Their policies and procedures, their lack of training, the jeopardy that inmates are put through when they're in that facility, in the Remand Centre, is really unconscionable,\" he said.Counsel for the inquest provided 28 recommendations to the province, while Greene's family made 47 recommendations. Inquest counsel for the Crown was Keith Eyrikson.The inquest also heard recommendations from counsel for the Winnipeg Police Service, the Winnipeg Regional Health Authority and the John Howard Society.On Wednesday, it will hear recommendations from counsel for Manitoba Corrections.Recommendations from Greene's family called on the Manitoba government and the Manitoba Government and General Employees Union to apologize to Pranteau and the rest of the family for Greene's death and for \"the disrespect shown after the death of of Errol Greene.\"Shefman, on behalf of Greene's family, also called for a second inquest exploring the role of systemic racism in the disproportionate number of Indigenous people in custody.Some of the inquest's recommendations have already been implemented. A former Manitoba Corrections health director told the inquest earlier this month that a doctor is now at the centre seven days a week.The inquest counsel also recommended the province explore the possibility of having a doctor attend the centre twice a day. At the time of Greene's death, one-hour clinics were held once a day, Monday to Friday.The inquest previously heard there were no doctors at the remand after hours or on the weekend, like when Greene was in custody.The inquest counsel also recommended implementing a policy of having at least two nurses on duty 24 hours a day, seven days a week in the evening, and three nurses during the day.In order to ensure enough staff are available, the inquest counsel recommended exploring retention initiatives and incentives, and that hiring of nurses should be accelerated.During the inquest, one nurse who worked at the centre testified that nurses are often stressed and lack clear guidelines on handing out medication. She called for greater collaboration between nurses, doctors and pharmacists.The medical unit at the Remand Centre should explore getting medical accreditation for the facility on an expedited basis, the inquest counsel recommended.Shefman said this was the most important recommendation.\"They need to be monitored by an outside independent agency, which will take care of problems like the lack of training, the lack of standards, the lack of consistency in providing health care to inmates,\" he said.The inquest counsel recommended establishing a formal arrangement with an on-call pharmacist and drawing up a policy for the administration of medications, in consultation with the College of Registered Nurses.Nurses should also receive specific training to help them recognize and treat seizures, as well as training specific to working in an institutional setting.Other recommendations aimed to improve access to and recording of inmate health information.The inquest heard that nurses use hand-written cards to indicate when patients have received medication, and paperwork often isn't filled out properly.The inquest counsel recommended the province transfer responsibility for health services from Manitoba Corrections to Manitoba Health. This would enable easier access to charts and patient information for nurses working at the centre.The Remand Centre should also provide inmates with bracelets containing basic information, the inquest recommended.Inquest Judge Heather Pullan has six months to deliver her report.With files from Holly Caruk and Jillian Taylor.Cameron MacLeanWeb WriterCameron MacLean is a journalist living in Winnipeg, Man. where he was born and raised. He has more than a decade of experience covering news in the city and across the province, working in print, radio, television and online.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}