{"id": "Ottawa unveils plaque in Prince Rupert after historic cherry trees chopped down in error", "paragraph": "The federal government has dedicated a plaque to a former Japanese-Canadian resident of Prince Rupert after a federal work crew mistakenly chopped down several cherry trees he'd donated to the town nearly 60 years ago.The plaque was unveiled Thursday at a ceremony and attended by the descendents of Shotaro \"Tom\" Shimizu, a Japanese immigrant to Prince Rupert, who opened a hotel there in 1915 until it was seized by the federal government during the Second World War.\"I really think that is an acknowledgement that he actually did offer these trees to Prince Rupert back in 1959 and 60,\" said Henry Shimizu, the 90-year-old son of Shotaro.\"The only thing that is missing is the fact that the history of the trees were lost somewhere along the line,\" Shotaro told CBC's Daybreak North on Friday.Shimizu donated 1,500 cherry trees to the city of Prince Rupert in 1959 and 1960 following his release from an internment camp during the Second World War. The origin of the trees and why Shimizu decided to donate them is unclear, according to his family.In March of this year, several of the trees were chopped down, while others were aggressively pruned by contractors doing landscaping work outside the Department of Fisheries and Oceans building in downtown Prince Rupert .The destruction of the trees caused an uproar in the town among people who enjoyed the look of the trees as they bloomed in spring and summer.Greg Shimizu, Shotaro's grandson and the son of Harry, is making the most of the unfortunate incident. He said it has allowed him the opportunity to learn more about his grandfather's legacy.\"For us, as a family, coming out here is delving into our mythical family history,\" Shimizu said. He is also collecting wood from the downed trees and plans to transform them into bachi — drumsticks used to play taiko, Japanese percussion.Shimizu performs in a group called the Blooming Tree Taiko, a Japanese percussion group whose name is inspired by his grandfather's donation.The federal government says three remaining cherry blossom trees may still regain health and bloom once more.Listen to the full interview below:With files from Andrew Kurjata and Daybreak NorthAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}