{"id": "Hanwell mayor resigns amid dispute over salary clawback", "paragraph": "The mayor of Hanwell says he has opted to resign rather than face a potential confrontation with staff and council over a salary clawback imposed on him for missing monthly council meetings.Chris Melvin confirmed to CBC he is stepping down after two years as mayor of the rural community of 4,500, located about 15 kilometres south of Fredericton.Melvin initially made the announcement in a Facebook post. The mayor's salary is $15,000 a year, but Melvin said like most people in municipal politics, he needs another job to supplement his income.Because his work with an insurance company takes him out of town occasionally, Melvin said he asked council for permission to be absent for four of the 12 regular meetings. He said council denied his request, and because a bylaw ties the mayor's remuneration with attendance at the meetings, he stood to lose about $5,000.\"This issue has raised a potential confrontation between mayor, staff and council,\" Melvin wrote in his Facebook post. \"Such confrontation is unhealthy especially for the community. We need to focus on other matters — the upcoming budget season and the opening of the community and municipal building in the spring just to name a couple.\"Because of the position I'm now faced, I have opted to resign.\"Bylaw 02-2014 states that council members must attend a minimum of 80 per cent of rural community council meetings \"unless they have a valid excuse approved by the majority of council members.\" It states that \"any member who attends less than 80 per cent of rural community council meetings shall be penalized by having an amount equal to the percentage of absences deducted from his or her salary.\" In a statement addressing Melvin's resignation, Hanwell council said the mayor had already missed five of the last 13 council meetings before advising staff that he expected to miss more.\"We were left with no choice but to enforce our own bylaw,\" the statement said.Melvin said attending council meetings is the \"least burdensome\" of all the duties that come with being a mayor, which include sitting on boards, responding to emails and calls from constituents, attending \"countless\" activities and other functions.\"All of those activities are extremely important and are very rewarding. Unfortunately, according to a strict interpretation of the remuneration bylaw, they are irrelevant when it comes to measuring the performance of a mayor.\"In its statement, council recognized the other functions of mayor, but said \"all legislative decisions are made at council meetings, and their significance can not be understated. Council has an obligation to uphold our bylaws.... We ask our residents to respect our  bylaws and without question mayor and council have an obligation to abide by them as well.\" Hanwell council offered best wishes to Melvin, and said Deputy Mayor Dave Morrison will assume the duties of mayor until the position is filled in a byelection in December.Melvin, who served on council before being elected mayor of Hanwell in 2016, said in his post it \"was a very tough decision but I feel it's best for all involved.\"\"It has been a pleasure to serve Hanwell in various capacities since 2012. It meant a lot to me and my family.\"Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}