{"id": "'I love you, I'm sorry,' killer told ex-girlfriend before shooting her in the head, jurors hear", "paragraph": "Glenn Randall wailed and moaned in the moments after he killed his ex-girlfriend.\"I love you, I'm sorry,\" he could be heard saying on the 911 call Brenda Walker had made just before she was fatally shot.Walker's body would be found minutes later, face down on the kitchen floor in her Strathmore home. It was Jan. 6, 2015, weeks after the couple had broken up.Randall, her former boyfriend, is on trial for first-degree murder. On Tuesday, he testified in his own defence after his lawyer Michael Bates made an opening statement to jurors.'I shot her,' Strathmore man tells sister before divulging plan to die in suicide-by-cop scenario\"Mr. Randall takes responsibility for Brenda Walker's death,\" said Bates. \"[But] Glenn Randall never actually intended to kill Brenda Walker.\"Randall testified he doesn't remember going over to Walker's home and shooting her twice in the head.Walker's 911 call made moments before Randall began shooting her fills in some of his memory gaps.\"I have someone with a gun here,\" she tells the operator. \"He's threatening to kill me.\"Then, Randall's voice: \"I love you, I'm sorry.\"Three gun shots: \"Bang, bang, bang.\"\"Sorry,\" he says, then another shot. Randall can then be heard wailing. Jurors heard Walker and Randall had broken up because she was uncomfortable with the close friendship he'd maintained with his ex-girlfriend.Randall said he was \"sad and broken hearted\" that Walker had left a Strathmore bar with another man in the days before the killing.Randall said he attended the funeral for the wife of a close friend on Jan. 5, 2015. He said he was in pain, emotionally and physically, having recently been hospitalized for bowel issues. Randall had just missed his own mother's funeral weeks earlier.\"I just wanted to be able to hold Brenda,\" Randall told jurors.Randall's memories from the night he shot Walker work in snapshots: drinking red wine, snuggling his cat Minimix, pulling out his medicine bag. It skips over Walker's killing, picking up hours later and 90 kilometres away in Bassano at a gas station where Randall remembers fuelling up his truck.Then, more snapshots. Randall remembers his older sister's voice, then his younger sister. Both of them testified he called them at their New Brunswick homes to confess.\"Everything's a blur,\" he told an officer at the RCMP detachment in Strathmore after turning himself in.Randall called three women — including his two sisters — as he was driving around that night, according to prosecutors Lori Chambers and Jim Sawa.The sisters and police were able to convince him to surrender. After his arrest, investigators searched his truck and found four loaded firearms.Randall acknowledged to Bates on Tuesday that he did shoot and kill Walker that night but said he didn't plan it or want her dead.\"Brenda was beautiful inside and out; she was wonderful, caring and compassionate,\" he said, sobbing.\"We loved each other. She was my friend. I never wanted her gone. I don't know how this happened, I can't understand, it just doesn't make sense.\"On Wednesday, defence lawyers Bates and Jennifer Ruttan will call a forensic toxicologist who will testify about the effects of drugs and alcohol on the body. That will be the final witness in the trial.It's not yet clear when lawyers will make their final arguments and when the jury will begin deliberating.Justice Earl Wilson is presiding over the the trial. Meghan GrantCBC Calgary reporterMeghan Grant is the courts and crime reporter for CBC Calgary. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}