{"id": "Vigil calls for justice for man fatally shot by Montreal police in NDG", "paragraph": "​Family members and dozens of supporters marched through the streets of Notre-Dame-de-Grâce​ Sunday evening to demand justice for Nicholas Gibbs, a 23-year-old man who was shot by Montreal police last August.Gibbs' family released witness video of his death this week, while announcing they were suing the SPVM for just over $1 million, saying that police used excessive force.\"The police had no right to kill my son. If they were trained in the right way, they'd know ... how to handle a situation like that,\" Erma Gibbs, Nicholas' mother told the crowd.They gathered at the place he was killed, on de Maisonneuve Blvd and Montclair Ave.The video released this week showed police fired five shots, including while Gibbs had his back turned.Officers in the video yelled at Gibbs to drop a knife, but his family disputes that Gibbs had a weapon, saying that no weapon is visible in the video.A march is underway in NDG calling for justice for Nicholas Gibbs, the 23-year-old man shot and killed by police in August. <a href=\"https://t.co/XrXvBLrVq6\">pic.twitter.com/XrXvBLrVq6</a>His family says that Gibbs was in mental distress in the lead up to the confrontation with police. In the video, he can be heard asking police to shoot him.\"The video and witness statements clearly showed the police's inability to de-escalate,\" said Marlihan Lopez, of Black Lives Matter Montreal.Lopez compared Gibbs' death to the police shootings of Pierre Coriolan and Alain Magloire — both black men with mental health issues who were shot and killed by Montreal police.Gibbs' nephew, Jeremy Gibbs, wants police to face charges in his uncle's death and hopes that today's event will spark change.\"Who polices the police, you know what I'm saying? If I go and I kill someone right now, I'm going to jail. They'll bury me, right? But if they go kill someone, they can go kick their feet up and chill on their sofa? I think that's crap. And I feel like with a system like that, no one will ever trust the police and no one will ever trust the system,\" said Jeremy Gibbs.He added that when his uncle was first killed, he wasn't sure that anyone cared, but that the vigil tonight showed him that was not the case.Jeremy Gibbs (in front wearing a hat) wants police to be charged in his uncle’s death. His family has brought a lawsuit against the SPVM. <a href=\"https://t.co/pmETU2IMdX\">https://t.co/pmETU2IMdX</a> <a href=\"https://t.co/esl1H5sysp\">pic.twitter.com/esl1H5sysp</a>\"Now I'm seeing black, white, Indigenous people all together. This is how change starts. This is how we prevent another family going through what my family has had to go through,\" said Jeremy Gibbs.With files from CBC's Ainslie MacLellanAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}