{"id": "Recruitment in full swing for Indigenous workers at Voisey's Bay mine", "paragraph": "The Labrador Aboriginal Training Partnership (LATP) is on a tour of the Big Land over the next month, looking to recruit Indigenous workers to the Voisey's Bay underground mine.\"There's a lot of opportunity and reasons why people may come to us,\" LATP executive director Keith Jacque said.\"Whether they're finished up with the Muskrat Falls project or also to avail of all the opportunities … all expenses are covered for this.\"The surface mine at Voisey's Bay has been in operation since 2005 but earlier this year Vale, which owns the mine, announced its underground expansion would be going ahead with first production in 2021.There are currently around 50 miners on site according to Jacque, but that number will balloon to 250 once the operation is up and running, but workers will also be needed during the construction phase.\"It will roughly take about three to four years to build the two underground mines to get to the ore,\" Jacque said.\"So during this time there will be construction jobs available for underground miners and also trades-related occupations as well. \"LATP is a partnership between Nunatsiavut, Nunatukavut, Innu Nation and Vale. It has $24 million dollars in government funding to recruit and train Indigenous people from Labrador to work at the mine. \"You have to be a member of those three Aboriginal groups to avail of this training,\" Jacque said. LATP provides a number of opportunities for people thinking about getting into the industry, from underground mine visits, to a virtual mine simulator to a full four-week \"common core\" program in Sudbury, Ont., which will earn participants certification to work in an underground mine. \"All expenses are covered for personal protective equipment or childcare while they are away, and even while they're up there we put them up in a hotel and we'll help them with with meals,\" Jacque said.\"We try to eliminate all those barriers as much as we can.\"Pien Peters used to work at Voisey's Bay as a cook, he said, but now he wants to take a turn in the mine itself. \"I would like [to be] a heavy equipment operator or a labourer,\" Peters said.\"I'd like to explore a new job … a new road.\"Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}