{"id": "Runner struck by bus during 10 kilometre race at UBC", "paragraph": "A man participating in the Fall Classic 10 kilometre race on the University of British Columbia's Point Grey campus was struck by a transit bus Sunday morning. RCMP Inspector Ron Vermeulen said the man, a runner in his late 50s, wound up in the traffic lane in the 5700-block of SW Marine Drive and was struck by the bus at around 9 a.m. PT.He was taken to hospital for treatment of non-life threatening injuries. According to a statement from Eric Chene, the race director for RunVan, which organized the race, he is in stable condition and expected to make a full recovery.The annual run features three races, including races of five kilometres, 10 kilometres and a half marathon of 21 kilometres, with hundreds of participants.Part of the half-marathon course takes place on SW Marine Drive, a divided road with two lanes of traffic on each road.The statement from RunVan said the individual had paced a friend running the half marathon and left the course to return to the 10 kilometre race he had registered for.It said the accident did not occur on the race course itself.Chene wrote that a thorough review of what happened will be conducted in the coming weeks.Jon Major, a runner who participated in the Fall Classic for the first time Sunday, said he was running along the outer edge of the runners' lane when he heard the bus strike the victim. \"A bus went past me and then a couple of seconds later, I heard the noise of a bus hitting somebody. I looked up right away and saw the guy fall onto the ground,\" Major said. \"He was probably 50 feet away from me.\"Major said there were only traffic cones separating the runners from traffic. He said he was surprised by the lack of people managing traffic for the runners on the busy thoroughfare.\"We had cars going by doing their regular speed and nobody else was trying to slow them down or anything,\" he said.Major said people who appeared to be race volunteers and other runners came to the aid of the man and the race proceeded as normal. With files from Joel BallardAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}