{"id": "Jury selection begins Monday for U.S. trial of Mexican drug lord 'El Chapo'", "paragraph": "He is accused of having a hand in dozens of murders, of using his drug cartel to smuggle more than 200 tonnes of cocaine into the United States, even pulling off running the massive operation from behind bars. That's when he wasn't busy escaping from jail — twice.The almost-mythical criminal pedigree of Mexican drug lord Joaquin \"El Chapo\" Guzman, who was extradited in 2017 to face U.S. drug conspiracy charges, has sparked security concerns at his upcoming New York City trial that at times have drawn as much attention as the case's sensational allegations.A look at those concerns for a trial that is starting Monday with jury selection. Opening statements are likely Nov. 13.Prosecutors say Guzman was in the habit of ordering the killings of anyone who got in his way during his heyday in Mexico as boss of the Sinaloa Cartel.In his way now is a lineup of government witnesses who survived the wave of violence and are expected to give details about the ruthless way he kept power for 20 years in the cutthroat world of international drug trafficking. The defence says the witnesses are the true bad guys whose testimony shouldn't be trusted.The names of the witnesses have been blacked out on court documents, with prosecutors saying their identities need to be protected because their co-operation could put them in the crosshairs of a vengeful cartel. According to court papers, some are being held in special jail units for their protection, while others are in witness protection programs.The list of people who could turn up on the witness stand is long. Two standout possibilities are twin brothers Pedro and Margarito Flores, former Chicago-based narcotics wholesalers who did business with Guzman before their arrest in 2008. They agreed to co-operate and record phone conversations with Guzman about the size of shipments smuggled on boats and airplanes.In one, a voice identified as Guzman's asks, \"How much can you get rid of in a month?\"The now imprisoned brothers paid a steep price for flipping: Prosecutors say in 2009 their father was murdered in Mexico by a cartel hit team.At pretrial hearings leading to the trial, heavily armed federal officers and bomb-sniffing dogs patrolled outside. Anyone trying to attend the hearings was put through airport-style metal detectors at the courthouse entrance and at the door of the courtroom itself.The judge also agreed with prosecutors that the jury for the case should be kept anonymous, a measure typical in terrorism or mob cases where jury intimidation is a concern.No one's hiding the ominous nature of the case from potential jurors. Questions for them on an initial screening form ask if they've ever heard of \"El Chapo\" along with, \"Have you, or has anyone close to you, ever felt fearful of or threatened by people who you thought were associated with drug crimes?\"Jurors also will be escorted to and from the courthouse by federal officers and sequestered from the public while inside. As a reason, the judge cited prosecutors' contention that Guzman's cartel \"employs 'sicarios,' or hit men, who carried out hundreds of acts of violence, including murders, assaults and kidnappings.\"After Guzman was brought to New York, authorities here decided he should be housed in solitary confinement in a high-security wing of a federal jail in Manhattan that has held notorious terrorists and mobsters.Central to that calculation was Guzman's history of giving directions to his lieutenants from Mexican jails and credentials as a two-time escapee there. The second time was via a 1.6 kilometre-long tunnel dug to the shower in his cell.The logistical problem for his keepers: The case is being prosecuted across the East River in federal court in Brooklyn.For pre-trial hearings, authorities opted to transport him to and from jail by shutting down the Brooklyn Bridge to make way for a police motorcade that included a SWAT team and an ambulance, all tracked by helicopters.The judge indicated he thinks the time and expense involved would add up to a logistical nightmare — and an inconvenience for New Yorkers who rely on the bridge to commute — for a trial expected to last as long as four months. He said there would be adjustments, but didn't elaborate.There's now speculation that a special cell for Guzman has been set up in the bowels of the courthouse where he will spend the nights after his days in court.But no one is saying. For security reasons, of course.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}