{"id": "Booming culinary scene in N.L. under the spotlight since Anthony Bourdain visit", "paragraph": "Last fall, celebrity chef Anthony Bourdain took a tour of Newfoundland and Labrador's distinct food landscape, from a moose hunting expedition to an Atlantic fishing trip, to a traditional coastal boil-up.Accompanied by local chefs like Jeremy Charles, one of the masterminds behind Water Street staple Raymonds, the Parts Unknown episode showcased Bourdain's enthusiastic exploration of the island's cuisine as a culinary destination with more charm and character than just a stereotypical plate of fish and chips.Bourdain took his own life in June in France, where he was working on an episode of his show. The 61-year-old was a champion of simple, regional cuisine, including an intriguing list of uniquely Canadian dishes and venues.When the Newfoundland episode aired this spring, interest in the province as a vacation destination took a noticeable spike. Visits to NewfoundlandLabrador.com jumped 207 per cent during the episode's airtime, according to the provincial tourism department.While there isn't direct economic evidence of a 'Bourdain effect,' local chefs say the restaurant industry is booming unlike ever before.Chef Todd Perrin of the Mallard Cottage, one of the spots Bourdain visited while filming Parts Unknown, said he estimates tourists make up about 85 per cent of the restaurant's clientele from May through October. When the cold weather returns, so do the local regulars.After over 20 years working in restaurants, Perrin has seen the island's food culture \"skyrocket\" over the last decade, and he thinks the province has barely scratched the surface of the industry's tourism potential.\"Food has moved up the list a lot compared to, you know, whales and icebergs and all that stuff over the years,\" Perrin said.\"Newfoundland has lots of unique things, the food is one of them.\"The menu at Mallard changes daily, but Perrin said an annual fall favourite is serving up wild moose and partridge directly from local hunters to the table — a luxury other Canadian chefs don't have.The chance to taste game meat from the wild as opposed to a farm is a big draw for tourists who, more and more, \"want a taste of the place where they're going,\" said Perrin.Chefs are now giving local staples like cod tongues and cheeks a culinary treatment, proudly showing off the area's traditional roots while giving tourists a one-of-a-kind dining experience.\"We don't need to rely on everything that comes off a truck that came from the mainland somewhere … (it's) being proud of what we have here and highlighting that,\" said Perrin.Situated in a repurposed heritage building in the scenic Quidi Vidi fishing village, Mallard Cottage is positioned to give visitors a dining experience like no other.It feels like a visit to a cozy cottage in outport Newfoundland, but it's a 10-minute drive from downtown St. John's — something Perrin doesn't take for granted.\"There's not many places in the country where you can eat in essentially a national historic site which is an old Irish vernacular cottage, which is on the shore of the Atlantic ocean, which is in a quaint little fishing village with fishing boats and stages on the craggy cliffs, but you're basically in the heart of downtown St. John's,\" Perrin said.And depending on the day, guests are treated to homey touches like live music from friends of the owners. It's a Sunday staple at Mallard Cottage, and Perrin says he'd like to offer it more often, if it didn't mean taking a table away from eager paying customers.It's a friendly element that makes Mallard Cottage stand out from the pack, but it's just one of several quality restaurants that St. John's has to offer.Despite the many options, Perrin said the industry is less competitive, and more collaborative than it has been in years past, given the growing market as tourism numbers rise and more people choose to dine out.It's still a tricky business to be in, but Perrin said the industry is more welcoming than ever, as tourists fly in with an appetite for local food prepared with a loving, professional culinary treatment.\"They want to come and taste Newfoundland food in a Newfoundland environment,\" he said.\"I think that some of us have embraced that and are really taking it as far as we can. Hopefully we continue to go further.\"Read more articles on CBC Newfoundland and LabradorAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}