{"id": "Canadian Finals Rodeo kicks off in Red Deer", "paragraph": "It's the end of one era and the beginning of another as the Canadian Finals Rodeo kicks off its first year in Red Deer.Edmonton's Northlands Coliseum was home to the rodeo season finale for its entire 44-year history. The closure of the historic venue prompted a successful multi-year bid from Westerner Park and the Red Deer and District Chamber of Commerce.\"It's going live today, so the dream is coming true in Red Deer,\" said the chamber's interim CEO Rick More on Tuesday.\"We're bringing people from all over and now they're making the journey to central Alberta instead of up north. It's fun, we get to showcase our city.\"Competitors in eight events, including steer wrestling and bull riding, will be vying for $1.6 million in prize money — one of the largest purses on the Canadian rodeo circuit. \"This is the difference for most of those people of whether they make a profit this year or not,\" said Jeff Robson, general manager of Canadian Professional Rodeo Association, the sanctioning body of professional rodeo in Canada. \"I think the significance in the rodeo circles is extremely high. This is the best of the best competing from all over North America, so it's a pretty big deal.\" The City of Red Deer also stands to win big after securing the event for the next 10 years. Organizers estimate the rodeo will inject $25 million into the economy. There was a lineup outside of the local Lammle's — popular vendor of Western wear — before the store opened on Tuesday morning, as attendees purchased fresh jeans and boots ahead of the week's festivities. The Parkland Mall location doubled its staffing to keep up with the anticipated flood of customers, said manager Holly Murray. \"It's great to see the town getting into the spirit,\" she said. \"People come into the store in skater shoes and leave in cowboy boots.\"Red Deer's hospitality businesses are also feeling the rodeo boon. Hotels started fielding reservations as soon as Red Deer was announced as the new home of the annual event in January. The downtown Super 8 hotel was only at half-capacity this time last year, manager Tyann Neumeier said. As of Tuesday, all 84 rooms were booked for the week. \"I think it's great, I mean, it's giving the housekeepers here a lot more hours. It's giving the front desk a lot more hours. And I know that there's going to bring so much revenue to the City of Red Deer,\" she said.\"It's going to help a lot of people.\"Westerner Park is less than half the size of the Coliseum, with a maximum capacity of 7,819 attendees. The smaller venue creates a more intimate experience for fans, said Robson.\"It's going to be electric,\" he said. The rodeo runs until Sunday. A full schedule of events is available on the Canadian Finals Rodeo website.   Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}