{"id": "Horizon works to reopen obstetrics unit at hospital in Carleton County ", "paragraph": "Pregnant women who would normally give birth at the hospital were being directed instead to travel about one hour to either the Dr. Everett Chalmers Regional Hospital in Fredericton or to the Edmundston Regional Hospital if they went into labour between Wednesday at 3 p.m. and Friday at 5 p.m.Dr. John Dornan said a recent change in the so-called locum surgeons, who fill-in at the obstetrics unit during absences or short-staffing, prompted the unusual step.One of the new locums is not currently able to perform caesarean sections, commonly referred to as C-sections, he said.Even when a delivery is expected to be low-risk, emergency situations can quickly arise during child birth and the hospital must have a contingency plan in place if a C-section is required, said Dornan.And while surgeons from across the province have been helping out, no one is available to provide that emergency backup for the next couple of days, he said.\"We had hoped up until a few days even that we might be able to find someone to fill that gap, but we weren't able to do that and so we're enacting a diversion policy.\"The locum will be learning how to do caesarean sections, and Dornan is \"hopeful of being able to give good coverage in the future.\"It is the first time the obstetrics unit has had to close \"in our recent history,\" he said.\"I think the key point is that we have a safe diversion policy.\"Meanwhile, obstetrical services at the Chaleur Regional Hospital in Bathurst have also been \"interrupted temporarily\" this week because of a \"lack of nursing staff,\" the Vitalité Health Network announced on Monday.Until Friday at 8 a.m., pregnant women in that area are being redirected to hospitals in Campbellton and Miramichi to give birth.\"The obstetrical unit at the Chaleur Regional Hospital is still open, let's say, if a patient has a fever and she's not in labour, she's still welcome to the unit,\" said ​Vitalité spokesperson Thomas Lizotte.\"And for emergency reasons our doors are still open, right? So we're not going to let a woman in labour, you know, at the door or say, 'You've got to drive to Miramichi or Campbellton.'\"But right now, Chaleur has only one nurse trained in labour and delivery for the day and night shift, when ideally, there should be two more, Lizotte said.For safety reasons, expectant mothers are being redirected.Vitalité \"regrets any inconvenience that this situation could cause,\" Johanne Roy, vice-president of clinical services, said in a statement.With files from Information Morning FrederictonAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}