{"id": "'It's a mess': Pot shop owners say Alberta is running out of weed", "paragraph": "After four days of lineups at pot shops across Alberta, some store owners say there's not enough weed left to keep their doors open and they're struggling to order more.In the meanwhile, the Alberta Gaming, Liquor and Cannabis Commission has granted 14 more retail cannabis store licences since Wednesday, bringing the total number to 31 — the most of anywhere in Canada. The problem of cannabis shortages has hit other Canadian provinces along with Alberta, leading pot store owners and government-run distributors scrambling.In Alberta, a shortage of stock on the AGLC's retailer website means some new stores aren't able to order any cannabis at all to stock their shelves, and those that have run out can't order enough to restock.The AGLC is the province's official supplier of cannabis, offering products from 15 producers.In Edmonton, Numo Cannabis has closed its doors after running out of weed, according to a sign on its door. Another Edmonton store, Alternative Greens, was also closed Saturday after running out of cannabis.Pot shops can order more stock from the AGLC once a week. But Patrick Wallace, owner of Waldo's 420 Store in Medicine Hat, says there's basically nothing left to order.His store was one of the 17 stores granted licences to open on legalization day, when he says he sold 33 per cent of his stock — worth about $26,000.\"It was a gong show in here,\" he said.Wallace was able to preorder cannabis from the AGLC in September. Three hundred items were supposed to be listed on the province's website. But instead, Wallace said he found only 70 items to choose from, and from the 50 he ordered, he was not able to get the quantities he asked for.On Wednesday, he tried to order more. He says his order from the AGLC is expected to arrive next Friday. He expects to completely sell out by then, and will keep the doors open to sell accessories.On Saturday, he said there were 93 products listed on the AGLC's website for retailers. Of those, only three CBD products were in stock and available to order.Wallace says he's not sure how any of the newly-licensed stores will be able to order any cannabis.\"It's a mess. The supply is just a mess,\" he said.If supply issues are plaguing the first 17 stores, Wallace said he's concerned what will happen once the 250 stores the AGLC expects to provide licences to open in the next year.\"They should have worked on the supply before they legalized it. They needed a lot more supply,\" he said.Karen Barry, the founder of Beltline Cannabis in Calgary, has her staffing and licence in place. But she can't open her store because she can't get any cannabis.Barry says she was given access to order product from the AGLC's retailer website on Friday morning. She found there wasn't enough cannabis available to stock a store — the vast majority of product available to retailers was sold out.Now, she doesn't expect to open until Nov. 1.\"We were on the website, but there is nothing on the website. There is no product,\" she said. \"I'm sure the AGLC is working hard to remedy the problem.\"This is just a growing pain that we're experiencing in the whole industry.\"Some stores remain stocked to certain extents. Amy Kaur, a manager at Edmonton's Cannabis House, said Saturday morning the store is well stocked, with only about five products sold out.Nova Cannabis in south Edmonton remained open on Saturday, with lineups snaking around the block. James Burns, CEO of Alcanna Inc., the parent company of Nova Cannabis, said the store still has cannabis in stock because it ordered a \"very, very large amount.\"\"We had the funds available and we placed the biggest order we could possibly place,\" he said. Burns said they still didn't get everything they wanted — they ordered enough cannabis to last the first few weeks, but they received less than half. Burns nevertheless expects most of the Nova Cannabis stores will continue to have product throughout the week.AGLC spokeswoman Heather Holmen acknowledged maintaining supply has been an issue. She said the AGLC is working to stock the full 300 items, but demand has so far exceeded their expectations.She could not confirm how much product listed online will be available for retailers to order, but said more stock will become available throughout the weekend. She could not provide a timeline on when all products would be back in stock.\"It's day four of legalization ... and nobody has all the answers right now,\" she said. She said the AGLC did its best to prepare to meet that demand, but there have been Canada-wide supply issues beyond their control. Canadians haven't bought up all the cannabis, she said. The issue has more to do with logistics. \"The legalization process has happened quite quickly when you think of the scope of the undertaking nationally, and unfortunately I think there have been some time constraints as a result of legalization coming into force too quickly,\" she said. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}