{"id": "Quebec City offers lesson in overcoming hate for victims of Pittsburgh shooting", "paragraph": "Quebec City, still healing from a deadly attack on one of its religious minorities is showing the way forward to a another city where the pain from a similar attack is still fresh.Members from Quebec City's Jewish, Muslim and Christian communities joined together Sunday at city hall for a ceremony honouring the victims of last month's shooting at the Tree of Life synagogue in Pittsburgh.Eleven people were killed and six others injured. It is considered the deadliest anti-Semitic attack in U.S. history. \"Even if 1,200 kilometres separates us, we share their pain because we recognize it,\" said Quebec City Mayor Régis Labeaume.On Jan. 29, 2017, six members of the city's Muslim community were killed in a shooting at a suburban mosque, considered the deadliest Islamophobic attack in Canadian history.Residents responded to the tragedy by forging closer ties with minority groups in the city, Labeaume said. \"Today our city is more united in its diversity,\" the mayor added. \"It's now our turn to bring hope of a better future to our friends in Pittsburgh.\"Magda Belkacemi, whose father was killed in the Quebec City mosque shooting, said that the expressions of solidarity that poured in afterward helped her own grieving process.\"We have to fight hate, we have to fight intolerance, no matter what form it takes,\" she said. \"There should be no more victims to this hate.\"Following the shooting in Pittsburgh, the head of the mosque that was attacked last year — the Islamic Cultural Centre of Quebec City — immediately phoned the rabbi of a local synagogue.The deeper ties that have developed between the different faiths in Quebec City should offer a sign of hope for Jews in Pittsburgh who may be feeling vulnerable, said David Weiser, president of Quebec City's Beth Israël Ohev Sholom synagogue.\"Despite the dark cloud that seems to want to cast itself over world politics at the current time, there are rays of light that illuminate Quebec City,\" Weiser said at Sunday's ceremony.He noted that Quebec City's Jewish community hasn't been spared its own encounters with anti-Semitism.There was an arson at a synagogue in 1944, a Jewish cemetery was vandalized in 1990 and in 2002, a bomb was tossed at a synagogue.But in 2018, Weiser said, the city's diverse residents are standing in solidarity with its Jewish community in an effort to combat hate. \"It's incredible,\" he said.With files from Radio-CanadaAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}