{"id": "Family's wait for ambulance after boy fatally injured in ATV crash angers ex-paramedic", "paragraph": "Volunteer firefighter Eric Thériault was in Caraquet on Saturday when he heard the emergency call over the radio to assist a teenage boy in an ATV accident in Haut-Lamèque.He watched a responding ambulance with its sirens blaring drive by on route to the scene roughly 50 kilometres away. It was a frustrating sight, he said, because just a few kilometres from the crash was an empty ambulance station in Lamèque.Family, police and firefighters waited about 45 minutes for paramedics to arrive, according to the mother of a friend who was riding an ATV trail with Marc-André Gionet on Saturday.Gionet died in the crash. He was 13.RCMP are still investigating what contributed to the accident, which happened at a quarry with a steep embankment along Route 305 in the northeastern New Brunswick community.This latest ambulance delay in the Acadian Peninsula, and in other New Brunswick jurisdictions, prompted Thériault, a former paramedic, to speak out against the management of the provincial ambulance service.A 45-minute wait is far \"too long,\" he said.\"It's not acceptable for the people of New Brunswick,\" he told CBC News.He said families are being \"abandoned at the scene,\" and more paramedics are needed in the area.It's another northern New Brunswick community that feels inadequately serviced by Ambulance New Brunswick and its operating company, Medavie Health Services, whose contract was renewed by the Liberal government last year for another 10 years.  Saint-Quentin has been fighting for improved coverage, and Medavie president Richard Losier promised to find \"concrete solutions\" by Nov. 1.Ambulance New Brunswick acknowledged Monday there was a delay arriving at the scene in Haut-Lamèque.The service said there were six ambulances working in the Acadian Peninsula on Saturday and, at the time of the call, four of them were not available to respond to emergencies.\"Three were on assignment, including a transfer to Moncton, and one unit was temporarily out of service because of a sudden illness,\" said Chisholm Pothier, director of communications for Medavie.\"Overall, the system was busy on the peninsula on Saturday, particularly busy at the time of the call, and that led to a delayed response.\"Ambulances are supposed to reach patients outside urban centres within a 22-minute window.Thériault said the target could be met when the number of ambulances in the peninsula was much higher than the current complement of six.He said he quit being a paramedic about six years ago because he couldn't take it anymore. The service was deteriorating and more and more staff were burning out.He said it's time for change in management.On Tuesday, the Acadian Society of New Brunswick launched a petition calling for the cancellation of the Ambulance New Brunswick contract with Medavie. The petition is directed to the legislative assembly.\"Enough is enough,\" said Robert Melanson, the society's president.\"It is increasingly clear that the Medavie-managed ambulance system simply no longer works for the people of this province.\"With files from Gabrielle FahmyAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}