{"id": "'I can't sleep': Friends of missing kayaker search river for signs he's alive", "paragraph": "The distraught friends of 27-year-old Alexander Okonski continue to search for him, three days after his abandoned kayak turned up along the Ottawa River shoreline.Ottawa police asked for public assistance earlier this week when Okonski's kayak and paddle were found Wednseday morning near the Britannia Water Purification Plant.Police describe Okonski as a white male with an athletic build who was last seen wearing a camouflage jacket and black pants. Friends say Okonski is from Ottawa, but now lives in Gatineau, Que. \"He's a really good friend. He's basically my best friend. We do hunting, fishing, everything together,\" said Michel Lefebvre, who searched the along the Gatineau side of the river for hours Saturday.\"We're just walking the shorelines — hoping for the best.\"Lefebvre said his friend knows his way around the outdoors, and he's looking for signs of a trail Okonski might have made into the woods or a fire he lit.\"[I'm] very concerned, for sure. You know, I'm trying not to think the worst,\" he said. \"You never know. He's a survivor guy. He's an outdoor extremist. … He would give it his all.\"Friends said Okonski is shy, but would always be smiling and laughing when he was hanging out with them.Another searcher, Emily Brown, said she's been friends with Okonski for 12 years since they went to high school in Ottawa's east end.She called him a \"hardcore outdoorsman.\"\"It's his whole life, which is why this is so concerning,\" Brown said Saturday.\"He knows what he's doing, so if his boat is washing up, then that's why we're all freaking out — because something is wrong.\" Brown said she usually talks to Okonski every day and was supposed to visit his house the night before his kayak was found. \"We're all barely holding it together,\" she said.Brown also called Okonski \"the best person I've ever known.\"\"I can't sleep. How do I sit at home and sleep knowing he's out there somewhere? You know what I mean? I can't. Can't sit at home. We all just have to go out,\" said Brown. \"I can't think of one instance of him doing someone wrong or someone being mad at him ... of all the people for it to happen to, like, he's the one that didn't deserve it.\"Ottawa police say the case is still open and Okonski's disappearance is not considered suspicious. They say there's been a thorough investigation so far and that they've been keeping Okonski's family updated. Anyone with information can call police at 613-236-1222 ext. 2666, or give an anonymous tip through Crime Stoppers at 1-800-222-8477. Krystalle RamlakhanKrystalle Ramlakhan is a multi-platform journalist with CBC Ottawa. She has also worked for CBC in P.E.I., Winnipeg and Iqaluit. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}