{"id": "Indigenous women coerced into sterilizations across Canada: senator", "paragraph": "When she was 17 years old, Liz was coerced by a Children's Aid worker into having an abortion and being sterilized at a northwestern Ontario hospital, she says — an experience she's carried for 40 years.\"It was a matter of me almost [being] cornered, if you will, by my worker at the time saying, 'You better have an abortion because if you don't, either way, we are going to take that child from you',\" Liz says.New research shows the forced sterilization of Indigenous women is not just a shameful part of Canadian history. Reports from Alberta, Saskatchewan, Manitoba, Ontario and the territories suggest it is still happening.Tubal ligations carried out on unwilling Indigenous women is one of the \"most heinous\" practices in health care happening across Canada, says Yvonne Boyer, a Métis lawyer and former nurse who is now a senator for Ontario.She was first contacted by Liz [who asked not to have her last name published, so she could talk freely about something so personal] in 2017 after a news story detailed research Boyer produced with Métis physician and researcher Dr. Judith Bartlett. Their report detailed how Indigenous women were coerced into tubal ligations — the severing, burning or tying of the Fallopian tubes that carry eggs from the ovaries to the uterus — after childbirth in the Saskatoon Health Region.Boyer now wants the Senate to study the scope of the issue nationally, making it the focus of her first address to the upper chamber.\"If it's happened in Saskatoon, it has happened in Regina, it's happened in Winnipeg, it's happened where there's a high population of Indigenous women,\" Boyer says in an interview. \"I've had many women contact me from across the country and ask me for help.\"Some Indigenous women interviewed for the report also felt pushed into signing consent forms for the procedures while they were in active labour or on operating tables, Boyer says, noting a class-action lawsuit against the Saskatoon Health Region was launched in 2017 by two of the affected women.Each claimed $7 million in damages. Now about 60 women are part of the lawsuit, she adds.\"If there are 60 women just in the Saskatoon area, there are many more that haven't come forward in that area and there are many more that wanted to come forward but were too traumatized to,\" Boyer says. \"There's many more that have buried those memories.\"Alisa Lombard, an associate with Maurice Law — a firm leading the proposed class action — says women from outside Saskatoon Health Region have also reported being sterilized without proper and informed consent. She says she's heard from others in Saskatchewan as well as Manitoba, Ontario and Alberta.Records and research show the practice was prevalent in the Northwest Territories and Nunavut as well, she adds.Lombard says her firm will raise the issue of coerced sterilizations of Indigenous women at the UN Committee Against Torture this month.In its submission to the committee, Lombard's firm calls out provincial and federal authorities for not investigating and punishing those responsible for the practice despite having received \"numerous reports of numerous cases of forced sterilization.\"It also outlines specific steps to combat the practice, including criminalizing forced sterilization through the Criminal Code and having Health Canada issue guidance to health professionals regarding sterilization procedures.\"I think any and all attention brought to such egregious human-rights breaches is not only necessary, but it ought to be expected,\" Lombard says. \"I think upon any kind of inkling that something this terrible is happening, that it is reported and the fact it is reported by so many women ... I think our governments have an obligation to look into it deeply and to fix it, mostly importantly.\"Amnesty International Canada also plans to raise awareness at the UN torture committee. It's also calling on the federal government to appoint a special representative to hear from Indigenous women coerced into sterilization procedures — to learn what justice would look like for them.Canada must ensure the practice stops, says Indigenous Services Minister Jane Philpott, with policies, education and awareness-raising.\"The issue of forced sterilization of vulnerable people, including Indigenous women, is a very serious violation of human rights,\" she says, noting it has gone on in Canada for a long time.She also calls what happened to Liz \"absolutely appalling and reprehensible.\"\"The story that you're telling where not only was apprehension being threatened ... that she was forced into not only giving up the baby she was carrying but give up her future unborn children, is frankly a horrifying concept,\" Philpott says.Liz remains haunted by what has stolen from her. Sometimes she hears her baby in her sleep.\"I've had a few dreams ... where you could hear a baby crying or you could have a sense of a baby,\" she says. \"The first time I had it I didn't know if it was a boy or a girl. And then another time I had it, it was a boy.\"She says it took years before she understood that what happened wasn't her fault.\"You say to yourself, 'I deserve this, this is my sacrifice, this is my cross to bear'.\"Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}