{"id": "Winnipeg woman forced to shut down haunted house after renting building from man who wasn't owner", "paragraph": "A Winnipeg woman who paid thousands of dollars to rent space for a haunted house in Point Douglas says she's been forced to shut down her business after the building's owner informed her she was trespassing — even though she thought she had legally rented the space.Melissa Wedgewood said she signed a contract and handed over $6,100 to rent space for two months in a Higgins Avenue building. On Sept. 10, she said she got the key and started working toward building a haunted house exhibit, which she planned to operate during the month of October.\"The building was perfect,\" said Wedgewood, who estimates she spent about $15,000 of her savings to get the venture off the ground in hopes it would become a seasonal business. She opened the doors to the haunted house on Oct. 12. On Thursday night, police and the building's owner showed up and told her she was trespassing, she says.\"I had all 15 of my actors in place, I had people running the door,\" she said. Wedgewood said that's when she learned she had handed over cash to a man who didn't have the authority to rent it out for the full term of the deal. \"I was just devastated and disappointed,\" she said. \"I knew that I wasn't going to be able to proceed.\" Wedgewood said she initially found an ad for the building on Kijiji and at the time everything seemed legitimate. She said the man had a key to the building and gave her a tour.  \"He had full access to the space,\" said Wedgewood.Winnipeg police confirmed they are investigating.Wedgewood said since meeting the property owner on Thursday night, she has been in contact with him about how to move forward.She won't be able to continue operating this year, she said, because she'd have to wait to get the proper insurance in place and the owner would want her to pay him rent in addition to the money she's already spent. \"At that point maybe I could open next weekend, but by then the back and forth on things — I don't know how many people would want to come,\" she said. Wedgewood said about 200 people walked through the haunted house last weekend and she was eager to see the numbers grow closer to Halloween.\"We didn't even get a chance to see the full potential,\" said Wedgewood, who hopes she will be able to open a haunted house again next year. She said she is still in contact with the man who rented her the space but hasn't received any restitution. Nevertheless, she is working to provide refunds for people who have already purchased tickets. Alana ColeReporter, CBC ManitobaAlana Cole is a reporter at CBC Manitoba. Email: alana.cole@cbc.caAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}