{"id": "SFU students grill administrators over proposed tuition increases, executive salaries", "paragraph": "About 30 Simon Fraser University students expressed outrage and anger over proposed tuition hikes during a consultation with school administrators on Burnaby Mountain.  \"You need to look us in the face and see how we live, how we work full time and go to school full time,\" said one of the students. \"It's not enough for you to say that your hands are tied.\"According to numbers presented by Martin Pochurko, vice president of finance and administration, first year international students entering the business or engineering faculty next year will be paying 20 per cent and 16 per cent more respectively.All other international undergraduate students are being hit with a four per cent across the board hike, while domestic student tuition will go up the maximum allowable two per cent.\"What I'm concerned about is that every year tuition goes up,\" said fourth year political science student Andrea. \"And what I'm really concerned about is that for international students, this is unsustainable.\"Pochurko said the increases are necessary to avoid a deficit of $15 million. He said even with raises, the university will still have a shortfall of $3.1 million in the 2019-2020 budget year. \"We do have a gap and we do need to solve it,\" he said. A number of students highlighted alternate ways the school could make up the shortfall, including curtailing salary and benefits to administrators. One student received applause when he noted that a number of SFU administrators earned more than Justin Trudeau. \"The president is making more than the prime minister of Canada, c'mon,\" yelled third-year computer science student Giovanni HoSang.According to the SFU Tuition Freeze Now student group, SFU president Andrew Petter is set to earn approximately $523,000 in salary and expenses this year while another seven administrators and deans, including Pochurko and Keller will earn well over $300,000.The prime minister makes $347,000 a year.There was more cheering when another student suggested school administrators take pay cuts equal to any tuition increases they bring in.Vice President of Academic and Provost Peter Keller replied by saying SFU has among the lowest administration costs of any university in Canada.He also said international undergraduate students bear the brunt of the increases because their tuition increases aren't capped by the province.\"Domestic fees are frozen at two percent and that really leaves international students as the only variable we can look at,\" he said.That comment was little comfort to Jade Ho, a foreign PhD student in education who works three jobs to make ends meet. Ho says SFU administrators are being disingenuous when they describe today's meeting as a \"consultation.\" \"They do this every year and every single year students say we can't afford an increase but tuition keeps going up. They use a lot of abstract words like 'steps are being taken' or 'considerations are being made,' but when we ask what 'steps' or what 'considerations' we don't hear anything concrete,\" she said.\"What we really hope is the school hears us today and starts taking steps toward a tuition freeze.\"Ho also questioned why SFU scheduled the consultation during the busy midterm season, something that she believes prevented many more students from attending.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}