{"id": "Road To The Olympic GamesNathan Chen captures Skate America men's crown", "paragraph": "American figure skater Nathan Chen was dominant on home ice to capture the men's title on Saturday in Everett, Wash., the first Grand Prix of Figure Skating event of the season.Skating to \"Land of All\" by Woodkid, Chen had a clean and polished routine from the start, from his triple loop through the triple lutz. Chen earned a standing ovation from the crowd after his free skate, which earned 189.99 points on the day and 280.57 total for the event.Perhaps most impressively, given that he won the competition by more than 41 points, Chen described his routine as \"watered down\" as he eases into the new Grand Prix campaign.Watch Chen's free skate:\"The program, in terms of quad number, was definitely watered down,\" Chen said, \"but I think that, in terms of where I'm at in the program right now, it's perfect. I'm looking to add more in, but at the same time trying to build on everything else.\"The 19-year-old from Salt Lake City was the obvious fan favourite here. Banners featuring his photo hung from railings, and his name was held up on posters throughout the audience. The only challenger who drew close to as loud of cheers was United States teammate Vincent Zhou, who finished in fifth place but had the second-highest score of the day with 149.37.Chen easily outpaced the competition. Michal Brezina of the Czech Republic finished second overall with 239.51 points, while Sergei Voronov also ended up on the podium with 226.44. Canada's Nam Nguyen and Kevin Reynolds finished sixth and 10th, respectively.Watch Nguyen's free skate:Chen is seeking to build upon a standout 2017, during which he won the World Championships, a second-straight national title as well as triumphed at the most recent Grand Prix final.\"It's definitely a step in the right direction,\" Chen said. \"I didn't attempt all of the quads that I'm capable of doing . because it can take away from my confidence a little bit, and my performance, and those are really important this year.\"Earlier, Russia's Evgenia Tarasova and Vladimir Morozov cruised to victory in the pairs event. Skating to \"The Winter\" by Balmorhea, Tarasova and Morozov topped the free skate with 133.61 points for a total of 204.85 — more than 25 points ahead of the second-place Russian pair of Alisa Efimova and Alexander Korovin.Watch Tarasova and Morozov's free skate:\"Today, it was all about enjoying the program,\" Morozov said. \"The arena was great, and we enjoyed the support very much.\"Ashley Cain and Timothy Leduc of the United States finished third, while Canada's Evelyn Walsh and Trennt Michaud placed eighth.Watch Walsh and Michaud's free skate:Tarasova and Morozov — who also won the short program on Friday — are coming off a strong season in which they won the European Championships, finished second at the Worlds and fourth at the Olympics. Two weeks ago, they won the ISU Challenger Series Finlandia Trophy.Japanese skaters dominated the women's short program. Sakoto Miyahara finished in first place with 73.86 points, Kaori Sakamoto in second with 71.29 and Marin Honda in fourth with 62.74. Russia's Sofia Samodurova was third at 64.41.Miyahara leads after short program:Reigning national champion Bradie Tennell came in fifth to lead the American contingent, followed by Megan Wessenberg in sixth and Starr Andrews in ninth.Alaine Chartrand last after short program:Canada's Alaine Chartrand finished at the bottom of the field in 11th place with a score of 46.99.American partners Madison Hubbell and Zachary Donohue, also the reigning national champions, finished first in the rhythm portion of the ice dancing competition.Watch the Americans' rhythm dance:Charlene Guignard and Marco Fabbri of Italy came in second, fewer than four points behind Hubbell and Donohue, while Russians Tiffani Zagorski and Jonathan Guerreiro placed third.Explainer: Figure skating rule changesWith files from CBC SportsTo encourage thoughtful and respectful conversations, first and last names will appear with each submission to CBC/Radio-Canada's online communities (except in children and youth-oriented communities). Pseudonyms will no longer be permitted.By submitting a comment, you accept that CBC has the right to reproduce and publish that comment in whole or in part, in any manner CBC chooses. Please note that CBC does not endorse the opinions expressed in comments. Comments on this story are moderated according to our Submission Guidelines. Comments are welcome while open. We reserve the right to close comments at any time.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}