{"id": "Carleton students vote to stick with national federation", "paragraph": "After a close referendum, Carleton University students have voted to stay part of the Canadian Federation of Students (CFS), an organization founded at the university in 1981.The CFS is an overarching student union, with more than 60 local members across Canada. There were 2,396 students who voted in favour of remaining part of the federation and 2,134 who voted no — a difference of only 262 votes. There were 18 spoiled ballots. The Carleton University Students' Association (CUSA) had wanted to leave the CFS. \"Obviously it's disappointing to lose any referendum or election, especially with the work that we put in over the past year-and-a-half and especially the past couple weeks,\" said association president David Oladejo. Each student pays $16.74 in dues to the CFS as part of their tuition. In total, Carleton students collectively pay more than $400,000 a year to the organization. Oladejo said the close vote shows some students don't entirely know what value the CFS provides to the university.\"It definitely shows that a lot of students want to see change,\" he said. The next step, he added, is to sit down with the CFS and talk about how to move forward and that perceived lack of value.However, Oladejo said it's ultimately's CUSA's job to support what students want — and students have spoken. \"So moving forward, obviously [CFA membership] is something students voted for and that's something that we're going to continue to work with,\" said Oladejo. Nour Alideeb, the Ontario chairperson for the CFS, said the close results have sent a message. \"It's given a mandate to us for us to come back and continue to work on the campaigns and services,\" said Alideeb. \"Because of the close margins, I believe that there's an opportunity for us to continue to rebuild our relationship with members and with the Carleton undergraduate student association. That's something that I'm really looking forward to.\" Alideeb said the CFS advocates and lobbies for students' concerns at the provincial and federal level, and they have strength because they connect students across the country — like when the federation advocated for sexual assault policies on campuses. \"I'm looking [forward] to really rebuilding our relationship with CUSA, because in the past, we had a really great relationship and fought so many amazing victories,\" said Alideeb.Alideeb said she'd try harder to visit different parts of campus when she visits about once a month, since not all students pass through the same buildings. \"I think now, really, it's about [educating] students into how to be volunteers and how to continue this work,\" she said. \"Even when I'm not there.\"The vote results are still subject to the verification of the voters list and must also still be ratified.Krystalle RamlakhanKrystalle Ramlakhan is a multi-platform journalist with CBC Ottawa. She has also worked for CBC in P.E.I., Winnipeg and Iqaluit. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}