{"id": "4 people hospitalized after pit bull attack on Vancouver Island", "paragraph": "Four people are in hospital after a pit bull attack at a residence in Colwood, west of Victoria, on Saturday.According to a release from RCMP, West Shore RCMP and the BC Ambulance Service were called to a residence in the 3000 block of Pickford Road in Colwood at 12:30 a.m.Emergency responders discovered 13 people — including adults and children — barricaded inside the residence following an attack by a pit bull.The dog's owner, Kyla Johnson, managed to secure the dog inside a bedroom but sustained serious injuries, including bite wounds.Johnson said her father and fiancé were arguing and the dog became agitated.Johnson said she suffered injuries on her arms, legs, knees, chest and stomach.She said she adopted the dog, Rex, from Vancouver in July.The Capital Regional Animal Control officer and police were eventually able to safely remove the dog.According to the statement from RCMP, an injured man who appeared to be heavily intoxicated, was also arrested by police after \"removing his shirt and attempting to fight with officers.\"\"CRD Animal Control officers have seized the pit bull who had been recently adopted by the family as a rescue animal,\" Cpl. Chris Dovell of the West Shore RCMP, said in the release.\"The attack started during some rough housing between two intoxicated adult male guests,\" the statement said, adding \"it appears the dog was bumped into and became aggressive.\"Johnson said the dog had never acted violently before and will be euthanized.\"This wasn't a normal thing, this dog has never acted like this before,\" she said.The RCMP said the Capital Regional District Animal Control will conduct a review of the attack and the dog's history of aggression.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}