{"id": "Lionel Messi suffers broken arm in La Liga match ", "paragraph": "Lionel Messi broke his right forearm on Saturday and will be sidelined for about three weeks, a major setback for him and Barcelona right before some important games.\"It's a significant loss. We will notice his absence,\" Barcelona coach Ernesto Valverde said.\"We've played without him in the past. We will be prepared to overcome this.\"He was in visible pain and was treated by team doctors. They wrapped his elbow with bandages and the playmaker tried to continue, but he eventually left the field.Messi was taken to a clinic and the club said tests showed a \"fracture of the radial bone.\"The playmaker scored the team's second goal with a shot from outside the area in the 12th.He's the team's leading scorer with seven goals in the league after nine matches.He was replaced by Ousmane Dembele on Saturday.\"We'll see how we will play without him,\" Valverde said. \"We will try to maintain our style.\"To encourage thoughtful and respectful conversations, first and last names will appear with each submission to CBC/Radio-Canada's online communities (except in children and youth-oriented communities). Pseudonyms will no longer be permitted.By submitting a comment, you accept that CBC has the right to reproduce and publish that comment in whole or in part, in any manner CBC chooses. Please note that CBC does not endorse the opinions expressed in comments. Comments on this story are moderated according to our Submission Guidelines. Comments are welcome while open. We reserve the right to close comments at any time.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}