{"id": "Historic airplane makes journey from High River to museum in Nanton", "paragraph": "Motorists travelling between High River and Nanton, Alta., were treated to a rare site Saturday morning — a vintage, twin-engine plane used to train crews during the Second World War being trucked to the Bomber Command Museum of Canada.The Cessna Crane — with its nearly 13-metre wingspan — was loaded onto a flatbed truck in High River and driven south to Nanton, having been donated to the museum by an Alberta family. Ben Schwartz, a board member at the museum, was behind the wheel of the flatbed truck and said one thing he had to be wary of was speed. \"It is an aircraft, it is meant to fly and I was just staying well below the stall speed on it,\" he said. \"It's just kind of drive by feel. I was anticipating around 50 kilometres an hour would be a safe travel speed with it, but you play with that speed. Sixty kilometres [an hour] was fine, got up to 65, 70 and I started to feel the wings wiggle a little bit, that could have been the road, I don't know, but back it down again. It pulled really well.\"The 20-kilometre journey took about 45 minutes to complete, said museum director Dave Birrell, who likened the effort to when a Lancaster Bomber was brought there in the 1960s. \"They towed it from the old training base 28-kilometres east of here,\" he said. \"It took three days and they towed the Lancaster across the fields and brought it into Nanton. [That was] a little bigger project than what we did today and a lot bigger airplane, but quite similar in concept.\"The Crane is historic as it was used to train thousands of Canadian pilots before they headed overseas to join the war effort. \"There were 100 of them in Calgary, there were 100 of them in Claresholm, there were 50 of them over here in Vulcan, so it was an important airplane in our local history,\" he said. \"Another exciting thing for us is we're going to be able to run it. We run our Lancaster and we run a couple of our other planes, so this will be our fourth runnable airplane at the museum, it's an important part of what we do. We start the engines and can taxi them around.\"Because there are no runways at the museum, however, planes can't take off or land there. While training aircraft like the Crane aren't as well known as the bombers and fighters, author and historian Ted Barris says they represent a critical part of the war effort, as Canada trained more than 130,000 allied aircrew.\"Winston Churchill referred to the British Commonwealth Air Training Plan as the deciding factor in winning the war,\" he said.This was the third large aircraft Schwartz has moved but the first with the wings still attached.\"It's interesting have that on the trailer behind you,\" he said. \"I did notice a few people standing and taking pictures.\"With files from Kate Adach, Dave GilsonAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}