{"id": "St. Albert vape shop busted for selling illegal cannabis, police say", "paragraph": "Three people have been charged with drug trafficking after RCMP raided a St. Albert vape shop that police say had been advertising for months that it was selling cannabis products.On Sept. 26, the St. Albert RCMP drug unit executed a search warrant at Big Mike's Vapor Trails on Boudreau Road and seized cannabis products containing cannabidiol (CBD), and some containing delta-9-tetrahydrocannabinol​ (THC), along with a significant quantity of cash, a loaded restricted firearm and a prohibited sawed-off shotgun, police said Wednesday in a news release.\"Prior to the legalization of cannabis ... the shop had been advertising for months on large signage in front of the store, as well as an online store, that they had CBD products for sale,\" RCMP said.THC is the main psychoactive ingredient in cannabis. CBD does not produce a high or intoxication, according to the Government of Canada health department website, and is being studied for its possible therapeutic uses.Cannabis was legalized in Canada on Oct. 17, but can only be sold by licensed shops authorized by the Alberta Gaming, Liquor and Cannabis Commission.At the time of the raid in St. Albert, CBD was listed within Schedule II of the Controlled Drugs and Substances Act as a product that was illegal to possess without proper authorization, RCMP said in the news release.A 29-year-old Edmonton woman was arrested at the shop. Two other people from the summer village of South Baptiste, Alta., later turned themselves in to RCMP, police said.All three have been charged with possession of a controlled substance for the purpose of trafficking and possession of proceeds of crime over $5,000. One man has also been charged with three firearm-related offences.\"The RCMP in Alberta will continue to take a measured approach when dealing with illegal storefronts, with public safety being the priority,\" St. Albert RCMP Insp. Pam Robinson said in the news release.The three people charged are scheduled to appear in St. Albert provincial court on Nov. 5.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}