{"id": "Height limits and heritage districts proposed for Dartmouth building plan", "paragraph": "Proposed new planning rules for downtown Dartmouth, N.S., include three heritage districts and maximum height limits on certain sites.Details of the proposal were discussed at the city's community design committee on Wednesday and at an open house at the Alderney Landing on Monday.\"For the most part, people seemed satisfied,\" said Dartmouth councillor Sam Austin.The downtown Dartmouth rules are part of the Centre Plan, an overall planning document for peninsular Halifax and parts of Dartmouth.The first phase of the Centre Plan may not be approved and in place until fall 2019. But the development rules for one part of downtown Dartmouth could take even longer.The Dartmouth Cove area is former industrial area. Engineering studies are still underway on flood plains and the best possible street grid.\"Until all the information is gathered, we didn't think it was appropriate to bring it forward,\" explained Eric Lucic, HRM's manager of regional planning.That means it could take until 2020 before development rules for Dartmouth Cove are ready.Austin knows there's some frustration with the delays, but he adds it's important to get the ground rules right.\"It'll do wondrous things for Dartmouth when it does happen,\" said Austin. \"But if we get the infrastructure wrong, we'll set ourselves up for future problems.\"Pam BermanReporterPam Berman is CBC Nova Scotia's municipal affairs reporter. She's been a journalist for almost 35 years and has covered Halifax regional council since 1997. That includes four municipal elections, 19 budgets and countless meetings. Story ideas can be sent to pam.berman@cbc.caAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}