{"id": "Into the wild: Renfrew Ravine premieres new walkways and staircases", "paragraph": "The Renfrew Ravine, a little bit of wilderness in the City of Vancouver, just got a lot more accessible.The Vancouver Park Board and the Still Moon Arts Society have collaborated to add staircases, bridges and walkways to the East Vancouver nature spot.The upgrade's grand opening was Tuesday.\"It's really amazing that it's here. It's just so spectacular,\" said Carmen Rosen, artistic director of the Still Moon Arts Society, speaking to On the Coast's Margaret Gallagher.Both Renfrew Community Park and Renfrew Ravine Park have been redeveloped in order to give residents easier access to the ravine's habitat and Still Creek, according to the project's master plan.Renfrew Ravine is part of the Still Creek watershed. There are seven blocks of wild ravine near the 29th Avenue Skytrain station, says Rosen. The creek goes underground at 22nd Avenue and emerges at the Renfrew Community Park.\"We didn't want to have too much of an impact on this ecosystem. So we built an elevated boardwalk to ensure that the water has the ability to move underneath the boardwalk,\" Vancouver Park Board landscape architect and project lead Alexandre Man-Bourdon told Gallagher.The upgrades include staircases with improved access to trails, an accessible walkway into the trail system from the parking lot on Renfrew Street, bridges across Still Creek and enhanced trails.\"[You can go] down quite deep into the ravine,\" said Man-Bourdon. \"From down [there], when you look around, you can't see the houses around you. And except for a few passing cars and the rain, you really can't hear anything except the water.\"Renfrew Ravine, which is much more wild than the community park, was logged in the late 1800s, making it a second-growth forest, according to Rosen. But visitors can still see old-growth tree stumps.\"Renfrew Ravine really gives you a flavour of what the city was like hundreds of years ago,\" said Rosen.Man-Bourdon says that the park board strives to provide the city with accessible ways to explore nature.\"In the eastside of Vancouver, there are only a few locations where you get this kind of wild nature access. This is really a gem,\" said Man-Bourdon.Listen to the full story:With files from On the Coast and Margaret Gallagher.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}