{"id": "Argonauts rally past Alouettes on record-tying rushing TD", "paragraph": "It was sweet redemption for James Franklin.Franklin's record-tying one-yard TD run with 56 seconds remaining rallied the Toronto Argonauts to a 26-22 win over Montreal on Saturday night. It came after Tevaughn Campbell returned Franklin's interception 37 yards for the touchdown at 9:10 of the fourth to put the Alouettes ahead 21-16.But Franklin redeemed himself with 2:21 remaining, smartly moving the Argos 75 yards on nine plays. He capped the winning drive with his second rushing touchdown of the game and 14th this season, tying Doug Flutie's league record for most rushing scores by a quarterback.The 14 rushing touchdowns are also an Argos single-season mark.Video: Watch Franklin's game-winning touchdown\"It was nice,\" Franklin said. \"The thing I appreciated about that was how positive the guys were (after interception TD).\"I give them a lot of credit for just how they were with me. [Tying Flutie's record] was pretty cool, you saw how excited the guys were once we scored . . . that was collective. Unfortunately for them my name is going to go into the book but I wish everyone could go in there just because of how hard they work at it.\"Drew Brown's field goals of 37 and 38 yards pulled Toronto (4-12) to within 21-19 with just over six minutes remaining. Boris Bede's single off a missed 39-yard try made it 22-19 at 12:39.Franklin finished 26-of-37 passing for 277 yards and two interceptions as Toronto snapped an ugly seven-game losing streak. More importantly, the Argos won their final home game of the season but didn't announce the attendance.\"It's really big, especially the last home game,\" Franklin said. \"It's always nice to finish with a win for (Argos fans).\"We are out of the playoffs but we're trying to stack three wins in a row and take that momentum into next season.\"The win also snapped the longest losing streak of Toronto head coach Marc Trestman's CFL tenure. Trestman felt his team persevered through its share of adversity Saturday night, especially Franklin.\"You've got to have amnesia to play the position,\" Trestman said. \"He took us down the field on that last drive and we scored a touchdown.\"That's a big thing.\"The contest was indeed close, with Montreal registering five more net offensive yards than Toronto (371-365). But it also featured what one would expect of a contest involving the CFL's two worst teams with four combined turnovers, 14 penalties and six sacks.Bede also missed two field goals, which certainly didn't help Montreal starter Johnny Manziel's cause. The former Heisman Trophy winner remains winless in the CFL, dropping to 0-6 as a starter with the Alouettes (3-13).\"We played better today and good enough to win this game,\" Manziel said. \"We just didn't win it.\"That's been the story of our season.\"But Manziel said he continues to evolve in the Canadian game.\"Things are starting to make sense to me on the football field now,\" he said. \"We have two opportunities left, our team is playing for something.\"Montreal hosts Toronto next weekend before finishing its season in Hamilton on Nov. 3.Manziel finished 23-of-30 passing for 220 yards with a touchdown and interception while rushing for 38 yards on four carries. The Montreal record is 0-10 set by Carroll Williams (1967-68) while the league mark is 0-11 held by George Herring (1958-59, B.C.-Saskatchewan).Eugene Lewis had eight catches for 100 yards and a TD while William Stanback ran for game-high 118 yards on 10 carries.\"There are no moral victories but we are competitive,\" said Montreal head coach Mike Sherman. \"Hopefully we get over that hump and then start winning.\"Brown finished with two converts and four field goals. Bede had two field goals, two converts and two singles.Toronto opened the second half with a 78-yard, 14-play drive. But after Franklin missed a wide-open Armanti Edwards in the endzone, the Argos settled for Brown's 11-yard field goal to pull to within 14-13 at 7:22 of the third.Manziel's 11-yard TD strike to Lewis with seven seconds left in the second staked Montreal to its 14-10 half-time advantage. Manziel completed all five passes he tried on the six-play, 75-yard scoring drive for 70 yards.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}