{"id": "George Harvie elected mayor of Delta; Lois Jackson, mayor since 1999, wins council seat", "paragraph": "Many communities that have been thought of as rural or semi-rural are grappling with traditionally \"big city\" issues during the 2018 election campaign.In the Fraser Valley and all the way to Delta, homelessness, crime, urban development and transportation are all big issues for many communities.Former mayor, MLA and provincial cabinet minister Peter Fassbender lost his bid for his old job Saturday night in a tight race with Coun. Val van den Broek, who will become mayor.Serena Oh was also in the running to succeed retiring Mayor Ted Schaffer.A major issue for the candidates will be the future of transportation in the region. While plans are already well underway for light rail service to come to the city, both Fassbender and van den Broek want to see SkyTrain extended instead.Langley City elected six councillors: Nathan Pachal, Rosemary Wallace, Paul Albrecht, Gayle Martin, Rudy Storteboom and Teri James.In Langley Township, Mayor Jack Froese was re-elected, beating challengers Alex Joehl and Anna Remenik.Township voters elected eight councillors: David Davis, Eric Woodward, Kim Richter, Bob Long, Blair Whitmarsh, Steve Ferguson, Petrina Arnason and Margaret Kunst.Former councillor Mike Morden has been elected mayor of Maple Ridge.With incumbent Nicole Read not seeking re-election, five candidates sought her job: Morden, Coun. Craig Speirs, former mayor Ernie Daykin, Mike Shields and Douglas Blamey.Politics in Maple Ridge have often turned ugly in recent years over the issue of homelessness. Read endured threats over her support of homeless residents in the city. Homeless people have described being physically attacked.The candidates for mayor have differed over how best to approach the issue.Six people were elected to Maple Ridge council: Judy Dueck, Gordy Robson, Chelsa Meadus, Ahmed Yousef, Ryan Svendsen and Kiersten Duncan.Former councillor Mike Morden has been elected mayor of Maple Ridge. He talks about some of the challenges he will face. <a href=\"https://twitter.com/hashtag/Elxn2018?src=hash&amp;ref_src=twsrc%5Etfw\">#Elxn2018</a> <a href=\"https://t.co/wFgdabYcWX\">pic.twitter.com/wFgdabYcWX</a>CBC projects Coun. Bill Dingwall will unseat incumbent John Becker to become the next mayor of Pitt Meadows.The small city's race yielded some big drama.Becker and Dingwall were not afraid of taking shots at each other over character and management style.A flashpoint has been Becker's handling of the conviction of former councillor David Murray's conviction for sexual assault.Other issues in this year's race include transportation, keeping taxes low and balancing urban development with the city's agricultural.Six candidates were elected to Pitt Meadows council: Nicole MacDonald, Tracy Miyashita, Mike Hayes, Bob Meachen, Gwen O'Connell and Anena Simpson.Former city chief administrative officer George Harvie was elected mayor of Delta and will succeed long-serving Mayor Lois Jackson.Also in the running were Coun. Sylvia Bishop, former police chief Jim Cessford, and political newcomers Vytas Vaitkus, Moneca Kolvyn and Alex Megalos.Perhaps no issue loomed larger in this election than transportation.Plans to replace the George Massey Tunnel have been put on hold by the NDP provincial government and candidates spoke of the need to find a solution.Jackson, who has been in the mayor's seat since 1999, ran for council this year. She was elected along with Alicia Guichon, Dan Copeland, Jeannie Kanakos, Bruce McDonald and Dylan Kruger.Coun. Ken Popove was elected mayor of Chilliwack, unseating three-term incumbent Sharon Gaetz. Coun. Sam Waddington, 2014 council candidate Brigida Crosbie and towing company owner Dave Rowan were also in the race.One controversy in the race involved Waddington. His council colleagues referred his expenses to the RCMP and an independent auditor a month before election day. He said that move was politically motivated.Controversial school trustee Barry Neufeld, whose resignation had been called for by both the Chilliwack school board and at least one parents' group, was re-elected.Neufeld has been a vocal critic of the sexual orientation and gender identity program (SOGI) in B.C.'s school curriculum and anti-bullying policies.Two other anti-SOGI trustee candidates were elected: Darrell Furgason and Heather Maahs. There are a total of seven trustees on the Chilliwack school board, including a board chair and vice-chair.Chilliwack elected six city councillors: Jason Lum, Chris Kloot, Bud Mercer, Jeff Shields, Sue Attrill and Harv Westeringh.Incumbent Mayor Henry Braun won his bid for re-election in Abbotsford.He defeated veteran Coun. Moe Gill, Christian activist Gerda Peachey, accountant Eric Nyvall, Nadine Snow and Trevor Eros, a wrestler and event promoter also known as \"That Guy Danni Deeds.\"Candidates have listed crime, homelessness, affordability and transportation — particularly road safety and improving Highway 1 — as top priorities.Crime may be front of mind for voters after a man was gunned down in front of an Abbotsford bank Thursday evening. He was one of at least three shot to death in the city since August.Former mayor Bruce Banman successfully ran for a seat on council. Other successful council candidates were Patricia Ross, Les Barkman, Dave Loewen, Brenda Falk, Ross Siemens, Kelly Chahal and Sandy Blue.In Mission, Coun. Pam Alexis defeated incumbent Randy Hawes to become the district's next mayor.Iain Gilfillan and novelty-video-making candidate Wyatt Scott were also in the race. Earlier in 2018, Scott was acquitted of sexual assault, according to the Abbotsford News.Candidates made the economic future of the city a focus during the campaign. Homelessness and managing urban growth in a city with a rural character were also front and centre.Six councillors were elected in Mission: Jag Gill, Cal Crawford, Carol Hamilton, Danny Plecas, Ken Herar and Mark Davies.Former councillor Peter Robb defeated incumbent Wilfried Vicktor to take the mayor's chair in the District of Hope.Cindy Young was also in the race.Six councillors were elected in the District of Hope: Victor Smith, Scott Medlock, Dusty Smith, Craig Traun, Heather Stewin and Bob Erickson.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}