{"id": "'Something in my heart': Traditional ceremony held to honour Candace Stevens", "paragraph": "A ceremony to honour Candace Stevens was held Sunday at a location close to where her remains were found a week ago.It is a way to help her cross over to the spirit world said Tulley Paul, a traditional healer from the Metepenagiag First Nation.\"It's very important for the family and her relatives and all the communities that we honour her spirit this way out of respect for her and her spirit.\"It has to be done this way to release her spirit.\" Stevens' body was found on the Warwick Road in Upper Derby, a community close to the First Nation communities of Metepenagiag and Natoaganeg.Her identity was confirmed by friends after Fredericton police and RCMP said they were investigating the death of a 31-year-old Fredericton woman.In the days following the discovery, Malcolm Ward, who organized the ceremony, said he was troubled by the rumours being posted on social media sites. \"It was a big social media confusion of what was going on and about what happened up here. The rumours started spreading around like wildfire. There was not a straight story coming out of it.\" After learning it was an Indigenous women, Ward said he believed something should be done. \"Out of the whole confusion of all that happening, I sat down and I talked to one of the traditional leaders.\"I said nobody was thinking about doing a ceremony for her or her spirit.\"Ward said he asked him if they could do the ceremony for Stevens. \"She was a mother, she was a sister, she was an aunt — she was part of this world. It's something in my heart that just told me that this needs to be done.\" Ward said after he told others about the service, he received messages and requests to have prayers and offerings made for other missing and murdered girls and women. \"It just started to grow from there,\" he said, adding Stevens' foster mother, and the people who found her body, wanted to take part and did. Tulley said tobacco offerings and prayers were made to a sacred fire, which represents eternal life.\"We have some food offerings to offer her spirit and feed her spirit for when she travels to the spirit world.\"  Ward said close to 40 people gathered at the site to offer their prayers and condolences.Roger Augustine, Assembly of First Nations regional chief, spoke at the ceremony. Earlier Sunday, he issued a media release.\"My thoughts and prayers are with the family, the friends and the memory of Candace Stevens,\" the release stated. \"The family has suffered a profound loss and they deserve answers.\"I am pressing the Fredericton police and RCMP to conduct a full and thorough investigation. This must be a priority. I stand with the family.\"Gail HardingWeb WriterGail Harding began her career as a journalist in the newspaper industry before joining CBC as a web writer. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}