{"id": "Longtime illegal midwife says she's retiring after B.C. court renews injunction", "paragraph": "A B.C. judge has reaffirmed a court injunction against a Vancouver \"childbirth activist\" who has repeatedly acted as an illegal midwife.In a judgment last week, B.C. Supreme Court Justice Ward Branch updated the language in a court order originally issued against Gloria Lemay more than 18 years ago. The amended order permanently prohibits Lemay from acting as a midwife under the most recent provincial regulations.For more than two decades, Lemay has refused to register with the College of Midwives of B.C., but has continued to attend births, defying injunctions against her. The college said Tuesday that it has received recent reports from hospitals and health professionals that suggest Lemay has continued to practice illegally as a midwife.College registrar Louise Aerts said that the latest court judgment is about public safety.\"We are pleased that the Supreme Court of B.C. agrees with the college and has recognized the necessity of restricting Ms. Lemay's ability to practice, and the importance of informing the public of her illegal practice,\" Aerts said in a news release.On Thursday, two days after the decision came down, Lemay announced on Facebook that she is retiring from attending births and has moved to Duncan. The post does not mention the renewed court order against her, but says that at 71 years old, \"I can't lug the equipment or do the long hours.\"Lemay has spent time behind bars in the past for ignoring court orders. In 2002, she was sentenced to five months in jail for taking part in 10 home births after a conviction for criminal contempt of court.At the time, she was charging $2,500 per birth, according to the college.She was also found guilty of contempt of court in 1995 for refusing to answer questions during a coroner's inquest into the death of a newborn in her care. The three-day-old baby, Eli Foidl-Gosnell, died of blood poisoning from an E. coli infection after Lemay delivered him at home.And in 1986, Lemay was found guilty of criminal negligence causing death in connection with another delivery, but was acquitted on appeal to the Supreme Court of Canada. The high court ruled that Lemay couldn't be convicted of the charge because a fetus isn't a legal person.Lemay has said she refuses to register with the college because she doesn't agree with its policies, which include recommending vitamin K for newborns to prevent hemorrhagic bleeding and inducing labour in certain patients.She describes herself online as a \"childbirth activist.\"Bethany LindsayJournalistBethany Lindsay has more than a decade of experience in B.C. journalism, with a focus on the courts, health and social justice issues. She has also reported on human rights and crimes against humanity in Cambodia. Questions or news tips? Get in touch at bethany.lindsay@cbc.ca or on Twitter through @bethanylindsay.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}