{"id": "More teens in Sask. are smokers than in any other province: Health Canada survey", "paragraph": "Saskatchewan teens are smoking almost three times more than their peers in other provinces, according to newly released numbers.Health Canada's 2017 Canadian Tobacco Alcohol and Drugs Survey found that 21.9 per cent of youth aged 15 to 19 identified as tobacco smokers, compared to a national rate of 7.9 per cent.\"Nationally, the rate has continued to fall and has continued to fall among other provinces and ours has remained stubbornly high,\" said Donna Pasiechnik, who is a health policy analyst with the Canadian Cancer Society in Regina.The concern, she said, is about youth smokers turning into lifelong addicts with lifelong health complications. Pasiechnik said Saskatchewan has fallen behind other provinces and needs to do more to help cut back tobacco consumption.\"We pull in nearly $300 million a year in tobacco taxes. We don't spend anything to help people quit or or stop people from starting,\" she said.Pasiechnik said she has worked in tobacco control for 15 years and is frustrated because health groups continue to ask for change to no avail.\"It's a concern, of course, because if we don't control tobacco we will not control cancer. It's disheartening,\" she said.Pasiechnik said simple measures such as banning smoking at all playgrounds and on hospital grounds can make a difference. She said seven other provinces have banned smoking on all outdoor bar patios. A ban on all flavoured tobacco and requiring retail licenses could also help control tobacco, she said.She questioned why people need a license to sell cannabis but not tobacco, which she called \"the deadliest consumer product on the market.\" Furthermore, she suggested the sale of tobacco be banned at post-secondary institutions and sporting facilities. \"We cannot do this alone. Municipalities have stepped up. The federal government has stepped up. It's time for the Saskatchewan government to step up,\" she said.Pasiechnik said higher tobacco taxes would be one of the most effective ways to reduce smoking, but that past recommendations to the province have fallen on deaf ears.\"I don't know who's in their ear, but it's certainly not us, because it's not just the Cancer Society calling for this. Doctors have called [for it], the Lung Association, the Saskatchewan Coalition for Tobacco Reductions,\" she said. \"In a province where we're trying to grapple with rising health care costs, why are we not taking this problem more seriously?\"Saskatchewan Health Minister Jim Reiter said the province already has \"very high taxes on tobacco,\" but that tax rates will be reviewed with this year's upcoming budget, as they are every year. Reiter said he would like to meet with members from the Cancer Society to hear their \"perspective\" on the issue. \"We're extremely concerned if rates are going in the wrong direction,\" he said. \"We don't want people to be smoking. Its a huge drain on health care and it causes tragedy in families everywhere.\" - with files from Adam Hunter.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}