{"id": "NATO wants to keep tensions low in the High North, says Secretary General Jens Stoltenberg", "paragraph": "Even as NATO is conducting its largest military exercise since the end of the Cold War — close to the Arctic Circle in Norway — the alliance wants to keep the High North an area of low tension, NATO Secretary General Jens Stoltenberg said Tuesday.Nearly 50,000 NATO soldiers — including about 2,000 Canadians — backed by some 250 aircraft, 65 ships and up to 10,000 vehicles from all 29 NATO countries, as well as Sweden and Finland, began massive war games last week that involve land, sea, air and cyber capabilities.The exercise, code-named Trident Juncture, has drawn Moscow's ire, which accuses the alliance of stoking tensions in the region.Stoltenberg rejected Moscow's claims that the exercise is a thinly disguised threat against Russia.The exercise is not directed against anyone and is purely defensive in nature, Stoltenberg said.\"This is a necessary exercise to make sure that NATO continues to provide credible deterrence, and the reason why we do that is to prevent conflict, of course, not to provoke conflict,\" Stoltenberg said.Trident Juncture also comes just weeks after Russia conducted its own massive Vostok 2018 exercise over vast Siberian expanses, including a significant Arctic component.\"I think we should still work on avoiding tensions in the High North because this is an area where we need also to work with Russia,\" Stoltenberg told reporters at a press conference near the city of Trondheim, Norway.\"I know that several NATO allies are working with Russia when it comes to search and rescue. We have the cooperation in the Arctic Council with several NATO allies and Russia, and we have the cooperation within the Barents Council.\"It shows that it is possible for NATO allies to be strong, predictable and firm while engaging in practical cooperation with Russia as individual nations within the framework of the Arctic Council or the Barents Sea cooperation, he added.\"We have seen increased military presence of Russia in the Arctic,\" Stoltenberg said. \"NATO is not mirroring plane by plane or submarine by submarine or ship by ship exactly what Russia is doing, but of course one of the reasons why we are strengthening our collective defence, why we are strengthening also our presence in the High North is because of what we see from the Russian side.\"The alliance is facing the most challenging security environment in a generation and NATO has responded with the biggest adaptation of its collective defence in a generation, Stoltenberg said.In addition, Russia's deployment of new nuclear-capable missiles in Europe is jeopardizing a key arms control treaty that helped end the Cold War, Stoltenberg said.U.S. President Donald Trump has threatened to quit the Intermediate-Range Nuclear Forces (INF) treaty, signed in 1987, amid allegations of Russian violations of the agreement.\"The problem is the deployment of new Russian missiles. There are no new U.S. missiles in Europe, but there are more Russian missiles capable of carrying nuclear warheads, and those missiles put the INF treaty in jeopardy,\" Stoltenberg said.\"Therefore we call on Russia to ensure that they are in full and transparent compliance with the INF treaty,\" he added.In the meantime, the alliance has a more immediate Russian missile problem to deal with, Stoltenberg said.NATO was notified by Moscow last week of a planned missile test in international waters off Norway's coast due to begin Nov. 1 — in the same waters where alliance warships, including four Canadian ships, will be training to secure sea lines of communication, Stoltenberg said.\"I expect Russia to behave in a professional way. We will not change the plans of our exercise,\" the NATO chief said, adding that NATO would monitor the Russian operation, which is scheduled to end Saturday.Stoltenberg welcomed the upcoming meeting of the NATO-Russia Council on Wednesday in Brussels but declined to comment on the agenda.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}