{"id": "Yes and No camps make final push on day before Calgary Olympic plebiscite", "paragraph": "The Yes and No sides of the Olympic debate are making their final pitches with less than 24 hours to go before a plebiscite on whether Calgary should bid on the 2026 Winter Games. Jeanne Milne with No Calgary Olympics was set up at Market Mall on Monday morning helping voters determine their polling location. She said there was a lot of interest in the vote. \"It really is a conversation about the future of Calgary. So it's really exciting to us that people are so engaged and so involved and they really want to have their voices heard,\" she said. \"We're hearing a lot of people aren't against the Olympics, they're just wondering if this is a project that Calgary should be considering if it means delaying or putting off some other key projects for the city.\"On Monday night, some Calgarians received a robocall from Calgary Mayor Naheed Nenshi, urging people to vote yes on Tuesday.Jason Ribeiro with Yes Calgary 2026 said his organization is continuing to focus on supporting its volunteers.\"In the last week we have registered 5,000 volunteers that are willing to not only help us in this effort but also willing to help us in 2026 should we host the games, and committing to volunteer,\" he said. The Yes campaign has relied on those volunteers to pitch to neighbours and friends, while distributing things like signs for front lawns. Ribeiro says although the vote is non-binding, he thinks a No vote is the end of Olympic ambitions. However, he does note it's a rejection of the particular hosting plan that is currently on the table.Regardless of the way Calgarians vote, the city's returning officer says Elections Calgary is ready for high turnout. \"Well, we're prepared for 100 per cent of Calgarians who are eligible to vote, to come out and vote tomorrow, so that would be probably another 715,000 people voting tomorrow,\" Laura Kennedy said Monday. She said they've learned from the 2017 election, which featured long lines and a shortage of ballots at some locations. New this time is a more streamlined process within the polling stations and enough ballots for well over 100 per cent voter turnout.Eligible voters must cast their ballot at their designated poll and can find that information on the Elections Calgary website. Tuesday's vote will mark the first time Calgarians have voted in a plebiscite separate from a general election since 1979. That year, citizens were asked their opinion on a master development plan for city hall and the surrounding area. The plan was rejected by a majority of the 120,000 who voted, said Kennedy. Polls are open from 8 a.m. to 8 p.m. on Tuesday, with results expected around 10 p.m.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}