{"id": "Canada's defence spending questioned at NATO parliamentary meeting", "paragraph": "The deputy minister of national defence has told a NATO meeting in Halifax that Canada is satisfied it is spending what it requires to meet its alliance and other military commitments.Jody Thomas held fast to the government's stance on defence spending on Saturday, despite some pointed questioning about Canada's commitment following her presentation before NATO's defence and security committee, part of the NATO Parliamentary Assembly in Halifax.U.S. Republican Rep. Michael Turner, the committee's acting chairman, asked whether Canada intends to table a plan for meeting the two per cent of GDP standard for defence spending that was agreed to by alliance members at a summit in Wales in 2014.\"Many of the nations that are here are either meeting their two per cent or have in place a plan to reach the two per cent,\" said Turner. \"Canada is one of those countries who has not yet put forward a commitment to reach the two per cent although that is a commitment that Canada joined in making at Wales.\"Thomas stuck to the Liberal government's line, saying Canada intends to increase its defence budget by 1.46 per cent by the end of 2024.\"Canada's defence budget is growing by 70 per cent as a result of Strong, Secure, Engaged (Canada's defence policy),\" said Thomas. \"We also on the ground are leading a significant number of operations, and we have never not participated in a NATO commitment or operation.\"She also reiterated that Canada believes it contributes to the alliance in a \"qualitative\" way through an active participation in the alliance.\"The defence budget is a significant increase in funding for national defence and our prime minister is very satisfied with that contribution,\" Thomas said.But Bob Stewart, a member of the United Kingdom delegation, reminded Thomas that Canada agreed to the commitment, adding that it's \"crucial\" it be honoured.Stewart, a Conservative MP, then questioned Canada's current defence spending commitment.\"It's something like 1.12 per cent at the moment and honestly, it's not enough,\" said Stewart. \"There are many nations that are not doing enough and I include my own nation ... we have all got to contribute more and help the United States that bears the burden.\"Thomas shot back that Canada's funding includes its commitment to North American Air Defence (NORAD) and she stated that there are \"inconsistencies\" in the way the military budgets of member countries are assessed.\"The fact is that who counts what differs from country to country,\" she said.Later in the day, Defence Minister Harjit Sajjan said budget numbers don't necessarily reflect a country's actual contributions to NATO.\"The NATO Parliamentary Association may not be fully briefed about what is actually discussed at NATO,\" he said in an interview with The Canadian Press.\"All of this is useless if you don't make contributions,\" he said, citing a list of Canadian contributions that include leading a battle group in Latvia, providing air policing over Romania, leading a NATO training mission in Iraq and building a new fleet of Canadian warships.A report released by NATO ahead of last July's alliance summit in Brussels predicted Canada would spend 1.23 per cent of its GDP on defence this year — less than last year's level of 1.36 per cent. That leaves Canada ranked 18th out of the alliance's 29 members.The decline is largely attributed to two one-time expenses last year:In an interview with The Canadian Press, British Air Chief Marshal Stuart Peach, who is chairman of the NATO Military Committee, praised Canada for its \"very strong support for the alliance.\"Peach pointed to ongoing naval exercises and Canada's support for NATO's forward deployment in the Baltic states along with its support for the training mission in Iraq.With regards to the two per cent target he remained diplomatic, saying that NATO officials have maintained there are three elements to the overall funding conversation.\"There is defence spending which is about the money, there's then a description and important modernization adaptation of NATO's capabilities of which Canada plays an important role,\" Peach said.\"And then there's the question of contributions and I've already set out how pleased we are with the range of Canada's contributions.\"Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}