{"id": "Patriotic pastry propels Eastport boy into recipe books", "paragraph": "Eight-year-old Noah Squire has earned a place in a national cookbook by blending, cutting and mixing a uniquely Canadian creation.Noah is one of 26 children who will see their submitted recipes in a Kid Food Nation cookbook, set to be distributed this fall.Noah, with a bit of help from his mom, created a granola-yogurt bar that prominently features strawberries cut up into the shape of a Canadian flag.\"Because it's where I live, in Canada,\" he explains. \"It's kind of easy to make, and that's what I picked.\"The recipe uses oats, maple syrup and coconut — and while Noah says his mom is responsible for the pitted dates — Amanda Handcock says her son deserves the credit.\"He actually came up with it mostly himself, I have to say,\" she said. \"I helped him along, just a couple of ingredients to get the ingredients to stick together and so on.\"CBC Newfoundland Morning host Martin Jones outfits Noah Squire with his personalized chef's hat during a cooking lesson at Noah's home in Eastport.Handcock says Noah first spotted the Kid Food Nation program — run by the President's Choice Children's Charity and Boys and Girls Clubs of Canada — during an advertisement on YTV.He kept asking and asking to enter, but it slipped Handcock's mind, leading to a last-minute submission to the competition.\"The next thing you know, I got an email a couple months later that his recipe had been selected,\" she said.Noah said he's a fan of pizza and cookies, and some Newfoundland staples, like grouse.Handcock said she's been trying to get her two kids involved in cooking, even at a young age.\"Because of Noah's [peanut] allergy, we try to eat healthy and we've always been geared toward fruits and vegetables,\" Handock said.\"They're usually my guinea pigs, so they're usually in the kitchen with me, you know ... trying everything and I'm trying to tell them that it's healthy and get them to eat it at the same time, because kids don't want to do that.\"\"She's a good cooker,\" Noah added.Along with a spot in the cookbook, Noah won a trip to Ottawa for a Kid Food Nation gala.He said it felt \"awesome.\"\"There was like a supper — first of all, you get to make stuff, and then the next day it was like a big gala,\" he said.The small chef said he had no plans to enter the competition next year, but his younger sister might.Noah's breakfast bars got a passing grade from CBC Newfoundland Morning host Martin Jones.With files from CBC Newfoundland MorningRead more stories from CBC Newfoundland and LabradorAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}