{"id": "Campbellton city council accuses minor hockey of boycotting arena, playing politics", "paragraph": "The war of words from Campbellton's mayor and council continues as another press release related to the ongoing issue of who has to have leisure cards to use the city's arena accused the Restigouche North Minor Hockey Association of playing politics at the expense of children.The three page press release, titled, \"Regional Civic Centre, Leisure Cards, Minor Hockey – The facts\"  and posted on the city's Facebook page Friday night states the minor hockey association was boycotting the arena.\"These individuals have decided to play politics and use the association as their vehicle to voice their frustration at the expense of our children?\" the release read. \"If Minor Hockey wants to continue playing politics, they should lobby all non-contributing municipalities and get them to pay for the leisure cards for the children of their respective municipalities.\"  The release was in response to Monday's decision by the minor hockey association to use the arenas in Dalhousie and Belledune for practices and games and not make use of Campbellton's civic centre. That decision came after Campbellton Mayor Stephanie Anglehart Paulin issued a statement Oct. 12, again on a Friday night, stating if the association didn't turn over the list of players names with their leisure card numbers, there would be no more ice time allocated to the association.RNMHA refused to do so and president Marcel LeBlanc said the hockey association couldn't release the names and personal information due to privacy issues and policies from Hockey New Brunswick and Hockey Canada.LeBlanc added they had tried to negotiate paying a reduced amount for the leisure cards for each player or paying the full price for the ice rental but both options were rejected.\"All minor hockey's going to be played here in Dalhousie at the present time. Campbellton did not get come back to us with anything in our favour so we're looking forward to playing here in Dalhousie,\" LeBlanc said.LeBlanc said Saturday he heard about the press release but had never read it. He did say the association had equal representation from all areas on the board of directors and was not favoured for outside areas. The press release suggests the board was not fulfilling its duty by representing all regions fairly.\"Campbellton, Tide Head, Listuguj and Pointe-a-la-Croix's parents should be really upset with the association as the association is not recognizing those parents's contributions toward the Civic Centre,\" the city's release said.But Campbellton parent Marc Lejeune disagreed with that and in a Facebook comment, he called on Anglehart Paulin to get the situation resolved.\"I'm also a volunteer for minor hockey. So saying that the Minor Hockey volunteers are from communities that don't pay into the Civic Center is false. There are many of us that live in Campbellton. The ones that speak for us are our voice,\" Lejeune wrote.\"Like you should be the voice for the residents of Campbellton. Looking out for our best interest. Paying high taxes to support the Civic Center and driving my son to Dalhousie for hockey is not in our best interest!\"Others also commented including Atholville ​Mayor Michel Soucy who questioned why city council was using Facebook to 'express some statements on such a delicate subject.'\"Our municipality invited the City to invite all partners to sit around a table to have such discussion. I feel very sad with this approach! Our door is still open and we need to put everything on the table in a responsible manner.\"Campbellton's city council voted Aug. 30 to implement a $200 user fee for non-residents to use the Memorial Civic Centre. That fee buys a \"leisure card\" which serves as proof that someone living outside the city has paid their dues.The city is trying cover the shortfall in the $1.2 million it needs to operate the multi-sport and recreation conference facility.Surrounding municipalities and local service districts were invited to enter into agreements to contribute to the operating costs or help the city pay the cost of leisure cards for their residents.LeBlanc said while no one on the minor hockey board disagreed with what city council wanted to do in regards to the leisure cards, they did question why some users of the arena were offered special rates or reduced leisure card fees but minor hockey wasn't.\"For example, the high school, they don't need no cards. The gentlemen's hockey league, they don't need no cards. Why is it that it's only minor hockey that needs cards.\"LeBlanc said he didn't know what would happen to two hockey tournaments RNMHA has been hosting , one for 47 years but he's hopeful they won't have to cancel.CBC received no response to calls and emails sent to Mayor Stephanie Anglehart Paulin. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}