{"id": "Trudeau's scheme to dismiss some carbon tax plans shows he wants a fight: Manitoba premier", "paragraph": "Justin Trudeau's government is making its case for re-election by pitting itself against the provinces who oppose his carbon tax, Manitoba Premier Brian Pallister asserts.Pallister is disgruntled his made-in-Manitoba green plan got the thumbs-down when other climate plans he deems insufficient, like Quebec's and Newfoundland and Labrador's, were approved. \"The politics in this is evident,\" said Pallister​.\"They believe they have a coalition of urban Ontario, Quebec east and B.C., and they think they can win the next election on that basis. I don't want to sound cynical, but I've seen this too many times from Liberal governments.\" Pallister held court with media Wednesday afternoon to decry what he characterizes as the divisive tactics of the federal government.He said governments should be working together to fight climate change, not bickering over a \"two-tiered carbon tax structure.\"Pallister said Quebec's cap-and-trade program is much less stringent than the flat $25-per-tonne price he proposed before he withdrew the carbon tax — a main tenant of his green plan — because Ottawa wasn't satisfied.He added Newfoundland and Labrador is receiving concessions for its plan because of its under-construction Muskrat Falls hydroelectric project, but Manitoba isn't being recognized for the clean energy it produces.Watch Minister of Intergovernmental Affairs Dominic LeBlanc explain the backstop on Power & Politics:\"They will not give us consideration for either getting out of coal, which we've just done, or our hydroelectric investments, which we're in the middle of investing,\" Pallister said.\"We're not getting credit for what we're really doing and Newfoundland is getting credit for something they may do. This does not make sense.\"On Tuesday, the federal government followed through on its threat to slap a carbon tax on the provinces without an adequate emissions pricing plans of their own: Manitoba, Saskatchewan, Ontario, and New Brunswick.In a statement Wednesday, Minister of Intergovernmental Affairs Dominic LeBlanc said the federal government tried to give Manitoba the flexibility to come up with a plan. \"Earlier this month, Manitoba [cancelled] their own plan to price pollution. In making pollution free again, they joined the Harper-Scheer Conservatives who have no plan to fight climate change,\" LeBlanc said. \"We are disappointed with the Manitoba government's lack of leadership on pricing pollution. As we've said all along, if provinces refuse to make polluters pay, we will — and we'll give the money back to Canadians,\" he said.\"We know that making polluters pay is good for the economy and good for the environment, which means that it's good for the middle class.\"To offset most of the added costs of the carbon tax, annual rebates will be sent to Canadian families.In Manitoba, the average family will pay $233 more in 2019 as a result of the carbon tax, and get a $336 rebate in the first year of the plan. That's a net rebate of $104, based on average costs and rebates.The $20-per-tonne carbon tax, along with the rebate to each Manitoban, will rise every year until the $50-per-tonne target is reached in 2022. Pallister said Wednesday his government would decide within a couple weeks whether it will proceed with a legal challenge. The province may strike out on its own, rather than intervene in the case pursued by Ontario and Saskatchewan, he said.It is Pallister, not Trudeau, who should be blamed for making politically motivated decisions, Manitoba Liberal Leader Dougald Lamont said.\"He shouldn't be talking about suing people. He should be at the table trying to negotiate something, but that's not what happened — he walked away.\"NDP Leader Wab Kinew said the carbon agreements Trudeau reached with other provinces shows a desire to negotiate.\"It sounds like the premier gave up too easily,\" he said.Pallister said he has not had formal discussions with Ottawa on the carbon tax since Manitoba's surprise decision earlier this month to scrap his plan. He said discussions between the governments in recent weeks have centred on assurances Ottawa would still give Manitoba $67 million to help reduce carbon emissions, as previously announced.The $20-per-tonne carbon tax will result in an approximate cost increase of 4.42 cents a litre for gasoline, 3.91 cents per cubic metre for natural gas and 3.10 cents a litre for propane, according to the federal government.Ian FroeseReporterIan Froese is a reporter at CBC Manitoba. He previously wrote about rural Manitoba for the Brandon Sun and the Carillon in Steinbach. Story idea? Email ian.froese@cbc.ca.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}