{"id": "Vatican orders U.S. bishops to delay vote on sex abuse scandal", "paragraph": "At the Vatican's insistence, U.S. Catholic bishops abruptly postponed plans Monday to vote on proposed new steps to address the clergy sex abuse crisis roiling the church.Cardinal Daniel DiNardo of Galveston-Houston, the president of the U.S. Conference of Catholic Bishops, said he was told on the eve of the bishops' national meeting to delay action until after a Vatican-convened global meeting on sex abuse in February.\"We are not ourselves happy about this,\" DiNardo told reporters in an unusual public display of frustration at a Vatican pronouncement.\"We are working very hard to move to action — and we'll do it,\" he said. \"I think people in the church have a right to be skeptical. I think they also have a right to be hopeful.\"The bishops are meeting through Wednesday in Baltimore and had been expected to consider several steps to combat abuse, including a new code of conduct for themselves and the creation of a special commission, including lay experts, to review complaints against the bishops.                          The bishops plan to proceed with discussing the proposals, which were drafted in September by the bishops' administrative committee. Cardinal Blase J. Cupich, of Chicago, suggested the bishops could hold a non-binding vote on the proposals while in Baltimore and then convene a special assembly for a formal vote after considering the results of the global meeting in February.\"I realize that another meeting will create logistical challenges for the conference staff and the bishops' schedules, but there is a grave urgency to this matter and we cannot delay,\" Cupich said.Abuse scandals have roiled the Roman Catholic Church worldwide for decades, but there have been major developments this year in the U.S.In July, Pope Francis removed U.S. church leader Theodore McCarrick as a cardinal after church investigators said an allegation that he groped a teenage altar boy in the 1970s was credible. Subsequently, several former seminarians and priests reported they too had been abused or harassed by McCarrick as adults, triggering debate over who might have known and covered up McCarrick's misconduct.In August, a grand jury report in Pennsylvania detailed decades of abuse and coverup in six dioceses, alleging more than 1,000 children had been abused over the years by about 300 priests. Since then, a federal prosecutor in Philadelphia has begun working on a federal criminal case centred on child exploitation, and attorneys general in several other states have launched investigations.DiNardo, in his address opening the bishops' assembly, told survivors of clergy abuse he was \"deeply sorry.\"\"Some would say this is entirely a crisis of the past. It is not,\" DiNardo said. \"We must never victimize survivors over again by demanding they heal on our timeline.\"After DiNardo's address, the bishops adjourned to a chapel for a daylong session of prayer that included remarks by two survivors of clergy abuse who have worked to promote healing and reconciliation among other victims.\"Please understand the heart of the church is broken and you need to fix this now,\"' Luis A. Torres Jr. told the bishops. \"You were not called to be CEOs ... You were not called to be princes. Be the priests that you were called to be. Please act now. Be better. Be good.\"Outside the conference hall, news of the delay in voting angered some protesters who were demanding the bishops take strong action against abuse.\"I know that they answer to the Holy See, but there's a bigger imperative here, which is that children and victims need them to step forward,\" said Anne Barrett Doyle, who works at the abuse database BishopAccountability.org. \"By complying so meekly with what the Pope has demanded of them today, they are surrendering their responsibility.\"Liz McCloskey, part of a coalition of concerned Catholics called the 5 Theses movement that has posted its proposals for reform on church doors in Baltimore and other cities, said the stakes couldn't be higher. She said Catholics were \"leaving in droves\" in the absence of significant reforms and full transparency.\"Delaying taking any action in response to the sex abuse scandal is not only a public relations nightmare but a moral failing,\" McCloskey told The Associated Press.Her group's proposals for the bishops include co-operating fully with investigations and releasing names of credibly accused clergy, committing to shedding regalia and living simply, and asking Pope Francis to put women in leadership posts.DiNardo said the bishops didn't complete a final draft of their proposed anti-abuse actions until Oct. 30 and the Vatican, with relatively short notice, sought to delay voting because of potential legal complications.Nonetheless, John Gehring, the Catholic program director at a Washington-based clergy network called Faith in Public Life, said the Vatican \"just made a big mistake.\"\"The optics are terrible, and it sends a message, intended or not, that Rome doesn't recognize the urgency of the moment,\" Gehring tweeted .Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}