{"id": "Road To The Olympic GamesMoguls star Kingsbury feeling lighter, fitter, faster, stronger ", "paragraph": "Just 26 years old, freestyle skiing sensation Mikael Kingsbury has already rewritten the moguls record book.He has no plans to slow down now that the new quadrennial is here.\"It's fun to see the evolution of myself,\" Kingsbury said.Kingsbury won two Crystal Globes last season — the moguls crown and the overall freestyle title — to go with his gold medal from the Pyeongchang Games. He also enjoyed a record run of 13 straight World Cup victories before settling for silver behind Japan's Ikuma Horishima last January in Mont-Tremblant, Que.Kingsbury, from Deux-Montagnes, Que., started eating a \"little cleaner\" in the off-season and said he's in the best shape of his life. His sleep habits have also improved and he has more energy throughout the day.Kingsbury captures gold in Pyeongchang:The changes have paid off at the gym and on the slopes.\"That can make a difference sometimes in a World Cup when you arrive in the super-final,\" Kingsbury said in a recent interview from Montreal. \"For your last run, you want to be on the top of your game. That's like a little bonus that I'm going to have maybe this year compared to the previous season.\"You always want to improve season after season. Sometimes, especially when you've reached all of your goals, you still want to dominate the sport. Those are the little things that can help you stay on top.\"There have been some changes within the Canadian program in recent months.Women's moguls coach Michel Hamelin will also guide the men's team this season. Longtime national men's coach Rob Kober is now coaching the Alberta moguls team.Get to know Mikael Kingsbury:In addition, Peter Judge has returned as Freestyle Canada chief executive officer. He held the position from 2004-14 before leaving after the Sochi Olympics to become Own the Podium's director of winter sport.Over the off-season, Kingsbury has been trying to add some rotation to his flips while exploring new combinations for grabs during his runs. He has also been working on a cork 1440 — essentially a triple-twisting somersault — and hopes he'll be the first skier to land it in competition.\"That's still ready,\" he said. \"I'm just waiting for the right opportunity to do it.\"The faster speed and improved jumps have raised Kingsbury's comfort level. The two-time world champion appears primed to continue his remarkably steady progression over his 10-year run on the national team.Watch Kingsbury's Olympic journey:\"He would out-work everyone else in the world but it's not work for him,\" Kober said.\"A lot of driven athletes have a chip on their shoulder and their self-esteem is totally dependent on their success as an athlete,\" he added. \"That is not Mik at all. He is a very well-adjusted young man.\"A silver medallist behind Canada's Alex Bilodeau at the Sochi Games, Kingsbury also has his eye on the 2022 Winter Olympics in Beijing.\"I love seeing it [as] defending what I have,\" Kingsbury said. \"For sure, I'll be ready. I'll be older and much wiser and more experienced. It's going to be different in 2022. Not as much pressure as I had this year in 2018. I'm excited but it's still a long road ahead to Beijing.\"His first stop is the Dec. 1 season opener at Ruka, Finland.\"The passion is still the same,\" Kingsbury said. \"That's what I'm very happy about. I'm still in love with the sport.\"To encourage thoughtful and respectful conversations, first and last names will appear with each submission to CBC/Radio-Canada's online communities (except in children and youth-oriented communities). Pseudonyms will no longer be permitted.By submitting a comment, you accept that CBC has the right to reproduce and publish that comment in whole or in part, in any manner CBC chooses. Please note that CBC does not endorse the opinions expressed in comments. Comments on this story are moderated according to our Submission Guidelines. Comments are welcome while open. We reserve the right to close comments at any time.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}