{"id": "Bye bye, birdie: Iconic Inglewood goose sign won't be part of new, modern bridge", "paragraph": "When the old Ninth Avenue bridge is retired next year, its iconic Inglewood goose sign, which welcomes people to the neighbourhood from its perch above, will fly the coop as well.It's a decision that's ruffling a few feathers in the community.L.J. Robertson, the planning chair for the Inglewood Community Association, told the Calgary Eyeopener on Monday the group was told the architect for the modern replacement bridge didn't want to incorporate the old goose in the new design.\"[The goose sign] has been part of the fabric of the Inglewood gateway for that part of the community for many, many years,\" Roberston said.\"It's just a really odd thing to think that an employee on a civic project would have that kind of sway and control.\"The 109-year-old bridge will be replaced by a four-lane, arch-design span that is expected to cost $23 million. \"The new bridge arch has a more modern esthetic compared to the old truss, and the project team did not believe that attaching the sign to the new bridge would fit the context of this design,\" Evan Fer, senior structural engineer with the city, said in an emailed statement.Fer did say, however, the team is looking at options for incorporating the sign elsewhere in the vicinity, like in Statue Park.The iconic goose doesn't adorn just the bridge sign. It's also in the community association's letterhead.Robertson said she fears the historic neighbourhood is losing part of its identity.\"We will have lost, when by the time this is all said and done, two very old bridges that were really part of the infrastructure for the community and they both had geese attached to them,\" she said.\"It's been something that's been attached and part of the history and our riparian location for many years.\"Coun. Gian-Carlo Carra said he is sympathetic and thinks there might need to be a conversation about how the existing sign could be incorporated in a new way.\"I'm not prepared to say we will slap the goose sign onto the new bridge come hell or high water,\" said Carra, who represents Ward 9.The new bridge is expected to open in the fall of 2020 or in early 2021.With files from the Calgary Eyeopener.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}