{"id": "Alberta minister Shannon Phillips says Bill C-69 inadequate in current form", "paragraph": "Alberta's energy minister urged senators Wednesday to amend federal legislation that would overhaul energy project reviews.Environment Minister Shannon Phillips tried to make Alberta's case to the Senate that Bill C-69 can't be passed in its current form.After meeting with nearly 50 senators Phillips told reporters it's \"fair to say\" the bill will not pass unless changes are made.\"Senate caucus groups, they are getting an earful from Albertans and Canadians, and they're in a mood to ensure this legislation works for Canadians,\" Phillips said.The bill, which is under consideration in the Senate, would create a new Impact Assessment Agency and replace the National Energy Board with the Canadian Energy Regulator.It introduces new timelines and specific steps that companies and governments will have to take in order for new energy projects to go ahead.Alberta supports the federal government's intention to modernize the assessment process and its goal of having greater confidence in the regulatory system, Phillips said.But she said there have been a number of recent failures and delays in approving major projects and her province needs certainty that Albertans can go to work.Alberta's environment minister <a href=\"https://twitter.com/SPhillipsAB?ref_src=twsrc%5Etfw\">@SPhillipsAB</a> feels Bill C-69 won't pass as is, following her conversations with senate groups today. Here's part of her conversation on <a href=\"https://twitter.com/PnPCBC?ref_src=twsrc%5Etfw\">@PnPCBC</a> <a href=\"https://twitter.com/hashtag/ableg?src=hash&amp;ref_src=twsrc%5Etfw\">#ableg</a> <a href=\"https://twitter.com/hashtag/abpoli?src=hash&amp;ref_src=twsrc%5Etfw\">#abpoli</a> <a href=\"https://twitter.com/hashtag/cdnpoli?src=hash&amp;ref_src=twsrc%5Etfw\">#cdnpoli</a> <a href=\"https://t.co/41FGS4Gv2U\">pic.twitter.com/41FGS4Gv2U</a>Alberta is looking for more clarity in the legislation, she said, including on review timelines, and wants clearly spelled out that downstream emissions — from the burning of fossil fuels— would be excluded from reviews.The federal government has set aside $74.6 million to pay for the transition to new impact assessment and regulatory processes, according to supplementary estimates tabled Wednesday.The new process is intended to broaden impact assessments to consider health and socio-economic factors in addition to environmental ones, create an early engagement phase, and strengthen partnerships with Indigenous peoples, the document said.'Nail in the coffin': Oilpatch boosters demand Ottawa overhaul 'terrible' Bill C-69Phillips said senators have an \"appetite to intervene\" on the piece of legislation before them by matter by making amendments to the legislation.Caroline Theriault, a spokeswoman for Environment Minister Catherine McKenna, said the government consulted other levels of government, industry groups and Indigenous partners, for over two years before the legislation was passed by the House of Commons.\"Greenhouse gas emissions are inherently an area of shared jurisdiction. As we have stated consistently, our approach will recognize Alberta's Climate Leadership Plan and the means by which emissions are managed,\" said Theriault.Phillips did not meet with her federal counterpart Catherine McKenna today, saying she is well aware of Alberta's concerns.\"This is too important to get wrong and we will work with who ever wants to work with us to make it right.\"Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}