{"id": "Vancouver lawyer who prosecuted Khmer Rouge leaders welcomes genocide verdict", "paragraph": "A Vancouver lawyer who helped prosecute two of the Khmer Rouge's most senior surviving leaders is breathing a little easier after a tribunal this week found the two elderly Cambodian men guilty of genocide and other crimes.Dale Lysak says he has been waiting more than a year for the joint UN-Cambodian tribunal's ruling against Nuon Chea and Khieu Samphan, and that the verdict ensures some accountability for one of recent history's worst atrocities.\"I'm very satisfied,\" Lysak said in an interview. \"I've been waiting for over a year to get the judgment on this trial and it feels great.\"An estimated two million Cambodians were killed during a bloody four-year period after the Communist-inspired movement known as the Khmer Rouge took over the poor Southeast Asian country in 1975.Lysak was one of several prosecutors during the nearly decade-long tribunal hearings, and he told The Canadian Press he felt the weight of responsibility for all those affected by the murderous regime during his eight years working on the tribunal.That included when he led the prosecution's cross-examination of Nuon Chea, who served as second in command to Khmer Rouge leader Pol Pot, who died in 1998. There were also daily reminders as survivors sat in the courtroom to listen to the trial.\"What drove a lot of hard work over a really long period of time was that understanding that this was kind of the one chance to get justice for one of the worst incidents of mass atrocities in modern history,\" Lysak said in an interview.The tribunal has been criticized for its $300-million cost and duration, which resulted in only three Khmer Rouge leaders being found guilty, but Lysak says the alternative is unimaginable.\"The alternative is that we accept no one is going to face justice or face a courtroom for what are some of the worst atrocities of all time,\" he said. \"And I don't see that as a palatable argument.\"Lysak's involvement in the tribunal was almost an accident. After practising commercial law in San Francisco for several years, he did some travelling and ended up in Cambodia in 2008 — just as the tribunal was getting underway.The tribunal's lead international prosecutor at the time was Justice Canada lawyer Robert Petit and when Lysak asked the fellow Canadian whether he could volunteer for a few months, Petit jumped at the offer.While Petit would eventually resign in 2009, citing family reasons as well as frustration with the tribunal, which has long been plagued with allegations of political interference by the Cambodian government, Lysak stayed until closing arguments last year.And then, after returning to Canada, he and everyone else waited until this week to find out the court's verdict.Nuon Chea, 92, and Khieu Sampath, 87, had been found guilty of crimes against humanity and sentenced to life in prison in 2014 for the forced displacement of millions of people and mass disappearances during the start of the Khmer Rouge's brutal rule.The most recent verdict related to the murders, tortures and other atrocities committed in the years afterward. The finding of genocide was particularly notable, however, as scholars had debated for decades whether such a crime had been committed.The tribunal judges ruled that a genocide had occurred because the Khmer Rouge targeted Cambodians of Vietnamese descent as well as the country's Muslim population.Some have questioned whether the tribunal was worth it given the high cost in money and time to convict only a small number of Khmer Rouge leaders; besides Nuon Chea and Khieu Sampath, only one other person has been tried and convicted.In 2010, the tribunal convicted Kaing Guek Eav, better known as Duch, who as head of the Khmer Rouge prison system ran the infamous Tuol Sleng torture centre in Cambodia's capital, Phnom Penh.Others have said the tribunal, which likely won't prosecute any more former leaders, should have been able to accomplish more.While he acknowledged those criticisms, Lysak said international criminal cases are always going to be expensive because of their nature while the Khmer Rouge tribunal was necessarily complicated because of the passage of time.The tribunal's mandate was also limited to prosecuting only the most senior leaders, while Lysak and his colleagues had to prove that the regime's leaders were responsible for the actions of their subordinates.\"These international tribunals are expensive by nature, so there's always going to be that kind of criticism,\" he said.\"But I think when we're talking about killings of this magnitude, look at the amount of money spent for each person who died and it comes to $100 per victim. Does that seem like a lot of money to pursue justice? No, of course not.\"With the verdicts against Nuon Chea and Khieu Sampath, many Cambodians may finally be able to find a degree of closure to the darkest chapter in their country's history.Yet Cambodia remains embroiled in new tensions and conflict today, nearly 30 years after Canada and other members of the international community arrived as part of UN peacekeeping mission to set the country on the path to democracy and peace.The current government under Prime Minister Hun Sen has all but abandoned the trappings of democracy and targeted opposition parties, labour groups, human-rights defenders and the media in a bid to quash dissent.Lysak, who met his future wife while working in Cambodia, says it is \"discouraging\" to see what is happening in the country now, though he hopes the tribunal will inspire the next generation of lawyers and others in the country.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}