{"id": "Facebook to investigate whether anti-Indigenous slur should be added to hate speech guidelines", "paragraph": "Facebook is investigating whether a racial and gendered slur against Indigenous women should be added to its list of words that constitute hate speech.Last week, the social media platform temporarily banned an Alberta woman who called out a business owner whose company name — The Spunky Sq--w — includes the slur.Rhiannon Babyn attacked the store's owner, calling her a \"white bi--h,\" and received a subsequent temporary ban from the platform.Store staff began attacking Indigenous women who criticized the brand's name by calling them #YouDamnSq--w. The staff members' accounts did not appear to have been suspended.The store's owner, Brooke Adams, did not respond to CBC's request for comment, but she did write in a Facebook post that she felt there was \"no derogatory meaning\" to the word.Babyn and others on social media were confused and angered that the phrase \"white b---h\" was considered unacceptable, while the word \"sq--w\" was not.Facebook said in a statement it is looking into revising hate speech guidelines.\"There is no place for hate speech on Facebook. If someone reports hate speech on Facebook, we will review the material in question and remove it if it violates our Community Standards.\"As we learn from cultural groups, experts and other partners, we continue to refine the way we implement our policies to keep our community safe. Based on this feedback, our standards evolve over time, including additional words that can be used for hate speech,\" a spokesperson for the company said in an emailed statement.The spokesperson said the company is consulting with different cultural groups and academics to understand what words are and are not considered OK.Facebook said this instance was a difficult and nuanced one for its guidelines to handle, as while \"sq--w\" is considered a slur in Canada, it is also the name of a mountain range in the U.S.However, it was fair that Babyn was penalized for violating its guidelines, the Facebook spokesperson said, adding that the consequences for breaking the rules depend on the severity of each violation and the person's history on the platform.Babyn said she totally understands why she was temporarily banned and added that she's \"delighted\" to hear Facebook is taking a look at the words it considers hate speech.\"I think that's kind of awesome and hopefully Facebook can eventually … not allow people to make pages with derogatory, racial slurs in them,\" she said.The Canadian Oxford Dictionary labels the term \"offensive\" slang for an Indigenous woman, and activists say it's not appropriate to use.\"The term is an ethnic and racial slur. Contemporary use of the term is considered offensive, derogatory, misogynist and racist. Its use is not appropriate in any way,\" said Rachelle Venne, CEO of the Institute for the Advancement of Aboriginal Women, in an emailed statement.With files from Kate AdachAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}