{"id": "All flights cancelled Sunday evening at Fredericton airport as runway lights fail", "paragraph": "All flights coming in to and out of Fredericton International Airport are cancelled Sunday evening because its runway lights are out — and service won't resume until Monday morning at the earliest. \"We have had an electrical fault and unfortunately it's underground. And as you can imagine, we have kilometres and kilometres of wiring out there with the two runways,\" said Kate O'Rourke, communications officer for the Fredericton International Airport Authority.\"The electrical crews have been working on that, trying very hard to identify where it is to get those lights up and running.\"It's unclear what caused the damage to the underground wires, but New Brunswick was hit with a wind storm that knocked out power to tens of thousands of customers Saturday night into Sunday.The airport building lost power, but it's currently running on a backup generator.Due to a power outage on the airfield, the Fredericton International Airport’s runways are currently closed except during daylight hours. Electricians are working to resolve the situation so that flight operations can resume on their normal schedule. (1/2)We apologize for the inconvenience caused to our travellers, and appreciate your patience as our crews work to bring the airfield lights on as soon as possible. We will update the public as soon as the situation is resolved. (2/2)The last flight to land came from Montreal at 4:54 p.m.O'Rourke said flights are able to take off and land during the day under visual flight rules (VFR).It's unclear when power will be restored to the runway lights.Some departing flights in the morning are cancelled as well, O'Rourke said, because the planes couldn't land Sunday evening.O'Rourke recommends passengers get in touch with their airlines to find out about flight statuses.With files from Melissa FriedmanAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}