{"id": "Jobs lost as Rona stores in Newfoundland set to close", "paragraph": "Rona stores in Newfoundland will close in January, according to several employees of the home-improvement chain.Some employees found out at a meeting on Sunday evening at the Rona store on O'Leary Avenue in St. John's. \"We went in there, it was a last minute meeting ...  and they pretty much told everybody that they're all losing their jobs,\" said Devin Hawco, a Rona employee who attended the meeting at the O'Leary Avenue location. \"A lot of people have been here for years.\" Some left that meeting in tears.\"It was pretty sad in there,\" said Steven Quinlian, another Rona employee. \"B'ys been working here for almost 30 years and then one day they just come in and it's all gone.\"Hawco said employees were told stores would close Jan. 27, 2019. The company that owns Rona declined to answer questions from CBC News about how many people will lose their jobs or whether some Newfoundland and Labrador locations could continue to operate.\"It's really messed up for people who literally survive off this job,\" Hawco said. Employees were given no indication of what Sunday's meeting would be about, Hawco said.\"It was kind of a low blow.\"\"All I knew is we were having a meeting today. I just expected it was about a safety thing or something, I didn't think I was going to have to find a new job,\" said Brandon Upshall, another Rona employee.Rona's website identifies stores in St. John's, Paradise, Bay Roberts and Conception Bay South.Eric Fitzpatrick, owner of the Rona store in Wabush, Labrador, said his business is unaffected by the decision because it is independent.In 2016, U.S. home improvement chain Lowe's bought Rona, then headquartered in Quebec, in a deal valued at $3.2 billion.CBC News was at the meeting at the Rona location on O'Leary Avenue in St. John's but was not allowed in the building. A representative from Lowe's told CBC News via email that the company would not provide any information until Monday.With files from Gavin Simms and Danny ArsenaultRead more stories from CBC Newfoundland and LabradorAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}