{"id": "Barcelona, Dortmund stay perfect in Champions League", "paragraph": "Barcelona and Borussia Dortmund impressed again on Wednesday to join Juventus as the only teams with three straight wins midway through the Champions League group stage.In two clashes of teams with perfect records, Barcelona beat Inter Milan 2-0 and Dortmund dismantled Atletico Madrid in a 4-0 rout.Liverpool went back on top of an eventful Group C, beating Red Star Belgrade 4-0 while Napoli twice led at Paris Saint-Germain until Angel Di Maria's stoppage-time shot earned a 2-2 draw.Dortmund delivered the result of the night after defending a one-goal lead from sustained pressure in the second half. The Bundesliga leader added three late goals as Atletico's tempers and famously resolute defence frayed.Lionel Messi was missing for Barcelona after fracturing his right arm in a Spanish league game, but his replacement Rafinha opened the scoring in what proved to be a comfortable evening at Camp Nou.Barcelona's win at least kept Inter in range for the other Group B teams, PSV Eindhoven and Tottenham, who drew 2-2 in the Netherlands to each earn a first point.Tottenham's Champions League flaw of conceding late goals showed again as PSV captain Luuk de Jong scored an 87th-minute leveler.Minutes earlier, Tottenham goalkeeper and captain Hugo Lloris was sent off for a foul on PSV's Mexico winger Hirving Lozano.Thierry Henry's Champions League debut as a coach saw Monaco draw 1-1 at Club Brugge, leaving both teams with one point in Group A which Dortmund leads.Here's how Wednesday's action unfolded:Atletico coach Diego Simeone has long fashioned a team in his own tough image, and in eight years had never seen such a heavy defeat.Dortmund deservedly led at halftime, though Axel Witsel's 38th-minute shot took a big deflection to beat goalkeeper Jan Oblak.Witsel was targeted by forward Diego Costa in a running battle through the second half as Atletico failed to turn its chances into goals. Costa was one of five Atletico players booked, triggering a UEFA disciplinary case.Dortmund's three late goals came from the bench, with two from Portugal midfielder Raphael Guerreiro and one from new England international Jadon Sancho, who had replaced American Christian Pulsiic. Guerreiro's second and Dortmund's fourth stemmed from a slack pass in the 89th by Atletico left-back Filipe Luis.Atletico next hosts Dortmund in two weeks' time.Lionel Messi sat with his son Thiago to watch Barcelona ease past Inter Milan and take control of Group B.Messi had his right arm in a fabric sling knotted at his left shoulder as he watched Rafinha score in the 32nd and defender Jordi Alba seal the game in the 83rd.Barcelona's expected path to the round of 16 — which can be sealed in Milan on Nov. 6 — was also eased by the early kickoff draw between PSV and Tottenham.Tottenham has now conceded four goals after the 85th minute in its three Group B games, including Messi's second in a 4-2 win at Wembley this month.Those goals have cost the team five points and leave Tottenham needing to beat PSV in the return game on Nov. 6.Lucas Moura and Harry Kane scored either side of halftime to cancel out Lozano's 30th-minute opener for PSV.The three forwards who each scored 10 Champions League goals for Liverpool last season all netted at Anfield against Red Star.Roberto Firmino started the rout in the 20th and Mohamed Salah added two more, including one from the penalty spot. Salah had left the field before Sadio Mane first had a spot-kick saved, then added Liverpool's fourth.The return in Belgrade on Nov. 6 promises to be a hostile evening for Liverpool's Kosovo-born winger Xherdan Shaqiri who was booed early and often by visiting Serb fans Wednesday. At the World Cup in June, Shaqiri made a provocative hand gesture when scoring a late winning goal for Switzerland against Serbia.Liverpool leads the group with six points, one ahead of Napoli, which looked set to win in Paris after Dries Mertens made it 2-1 in the 77th. Angel Di Maria leveler lifted PSG to just a point behind Napoli before travelling there next.Veteran goalkeeper Iker Casillas saved a 10th-minute penalty from Manuel Fernandes in Porto's 3-1 win at Lokomotiv Moscow.Porto got its own penalty in the 26th, scored by Moussa Marega, and further goals came from Mexicans Hector Herrera and Jesus Corona.Lokomotiv's first Champions League goal in almost 15 years saw Alexei Miranchuk assist for his twin brother Anton.Galatasaray drew 0-0 with visiting Schalke, leaving Porto top with seven points, two clear of the Germans.To encourage thoughtful and respectful conversations, first and last names will appear with each submission to CBC/Radio-Canada's online communities (except in children and youth-oriented communities). Pseudonyms will no longer be permitted.By submitting a comment, you accept that CBC has the right to reproduce and publish that comment in whole or in part, in any manner CBC chooses. Please note that CBC does not endorse the opinions expressed in comments. Comments on this story are moderated according to our Submission Guidelines. Comments are welcome while open. We reserve the right to close comments at any time.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}