{"id": "Trudeau heads to ASEAN summit to 'mend relations' a year after thorny trade talks", "paragraph": "As Justin Trudeau and his Canadian delegation arrive in Singapore for his second Association of Southeast Asian Nations (ASEAN) summit Tuesday, they may find this year's round of Asia-Pacific talks less stressful than they were in 2017.A year ago, the 11 countries still interested in the Trans-Pacific Partnership were working feverishly to send a message to U.S. President Donald Trump's administration that the American withdrawal from their trade agreement didn't mean the rest couldn't proceed with the broad trade reforms they'd originally hammered out as a counterweight to China's growing economic power.It didn't go well.Last-minute disputes over what parts of the text to suspend, and then an apparent miscommunication over a key leaders meeting where Trudeau was a no-show, resulted in angry trading partners and international headlines about Canada standing in the way of progress.\"The Japanese were seething, and still are seething about what they perceived as last-minute betrayal by Prime Minister Trudeau,\" said Carlo Dade, the director of the trade and investment centre at the Canada West Foundation. \"The Australians were cursing us in public. \"Folks were very mad, and some of that still lingers,\" he said. Fortunately for the Canadians, it turned out to be a short-term setback.With the signing ceremony for the renamed Comprehensive and Progressive Trans-Pacific Partnership last winter, followed by its ratification by the six countries required to bring it into effect Dec. 30, tensions have eased and the united front of the TPP-11 has re-emerged to counter increasingly protectionist American trade policy. \"Part of this trip will be to mend relations,\" Dade said, \"go in with a little more ear to listen this time around.\"This year's ASEAN and Asia-Pacific Economic Co-operation (APEC) summits don't appear to have any big agreements in the offing. But that doesn't mean they aren't worth the jet lag for Trudeau.For starters, Canada's still hoping to become a member of the East Asia Summit someday.  This group of 18 countries — the 10 ASEAN members (Indonesia, Thailand, Singapore, Philippines, Malaysia, Vietnam, Myanmar, Cambodia, Brunei, Laos) plus key regional players — Australia, China, India, Japan, Russia, New Zealand, South Korea, the U.S. — meets annually, usually around the ASEAN summit, as it is this week in Singapore.It's emerged as a significant forum for not just trade, but key regional security discussions, and Canada wants a seat at this table. But it may not be in the interest of a middle power like Australia, for example, to have Canada join the club. After last year's tensions, it didn't appear Canada would be joining anytime soon, but it's likely to keep making its case in Singapore.Canada is classified as a \"dialogue partner\" at ASEAN, joining some of the discussions but not as a full member. It is a full member of the 21-country APEC club, which meets next weekend in Port Moresby, Papua New Guinea — and Trudeau is heading there next.The Trudeau government's trade diversification agenda requires not just clever trade negotiators, but a strategic diplomatic push. The more trade fights Americans pick, the greater the incentive for other countries to figure out better ways to work together.\"You want to do more trade in these regions? You simply have to show up,\" Dade said. \"It's about just getting to know the people around the table so when you have to pick up the phone to call them it's not: 'Justin who?'\"\"We're behind the Aussies, the Kiwis, even the Americans in terms of knowing the players and knowing the markets,\" he said.Last month, the Canadian government wrapped up a public consultation on the potential for comprehensive trade negotiations with the 10-country ASEAN bloc.Stakeholders expressed enthusiasm for better terms of trade for the sorts of goods and services typically associated with Canada's ambitions in Asia: more natural resources and agri-food exports, and new customers for Canadian construction and green technology services.But the ASEAN countries with the greatest potential for Canada — Vietnam, Singapore and Malaysia — are already part of the CPTPP. While others, like the Philippines or Indonesia, offer large potential markets, they're also controversial regimes to partner up with at the moment.And then there's Myanmar, also known as Burma — a country that could be condemned by some of its trading partners at these summits for persecution aimed at its Rohingya minority. It hardly seems like a priority trading partner in today's political climate.In Dade's view, a free trade agreement with ASEAN makes \"no sense.\" Its trade agreements are famously \"low ambition\" in negotiator jargon — meaning it's unlikely to agree to the kind of broad, comprehensive change Canada seeks, going beyond tariff reductions to include things like intellectual property rules and labour standards.Unlike a country like Australia that has the advantage of being geographically close, Canada's trade \"is more aspirational than it is real.\"Dade believes the Philippines may join the CPTPP eventually, and that's a better way to improve access to a market like this than separate ASEAN negotiations. ​But Yves Tiberghien, a University of British Columbia professor, thinks that if enough Canadian businesses support the idea of negotiations with ASEAN, it could be considered.\"You need, ideally, to go where there's high growth,\" he said. If Canada doesn't want to put all its Asian eggs in China's basket, it needs other partners in the region.Trudeau was asked about Canada's plans for free trade talks with the ASEAN in Paris Monday. He noted their \"fast-growing economies\" and said the government \"will have more to say in due course\" about potential negotiations.The countries currently negotiating the China-centred Regional Comprehensive Economic Partnership (RCEP) are expected to hold talks in and around these summits. That poses a challenge for Canada, which isn't interested in a \"low ambition\" deal that simply makes goods cheaper — and that's what's on offer at the RCEP table. International Trade Diversification Minister Jim Carr will join Trudeau in Singapore after spending his weekend in talks with the Chinese, as Canada continues to explore its alternatives with the world's second-largest economy.Trudeau will meet with Chinese Premier Li Keqiang at a Canada-China dialogue on Wednesday. Officials portray the leaders meeting as a chance to nail down agreement on some of the incremental progress Canada feels it's been making on specific market access issues.What form Canada's future trade co-operation with China might take appears more unclear than ever. While some in Canada suggest sector-specific talks could advance things farther and faster, the government is still pursuing a broad overall strategy, officials insist.Comprehensive talks with China in today's testy climate with the U.S., however, may be a non-starter, particularly given the language in the revised NAFTA agreement that suggests any final deal with the Chinese would need Uncle Sam's approval.Meanwhile, China recently mused about joining the CPTPP one day — something that would surely be easier for Canada than navigating its own set of negotiations.\"The U.S.-China confrontation is a big theme in the background. And on that issue, Canada is trying to hedge,\" Tiberghien said. \"The Canadian agenda is to kind of not be drawn into the war between China and the U.S.\"Amid all this, Canada needs to keep warming up its relations with Japan, a previously elusive free trade partner it's now working closely with, not only under the guise of the CPTPP but on efforts to reform the World Trade Organization as well.Canada was supposed to reach some kind of a side agreement with Japan after the conclusion of the North American trade talks to sort out discrepancies in the way the two deals interact for the automotive sector. Nothing has been released yet, leaving the industry wondering how the two deals are meant to co-exist, assuming NAFTA 2.0 is successfully ratified over the next year.Canadian officials have yet to confirm whether Trudeau will have one-on-one time with Japanese Prime Minister Shinzo Abe at these summits.Nevertheless, this year's summits are \"simpler, in a sense\" for Canada, Tiberghien said. With the CPTPP done, it's a \"happy year\" for many of the countries Trudeau will meet with: a chance to take a victory lap.There may not be anything tangible yet, he said, but this is all about relationship building.\"This is Canada being present in one of the fastest booming places in the world,\" Tiberghien said.Janyce McGregorParliamentary BureauJanyce McGregor has covered Canadian politics for CBC News since 2001. Send news tips to: Janyce.McGregor@cbc.caAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}