{"id": "2 Stella's execs on indefinite leave after harassment, abuse allegations from workers", "paragraph": "Two executives from Stella's Cafe are on an indefinite leave of absence from a Winnipeg restaurant chain dogged by allegations of workplace harassment. Grant Anderson, vice-president of operations, and Brad Burrows, regional manager, have been removed from their positions, effective immediately, to ensure the integrity of the independent investigation, said a statement released by the company's owners Monday afternoon.In the meantime, an interim director of operations has been assigned, the company said.Stella's decided to close its Sherbrook Street location at 3 p.m. on Monday for a staff meeting, the statement said. The Sherbrook location — one of several in the Winnipeg chain known for its breakfasts — will also be closed on Tuesday.Last week, Instagram account \"Not My Stella's\" began detailing anonymous complaints — including sexual harassment, discrimination and bullying — and a culture where employees were discouraged from coming forward.The removal of Anderson and Burrows was one of five demands issued at a Saturday news conference, with three of the 12 creators of the Instagram account — Christina Hajjar, 27, Kelsey Wade, 22, and Amanda Murdock, 36. The group includes present and past employees.Another of the creators, former Stella's manager Sara Barsky, said on Monday that a leave of absence is not good enough.\"We are excited to see a few tangible steps when it comes to our demands, but we definitely are still calling for all our demands to be met,\" Barksy said.\"We don't believe a leave of absence is enough. We want final dismissals from the company.\"The group has also called for a public apology, said Stella's should pay for mental health services for those affected and the creation of a human resources department within the company.\"We want the ownership of Stella's to publicly acknowledge the harm they've done, and be transparent and accountable when it comes to that. So far, with all the statements they've put out, they have not owned any of the behaviour,\" Barsky said.\"They have not taken responsibility for any of their actions. That is so important in the healing process for us and our community.\"They do not want people to boycott Stella's restaurants, but rather voice their concerns to head office and tip frontline staff well and in cash.By Sunday, a post from the account said it received 275 disclosures from current and past employees. Stella's released a third statement Monday, reaffirming its commitment to developing a safe working environment.\"We are deeply sorry for the difficult circumstances and we regret and apologize to all those who are hurting,\" it read.On Monday, staff and managers were told that People First HR Consultants would handle investigations into any complaints.\"We are committed to restoring the trust and confidence of our staff, our valued customers and the entire community,\" the owners said. \"This process will take time, and we recognize that operational changes are needed. We will do everything that we must do to create a respectful, safe and healthy work environment.\"Other allegations published on the @NotMyStellas account include groping, suggestive comments and abusive employees being transferred to different Stella's restaurants after complaints arose rather than dismissed. Luke Savard described his Stella's workplace as an overtly sexualized culture that left employees feeling anxious and afraid.\"They said we didn't need breaks so I'd be working an eight, nine-hour shift straight without anything so much as a five-minute break,\" he told CBC News on Saturday, adding he was told he wasn't allowed to drink water in front of customers.Savard was also ordered to pay out of his own pocket when a till didn't balance at the end of the night, he said. \"The atmosphere there was just really, really toxic to be in.\"The Manitoba Labour Board said there was only one previous complaint against the company, which was made in September, but it had been withdrawn.The Manitoba Human Rights Commission said it is not able to confirm or deny if a complaint has been filed unless the commission investigates a matter and determines it should be referred to a public hearing.​Manitoba Workplace Safety and Health was not available Monday to say whether any complaints had been made.With files from Austin Grabish, Holly Caruk and Shane GibsonIan FroeseReporterIan Froese is a reporter at CBC Manitoba. He previously wrote about rural Manitoba for the Brandon Sun and the Carillon in Steinbach. Story idea? Email ian.froese@cbc.ca.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}