{"id": "Sick children from Quebec's remote regions now accompanied by parents 'in 98% of cases'", "paragraph": "The government agency that manages Quebec's air-ambulance service said parents have been able to accompany their children on emergency flights in \"98 per cent\" of cases over the past month.Évacuations aéromédicales du Québec (EVAQ) said it has now fully implemented its new policy, allowing caregivers to accompany minors on medical evacuation flights.The policy was adopted last June, after a group of doctors launched a campaign to call attention to the fact that EVAQ's refusal to allow parents to accompany their sick children during medical emergencies threatened the well-being of those children, especially Indigenous children who often do not speak English or French.Doctors gave examples, such as needing a child's medical history or other information to reach a diagnosis, or needing a parent's consent to perform a procedure, and the parents being unreachable — trying to make their way from their remote home to their child's side.Much has been done in the past several months to address these concerns, said EVAQ's co-ordinator, Sylvie Côté.In July, Julie Ikey, a woman from Salluit in Nunavik, became the first mother to accompany her child on a medevac to Montreal when her 12-year-old son crashed his bike, rupturing his spleen.In the months since then, doctors said, 50 to 60 per cent of sick children medevaced south have been accompanied by a caregiver.However, Côté said the only request that has been refused since Sept. 14 was a father from the Gaspé region who could not board the plane with his newborn because the four passenger seats aboard the Challenger aircraft were already taken up by medical staff.\"We then try to transport the parent with our shuttle planes to bring them as quickly as possible to the health centre,\" Côté testified on Wednesday at the Viens inquiry into the province's treatment of Indigenous people.(EVAQ has a fleet of four airplanes to transport patients from Quebec's isolated communities for emergency procedures: two Challenger aircrafts — which cover longer distances — and two Dash-8 planes, normally used as a shuttle service in non-critical situations.)Last week, the Viens commission heard from Cree parents from Waswanipi, Que., who weren't able to accompany their 6-year-old to Montreal in August, after doctors suspected he was bleeding internally.Valerie-Lynn Gull said her son Pelle Jr. was terrified to take off alone, and asked her repeatedly why she could not go with him. She said she was never told why she couldn't accompany him.Côté said if the situation were to happen again today, Gull could likely have been able to go with her son, because EVAQ no longer requires a flight attendant be on board to accompany the caregiver. In Gull's case, the air ambulance would have had to make a stop in Quebec City to pick up a flight attendant before heading to the Chibougamau hospital where Pelle Jr. was being treated, Côté explained.\"The doctor said 'No, I prefer that he be sent right away, because he's not doing well',\" she said.It took several months to implement the changes in EVAQ's new policy, Côté said.\"This summer we had a flight attendant or a nurse on board to show that the medical staff could support the parent,\" she said.The policy changes also required the collaboration of pilots and the ministry of transport, said André Lizotte, the director of pre-hospital emergency services with the Ministry of Health and Social Services.EVAQ has always had to comply with aviation rules, he said.\"There has always been resistance over safety concerns,\" said Lizotte.Any modifications to the layout of the airplane, to make more room for a parent, also had to comply with the aircraft's certifications, he said.It was only a federal regulation change in 2017 that allowed EVAQ to add an extra seat in its Challenger aircraft.\"We have constraints we have to deal with. So no, it doesn't always go as fast as we'd like,\" he said.He also stressed that EVAQ makes 6,000 trips made per year, two-thirds of which are on Dash-8 shuttles, which have accepted caregivers to accompany patients for several years.Pediatric emergency physician Dr. Samir Shaheen-Hussain, one of the doctors to bring attention to the issue, said he has seen an improvement in services since \"the unwritten rule of having a flight attendant accompany a caregiver has been revoked.\"\"It is very encouraging to see that the demands made by these communities are finally being acted upon, and that the longstanding practice of systematically separating these kids from their families is coming to a definitive end,\" Dr. Shaheen-Hussain told CBC News in an e-mail.Inquiry commissioner Jacques Viens encouraged EVAQ to continue upgrading its services, including to translate its pamphlets and policies into Indigenous languages.\"A policy can be brilliant, but you have to explain it in a way that is, as well,\" he said. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}