{"id": "Djokovic cruises past Isner in ATP Finals opener", "paragraph": "The opening matches at the ATP Finals led to a debate over whether conditions at the O2 Arena were trickier than in past years.Novak Djokovic ended it.The Wimbledon and U.S. Open champion made an impressive start to his campaign for a sixth title by dismissing John Isner 6-4, 6-3 on Monday.\"My results here have been pretty good in the last 10 years, so I can't complain too much,\" said Djokovic, who has won four titles at the London venue. \"It takes a little bit of time really to get yourself adjusted to the surface because the surface is a good surface.\"A day after a ceremony to mark ending the season as No. 1, Djokovic underlined his status by nullifying Isner's usually destructive serve.Isner, who at 33 became the season-ending tournament's oldest debutant since 1972, applied himself admirably but barely avoided being broken more than once in the first set, and was broken twice more in the second set.\"It was amazing,\" Isner said of the atmosphere. \"I wish I could have given them a bit more to cheer for.\"The one break Djokovic converted in the first set, at 2-2, was a cross-court forehand return winner which stranded Isner.Cristiano Ronaldo was in attendance, with Djokovic perhaps spurred on even more by the Juventus forward's presence.\"It's great to have big football star, sports star like him, courtside watching tennis,\" Djokovic said.At 3-3, 15-30 in the second set, Isner sent down a second serve at 203 km/h. Djokovic sent it straight back at his feet and a shocked Isner hit his backhand long to concede two more break points.A forehand error from Isner confirmed the break, and the end of the contest. The merciless Djokovic held serve before breaking Isner once more with an inch-perfect backhand passing shot on match point.\"That was pretty comprehensive out there,\" Isner conceded.Earlier, Zverev came from a break down in both sets to defeat Marin Cilic 7-6 (5), 7-6 (1).Facing each other in their opening match for a second straight year, Zverev produced the slightly steadier tennis in an attritional contest to extend his record against Cilic to 2-0 at the O2 Arena and 6-1 overall.Cilic, who made 46 unforced errors, dropped to 1-9 across his four appearances at the tournament.\"The win, that's the most important thing,\" said Zverev, who failed to advance from the round-robin stage on his debut last year.To encourage thoughtful and respectful conversations, first and last names will appear with each submission to CBC/Radio-Canada's online communities (except in children and youth-oriented communities). Pseudonyms will no longer be permitted.By submitting a comment, you accept that CBC has the right to reproduce and publish that comment in whole or in part, in any manner CBC chooses. Please note that CBC does not endorse the opinions expressed in comments. Comments on this story are moderated according to our Submission Guidelines. Comments are welcome while open. We reserve the right to close comments at any time.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}