{"id": "New company promises to take over some of Greyhound's routes in Western Canada", "paragraph": "Ahead of Greyhound's last Western Canada runs, there's a new bus company promising to swoop in and take over some of the old routes.Rider Express is ready with six buses able to carry 55 passengers, two running between Calgary and Vancouver, and one running between Calgary and Winnipeg — seven days a week.The company plans to start service from Vancouver to Winnipeg on Oct. 29, just before Greyhound stops service in Western Canada.But days before the routes start up, the company is still putting the final touches on where it will pick up and drop off passengers, and have yet to update information online about their service and its exact pricing. \"We are working hard to get this service up and running,\" said owner Firat Uray. \"If everything goes smoothly, we're ready to go.\" The pricing will look similar to what Greyhound charged, but Uray said the company is watching the model to see if it is sustainable. If it needs to adjust, you might see fares go up. For the rides to be profitable, he said, the buses need 15 to 20 passengers. \"We are getting closer to those long weekends and Christmas,\" Uray said. \"We're hoping we will be OK.\"  In July, Greyhound Canada announced the cancellations of its passenger bus and freight services in Alberta, Saskatchewan and Manitoba. At the time, Greyhound's senior vice-president Stuart Kendrick said these routes weren't sustainable. The company halted all but one route in B.C. — a U.S.-run service between Vancouver and Seattle. The new company won't be running its fleet out of big terminals, like the one still standing in Calgary. Uray said those are too expensive for now. He said the buses will stop at busy Husky gas stations. The company is finalizing an agreement with the Husky at Barlow Trail and 32nd Avenue N.E.Uray said Rider Express has hired some ex-Greyhound drivers and other bus operators with years of experiences.To begin with, the buses will have water onboard, Wi-Fi capabilities and video entertainment.The trip between Calgary and Vancouver is pegged at 12 hours, because the bus will stop only at pre-arranged points. Rider Transportation hails from Regina, and was serving the area with full-size vans seating 15 people. It's been operating that service for 1½ years. With files from Colin Hall.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}