{"id": "'They created an expectation': Quebec artists still waiting for Netflix investments", "paragraph": "On a recent episode of popular Radio-Canada show, Tout le monde en parle, co-host Dany Turcotte asked Prime Minister Justin Trudeau why he hadn't heard of any significant Netflix investment in Quebec since the major announcement last year.The U.S. streaming giant committed in September 2017 to investing $500 million over five years in Canadian-produced movies and television shows, in both English and French.\"It's not happening fast,'' Turcotte said to Trudeau about Netflix starting to fund projects in Quebec. \"There is nothing happening.''The prime minister replied that Netflix would be investing \"even more than they had initially planned to.\"So far, none of the Quebec-based production companies or unions representing actors, directors or writers contacted by The Canadian Press said they have heard of any French-language movie or television series in development by Netflix in the province.Melanie Joly, the former heritage minister, lost her portfolio last summer following what was widely seen as a disastrous handling of the Netflix file.Joly was criticized for her government's decision not to impose the federal goods and services tax on Netflix or any other online-streaming company.The $500-million pledge was supposed to make up for the break given to Netflix, but more than a year after the announcement, francophone Quebec directors, writers and actors are still waiting for a big project.Last May, Netflix held a two-day series of meetings in Montreal during which it received numerous pitches. ​Hélène Messier, head of an association that represents 150 independent Quebec production companies in film, television and online, attended one of the events in May.\"There were more than 1,000 ideas submitted to Netflix during those meetings,'' Messier said in an interview. \"I know it can take time to develop projects,'' she added, \"but I would have hoped that by now we would have at least been able to announce something.''Messier said Netflix \"created an expectation'' in Quebec last year when it announced its investment, and she remains optimistic.\"I think they will deliver,'' she said in an interview, \"but I don't know when.''On the English side, Netflix has made significant moves in Canada over the last year.It recently renewed the show, Travelers, created by Canadian Brad Wright and shot in Vancouver. The company has other English-language movies and television shows in production across the country.Montreal-based Muse Entertainment is currently in post-production on Good Sam, a $5-million feature film for Netflix, scheduled to run on the company's online platform in 2019.Netflix points to two recent projects involving francophone talent as evidence it has not ignored Quebec.It bought the rights to the 2017 film, Les Affamés, scheduled to appear on the platform in 2019.And the company plans to record four francophone comedians during the next Just for Laughs comedy festival in Montreal as part of an international series featuring 47 comedians from around the world.Writers, editors and actors see signs of goodwill from Netflix, but so far it is not funding any original Quebecois movie or television series.In a statement to The Canadian Press, Netflix said, \"we are always on the lookout for the best stories.''The company said its $500-million commitment includes movies and television shows in both English and French, as well as an additional $25 million in market development.Simon Ross, a spokesman for the federal Heritage Department, declined to comment on the progress of Netflix's investments but offered this assurance to Quebec artists: \"We have their back when it comes to protecting our culture.''Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}