{"id": "95-year-old veteran of Second World War honoured in Hillsborough", "paragraph": "At the age of 95, William Balser Sr. still remembers his time serving in the Second World War.Balser was with the Royal Canadian Air Force and was at the liberation of France in 1944.\"It was a pretty good feeling, although we were out in the woods, so we didn't get a chance to celebrate it,\" he said with a smile.Balser was honoured by the Royal Canadian Legion in Hillsborough on Wednesday, when a small \"Vimy tree\" was planted  in the village's Peace Park.The Battle of Vimy Ridge happened in northern France between April 9 and April 12, 1917.After the battle, Lt. Leslie Miller of Scarborough, Ont., gathered a handful of acorns and sent them home for planting. Many of the oak trees still stand there today. In January 2014, the non-profit Vimy Oaks Legacy Corporation decided to send the offspring of those trees back to Vimy Ridge, where so many oaks were destroyed during the battle a century ago.The corporation also sells saplings grown in Canada for planting at commemorative sites to honour soldiers who fought at Vimy Ridge and in other battles.Balser was surprised when he heard an oak sapling was going to be planted in Hillsborough.\"It's a great, wonderful thing,\" he said. \"I never expected to hear about anything like that. It's an honour, yes.\"William's youngest son, George Balser, said having a public reminder of what happened is important.\"To put something out on the street, front and centre, it really will keep things alive, and it's got a place of honour in Peace Park, so we'll be driving by and we'll be looking after it and making sure everything is OK.\"George said that after the war, his father returned to Canada and his farm. He worked at various places, including the CN Shops in Moncton, before taking a job with the provincial Department of Transportation, where he was a supervisor of the sign department.William Balser doesn't talk about the war a lot, but when he does, it's with humour, George said.\"My son went over on the battlefield tour in high school and brought pictures back to my dad of when they crossed the English Channel,\" he said.\"And my father said, 'Well, when we crossed on D-Day they weren't too happy to see us.' So … the way he dealt with the war was to add some humour to that.\"Peter Jubb, the president of the Hillsborough legion, said the senior Balser's appearance at the planting on Wednesday was important.\"To have Bill here to receive that Vimy oak, considering that he'd gone through France in the Second World War, it's that direct and personal connection and it makes it personal for everybody.\"Jubb was in the British Army and served all over the world. His first wife was from Canada, so they moved here to be closer to her family.Jubb teared up talking about how important it is to remember the service of veterans.\"The veterans are getting older,\" he said. \"We've only got six World War II veterans left, and they are getting fewer every year, and Bill Balser Sr. is a typical example, super, very quiet and never complains, brilliant guy.\"And it's their memory that we've got to keep going forward and to remind, especially the children, that the consequence of war, the reason for it and how, if the people of Canada didn't respond at that time, the world would have been a worse place.\"So with the response of the Canadian people and veterans like Bill it makes the whole place a lot better.\"Jim Landry, the executive director of Landscape New Brunswick, said he got involved with the project because of a family connection.His great uncle, John Ashe, was killed during the first day of fighting at Vimy Ridge.Two weeks ago, Landry planted a tree just outside Vimy with 40 school children from a school in England.Landry said he was thrilled to be on hand to help plant a tree in Hillsborough.\"When you look at little towns like this, a significant percentage of the population left these towns and never came back,\" Landry said. \"The towns have been shaped — you know there's people missing from this town because the soldiers never returned or they returned as much different people.\"These little trees lie at the intersection of hope and remembrance.\"Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}