{"id": "Kennedy Stewart elected mayor of Vancouver", "paragraph": "For the first time in more than three decades, Vancouver has elected an independent mayor, choosing Kennedy Stewart from a crowded field of contenders.Stewart ran on a centre-left platform, promising that housing affordability would be his first priority. He's pledged to emphasize non-profit housing solutions for low- and medium-income residents, and to form an emergency task force to deal with the city's opioid crisis.The former NDP MP for Burnaby South was the frontrunner heading into Saturday's vote, but he was in for a tough fight against the Ken Sim of the Non-Partisan Association (NPA) for most of the night. Vancouver, like Montreal and some other Canadian cities, has political parties at the municipal level. It took until the final votes from all 133 polling places were counted before Stewart could be safely declared the winner, with 49,812 votes to Sim's 48,828. Independent Shauna Sylvester wasn't far behind, with 35,537.It was a long night for everyone involved in this year's election.The polls officially closed at 8 p.m., but long lines at a handful of polling places meant the city held off counting votes until close to 9:30 p.m.It would take more than three more hours before Stewart was declared the winner..<a href=\"https://twitter.com/kennedystewart?ref_src=twsrc%5Etfw\">@KennedyStewart</a> makes his victory walk up the podium. His win marks Vancouver's first Independent mayor in more than three decades. <a href=\"https://twitter.com/cbcnewsbc?ref_src=twsrc%5Etfw\">@cbcnewsbc</a> <a href=\"https://twitter.com/hashtag/cbc?src=hash&amp;ref_src=twsrc%5Etfw\">#cbc</a> <a href=\"https://twitter.com/hashtag/vanpoli?src=hash&amp;ref_src=twsrc%5Etfw\">#vanpoli</a> <a href=\"https://twitter.com/hashtag/elxn2018?src=hash&amp;ref_src=twsrc%5Etfw\">#elxn2018</a> <a href=\"https://twitter.com/hashtag/vanelxn18?src=hash&amp;ref_src=twsrc%5Etfw\">#vanelxn18</a> <a href=\"https://t.co/TFamf0zzlb\">pic.twitter.com/TFamf0zzlb</a>The last time Vancouver had an independent mayor was from 1980 to 1986, when Mike Harcourt was in power.Stewart will lead a mixed council, with no one party holding a clear majority of votes. Five NPA councillors, three Greens and one person each from COPE and OneCity were voted in Saturday night. Returning councillor Adriane Carr easily captured the highest vote total of the night, edging out fellow Green Pete Fry.Remarkably, eight of the city's 10 councillors will be women. The total complement of councillors includes:Sim says “we had a great night” and says we elected five women councillors <a href=\"https://twitter.com/hashtag/npa?src=hash&amp;ref_src=twsrc%5Etfw\">#npa</a>. He then thanks his parents for their sacrifices. <a href=\"https://t.co/1K9uG7C3yX\">pic.twitter.com/1K9uG7C3yX</a>The results mean that after 10 years of dominating city politics, Vision Vancouver, which did not field a mayoral candidate, has been locked out of the council chambers entirely. Former mayor Gregor Robertson, who decided not to run again, was on the Vision Vancouver slate. In fact, the once-powerful party has been reduced to just one school trustee, Allan Wong, and he barely squeaked in, winning the final of nine positions by fewer than 400 votes.The next school board will include:The Green Party had a strong showing across all three of Vancouver's elected bodies, winning three seats on each of the park board, school board and council.Vancouver's new park board will include:Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}