{"id": "Trump administration denies reaching conclusion on Khashoggi killing", "paragraph": "The Trump administration denied on Saturday that it had reached a final determination in the death of Saudi writer Jamal Khashoggi.After U.S. President Donald Trump called his CIA chief and top diplomat from Air Force One as he flew to survey wildfire damage in California, the State Department released a statement saying \"recent reports indicating that the U.S. government has made a final conclusion are inaccurate.\"The statement also followed reports Friday that American intelligence agencies have concluded that Saudi Crown Prince Mohammed bin Salman ordered the killing of Khashoggi in the Saudi Consulate in Turkey, according to the U.S. official familiar with that assessment.The official was not authorized to discuss the matter publicly and spoke only condition of anonymity Friday. The conclusion was first reported by the Washington Post.The Saudi government has denied the claim.Trump said late Saturday he would received a \"very full report\" on Khashoggi's killing in the coming days — likely Tuesday — that would include \"who did it.\" Trump called Friday's reports \"premature.\"State Department spokesperson Heather Nauert said in a statement that the U.S. government was \"determined to hold all those responsible for the killing of Jamal Khashoggi accountable\" and that \"there remain numerous unanswered questions with respect to the murder.\"She said the department \"will continue to seek all relevant facts\" and consult with Congress and other nations \"to hold accountable those involved in the killing.\"Trump spoke earlier with CIA Director Gina Haspel and Secretary of State Mike Pompeo from Air Force One, press secretary Sarah Huckabee Sanders said. She provided no additional details but said the president has confidence in the CIA.Trump told reporters before he left the White House for California that, when it came to the crown prince, \"as of this moment we were told that he did not play a role. We're going to have to find out what they have to say.\"In his remarks, the president spoke of Saudi Arabia as \"a truly spectacular ally in terms of jobs and economic development.\"\"I have to take a lot of things into consideration\" when deciding what measures to take against the kingdom, Trump said.The State Department statement noted the administration's recent actions against a number of Saudis, but also cited the need to maintain \"the important strategic relationship\" between the two allies.The intelligence agencies' conclusion will bolster efforts in Congress to further punish the close U.S. ally for the killing. The administration this past week penalized 17 Saudi officials for their alleged role in the killing, but American lawmakers have called on the administration to curtail arms sales to Saudi Arabia or take other harsher punitive measures.Saudi Arabia's top diplomat has said the crown prince had \"absolutely\" nothing to do with the killing.Vice-President Mike Pence told reporters travelling with him at a summit of Pacific Rim nations in Papua New Guinea that he could not comment on \"classified information.\"He said Saturday \"the murder of Jamal Khashoggi was an atrocity. It was also an affront to a free and independent press, and the United States is determined to hold all of those accountable who are responsible for that murder.\"The United States will \"follow the facts,\" Pence said, while trying to find a way of preserving a \"strong and historic partnership\" with Saudi Arabia.Khashoggi, a Saudi who lived in the United States, was a columnist for the Post and often criticized the royal family. He was killed Oct. 2 at the Saudi Consulate in Istanbul. Turkish and Saudi authorities say he was killed inside the consulate by a team from the kingdom after he went there to get marriage documents.Also this past week, the top prosecutor in Saudi Arabia announced he will seek the death penalty against five men suspected in the killing. The prosecutor's announcement sought to quiet the global outcry over Khashoggi's death and distance the killers and their operation from the kingdom's leadership, primarily the crown prince.Turkish officials have repeatedly criticized the kingdom's probe and have demanded the suspects be investigated and put on trial in Turkey.On Saturday, while attending the Halifax International Security Forum, Turkey's defence minister said he believed the men suspected in Khashoggi's killing may have simply stuffed the writer's body parts into bags and carried them onto a flight out of Istanbul because their diplomatic passports allowed them to avoid security screening.Trump has called the killing a botched operation that was carried out very poorly and has said \"the cover-up was one of the worst cover-ups in the history of cover-ups.\"But he has resisted calls to cut off arms sales to the kingdom and has been reluctant to antagonize the Saudi rulers. Trump considers the Saudis vital allies in his Mideast agenda.With files from CBC NewsAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}