{"id": "Federal government set to announce new Champlain Bridge won't open on time", "paragraph": "The federal government is set to announce that the Champlain Bridge will open later than expected, Radio-Canada sources have learned.The bridge was supposed to open on December 21, but sources say the new structure may only be ready in the spring.This is the second time the deadline for the bridge has been pushed back. Initially, the bridge was supposed to be open for drivers by December 1, 2018.Federal Infrastructure Minister François-Philippe Champagne is to announce the delay Thursday. All union members have been invited by management to a meeting one hour before the announcement takes place.Earlier this month, Infrastructure Canada said the bridge would open in time for its December deadline, but a spokesperson opened the door to possible delays.\"As you know, the construction of the new bridge is big and complex,\" explained Caroline Marchildon, director of advisory and corporate services, at that time.Last week, Champagne was asked about whether there would be a delay. He did not confirm a delay at the time, but told reporters that his priority is the health and safety of workers.According to Radio-Canada's sources, security issues and the onset of winter could be among the reasons put forward to justify the delay.The project is valued at $4.2 billion.Mayor Valérie Plante said she was informed of the delay on Wednesday. She acknowledged that winter conditions have an impact on construction sites.She said she was \"somewhat disappointed\" by the delay. She said she will remain in contact with the minister to work to mitigate any additional traffic concerns continued construction could cause. According to the contract signed in 2015, heavy penalties are to be imposed on the construction consortium if it delivers the work later than Dec. 21, 2018. With files from Radio-Canada's Thomas GerbetAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}