{"id": "N.L. recycles 4,500 tonnes of electronics in 5 years", "paragraph": "Custom dictates that five-year anniversaries are celebrated with gifts of wood, but the Electronic Products Recycling Association in Newfoundland and Labrador is celebrating with 4.5 million kilograms of diverted waste.Computers, printers, phones and audio equipment make up the bulk of materials collected at 58 public depots since 2013, when the association got its start.\"We're able to make use of most of the material that's in old electronics,\" said program director Terry Greene.\"So rather than them ending up in landfills, or in the woods, or whatever the case might be, we're able to recycle the materials.\" The group came into existence half a decade ago, when the regulations around electronic waste changed. As a brand new organization, there was a steep learning curve for staff.\"We didn't have any locations where we could collect electronics. We didn't know how much material would be coming in, over what period of time,\" Greene said.\"We had to work out transportation issues, particularly in Labrador, where we have to take materials from coastal communities, from Happy Valley-Goose Bay, from Wabush, and get them to marketplace.\"What does 4.5 million kilograms of electronics look like? Greene said a tractor-trailer load would be about 10,000 kilograms, so the the total is about 450 truckloads' worth.\"There's always opportunities for improvement, obviously, and I would like to see a lot more material coming in to our depots,\" he said. \"But we're certainly at a good point right now.\"Greene says the association partners with schools and fire halls in small communities where there's no permanent depot.In coastal Labrador, for example, they hold annual collection events at the local schools. Greene says they've worked hard to make the program accessible throughout the province.\"It was a large effort but it's come together reasonably well.\"Read more from CBC Newfoundland and LabradorAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}