{"id": "Kepler telescope declared dead after finding thousands of worlds", "paragraph": "NASA's elite planet-hunting spacecraft has been declared dead, just a few months shy of its 10th anniversary.Officials announced the Kepler Space Telescope's demise Tuesday.Already well past its expected lifetime, the 9 1/2-year-old Kepler had been running low on fuel for months. Its ability to point at distant stars and identify possible alien worlds worsened dramatically at the beginning of October, but flight controllers still managed to retrieve its latest observations. The telescope has now gone silent, its fuel tank empty.\"Kepler opened the gate for mankind's exploration of the cosmos,\" said retired NASA scientist William Borucki, who led the original Kepler science team.Kepler discovered 2,681 planets outside our solar system and even more potential candidates. It showed us rocky worlds the size of Earth that, like Earth, might harbour life. It also unveiled incredible super Earths: planets bigger than Earth but smaller than Neptune.NASA's astrophysics director Paul Hertz estimated that anywhere from two to a dozen of the planets discovered by Kepler are rocky and Earth-sized in the so-called Goldilocks zone. But Kepler's overall planet census showed that 20 to 50 per cent of the stars visible in the night sky could have planets like ours in the habitable zone for life, he said.The $700 million mission even helped to uncover last year a solar system with eight planets, just like ours.\"It has revolutionized our understanding of our place in the cosmos,\" Hertz said. \"Now we know because of the Kepler Space Telescope and its science mission that planets are more common than stars in our galaxy.\"Almost lost in 2013 because of equipment failure, Kepler was salvaged by engineers and kept peering into the cosmos, thick with stars and galaxies, ever on the lookout for dips in the brightness of stars that could indicate an orbiting planet.\"It was like trying to detect a flea crawling across a car headlight when the car was 100 miles away,\" said Borucki said.The resurrected mission became known as K2 and yielded 350 confirmed exoplanets, or planets orbiting other stars, on top of what the telescope had already uncovered since its March 7, 2009, launch from Cape Canaveral.In all, close to 4,000 exoplanets have been confirmed over the past two decades, two-thirds of them thanks to Kepler.Kepler focused on stars thousands of light-years away and, according to NASA, showed that statistically there's at least one planet around every star in our Milky Way Galaxy.Borucki, who dreamed up the mission decades ago, said one of his favourite discoveries was Kepler 22b, a water planet bigger than Earth but where it is not too warm and not too cold — the type \"that could lead to life.\"A successor to Kepler launched in April, NASA's Tess spacecraft, has its sights on stars closer to home. It's already identified some possible planets.Tess project scientist Padi Boyd called Kepler's mission \"stunningly successful.\"Kepler showed us that \"we live in a galaxy that's teeming with planets, and we're ready to take the next step to explore those planets,\" she said.Another longtime spacecraft chasing strange worlds in our own solar system, meanwhile, is also close to death.NASA's 11-year-old Dawn spacecraft is pretty much out of fuel after orbiting the asteroid Vesta as well as the dwarf planet Ceres. It remains in orbit around Ceres, which, like Vesta, is in the asteroid belt between Mars and Jupiter.Two of NASA's older telescopes have been hit with equipment trouble recently, but have recovered. The 28-year-old Hubble Space Telescope resumed science observations last weekend, following a three-week shutdown. The 19-year-old Chandra X-ray Telescope's pointing system also ran into trouble briefly in October. Both cases involved critical gyroscopes, needed to point the telescopes.Hertz said all the spacecraft problems were \"completely independent\" and coincidental in timing.Now 94 million miles from Earth, Kepler should remain in a safe, stable orbit around the sun. Flight controllers will disable the spacecraft's transmitters, before bidding a final \"good night.\"Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}