{"id": "2½-year-old mystery of woman's disappearance deepens with discovery of ID in sewage truck", "paragraph": "A missing Ontario woman's driver's licence has turned up in a remote area of B.C. where she used to work, but her family says it has gotten them no closer to solving the mystery of her disappearance.It's the first piece of physical evidence found since then 32-year-old Ashley Simpson vanished on April 27, 2016, according to her father.The outdoorsy woman's absence haunts her father who can't stop searching for her, despite living in St. Catharines, Ont.\"We've exhausted absolutely everything we can exhaust trying to find Ashley,\" said John Simpson who has flown to B.C. three times to search for clues.When she vanished, people told him she was last seen walking on a street in Silver Creek near Salmon Arm with her pink suitcase.There's been no sign of her since then.Then on Oct. 9, her Ontario identification showed up in a sewage vacuum truck used by Sasquatch Crossing Lodge in Pink Mountain B.C., during a routine cleaning of the tank.RCMP confirmed that the driver's licence was found in the community where Simpson worked for three seasons as an apprentice cook with her father at Sasquatch and Buffalo Inn, along the Alaska Highway.He believes it may have just been stolen long before she vanished.Simpson said he learned Wednesday police don't even want the identification discovered in a sewage truck, as he was told too many people have touched it for it to reveal any fingerprints.\"It's so strange,\" he said.\"We, as a family, really don't know. We are kept in the dark.\"His daughter would turn 35 on Nov. 15.Simpson said they were close.\"Ashley just followed me wherever I went,\" said the cook, who was training his daughter in the former hunting lodges where Americans from Florida to California come to vacation.\"She put up with the work just to be with me. We were really, really close. She followed in my footsteps.\"He said that Ashley loved the outdoors and was beloved by customers and staff.\"They'd all grown very fond of Ashley,\" said Simpson.The Calgary-born woman had lived everywhere from Niagara-on-the-Lake to the Northwest Territories and loved hiking and gold-panning.Simpson last saw Ashley when she left Pink Mountain in February of 2016 to live with her boyfriend Derek Favell in a trailer near Salmon Arm on Yankee Flats Road.But then she vanished. Since then, so have other women.Simpson said that police have told him that his daughter, and at least two other women, probably met with foul play in the Salmon Arm area.Traci Genereaux, 18, was found dead October 2017 on a farm outside Salmon Arm after a police search.No charges have been laid in her death, and Simpson's father says he's been told by investigators that his daughter's death is unrelated to that case.Despite this, he feels compelled to help all the families of missing women in the area — and B.C. He's helped organize golf tournaments to purchase drones to help people search for women who have disappeared.Simpson's cousin, Rosie, writes a blog every week since she last saw Ashley.\"For the people who love Ashley, time stands still,\" she wrote.The disappearance of other women in the same area — really disturbs her.\"People don't just disappear ... in the little burg where Ashley ... set up house. Since Ashley's disappearance, four women have gone missing, including a lady who lived across the street. This, in a community of less than 16,000 people,\" she wrote recently.In the past two years, at least five women have been reported missing from the North Okanagan-Shuswap area: Deanna Wertz, Ashley Simpson, Caitlin Potts, Nicole Bell and Traci Genereaux.Yvette BrendYvette Brend is a CBC Vancouver journalist. Yvette.Brend@CBC.ca @ybrend  Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}