{"id": "1 arrested, 9 other teens sought in attack on Jewish teens", "paragraph": "One arrest has been made and nine other teenagers are being sought in what Toronto police say is a suspected attack on a group of Jewish teens.Police said the victims were attacked and robbed on Sunday, Nov. 11 in the area of Fairholme Avenue and Bathurst Street. The incident is being investigated as a hate crime.Around 8 p.m. on Sunday, police were called to the area for reports of an assault.In a news release on Monday, police said four boys, all 17, were walking in the area wearing \"attire of their religious faith.\"\"As they passed another group of youngsters, who were unknown to them, derogatory comments were made about their religion,\" the news release said.Police said the unknown group then assaulted two of the teens, punching and kicking them. The suspects also stole a pair of sunglasses from one of the victims before fleeing. Toronto police spokesperson Katrina Arrogante said one of the boys was injured and was treated by Emergency Medical Services on the scene.\"Police arrived on scene, together with EMS and located the injured male,\" Arrogante told CBC Toronto. \"Minor injuries were sustained; some soreness to the face and some bruising to the lower body.\"The matter is being treated as a hate crime, police said.No one should ever be attacked for their religion. Please help <a href=\"https://twitter.com/TorontoPolice?ref_src=twsrc%5Etfw\">@TorontoPolice</a> solve this hate crime/robbery investigation that occurred Sunday night. <a href=\"https://t.co/cfxaW12iyy\">pic.twitter.com/cfxaW12iyy</a>Meanwhile, Toronto Mayor John Tory responded to the assault, saying \"no one should ever be attacked for their religion.\"Tory tweeted about the incident on Monday and called on the public to help the police \"solve this hate crime/robbery investigation that occurred Sunday night.\"Meanwhile, the Centre for Israel and Jewish Affairs (CIJA) has also issued a statement condemning the attack.\"We were deeply disturbed to learn of this vile assault on Jewish teens in Toronto, which Police are investigating as a hate-motivated crime,\" CIJA said.\"Our security team is in constant communications with our law enforcement partners who remain on the scene and are conducting an active investigation.\" CIJA is calling on community members who live or work in the Dell Park area and have surveillance videos to check their footage and contact 13 Division if they have any information that might be useful.\"Jewish Canadians should never fear wearing their Kippah in public. We are grateful to the Toronto Police Service for its rapid and professional response,\" CIJA said.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}