{"id": "Animal guts and entrails splattered in RDP after transport truck makes abrupt stop", "paragraph": "A witness described it as a scene out of a horror film.On Tuesday night, the driver of a transport truck hauling pig parts slammed his brakes after being cut off. The hard stop caused animal guts and entrails to spill out from under a loose tarpaulin, sloshing all over the road and splattering objects nearby.The next morning, some of the mess on Henri Bourassa Boulevard in the Montreal borough of Rivière-des-Prairies still hadn't been cleaned up. Pig guts and entrails were hanging from trees and splattered on the sidewalk.\"A scene out of a horror film,\" is the way resident Joseph Paglia described it.He was on his way home from his child's hockey practice when he stumbled upon the mess. \"There was intestines, animal remnants, stomach, lungs, hearts splattered all over the street,\" he said. \"The smell was unbelievable. I had a hard time keeping my dinner in.\"On Tuesday evening, a loader came by to scoop up the animal parts and cart the mess away. It took a couple of hours to complete.The truck had been on its way to the Sanimax rendering plant a couple of kilometres away from the accident, taking a route that isn't far from residential neighbourhoods.\"We continuously have spills of this nature, and they refuse to do anything about it,\" said Theo Vecera. \"We don't want band-aid solutions. We want real solutions.\" A Facebook page, Sanimax SOS by le Mouvement Citoyens du RDP, was created in 2012 to address the \"odours, truck traffic and water contamination in relation to operations at Sanimax.\"Sanimax's general manager said the company's record is solid.\"We've got to understand that we do over 25,000 transportations in Montreal, and 99.8 per cent of them will happen without any incident,\" said Eric Caputo.Sanimax has received nearly $800,000 in fines for infractions in the past — fines that the company is fighting in court.A statement from the borough says it's adding incidents with Sanimax to a file that's already before the courts.With files from Elias AbboudAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}