{"id": "Touring musician elopes on P.E.I. between gigs", "paragraph": "When Joey Landreth came to P.E.I. last weekend as the opening act for Fortunate Ones, the Island made a big impression on the musician and his fiancée — so big they decided on the spur of the moment to tie the knot here. Landreth and the indie-pop duo Fortunate Ones were on P.E.I. for the weekend, with a gig on Friday and Saturday night at The Mack in Charlottetown. \"It was just a day like any day on a tour like any other tour,\" Landreth told Mainstreet P.E.I.'s Angela Walker. Landreth has been on the road since Aug. 22 with only short breaks, he said, so when the opportunity came up to tour Eastern Canada with Fortunate Ones he jumped at the chance — but only if his fiancée Anna Salgado could come too. \"We'd been apart for over a month at that point, it was just the romantic scenery of Atlantic Canada just got to us!\" Landreth said. \"Anna said, 'What if we just got married on this trip?'\"The two had been together for six years and planned to marry in September 2019 in a small ceremony. \"We just felt struck in the moment to do it, so we did,\" said Salgado. \"And it felt really right, it was really nice.\" They got a marriage licence in Charlottetown and with help from marriage commissioner Wendell Cameron, quickly found a venue: Holman's Ice Cream Parlour in Summerside, a restored Victorian home with period furnishings.It was a \"gorgeous spot, wound up being absolutely perfect,\" said Landreth. They married on Saturday afternoon before Landreth's show. Catherine Allan and Andrew James O'Brien of Fortunate Ones were the couple's witnesses, took all the wedding photos and even decorated their tour van for the occasion.The couple's friends were surprised but not upset, they said. And it gives Landreth lots to chat about to his audience between songs, he said. \"Oh yeah, I am milking that for the merch table!\" he said with a laugh. Landreth is from Winnipeg and plays electric bluesy folk. His latest single is Forgiveness, following up last year's debut album Whiskey. He also tours with his older brother in the Juno-award winning The Bros. Landreth, who are planning a new album next year. With files from Mainstreet P.E.I.Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}