{"id": "Time to keep birds away from power lines in Tantramar Marshes, say specialists", "paragraph": "It's time for a system to keep birds from the power lines in the Tantramar Marshes, say some wildlife specialists.The call comes after a several common eiders were electrocuted while on their migratory route from the Northumberland Strait to the Bay of Fundy area.\"Of the birds that were found, three of them were found alive out of the seven that were sent here,\" said Barry Rothfuss, executive director of the Atlantic Wildlife Institute. \"They all ended up dying in a short span of time after impacting the power lines.\"Usually weather is a factor, but Rothfuss said it was a clear day last week when the ducks hit the power lines.\"They just flew into the line as the sun was setting — around that time — so that could have been a visual thing. But for the most part again it's usually fog or inclement weather that will cause these kind of things to occur in large numbers.\"Rothfuss said these types of calls come in every year. He said deterrents are necessary to warn birds about the power lines.\"Visual deterrents or sound systems in the lines themselves that make noise or they visually reflect so the birds are more likely going to deter away from the power lines,\" he said.The Tantramar area is a well-known crossing for the common eider, said Tony Diamond, a University of New Brunswick seabird biologist.\"I really don't know why they didn't have [deterrents] in the first place. … For there not to be visual deterrents is scandalous, really,\" he said.NB Power does have an avian protection plan, according to spokesperson Sheila Lagacé​.\"Through that plan we identify high-traffic bird areas and in some circumstances we can even modify our structures with safer parts,\" she said.Lagacé​ said the utility might consider adding deterrent measures to the lines in the Tantramar Marshes in future.Lauren BirdLauren Bird is a journalist at CBC New Brunswick. You can contact her at lauren.bird@cbc.caAudience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636TTY/Teletype writer:  1-866-220-6045It is a priority for CBC to create a website that is accessible to all Canadians including people with visual, hearing, motor and cognitive challenges.Closed Captioning and Described Video is available for many CBC-TV shows offered on CBC Watch."}