{"id": "Recode Daily: Watch for falling tech stocks", "paragraph": "Amazon, Alphabet and Snap shares are all poised to drop today after the companies reported results yesterday. Amazon stock, for instance, is down 9 percent in pre-market trading. The company reported $2.9 billion in profit on $56.6 billion in revenue — it has been profitable for 14 straight quarters — but its slower-growing Whole Foods Market business has weighed down gains. Snap reported $298 million in revenue — better than Wall Street was hoping for — but Snapchat continued its shrinking trend, losing two million daily active users over the last quarter; shares are down 13 percent in pre-market trading. And Google parent Alphabet missed analysts’ quarterly revenue estimates for the first time in at least two years, sending shares down almost 7 percent after hours; they’re still down 5 percent pre-market.[Want to get the Recode Daily in your inbox? Subscribe here.]  Amazon’s advertising business registered another booming quarter, but it’s both a blessing and a risk. The business unit it belongs to grew to nearly $2.5 billion in sales, and its fat profit margin — analysts estimate it could be as large as 75 percent — is a big reason why Amazon posted its largest quarterly profit ever. But for all its glitz and hype, Amazon’s ad business does not come without significant risk: Namely, that an over-reliance on ads will ruin the Amazon shopping experience. The brilliance of Amazon lies in its cold efficiency. Search, click, buy. Repeat. Not search, scroll, scroll, scroll, click, click, buy. [Jason Del Rey / Recode]Google gave Android creator Andy Rubin a $90 million exit package when he left in 2014 following a sexual harassment allegation, despite not being obligated to provide him with such a large sum of money. The New York Times reported that Rubin was one of three executives that Google protected over the past decade after they were accused of sexual misconduct. In response to the disturbing NYT story, Google CEO Sundar Pichai sent an email to all employees saying that Google has fired 48 people in the last two years for sexual harassment. [Daisuke Wakabayashi and Katie Benner / The New York Times]It’s not all chill at Netflix: The Wall Street Journal talked to more than 70 current and former employees for a report on the company’s culture, finding that, at its worst, “the Netflix way” can be ruthless, demoralizing and radically transparent to the point of dysfunctional. As one example, Netflix managers are all told to apply a “keeper test” to their staff — asking themselves whether they would fight to keep a given employee — a mantra for firing people who don’t fit the culture and ensuring only the strongest survive. [Shalini Ramachandra and Joe Flint / The Wall Street Journal]Apple has waded into the messy world of news with Apple News, a curation service that is read regularly by roughly 90 million people. But while Google, Facebook and Twitter have come under intense scrutiny for their influence over the spread of information, Apple has so far avoided controversy — maybe because while its Silicon Valley peers rely on machines and algorithms to pick headlines, Apple News takes a human-led approach. [Jack Nicas / The New York Times]President Donald Trump signed a memorandum instructing the federal government to develop a national spectrum policy that would speed up the introduction of 5G wireless networks, an effort designed to ensure that there is enough spectrum to handle increases in wireless traffic. Trump, who rolled back two Obama-era presidential memorandums on spectrum, also called for the creation of a White House Spectrum Strategy Task Force, and asked federal agencies to review how spectrum can be shared with private sector users.[David Shepardson / Reuters]Don’t miss this fascinating rise-and-fall story of the marketing genius who built The Sharper Image into a mail-order kingdom of flashy gadgets built on electric nose-hair trimmers, Razor scooters and Trump steaks. The ethos of the stock-boom ‘80s was, “He who dies with the most toys wins,” and Richard Thalheimer expanded from catalogs into physical retail, opening stores in well-to-do enclaves across America. But Thalheimer’s battle with Consumer Reports over a bad review brought his gizmo kingdom tumbling down. [Zachary Crockett / The Hustle]As big tech struggles to curb hate speech, civil rights groups have some recommendations. A new report from a coalition of six groups calls on tech to put more effort into coming down on hate activity online. [Shirin Ghaffary]Paul Allen’s sister has been tasked to do a surprisingly hard thing — give away billions of dollars. Jody Allen isn’t someone most people have heard of, but she’ll wield enormous power in the next few years. [Theodore Schleifer]Twitter is now consistently profitable. It took more than a decade, but Twitter just turned a profit for the fourth quarter in a row. [Kurt Wagner and Rani Molla]Inside a traditional Mexican hot-sauce factory.And here’s a history of Japan’s most successful invention — ramen.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}