{"id": "Recode Daily: Kara Swisher interviews Elon Musk", "paragraph": "Recode sat down for a rare interview with Tesla and SpaceX CEO Elon Musk, one of the most loved, most hated and generally most talked-about figures in tech. Editor at Large Kara Swisher and Musk met on Halloween night at Tesla HQ in Palo Alto to talk about all of his businesses, his social media habits, his public animosity toward the press and fondness for dad jokes, President Trump’s Space Force, accepting money from Saudi Arabia and lots more. Read or listen here. [Kara Swisher / Recode][Want to get the Recode Daily in your inbox? Subscribe here.]  Early next year, Recode will relaunch on Vox.com, retaining its name and branding. Recode will join the Vox newsroom, and the two journalism teams will work together toward the launch of a number of new editorial products and continuing its popular podcasts, newsletters, videos, television and signature live events. The aim is to create bigger, bolder Recode, using Vox’s platform, editorial support, and distribution power. Recode co-founder Kara Swisher shares some thoughts about Recode’sroots and the road to this latest evolutionary step. [Kara Swisher / Recode]Thousands of Google employees staged walkouts around the world to protest gender inequality and a company culture that has tolerated and protected executives accused of sexual misconduct. The largest crowds were at Google’s main campus in Mountain View, Calif.; hundreds also demonstrated outside of Google offices in Singapore, Japan, Israel, the U.K., Ireland and India. Here is the list of demands presented by the organizers of the walkout, including asking the company to remove mandatory arbitration clauses from employee contracts. And here are some scenes from around the world. [Shirin Ghaffary / Recode]More than 50 companies signed a letter opposing any effort by the Trump administration to roll back transgender rights. Signees include Apple, Amazon, Cisco, Facebook, Google, Intel and Microsoft, as well as non-tech firms including Nike, Dow Chemical, JP Morgan Chase, Levi Strauss and MGM Resorts. A leaked memo, reported last month by the New York Times, suggests the administration may be looking to rigidly define sex as binary and determined at birth; such a move could have a broad impact on the lives of transgender Americans. [Ina Fried / Axios]Apple ended its fiscal fourth quarter with a 29 percent revenue increase in its iPhone division — despite no change in iPhone unit sales. The company also met its overall revenue target of $62.9 billion — up from $52.5 billion this quarter last year. (Apple’s Q4 quarter ended in September, meaning it only accounted for the first few weeks of the new iPhone XS and XS Max going on sale.) Apple also warned that sales for the crucial holiday quarter would likely miss Wall Street expectations; the disappointing forecast helped send shares down as much as 7 percent, taking roughly $70 billion off Apple’s market value and forcing that value below $1 trillion. Cook also said that Apple will stop reporting unit sales for iPhone, iPad and Mac from next quarter — the start of its next financial year. [Natt Garun / The Verge]For the first time in its history, Spotify has turned a profit. The Stockholm-based music-streaming service announced Q3 earnings, reporting a net income of roughly $49 million — a share swap with Chinese tech giant Tencent gets some of the credit for that. Spotify claims 87 million paid subscribers, an increase of 40 percent compared to the same period last year; the service has 191 million global users, up 28 percent from last year. But even a profit coupled with strong subscriber and user growth wasn’t enough for investors, who grumbled about missed revenue growth. [Aisha Hassan / Quartz]Turn and face the change: Recode and Vox.com are partnering.More of the same and more of the different. [Kara Swisher]An epic report on the final season of “Game of Thrones.”Welcome to the Petty Hall of Fame.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}