{"id": "Facebook’s board is throwing public support behind Mark Zuckerberg and Sheryl Sandberg — who are on Facebook’s board", "paragraph": "Facebook is circling the wagons as the company looks to do damage control following a damning New York Times story published Wednesday that called into question decisions made by Facebook leadership, including CEO Mark Zuckerberg and COO Sheryl Sandberg, over the past two years. Among the claims in the story: That Facebook knew Russia was using the service to try and influence the 2016 election much earlier than it publicly announced. The story also revealed that Facebook hired an opposition research firm to “discredit activist protesters” and link them to Democratic financier George Soros, something Zuckerberg claimed on Thursday that he knew nothing about. That story got us asking: Who from Facebook might be fired for the company’s missteps?Whoever it is, it doesn’t look like it’ll be Zuckerberg or Sandberg. At least not right now. Facebook’s board of directors issued a public statement defending the company’s efforts in fighting Russian election meddling efforts following the 2016 presidential election. It also called the story “grossly unfair.” Here’s the full statement.“As Mark and Sheryl made clear to Congress, the company was too slow to spot Russian interference, and too slow to take action. As a board we did indeed push them to move faster. But to suggest that they knew about Russian interference and either tried to ignore it or prevent investigations into what had happened is grossly unfair. In the last eighteen months Facebook, with the full support of this board, has invested heavily in more people and better technology to prevent misuse of its services, including during elections. As the U.S. mid-term showed, they have made considerable progress and we support their continued to efforts to fight abuse and improve security.”The irony, of course, is that Zuckerberg and Sandberg are both on Facebook’s board. Given the statement isn’t attributable to any one board member, it looks like Facebook’s executives are throwing public support behind ... themselves. On a conference call with reporters that lasted well over an hour Thursday morning, Zuckerberg also sidestepped multiple questions asking him whether someone at Facebook should be fired for the company’s strategic moves over the past few years. “In terms of performance and personnel management, I just generally don’t talk about that — specific cases of that in public,” Zuckerberg said. “It’s not that we run the company and people make mistakes and there’s no consequences.”Zuckerberg also gave a strong showing of support for Sandberg, who came out looking the worst of all Facebook’s executives from the New York Times investigation. Not only did Sandberg make some questionable decisions about when and how to disclose Russian meddling efforts, but a lot of the other executives mentioned making questionable decisions were Sandberg’s direct reports. “Sheryl is doing great work for the company. She’s been a very important partner to me, and continues to be, and will continue to be,” Zuckerberg said. “She’s leading a lot of the efforts to improve our systems in these areas, and as I’ve tried to convey, while these are big issues, I think we’re making a lot of progress and a lot of that is because of the work that she’s doing.”It does not look like Zuckerberg will be giving up his own role as CEO, or as Facebook’s chairman, anytime soon. When asked about the chairman role, Zuckerberg said he didn’t think changing his role on the board was “the right way to go.” When asked why he was still the best person to run Facebook, Zuckerberg said that he has Facebook on the right path to improvement — he just needs more time. “I don’t think that me or anyone else could come in and snap our fingers and have these issues resolved in a quarter or half a year,” he said. “This stuff is painful ... but to some degree, you have to know that you’re on the path and that you’re doing the right things and then allow for some time for the teams to actually execute and get the stuff working the way that we all know it that it needs to be, and to the standard that people expect.”Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...One senator says the company \"actually encouraged anti-Semitism\" by hiring an opposition-research firm.A Verge affiliate site"}