{"id": "Silicon Valley’s Saudi money crisis illustrates a decline of ‘moral leadership’ in America", "paragraph": "Some of Silicon Valley’s biggest companies are swimming in billions of dollars invested by the crown prince of Saudi Arabia, Mohammad bin Salman — a heavy financial backer of SoftBank’s Vision Fund — who is now accused of ordering the torture and assassination of journalist Jamal Khashoggi.“Anywhere you tug, at any company or any investment firm or any VC, there is either Saudi money or there’s questionable money everywhere, across the system,” Recode’s Kara Swisher said on the latest episode of Pivot. “And if you remove the Saudis from the worldwide global network, everything collapses.”Her co-host, NYU’s Scott Galloway, said the silence of most tech leaders — and, even more importantly, the slow and muddled response from Washington — are indicative of a crisis in morality that will bite businesses in the end.“We have put a price on moral leadership,” Galloway said. “And the presidents of the past have always tried to figure out the balance between the realpolitik and our strategic interest. This isn’t new. But we at least pretended to care ... And by the way, I think this is the same infection that has caused illness across all of Big Tech: We’re trading off long-term moral leadership in exchange for short-term profits.“The reason why we have inflows of capital, the reason why our publicly traded stocks traded at 19 times PE, not 11 or 12 in other markets, is because we have rule of law and some sense of moral leadership here,” he added. “And when we engage or traffic in bone saws, we are long-term trading off our brand and the margin power that comes from our brand. So this is not only the wrong thing to do, it’s economically a stupid thing to do.”You can listen to Pivot with Kara Swisher and Scott Galloway wherever you get your podcasts — including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a full transcript of Kara and Scott’s latest episode.Kara Swisher: Hi everyone, this is Pivot, from the Vox Media Podcast Network. I’m Kara Swisher. Scott Galloway: And I’m Scott Galloway, coming to you live from one of the 19 cities that has been played and will not be HQ2, Kara. Chicago. This is at Amazon, right? Correct?Got it. That’s right. I like Chicago, it’s one of my favorite places. 80 percent of New York for 50 percent of the price, it’s the Old Navy of cities. All right, let’s get started. Let’s get right to the big story this week. And it’s also had so many implications in tech, which is the Saudi money toxically awash in Silicon Valley and how tech companies are responding to the disappearance of the journalist at the Saudi embassy — not the disappearance, the murder of a journalist at the Saudi embassy by the Saudis, which I think most American intelligence, all the reports are coming in, that this is what’s happened. And the presence of Saudi money in Silicon Valley. So let’s talk about it. So last week, Kara, you said you couldn’t get anybody to comment. What’s happened between now and then? What is the response, what are they saying on the ground out there?Well, what’s really interesting, I had a really interesting dinner with a lot of people who are involved in this stuff, and there’s a couple things, there’s a few things. One is that there’s been dirty money here for a long time, whether it was Russian money, and the fact that it’s not just Saudi money, it’s all kinds of money from the Middle East, that is really problematic, not just sovereign wealth but individual wealth, because there’s so many wealthy people, they just washed into this area. And lately it has been money from the Mideast, comparatively. And then there’s Chinese money, there’s all kinds of different things going on, and they were all talking about where the different money is moving in, which was fascinating to me, and there were several people who were involved in these things. One of the issues is, first of all, the first thing they did, they said they’re not gonna go to “Davos in the Desert,” this event that MBS has, the head of Saudi Arabia, the crown prince has. It’s Mohammad bin Salman, is his name. Right now, everybody is calling him Mohammad Bone Saw. I know, awful, it’s an internet meme right now, but I think fine, that’s good with me. So they were talking about whether they were going. A lot of them had gotten out. The first one was Dara Khosrowshahi, who is the CEO of Uber, and he was gonna attend this and now he’s not going. He was one of the first to declare that. That said, he has not returned the $14 billion that they got, half of which was Saudi money, from SoftBank’s Vision Fund. I think a lot of people are focused on the Vision Fund, which was the big fund that SoftBank raised, and they were about to raise another hundred-billion dollar fund, which was an unheard of fund, which has been throwing money at everybody, from Slack to WeWork to Wag, which is a dog-walking app. $300 million to the dog-walking app. So half of that is ... 45 percent of that fund, $45 billion, is from the Saudis. So anything, if Uber’s gotten $13-14 billion, then $7 billion is from the Saudis, essentially, from the public investment fund that they have, which is called PIF. So nobody’s giving the money back, let’s just say, that’s what’s happening. And nobody wants to think about that idea. Now, whether they’re going to take it from them going forward, that’s the big question. Yeah. Do you think it’s realistic or even a reasonable ask to say, “Give the money back”?No. That’s not gonna happen. Yeah. That’s not gonna happen. You know what’s an opportunity here, Kara, I think SoftBank, which by the way, in the ecosystem, at least in New York, is showing up with a very, very big stick. Whereas these VCs with only billion dollar funds might offer you $30 million at a pre- of $60 [million], they show up and say, “We’ll put in $100 at a pre of $150.” And they were literally muscling around U.S. venture capitalists. They are. And they’re taking a lot of the companies, they’re taking 40 percent of the company. I think it’ll be interesting, because they have been a little muscle-y, I would say, and I think a lot of people don’t like it, but how can you ... What they have done is gone and said, “If you don’t take my $300 million, I’ll go and give it to your competitor,” and they’re very aggressive, they’re an aggressive group of people. And this is Masa Son, who is head of SoftBank. But I’ll be interested to see what’s going to happen going forward. Nobody is giving the money back. And a company like Slack, Stewart Butterfield who’s the CEO there, he usually calls back and he has not called back. So I think everyone at dinner was horrified and embarrassed, and at the same time, the money was not being returned, and they were making the point that anywhere you tug, at any company or any investment firm or any VC, there is either Saudi money or there’s questionable money everywhere, across the system. And if you remove the Saudis from the worldwide global network, everything collapses, because this is where much of the investment money ... And they’re trying to obviously buy influence in technology. And it’s working. Yes. Go ahead. The reality is, people 10 times as important as you and me can be murdered and dismembered with a bone saw, as long as you’re buying a bunch of aircraft carriers or submarines. We’ve basically put a price on ... I don’t know this, but I would speculate the conversation post- this event between Pompeo and Trump and the Saudi government there was like, “You guys obviously screwed up, we had nothing to do with this, but if you want us to be co-conspirators in the coverup, you’re gonna have to buy another 130 tanks,” or whatever it might be. We have put a price on moral leadership. And the presidents of the past have always tried to figure out the balance between the realpolitik and our strategic interest. This isn’t new. But we at least pretended to care, we at least said, “Okay, anything involving a bone saw, it’s time,” or I think it’s time, anything involving a bone saw... And by the way, I think this is the same infection that has called illness across all of Big Tech, we’re trading off long-term moral leadership in exchange for short-term profits. Well, it is. It’s interesting, but this is where the money is coming from. This is where the wealth is, this is where it is. So there’s two questions that people are going to be asking. Do they need this much money, do they need the $300? They probably don’t, they were fine with the smaller amount. They didn’t need it, but everybody feels like they need to have these war chests. They were like, if they have to have the war chest, we have to have the war chest. So that’s how these things escalate. And the question is, what companies are going to go, “No?” One interesting thing was, the previous Saudi investor was ... I can’t remember all their names, but he was an investor. He had Kingdom Holdings, and he was investing in Twitter, or Apple or different things like that, and he was just a basic investor, it wasn’t this PIF thing that was going on. And he was considered the “good” investor, essentially. He was one of the ones that was jailed at the Ritz, and then MBS took everybody’s money there. He basically took hostage money, I guess, from them. And some of that is what’s now flowing into Silicon Valley, which is fascinating. Of all the people that were jailed at the Ritz-Carlton, which is a strange thing to say. What the key part is is that Silicon Valley cannot say it didn’t know, it doesn’t know where this is from. Yeah. It’s 100 percent true. But I would argue that the companies, granted, are complicit in it, but at the end of the day, because of the structure of our capital markets, companies have a very difficult time not thinking short-term. But the reason we give 23 cents on the dollar to our government is we pay them to think long term. And the ultimate reason that people buy Fords or have bought Fords is not because they were better cars, but because it reflected a belief in the middle class. The reason people buy Nikes is it’s about elite excellence can bring you to the highest echelons of performance and recognition. And the reason why we have inflows of capital, the reason why our publicly traded stocks traded at 19 times PE, not 11 or 12 in other markets, is because we have rule of law and some sense of moral leadership here. And when we engage or traffic in bone saws, we are long-term trading off our brand and the margin power that comes from our brand. So this is not only the wrong thing to do, it’s economically a stupid thing to do. I would agree. But one of the things that’s interesting, the Saudis also have a lot of money in the stock market. So they own 5 percent of Tesla. Look, Elon Musk can’t stop them from doing it, although he was talking to the Saudis, as you know, when he did the “funding secured” [tweet]. That’s the PIF, who he was talking about. So that’s interesting. But Apple can’t help it, I think the Saudis own 30 percent of Snapchat at this point. There’s an enormous stake that they have, PIF does. It’s a large amount of a lot of these tech companies, and that’s what they’ve been buying into. Now, those you can’t prevent, it’s an open market situation. But you certainly can, even if these are your investors, say something. And most of these companies have said nothing, really. The strongest was Dara Khosrowshahi, but he has to because he has so much other money. And I think Sam Altman, who was an investor at Y Combinator, did say he’s not going to the Davos in the Desert event, whatever it’s called, but it’s the PIF thing. And a lot of people have pulled out. Steve Mnuchin’s still going, I think he’s going, right? Shocker.[editor’s note: shortly before this podcast was recorded, Mnuchin dropped out of the event]I think it’s him and ... that’s all that’s going. But I know all the tech people are definitely not going now, and they can’t show up there. But there’s got to be another step, they’ve got to start saying something like, they have to make some declaration even if they’re not gonna give the money back, but they haven’t. And this is the whole trend, is they now have to make declarations on everything. On everything that happens now, companies are on the hook for saying something. In this case, it’s such a bright line between what they have to say and how much money they’re taking from them. It’s unavoidable. So I’m gonna keep bugging them. Anyway. But it’s an opportunity. It’s an opportunity for SoftBank. I think one of the ultimate brand moves of the past year was actually at the World Cup, where the Japanese soccer team, a national team, after a crushing defeat at the hands of Belgium and Romulu Lucaccu — one of the most underrated strikers in the world, but that’s another story.Please don’t tell it to me. You know what they did? They cleaned up their dressing room, and they stuck behind and helped the fans and the workers clean up the stadium, and then they wrote a thank-you note. And I think we have unfortunately an ability, we can’t not stereotype organizations by their national identity. And I think SoftBank has the opportunity here to say, “The way we roll in Japan is we’re just a little bit more dignified, we’re a little bit more polite, we’re a little bit more honorable,” and to not accept that money and take the fund down from $200 billion to 120. Masa Son has not said a word. It’s an opportunity. I think he’s listening. I don’t think he is, I think he’ll say nothing. And Masa Son, I think this is an opportunity. We’ll see about that. Anyway, by the way, I have a Ford Fiesta, Scott, just so you know. I just can’t even imagine that. It’s a lawnmower with doors. We gotta get you out of that thing for safety reasons. I have a turbo stick shift, so let’s just try again, it’s a sports car. Turbo stick shift?That’s right, it’s very fast. You’ll see, you’ll drive it when you’re here with me, we’ll go around, it’ll be great. We’ll do Pivot from my ...I would have an elbow sticking out of each window. That would look ridiculous. No, you and I are going for a ride in my turbo. Everybody makes fun of my Ford Fiesta, and they get in it and drive, and they go, “Oh, this is a great car.” Just so you know. That’s cause they’re kissing your ass, Kara. They don’t really think that.It’s not, you’re gonna see, it’s gonna be great. That’s an awful car. We’re gonna do Pivot from the Ford Fiesta and we’re gonna get Ford to be our sponsor. You see, this is how this works. Anyway, let’s talk about something positive, a win of the week, because it’s been a crappy week, it’s a shitty week. So we’ve lost all over the place in the Saudi situation. Who’s your winner?No, what is your winner? What is your winner?My big winner? I have two. Okay. There was a wonderful article in the New York Times about a gentleman who was the head of the Japanese consulate in Lithuania during World War II and it ends up that him defying his government and refusing to stop signing and writing visas, literally until he could no longer write, and then when he was extracted from Lithuania, writing these visas for Jews who were trying to get to Japan and then to somewhere else. He, on his train ride out, was literally throwing visas out the window. And they’ve done some research and it ends up that this gentleman, Chiune Sugihara, likely saved 6,000 Jews, possibly 40,000 who are alive today. It’s a wonderful story of moral leadership in the face of adversity, moral heroism. Moral. There’s been some interesting research here that moral heroism stems from some of the same attributes, the rebelliousness that creates great entrepreneurs, and it’s just a lesson for all of us. It’s pretty obvious what the right thing to do is, sometimes it’s really, really hard. And this guy saved ... 40,000 alive today because of this guy. Just an inspiring story. And my second is Nike, who made ...You love that Nike. I’m so into Nike right now. Okay. I didn’t much like their sexual harassment stuff, but go ahead, move along. Rain on my parade, seriously. Just, I feel shamed. All right, go ahead, what did Nike do? So Justin Gallegos, a runner with cerebral palsy, who’s a pretty serious runner ...I feel bad, okay. Nike showed up and endorsed him, made him an official Nike athlete. And there’s this fantastic two-minute film on it. Granted, it’s commercial and sappy and soft lighting, soft music. But my feeling is the basis, and the wonderful thing about capitalism is as we pursue economic interests for us and our families, really wonderful things can happen. And I think this was such a wonderful thing. Scott, you’re such a softie. What, did you put the afghan around you and have marshmallows and cocoa? This is lovely, this is beautiful, I’m crying. Kara, hold me. Let me just, no, I will not. Thank you. Once again, crossing a line. In the Fiesta. Crossing that line, never changes, you. Listen, I had a win for the week. We were liking that Facebook had a tougher ban on false information posts, but of course what happened on Recode this week is they introduced the Portal, which we talked about last week.You guys broke this. Yes. When they said they introduced it, “No, no, we’re not using the data for ad targeting,” and then they called us back and what did they do?What do you know? Yeah, apps and who you’re calling, right?Yes. We are using the data for our targeting. Which was like, for one brief second, we were like, “Okay, we don’t love their surveillance device, but at least they’re not using it for ads.” And then they were. That was just awful, I have to tell you, just awful. But you know these guys, I don’t. What happened? I don’t know why they didn’t just throw it in the trash. They waited six months to put out the Portal and then they just did it right in the middle of a hurricane of privacy, I don’t know. I don’t know what’s going on there. Have you heard anything about initial sales or reception in the marketplace, have you heard anything?All I know is literally I had a table full of internet people say, “There’s no way I would put a dancing Facebook surveillance device in my home.” So I don’t know. And this was the, these people would buy it, but nobody at this dinner party was buying it. You know these guys, I don’t. What do you think happened, that they knew they were targeting and then they lied to you and said, “Okay, what do we do, we’ve lied, do we let the lie hold or do we have to ...?” Was it incompetence or deception? I don’t even know if it was a lie. They said one thing, I don’t know, I couldn’t tell you. I don’t think they were lying. I don’t know. I don’t have any information for you on this, it was just like, “What?” I’m telling you, Scott, they just have got to get it together down there, don’t you think?I’m so outraged I’m going to go express my outrage on Instagram. I don’t use it, I do not use Instagram. That’s it. Take that, Facebook. “Instagram is a museum,” as my children say. Anyway, we’re gonna go to predictions now. Mr. Galloway, some predictions?The individual throwing out the first pitch of the opening game for the Washington Nationals 2019 season is Jeffrey Bezos. Okay. Why is that? Explain. Imminently, they’re gonna announce that the D.C. metro area is the location of the HQ2, reflecting that this entire shitshow circus HQ2 is nothing but a ruse. That a man worth $145 billion at the age of 54 gets to live where he wants, where the Bezoses want to live is D.C. They’re coming to you. Do you know my ex-wife’s house is like seven doors down from him? It’s really interesting. So he’ll be a neighbor. Really? Are they close, do they know each other?Yeah. We all know each other. We knew him when he was a little guy. Yeah, sure. We’re not married anymore, but we’re friends, and I don’t think we’ll be going over for tea. I don’t see that happening. But neighbors, in this crazy neighborhood. I heard the house was bigger than the Museum of Natural History, it’s just enormous. My ex worked for Google, she’s got a big house. So does he. They’re all big. They’re all these big ... they look like the Bulgarian embassy, that’s what it looks like. They all do, every one. They’re big. They’re just big Washington houses, then they look like embassies, every one of them in that neighborhood. It’s called Kalorama. Obama lives there, Ivanka lives there, Rex Tillerson lived there, I think Mnuchin’s somewhere wandering around. I’d like to party with Tillerson. Yeah. Would you?Yeah. I think he, me and Zach Braff would just slay it in Adams Morgan. A few beers, me and Rex and chili. Where did Zach Braff come in? Oh my goodness. He’s always a good third partner when you’re rolling. He’s always a good third partner. Okay. All right. So you think he’s gonna pick Maryland, Virginia, for that thing. Oh, by the way, I have some insight, you get all the scoop. I was on the train back from D.C. and I saw, gosh, this really good guy, the [founding] dean of Cornell Business School, [Daniel] Huttenlocher, he’s on the board of Amazon, and I immediately thought, okay, that means he was down there extracting a pound of flesh from Mark Warner or someone in Virginia. Anyways, that’s my prediction. What’s your prediction? Okay. I think Maryland is probably a very good bet, and second backup is Pittsburgh. That would be my guess. You think there’s a backlash when everyone realizes they’ve been played?No. Everyone’s like, “Oh well, I didn’t win on that lottery ticket, let’s try again next week.” You know what I mean? I just think the whole thing ... to give one of the world’s richest men a tax break is always an enjoyable thing to watch. Isn’t it cute, though, how Indianapolis and Columbus actually think they have a chance? Isn’t that just adorable, if they think the wealthiest man in the world, who doesn’t need to spend 12 minutes much less 12 weeks a year in Indianapolis, is going to decide to put his HQ2 there? I think it’s just so cute. One can dream. One has hopes and dreams and things like that. Yeah, I think it’s probably gonna be located there. The only other option is if he picks a Canadian city. Yeah, that’ll happen. I’m just saying. That’ll happen. You never know. I’m just gonna put it out there so I look smart, that’s all I’m saying. Tied for first wealthiest person in the world is MacKenzie Bezos. After spending 10 months here in rainy Seattle, she’s gonna be like, “I know, we need to spend more time in Toronto”? It’s not gonna happen, Kara. And they’re not going south, you’re right. Yeah, you’re right. That’s a fair point. All right, okay. All right, well, we’ll see. It’s gonna be very soon. The dark horse is Miami, because I spoke after him at this JPMorgan Master of the Universe conference, and he was by the pool and I think he was really happy there. It’s nice there. Isn’t Miami great? Miami’s a hell of a place. I’ve been on the board of seven public companies, and I’ve gone through four headquarter relocation processes, you know what it always comes down to, in retrospect?What?You find out the CEO cloaked business reasons in the decision, and the decision all came down to one thing and one thing only, Kara. What, a pool?Where the CEO wanted to spend more time. Where he was chairman of a golf club or where his next wife was living. I’m gonna just leave it at that, except to say I love Miami. I always feel like doing something naughty when I’m there. Anyway, all right. So Amazon ...In the Fiesta, you’re rolling along Collins Avenue in your turbo Fiesta. Next week we’re gonna talk about Uber’s public offering. But not this week. I’m gonna leave it at that, Scott, the second wife thing. And I have to get out of here. Did we miss anything? I think we’re good, right? We’re good. Yeah. This feels right as rain. Saudis and Jeff Bezos. I would describe you, the Fiesta and this show as a tall drink of lemonade with vodka. Okay. All right, I don’t even know what that means. Thanks Scott, looking forward to talking again next week. By the way, if you have any questions for us on this podcast, shoot us an email at pivot@voxmedia.com.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}