{"id": "Two workers have died at an Amazon warehouse in Baltimore", "paragraph": "Two workers at an Amazon warehouse in Baltimore died on Friday evening after part of the building collapsed during a storm, an Amazon executive said on Twitter on Saturday morning.The incident happened at a facility that Amazon calls BWI5 — a building known as a “sortation center” in the southeast part of the city. Workers at Amazon facilities like this one organize Amazon orders to get them ready for delivery partners like the United States Postal Service.Dave Clark, the top Amazon operations executive who oversees the company’s global network of warehouses, posted the news on Twitter on Saturday morning.updated- Last night severe weather impacted one of our Baltimore facilities resulting in 2 fatalities. Thank you to the emergency response teams who have been working through the night.  Our thoughts and prayers go out to those impacted by yesterday’s tragic event.The Baltimore Sun reported that the workers were killed when a 50-foot wall collapsed during a storm on Friday evening. The National Weather Service confirmed on Saturday that a tornado struck Baltimore around the time of the tragedy.It is not yet clear if the workers were employed by Amazon or a trucking company, the paper said.Update: An Amazon spokeswoman said one of the victims worked for JLL, a real estate consultancy and outsourcing firm. The other was a contractor working for a local delivery company. The incident comes just a couple of days after Amazon’s new $15 hourly base wage for all of its warehouse workers went into effect in the U.S. and United Kingdom. Amazon has come under fire from politicians including Sen. Bernie Sanders both for the pay of its warehouse employees and their working conditions.Last year, Amazon faced fines following the death of two warehouse workers who were killed in accidents at separate facilities. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}