{"id": "23andMe CEO Anne Wojcicki says ‘one of our biggest competitors’ is fake science on sites like Goop", "paragraph": "Unlike many Silicon Valley CEOs, 23andMe’s Anne Wojcicki is constantly reminding her employees of an uncomfortable truth: “We mess with people’s lives.”“You tell someone that they’re a carrier for BRCA, or you tell someone, ‘You’re a high risk for blood clots.’ Or you tell someone that you’re one-64th Native American,” Wojcicki said on the latest episode of Recode Decode. “And it has real consequences on their life. And so we’re messing with people’s identity. And it’s really important that we take that seriously.”The DNA-testing service has been working its way through FDA regulations since 2013, which Wojcicki said was “frustrating” but understandable. She told Recode’s Kara Swisher that others in the health and science world — such as Gwyneth Paltrow’s wellness site Goop — have evaded those same controls and are spreading bad info.“One of our biggest competitors in this space of science is Goop health and Gwyneth Paltrow because she has such pull,” Wojcicki said. “But some of the things that she promotes don’t actually have the scientific validity that my team would be able to stand behind.”“One of the things that we think about with 23andMe is just promoting scientific literacy, because it’s important for people to know what is real and what is not real,” she added. “In some ways, it’s actually the same issue that you have right now in news. How do you discern what’s actually real and what’s not?”You can listen to Recode Decode wherever you get your podcasts, including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a lightly edited full transcript of Kara’s conversation with Anne, which was recorded in front of a live audience at the Rock Health Summit in San Francisco.Kara Swisher: So, we have a lot of things to talk about. Obviously, Anne and I have known each other forever.Anne Wojcicki: A long time.Long time, before when she was a healthcare analyst.Yeah, yeah.And so we’re going to talk about 23andMe, but I think it’s remiss of me not to talk about the current news with Elizabeth Warren and testing. And so I wanted to sort of get Anne’s reaction ... come on, come on. People are going to learn a lot about genetic testing in this period, I think.So let’s talk about this. This is like, you know, you guys have gotten a lot of attention and different things, but this sort of brings a huge focus onto people’s genealogy. Yeah. No, I mean, I think it’s the sense of identity and where people are from, is definitely a hot topic. We have this new podcast episode that specifically talks about race and the definition of race and how it’s being redefined. And years ago — probably four or five years ago — I spoke at the National Association of Reform Rabbis, and I presented them, “Hey, here’s all the different results people are getting.” People find out they’re 5 percent Jewish, 10 percent Jewish, 15 percent Jewish, and they’re walking into synagogues and are like, ‘We want to join, we’re part of the tribe.’” And it’s kind of similar in this case, like what is that definition? What’s the definition of being Jewish?Right.And what’s the definition of saying, “I have Native American ancestry”? Or African ancestry. So without a doubt, the thing that’s amazing to me is the science of your genetic ancestry is really good. And so you get, in the fringes, it’s going to keep refining over time. I always say it’s kind of like Google Earth in the old days: It’s a little bit fuzzy, but over time, it refines and it refines, and especially as the databases are getting bigger and there’s more and more populations. So I believe ... I know Carlos Bustamante, who did the analysis, he’s well known specifically for this, he’s an adviser to us, he’s an adviser to ...Just to be clear, Donald Trump said he was a bogus ...He kind of was like, “Yeah these are fake tests, whatever. This is like ...”, and I was like, “Well it’s ironic ‘cause we’re spending all this time going through the FDA and showing just how legitimate genetic testing is.” And so on the ancestry part, it’s one thing that I remember even when I got my results, how shocking it was to see. My father’s Catholic, my mother’s Jewish. And my DNA comes back, “Wow, you’re 50 percent Jewish.” So it is remarkable how, I think, how ...Well, wouldn’t you know that from your mother’s Jewish ...Well I did, but it was interesting to see it based on, it was interesting to see it in my DNA.I’m not a scientist, but ...But I think that’s what’s interesting, is when you see something that’s so obvious to you, but it actually manifests in your DNA.Right. You know what I found out?What?I was Jewish.Oh!And African.Okay.And Arabic.Yeah.Everything was in there. It was fascinating. Oh, interesting.And so one thing I did, and my mother was even more so, ‘cause I guess we were in southern Italy, so it makes a lot of sense when you start to think about those things. And also my other side of the family’s from the south. So you don’t know where it’s all coming in. And I called my ... I have two brothers, and one lives here in Marin and is totally normal. The other is in Pennsylvania and he’s what you’d imagine a Trump person from Pennsylvania would be like. And so he’s, I would say, vaguely racist. And so I called him up, and I said, “Hey brother.” And he goes, “What?” And I go, “No, you’re African-American.” And I said, “Now you can hate yourself.”Yeah.’Cause he’s so offensive. But it was a really interesting, it was really fun. I really appreciated that time I spent on 23andMe, just to get that.One of my favorite stories ever is, ironically, written by People magazine. And it’s a story of this man who had a one-night stand with this woman; he’s part of the KKK, he was a child of a Grand Klansman. He had a one-night stand with this woman who was Jewish. She then went on to have, they had a child. Went on then to have biracial children with someone who’s African American, someone who’s Latino. So this man, who’s part of the KKK, finds through 23andMe that he actually has these African American, mixed-race children. And they meet. It’s a well written story, ‘cause it doesn’t say, “Oh it was all lovely, roses, and everything changed.” But it was like, “I realize I have to reevaluate my position, and it’s not easy. I have a history of hating.” He’s like, “Do I love that I have this African American son-in-law? It wasn’t what I would have chosen, but I’m learning that I have, I have to re-evaluate.”But in this, I just want to get through this news. In this situation it’s being used for not-nice things. Yeah.It was initially used, for some reason she did this, and then Trump responded and kept calling her “Pocahontas.” And then she responded. And she was trying to do this in response to that.Right. What does that do to this idea of genetics? ‘Cause now it becomes sort of a clown show, in terms of how you treat it. How do you look at this, when this news thing pops up and you’re one of the companies that is doing this as a business?I think there’s a lot ... I think that it’s hard to battle fake news. And I think the only way you battle fake news is actually just with data. And I think that’s where, again, I’m proud of Carlos Bustamante who’s at Stanford, who’s the one who did the analysis, who’s led a lot of this work. Is that there’s data behind it. So in some ways, I haven’t worried that much about this because I think that there’s data behind it, that supports the validity of somebody gets something that says, “You have a great-great grandparent who is of Native American ancestry.” I think that there’s good scientific explanations for it. And it think that in this day and age, one thing I say, I often say, one of our biggest competitors in this space of science is Goop health and Gwyneth Paltrow because she has such pull. But some of the things that she promotes don’t actually have the scientific validity that my team would be able to stand behind. And so I think in this world we’re seeing all kinds of fake news and fake reports of health, but I think that’s where the only thing that we can do is help educate customers about what is real science. And making sure that we’re only promoting real science. It’s part of where we have a very strict standard about what we give back to people.But you consider Gwyneth Paltrow a competitor. Really, why?Not a competitor in ...Only because they, I don’t feel like people who advocate jade in your vagina is a competitor, but that’s ...I think it’s more about when I think about what people are doing, their engagement in health.I see, okay.Their interest in wellness.Right.They often, like you look at her site traffic. Her site traffic or the site traffic to the CDC, which is like ... Think about the publicity around the anti-vaccine movement, and their site traffic versus the site traffic to, again, people who are promoting, “This is what the vaccine schedule should be.” So my point more is that there is a lot of people who are able to promote faux science, and I think that that is actually an issue. And part of one of the things that we think about with 23andMe is just promoting scientific literacy, because it’s important for people to know what is real and what is not real. In some ways, it’s actually the same issue that you have right now in news. How do you discern what’s actually real and what’s not?So let’s talk about where the company is and where the area is. Because there’s been a lot of changes. You’ve been working with the FDA ... where do you stand? You’re getting more and more tests. So talk about an update of where you are.We keep working with the FDA on different approval processes. So we recently got the breast cancer approval. So that’s the most recent one, and it was important for us to bring that back because a lot of people — like I mentioned — don’t know that they have Ashkenazi Jewish ancestry. So, making sure that if you find out, for instance, that you might be a carrier for one of these genetic variants, but you didn’t know that you had Ashkenazi background, you could potentially develop breast cancer early in your 40s. So again, it’s been really important for me to bring that back.These are things you had initially on 23 ... I have the original one. Yeah. We did the original one.Yeah, you did.I had lots of the information and I kept it. I actually printed it all out. So I had it, and then it was removed from ...Well, you still get the PDF.Right, right, right, exactly. So but you’ve added breast cancer, and then?We have breast cancer. We added the ones like Parkinson’s Disease, Alzheimer’s — the genetic health risks, we call them. And the first approval we got was carrier status in things like cystic fibrosis. And the one that we’re still, that we talk about, that used to be in the old product but we don’t have back yet, is drug testing. So pharmacogenetics. So whether or not you are likely to respond to a medication. Whether you’re going to be a fast metabolizer or a slow metabolizer. Should you take more of a drug medication or less of that? So that’s one of the ones that we’re still, that we used to have, that we often talk about that we would like to come back.Now, Silicon Valley has often been at odds with the FDA. How do you look at the FDA now? How do you look at their processes? Who is ... The running of the FDA. How has it been under the Trump administration?So Scott Gottlieb is the commissioner.He’s not like a real estate agent, right?He’s not. Okay, all right. No, the deputy CTO of America was a real estate agent, but go ahead.Scott’s actually ...I’m not kidding.I have a lot of respect for Scott. Scott’s spent a lot of time in Silicon Valley, so he actually understands, he was a partner for a while at a VC fund. He was in past administrations in the FDA, so I think he actually really knows what he’s doing. And I think he really wants to do the right thing. And I think that sometimes it’s hard. I admire just running a 600-person company. I admire him because trying to shift such a large organization is hard. So, I think he’s making progress in important areas.In what ... What’s progress from your point of view?Well for us, we’re kind of in a ... it’s interesting to note that of all the sort of more direct-to-consumer companies out there, we’re the only ones who’ve gone through the FDA process. So it is a, again, we’re really proud of pioneering a direct-to-consumer path, and we’re really proud of actually, we’re the only ones out there that don’t require a physician’s oversight or a prescription. That said, it’s a hard path. And there’s a reason why there’s not ... no one else is necessarily following it, is actually a hard path. So I would stay it’s still, I think there’s pros and cons of being regulated. It’s definitely, it’s taken a lot of time, and it takes a lot of money. That said, the one thing I’ve learned over the last 12 years is — and I tell this thing to employees all the time — is that we mess with people’s lives. You tell someone that they’re a carrier for BRCA; or you tell someone, “You’re a high risk for blood clots.” Or you tell someone that you’re one-64th Native American. And it has real consequences on their life. And so we’re messing with people’s identity. And it’s really important that we take that seriously. So I understand the need for regulation, and I think the thing that’s been frustrating, there’s a lot of groups out there that there’s ways to sort of circumvent it. And I think that that’s where I worry more. And again, I bring up things like Goop health and others, there’s all kinds of ways to propagate not the most ideal data.Some of them got slapped back. Goop got slapped back. I know there was a lot of ...Goop did. But think in genetic testing, there’s still a fair number of groups out there that can interpret DNA, and it causes me anxiety that people will get wrong interpretations.Right. So when you look at what you want from this FDA, what do you want? What do you want to have happen?Specifically-‘Cause Silicon Valley has always been pressing on the FDA in kind of a juvenile way-I think it’s ... I’m impressed. Like Apple got their Watch approved pretty quickly. I’m impressed always with AliveCor. That’s when it tells you that it does EKGs. My father’s used that device. We’d be on the beach and he’d be like, “Oh wow. I’m in atrial fib.”This is heart, correct, this is cardial? Yeah. It tells you whether you’re in atrial fib. So I think that it’s one of those things. I think that Silicon Valley in some ways has a responsibility to be aggressive, and to go forward to the FDA. I worry there’s a lot of companies that I meet with, and people come and get advice all the time; and I worry often that people are doing what they can to circumvent the FDA, and I think that that actually worries me because one of the things that you do need to do, is with regulators, you have to keep them informed about what is happening. ‘Cause that’s how they get educated. And we saw the consequences with Theranos for something that’s not regulated. That again, you mess with, you can really impact people’s lives. So there’s, again, I have a lot of respect for the FDA because I think that they see a lot of the bad.Well that case appears to be outright fraud.In Theranos?Yeah.Yeah. But it was one of those things. They’re not technically regulated by the FDA. They’re technically regulated by who?They’re regulated by Center for Medicare Services, by CMS, under CLIA. So there’s, it’s a softer regulatory path. So in that capacity they were able to actually get onto the market without the same kind of oversight.So how much did Theranos set back companies like yours? There’s been a lot. There’s been AliveCor, there’s Color, there’s, these are the consumer-facing ones.I think because the Theranos case was so extreme that I don’t think it’s necessarily had a negative consequence. I think that people are more aware. In some ways it’s been helpful; that people are more aware of scientific fraud. Scientists always say, “Just because something’s published in Nature or something’s in Science doesn’t mean it’s true.” But my mom would say, “Oh of course it’s true. It was published in that.” So I think it’s been a helpful example for people to realize in some ways that not everything that’s out there is actually real. And there’s a number of companies that don’t necessarily go through a real regulatory or a real data science process, and I think that’s actually been a helpful eye-opener for customers in some ways. So talk about the consumer-facing business because it’s a struggle. You’re trying to sell tests, but ultimately, you have to have something else to keep people there.Well the consumer business, we’ve really, the last couple years, especially after we got our first FDA approval or authorizations, the market is there. People are definitely interested in their genetics. They’re interested in the sense of identity. And a lot of it is that the ancestry market really exploded first. And in part because there’s more competition on the ancestry market. But people really are interested in a sense of identity. And I think that that’s where there’s a big gap that’s out there, where people would like to feel connected in a different way. And there’s interesting conversations about what’s actually the definition of family? Is it necessarily the people you’ve grown up with, or is it the people that you are genetically related to? What is that definition of family? So that’s at that health side, is where I think there’s, in many ways, the most potential. People are hungry for ways and information about how to live healthier. And in some ways, people still are figuring out what to do with information and actually, frankly, how to be in charge of themselves. Most people don’t really take ownership of their health. They go to the physician periodically, they kind of watch what they eat, their exercise, I think a lot is changing with the watches that’s coming out. But that’s part of what we’re hoping, to inspire people more and more. It’s like, “You are that center of your health, and the more you take charge of yourself, the healthier you can be.” So I think that that’s ... you will see us have a much bigger focus on health in the coming months.Health, that you’re giving them, and ...Just about, well yeah, in terms of what you can actually do to help prevent ... you know, if you’re at higher risk for blood clots, what is it that you could do? If you have African ancestry, are you potentially at higher risk for sickle cell? So things like that, like giving people ... and then helping people know what are some of the actions that you could take next.But you don’t have a physician ... a lot of these others you talk about do have physician elements, like Color does, there’s another one ... they come into my office periodically, have different parts of that. They’re often physician-oriented.Well, they’re physician-ordered, but they don’t necessarily have a physician interface. Mm-hmm. Many of them do recently, I’ve noticed, a lot of them do, where it goes to the physician and ...It goes to the physician, right.Right.And that’s because it’s under Medicare, it’s required to.Right, I see. But where does ... what I’m talking about is where the business goes next, is that you give them health advice that you ... I’m trying to grok where your business ...I think that having more and more of a robust health product in terms of like, again, getting the drug reports coming back. So I think that we look at when we can get pharmacogenetics back, it’s kind of like the complete product is back. And then it’s about helping people have the utility, of what do you do next with that? One of the things that we had before the FDA were some of these journeys of, you know, like you’re going into surgery, what are some of the questions for you to think about? And helping people synthesize some of that information. So I think that’s more and more the direction, is that people want to put all those pieces together, and then put that together in the story. And so, again, the world is exploding with the watches and your phones, and the information that you can pull about helping people say, “This is what your genetic risk factors are, this is the information that you’ve given us about how you’re living your life. This is actually how much you’re walking every day, how much you’re sleeping.” Can we actually then have predictions for you? So I think pulling together more and more of that data, and giving you better predictions, or coaching.Let’s get the privacy ... we’re going to get questions from ... we have a whole bunch, I see them popping here. The topic of ... let’s get to privacy first, then I want to answer the question of what the topic of this, the evolution. Sort of, you’ve had an up-and-down trajectory, essentially. But one of the issues around you all is privacy in what you do. You signed a lot more deals to give information. Now ...Well, we never give out your individual level ...I get that. But I think people are on a, like a ... you’re familiar with the Google people?Yeah, heard of them, yeah.Yeah, exactly. There’s been a hack there, at Google Plus, which nobody uses, fine. Except for Sergey.Except for Sergey ... does he still?Sometimes.You know he does, you’re right. I always thought of Google Plus as a social media service for antisocial people. It’s true, right? You see what I’m saying. You got it.We are going ...You got it completely. You have the Google hack, you have the Facebook hack, you’ve got the privacy issues, you’ve got a privacy bill in California around things like this. You have enormous amounts of important information. And as people input more or use your health things ... can you talk about that? Because, honestly, I think that this techlash against technology is well deserved. Tell exactly what you’re doing and how you’re thinking about it.I think what’s interesting, because we’re doing technically human subjects research, we have an institutional review board, we have an IRB, that oversees the research.Which is important.Which is actually really different. Like, Google doesn’t have an IRB. Facebook doesn’t have an IRB. There’s no outside group necessarily overseeing how you’re using the data you collected.Not yet.Not yet, not yet. But in some ways that was a helpful process for us in those early days of like, really ... the first year that we spent setting up the company, we spent a long time, not necessarily just developing the product but just thinking through specifically privacy and consent, and how are we going to do this in a way that can scale online, that protects, that actually creates more of a balance ...To be anticipating the consequences.Yeah. Like things like the Golden State Killer. It was actually something that we thought of. We specifically said, one, we don’t allow people to take other samples and upload them into 23andMe and compare it against all the data set. And we don’t do that, because in part, we thought about that in the early days. Like that other ...Hey, one day people might take random DNA samples and upload them there. So I’m actually really ...Another company did, though.Well, it’s actually a public dataset, it’s Jedcom. And it’s not necessarily against their terms of service, they ... if you want to do that. And I think that’s part of ... The most important for me is just making sure people are aware. One of my favorite quotes from the Henrietta Lacks movie was that she said, “I would have been happy to consent for research. I just want to know that I was consenting.” And I think that’s a big part, is that people don’t necessarily want their data not to be used, they just want the dignity of knowing that it is being used and how is it being used. So we ask our customers, “Do you want to consent over research?” Over 80 percent of our customers do. At any time, if you decide you no longer want to be part of research, you can opt out, you can say, “I no longer, I’m withdrawing my consent.” If I send you a survey on Crohn’s disease, and you say, “That’s not interesting to me,” [if] you don’t take it, then I can’t use your data on that. If I send you a survey on migraines and you use it, well then we’re using it. But we keep you reminded at the top. So for me, it’s always been about not giving people that opportunity, but just making it really clear that that’s what you’re doing. I think that that’s like the main thing. In some ways like GDPR, I feel I tried to do that, like, “FYI, you have these cookies, this is what’s happening.” But that’s really what we’ve tried to do, is make sure people are aware of what we’re doing.And what about the safety of the data? Because that’s the other part. Because, even if you do things just right on consents, that’s only opt-in essentially, that’s a definite opt-in. Even if that’s allowed, and I just recently wrote in the Times about the internet bill of rights, and it’s sort of a grab bag of things. And among those is opt-in. But the other one is, what happens to the data, third parties? And that was what happened, this sort of hurricane Cambridge Analytica, and then it was hurricane Russians and hurricane ...So, we don’t give ... we ask people, most of the BD deals we do, we base on aggregate data, it’s not individual-level data. So for instance, if we were doing a study on, again, on migraines, and we are working with Pfizer, we’re going to give them aggregate data. So we’ll give them the analysis of the results. There are definitely some cases where we re-consent people so that we can give them data back, and we’ve now allowed people the option. There’s some people who just say, “You know what? Use my data for anything you want.” And so there’s people who have another layer of consent and they’re saying, “I’m happy for you to do whatever you want with the data.” So, most of the analysis we do with partners is based on aggregate data.You say most, you just said most, what isn’t?That’s what I’m saying, in this specific example. So for instance, in Parkinson’s Disease, we will consent people for individual-level data, so that data could be shared with Michael J. Fox.Okay, through his ... so that they can use it ...But it’s an additional layer of consent. The majority of our research I’d say is aggregate data, some data, but again, that’s where you’re explicitly consenting again for individual-level data use.And what about the protection of the data within your walls?I mean, that’s where we spend ... again, I often say like banks have a lot, like banks pioneer a lot of data security. Your genetic information is really interesting, but your bank account is much more interesting. There’s a lot that we can learn from that sector. So we do everything we can. It’s been a high priority ... like, we have pretty robust now, security team. We’re building that out even more. But it’s been a really high priority for us since Day One. And I’m grateful to my early engineers, and that we had people who came from PayPal and came from banking, who were really focused on data privacy and security. So we do everything we can to make sure we’re building out the infrastructure. Structurally we also do things like we keep your identifying information in a separate dataset from your genetic information. So those two databases don’t speak, unless by a very few number of people. So we structurally tried to set it up to make sure that we’re doing everything we can to protect your privacy.What’s your nightmare scenario here? Because I think like, I do Clear, right, I did Clear and they’ve got my eyeball, whatever, they’ve got my fingerprints, they’ve got my eyeballs. And I just think, “You know what? They’re going to come get me someday.” They just clearly are ... between my tweets and my genetic information, I’m screwed.You know, I think that the ...I’m going right to that camp in “Handmaid’s Tale,” I’m going right there. You can only watch that first episode, it was awful.I couldn’t watch this season. It’s too real.I think that the privacy issues I find for 23andMe are mostly within a family. And it might be, since you talk about your family, let’s say your brother really did not want to know his genetic ancestry, and then you told him. What you just did. So, did you violate his privacy?I don’t care.And so, that is exactly what most people say. So I think those types of situations come up where ...I’m in jail for that every day of the week.... where you find that people, you get this disconnect in families about whether or not people want to know. And we find this ... One of the most interesting things is, you often find children will come in and say, “Oh we want to do 23andMe,” and then one of the parents doesn’t want to. And they clearly know there’s a reason why. And then the siblings find out, like, “Hey, we’re half siblings.” Right, oh yeah. I saw that John Sayles movie.That happened. So that happens a lot. And we’ve had other privacy ... the other privacy issues we have ...Maybe someone in the audience has a story like that.I’m sure, well, I mean it’s roughly 10 percent of the population, so I’m sure there’s probably, could be a support group in here. We get those, I worry more about those. I think a lot about ... I worry more about the holistic economy. Like, I do spend a lot of time just making sure that we are really on top of privacy. Because to your point, we’re lumped in with Silicon Valley ...You are.... like we’re part of it. And there is a real ... I worry about the backlash that’s potentially coming our way. And it almost feels like a tsunami, like we’re just in that...Well it is getting lumped in, and they’re very differentiated. I mean, there’s a difference between Apple and Google. There’s a difference between Facebook and everybody else. But they get pulled in. I had someone ... you know, you have people from other companies now, who are not affiliated like that going, “Damn Facebook,” I mean, they really are angry because of all the regulation coming this way, it’s because of behavior at Facebook and Google essentially. Right.Right. So what do you do about that?I think that’s where we try to make sure that we stay somewhat differentiated. The one thing I’m really proud of for our customers, is our customers trust us, to an extent. Like it’s, I think we’ve shown to our customers we’re really protective of how we use the information, what we’re trying to do. We’ve proven out for years. We do research for all the right reasons. We publish, we have over 120 publications. We really try to do the right thing. And I think in some ways with the FDA coming after us in 2013 and really sticking to our guns and coming back, I think it’s won over a lot of loyalty from our customers. So I think that the most important thing we can do, like I’m really protective of our customer and the brand. And I emphasize to people every day, like, our customers, you the individual, it’s not pharma, it’s not others, like it’s you ...Yeah, that’s a business.It’s a business, but ultimately ...How big a business is that part? Selling other people’s data?But we never sell people’s data.All right, okay. All right, listen, Mark Zuckerberg ...Hey. But we don’t sell people’s data, it’s a lot about ...That’s a Mark Zuckerberg answer, I’m sorry. “We never sell data.” I’m like, “No, you just mash it up and sell the insights back to people.” It’s the same thing.Well, okay. I mean, yeah, we, but it’s always under the ... it’s a research partnership.But it’s a revenue stream for you, right?It’s a revenue stream for us. But it’s also about ... like one thing I have found is that our customers who have an illness really want to participate. So for instance, we’re doing a lot more clinical trial recruiting. In part because it’s a need for the pharma companies, but it’s also a real need for customers, customers who have a disease. Somebody wrote me yesterday saying, “I have early onset Alzheimer’s and there’s nothing for me to do.” I was like, “There are things for you to do.” So matching people up is a real service there. We do a lot of research programs with academics and with pharma companies. But more and more what we found is that business line, in some ways, it’s definitely a business for us, but it’s slow, and it’s not huge. So that’s part of the reason why we invest in it and we’re doing our own drug discovery. So we have 13 drugs on our own that we’ve ... you know, we hired Richard Scheller, who came from Genentech, and we’re pursuing that, in part, because we feel like that’s ... again, our mission is about people being able to access, understand and benefit from the human genome. When you think about, “How are you really going to benefit?” It’s that, “I’m going to succeed at keeping you healthy at 100. And I’m either going to keep you healthy at 100 by helping you really know what to do,” so like I said, the consumer product, the action plan, like, “What can I do to help you be healthier?” Or if you do have a disease, can we actually develop a therapy that really helps you benefit and that really could cure you?Right. I’m going to get questions from the audience. But what do you think of all these... I recently had a meeting with a ton of Silicon Valley people on this anti-aging thing, and I’m not talking about only lotions. Oh.When you say, “oh” … Oh, that person. Well, you know but, there’s a couple ... you know that there’s VCs involved, there’s all kinds of things. And it has to do with longevity. It’s not anti-death, I think that’s sort of a miss ... it’s like not ... it’s dying at 500, or not being sick when you’re 100 and being very healthy at 100, kind of thing. How do you look at that? I mean, that’s sort of in your ...I think it is. I mean, I look at being healthy at 100. I feel like we have a long ways to go even to aspire for that. You know, and in some ways, like they’re some of the most basic aspects, as you know, understanding diabetes, obesity and smoking. You know, those three really just have such a massive impact on health on most people here. I’m inspired by genetics, because I think one thing that genetics really can do is help eliminate a lot of early premature deaths. So, BRCA being a good example. You know, people who are high-risk, who potentially die of ovarian or breast cancer ... You could potentially prevent that.Yeah.There’s people with sudden cardiac death. You could potentially really help them know they have that, and then help prevent that. But what do you ... Look at these. Don’t wanna die? Don’t wanna die soon?I haven’t ... You know, we don’t spend a huge amount of time on these individuals. I mean, I think that there’s, without a ... I think Silicon Valley has some of the reputation for the, you know, “We want to live forever” mentality and helping think that through. I think understanding aging ... Like those mouse studies. You take the young blood and you put it in the old blood? Yeah.I mean, it’s kind of fascinating. I look at my children in a whole new way. My son was so upset when I told him about that. I was like, “I want your blood.”I have no idea why. Oh, man. You’re ...So, I think there’s some ... Aging itself? Scientifically, it’s a really interesting question. We don’t fully understand aging, so I’m a huge fan of understanding that. I know Calico is doing a lot with that. So trying to understand it, I think, is really interesting. But I think that the other pursuits, which I’m not as familiar with, in terms of like, “Yes, let’s try to live to 500,” I think there’s a lot of ... Again, it’s a little bit more out there to me.Right, and that’s the thing you’re gonna be ...I just, I’m waiting to see some of the data. Like, who can make me healthy at 100, first? Let’s aspire for that.Right. Well, let’s ask some questions here.Okay.“Can you discuss the monetization of data at 23andMe,” which we just did, “and the partnership with GSK?”Mm-hmm.Can you?Yeah. GSK… So, like I mentioned before, we’re doing these partnerships with pharma partners, and we found that there’s a real hesitancy. A lot of pharma partners just didn’t really buy in to what exactly can you do with genetics? Is that really gonna help with drug discovery? So, we hired Richard Scheller, who came from Genentech. We built up our own drug discovery team. It’s great, it’s been really successful. It’s been surprising how many discoveries we’ve been able to take from concept into development. We now have 13 programs that are in the research stage that we’re making molecules, and in some ways we are almost sinking from our own success. Where, each molecule is expensive. And it’s not like we just focus on multiple sclerosis or Crohn’s. We have a wide variety of diseases that we’re focusing on. As we planned how we’re gonna scale, it became really clear that we need the expertise and the ability to scale that a large pharmaceutical company is going to have.Right.Frankly, we need medical teams across a wide variety of diseases. So, the partnership with GSK, I think, is really ... Or the collaboration, to say ... Is super-exciting, because we can do what we do best, and they can do what they do best, and they’re really gung-ho about genetics and the potential there. Hal Barron, who runs the research team at GSK, used to work with Richard Scheller at Genentech, so we kind of brought the band back together. So there’s a lot of synergy there, and I think there’s a lot of ways for us to be able to accelerate and prove out how people are gonna benefit from the human genome. All right. Next is, “You talked about cold cases, GEDmatch solving cold cases. Can you speak about that?” Which you did. Which you’re not participating ...Yeah, we’re not part of it. I mean, I think it’s a really interesting issue — and I think one thing, just to highlight for people, I think a lot of people don’t realize this — is that your medical samples could be subpoenaed, also, for criminal cases. There was a story out there about a woman whose pap smear was subpoenaed and actually used to solve a crime. So, again, I look at ... I’m a huge fan of transparency. Again, people want to consent, and they want to be part of research for all kinds of reasons. But when I go in to the doctor and I have any kind of procedure, I’m assuming it’s just for that procedure. And I find that there’s a whole new world that I’m really focused on. You know, we have GDPR in technology now, or in the internet. Where’s that equivalent in healthcare? Right.And why is it ... Again, you look at Henrietta Lacks and others. Why is it that my healthcare information is circulating all over and I have no access to it?Right. So, the right to be forgotten, really.Right. There’s definitely no right to be forgotten in healthcare. No, not at all. All right. “Who provides your ethical North Star? The board, you, a chief ethicist? Will she or the consumer demand or determine where we draw the line?” Have you thought about having one? I know some companies, tech companies — I’m gonna be writing about it — are hiring for that role. For a chief ethicist?Mm-hmm.You know, what’s interesting ... We tried. We had this issue where, in the early days, we interviewed ethicists all over the place and we actually had offers out. And then, every ethicist would engage with us and then they would say, “Oh, no. We’ll never speak to you again.” And I was like, “Why?” And they’re like, “This is so exciting. This is a career-making opportunity. We can only talk about you from our ivory tower.” So, we actually couldn’t get an ethicist to join because people found it was such an interesting hot topic.And so, frankly, what I have found is that an opinion of one is not as helpful as us just actively engaging all the time. So, there’s something ... Again, in healthcare, there’s the ethical/legal/social, ELSI group. Joanna Mountain, who is one of the first scientists we hired, was actively involved with the whole ELSI community, and we do a lot. We got the feedback in the early days. Thankful to 23andMe, we generated tons of funding for this community, because there’s suddenly so much interest and discussion in this topic. So, we spend a lot of time thinking about that. I would say now ... There’s me. I have a strong, without a doubt ... I have the mission and I drive for the company, of like, what is our North Star? But I’m really lucky ...Who does that for you?Who does that for me?Yeah.You know, I think ... I think that’s kind of your soul, like how you’re brought up. To me, it’s my family keeps me very grounded. Others. Also, in some ways, being in Silicon Valley, I see for sure what I don’t want to be, and then I’m also reminded of what I do want to be. I think one of the best things to do, especially in this day and age of Silicon Valley, is sometimes ... Like when I worked on Wall Street, I used to volunteer at San Francisco General, and I would just clean gurneys, and I was like a patient advocate. I did it from 11 pm to 6 am. In some ways, having that humility again and keeping staying normal was really helpful, of remembering, like, why are you doing the things that you’re doing, and what is the reality here? So for me ...Man, they’re gonna have to clean a lot of gurneys, these people.Yeah. Oh, no. I mean, the problem is definitely ... But I think it’s keeping ... You know. Part of keeping yourself real in the world of ... Like, I love interacting with our customers because it helps me stay grounded with the mission of the company, and really what is our impact? And it keeps changing over time. “Do you expect 23andMe will ever become a covered benefit, or will it remain self-pay?”Self-pay. I think people don’t realize that when insurance companies pay for your information, they own it, and I think it’s a really important ... Again, I go through this GDPR. Of, like, where is the GDPR of healthcare? You know. I really question where ... If you want to have privacy? Your insurance company, they pay. They have all kinds of rights to the information. And so, I’m a huge fan ... All kinds of countries outside the United States, there’s just a self-pay option. Healthcare, in my mind, should be affordable. It should be accessible. And I’m a big supporter ... 23andMe, we would be a very different product and we would be a very different company and price point if we were taking reimbursement.Right. Okay. “What’s the one lesson you’ve learned since the company’s founding that you wish you knew at the very beginning?” That’s a very nice open-ended question.I think the thing that we missed early on is just how long it takes to educate people about something totally new. I think that we were overly optimistic about the state of scientific literacy in this country. So, the early days, it was really a slog about how are you gonna educate people about genetics and what exactly does it mean and why would you even be interested? You know, we got that question all the time. Like, “Why do I even care?” And as a group of scientists, it was sort of seen as, it was so obvious. Like, “Of course.” Like, “Don’t you want to look in the mirror? Why would you not want your genetic information?”So, I think that that was one aspect that we missed early on, was just how hard it is going to be to educate people about why they should want their genetic information. All right. Last two, I’m gonna do together. “So many male founders in Silicon Valley, and VCs admit preferentially funding them. How do you see your role as a female founder, to raise the tide for female founders?” And then, “How does 23andMe ensure a diverse population is represented in its data sets shared with pharma, as new drug therapies are developed for all populations?”I’ll take the last one. You have to take both. We spend a lot of time really making sure ... One of the most interesting issues in healthcare is that it is very much biased toward a European population. And 23andMe, even ... You know. We’ll be 75 percent European. Even at that percentage of 25 percent diversity, it’s the largest data sets that are out there in these different populations. So, we do have a number of initiatives going on right now to make sure that we can actually improve the product for different communities, and then make sure that we’re actually selling and that we are giving it away to specific communities as needed.Diversity in research, I think, is one aspect. It’s really poorly understood how much it could benefit everybody, and I think that’s where ... When you think about personalized medicine, I don’t necessarily think about ... You know, people talk a lot about specific drugs. I think about, “What is the right blood pressure for you, based on your ancestry, based on everything?” Some of these measurements are just really not well-defined, and I think that’s where we could actually do a lot.Right. They’re well-defined for one group of people.For one group of people. And I think that’s where there’s a lot that we could do, but I think about that. Really understanding the diversity.And then, the female founders?Oh, female. I’m not doing ...You’re a female.I am female. I think it’s important to support. I mean, as more and more ... I have a hard ... I spend a lot of time with my sisters and so I’m kind of surrounded by women all the time. There’s my moments where I’m like, “I really should hang out with more men.” So in some ways, I’ve had that privilege, and I also see how great it is to work in gender-balanced environments. I should do more investing that does really try to encourage women, and when I get those requests, it’s always quite appealing to me. I haven’t spent a lot of time doing my own investing right now, because I think it’s just ... It’s a whole other set of projects. But I think it’s really important to do that. And I see just in running the company, for my teams where there’s less diversity ...I think you’re one of the only woman CEOs in the Valley. One of the few. I’m trying to think.I’m one of the few.There’s maybe four. Another one is your sister.Yeah. I know. That’s why we hang out.Right, right. We can’t go by the Wojcicki sisters, the Wojcickis. But really, you and your sister ... Who else is a CEO?We had Marissa.Yeah, but she’s not anymore, so ...I know.Katrina Lake. Yup.There’s not a lot. And it’s really too bad, because I think the diversity makes such a positive difference. It’s so much better when you have a diverse group of people. We had a time period where we had a management team that was entirely women, and we were like, “We need to hire a man.” We’re very unusual in that way. But it’s in part, diversity really benefits. You see all the biases. I think it’s an issue. So if there’s things that I can do, I should definitely do more of it. I just, it’s been a lot.You’re busy. Last question from me. You’re gonna go public or sell or what?I think that being public ... I don’t think there’s any glory in being public. I actually think being public is almost the last-resort option, because you lose all your privacy. You lose so much when you have to be a public company, and then you’re also coming as a public analyst. Like, you have all these people just paid to spy on you, and trying to get ahold of your employees and do all kinds of things. So, there’s no glory. I think that what people always want is, they want liquidity. And there’s all kinds of fabulous new ways these days of actually having liquidity. And I think if we ever do go public, it’s gonna be when we’re a much more mature, stable company.Okay. And sale?Say again, sell? I don’t think ... You know, we don’t fit with anyone. And we’re also in some ways such a rebellious brand that we should stay independent. We need that freedom. So we’re not, we’re definitely not ... No. We’re not selling.All right, then. Thank you, Anne Wojcicki.Thanks so much. Thank you. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}