{"id": "Elon Musk says he ‘probably’ wouldn’t take money from the Saudis now", "paragraph": "Elon Musk unintentionally avoided a real crisis of happenstance this fall.Just a few weeks after Musk shelved an ambitious plan to take Tesla private — financed, in his mind, by the government of Saudi Arabia — that government invited the scorn of the business community as it slowly admitted that a Saudi critic, journalist Jamal Khashoggi, had been brutally murdered. Musk got lucky — he would have been at the center of that human-rights drama.So, knowing what he knows now, would he take Saudi money now?“I think we probably would not,” Musk told Kara Swisher on a new episode of Recode Decode. “That sounds pretty bad. So that is not good,” he said, haltingly, of Khashoggi’s death. “That is bad. That is really bad.”You can listen to the entire conversation right now in the audio player below. If you prefer to listen on your phone, Recode Decode is available wherever you listen to podcasts — including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Those were Musk’s first public comments on the topic since the news of Khashoggi’s killing emerged. The Saudis reportedly have a $2 billion position in Tesla as a public company, but it has not gone unnoticed that Musk got really fortunate. Some companies that have been in talks with the Saudis about taking on a new investment decided to cut off discussions as the truth came to light.But a few moments after saying he’d be disinclined to take Saudi cash, Musk urged people to recognize that not all Saudi cash is the same.“You don’t want to — if there’s one really bad thing that occurred — nail down the whole country,” Musk said. “We should just consider that there is a whole country ... and there are a lot of good people in Saudi Arabia.”Musk was initially talking with the Saudi Arabian government’s sovereign wealth fund, the Public Investment Fund, about the plan to take the carmaker private. After a chaotic few weeks, though, Musk said he no longer thought the take-private plan was wise — for reasons that had nothing to do with the ethics of the Saudi government.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}