{"id": "Recode Daily: Tim Cook wants a GDPR for the rest of the world", "paragraph": "This flu season, Clorox is using data from smart thermometers to target ads to areas where people are sick. And in another example of internet-connected devices being used for advertising, Amazon was recently granted a patent for its Echo devices, enabling them to recommend chicken soup or cough drops to people if the device detects symptoms like coughing and sniffling. Clorox paid to license information from Kinsa, a San Francisco-based startup that sells internet-connected thermometers that sync up with a smartphone app that allows consumers to track their fevers and symptoms. The data showed Clorox which ZIP codes around the country had increases in fevers; the company then directed more ads to those areas, assuming that households there may be in the market for products like its disinfecting wipes. [Sapna Maheshwari / The New York Times][Want to get the Recode Daily in your inbox? Subscribe here.]  Tim Cook wants a GDPR for the rest of the world: At a data protection and privacy conference in Brussels, Apple’s CEO spoke out about digital user data being weaponized “with military efficiency.” He celebrated Europe’s GDPR data privacy regulatons, saying, “It is time for the rest of the world, including my home country, to follow your lead.” Cook has made user privacy one of his — and Apple’s — biggest talking points over the past few years, especially as Facebook has grown in stature and Google has remained dominant. “We shouldn’t sugarcoat the consequences,” Cook said. “This is surveillance.” [Natasha Lomas / TechCrunch]Apple is planning to launch its upcoming TV subscription service in more than 100 countries, which would quickly make Apple a competitor with both Amazon and Netflix. The app, which will be available globally in the first half of next year, will include Apple’s original programs free to Apple device owners and also will enable users to sign up for TV network subscriptions owned by other companies. Meanwhile, plugged-in Apple analyst Ming-Chi Kuo predicts that Apple will debut an updated iPad mini, upgraded AirPods and its delayed AirPower wireless charging platform at next Tuesday’s product event. [Jessica Toonkel / The Information]As Google’s Android operating system marks its 10th anniversary, the Verge updates its detailed visual history of the world’s most dominant OS, from Android’s debut on the T-Mobile G1 through its sweets-themed upgrades — Cupcake, Donut, Éclair, Froyo, Gingerbread, Honeycomb, Ice Cream Sandwich, Jelly Bean, KitKat, Lollipop, Marshmallow, Nougat and Oreo and the latest version, Pie. [The Verge] U.S. Cyber Command is targeting individual Russian operatives in an attempt to deter them from spreading misinformation designed to impact the November midterm elections. The new campaign, the first known overseas cyberoperation designed to protect U.S. elections, comes after the Justice Department outlined a strategy of “information warfare” orchestrated by Russian operatives to influence the midterms. [Julian E. Barnes / The New York Times]At least 200 prominent men lost their jobs after public allegations of sexual harassment in the year following the Harvey Weinstein expose and the #MeToo movement. And according to a New York Times analysis, nearly half of the men who have been replaced were succeeded by women. Sexual harassment has hardly been erased in the workplace and new workplace have little effect without deeper cultural change, but the analysis shows that the #MeToo movement shook, and is still shaking, power structures in society’s most visible sectors. [Audrey Carlsen, Maya Salam, Claire Cain Miller, Denise Lu, Ash Ngu, Jugal K. Patel and Zach Wichter / The New York Times]A full-sized replica of the Titanic is set to make its maiden voyage in 2022, carrying 2,435 passengers and 900 crew members — with more than enough room for all of them in fully enclosed, motorized lifeboats. It will follow the same route as the original, crossing the North Atlantic between England and New York, and cruise ship company Blue Star Line said the vessel “will have the same class categories as the original Titanic. These being First Class, Second Class, and Third Class.” Not everyone thinks this is a great idea. [David Britton / The Daily Dot]Facebook’s top political ad spender is … Facebook. But Facebook’s ads are mostly about how it’s trying to avoid election manipulation. Again. [Kurt Wagner and Rani Molla]We have to rewrite antitrust law to deal with tech monopolies, says “Positive Populism” author Steve Hilton. All the old assumptions about what makes a monopoly no longer apply, Hilton says on Recode Decode. [Kara Swisher]Topical, last-minute Halloween costumes that you can buy on Amazon.And the 10 best dog costumes on Amazon.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}