{"id": "Tech employees are much more liberal than their employers — at least as far as the candidates they support", "paragraph": "Tech employees tend to be predominantly liberal when it comes to politics; their corporate employers are much more middle-of-the-road. Those are among the findings from an examination of political contributions during this election cycle, using data from Open Secrets, a nonprofit political spending database by the Center for Responsive Politics. We’ve analyzed these numbers as a way to gauge the tech industry’s politics in a midterm election that is slated to be the most expensive ever. Total spending is expected to reach $5.2 billion, and tech donations have grown accordingly.So we looked at nearly 20 tech companies to see how their employees donated versus how their companies’ political action committees, otherwise known as PACs, donated to individual Democratic and Republican candidates.Google’s employees donated the most so far — $3.7 million — to individual Democratic and Republican midterm campaigns. It was followed by Microsoft ($1.5 million), Apple ($1.2 million), Facebook ($1.1 million ) and Amazon ($971,000). (Our data doesn’t include donations to Independent candidates nor to party groups.)The vast majority of those donations went to Democrats. The most extreme examples were Netflix ($321,000) and Twitter ($228,000), which had about 99 percent of employee donations go to Dems.  Tech companies themselves are formidable election donors through their PACs. Tech companies that have PACs, however, tend to give a more equal share of donations to Republicans and Democrats.Amazon’s PAC donated the most of the bunch, giving more than a million dollars to individual Democratic and Republican candidates during this midterm cycle so far. It gave 52 percent of that to Republicans and 48 percent to Democrats.PayPal’s PAC gave more heavily to conservatives than the other tech companies, donating 62 percent of its $82,000 to Republican candidates. Tesla’s PAC gave 80 percent to Democratic candidates, though it should be noted that its overall contribution was just $16,000 — far less than most of the other tech PACs, besides Twitter’s. Hewlett Packard Enterprise’s PAC, which gave $234,000 to candidates, donated about 60 percent to Democrats.As a whole, more than half of PAC donations to candidates by tech companies went to Republicans this election cycle. Compare that with the more than 85 percent of donations by internet company employees going to Democrats.Why the difference?A company’s PAC donations have less to do with supporting a specific party than with accessing those in power. Corporate PACs donate the vast majority — 90 percent in the last midterm — of their money to incumbent candidates, who are much more likely to be elected than challengers. Tech companies are no different.“When they give money, [corporate PACs] are looking to preserve access in case they need a future meeting with somebody; they’re not looking to influence the outcome of an election,” said Michael Malbin, director of the Campaign Finance Institute and a professor of political science at the University at Albany. “Corporate PACs are the least adventurous of all political action committees and the least adventurous of all political donors.” Employees are a different story, as they are much more likely to give to candidates in their party of choice. Tech employees, who skew younger and more educated than people in other industries, are more likely to identify as Democrats and to donate as such. They are also a better gauge of their industry’s politics than their company PACs.Individuals can donate up to $2,700 per candidate’s political campaign, while PACs can donate up to $5,000. Additionally individuals and PACs can donate to political party committees and to other PACs, but we’ve only looked at contributions directly to individual candidates here. The CRP data comes from Federal Election Commission releases from Jan. 2017 through Oct. 26, 2018, and only includes donations of more than $200 to primary, general election and special election campaigns (which are considered separate campaigns as far as donation limits). This data does not include spending on super PACs, which in unlimited.When possible, CRP includes donations by employees’ dependents. So, for example, donations made by a non-wage-earning child of an Amazon employee would be included in Amazon’s total. The percentage of donations that have gone to each party, however, is consistent with that derived from a similar data pull from data analysis company, Enigma, which focused solely on employees.To see more granular data, check out Enigma Public’s FEC Data, which includes searchable federal campaign contributions for 2018 as well as PAC summaries for 2018. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}