{"id": "There are problems with Snapchat’s plan to jump-start growth", "paragraph": "Snap is dealing with a user-growth crisis. Just a year and half into life as a publicly traded company, Snapchat has stopped growing. In fact, it’s shrinking. The app lost two million daily users last quarter, and that was after a loss of three million daily users the quarter before. Snap executives said that Snapchat’s user base, which stands at 186 million daily users, will shrink again in Q4. As an advertising company that makes money by showing ads to as many people as possible, losing users is a terrible sign for Snap’s business. The good news is that Snap CEO Evan Spiegel has a rather obvious plan to jump-start user growth. He wants to do a better job marketing and promoting the app to older people — those 35 and above — in the U.S. and Europe where Snapchat is already popular with young people. He also wants to improve Snapchat’s Android app so it will work better for people in emerging markets, especially those with connectivity constraints. There is some bad news, though: Both of those plans have some rather obvious flaws. Historically, Snapchat has leaned into its role as an app for young people. Snapchat is natively mobile, and somewhat difficult to use, characteristics that made it perfect for millennials who grew up with smartphones glued to their fingertips. The mission statement on its IPO paperwork said Snapchat would help people “have fun together,” something you can see with its reality-TV shows inside Discover, and the goofy face filters and dancing hotdogs the app has become known for. Will Snapchat lose that affinity with young people if older users join the app?That has been a widely accepted theory with Facebook for years: That as Facebook’s user base has gotten older, younger people have started to abandon the service. In 2017, Facebook lost an estimated 2.8 million users under 25 in the U.S. alone. It’s tough to say with definitively if that’s why young people are leaving Facebook. Maybe it’s because there are other, better apps out there for teens — including Snapchat! But there should be some concern that, as Snapchat works to appeal to an older audience, its core audience of young people might be turned away in the process. Snapchat’s plan to expand into more emerging markets will also be tough. Internet users in a lot of emerging markets fall into Snapchat’s core demographic. In India, for example, it’s estimated that more than 70 percent of the country’s nearly 500 million mobile internet users in both rural and urban areas are 34 or younger. That’s a lot of potential Snapchatters. But Spiegel has started to double down on his belief that Snapchat is first and foremost a communications app. On Thursday’s earnings call, Spiegel called fast-messaging Snapchat’s “core product value,” something Snap needs to convey in emerging markets to try and grow its user base. The problem is that in virtually all global markets, developed or otherwise, have fast-messaging apps already. Snapchat is late to the game. WhatsApp has more than 200 million users in India, and a near-100 percent penetration rate with internet users in Brazil. Almost 95 percent of smartphone users in Japan use Line. In developed countries, where Snapchat will try and woo older users, messaging apps are also established. Facebook Messenger has more than 1.4 billion users globally, and an estimated 126 million users in the U.S., nearly 40 percent of all U.S. citizens. There’s also Apple’s iMessage and regular SMS texting. All the fun, goofy stuff that makes Snapchat a fit for young people — and theoretically serves as a differentiator in markets where there are already incumbent messaging services — is being copied by competitors. That stuff also doesn’t work as well in areas with poor internet connectivity. Spiegel and Snap are trying to work around these technical challenges with a new version of its Android app, code-named “Mushroom,” but it’s tough to foresee wide adoption if Snapchat’s “core product value” is already solved by something else. This doesn’t mean Snapchat won’t start growing again. If 200 million people use WhatsApp in India, that means there are hundreds of millions of internet users who don’t use WhatsApp India. And just because people use one messaging app doesn’t mean they wont use two or three or four.But while Snapchat’s growth plan is simple, executing it will not be. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}