{"id": "Recode Daily: Who will Facebook fire after a damning New York Times investigation?", "paragraph": "Mark Zuckerberg, Sheryl Sandberg and other top Facebook leaders should get ready for increased scrutiny after a damning new investigation shed light on how they stalled, stumbled and plotted through a series of crises over the last two years, including Russian meddling, data sharing and hate speech. The question now: Who does Facebook fire in the aftermath of these revelations? Meanwhile, the difficult past year has taken a toll on employee morale: An internal survey shows that only 52 percent of Facebook staff are optimistic about its future, down from 84 percent of employees last year. It might already be time for a new survey. [Sheera Frenkel, Nicholas Confessore, Cecilia Kang, Matthew Rosenberg and Jack Nicas / The New York Times][Want to get the Recode Daily in your inbox? Subscribe here.]  Amazon’s next challenge will be finding all those workers to fill its dual-city HQ2. The campus in the Northern Virginia suburb of Crystal City alone will eventually bring 25,000 jobs —that’s as big as the nearby Pentagon, where about 26,000 people work. Positions at the new campus will include executives and managers, software development engineers, lawyers, accountants and administrators, making an average salary of at least $150,000 a year. The D.C.-area unemployment rate is 3.3 percent, well below the national average — but that likely masks the even lower availability of the types of professionals Amazon will be looking for. Here’s a behind-the-scenes look at how Amazon made its choice, plus some thoughts on the aftermath of the nationwide search, which some saw as a stunt. And here’s a funny review of that Alexa-enabled microwave we’ve all been waiting for. [Lydia DePillis / CNN Business]LinkedIn expects to bring in roughly $2 billion from its media business — mostly via ad revenue — by the end of this fiscal year; that’s roughly half of owner Microsoft’s $4.16 billion in ad revenue. The business and employment network — which generates more than two million posts, videos and articles a day — has been hesitant to reveal specific revenue numbers around its media efforts since it was acquired by Microsoft in 2016, but is doing so now to highlight the growth of its ad business. [Sara Fischer / Axios]Uber reported slowing growth in its third quarter, with revenue rising 38 percent from the year-earlier period to $2.95 billion, compared with a 51 percent revenue increase year-over-year in the second quarter. And the ride-hail company lost $1.07 billion, more than in the second quarter, as it invested in other business areas such as electric scooters, bicycles and freight shipments. As an incentive for riders not to check Lyft or a local competitor, Uber launched a new loyalty program called Uber Rewards in nine U.S. cities. The perks? Rewards like $5 credits, upgrades to nicer cars, access to premium support and flexible cancellations. [Kate Conger / The New York Times]China’s technology-manufacturing dominance threatens U.S. national security, including the security of 5G wireless infrastructure, according to a report by the U.S.-China Economic and Security Review Commission, a panel of security and economic experts convened by U.S. Congress. China’s status as the world’s largest manufacturer of internet-connected devices creates “numerous points of vulnerability” when it comes to issues such as cybersecurity and intelligence collection. The commission cited Chinese telecommunications giants Huawei and ZTE in particular. [Kate O’Keefe / The Wall Street Journal]Who does Facebook fire after a bombshell New York Times investigation? Mark Zuckerberg and Sheryl Sandberg are depicted as misjudging Facebook’s problems at nearly every turn, and perhaps even actively ignoring them. [Kurt Wagner]Watch Marc Benioff try to explain what he’s going to do with Time magazine. “I’m the inspiring visionary!” [Kurt Wagner]Netflix will launch a cheaper subscription with ads, predicts The Trade Desk CEO Jeff Green. Why? It needs to compete with the free-by-default YouTube, he said on the latest episode of Recode Media. [Peter Kafka]Marc Benioff says he had rabbis and imams supporting the Prop C homelessness tax — but not tech CEOs. Business leaders are conditioned with a “Pavlovian” response against tax hikes, said the Salesforce CEO. [Shirin Ghaffary]Why nonprofits should think more like tech companies. “Social Startup Success” author Kathleen Kelly Janus explains on the latest episode of Recode Decode. [Kara Swisher]San Francisco’s wax museum trades Lady Gaga for a touchable, insultable yak-haired Trump.The new hotness.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}