{"id": "Recode Daily: Waymo is launching the world’s first driverless car service next month", "paragraph": "Waymo plans to launch the world’s first driverless car service next month, starting in Phoenix, operating under a new brand name and competing directly with other ride-hail services like Uber and Lyft. The launch of a commercial ride-hailing service will mark an end to the intense secrecy that has surrounded Waymo’s program — and self-driving research in general — since sibling company Google first started working on it a decade ago. Meanwhile, San Francisco-based e-scooter startup Lime is launching a free-floating car-sharing service in Seattle this week, starting with a fleet of 50 vehicles and quickly ramping up to 1,500 cars by early 2019. [Tom Randall / Bloomberg][Want to get the Recode Daily in your inbox? Subscribe here.]  Inside the 14-month journey to Amazon’s HQ2 decision. In the fall of 2017, hundreds of North American municipalities — even those without the requisite tech talent base — held out hope that Amazon would decide to call their region its new home. But by the summer of 2018, Amazon had decided during an internal meeting that it would split its new headquarters between two cities, quietly signaling that talent would be the driving factor for its choice. Among those not chosen, there is some anger, and even sadness: “My heart is broken today,” Dallas Mayor Mike Rawlings said on Tuesday. [Laura Stevens and Shayndi Raice / The Wall Street Journal]Google plans to double its New York City workforce to more than 14,000 employees over the next 10 years, setting up a battle for East Coast talent with tech rival Amazon. Alphabet and Google finance chief Ruth Porat said Google is adding talent at a faster pace outside Silicon Valley than at its Mountain View, Calif., headquarters. Google is nearing a deal to buy or lease a planned 1.3 million-square-foot office building at St. John’s Terminal in New York’s West Village neighborhood; the search giant recently announced new office openings in a former airplane hangar in Playa Vista, Calif., outside of Los Angeles, as well as its first office in Detroit. [Douglas MacMillan / The Wall Street Journal]Amazon not only controls how and when we receive our purchases, it also increasingly shapes what our stuff looks like. Tide’s new Eco-Box container, for instance, looks and works like a box of wine — designed to play nice with e-commerce, it can be shipped without a secondary box or Bubble Wrap, is lighter than plastic bottles, contains less water than regular Tide and takes up less space in giant warehouses and on delivery trucks. Other products that have recently been optimized for Amazonization include Dawn dish soap and Old Spice body wash; Garçon Wines recently created a flat bottle so its packages could fit through standard-sized mail slots in the U.K. [Adam Clark Estes / Gizmodo]Spotify launched in 13 new markets in the Middle East and North Africa, bringing the service to 78 markets in total. The new markets — United Arab Emirates, Saudi Arabia, Kuwait, Oman, Qatar, Bahrain, Algeria, Morocco, Tunisia, Jordan, Lebanon, Palestinian Territories and Egypt — offer a fully Arabic user experience, with local and international music and locally curated playlists; users have both free and subscription models available.[Staff / Variety]Flipkart co-founder and group chief executive Binny Bansal abruptly resigned from the Walmart-owned company, following an internal investigation into an allegation of “serious personal misconduct,” sending shockwaves across India’s startup ecosystem. Bansal’s ouster comes months after his fellow Flipkart founder, Sachin Bansal (no relation), was forced out of the company during its sale talks with Walmart in April, following a bitter fallout with the then-board of Flipkart. In May, Walmart agreed to buy 77 percent of Flipkart for $16 billion. [Anirban Sen and Mihir Dalal / Mint]Target’s official Twitter account was briefly hacked to promote a bitcoin scam that has also targeted Tesla CEO Elon Musk. In a variation of a well-known ruse, the hacked Target account, which has more than two million followers, posted a tweet promising to give out 5,000 bitcoin as part of “the biggest crypto-giveaway in the world!” The now-deleted tweet encouraged users to send a small sum of cryptocurrency for a chance to enter a $30 million bitcoin giveaway. Screenshots have surfaced showing that the scammy tweet, which looked like an ad from Target, was “Promoted,” meaning that the fraud made it past the Twitter team that vets ads. [Makena Kelly / The Verge]We told you about microinfluencers and nanoinfluencers the other day — now get ready for patient influencers. An industry has cropped up to link drug makers with medical patients who are willing to leverage their experiences into a social media career, getting paid by pharmaceutical companies for their opinions and insights on treatments, medications and providers. And unlike ordinary Instagram influencers — who will generally get paid for making a post about a product — patient influencers can be paid both for posting about a drug or a device, but also for bringing the opinions of fellow patients to the companies developing those products. [Kate Sheridan / Stat]Josh Harder has won his congressional race to become the only venture capitalist in the House of Representatives. The entire race was effectively a referendum on Silicon Valley.[Theodore Schleifer]How a Democratic fundraiser taught everyone his Silicon Valley tricks. RevUp CEO Steve Spinner cracked the code on raising money for politicians online. And on the latest episode of Recode Decode, he says it’s not so different from raising money for a startup. [Theodore Schleifer]What it’s like inside Glossier’s “adult Disneyland” flagship store.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}