{"id": "Goldman Sachs has asked one of its most prominent tech bankers to help infuse itself with that same tech", "paragraph": "Goldman Sachs over the last few years has been trying to infuse tech into how the giant does its business. And now it’s plucking one of its most well-wired tech bankers to help lead its tech effort, Recode has learned.George Lee, one the investment bank’s most prominent Silicon Valley figureheads, will now serve as one of the entire institution’s chief information officers, according to an internal memo obtained by Recode. It’s another change in a tech banking division that has seen quite a bit of turnover — as all of Goldman Sachs has since the bank named David Solomon as its new CEO.“He has focused on leveraging technology and data to better serve our investment banking clients and, in his new role, he will continue to help ensure that we deliver superior service, insight and advice to our clients globally,” the memo reads.Lee, a Goldman Sachs lifer, will now be in charge of Goldman’s efforts to modernize as a company, overseeing its engineers and its group of so-called “strats” — the firm’s quantiative-minded workers. It’s a pretty big job: Lee will help oversee more than one-quarter of Goldman employees, about 10,000 people.Lee’s job will be to help Goldman Sachs use technology before technology makes places like Goldman Sachs obsolete. Goldman’s business is threatened by upstarts ranging from wealth management startup Wealthfront to cryptocurrency company Coinbase to stock-trading sensation Robinhood.Titles in the world of investment banking are almost notoriously opaque (and in some ways, that’s intentional.) There are heads, co-heads, chairs, co-chairs and more, and it’s pretty common for leaders to have a few different titles, in different divisions, at the same time. It can be hard except for Kremlinologists to tell who The Important People are at any institution.Lee is not as involved as he once was in doing deals, industry observers have said, although he remains a visible public face for the bank around town.Lee used to run day-to-day tech banking as its co-head alongside Anthony Noto, the star tech banker turned Twitter chief operating officer and most recently turned CEO of SoFi, the lending startup. Then in 2014 Lee became one of the division’s chairmen, a less hands-on role, and it was Dan Dees, who became the head tech dealmaker in Silicon Valley. Solomon promoted Dees last month to become the co-head of all investment banking, not just tech.So tech folks are on the rise at Goldman Sachs.But now there’s something of a temporary vacuum at the top of Silicon Valley banking at Goldman, which is, as always, locked in a fierce battle with Morgan Stanley for tech deals and a resurgent JP Morgan. A replacement for Dees is not expected to be named until next year, although one likely candidate is Nick Giovanni, according to a person familiar with the process. Pete Lyon is currently is the sole head of technology, media and telecom banking, but is based in New York.Lee will be co-chief information officer next to Elisha Wiesel, who is most well-known for being the sole child of Elie Wiesel, the famous Holocaust survivor and author.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}