{"id": "How Amazon’s HQ2 and HQ3 locations compare with Seattle and the U.S. overall", "paragraph": "Update: This post was initially published on Nov. 6, before the Amazon HQ2 locations were confirmed. And then there were three.Amazon’s drawn-out public search for a second headquarters has officially concluded with two locations, National Landing, Va. (which appears to be a new, made-up neighborhood) and Long Island City, N.Y.\n    Related\n  The New York Times and the Wall Street Journal first reported on the multiple headquarters last week. The decision essentially splits in half the 50,000 employees and $5 billion in capital expenditures Amazon had promised.Here’s a look at data for these new headquarters and how they compare to Seattle, the home of Amazon’s current headquarters, as well as to the U.S. at large. The median home listing prices are highest in Seattle’s King County ($635K), compared with Queens ($598K) and Arlington ($592K), according to real estate site Trulia, though it’s likely that some of Amazon’s Long Island City workers would choose to live in the more expensive boroughs of Brooklyn ($775K) or Manhattan ($1.7M).Tech worker wages are also slightly higher in Amazon’s original metro area ($117K) than in New York City ($113K) and D.C. ($111K).Unsurprisingly, all three of Amazon’s headquarter cities are much more expensive than the U.S. average by most measures.It’s noteworthy that Long Island City hasn’t historically been a major office market. Some of the companies that called it home are leaving or have left. Longtime commercial tenant Citigroup is dramatically downsizing its footprint in its office tower. (Update: Citigroup now says Amazon plans to move into its tower at 1 Court Sq.) MetLife has continued to sublease its Long Island City office space following its move to Manhattan.What Long Island City does have is a lot of new apartment construction, contributing to an oversupply that’s leading to declining rental costs. Amazon’s move to have three instead of two headquarters reflects the difficulty in finding huge amounts of housing, office space and, most importantly, tech labor in any one locale, according to the Wall Street Journal and New York Times reports. New York City, D.C. and Seattle are some of the highest ranked on real estate research company CBRE’s annual list of tech talent, which factors in metrics including an area’s concentration of computer science degrees, the size of the existing tech industry and the cost of living.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}