{"id": "Peter Thiel cut his largest check to the GOP since Trump’s 2016 win", "paragraph": "Peter Thiel has made his biggest political contribution since his divisive bet on Donald Trump in 2016, investing $1 million into a conservative advocacy group that is backing key Republican candidates before November.The donation to the Club for Growth, revealed Thursday in a new campaign finance disclosure, could be a signal that Thiel plans to reassert himself as a political donor despite some unease with Trump. Thiel has been a fairly modest giver in the grand scheme of presidential politics, but his vocal and financial support of Trump in the last cycle made him a real political player in the early days of the Trump presidency.Thiel cut the $1 million check on Sept. 27, according to the disclosure. He has made contributions of about $350,000 to the Republican National Committee and other GOP groups and candidates earlier this election cycle.The high-profile investor and Facebook board member has voiced some discomfort with Trump since helping elect him and speaking at the Republican National Convention.“Obviously there are all sorts of things that are somewhat disappointing,” he said in March, “and at the same time, I don’t know how much one can expect.”Thiel moved to Los Angeles earlier this year — a change of address that he’s attributed to a revulsion with Silicon Valley’s politics and culture. In 2016, he gave $1.25 million to a super PAC sponsored primarily by New York hedge funder Bob Mercer — not a massive check in the world of big-money politics, but an amount that stood out in a Silicon Valley that heavily financed Hillary Clinton’s presidential run.The Club for Growth is a hardline conservative group that has gleefully challenged even Republican incumbents it feels are too far to the left. It has focused almost exclusively on fiscal issues, which should appeal to Thiel, who has described himself in the past as libertarian. A spokesperson for Thiel did not immediately respond to a request for comment.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}