{"id": "Recode Daily: Has Facebook stopped growing?", "paragraph": "Facebook’s last earnings report was a total disaster. After months of bad news, Facebook unveiled its second quarter earnings back in July and reported less revenue than Wall Street analysts expected — and more importantly, fewer new users. In fact, Facebook didn’t grow at all in its most valuable markets, the U.S., Canada and Europe. It actually shrunk. After years of tremendous user growth — Facebook has more than 2.2 billion users globally, and owns three other apps with more than one billion — Facebook had suddenly hit a wall. Was last quarter a blip? Or is Facebook as big as it’s going to get? We’ll find out this afternoon when the company reports its third-quarter results. [Kurt Wagner / Recode][Want to get the Recode Daily in your inbox? Subscribe here.]  Whatever Apple announces at today’s pre-holiday product launch event at the Brooklyn Academy of Music — Apple watchers are expecting new iPad Pros, a MacBook Air heir and an updated Mac mini — just about everyone will get something for free: iOS 12.1 will be available today as a free software update. The first significant update to iOS 12 brings a variety of features, including Group FaceTime, dual SIM support, real-time Depth Control for Portrait mode, new emoji and more. The Apple presentation takes place will be livestreamed starting at 10 am ET; you can watch it on Apple’s website. Recode will be there; click here for our live updates. [Lauren Goode / Wired]Meanwhile, contract changes and pricier devices are leading U.S. consumers to hold on to their smartphones for an average of 2.83 yearsbefore upgrading. In a recent study of data from a mobile-device trade-in company, iPhones traded in were an average of 2.92 years old, and iPhone owners held on to them longer than Android users. [Sarah Krouse / The Wall Street Journal]A record 44 percent of U.S. firms will give workers paid time off to vote on Nov. 6, up from 37 percent in 2016. More than 400 companies have also signed on to efforts with ElectionDay.org and Time to Vote to boost voter turnout in a variety of ways. That doesn’t necessarily mean shutting down or officially giving workers time off. Some firms, like Lyft, have instituted “no meetings” policies or provided on-site voter registration. [Jordyn Holman and Sahil Kapur / Bloomberg]The United Kingdom will roll out a first-of-its kind “digital tax” that could generate more than $500 million annually. Starting in 2020, the new tax will affect large tech companies; big U.S. tech firms have been criticized for reporting relatively little of their profit in local jurisdictions. The tax move comes as dozens of other countries consider similar taxes for firms like Facebook and Google. U.K. treasury chief Philip Hammond said that it was “not sustainable, or fair” for large tech companies to avoid taxes in countries where they operate. [Paul Hannon and Nina Trentmann / The Wall Street Journal]Restaurants are shrinking their dining spaces as food delivery apps get more popular. The number of food delivery app downloads is up 380 percent compared with three years ago, and market data predicts that U.S. restaurant delivery sales will rise an average of 12 percent a year to $76 billion in the next four years. Restaurant real-estate advisors are seeing an overall downsizing of restaurant seating space as chains experience less foot traffic and more online and mobile-ordered pickups. Some new restaurant owners are skipping tables and chairs altogether and just leasing kitchen space to prepare food for couriers. [Olivia Zaleski / Bloomberg]Bradley Tusk, a political “fixer” for tech companies, has a plan to make voting from your phone a reality.“It’s the only way to fix democracy,” Tusk says on the latest episode of Recode Decode. [Kara Swisher]Goldman Sachs has asked one of its most prominent tech bankers to help infuse itself with that same tech.George Lee will be the bank’s new co-chief information officer. [Theodore Schleifer]The right way to split the check at a restaurant.Frankenwords.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}