{"id": "Taking a page from YouTube, Snap VP Nick Bell wants to find the next generation of media stars", "paragraph": "You might be shocked to hear this, but the person in charge of Snapchat Discover and Snap’s other “non-friend content” isn’t impressed by Instagram’s copycat product, IGTV.“I don’t think they’re really trying to push forward the kind of quality bar of mobile video in the same way that we are,” Snap VP of content Nick Bell said on the latest episode of Recode Media. “And you know, I’ve not seen anything on there to date which, as I said, is really compelling, that’s going to keep me coming back.”However, Bell acknowledged that other media apps like Instagram have worked more proactively to turn regular people into in-app celebrities, in contrast to Snap’s history of partnering with big media companies like NBC* and the Daily Mail. He told Recode’s Kurt Wagner that that may change, as his team thinks about how to create videos that keep users engaged and less likely to tap over to another app. “Vine did this really well,” Bell said. “YouTube did this really well. There was a generation of YouTubers created, right? And these were people who were creating actually really high-quality, compelling content. And I think for me that is something that we look at it and we think about, you know, is there a way to really help grow that part of our ecosystem?”“We’ve obviously got the celebrity Stories which do incredibly well, but celebrity Stories to me are only really interesting occasionally, or if you’re really interested in that celebrity,” he added. “That kind of voyeuristic element of getting on a private plane and, you know, walking up the steps to the stage for a concert or a presentation or something are interesting if you like that person. Then once in a while, something amazing will happen in that person’s life that everyone cares about.”Snap recently announced a slate of 12 original, “serialized” shows called Snap Originals. The company will report its Q3 2018 earnings later today.* Disclosure: NBCUniversal is an investor in Recode’s parent company, Vox Media.You can listen to Recode Media wherever you get your podcasts — including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a full transcript of Kurt’s conversation with Nick.Kurt Wagner: Nick, thank you so much for joining Recode Media. I’m with Nick Bell from Snapchat, the VP of content, I believe. Is your formal title?Nick Bell: That is my formal title. It’s good to be with you, Kurt.Yeah. Thank you for being here. This is my first time. I just mentioned to you this is my first time at this office. I found it interesting in two ways. No. 1, it felt very industrial from the outside, unlike the Venice Beach boardwalk situation you guys had at the old place. But then the inside, I could actually see people working. When I came to see Snap a few years ago, I wasn’t even allowed past the lobby. So it’s like an open work space you have here.You’re probably going to get me in trouble. I don’t know whether you’re allowed on this floor. No, I’m joking.Well, I’m glad that I have you as an escort because that helps a lot. So thanks for being here. We have a ton that I want to talk to you about. As VP of content, that basically means ... Well, I’ll let you describe it. I think of you as overseeing everything that’s not created by a Snap user, so shows and Stories and things that are in Discover. Is that pretty much where you fall?Close. Close. Everything to the right of the camera that is not your friend content. We use a term internally as “non-friend content.” That also includes Our Story content, which is obviously created by the community, which we curate and obviously then publish.Got it. So you oversee that curation team as well.I do. Yeah, I do.Cool. I want to talk about all that, but I actually want to talk a little bit about you first, and just kind of your path to Snap. Because I heard an interview that you did, I think it was a year ago or so in Europe, and you sold a company when you were 16 years old for a million dollars?I did. I mean, we don’t talk about how much we sold it for, but it was a substantial amount of money, and a very substantial amount of money when you are 16 years old.Yeah. What was it like to be in high school? Let’s pretend it’s anywhere in the ballpark of a million dollars. What’s it like to be in high school and have something like that happen?It was crazy. People say I sold a business. Even I kind of say I sold a business. The reality was, I sold a website. It wasn’t actually generating any money at the time or certainly not a huge amount of money. A few affiliate links here and there in the early days of affiliates. But yeah, it was a teenage website. I started building websites back in the GeoCities days. I became a huge fan of the PlayStation, and when the PlayStation first launched, I became obsessed with cheats and hints and tips. I don’t know whether it was the same in the U.S., but in the U.K. you would buy these magazines and they were pretty expensive, and they would often have a cheats and tips book attached to the front. So I used to then go through those and kind of retype them on a GeoCities page and that kind of grew in numbers from two people a month to 20 people a month to 100 people a month. I loved watching that ticker at the bottom go up and up and up.So, we expanded it from just games to be a ton of stuff for young people, so music, movies, that sort of thing. It kept growing. That ticker at the bottom just kept turning over. Then we got to the point, I remember being so proud and running down, telling my mom one day when we reached 1,000 people a day. From that, kept growing. We started to do more and more deals. We became the homepage for teenagers on Bt Internet, which was one of the big service providers in the U.K. That really skyrocketed the traffic. From there, we caught the attention of several people, and finally as I was nearing the end of my, what we call GCSE year in the U.K., which is the exams you do when you’re 16, got an offer and decided to go ahead, sell the company. But it was quite funny, one of the terms of the deal was I could not sign the deal until I’d finished my last exam. Not that I was not going to be distracted enough by this big deal going through. But I think that if they persuaded me to actually complete my exams would be better than not.How do you celebrate as a 16 year old when you do something like that? It’s hard to imagine. What do you do?For me, it was interesting because later on in the process of building the website — which was called teenfront.com — I got my best friend involved as well. He wanted to be a journalist. I was kind of interested ...Smart man. Super smart man.Exactly. Exactly. He was not a successful journalist and now works in shipping, but never mind. He wanted to be a journalist, so he was really up for writing a lot of the content, where I was kind of building the website and hustling the deals, although the content was obviously where it started for me. So he became a big part of the deal. My parents were also heavily involved. I had huge support from my family. My sister wrote for the site. My mom was the Agony Aunt for the site, so was answering questions for teenagers about sex, drugs and rock and roll.Wow. Cool mom. Under a pseudonym, but it was pretty funny. We actually went out and celebrated as a family with Robbie, my best friend. Who, I recently got married, he was my best man. So that was a relationship that has continued. I remember going out. We had a Chinese meal, and we kind of celebrated like that. At the time, it just felt like the start of something. You know, honestly, I thought that being able to achieve something like that at 16, I was expecting to be snapping at the heels of Bill Gates by now. It felt like this was just the very start.Yeah, instead you’re just snapping at the heels of Evan Spiegel.Exactly. Exactly.You’re getting there. So how did you meet Evan and start to work for Snap? I know you worked at News Corp for a while, right?Yeah. So after TeenFront, I went to work for the company that acquired us. I was there for just over a year. I left school at 16, so I don’t have any real formal education, which just meant that although I’m not that old, I’ve been doing this for a long time. Built another few startups. Exited a couple of them successfully. I actually bought TeenFront back and then carried on running if for a bit and then sold it again, albeit not for a huge amount of cash that time.I actually went to the website a couple days ago, but it said it was up for sale.Oh is it?So you can buy it back again if you want to.Maybe that’s the next move. Maybe that’s the next move.Yeah, the next phase.Then one of the startups I created was a company called Quick.tv. Quick.tv was built with the premise that online video was going to be big. We got that one right. The second guess was that — or bet, I should say — is that this was not just going to be linear video, but it was going to be interactive. So you were going to be able to, a little bit like with the web, you were going to be able to click on things and do things, and that was going to affect the course of the video. We’re starting to see some of that come through actually. It’s interesting, all these years later. That was probably 10, 11 years ago. We raised quite a lot of money for a startup. We raised a couple of million dollars. There was just a couple of us working on it.Unfortunately, we’d raised too much money that we had a bit of a lifeline, but we couldn’t get it to work. I was banging my head against a brick wall every single day trying to make this work. One of the good things for me is that there’s a guy called Paul Cheesbrough who was a non-exec for us at the time. He was actually the chief technology officer at News Corp. So after I finally threw in the towel and admitted that interactive video was not quite ready for market yet, he persuaded me to go and join him in London and run digital product there. Then I ended up, after five or six years, moving to News Corp in the U.S. and working there. As part of that gig, I was lucky enough to work very closely with Rupert. I arranged a digital summit for him at CES one year. He hosts a digital summit there. In the very start of 2014, the responsibility fell to me to arrange the summit for him. One of the speakers that we invited to this closed-room summit, where there’s like 20 or 30 News Corp execs, was Evan Spiegel. Long story short, a couple of weeks later, I went to dinner with him in LA. He invited me to the office the next day. I later found out I was there for interviews. I didn’t know that at the time. I remember the first person I spoke, Emily White ...Former COO.Former COO at Snap. Walked in, and she had my LinkedIn profile printed. Then she started interviewing me. I was so confused because I had no idea that I was actually there for interviews.What was the pitch? I imagine they, at some point, obviously offered you a job and had to convince you that it was a good idea to leave Rupert Murdoch, so what did they tell you?I actually was pitching Evan. So when we went for dinner, I was pitching Evan on the fact that I thought Snap should have premium content. It should have publisher content on there. I was pitching him on the News Corp brand, as my role at the time. Over the course of dinner, I started kind of talking about the product. If you’ve spent time with Evan, there’s nothing he likes better than talking about product. We just kind of started brainstorming what this might look like. He stopped me and said, “I don’t often do this, but I want to show you something.” So he got his phone out and he showed me an early prototype of Discover. Then we spent the next hour critiquing it. He said, “Wow, that’s incredible. You should come and see the office tomorrow then.” I naively went to the office thinking I was just going to see the office, and ended up quite literally leaving that day after meeting five or six people with an envelope with an offer in. Then had the very difficult decision of whether to join this small company in Venice, which was like 30 people at the time, just turned down big offers from Google and Facebook if you believe the news, and go and join him to help set up premium content on Snap. After a lot of back and forth with my friends and family and talking about the opportunity, I decided to take the plunge and join. And four-and-a-half years later, I’m here.I was going to say, you made it past the four-year mark where it feels like everybody in tech is like ... It’s around that four-year mark is when it’s like, hey, people start thinking. I do want to talk about the content that you just mentioned. That is what Discover is. That’s what you do every day. You guys have shows. You have Our Stories, I believe, or live? What do you call them now?Our Stories. Yeah.Our Stories, which are basically compilations of posts from users. You have, I call them editions. What are they, the magazine things?We call them Publisher Stories.Publisher Stories. What works best in Discover these days? I know you’re obviously coming out with some new episodic shows. Where do you spend most of your time talking with publishers? What are you encouraging them to create today?There’s one more, which is actually live. We actually now have livestreams on the platform as well.Livestreams being compiled posts about a live event? Or like live video stream?No. Live video stream. We just started earlier this year with the Olympics and worked with NBC on a kind of product that we called Moments That Matter. We jumped into the stream when Shaun White was about to win gold, as he was about to win gold, but when he was about to, whatever they call in snowboarding when you jump off. Then we followed that more recently with the Kavanaugh case a couple of weeks ago and Trump’s press conference the day before that. We’re finding that our users have a real interest in what’s going on at that moment if it’s a big event.Those are snippets, right? Just a couple minutes, even? Yeah. The Kavanaugh case was obviously a little bit longer, but we’re experimenting with that. But to kind of go back to your original question, for us it’s about trying to figure the best way to super-serve the intent of somebody at that time. So we find that the publisher Stories, where they’re short-shop articles and sort of hyper-visual multimedia storytelling...It’s like a digital magazine.Exactly like a digital magazine. Those are great for people when they’re on the go, when they’ve got one or two minutes just to jump in and find out what’s happening, find out what’s going on in whatever particular subject they’re interested in. Where Shows for us is more of a lean-back experience which people tend to be watching when they’re at home or when they’ve got a little bit more time. That’s more of a kind of lean back ... I say lean back, it’s interactive, but it’s more of kind of just “entertain me” experience. So we’re really just trying to figure out the ... It all comes down to what is the optimum mobile experience and how do we present content to our audiences in the right way at the right time and then help them find that stuff really easily.It’s funny you say lean back, only because the length of those shows is so short. It’s four to five minutes an episode, right? So just the whole notion on mobile of what lean back means versus television is so different. Right. That’s why I corrected myself. There’s no moments on mobile where you’ll lean back. I think it’s actually the least-forgiving medium out there. You’re constantly being distracted by an alert, a message. You’re constantly in an environment where there’s other things going on and therefore you’re either deeply immersed or you’re out. From our point of view creatively, that’s both a blessing and a curse. It’s a blessing because it’s allowed us to really develop this format of mobile. I think we’re really leading the way there with what great mobile video looks like. We believe, and we know from the data, that it’s fundamentally a new medium. But it’s also a curse because creatively you can see when things aren’t working, and it’s a harsh reality at times.You guys have been arguably near the top, first, whatever you want to say, in terms of this vertical video stuff. What does work and what doesn’t work? Like, what have you found over the last couple of years?Well, I think it’s interesting. It’s actually the fifth anniversary this week ... Don’t know when this is going out ... So October 13th, of the Stories product on Snapchat.Okay.And if you think about the kind of history, and the reason why Evan and Bobby built the Stories product ... It was prior to my time here, but they built it because people were requesting a Send All button, and Evan and Bobby thought that would be really spammy, and people would become lazy and just click the Send All button ...So you could send it to everyone that you were friends with, basically.Exactly. So rather than that, they created the Broadcast product, which is kind of the Stories product. And I think what was fascinating about that is it had a couple of fundamental differences to other products that were on the market. First and foremost, it was chronologically ordered. So, you know, if you were Snapping all day, you would start with breakfast, go through lunch, and end at dinner, and you would append a Snap to the end every time you posted. And second of all, it was just a really easy way to post things. And because these Stories disappeared, the ephemerality, people just felt very comfortable. It was kind of very relaxed and laid back. It wasn’t creatively ... People weren’t umming and ahhing about whether they should post something to their Story. So, there was a lot of content being posted to Stories, from pretty early on in the product.Yeah. It was like no pressure, right?No pressure.This whole notion of lowering the bar of what belongs online.Exactly. And so, what was incredible from a Snapchat point of view is that Snapchatters, our audience, started really creating the language of what mobile video looked like. So first and foremost, you take the really obvious, it was all vertically cut, and it was all full-screen. Then, what Snapchatters were doing would be — whether they were Snapping with their friends or posting to their Story, but I think the Story piece became interesting because it just became so mass so quickly. And so, what people would do is they would add visual elements. You know, text and doodles initially, and as the years have gone on, it becomes more and more sophisticated. You can add stickers, effects, etc., etc. And so, they would add layers, which would make things pop. So I think that became interesting. About, how do you actually tell something in a manner which is really quick to get up to speed with? The second thing which I think was really interesting about mobile video is that because you had to hook people and keep them hooked, every single small Snap that was appended was almost like its own beat. It had a short beginning, middle and end, it had some sort of payoff, and it was straight to the point. I use the example, if we were filming this interview now for TV or for a movie, we’d probably have a beautiful aerial shot down the coast of LA. We’d come in on rails through the car park here at Snap, steadicam up to this office, about where this meeting room that we’re sat in, and zoom in on us. If I was to Snap the car and say I’m with you, I would Snap you and show that we’re in the Snap office. So, I’d be straight to the point. Subject matter first, and then context.It’s really easy to skip, too, right? Like if I’m following you and you post something in your Story, and I get bored, I literally tap the screen and I’m to the next thing.Yeah, exactly. You tap to control the pace. And so, the next point I was gonna make is pacing’s really, really important. You have to keep people engaged. As I said just before, it’s so unforgiving. If you don’t keep people engaged, then people drop out. What we actually found is that Snapchat has created the language of mobile video. And so, when we started to think about what premium content looked like on Snap and we launched the Discover product in January 2015, we started finding that short-form video that was just taken from elsewhere and kind of slapped into one of these digital magazines, wasn’t performing very well. Therefore, we moved to a point where it was no longer letterbox. Everything had to be cut vertically. At that point, we started to really kind of double down and think about what great mobile video looked like. And we had a big head start and a kind of unparalleled advantage, that we already had all of these people creating all of this content, who ... We had 100 million people-plus creating mobile video every single day, and they were teaching us what was working. They were doing a lot of the experimentation for us.It feels like you have a lot of high-quality stuff on Discover. I have seen ... But at the same time, I don’t find myself going there. And I’m just wondering, is that because I’m not your target demo? Is that because, as someone who grew up with traditional TV, I’m used to seeing the widescreen, and maybe a little bit higher quality of video? Who are you targeting with Discover, and why is someone, maybe like myself or my age group, right around 30, not necessarily going there?I’d say a couple of things. We don’t break it out, but a huge proportion of Snapchatters visit Discover every single day. We do aim it at our core right now. It is definitely 13 to 24, the target for the vast majority of the content on there. I think over time — and actually currently, we’re actively looking to go into new markets and target new demos with a wider range of content. And I think the second thing is, we’ve added a lot of really high-quality content over the past few years, and I think the next step for us is to identify those behaviors and kind of super-serve them. So, you know, what is it that you in particular would want to go to the page for? And then how do we organize the page to make that as efficient, as effective, for you to find that content as quickly as possible? We started on that earlier this year with the new design, where it’s a For You section which is algorithmically ranked. There’s a lot of big learnings coming out of that, and I think the next step for us with Discover is to take the learnings from the For You ranking and start to make it so that the page really super-serves the users.Yeah. It does feel at times, I will say, like a little cluttered. There’s just so much stuff on there. Is that feedback you get from other people? Is there a way to kind of organize it, without necessarily an algorithm, but that still kind of cleans it up for you?Yeah. I mean, definitely. That is something that we think about a lot. How do you reduce the cognitive load when you go to that page? How do you introduce simple visual hierarchy, etc.? And don’t forget, we started off with 12 channels a couple of years ago. These 12 beautifully clean circles on a page ...Right. I remember.... that users would tap into and kind of unbox a package of content every single day. And as we’ve grown and as we’ve added more content, that’s changed. I think we go through these cycles, and then we learn a lot, and we evolve. So, expect to see more there.Yeah. You do have ... The way it’s set up now is it looks like a magazine cover, basically, to kind of lure me in. What I will say ... I just told you there was a lot of high-quality stuff on there. I also notice there’s some stuff that seems clickbaity to me, like a lot of bikini photos. I was even just looking this morning. There was like a Kim Kardashian teaser. There was a sexiest selfies thing from one of the publishers. And this is not something that I’m just ... I’ve heard this from a lot of people, who say, “Hey, it feels kind of ... “ I don’t know. Maybe “dirty” is the word, at some times. Do you care about that? How much are you aware of that, and what do you think of it?Well, as somebody who uses our product all day every day, I certainly hope that I see what our Snapchatters see, as well. You know, I think it’s balanced. Right? There’s a lot of high-quality content on there as well, from the likes of the Wall Street Journal and New York Times, the Economist. So, I think people look at something and they see what they want to see. I think from our point of view, it’s like we want to make sure that it’s easier to navigate that page, and if you don’t want to see that stuff, you don’t have to see that stuff. But we have so much high-quality content on there now that we feel that there is something for everybody. We’ve just got to get the right content to the right people at the right time.Yeah. Does that stuff diminish the high-quality stuff? Like, if I’m looking at the Wall Street Journal and they have a really thoughtful story about economics in China but it’s right next to the Daily Mail telling me to click on bikini photos ... You know. There is this association, this proximity association that happens. So, is that something you’re worried about?I think it all comes down to organization. If you go into a newsstand ... You know, in the airport, which is where I tend to go into them.Sure.I love print. I came out of News Corp. I still love print magazines and newspapers, which people are always surprised at that, with my kind of digital hat on now. But I go into a newsstand, and you have a wide range of magazines in there. Your eye is drawn and you kind of walk towards the section you’re interested in. And therefore, if you’re interested in home and garden magazines, you go to that section. For all you care about, you don’t really notice anything else. So, I think that’s one of the things we need to do. I think the Daily Mail is the most popular news website in the world. I think their content is highly entertaining and highly engaging, and performs very, very well. We love the team across at the Daily Mail. But it’s popular content and popular culture, and the reason why it’s called popular culture is because it is popular.Yeah.But that doesn’t necessarily mean that it’s for everybody. And I think the most important thing for us is trying to provide a diet. I think helping people learn about the world is something we care deeply about. You know, I mentioned earlier on the livestreams with Kavanaugh. I mentioned the press conference with Trump. We think those things are really important. And I think the thing that’s really kind of heartening for me is, as somebody who is really interested in the world and news and politics, is that our users are also consuming that content in huge numbers. Peter Hamby mentioned this last week when he was being interviewed in a panel, but, the Kavanaugh livestream was watched by 4.3 million people. That’s a huge number of young people that were tuning into something which is fundamental in the world of current affairs, and that gives me a lot of heart, as well.Yeah. I think ... I don’t know if it was you specifically, or Evan, or maybe Peter. But you’ve talked about almost like a responsibility. The fact that you have 13 to 24 as your target demo, saying, “Hey, they’re probably not gonna get their news from the same sites that maybe older people are going to, so Snap has an opportunity to teach them about politics,” with Peter Hamby’s show or whatever. How much do you think of this as a responsibility versus an opportunity?I think the two are really tightly combined here, right? “Good Luck America” was the first show we ever created. That was created in advance of the 2016 election, to try and help educate people a little bit more. The name just turned out to be pretty fitting with everything that’s gone on since then. So, you know, that show has continued running. We’re excited to take that show into the 2016 ... Sorry, into the 2018 midterms. We also have launched what I believe is the biggest young person’s news show in the country now, with Stay Tuned, which is produced by NBC News. Hugely popular. Reaches over five million people a day. Has very high loyalty. Nothing makes me prouder, if you like, than when I meet people and they tell me that they were round the dinner table, a family dinner, and their kids are starting to chip in on something that’s happening in the news, and they’re like 13, 14 years old. They say, “How do you know that?” They say, “I found out about it on Snapchat.” That’s always great for me to hear. I think informing people about what’s going on in the world is so important, and it’s definitely a big, big part of the thing that I’m driving here at Snap.What’s been somewhat interesting to me is that you keep announcing partnerships, and you have these new, kind of episodic shows coming? Serialized shows, is I think how they’re being described?Yeah.Original content. You mentioned NBC as partners. You have big partners at ESPN. I feel like Discover should make more money, quite frankly. And I know you don’t break it out, necessarily, but the company is losing a lot of money. I know this is just one element of that, but how do you grow all of this into an actual business? What is keeping you from making this twice as big as it is today?You know, we are growing really quickly. If you — our financials are public now. And if you look at the growth that we’ve had over the last three years, it’s been huge. I think we’ve had a lot of things going on there to improve the ad products and building out the ad tech stack. Don’t forget that we launched the first ads when we launched Discover very early in 2015, but really didn’t launch a proper ad product until the middle of that year. So we’re a few years into this and rapidly growing. I think for me, it’s about driving the engagement. That’s what I’m really focused on. If you look at time spent with premium video since the start of this year, it’s almost tripled. So, you know, there’s a huge demand for it from our audience. We’re figuring out how to do it. We’re trying to crack the code. I think we’re really close to cracking the code on what great mobile video looks like, in a very reputable way. I think we’ve had some standout hits, and the general quality is getting better and better, and we’re getting better at working with partners on that. So if we keep driving that engagement, I think our ad products are really solid. That’s starting to drive a lot of value for our advertisers. You know, we hear that more and more. The return on investment from advertisers is something that is, you know, an everyday thing for the people that are on the platform. I think that’s so powerful and I think combining huge audiences with great engagement and an ad product that really works for our advertisers is a formula that will just keep getting better and better. Have you thought about subscriptions at all? I came from a business that was based around subscriptions, right? And I helped launch the Times of London ... I can call it a paywall now that I don’t work there. “Paywall” was seen as a negative term, I think, I can’t remember what we called it.I think that’s pretty standard. I think you can say it now. Yeah.We try to avoid that term. You know, the Wall Street Journal obviously is a big subscription business. The Fox side of the business was all about affiliate fees, etc. I came from that world. I think it’s really interesting to see some of the more industry-led publications having great success there. And I think, you know, going forwards, I think there is a world where a lot of consumer entertainment will be as well. We’re already seeing that with Spotify, with Netflix, with Hulu, etc. I think there is a world where that becomes really interesting. It’s not something we’re looking at right now, it’s not something that, you know, we’re considering or working on, but I can see a world in the future where that becomes the norm. I think there’s still a lot of friction involved with subscription, right? And I think that’s what’s interesting about the acquisitions and the mergers and the big conglomerates that have been formed with the likes of Verizon and AT&T, etc., where you’ve got the pipes. Or, you know, the wireless connectivity with devices and then you have a large content operation as well. And I think actually being able to bill people for content in a really frictionless way is important. I was driving through LA a couple of weeks ago and I passed like four or five billboards in a row and it was telling me that every network that I was passing was the fastest. As a consumer, I’m so confused by that. So how do you differentiate, you know? I think that the race to the bottom on price is not a healthy one, so I think telcos, you know, differentiating by our content offering makes a lot of sense. I could see that being a viable business in the future. I don’t know how big of a challenge that would be with your target demo too. I just don’t know. You would probably know better than I if 13- to 24-year-olds are willing to spend money for this kind of content, or if they just say, “Oh, well if Snap’s gonna charge me, I’m going to go somewhere else.”Yeah, I think we’re already seeing this with Netflix and Spotify. I mean, we’re at, the uptake with 13-, 14-, 15-year-olds, Netflix and Spotify is huge. They’re probably not paying for it directly. If they are, it’s probably actually a parent who ...Yeah, Mom and Dad are paying, sure.Exactly. Um, and again, I think that’s where the telco could come in and really help with that. If you’re a 13- or 14-year-old and you’re going into a store to pick a mobile for the first time and you’re choosing the package that you want and they’re differentiated by content, that could become interesting. So I think that’s a wait and see. But you know, I think it’s definitely too premature for Snapchat to start charging people for content. One industry question and then I want to ask you about Snap more broadly. Industry: What do you think of IGTV? IGTV is ... that’s a good question. I’ve not found anything on there which is compelling that I want to keep going back for. I was excited about the concept of it when we were hearing about it through the industry before it launched, because, you know, the more that can be done to really push forward great mobile video, the better. So for me it’s still a wait and see. So it wasn’t a ... You didn’t see that as a direct threat to Discover? Because it seems pretty ... I mean, to me as an outsider, It seems like a pretty clear direct competitor. When I heard about it, I did. When I’ve seen it, I don’t. I just, you know, I don’t think they’re really trying to push forward the kind of quality bar of mobile video in the same way that we are. And you know, I’ve not seen anything on there to date which, as I said, is really compelling, that’s going to keep me coming back. It seems like a pretty broad kind of spray of content right now. It’s clearly much more creator-focused. I feel like you guys tend to work with maybe the larger media companies and brands, and they’re working with creators. That’s always been a knock on Snap, actually, is that you didn’t work with creators early enough or you haven’t done enough. Do you have any regrets about how you guys have handled the creator community? Definitely no regrets, but it is something that we’ve been leaning into a lot recently, to try and understand. And I think, you know, we’ve started to get a much better grip of what creators want and how we build a sort of sustainable long-term ecosystem for them. What I really like is the kind of the world of ... Vine did this really well. Again, to kind of call out, YouTube did this really well. There was a generation of YouTubers created, right? And these were people who were creating actually really high-quality, compelling content. And I think for me that is something that we look at it and we think about, you know, is there a way to really help grow that part of our ecosystem?  We’ve obviously got the celebrity Stories which do incredibly well, but celebrity Stories to me are only really interesting occasionally, or if you’re really interested in that celebrity. That kind of voyeuristic element of getting on a private plane and, you know, walking up the steps to the stage for a concert or a presentation or something are interesting if you like that person. Then once in a while something amazing will happen in that person’s life that everyone cares about. But I think actually what I’m kinda more interested in right now is how do you carve out a segment for content creators who are producing really compelling storytelling around pretty broad subjects in the same way that media companies of today are doing. And I think that we see that as a big opportunity. Yeah. I have a million more questions, but I do need ... I want to ask you about Snap more broadly before we run out of time. It feels, again from the outside, we’re seeing a lot of people leave in the executive ranks. I’m curious, can you give us a sense of what’s going on right now? I mean, it’s been a ... has it been, it’s been a year and a half since the IPO. You know, the stock is not doing very well. I don’t think that’s any surprise. What, from your seat on the inside, what is happening right now inside the company? I think we’re growing from being a startup to a real business, right? And at times that’s tough. And it’s, you know, it can be embarrassing at times as you kind of mature. I mean, I remember growing up as a teenager and the things that you do that, you know, you’re stupid and not proud of, but you come out stronger for it on the other side. And it kind of feels to me a little bit with Snap like we’ve gone through that a little bit. I think as we come out of this year, we’re going into Q4, and we’re going into 2019 in a really strong position. You know, you talk about the executive hires that have left, I think we’re really excited about some of the executive hires who’ve joined as well. You know, Tim Stone joined us from Amazon, Jerry Hunter joined us from Amazon as well. And they are just two examples. If you go back through and look at the kind of executive team that Evan’s formed here, I think every year it’s got stronger and stronger, and I’m really proud to be a part of that team. And I’m also really excited because I’m learning a lot from these people as well. I think it’s been well-publicized that Amazon is a business which is incredibly well-run and you know, Tim and Jerry — not Tom and Jerry, don’t confuse them — Tim and Jerry coming through from Amazon and bringing the kind of six-page document and the kind of strategic planning process and a lot of that operational excellence is great for me to learn from. I learned a lot of that when I was at News but it’s, I think just seeing it from a slightly different angle is always fascinating. And you know, I think the team that we’re building at Snap, it continues to get better and better year on year. And as I said, I’m excited to be a part of that. Yeah, I mentioned at the very beginning you’ve been, you’ve crossed that four-year threshold. Do you plan to stick around for awhile?The four-year threshold interests ... everyone talks about that.It’s when your stock vests, man. It’s when everyone makes their money and they’re ready to try something new. I know, but not everyone is here just for the stock. And you know, if you get to the end of the four years and you’re still being successful, then I think that the general understanding is that you get additional grants, etc. So the four years for me is irrelevant. Okay.I will be at Snap as long as I feel super excited about the company and as long as I feel super excited about what I’m doing day to day. And right now, you know, we’ve talked about some of that stuff today. Right now I’m having a blast and I’m excited about this stuff we’re launching towards the end of this year. Super excited. Okay. And two more questions. No one likes to talk about this, following the stock price of a publicly traded company when you work at it, but it also kind of makes a lot of noise. People like myself can’t stop talking about it. How do you do ... do you follow, I assume you follow the stock price, but how do you ignore that or not let it creep into your day-to-day? Or do you?So there’s a few things. Initially I would look at the stock price regularly. I think over time you realize that, you know, it’s a weird kind of voting machine. I can’t remember who said that, who said the quote about voting machine versus a weighing machine, but you kind of understand that that’s true, right? People are making assumptions on our business, analysts are writing reports, and you start to read these, and I read these reports and I don’t recognize the company they’re writing about a lot of the time. They’re making some pretty wild and often incorrect sort of judgements and guesses, if you like. So I think when you’re on the inside of a company and you know what’s happening day to day and you understand the long-term vision and the long-term outlook, it’s much easier than just being a blind outsider who looks at the stock price and it decides on whether a company’s doing badly or well. Yeah. The last question, because I’m getting eyes that I’ve held you much too long. You’ve mentioned a couple of Amazon execs who now work here. We had Scott Galloway on one of our podcasts the other day. He said, “Amazon’s going to buy Snap, in the next ...” I think he said five years or something. What do you think, should Amazon buy Snap? Should Amazon buy Snap?Yeah.I think Amazon is an incredible company. I think, you know, they don’t have a product like Snap, should they buy Snap? That’s not my decision to make. I think we feel really ... I think we feel better positioned than ever before to really grow out. Snapchat is the fastest way to communicate and also have a really strong premium content offering. We feel that, and you know, I’m so confident that that will be a really successful, big business. So I think this concept of acquisition is pretty irrelevant, actually, right now. Okay. Nick Bell, thank you so much for being on Recode Media. We appreciate it. Good to see you, Kurt, and thank you for coming in. Thank you.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}