{"id": "Facebook found its new public face: Former U.K. Deputy Prime Minister Nick Clegg", "paragraph": "Facebook has filled one of its most important executive roles: Nick Clegg, the former deputy prime minister in the U.K. under David Cameron, is joining Facebook to lead all communications and global policy. It’s an important job. Elliot Schrage, who has held that role inside Facebook for the past decade, was incredibly influential. He was a top adviser to Facebook’s top decision makers, CEO Mark Zuckerberg and COO Sheryl Sandberg, and help shaped Facebook’s response to a number of important crises, including Cambridge Analytica and issues of Russian election meddling. Clegg will be tasked with handling those kinds of challenges moving forward. He’s a rare outside hire for Facebook, which tends to fill its most important vacancies from within. Clegg’s experience in British and European politics will be key given the European Union seems much more interested and capable of regulating Facebook than U.S. politicians. Bringing in a former British politician is also a sign that Facebook sees potential European regulation as a major concern moving forward. “Facebook, WhatsApp, Messenger, Oculus and Instagram are at the heart of so many people’s everyday lives — but also at the heart of some of the most complex and difficult questions we face as a society,” Clegg wrong on Facebook Friday morning. “The privacy of the individual; the integrity of our democratic process; the tensions between local cultures and the global internet; the balance between free speech and prohibited content.“I believe that Facebook must continue to play a role in finding answers to those questions,” he continued. Clegg starts at Facebook on Monday, according to a company spokesperson. Facebook’s head of communications, Caryn Marooney, and its head of public policy, Joel Kaplan, will report to Clegg. Clegg, meanwhile, will report to Sandberg, as did Schrage. Here’s Sandberg’s Facebook post announcing Clegg’s hireI’m excited to announce that Nick Clegg is joining Facebook as VP, Global Affairs and Communications.\n\nHe is a...Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}