{"id": "Recode Daily: Facebook is obsessed with Stories — but the business isn’t there yet", "paragraph": "Stories is the most interesting and important product at Facebook — the feature, copied from Snapchat, has been a huge hit inside of Facebook’s apps, especially Instagram and WhatsApp. But can Facebook build a business around Stories? That was a big question that emerged yesterday during Facebook’s Q3 earnings call — an interesting and uncharacteristically transparent chat with investors, during which CEO Mark Zuckerberg name-dropped multiple competitors — a notable rarity — and admitted that Facebook has had trouble building a business around some of its core features, like video and private messaging. [Kurt Wagner / Recode][Want to get the Recode Daily in your inbox? Subscribe here.]  Apple showed off a completely redesigned iPad Pro with slimmer edges, Face ID but no home button, a USB-C port and far more powerful specs than its predecessor. The device comes in two screen sizes —11 inches, starting at $799; and 12.9 inches, starting at $999; here are some impressions from a hands-on demo. Apple also announced the first proper refresh of its mainstream MacBook Air laptop line in three years — and it comes in gold. The Mac mini also made a return at yesterday’s hardware event in Brooklyn, along with an updated Apple Pencil 2 stylus, and melancholic pop princess Lana Del Rey made a guest appearance. [Chris Welch / The Verge]More than 200 Google engineers are organizing a companywide walkout on Thursday to protest the tech giant’s alleged protection of employees accused of sexual misconduct, according to people familiar with the matter. The “women’s walk” demonstration comes after a news report last week profiled alleged misbehavior of executives at the company, including Google’s decision to give Android creator Andy Rubin a reported $90 million exit package in 2014 following sexual misconduct allegations. [Caroline O’Donovan and Ryan Mac / BuzzFeed News]Intel announced an internal milestone in its push for a more diverse workforce: It has achieved “full representation.” But that doesn’t mean it has reached gender or racial equality — instead, the company says, its workforce now reflects the available talent pool: Roughly 27 percent female, 9.2 percent Hispanic and slightly under 5 percent African American. Those numbers lag well behind the overall population as well as the workforce at large, but Intel says hitting this goal is a first step toward achieving broader diversity. [Yoree Koh / The Wall Street Journal]Tesla is being sued by a Model S driver who was injured in a crash in Florida. The driver claims that the company misled consumers about the safety of its Autopilot driver-assistance system; the lawsuit, which comes after a series of accidents involving Autopilot earlier this year, alleges that the company’s system poses “an inordinately high risk of high-speed collisions.” Tesla said that it has no reason to believe Autopilot malfunctioned or operated other than as designed, and that it provides clear instructions regarding the capabilities of the system. [Dana Hull / Bloomberg]A year after Twitter doubled the possible length of its tweets from 140 to 280 characters, the average tweet is now 33 characters — one fewer than before the change. Just 5 percent of tweets are longer than 190 characters. For users who still want to post longer thoughts, Twitter has improved the ability to create so-called “tweetstorms,” or sequences of connected tweets. [Kia Kokalitcheva / Axios]Amazon has stepped into new territory, releasing its first bottling of a Scotch whisky that can’t be found elsewhere. Bowmore is known for its high-end releases, and Amazon is selling a 19-year-old whisky aged entirely in red wine casks (casks that hold 225 liters) from Chateau Legrange, a red wine from Bordeaux. This is no coincidence: Both Legrange and Bowmore are owned by Japanese drinks giants Suntory. In addition to the $153 Bowmore inaugural release, Amazon is the main online retailer for Johnnie Walker’s recent “Game of Thrones”-themed blend. [Felipe Schrieberg / Forbes]Everything that matters from Apple’s iPad and Mac event in Brooklyn. Meet the new iPad Pro and MacBook Air. [Dan Frommer]Are vampires cancelled?Spookiest charts of 2018.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}