{"id": "Twitter co-founder Ev Williams says in retrospect that showing how many followers you have wasn’t ‘healthy’", "paragraph": "Twitter today has a health problem. And one of its first CEOs has a few ideas about some early decisions that caused it.Ev Williams, a Twitter co-founder and board member, said that, in retrospect, it wasn’t a great idea for Twitter to show follower counts on user’s profiles. The same goes for the Suggested User List, a project that Williams was highly critical of when he was CEO.“I think showing follower counts was probably ultimately detrimental,” Williams said at the Web Summit in Lisbon, Portugal. “It really put in your face that the game was popularity.”Williams’s comments are revealing since they come at a time when the current CEO, Jack Dorsey, is trying to measure the “health” of his platform. Dorsey himself has said that follower counts can give users a negative incentive, though he has yet to float removing those from the site entirely.But follower counts were a huge reason why Twitter succeeded in the early days, Williams acknowledged. He recalled his appearance on “The Oprah Winfrey Show” in 2009 when there was a highly publicized race between CNN and Ashton Kutcher to have the first Twitter account with a million followers.“That’s the most amazing publicity of all time. So it’s easy to say in retrospect — today — maybe we shouldn’t have follower counts,” Williams said. “A lot of these things drove growth, and if we hadn’t had them, maybe someone else would have done them and built a much more dominant platform.“But today that’s not necessarily healthy.”The “worst” product move, though, in Williams’s eyes, was the Suggested User List, which allowed new tweeters to automatically follow a list of accounts that Twitter thought would be a good starting point for people new to the service without the faintest idea of who to follow. That led to some accounts achieving massive early success without necessarily providing a ton of value to the new follower.“This was my fault,” Williams said. “Those weren’t really interest-based follows, and then someone who had grown their following organically compares themselves to them. It’s inauthentic.”Williams is now the CEO of a different content company, Medium, and has taken an interest in the state of journalism. He’s feeling pretty good about the way media companies are gravitating toward pay-for-content models, he said, but he’s not in a rush to pay for a media company himself a la Jeff Bezos or Marc Benioff.He admitted when asked, though, that he’s certainly given some thought to buying one.“Sure,” he said after a pause. “Who doesn’t think about buying media companies?”Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}