{"id": "Netflix will get ads, predicts The Trade Desk CEO Jeff Green ", "paragraph": "If you had a lot of money, you would pay for the privilege of not seeing ads, right?Sure, says Jeff Green, the CEO of the online advertising marketplace The Trade Desk. But most people around the world are willing to accept advertising as the price of free or cheaper media, and are getting “tapped out” on how many subscriptions they’ll pay for.“People are paying for cable and that cost has gone up,” Green said on the latest episode of Recode Media with Peter Kafka. “Then, people pay for HBO, because there’s so much great content on HBO, the content is the best it’s ever been. Showtime has made up for lost time and releasing a lot of great shows, so, okay, I sign up for that. Now, I sign up for Netflix. Now, I sign up for Showtime. They are tapped out on subscriptions, so when Hulu says, ‘Hey, we wanna give you an ad-funded option,’ they do it.”And Green believes Netflix will follow Hulu’s lead soon enough, offering a cheaper ad-supported option alongside its existing ad-free subscriptions, because it needs to compete with the free-by-default YouTube. And he told Recode’s Peter Kafka that he’s said as much to Netflix’s departing CFO David Wells (who sits on the board of The Trade Desk) and other executives at the company.“They’ve envied YouTube’s international reach for a very long time, where even less than two years ago, 80 percent of subscribers for Netflix were in the U.S.” Green said. “Our median household income’s at $50,000-ish, roughly, a year ... compare that to all the places where there’s growth in the world, which is also where advertisers are willing to pay ahead. I don’t think there’s any chance that they can catch up to YouTube, whose geographical distribution is exactly inverted, which is 80 percent comes from outside the U.S., unless they go ad-funded in the same way that YouTube is.”There’s a direct line between this notion and Green’s business, which connects ad agencies and brands with millions of advertising opportunities every second via computer-bought, or programmatic, ads. He said other media companies that are now chasing Netflix-style paywalls will still want to keep an advertising option around.“I honestly think this is the model for lots of publications, which is okay, if you wanna pay a premium to avoid the ads that’s fine,” Green said. “But the default will be to see ads, and most people would rather see, especially fewer, highly relevant ads, which is only possible through programmatic.”You can listen to Recode Media wherever you get your podcasts — including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a full transcript of Peter’s conversation with Jeff.This is Recode Media with Peter Kafka, and that is me. I’m part of the Vox Media Podcast Network. I’m here at Vox Media headquarters in New York City, and I’m here with Jeff Green, who is the CEO of The Trade Desk. Hello, Jeff.Hi, how’s it going?We were just ... It’s going well. We were saying we have not talked for a long time. We used to talk more frequently.It’s been about five years, maybe.Jeff was someone who used to explain how ad tech worked to me.That’s right, and I ...And at some point, I threw my hands up and said, “This is too complicated.”I was gonna say, I think I scared you off and made you say, “I don’t want to learn about this anymore.”I think I’m the dummy, though, because in the meantime, you went ahead and you were starting a business, I think, last time we talked.That’s right.The Trade Desk. Since then, you’ve taken it public.That’s right.And even though a lot of people probably aren’t familiar with it, if you’re in ad tech, if you’re buying and selling digital ads, you probably know about it. If you’re a Wall Street investor, you apparently love this thing.That’s right. Roughly our stock has gone up ... I mean, we IPO’d at $18 a share and we now trade at about $130 a share.I think I saw $117 this morning.Yeah, it’s bounced around a little bit in the recent months. But yeah.Something popped up in my feed earlier this summer; it said something something “Jeff Green ad tech billionaire.” I thought, “Wait, that Jeff Green? Really?” And I looked it up, I did the math, I think you’re maybe merely worth $800 million.Oh, that depends on the stock price at any day.But wow, I really should’ve paid closer attention to what you’re doing.Yeah. No comment on that.All right. It’s in the proxy, you can go ahead and do the math yourself.What I wanted you to do besides not talk about your personal wealth was give us a state of the state of the digital ad business. I think anyone who’s listening to this podcast understands that Google and Facebook own the lion’s share of that market; they gobble up more of it all the time, anyone who’s tried to sort of compete with them eventually fades away. There was this idea that Verizon/Oath was going to compete with them, a lot of people thought that wouldn’t work, and I think now that includes the people who run Verizon. But the premise of what you’re doing is you are competing with Google and Facebook.Yeah, but we’re not playing their game. I think the mistake that most companies have made in digital media is they take the Google/Facebook playbook and they just try to execute it themselves, and that’s super hard unless you’re backed by a quasi-monopoly in search, or social, or some other media. And especially in TV, that doesn’t exist.So we look at it very differently, which is it is a very big internet. And in broad strokes, since we were kids, media’s been fragmenting; you and I watched 13 TV stations when we were kids, now there’s 500. Reed Hastings says there will be effectively millions in the sense that content creators are just becoming more and more abundant. And as that happens, the idea that all of that is going to be controlled by one or two companies is similar to the debate I had in college where everybody was like, “Is the internet gonna be controlled by AOL? Because everybody seems to use them as their ISP.” It’s sort of ridiculous in my mind to think that those two companies would control everything. So what we do is we ...And even if they control the majority, right, that can leave a big chunk for someone like you to do well?Yeah, and we just think that things like Spotify has done so well, Pandora as well. But even things like great journalism, the New York Times, everything that’s happening in TV, every website isn’t going to be owned or monetized by Google. And as time marches on, more and more alternatives are created in the independent internet. And so what we say is you go to Google to buy Google.com, you go to Facebook to buy Facebook.com, and you come to us to buy all the rest, and the rest of it is way bigger than any one destination.So a lot of folks have made that pitch. We’ll talk about why it has been working for you and maybe hasn’t worked for other folks, but let’s explain in as close to plain English as we can what you guys do. I think that’s actually fairly simple; I mean, one of the problems with ad tech is that there’s a million acronyms which make it hard to even approach.Yes.And then the entire ecosystem is very complicated as well, but let’s try to break it down. So your clients are whom? Who is paying you money?So primarily our clients are agencies and sometimes brands, but primarily agencies. Generally, ad agencies, yeah, come to you and they want to buy ads.Yep. They’re in the business of buying ads. On the Internet.Any digital ads that are typically transacted over the internet, we give them access to, with the exception of Facebook and Google.Right. So if they want to place an ad on, I don’t know ... I don’t know if you can place an ad on Vox Media, but in theory, they would do that. And they often have their own systems that are supposed to do this, or at least they spend a lot of money trying to create these systems that were supposed to do this.Yeah, not really. Not for programmatic or data-driven buys; they’re dependent on companies like ours. And so we rep every major holding company in the world and do a significant amount of business. We highlighted that in 2017, more than 50 percent of the S&P 500 spent at least $1 million each with us.So you’ve got access to this just giant world of digital ad inventory and you match up your buyers with a seller.That’s right.You do it with computers, it happens incredibly fast. They’re generally asking for things like ... They’re not saying, “I want to advertise on Vox.com,” they’re saying, “I want a certain kind of buyer in the market for this kind of thing with these kind of attributes.”That’s right. That’s exactly right. So said another way, when you take all the websites in the world that are not Google and Facebook, there ends up being about nine million ad opportunities every single second. And so all of those are optimally monetized by essentially running an auction that lasts one tenth of a second. So every second, we’re participating in nine million auctions, and then on behalf of that majority of the S&P 500 and their agencies, we’re essentially saying okay, of those nine million, BMW needs to buy 117 of them, and P&G needs to buy 211 of them, and which ones should we buy? And it would be silly to just say, “Hey, we just want this user or we just want this site,” but to actually look across all those vectors. And sometimes you use [a] site as a proxy for what your audience looks like, and other times you’re actually using data about that audience, so you say, “Oh, these are all the people in market for a car,” or whatever.And this business is working well for you. You did $300 million in revenue last year, you’re on track for $464 million this year.Yeah. You know, roughly grew at 50 percent in $5 billion market cap company with 30 percent dividend margins, so meaningfully profitable with very few public companies with growth like ours.So this is programmatic advertising, right? So you’re buying ... With the aid of computers in general ... It can mean different things, but generally you’re using computer-assisted buying to buy people, not publications, essentially.That’s right.And for years I watched this, and it was generally through the lens of publishers who saw this coming and said, “This is terrible. What’s gonna happen as we charge a premium for the front page of this site or that site?” And what you’re gonna do is strip all of that out. And then if you talk to the ad tech guys publicly, they’d say, “No no no. We’re gonna find under-monetized inventory, and that’s much more valuable than people think.” Privately, they would say, “Absolutely. We are gonna strip out this margin that the New York Times or Time, Inc. or a BuzzFeed, or a Vox Media is charging,” because people want the audience; they don’t care where they find the audience.Yeah, so maybe it’s worth going back to ... You know, I sold an ad exchange, a different business, to Microsoft, and was a part of the strategy team at Microsoft, and lived through ...That was back when Microsoft thought they might want to be in the advertising business.Yeah, that’s right. Back when they were convinced they could win that space.This was back when they were interested in buying Yahoo.Exactly.They spent billions of dollars on digital advertising stuff, which they eventually just totally walked away from.Exactly, wrote off the $6 billion acquisition of aQuantive. They made some big moves, and they made also some big mistakes.But in that time, Yahoo and Microsoft had lots and lots of internal discussions about do we want to live in a programmatic world? Because essentially, what programmatic does so well is provide price discovery, and by price discovery, just for those of us that don’t remember economics class in college, that’s just the process where we enable people to understand the value of anything that’s being transacted; so do I know what’s in it? Like mortgage-backed securities struggled with price discovery, and that creates an anemic market where you ...What am I buying and who are the potential buyers and sellers?Exactly. And advertising has always struggled with that just because of the nature of what’s being transacted. What exactly am I buying? Am I buying an audience, am I buying an ad, am I buying a publication? Like what is all the metadata I need to actually assign value to it? And what Yahoo and Microsoft were struggling with 10 years ago was the question of, do we really want price discovery? Because what happens is our sales people go out and pound the pavement, they tell a great story, and they convince people to buy our ads for a $10 CPM. If we gave away all that metadata so people could then assign their own value, what happens if they come up with a value of $1.50?Right.And in the middle of all that, you’re right, there are a whole bunch of people who were informed but not objective telling all of them, “No, this is great!” or “No, this is horrible!” And all sides of it were weighing in, but you fast-forward 10 years and basically, the question has been answered.It’s been answered by computers.By the market.The market and computers have said, “This is happening.”And publishers. So perhaps, Yahoo and Microsoft were, number one, asking the wrong question, which was, instead of saying do we want to live in a programmatic world where price discovery happens, they should’ve been asking the question, “Can we stop it?” Because I think if they would’ve spent more time focused on that, they would’ve realized that they couldn’t, especially because Google, who didn’t have a rate card to protect back then, accelerated the adoption and promotion of programmatic advertising.And then, when you get price discovery, which is what great markets do ... That’s what the stock market does, that’s what the solution to the mortgage-backed securities problem is, is enable price discovery. “Okay, I don’t know what’s in that mortgage-backed security or that product that was bundled all together, so let’s break it into pieces, let’s get all the data so that I can actually assign value.” That’s exactly what’s happened to advertising over the last 10 years, and it turns out that when you apply data to advertising, it’s way more effective than when you just buy it or transact using educated guessing, which is the way that the majority of the $700 billion in advertising is transacted.I don’t know why you’re knocking educated guessing; we love educated guessing. It helps provide advertising for this fine podcast. We’re gonna hear from a sponsor right now. We’ll be right back with Jeff Green.[ad]I was kidding but not kidding about how relatively ... Well, how really undeveloped podcast advertising is. We know next to nothing about the people who are listening. I sort of hear anecdotally from people who listen; thank you for telling me you listen. And I’ve got a hunch about who’s listening, and there are real problems with that. I really have only a vague idea of what people want and what to give them. It’s also very freeing, because without the data, I can just sort of go ahead and make something I like, and the market isn’t telling me otherwise. And there’s a lot of folks who, when they talk about what’s going to happen to podcast advertising ... It’s like “obviously we’re going to add programmatic,” and to me that seems like not a good thing. I get why it’s efficient for advertisers. It seems like inevitably you’re going to end up with what you see on the web, which is lots and lots of crappy ads. I know that programmatic doesn’t have to result in crappy ads, but it seems like it inevitably does.Yeah, I don’t think so. You and I disagree on that. So I think programmatic ads is the solution to the crappy ads. All the crappy ads are a byproduct of not being coordinated and not being data-driven. And digital and programmatic are not the same thing, and programmatic at its best uses a universal ID that you can then coordinate to all the data that comes from all ...We know, not “Jeff,” but someone who has many of Jeff’s characteristics.An anonymized ID. User A.Right, is consuming this media; would you like to reach him?Yeah. And let me tell you things about Jeff: He listens to this podcast, he also goes to Spotify 17 times a day, he also spends a lot of time on Yahoo Finance. There’s a bunch of insights about User A that can help us identify what sort of content we should put in front of him.But for years, I’ve been hearing about this targeted advertising, and man, I just keep getting tons of ads that either I’ve seen, or I’ve been to Zappos and I’ve bought the shoes and they’re still chasing after me, or someone in my house used a computer and Googled something I’m not interested in but their IP address shows up there. And it’s well over a decade I’ve been hearing about the marvels of targeted advertising, what it’s gonna deliver, and that’s just on the web, let alone TV or anything else that has yet to come. It seems like this stuff doesn’t really deliver what we’re hearing it’s going to deliver.It’s just been slow. So of the $700 billion ... So first of all, the size of advertising is massive, and transforming that takes some time. And especially because ... You know, people have tried to give Google and Facebook a lot of credit for fixing all of digital advertising, or for being the Holy Grail of advertising; really they’ve focused on monetizing their own destinations, and they’ve actually made it much harder to be coordinated on all the rest of it. And then on the rest of it, there have been a whole bunch of companies with bad business models, most of which have gone away in the last few years, but a lot of them are sort of limping along, and those perpetuate some of the problems.Back to Google and Facebook, how do they make it harder for advertising to succeed on the rest of ... Other than the fact that they make their own sites so attractive?Well, so one, I would ... Yeah, well I’ll come back to the making it attractive. But the reason they make it harder is because Google and Facebook will say ... So let’s say that you wanted to show 20 ads to one user, so we’ll go back to User A; you want to show 20 ads to me. And then in digital you say, “Okay, I’m gonna give eight to Facebook and I’m gonna give eight to Google, and then I’m gonna spend four on all the rest.” When you give those eight to Google and Facebook, if you say, “Hey, I want to then know which user, to User A, I showed those to and I want to get a report as to how many ads I actually showed,” all you can do is pass to Google or Facebook, “Hey, I know these users.” And if you don’t, then you’re reliant on them to track them, show the right ads to them. But when you then say, “Okay, which users did you show them to? Can you give me a report?” they won’t. They can, but they won’t give you a report about any user so that you could then take it over to Google ...Is that for competitive reasons? Or will they say that’s for privacy reasons because they don’t actually track the user, we don’t actually sell their data … ?The short answer is it’s both. Forget about what they’ll tell you; the short answer is it’s both. So they don’t want to make it possible for you to take the users from Facebook over to Google. And privacy’s a legitimate reason for them to say that because they don’t want you to take Facebook users, but even if you brought the users to them and said, “I told you it was User A,” they can’t give you a report back.So that means you’re gonna bombard them with ads on Facebook and not know how many you showed them, and you’re not gonna know that User A on Facebook is the same as User Z on Google, and that’s the same as User M on the independent internet. And so those can’t be coordinated at all.Let me go back to something I was talking about before the first ad-supported break, this idea that programmatic is inevitable; people tried to hold it off forever, it showed up. There are lots of people who have been struggling to keep publishing ad-supported publications, and they often point to programmatic as the culprit. Do you think that is accurate, and do you think it’s fair? They’re two different questions.Yeah, I don’t think it’s either accurate or fair. I’m saying my revenue’s been declining for this many years, and it is because of programmatic/Facebook/Google that the revenue I used to be able to generate, I no longer can because the market is taking it away from me.Yeah, so I think the paradigm has shifted from that for any publisher who’s informed about the way monetization works today. It does require active involvement as a publisher. I believe this is super important for the future of journalism. It doesn’t mean that every journalist needs to understand it, but somebody at each publication, to use your word, needs to understand how monetization works. That does require ... I believe the future of that depends on their ability to understand programmatic advertising. Because Google and Facebook — especially Google, where they have the AdSense-like program — they take really high margins from publishers. Those margins over time, in my view, and it’s hard to triangulate, have gone up. There’s this whole open internet where there’s forced competition among those. There’s these business models called ad exchanges or SSPs, supply-side platforms, that those businesses have struggled a lot over the last five years, and it’s because of competition. That’s great for publishers, because those businesses are competing head-to-head with each other, and their margins have been compressed.Their margins are going down, but you don’t hear publishers saying, “Boy, it’s great these guys are competing, because my revenue is going up. The amount of money I can charge per eyeball is going up.” They say the opposite. They say it’s going down. It’s grinding down. “The reason I’m laying off my sales force and replacing with programmatic is not because I want to, it’s because that’s all I can do.”I think there is this process of price discovery that is absolutely happening, and the only remedy to that is to actually layer data on top of it and not avoid the price discovery process. It’s back to that Yahoo-Microsoft debate. You can say, “It was great when we had a sales force pounding the pavement.” And for bigger publishers, I get the longing to be in yesterday.You like the old days. You liked it.Yeah, I get that inclination.Just like the record labels ...Like record labels. ... we can sell $15 CDs.It’s the same thing that CBS says when they’re looking at Netflix.I guess the thing ...But there is no way to stop ...The twinge is you have people with a self-inflated sense of worth, like myself, but it’s very common in media, right? Like, “We’re different, we should be protected. It’s important that the stuff we do finds some way to get out there.” Also, it does feel different to ... You know, because a news story is not a Milli Vanilli single.Yeah.Actually a lot more. Which is why, you know, I joke about this, but not really, about half the people who come in here and sit where you’re sitting are explaining to me their new subscription model, putting up a paywall. We’re recording is on a Wednesday, which means this week alone we’ve heard two different publications announce some sort of paywall subscription model that’s gonna augment what they’ve already got. And that’s them all basically saying, “Ads alone aren’t gonna support our business. We need to find a new revenue stream.” Right now, everyone is just lurching into subscriptions. You can argue that a subscription itself is a good idea for a business model, but they’re not doing it, again, because they want to. They’re doing it because the ad business is evaporating.I don’t think that’s true at all. Again, with 700 billion, if you just take current growth rates, marching towards a trillion dollar industry ...You’re talking about the overall market, right? But these publishers that used to command revenue of X are now 50 percent of X.If you look at public statements that Hulu has made ... So, Hulu is such an amazing case study. Spotify’s another great case study, which is when you go to consumers and you say, you can either see the ads or you can pay more for the subscription. In both cases, between 75 percent and 80 percent of consumers say show me the ads. That’s astonishing. I still ...And Hulu makes more money off of the ad-funded model than they do off of subscription. I still have a sneaking suspicion that Hulu, because of its ownership structure, and we’ll see what happens as that changes, has a vested interest in keeping the ad model going, right? ‘Cause they’re all the TV guys, and they still live in a world where TV ads really matter a lot, and if they were selling an ad-free service, it’d be difficult for them to justify the conventional service they’re selling. I just sense they aren’t entirely enthusiastic about the ad-free model.I think you’re giving them too much credit for being cunning. I think everybody’s going where they can make money, and the rising cost of content is making everybody say, “What is the best way to monetize?” I think if you look at the way that YouTube has done, and especially, I mean, you look at the moves that even Netflix is making this week, in the sense that they’re trying to go to international markets where household incomes are quite low. I mean, you look at what we’ve experienced in connected TV. The growth that we’ve seen in ad-funded connected TV is something I don’t think we’ve ever seen before and will never see again. It is so amazing to see how ...From zero.From zero, four years ago, to where we are today. So, I mean, just a couple numbers: In Q4 last year, we reported that year over year, connected TV inventory went up by 10X. In Q1 this year, we said the connected TV spend on our platform went up by 2,100 percent. Q1 this year over Q1 last year. So, to go to that base, and then this quarter most recently, we reported that connected TV spend went up 10X again. All of that is ad-funded, and it’s largely because of cord cutting and, especially, in our view, it’s the subscription model is tapped out in the sense that, okay, people are paying for cable and that cost has gone up. Then, people pay for HBO, because there’s so much great content on HBO, the content is the best it’s ever been. Showtime has made up for lost time and is releasing a lot of great shows, so, okay, I sign up for that. Now, I sign up for Netflix. Now, I sign up for Showtime. They are tapped out on subscriptions, so when Hulu says, “Hey, we wanna give you an ad-funded option,” they do it. Because David Wells is ...You know, we had Anthony Wood from Roku in here a little while ago, and again, he’s talking his book ‘cause this is his business, but he says, the major search on Roku was free movies. “Where do I get free something something,” so they’ve got a channel where it says that. And 70 percent of their revenue is ad revenue.Right. From where I sit, the people I talk to, whenever we can opt out of ads, we do it. And Netflix is 150, 170 million people all watching stuff without ads. That seems crazy to imagine that people are gonna accept ads once you got a widely distributed service where you don’t have to watch them. But Anthony and you and other folks say there’s a lot of people who will tolerate it, either because the money’s important to them or they’re not that offended by ads or they’re used to it or some combination of it.Yeah, so I was just about to mention that David Wells, the CFO of Netflix, is on our board. We talk about this concept all the time, and I have said to him, “I believe that it’s inevitable that you have an ad offering.”At Netflix?At Netflix. He’s no longer the CFO of Netflix.Yeah, that’s right. Soon, he will not be. But I do believe, and I’ve said it to multiple C-levels at Netflix, that I do believe that it’s inevitable that ... I mean, I think they’ll always have the premium offering where if you want to avoid them, you can, but they’ve envied YouTube’s international reach for a very long time, where even less than two years ago, 80 percent of subscribers for Netflix were in the U.S. When you look at our median household income’s at $50,000-ish, roughly, a year ... compare that to all the places where there’s growth in the world, which is also where advertisers are willing to pay ahead. I don’t think there any chance that they can catch up to YouTube, whose geographical distribution is exactly inverted, which is 80 percent comes from outside the U.S., unless they go ad-funded in the same way that YouTube is. So, I think that a few years from now, the same way that they’ve stratified their pricing and given lots of options, I honestly think this is the model for lots of publications, which is, okay, if you wanna pay a premium to avoid the ads that’s fine, but the default will be to see ads, and most people would rather see, especially fewer highly relevant ads, which is only possible through programmatic. So, the people you’ve been talking to all have massive scale, or on their way to massive scale. Google and Facebook have, obviously, massive scale. YouTube has massive scale. One thing that Google and Facebook, YouTube, Twitter to a lesser degree, have all dealt with over the last couple of years is, we have these things that are massive. They’re built to sort of work on their own. People upload their information, advertisers plug in their information, lots of stuff sort of happens mechanically, and then oops. We’ve got content that we’re not happy with or advertisers end up next to content they’re not happy with, and we’re gonna try to solve this with a combination of humans and computers, but boy, it’s really hard. It seems to me that the common connection there is they’ve all built these massive things that are, no matter how diligent they are, really impossible to properly vet. So, you’re always going to end up, unless you just really, really ... if you cut off most of your market and just whitelist a handful of things, you’re always gonna end up with a chance that Tide is gonna end up next to some horrible racist video. I assume you guys have that same problem, which is you can only guarantee advertisers up to a certain point that they’re gonna have what we call brand safety.Yeah. So, you are right. You can never give anybody the assurance that nothing bad’s gonna happen.But you could with a newspaper or a TV advertisement.I don’t know. I mean ...Pretty close.You watch an ad like a kid playing soccer and you didn’t realize that you were running in the “Criminal Minds” episode where the kid was kidnapped while playing soccer.But generally, you do. You know, and they would say we don’t wanna be near news. I worked at Forbes, and I remember we had to take down an ad that had a plane in it ‘cause it came after 9/11, and it was manual and you could say, “We don’t wanna be near that.”Exactly.But that’s the point. So, these were all manual, you knew exactly how many slots you had during “Criminal Minds,” and you knew who was gonna advertise.Yeah, but you still had to run a manual process, and people still called and yelled at you and you had to do crazy make-goods to fix all those sorts of things. So, will there still be problems? Of course. But the technology that we can apply to create brand safety and, of course, augment that human judgment, where before that was based on human judgment and there was spray and pray.’Cause you were talking about what? Nine million or nine billion impressions?Nine million a second.Nine million, these are bids or ad impressions campaigns?Ad impression opportunities.Right. So, I can’t possibly vet those. Right? You can try to do your best to sort of sort ...Yeah, but you know what sites they’re coming from, you know what suppliers they’re coming from. I mean, to me, the biggest reason why there were fewer complaints 20 years ago is because the tracking was so bad that you didn’t actually know where it ran. So it isn’t that there was worse content, it’s just that you couldn’t track it as easily. Oh, this reminds me. I’ve always wanted to ask someone, at least on air, why this happens. So, I’m on my iPhone, which has pretty good safety, and I click on a link, it’s from a reputable site and it’s to another reputable site, and I get there and up pops this fake Amazon ad saying “You’ve won” or whatever. It’s impossible to back out of it. I know that it’s not Amazon. I get out of it, but inevitably this is because it’s a bug inserted into someone’s programmatic advertising, and people who don’t know better go, “Why does Amazon have these lousy ads?” Why do I see these ads in 2018?Yeah, so to be clear, we don’t have anything to do with those ads. We don’t run those. Those are fraudulent.Right. No one wants to run those ads, but they show up. Yeah, so the way that those run, it’s, essentially, Adware or somebody makes a bunch of money by inserting that into an app, typically. So, at one of those times when you trusted somebody to download an app and said yes, I’ll give you access to my phone, they then use that to put this fake ad in front of you saying, “Hey, we need you to enter your Apple gift card.”This is I’m on Twitter or Facebook or wherever, any reputable site, and I click on it, and I’m going to reputable site B, and it pops up. I’m assuming it pops up because of one of the programmatic slots that they’re selling that they don’t know what’s actually going through their site.Most typically, it’s not because Facebook enabled this. It’d because of one of the people that Facebook or somebody else has ...Let’s say it’s a Vox Media, for instance. I’m sure Vox Media’s had these problems in the past.But what happens is somebody that Vox is associated with, or any of these companies is associated with, it’s one click or sometimes two clicks removed. They are not reputable, and then they put an ad in front of you, basically, taking over your phone or getting access to that app so that they can put this in front of you, and hopefully, trick you into giving your ...Right. And from what I understand — I’m sort of answering my own question, it seems — I mean, this is, like you said, it’s malware. No one wants this. It’s the same thing as getting spam in my email, but it’s basically whack-a-mole. Like, you can try diligently to track this stuff down, but since you really ... ‘cause you’re not controlling the ads that show up on your site very often, right? ‘Cause it’s done automatically, and that you can’t possible vet everything that’s coming through so you end up with bugs like this.But no, so it’s not ... I mean, it all depends on where you accept demand from. I don’t know much about it, because we don’t power advertisers like this, so we wouldn’t be the ones to help them get on any site or anything like that. Then, most often, it’s somebody who has installed their own app, and then they’re the ones controlling the ad as well, ‘cause they have to control both the supply and the demand or else they would get shut down. ‘Cause if Vox knew what they were doing, they would turn it off.Right, and eventually, they will go turn it off once they track it down, but a human being has to go track ... someone has to report it.That’s right.A human being has to go find it. Inevitably, these guys have moved on, and they’re working in ... It’s very cheap for them to do this, the same way it’s cheap to send you Viagra ads. Yeah, so really, what has to happen is, companies have to be super diligent about making certain that those ads don’t run. Yeah, I guess what I’m really getting at is it just seems like so much scale and so much automation. There’s gonna be a limit to what you can do to make sure that, whether it’s malicious stuff, whether it’s literally just Zappos just spamming me, right? They know I’ve been to their site, but it’s apparently too much work for them to figure out that I actually bought the shoes, so they’re just gonna keep hammering me with the shoe ad, and it costs them fractions of a penny to send that out. I lose ‘cause I don’t like seeing that ad. It seems like, inevitably, the whole ecosystem loses, because they’re making ads less relevant.That’s right.But Amazon/Zappos is acting rationally by just ... on the off chance that I didn’t buy the shoe, why not make sure I can see it again?That’s right, and that’s much more relevant to our world, ‘cause we will power brands like that. What we’re trying to help them do, and this is part of the reason why the rest of the open internet is so important, and why more and more advertisers are saying to us, “We would rather spend our first dollars on this open internet and then give the leftovers to Google and Facebook, because I get to track holistically in that world, and then I know I’m not bombarding it.” Because it’s that fragmented world of User A and User M and User Z are all the same. When you add a whole bunch of other ways to buy, like Snap and Pinterest and all these sort of walled gardens — Roku — all of these are sort of closed ecosystems where you get a new sense of a user in each of those. When they’re not coordinated at all, then the advertiser can’t control how much they bombard you. This is, actually, I think the biggest problem in advertising today, is coordinating that so that buyers can buy holistically, because they don’t want to spend billions of dollars to make you hate them. But in aggregate, that’s exactly what they’re doing. And so we work with the biggest advertisers in the world to be better coordinated about it, so they’re making data-driven choices so that you love them, because advertising was really about winning hearts and minds, not just about navigation and certainly not about tricking you.We keep circling around the Facebook and Google question, so I get why you want someone to spend money away from Facebook and Google, and I get why a lot of advertisers either say and/or believe that they would be better off supporting an ecosystem that isn’t dominated by two people. But inevitably, they’re not going to give you money just out of good will or some sort of aspiration.Of course.So what is the real-world pitch that is getting them to spend money with you instead of with Google or Facebook?So often, advertisers are taking their data, which is the most valuable data to them, and they’re being asked by walled gardens like Google and Facebook to put their data in their ecosystem, and because those companies control massive amounts of media, it enables them to raise prices on the media that they’re buying, and then they don’t get any report back. So more and more advertisers, especially big, sophisticated, data-driven advertisers, are frustrated by the asymmetry of that partnership. And they are more committed to using their data in a safe and consumer-friendly way so that they can then do the right thing and actually spend billions to make consumers love them instead of spending billions to annoy them or frustrate them.But on the other hand, right, the reason Google and Facebook are so dominant is in part, if not entirely, because they are such good advertising solutions, right? Google. Google knows what you’re looking for. Facebook knows a ton about you. Google does, as well. People aren’t spending with Google or Facebook because they’re lazy, right? They’re getting results. The same savvy buyers are buying on Facebook for a reason.Well, so those companies are big enough that even savvy buyers have to spend some amount of money with them. There’s no question of that, but much of their growth, and you said if not entirely because of their efficiency, or whatever. I actually think we’ve given them a lot of credit for efficacy, when in truth they deserve a lot of credit for easy. So Facebook has done an amazing job of making it possible to spend money in 90 seconds on their platform. It is super easy to get started, and again, you give them data, you give them creative, and then they’ll take that and run with it. But more and more advertisers want more control and they want a more symmetrical relationship, and I think there’s even an argument to be made that what, especially, Google has done is not really advertising in terms of their cash cow, which is titles and descriptions. Those don’t win hearts and minds. I’ve never read a text link and said, “Oh, I love this company.” Instead it’s navigation, and that’s valuable, and we pay for it, and I believe in them as a company. I don’t believe that they’ll ever be dethroned as the king of search. I totally get the value of it, but in terms of the process of winning hearts and minds, the thing that those two companies have done better than anybody is, No. 1, easy. It’s not about efficacy. It’s about easy. And then the No. 2 thing that they’ve done super well is they’ve taken credit for all of advertising when in fact, in many cases, they’re not even advertising. And what I mean by this is they say at Mercedes-Benz it takes 20 years to be a Mercedes-Benz owner. They show you ads for 20 years. At the end of that, you type in “buy Mercedes-Benz.” It takes you to local dealership. You click on the link, and then you say, “Thank God for Google,” and Google says, “We did that.” And they’ve done an amazing job of convincing people that they did that when they were just one part of the funnel.One company we haven’t spent much time talking about is Amazon. We’ve been hearing for years Amazon’s coming into advertising. They’re coming into advertising, and we keep hearing it now, and now there’s a significant amount of money being spent on Amazon. Do you look at them as a competitor to Google and Facebook? Are they a competitor to you, or are they in another category?Yeah, so I mentioned earlier that I don’t really compete with Google in the sense that ...You just spent a long time explaining why someone should buy with you instead of Google.Well yeah, but Google runs a search engine, right? And they’ve done that super well. I would never try to build a search engine. I had this argument at Microsoft, where I just didn’t think that we would win.You’re competing for advertising dollars with them.Yeah, I want as much of that $700 billion pie as anybody, but there will be a channel that’s going to do great forever, which is search. Whether that’s advertising or not, it’s going to come out of that advertising pie. And Google, I think, for as long as I can see in the future is going to get a share of that. But I think the stuff that’s most on sale and the most undervalued and the biggest opportunity for advertisers is in the open internet, which isn’t easy to get to. So in that sense, I do compete against Google, but I don’t run a search engine. I don’t have a space program. I don’t have self-driving cars. I don’t lay fiber in the Pacific Ocean. And the thing that is really interesting about Amazon is that they sell sponsored listings that are mostly connected to search, and you can make the argument that they’re the second-largest search engine in America and that they are absolutely competing with Google’s No. 1 priority. I compete with Google’s No. 47 priority, which is their DSP that ...Their display ads.Well, not display, because display is less than 30 percent of my business. Forty-six percent of my business comes from mobile. Connected TV and video is about the same as what display is for me. So I’m not competing with Google on display, but I am competing with their DSP business.But so you think Amazon is a threat to Google but not a threat to your business.Yeah. I think Amazon’s primary focus and where all the surge in their advertising dollars has come from is from them monetizing Amazon.com, largely as a search engine.To people who are already selling stuff on amazon.com generally.Exactly. And they’ve done super well, and it’s a huge opportunity.I think if you said, “Well, these are slotting fees,” right? Because that’s kind of what they are, right? They’re paying to get their stuff in front of someone who’s coming in to shop, that becomes a less sexy story, but maybe a more accurate one. Yeah, so and slotting fees, you could make the argument that it’s the new end cap, that they’re trying to compete with what the end cap was at Walmart 15 years ago. You could also make the argument that it’s sponsored listings that compete with high-ranked keywords on Google. I think both of those are legitimate arguments. It’s hard to make the argument that it’s an objective omnichannel DSP. That’s not really what they’re doing.I don’t want to try to unpack “omnichannel DSP.” I do want to ask you about ... This will involve acronyms, but GDPR, let’s just call it regulation.All right. You want to avoid omnichannel but we’re going to go to GDPR.Let’s talk about regulation. There’s an overall push. There’s a bunch of digital advertising regulation went into effect this spring in Europe, but it affects American companies, and there is now constant talk about more regulation coming, whether it’s realistic or not. How does that affect your business?So GDPR has been actually fantastic for out business, and it’s in part because we’ve been privacy-centric from the very beginning, and we also have this luxury of only transacting in anonymous data, so back to our Users A and M and Z. We only take benign behaviors and connect those to anonymous IDs. We don’t gather data or have to manage data the way that Google does through a search engine, where you basically give them every detail about your life. So when every health condition you’ve ever had you enter into Google, or every political opinion you’ve ever had you type into Facebook, those sorts of things never get transacted with The Trade Desk and certainly not correlated to directly identifiable information.See, I mean, those things are really meant to, in large part, sort of slow down Google and Facebook.Well, I think it’s meant to ... In broad strokes, what GDPR is after is very noble, which is to ask that ecosystem to better explain the quid pro quo of the internet, which is that you get free content in exchange for seeing ads and sharing some amount of data.And we would like, in theory, it’s built on this idea that you, the consumer, or the reader, whatever it is, you’re going to opt in. You’re going to raise your hand and say, “I want in on this.” That’s exactly right. The reality, you get this pop-up thing and it says, “Click this so you can keep reading,” and you click it ...Yeah, or yeah, “Read this 74-page EULA and we’ll explain clearly.”It’s marginally better than where it used to be, which was there is no chance to opt in and you could raise your hand and opt out, but you had to find the little click mark on the ad. No real person ever did it. Lots of people bought ad blockers or got ad blockers as a response, but they didn’t actually click out. But anyway, that doesn’t affect your business.No, so because of the fact that we have always been transacting in a way that’s compliant with GDPR, it wasn’t a big change for us. And as a result, as companies have shied away from those who they’re less sure of, and in some cases that includes Facebook, dollars have moved over to us. So Germany for us, which is sort of in the middle of the GDPR debate, grew last quarter for us, 200 percent over Q3. We’ve been in that market for four years. It’s a material increases as a result of just GDPR.Other big trends ... We talked about video broadly, but lots of folks trying to do what Netflix and Hulu are doing, which is sell you something direct to the consumer. Disney will launch something next year. I’m assuming that you’re hoping to partake in that burst of new people selling stuff directly to consumers. You think there’s a role for you in there?Yeah, so in all those numbers I was sharing earlier on just the huge success that connected TV has been for us, that is where it’s coming from.So that’s already happening.Yeah, so the first group that we had lots of success with was virtual MVPDs, because as those are competing with each other’s ...The Slings of the world.Yeah, exactly. And there’s dozens of others, and as they’re competing with each other they can’t afford to have salespeople pounding the pavement, so programmatic is the only way for them to get ads with reasonable CPMs. And of course, as those become more data-driven it produces amazing CPMs so that they can actually sustain their business. And then, of course, lots of those come as skinny bundles. So there’s, of your 500 stations, there’s 15, 20 in there. That means the other 480 are working really hard to develop relationships directly with consumers, and in almost all cases we’re working with them so that we can be the primary source of demand.I feel like this is your pitch book now. So we’re explaining all the opportunities for you, and the last one would be China. Right? Yeah.Or a big one would be China.Yeah, China’s humongous, of course. Billion consumers. One of the things we think we’re in a really great position regarding is just the fact that we’re objective. So we’ve never played on the sell side, and so as a result we can partner with everybody in media. So there’s lots of people in TV, for instance, that say, “I never want to partner with Google or Facebook or Amazon, because I’m afraid of them, paying a tax forever.” So it’s the reason a lot of premium content has been resistant to monetize on YouTube. They’re just afraid of a tax.A tax, meaning?Meaning Google would take a share of that that is too high. So as a result of us not ever owning media, we can partner with Google, which we have.Because you’re not competing with them in the way that Google and Facebook inevitably do with some of their partners that have suppliers.That’s right. And then we can also partner with Fox, or we can also partner with Comcast. I also partner with AT&T.So explain the China connection.... but also partner with Baidu, Alibaba and Tencent at exactly the same time.In 2018 there’s a lot of saber-rattling between China and the U.S. Does that factor into sort of how you think that might go? Do you see a point where maybe you can’t do business in China? You’re based in Southern California.Yeah, so I moved to Hong Kong in March of this year.Oh, really?I’ve lived in Asia for the last six months, and it’s all about the opportunity in Asia. So during that time, we announced partnerships with Baidu, Alibaba and Tencent. We just announced our partnership with Tencent publicly earlier this week, and that includes all their video assets and things like iQiyi.So if you’re partnering with a Chinese company, you have to be approved, essentially, by the state there.That’s right.Do you feel like those deals are going to start raising flags in the U.S., and or that someone, especially now that you got the ... Well, who knows politically, but do you think that politically in the U.S. people might say, “We would like you to back off that business”?No. I personally think the world is way too big and integrated for that to be stopped, and I think the saber-rattling is ridiculous and bad for both economies.So you think at some point that both sides return to their corners and move on.Well, that’s assuming that leaders will be rational, which isn’t always the case.Tough. Tough case to make this week, or any week of the last year and a half.But because I believe those vectors are so huge, and because the opportunity and the dependence we have on the Chinese to manufacture and they have on us to spend, those two dependencies make it so we need each other desperately, and there’s not really anything that can stop them.Jeff, this is great. I was right. We should do this more often.Yes, we should.Either recorded or not. I don’t know that I learned everything I need to learn about ad tech, but I learned a lot, so thank you. We’ll have to do it again, then. It’s always a spirited discussion, and there’s so much to talk about.Thank you for coming.Thank you.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}