{"id": "New York City’s first Amazon Go cashierless store will open near the World Trade Center", "paragraph": "Amazon’s version of a futuristic 7-Eleven store is coming to New York City, and it’s going to be located inside a shopping and office complex across from the World Trade Center, Recode has learned. Amazon plans to unveil the cashierless convenience store inside Brookfield Place, formerly known as the World Financial Center, in Manhattan’s Battery Park City neighborhood. Brookfield Place has been the home of large corporations like American Express and Time Inc., as well as upscale stores such as Louis Vuitton, Gucci and Saks Fifth Avenue. It is situated along the Hudson River, directly across West Street from the World Trade Center.An Amazon spokeswoman declined to comment.Amazon Go stores utilize a combination of sensors, cameras and computer vision to automatically charge customers for items upon exit without them needing to stop and pay. Since the first Amazon Go store opened to the public on the ground floor of the company’s Seattle headquarters early this year, the concept has become the focus of much fascination in the retail industry, and the stores have even become a tourist destination.Amazon has so far opened three Amazon Go locations in Seattle and two in Chicago, with another on the way in the Windy City. The company had previously confirmed that it will open at least one location in San Francisco.Some of the stores, including the first Seattle location, feature prepared foods such as sandwiches and salads alongside a small selection of packaged groceries like soups and condiments. The original store also sells wine and beer.Others feature the prepared foods without the grocery selection, making them more akin to a sandwich chain like Pret a Manger. It is not known which format this New York City store will take. The Information previously reported that Amazon planned a Go store for New York City, but did not specify the location. Amazon believes that the convenience of the Amazon Go stores can differentiate them and make them destinations for busy working professionals during peak mealtimes. As such, it is not surprising that Amazon selected a New York City location that is at the center of several large office towers.This most recent development comes a month after Bloomberg reported that Amazon has discussed opening as many as 3,000 Amazon Go locations by 2021. Amazon executives have said repeatedly that they don’t have plans to use Amazon Go technology in the company’s Whole Foods stores but if they roll out thousands of standalone Go stores, the concept could revolutionize the brick-and-mortar world while disrupting one of the largest roles in the retail labor market: Cashiers.Recode previously reported that Amazon has also held talks with a top Los Angeles real estate developer about opening an Amazon Go store at the city’s outdoor shopping complex, The Grove. It is not clear if the two sides ever agreed to a deal.New York’s new Amazon Go store will sit adjacent to Brookfield Place’s Winter Garden atrium — a 10-story glass pavilion that was damaged in the terrorist attacks of September 11, 2001. The store will be positioned near the security desk in front of American Express’s office tower and near an Oliver Peoples eyewear store.Amazon already has an existing relationship with Brookfield Properties, the owner of Brookfield Place. The e-commerce giant announced last fall that it had signed a 15-year lease for 360,000 square feet of office space inside Brookfield’s 5 Manhattan West complex.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}