{"id": "SpaceX CEO Elon Musk endorses Trump’s ‘Space Force’ idea ", "paragraph": "Count the CEO of SpaceX as among the fans of the Trump administration’s proposed “Space Force.”Elon Musk sees a new branch of the U.S. Armed Forces as “obvious” as Americans travel far off the planet.“It’s basically defense in space. And then I think also it could be pretty helpful for maybe expanding our civilization,” Musk told Kara Swisher on a new episode of Recode Decode. “I do think it will become obvious over time that a Space Force is a sensible thing to do.”Donald Trump pitched the new military operation this year and hopes to have it running by 2020, bringing the military into conversation with space leaders like NASA and Musk’s SpaceX. It would sit alongside branches like the Army and the Air Force.Musk described the agency as similar to the Air Force, something he said was criticized as unnecessary when air wars were managed by the Army but which is now a specialized division.“And people today may not realize back then it was wildly panned as a ridiculous thing to create the Air Force, but now everyone’s like, ‘Obviously you should have an Air Force,’” Musk said. “And I think it’s gonna become obvious that we should have a Space Force, too.”Musk predicted that his support for the Space Force would be “a little controversial.” He has been a critic of Trump — he served on two White House business advisory councils, but quit after Trump withdrew from the Paris climate accord — but he did display some Trump-like rhetoric at one point in the conversation, when criticizing people on the left who don’t use electric cars.“It sort of blows my mind — all these social justice warriors driving around in diesel cars,” Musk said in an aside. “It’s outrageous.”You can listen to the entire conversation right now in the audio player below. If you prefer to listen on your phone, Recode Decode is available wherever you listen to podcasts — including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}