{"id": "Amazon’s booming ad business is both a blessing and a risk", "paragraph": "Amazon’s business unit that primarily consists of advertising revenue registered another booming quarter this summer, growing to nearly $2.5 billion in sales during the three-month period, as Amazon announced yesterday in its third-quarter results.The ad division’s fat profit margin — analysts estimate it could be as large as 75 percent — is a big reason why Amazon posted its largest quarterly profit ever in the third quarter. It’s also a big reason why the slowing growth of Amazon’s core online retail business isn’t a giant story in tech right now.But Amazon’s ad business, for all its glitz and hype, does not come without significant risk: Namely, that an over-reliance on ads will ruin the Amazon shopping experience.As my colleague Rani Molla chronicled recently, the top of search result pages on Amazon are increasingly stuffed with ads as well as custom placements hawking Amazon’s own brands. When searching on Amazon’s mobile app, it is not uncommon to have to scroll to a complete second screen to find the first search result that is not an ad.Her report also noted that nearly 8 percent of views on Amazon product pages came from sponsored links in May, more than double what it was a year earlier, according to data from the analytics firm Jumpshot,“They will need to pull back or they are going to see shoppers recede,” said Guru Hariharan, CEO of Boomerang Commerce, a startup that makes software tools to help brands grow their business on Amazon in an automated fashion through advertising and other methods. Hariharan worked for nearly six years at Amazon earlier in his career.On an earnings conference call today, an analyst asked Amazon Chief Financial Officer Brian Olsavsky whether the company’s shopping sites were fully saturated with ads.“As far as penetration, we don’t have that quantified for you,” Olsavsky said, “but we still believe that there is a lot of room to continue to improve the presentation of bringing to our customers new and more relevant purchase options.”Indeed.The brilliance of Amazon lies in its cold efficiency. Search, click, buy. Repeat.Not search, scroll, scroll, scroll, click, click, buy.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}