{"id": "Elon Musk on his year of costly tweets, journalist fights — and how it changed him", "paragraph": "Elon Musk makes no bones about it: He’s had the worst year of his career — “insanely painful” — and a lot of it is his own fault.“This year felt like five years of aging, frankly,” he said in an interview with Kara Swisher on a new episode of the Recode Decode podcast. “In fact, my brother said: ‘Look, if you do a self-inflicted wound, can you at least not twist the knife afterwards?’ You stabbed yourself in the leg. You don’t really need to twist it in your leg. Why do that?”Musk, who is the CEO of both Tesla and SpaceX, has been working 100- to 120-hour weeks and taking Ambien to help him fall asleep. But he pledged that he’s turned a corner after a year of production and financial troubles at Tesla, multiplying probes into his conduct and companies, and ill-fated tweets (often sent late at night) that spurred lawsuits and questions about his judgment.“I tweet interesting things pretty much as they come to me, and probably with not much of a filter,” he said. “I spend a lot less time on Twitter than people probably think. It’s like maybe 10-15 minutes or something.” “It feels like dipping into the flow of consciousness of society. That’s what it feels like. It’s kinda weird,” Musk added. “Some people use their hair to express themselves; I use Twitter.”You can listen to the entire conversation right now in the audio player below. If you prefer to listen on your phone, Recode Decode is available wherever you listen to podcasts — including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Musk said he’s dropped his workweek to about 80 to 90 hours — “pretty manageable” — and feels he has recovered, but he still displayed a somewhat thin skin when talking about his critics in the media.The Tesla CEO routinely fights publicly with reporters on — you guessed it — Twitter. At one point in the interview, he called some Wall Street Journal reporters “terrible people,” and said that some in the media are more akin to “ad salesmen.”“The amount of untruthful stuff that is written is unbelievable,” he said.Asked if that rhetoric was responsible given the aggressive rhetoric from the White House and amid escalating violence against reporters as recently as just last week, Musk would only say, “[I] suggest the press take it to heart and do better.”By the end of the interview, Musk was reflective, saying he did regret some of the fights he picked with reporters.“I’m sorry,” he offered, “to some journalists.”Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}