{"id": "Twitter is now consistently profitable", "paragraph": "It took Twitter more than a decade to become profitable, but now it seems like those profits are here to stay. Twitter reported its fourth straight profitable quarter on Thursday. The company’s net income was $789 million for the quarter, but a lot of that was attributed to a massive “one-time release of deferred tax asset valuation allowance,” which accounted for $683 million. If you take that out, Twitter’s net income was $106 million on $758 million in revenue, which was better than expected. In the past four quarters, Twitter’s net profit is just over $1 billion. In the four quarters prior, Twitter lost $367 million. It’s unclear how much other one-time items may have contributed to net profit in the past — Twitter doesn’t usually mention anything. So here’s another sign the business is improving: Twitter’s adjusted earnings were $295 million for the quarter, which were up 39 percent year-over-year.It was Twitter’s largest quarterly profit ever, and certainly a sign that the business — which has been somewhat disappointing in years past, thanks to the company’s user growth issues — has stabilized. Twitter also reported a loss of nine million monthly active users, a decline it had prepared Wall Street for. The company has said this decline in MAUs is mostly due to its efforts to clean up the “health” of the service, something CEO Jack Dorsey reiterated in a statement Thursday. “We’re achieving meaningful progress in our efforts to make Twitter a healthier and valuable everyday service,” Dorsey said. “We’re doing a better job detecting and removing spammy and suspicious accounts at sign-up.”Twitter also listed other reasons its user base declined. For example, Twitter said that GDPR, Europe’s strict new data privacy law, also played a role in its user base decline. Twitter’s daily user base, meanwhile, was up 9 percent over the same quarter a year ago. Twitter still doesn’t break out how large that audience actually is, just how much it’s growing. Still, the company is using that as a sign that its product is improving. “This quarter’s strong results prove we can prioritize the long-term health of Twitter while growing the number of people who participate in public conversation,” Dorsey added. Investors liked what they saw. Twitter stock was up more than 13 percent in pre-market trading. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}