{"id": "Resy is winning newer, cooler restaurants away from OpenTable", "paragraph": "For more than a decade, online restaurant reservations pioneer OpenTable was seemingly the only place you could go to book a table online. Now, in four years, its upstart rival Resy has managed to bite off some of OpenTable’s market share, particularly among newer and trendier restaurants.Recode researched the reservation system used by hundreds of restaurants in New York, San Francisco, Chicago and Los Angeles, focusing on three categories: Hip, newer restaurants as chosen by our sister site Eater’s “heatmap” lists; the top-ranked restaurants in each city on TripAdvisor, as a proxy for established, if touristy restaurants; and fine-dining restaurants with Michelin stars.Using data Recode gathered late this summer, we found that OpenTable dominated overall, servicing almost 60 percent of all the restaurants on the list that take reservations. Resy had 10 percent market share among those restaurants. (Globally, Resy has far fewer restaurants using its software — around 2,000 — than OpenTable, which has more than 45,000. OpenTable was founded in 1998.) Resy was particularly unpopular among the touristy spots on TripAdvisor, where only 5 percent of the restaurants we tabulated used Resy; more restaurants still used the phone. OpenTable’s market share there, though, was its highest among our groups at more than 60 percent. Among Michelin-starred restaurants in the cities — excluding Los Angeles, which doesn’t yet have a guide — OpenTable was the big winner. But almost a third use Resy or two upstart competitors: Tock, which is focused on ticketing-based dining, and Reserve, which is more like Resy.But among the newer, hipper restaurants on Eater’s lists in those four major U.S. cities, like Frenchette in New York and Dama in Los Angeles, Resy is eating into OpenTable’s potential customer base, garnering 21 percent market share — half of OpenTable’s 42 percent share.Why is Resy catching on? When the company — led by Eater’s co-founder Ben Leventhal — launched in 2014, it tried to innovate in the reservations market by asking diners to pay extra for a premium reservation, a strategy it has abandoned. These days, it’s mostly a cheaper, simpler system.OpenTable and Resy both charge restaurants a monthly fee for their services. But only OpenTable charges for each reservation made through the platform — $1 per reservation made directly on OpenTable’s site and apps and 25 cents for each reservation made on a restaurant’s website.That adds up. Michael Schall owns two restaurants in New York: Camillo, a neighborhood Italian joint, which uses Resy, and Locanda, a pricier and more upscale restaurant, which uses OpenTable. Schall estimates his monthly bill from OpenTable is usually around $1,200, while his bill from Resy is $189.“The main reason I use Resy at Camillo is that it’s much more neighborhood focused,” he said. “So I don’t need to maximize my dining room — I just need a cheap online reservation [system] so I don’t have to pay someone to sit in the office and answer phones manually.”For now, restaurateurs also get less from Resy, so it makes sense that Resy works for places that aren’t as dependent on reservations — say, at hot, new places, or neighborhood restaurants. Leventhal says he’s interested in working with “any and all” high-quality restaurants. But it makes sense for a fast-moving startup to more easily service a smaller restaurant with simpler needs.And the company is building out a more elaborate “ResyOS” offering, including what it describes as “the most advanced table management system in the world.” The question, then, is whether that will allow it to scale to a wider group of customers. One recent development: The legendary New York restaurateur Danny Meyer recently announced he would move his group — including Blue Smoke, Union Square Cafe and Gramercy Tavern — to Resy in the coming months.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}