{"id": "Paul Allen’s sister has been tasked to do a surprisingly hard thing: Give away billions of dollars", "paragraph": "The death of tech icon Paul Allen this month is a daunting and potentially really revealing moment in the world of big money.When he died on Oct. 15, the 21st most-wealthy person in the world was sitting on more than $20 billion in assets — a fortune that now has a steward: Allen’s sister, Jody. The former CEO of her late brother’s umbrella company, Vulcan, Jody Allen isn’t someone most people have heard of, but she’ll wield enormous power in the next few years as she decides how the deceased Microsoft co-founder will honor The Giving Pledge — a commitment to philanthropy that will be tested with Allen’s death.“I have been given the great responsibility to steward Paul’s wealth in service of his vision for the future,” Jody Allen said in a statement. “While the loss of Paul is overwhelming, I am dedicated to preserving and implementing Paul’s vision.”Here’s why this will be so hard: Allen, who died single and with no kids, is believed to be the wealthiest signer of The Giving Pledge to die. The Giving Pledge is a commitment for donors to give away more than half of their assets to charity in life or in their wills, but it is only a commitment. There is nothing binding about it.But this will be one of the most interesting things to watch — and, given the amount of money involved, consequential for the world — in the business and philanthropy world over the next few years. And all of this will play out during a time when the tech industry’s wealthiest and most powerful are struggling with questions about their corporate and personal responsibilities. Allen’s representatives have said he gave away $2 billion in his lifetime, leaving billions of dollars that Bill Gates’s co-founder needs to find a way to part with. (The exact amount depends on whether his net worth should be evaluated at the time of his death or at the time he signed the pledge in 2010 — which, as The Atlantic points out, was considerably less at only $13.5 billion. So despite his best efforts, he’s trending in the wrong direction.) Allen will also, of course, have to pay billions in an estate tax.It is not easy to give away that much money so quickly, although winding down an estate is a years-long task. Tied for the largest gift ever to a specific U.S. college or university, for instance, is a $600 million check to the California Institute of Technology in 2001 from the founder of Intel, Gordon Moore, according to the Chronicle of Higher Education.Allen was a towering figure in Seattle, in part because of his ownership of the Seattle Seahawks. So his estate will be under scrutiny. But his family could also effectively ignore — or maybe just fudge a little — The Giving Pledge. Perhaps, because Allen died at the young age of 65, they might find a way to satisfy the spirit of the pledge without disbursing his fortune immediately.Anything like that would embolden skeptics of The Giving Pledge, who question whether the declaration, even if it’s public, has enough teeth to actually coax billionaires into giving. Allen’s aides haven’t yet outlined what his posthumous giving will look like, beyond saying that after his death that he was “thoughtful” during his life about how his work would continue after his passing.“I believe that those fortunate to achieve great wealth should put it to work for the good of humanity,” Allen wrote in 2010 in his Giving Pledge letter. “Our net worth is ultimately defined not by dollars but rather by how well we serve others.”Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}