{"id": "Recode Daily: Trump’s first post-midterms move: Dump Attorney General Jeff Sessions", "paragraph": "In his first post-midterms move, President Donald Trump forced Attorney General Jeff Sessions to resign and said in a tweet that Matthew Whitaker, who served as Sessions’s chief of staff, will replace him as acting attorney general. In that capacity, Whitaker assumes control of the Russia investigation, raising questions about the future of the inquiry led by the special counsel, Robert Mueller. Whitaker, a Trump loyalist, has previously questioned the scope of the investigation; last year, he wrote that Mueller would be going too far if he examined the Trump family’s finances. Shares of major marijuana companies spiked on the news of Sessions’s ouster. [Peter Baker and Katie Benner / The New York Times]Facebook appears to have survived this election cycle without a monumental screwup — but that’s what we thought in 2016, too. It may be months before we can say with any confidence how the social network performed during the midterms. Meanwhile, U.S. security officials and social media firms said they did not observe any significant cyberattacks or election interference efforts; experts said Tuesday was the most secure U.S. election since the birth of the internet, thanks to steps taken since 2016 by state and federal agencies to bolster the cybersecurity of voting systems. Meanwhile, Facebook CEO Mark Zuckerberg turned down a request to appear before a Nov. 27 “international grand committee” of Canadian and U.K. members of Parliament to discuss the spread of fake news and misinformation. [Kurt Wagner / Recode]A record-breaking number of women won seats in Congress in the 2018 midterms — 96 won in the House and 12 won in the Senate (joining 10 already in the upper chamber) for a total of 112 women — the most women to serve in Congress at once in history. (The previous record was 107.) Women also hit a series of significant milestones, including the first Native American women elected to Congress, the first Muslim women sent to represent their states in the House, and the youngest women to serve as lawmakers. Here are more historic firsts from the midterms; here’s why this win for women isn’t just a symbolic victory. [Li Zhou / Vox]Lyft plans to design its own electric scooters and bikes from the ground up and has hired Liam O’Connor, who held top supply-chain jobs at Apple and Tesla, to lead the project. Lyft’s bikes and scooters team is still taking shape; its July deal to buy the U.S. bike-share leader, Motivate, still hasn’t closed. Lyft has also rolled out small scooter fleets in Washington, D.C., Denver and Santa Monica, Calif. Meanwhile, Ford is buying the e-scooter startup Spin for around $100 million. [Corey Weinberg / The Information]Foldables are the new wearables: Samsung finally showed off a prototype of its foldable two-screen smartphone at its developer conference in San Francisco. Called the Infinity Flex Display, the phone has a 7.3-inch tablet-sized screen that can be folded up to fit into a pocket; Up to three apps will be able to run simultaneously, using something Samsung calls “multi active window.” Google is supporting these new foldable devices with Android and is working closely with Samsung for the launch next year. Huawei also reportedly plans to release a foldable handset next year; Lenovo and Xiaomi started teasing their own prototypes, and LG is working on flexible OLED displays and TVs that roll up into a box. [Tom Warren / The Verge]What happens when doctors start to hate their computers? Digitization, which simplified tasks in many industries, promises to make medical care easier and more efficient. But it has largely failed to achieve the same results in healthcare. Are screens coming between doctors and patients? [Atul Gawande / The New Yorker]Josh Harder is in a dead heat in his congressional race to become the only venture capitalist in the House of Representatives.The entire race is effectively a referendum on Silicon Valley. [Theodore Schleifer]Will the Democrats’ victory in the House lead to tougher regulation of Silicon Valley? Even Europe’s tech czar isn’t sure.European Commission of Competition Margrethe Vestager doesn’t sound sure that Election Day will change much in the U.S. [Theodore Schleifer]John Skipper, ESPN’s former president, is back … at a rival sports media company.On the latest episode of Recode Media, Skipper says his new goal is to make watching sports online a big business, starting in the U.S. with boxing. [Peter Kafka]Getting rich selling T-shirts online — no overhead, no inventory and no investment.Inside the booming business of background music.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}