{"id": "Everything that matters from Apple’s iPad and Mac event in Brooklyn", "paragraph": "Apple hosted one of its trademark product keynote events this morning in Brooklyn, N.Y., introducing a new iPad Pro, MacBook Air and Mac mini. Here is the most important news from the show, in roughly chronological order:The theme for today’s event is essentially Apple’s “most creative products” — and its products for creative professionals. Apple is holding the event in an opera house, its logo is being drawn in a bunch of different art styles, and today’s introductory videos feel more art-house than Hollywood blockbuster. CEO Tim Cook didn’t do much of a windup — we’re jumping right into the Mac update.Apple’s Mac business now has 100 million active devices. First up for an update: The MacBook Air, which “truly embraced the notion that less could indeed be more,” per Cook, who says it’s the “most beloved notebook [computer] ever.”This is a big update, arguably overdue, for one of Apple’s most popular products.The new MacBook Air has a high-resolution Retina display — addressing its biggest shortcoming — plus two USB-C ports and a headphone jack. The new display has 50 percent narrower borders and 48 percent “more color.” The new Air now supports Touch ID to unlock your Mac or use Apple Pay, a feature Apple previously introduced in the MacBook Pro. It can drive a 5K external display. Apple is pledging 12 hours of battery life in “wireless web browsing.”The MacBook Air is smaller — 17 percent less volume — and 10 percent thinner, and a bit less than 10 percent lighter, weighing in at 2.75 pounds. It’s made from 100 percent recycled aluminum.The new MacBook Air starts at $1199, the lowest price for a Retina Mac, but 20 percent more expensive than the old MacBook Air, which recently started at $999. Preorders start today, with availability next week.Apple is also making another long-awaited Mac update, a new Mac mini. “This new Mac mini is an absolute BEAST on the inside,” Apple promises. This smallish device has had a weird history — Apple goes years between updates — but has a strong niche following, using it as a media center, to power conference room TVs and even in server farms. It will now support quad- and six-core processors, offering 5X faster performance, and up to 64GB of memory — a lot for a small device.The good news for Mac mini fans: Unlike Apple’s laptops, which have been losing their ports, this Mac still has a bunch of them, including four USB-C ports, two USB-A ports, HDMI, Ethernet, etc. Its aluminum enclosure is now also 100 percent recycled. It starts at $799, with preorders starting today and shipments on Nov. 7.“Imagine a piece of glass that transforms instantly into anything you want it to be.” That’s how Tim Cook kicks off the iPad section of today’s event, following a retail update from exec Angela Ahrendts.The new iPad Pro is a big cosmetic and functional update: Its screen now goes far to the edge, including rounded corners and Face ID, using similar technology as the new iPhone XR. It comes in 11-inch and 12.9-inch sizes, with the larger device having 25 percent less volume than its predecessor.The new iPad Pros use new Apple chips, the A12X. “Single-core performance” — many simple tasks — are up to 35 percent faster than the last iPad Pro, and more sophisticated multi-core tasks are up to 90 percent faster. Graphics performance is up to 2X faster.As rumored, the new iPad Pro is moving over to USB-C — away from Apple’s Lightning port — as its main connection point. This can power a 5K display or let you charge your iPhone from your iPad. The second-generation Apple Pencil stylus attaches magnetically and charges wirelessly. The new keyboard case does not include a trackpad.The 11-inch iPad Pro starts at $799; the 12.9-inch starts at $999. Both models start preorders today and ship on Nov. 7.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}