{"id": "Full Q&A: Tesla and SpaceX CEO Elon Musk on Recode Decode", "paragraph": "On the latest episode of Recode Decode, hosted by Kara Swisher, Kara sat down with Elon Musk — the CEO of Tesla and SpaceX — to talk about all of his businesses, his social media habits and when we’ll be able to go to Mars, among many other topics.You can listen to the entire conversation right now in the audio player below. If you prefer to listen on your phone, Recode Decode is available wherever you listen to podcasts — including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below is the full transcript of the conversation. You can read a more condensed, lightly edited version here.Kara Swisher: It is Halloween night, and I have gotten my treat, which I’ve been asking for a while. I’m here with Elon Musk at the headquarters of Tesla. Is that right? The right pronounce? Is it Tesla or Tezla?Elon Musk: Tesla, yeah. Whatever. By the way, I think your costume is great.Thank you! I’m dressed as a lesbian from the Castro in San Francisco. That’s what I look like. I’m here with delicious coffee. We are gonna have a long discussion about all kinds of things. Elon’s been very nice to do this in the evening, here. We’ve been chatting about all kinds of things, but we’re gonna get into it really quick. We’re gonna talk about Tesla, we’re gonna talk about SpaceX, we’re gonna talk about this year, we’re gonna talk about The Boring Company, and anything else Elon wants to talk about, because people like to hear you talk. Let’s start from the beginning, about this year. You’ve given some very interesting interviews. You’ve gotten on Twitter, made some mistakes.What’s Twitter?What’s Twitter? Okay, let’s start with Twitter. I have an obsession with Twitter, too, and an addiction. How do you look at that with you? What is going on?What’s going on? What happens? What happens with you and Twitter?Well, I tweet interesting things pretty much as they come to me, and probably with not much of a filter. And why?I find it entertaining. I think, “Oh, other people might find this entertaining.” Sometimes they do. And sometimes ...Yeah. It’s pretty random. Just at night? What are you, at home you’re doing this?Yeah. Mostly at home. I spend a lot less time on Twitter than people probably think. It’s like maybe 10-15 minutes or something. Yeah, well people pay attention when you do that. Yeah. It’s pretty interesting what my most ... What people are most interested in, like some little tweet about “I love anime.” That was it. But it was lowercase “i”, black heart, “anime,” and people loved that. That was like one of my most popular tweets. What about the things they didn’t love? Are you under strict orders not to do that? Is that correct? Will you be? Will you have to change your Twitter behavior?Not really. Under the recent settlement, you don’t have to be careful about what you tweet? If it’s anime, that’s one thing.Mm-hmm.But if it’s just business you can’t.No, I think it’s mostly just if it’s something that might cause a substantial movement in the stock during trading hours. That’s about it. That’s about it. So you can’t do that.Without somebody getting mad, no. That’s a lot of people getting mad. Would you consider it ... I’m gonna get off it in a second, but do you consider it a communications medium? How do you look at it? A lot of us use it that way. I use it that way. Obviously, Donald Trump uses it that way. How do you look at it?I look at it as a way to learn things, kinda stay in touch with what’s happening. It feels like dipping into the flow of consciousness of society. That’s what it feels like. It’s kinda weird. I guess I sometimes use Twitter to express myself, and that’s a weird thing to do, I suppose. Not so much. It isn’t. Sometimes it’s very funny, other times it’s not so funny.Some people use their hair to express themselves; I use Twitter. All right. But when you do it in ... I’m not going to get to the SEC ‘cause I understand you can’t talk about that very much. Nothing to do with that. Although you did tweak them in one of your tweets, but at some point that will stop. Correct?What did I say?You made some remark. Elon, there’s so many tweets that you do that are so obnoxious, it’s hard to know. That was an obnoxious tweet.It was?Yes, it was.Oh. Don’t do that. I was just ... I forgot which one it was.Yeah, but —Can you remind me?No. It’s like you had some name ... Look it, you’re cackling on Halloween! But the ones that I think I do want to ask about is the press. You pick fights with the press over Twitter, and then you have all your fans, of which there are many. Are you aware of what they do once you start them off?Well, I have to say, my regard for the press has dropped quite dramatically.Explain that, please.The amount of untruthful stuff that is written is unbelievable. Take that Wall Street Journal front-page article about like, “The FBI is closing in.” That is utterly false. That’s absurd. To print such a falsehood on the front page of a major newspaper is outrageous. Like, why are they even journalists?  Do you understand —They’re terrible. Do you hear — understand the mood in this country ...Terrible people.I get that, but do you understand the mood in this country around the press and the dangers of attacking, especially when the president is doing that? In quite an aggressive, “enemy of the state” and everything else. It’s disturbing when someone like you as a leader does that, too, or goes along with it.The answer is for the press to be honest and truthful, and research their articles and correct things properly when they are false. Which they don’t do. Okay. But I’m asking if you understand where it goes to.Yes, of course I do.What do you think of that? Are you worried about unleashing a dangerous cycle that a lot of the press are worried about? Justifiably. I suggest the press take it to heart and do better. What about what Donald Trump does, about “enemy of the people”? Do you look at it that way?No. Just that you don’t like falsehoods.Yeah. There are good journalists and there are bad ones, and unfortunately the feedback loop for good versus bad is inverted, so the more salacious that an article is, the more salacious the headline is, the more clicks it’s gonna get. Then somebody is not a journalist, they are an ad salesman. Not a journalist, an ad salesman. What about things that are just critical of you that you don’t like? Do you think you’re particularly sensitive? No. Of course not. Count how many negative articles there are and how many I respond to. One percent, maybe. But the common rebuttal of journalists is, “Oh. My article’s fine. He’s just thin-skinned.” No, your article is false and you don’t want to admit it. Do you take criticism to heart correctly?Yes.Give me an example of something if you could.How do you think rockets get to orbit?That’s a fair point.Not easily. Physics is very demanding. If you get it wrong, the rocket will blow up. Cars are very demanding. If you get it wrong, a car won’t work. Truth in engineering and science is extremely important. Right. And therefore?I have a strong interest in the truth. All right. And you are —Much more than journalists do. What I’m trying to get to is, do you want to acknowledge when you do this it does set off ... People beyond you that listen to you, you have a fan base that’s quite rabid, I would say.No, I wouldn’t say that. No? I think they’re great. All of them?No, not all of them. Right. Okay. Let’s talk about this year. What has gone on this year with you? It’s a very roller-coaster year. How would you explain it? You did a very emotional interview in the New York Times, and I promise we’ll get to Tesla and all the other things we want to talk about, but what has happened to you this year? How would you put it?It’s been a very difficult year. Why is that? We had the Model 3 production ramp, which was excruciatingly difficult. It is incredibly difficult to survive as a car company. Incredibly difficult. People have no idea how much pain people at Tesla went through, including myself. It was excruciating. And?Excruciating.And talk about that toll.Pretty sure I burnt out a bunch of neurons during this process. Running both SpaceX and Tesla is an incredibly difficult ... You realize we’re fighting the incredibly competitive car companies. They make very good cars. They’ve been doing this for a long time. They are entrenched. Mercedes, Audi, BMW, Lexus, you name it. All those car brands. And the history of car companies in America is terrible. The only ones that haven’t gone bankrupt are Tesla and Ford. That’s it. Everyone else has gone bankrupt. So, the pressure of doing this. Yes. Why is it that you do this?It’s trivial to start a car company.Absolutely. It is insanely difficult to make it successful. You put too much pressure on yourself this year, or it just is what you’re doing?It sounds like you’re not hearing me. I’m hearing you. I understand it’s incredibly difficult. What I’m saying is why did you do it this way, this year?You’re definitely not understanding me.All right. Try it again. Making a car company successful is monumentally difficult. There have been many attempts to create a car company and they have all failed, even the ones that have had a strong base of customers, thousands of dealers, thousands of service centers, they’ve already spent the capital for the factories, like GM and Chrysler, still went bankrupt in the last recession. Ford and Tesla made it barely through the last recession. There’s a good chance Ford doesn’t make it in the next recession. So, as a startup, a car company, it is far more difficult to be successful than if you’re an established, entrenched brand. It is absurd that Tesla is alive. Absurd! Absurd. What do you credit that to?Excruciating effort. By you and —Hundred-hour weeks by everyone. By everyone here at Tesla. Yes. There wasn’t some other way to do this. That’s what I’m saying —There wasn’t some other way to do this, Kara. While you’re also running a space company and other ones. Yes.What I want to get at is why you’re doing that. It’s not a trivial … Why do you think you want to push yourself that hard? Well, the other option would have been, Tesla dies. Right.Yeah. Tesla cannot die. Tesla is incredibly important for the future of sustainable transport and energy generation. The fundamental purpose, the fundamental good that Tesla provides is accelerating the advent of sustainable transport and energy production. Which I think most people credit you for doing. Pushing everyone else into it at the same time, correct?Yes. The success of Tesla is, by far, the biggest forcing function for the other car makers to get into —100 percent.Yeah. Into electric cars. They’ve said so. No, there’s no question. I was just having a discussion with someone the other day, and I said, “He has pushed everybody into this, really dramatically. There wouldn’t have been this much investment. There wouldn’t have been this.” Yes. It’s very important for the future of the world. It’s very important for all life on Earth. This supersedes political parties, race, creed, religion, it doesn’t matter. If we do not solve the environment, we’re all damned. And this way via sustainable transportation.Yes. It sort of blows my mind, all these social justice warriors driving around in diesel cars. It’s outrageous. Do you have an electric car?I do not. I have a —Shame on you.Ford Fiesta. Okay.I’m trying to get rid of my car, actually. I’m trying to actually get rid of it.tSure. I’m shaming you into buying you an electric car. No, I would think, too —I’m really car-shaming you.No. I don’t drive my car very much. It sits in the garage. I try not to drive my car at all.Driving something. Yes, that’s true, ‘cause you’re down here in Palo Alto. But I would like to have public transportation is what I would actually like better ... I mostly take public transportation. Who cares about me? I walk a lot. I walk a lot of the time.When you get to this ... You’re doing this to yourself because you think that the world depends ... Not the fate of the world. You’re not a cartoon character. No, I think the electrification of transport, and there’s also an important part of Tesla which is solar and stationary batteries, because you need to generate electricity in a standard, sustainable way with solar and then store it at night when the sun goes down with batteries, and then use that energy from the sun to power cars. Without Tesla, this would still happen. There would still be a transition to sustainable energy, but it would take much longer. History will judge this, obviously, but I would say on the order of 10 years, maybe 20 years.So, pushing it forward by that much.Yes. I think it’s probably fair to say that Tesla has advanced sustainable energy by at least five years, conservatively, and maybe closer to 10, and then if we continue to make progress, we might advance it by 20 years. This could be all the difference in the world. What is the toll on you? What has been the toll on you and your employees? How do you think about that? It’s been terrible. This year felt like five years of aging, frankly. The worst year of my entire career. Insanely painful.Was there any other way to do it? You didn’t think there was any other way to have it happen? Why this year? Why this year, of all the others? Because you’ve been at this for many years.For this past year, it’s been because of the Model 3 production ramp. Myself and others at Tesla, we had to go in and fix the mistakes in the Model 3 production system, and there were a lot of them. I personally solved a bunch. Jerome [Guillen] solved a bunch. Everyone helped, the entire team. Javier [Verdura], Franz [von Holzhausen], Deepak [Ahuja], everyone. It was ... like, we had the legal team delivering cars in Q3. Todd [Maron] is great. There was a lot of people ... Everyone had to basically go hardcore to solve the ramp. To solve this ramp problem. The amount of money that you lose if you don’t solve the ramp is mind-boggling, because you get hit from both sides. Let’s say you’re selling software or something, you don’t —That would be easier, Elon. It would be a lot easier. But in software you don’t have a bunch of parts. You don’t have a supply chain. If you don’t sell software, you lose the revenue, but you don’t incur a massive amount of cost associated with producing the software, ’cause you just make copies pretty easily. But for any large, complex, manufactured item, you have an entire supply chain, and that supply chain has on the order of six months of inertia. You place the order for parts for the car, including if you’re all the way with like two or three or four suppliers ... We have on the order of 10,000 suppliers. It’s a crazy number. We have to place the orders for how many cars we think we’re gonna build roughly six months in advance, six months before final assembly, ’cause if you go all the way down the supply chain... Then if you don’t actually make those cars, you still have all the costs. It’s like a flotilla of supertankers. The inertia of that is incredible. If anything happens to stall out the production progress, and that could be any one of those 10,000 suppliers, or on the order of 10,000 internal processes, if any of those is slow or wrong or whatever, you can’t make cars. You only need one missing thing, and whatever the slowest, least lucky part of the production process is, that sets your rate. I want to get into Tesla specifically, and about the recent results, which I think people were surprised by. You surprised Wall Street and some of your competitors. But when you’re thinking about doing this incredibly complex thing, do you regret some of the things you’ve done to slow it down itself? Or was that unavoidable from your perspective? You know, some of your tweets. You attract attention. You really truly do, and some of it is self-inflicted. Do you not see it that way?Yeah, there’s no question there’s, like, self-inflicted wounds. In fact, my brother said, “Look, if you do a self-inflicted wound, can you at least not twist the knife afterwards?” You stabbed yourself in the leg. You don’t really need to twist it in your leg. Why do that?So why do you do that?It’s not intentional. Well, okay. Sometimes you’re just under a lot of pressure, and —Your brother is wise.You’re not getting much sleep, you’re under massive pressure, and you make mistakes.Is that over? Do you feel like that’s over? Do you feel calmer now?It’s totally over. I will never make another mistake again.No, I’m teasing you. But how do you ... You look well. You don’t look under a lot of pressure. You seem rested. Yeah. Things are back to a hard work schedule, but not an insane work schedule. I was, there were times when, some weeks ... I don’t know. I haven’t counted exactly, but I would just sort of sleep for a few hours, work, sleep for a few hours, work, seven days a week. Some of those days must have been 120 hours, or something nutty. You’re gonna go a little bonkers if you work 120 hours a week. Now we’re down to 80 or 90. It’s pretty manageable.And you had talked in the New York Times about using Ambien and stuff like that. That was to regulate your sleep, correct? Yeah. It’s not like for fun or something. No, not at all. No, it’s just like, if you’re super-stressed, you can’t go to sleep. You either have a choice of, like, okay, I’ll have zero sleep and then my brain won’t work tomorrow, or you’re gonna take some kind of sleep medication to fall asleep. Now you’re to 80 hours, so it’s like totally manageable in that regard. Yeah, 80 or 90 ...You’re just like a regular lawyer in that regard. What is that? I think I’m about 80. I think I’m probably about —Yeah. 80 is pretty sustainable. Sustainable for you.Yeah. The pain level for hours increases exponentially. It’s like nonlinear above 80. Let’s talk about Tesla in specific. You turned in a great quarter. These cars are moving off. How do you look at where you’re going with the Model 3 and others? Then I want to get into some of the new features, the navigation features on Autopilot and things like that. How do you look at Tesla right now? I want to first talk about the product, and then talk about the company itself and what you need to move forward. I think at Tesla we’re doing pretty well right now. Tesla’s not staring death in the face. We’re in, I think, a pretty good position. We don’t want to be complacent, but it’s not ... Up until around September, we were really faced with, like, “We must solve this or we’re gonna die,” constantly. I feel like we’re no longer in the staring-death-in-the-face situation. What, is death over and sitting in a seat nearby? Well, you never want to get complacent, so we still need to work hard, but I think we’re over the hump. We’re certainly over the hump on Model 3 production. For us, making 5,000 cars in a week for Model 3 is not a big deal. That’s just normal. Now we’re working on raising to 6,000 and then 7,000 Model 3s a week, while still keeping costs under control. We could probably do 6,000 or more, maybe 6,500 Model 3s a week right now, but it would have to stress people out and do tons of overtime. What about innovations to these models? We’re not talking about other products coming out, but you put in a number of innovations in all the current models. Our cars are constantly being updated with new technology, so we don’t really have a model year like other car companies. As soon as we come up with some improvement, we just roll it into production. Talk about the new navigation feature. Drive on Navigation?Right.That’s I think one of the first major steps toward full self-driving. You can enter in an address, and from highway on-ramp to highway off-ramp, the car will change lanes. It will go from one highway to the next automatically, and take off-ramp automatically. It’s pretty wild. It’ll overtake a slow car. It’s basically integrating navigation with the Autopilot capability. That’s why we call it Navigate on Autopilot or Drive on Nav.What are the challenges that you face with these technologies now, from your perspective?Well, the main challenge has been improving the neural net so that we can recognize all types of objects from all eight cameras. There are eight cameras: Three forward, two on each side, and one rear. We’re running essentially eight neural nets of varying complexity. We’ve got to integrate the output of the neural nets into path-planning and then hook in the navigations, say, “Where do you need to go?” The big challenge has been solving a wide range of corner cases. So if you have a —These are things that just happen. Yeah, the roads are pretty messy, so you could have, say, skid marks on the road that look like a line. Sometimes tar seams look like a line. Sometimes the lines are just painted wrong, for some reason. One of our biggest challenges, actually, with Drive on Navigation was dealing with forks and gores, where if a lane is splitting, you need to be confident that you’re going either left or right, not down the center. And the car will come to a halt at the first intersection. Now we’re integrating stop signs, traffic lights, being able to do, say, hard right turns or hairpin bends and that kind of thing. What about regulations? The regulatory environment right now? Because that’s gonna be part of it, or else building out infrastructure that will have sensors in roads or things like that? How do you look at that, or you’re just not even thinking about it?Yeah, we’re not really thinking about it. We’re assuming that there won’t be —You’re not assuming.No. The car needs to drive better than a human driver using the same inputs as a human driver. Eyes are basically just cameras. All creatures on Earth navigate with cameras. A fish eagle can see a fish from far away and take into account the refractive index of the water, dive down and get the fish from far away. There’s no question that image-recognition neural nets and cameras, you can be superhuman at driving with just cameras. You don’t need anything else, from the government or from infrastructure or anything. I was recently talking to the Mercedes people. They were talking about sensors in the roads.Yeah, that’s hopeless. That would, at best, be a specialized solution, and whatever city puts stuff in roads ... You can always make something work for a specific solution, like some special-case solution in some town, you can make that easy, but what you really want is a general solution for self-driving that works worldwide. That works worldwide. How do you look at the regulatory environment, because that’s another thing you have to be dealing with? Here in the U.S., in China, wherever else.I think the key thing for convincing regulators that self-driving is OK is to show billions of miles with a much better statistical significance in safety than human drivers. If the probability of injury is half that of the average human driver, then I think, probably, regulators will support self-driving. But it has to be a very large population. The statistical population of miles has to be very big, like billions, in essentially almost every possible case. How do you assess different countries? This country versus China versus others? Who do you think is more ahead in that, at least helping these things come to fruition?Again, we’re assuming that’s ... We’re assuming that nothing is done on the road side, but from a regulatory standpoint, I think it’s just gonna be who ... You know, which regulatory agency has the best appreciation of statistics.And who is that right now?Actually, China’s pretty good. I think the U.S. is pretty good.Any states or the federal? The federal system?I hope this is a federal system, because otherwise it’s gonna get weird when you cross state borders, and then you’re in a different situation.Suddenly in Arkansas, you can’t drive.Yeah, I mean especially like in, say, East Coast, you’re going from like, you know, New York, Rhode Island, Massachusetts, New Hampshire. Like you go through like several states pretty quickly, and then you wouldn’t wanna have things be different in each state.So have you been working with federal regulators — Elaine Chao and ...Yeah, not ... Yeah. We certainly have a close relationship with NHTSA, especially, so like the ... You know the sort of hardcore, sort of the entity that really is the hardcore regulator of road transport is NHTSA. NHTSA sort of —Is where you’re gonna rely on it.Yeah, they’re like the regulator of cars, really.Now other competitors, I’d love you to sort of assess the competitive landscape. Faraday just lost another founder today, which was the hot company, or the allegedly hot company, I think that’s probably easier to say it that way. Lucid got a billion dollars from SoftBank.Saudi Arabia, not SoftBank.Saudi Arabia. That’s right, I’m sorry. Saudi Arabia. And we’ll talk about that in a second.And there’s lots of others, but there’s all kinds of things. How do you assess — Google’s working on stuff, Uber still seems to be hanging in there. Or I don’t know what you think about that. I’d love to get your assessment of all of them. Or some of them.Yeah. I don’t really think that much about competitors. I just say like, you know, how do we make our cars as good as possible? How do we make sure we have like the best engineering and manufacturing talent in the world?You know, Tesla doesn’t do any advertising, or we don’t do any paid endorsements, we don’t sort of haggle for cars or anything like that. So we’re really reliant on the quality of product to sell. And I think it makes sense to sort of put our budget into advancing the technology to make the best possible cars.Right.So, you know that’s ... I’m not sure looking at competitors really helps. It’s sort of like the old adage with, you know, running, you don’t wanna ... If you start looking at the other runners, it’s not good, you know.Right. Like you can lose races because of that.Do you think about them? Do you think about them at all? Like Ford or Mercedes or anyone? Or if they’re doing anything that’s interesting, or Google? Which one of them, do you think, is the furthest ahead or closest to you all?I mean self-driving, maybe Google, Waymo? I don’t think anyone is close to Tesla in terms of achieving a general solution for working on —Overall solution.Yeah. Yeah. You can definitely make things work like in one particular city or something like that by special-casing it, but in order to work, you know, all around the world in all these different countries where there’s, like, different road signs, different traffic behavior, there’s like every weird corner case you can imagine. You really have to have a generalized solution. And best to my knowledge, no one has a good generalized solution except ... and I think no one is likely to achieve a generalized solution to self-driving before Tesla. I could be surprised, but...So none of the car companies. None of the car companies. No.Do you ever look and go, “Okay, that’s interesting what they’re doing there.”The other car companies ... I don’t wanna sound overconfident, but I would be very surprised if any of the car companies exceeded Tesla in self-driving, in getting to full self-driving. You know, I think we’ll get to full self-driving next year. As a generalized solution, I think. But that’s a ... Like we’re on track to do that next year. So I don’t know. I don’t think anyone else is on track to do it next year.No one even close. When you look at all the competitors?Not that I’m ... I think there’s ... I would say, unless they’re keeping it incredibly secret, which is unlikely, I don’t think any of the car companies are likely to be a serious competitor.Will they ever be a serious competitor, from your perspective?In self-driving, I don’t think so. They’re just not good at software. And this is a software problem.Okay. All right, so talk about Tesla ... and then I want to get to SpaceX and other things.It’s a harder problem, too, on the compute side. But they’re also not doing anything on the compute side.Right.So it’s like ... You do need an advanced sort of AI computer that’s very good at doing matrix multiplication with localized memory. So that —So they’re missing elements? What you’re saying, the generalized solution?Yeah, I mean ... you need a specialized inference engine. Like the Tesla hardware 3 Autopilot computer, that will start rolling into production early next year, is 10 times better than the next best system out there at the same price, volume and power consumption. And it’s really because it’s got a dedicated neural net chip. Which basically, it sounds complicated, but it’s really like a matrix multiplier with a local memory.So all I’m getting at, is you don’t think any of the rivals will come close. Any of the ones that are touting their solutions?I would say close to zero percent, probably.Okay. All right, that’s not close. That’s not close at all.Yeah.Okay.This is my honest ... This is —That’s all right, that’s your answer.This is just my ... what I think. I mean, I’m not ... it’s not like ... I could be wrong, but this is what I think.All right. So the challenge you face is financial, though. Getting funding and stuff like that. And you’ve gotten ... Saudis had bought a big bunch of your stock, that’s just separate, they —They might have sold it, I don’t know.Yeah, we don’t know what they have now. But where do you get the money? Talk about the finances of doing this, because that’s what could really hurt you is not having enough capital.You know ... I mean, as I said earlier this year, I think we will be cash-flow positive for all quarters going forward.All quarters going forward. So do you need more investment?No.Not at all.I don’t think so.Do you need to go private? Are you still contemplating that?We don’t need to go private, I think I .... going private would ... I think we could execute better if we were private.Without all the attention?Yeah, you know, not to harp on those short-sellers, because people think I have this obsession with them, but I spent like one percent [or] less of time thinking about them —It’s the tweets, Elon. But go ahead.Less than one percent of my tweets have anything to do with short-sellers.You do know when you tweet, it’s louder than other people’s tweets, but go ahead.Yeah, but if like one in a hundred is about short-sellers, that’s still 1 percent.Okay, all right. Okay. All right. Okay.I think that’s like probably even less than that.Okay.But the issue is that there’s a group of people who are quite smart, very mean, and have a strong financial interest in Tesla’s downfall. And what that results in is a constant attack on the Tesla brand, on me personally, on the executive team, on our cars. You know, every mistake we make is amplified. And this is not good. So the ... You know, the thought about going private was really just saying, okay, if we’re private ... Going private would definitely result in some short-term drama, but if we can avoid the distraction of ... If we can avoid the brand damage of ... Let’s say we’re private, and then we went public five years from now. Then the area under the curve of brand damage by short-sellers would be probably less than the short-term difficulty of going private in the first place. That was the approximate calculus. And then also being public, particularly when everyone at the company’s a shareholder, causes a lot of distraction when the share price moves around a lot.Right. It just roared upward this week. Or this past week.Yeah, yeah. It’s gone up. You know, it tends to end up being like a mood, to some degree, a mood thermometer. So it’s like the stock goes down, people are sad and feel undercompensated. And then when the stock goes up, people are exuberant, overly exuberant, and —Normal.Yeah, you get distracted thinking about what you’re going to buy.Right, right.So, like, neither of these things are great. When you have big moves in the stock, this just causes a distraction.Right. Do you believe you have enough investment? Even if it’s cash-flow positive, you wanna invest more. Correct? Do you believe, do you think you need more investment?No.No. That you can do it based on selling these cars?Yes.Okay. All right, so last thing on this, on Tesla, these new products. The truck, the Roadster, where are they?Yeah, I’m super-excited about the future —Do you have another thing you’re making?Ha-ha. We definitely do.Do you have a vertical lift and takeoff?The supersonic VTOL jet, electric jet.Yeah. Perhaps a hovercraft like Larry Page, I don’t know.No, hovercrafts are pretty straightforward.Yeah. Okay, sure.But —For you.A supersonic vertical-takeoff-and-landing electric jet would be interesting to do at some point, I think. But my head would definitely explode if I tried to do that right now.Yeah, I think so.But I’ve been thinking about that design for nine years.Do you have something special —Yeah.Yeah, such as?It’s great. It’s great? It’s in your head?Yeah.Okay, all right.I mean, I wrote down some of it, but ... But the truck is more immediate?There were like a few things —[And] the Roadster?Yeah, I think what fires me up about Tesla is, I think we’ve got the most exciting product roadmap of any company in the world.Okay.We’ve got the Model Y, the compact ... midsize, more midsize SUV. The Tesla Semi, which is gonna be great for taking ... Because semis are in constant use and use a tremendous amount of fuel, so the Tesla Semi, I think, can have a huge effect, positive effect on —When do those come online? That was a very dramatic opening of bringing it in, by the way. People are obsessed with your jackets, but it actually was the event that you did, where you showed it off.Nice jacket.Yeah, nice jacket.“Who are you wearing?”Were you surprised by that? It was a nice jacket.It’s my favorite jacket, actually. I’ve had it for ages.Okay. But suddenly it was the jacket.The reason it looks like ... It looks kind of worn-out, it’s ’cause it is.Okay. All right.It’s not, like, accidentally. It’s that’s how —All right, back to the truck!All right, yeah. Exactly. Just to recap the things that are coming out, because I think it is ... I think it’s literally the most exciting product lineup of any company in the world. Certainly from a consumer standpoint. I’ll just go through the things that are publicly announced.You’ve got the Model Y, which is the midsize SUV. You’ve got the Semi truck, which is, can be great for really heavy transport. It’ll be like the heaviest class of truck, of industrial truck.We’ve got the next-generation Roadster. Which will be the fastest sports car on every dimension. Fastest acceleration, fastest top speed, best handling. The goal with the Tesla Roadster is to show that an electric car can be the best sports car on every dimension. I think that’s very important to kind of get rid of this, like, halo effect that gasoline cars, sports cars, have —The pickup, or the more-Well, like let’s say that the fastest, top-speed cars in the world are still gasoline sports cars. So I think we ... It’s important to have an electric sports car that’s faster than the fastest gasoline sports car. And it helps address that halo effect that gasoline sports cars have. So I think it’s important to do that to show that, you know, electric is the best architecture.Then we’ve got the pickup truck, which  — actually, I’m personally most excited about the pickup truck.Why’s that?Well I can’t talk about the details, but it’s gonna be like a really futuristic like cyberpunk, “Blade Runner” pickup truck.OK, what does that mean?It’s gonna be awesome, it’s gonna be amazing.Who are you trying to sell that to?This will be heart-stopping. It stops my heart. It’s like, oh, it’s great.Who do you wanna sell that to? People that buy F- whatever?You know, I actually don’t know if a lot of people will buy this pickup truck or not, but I don’t care.Okay.I mean I do care, eventually, you know. Like sure, I care. We wanna get gasoline, diesel pickup trucks off the road.Right.But if I find, like, you know, I’m personally super-excited by this pickup truck. It’s something I’ve been wanting to make for a long time. And I’ve been iterating sort of designs with Franz ... It’s like I really wanted something that’s like super-futuristic cyberpunk. Which, if it doesn’t ... if I’m weirdly like ... if there’s only a small number of people that like that truck, I guess we’ll make a more conventional truck in the future. But it’s the thing that I am personally most fired up about. It’s gonna have a lot of titanium.Titanium, okay. What else?There’s like, you’ll see. It’s like ...Racing stripes? What, no? I’m teasing, I’m teasing.No, it’s gonna be ... Like, I think this is the kinda thing the consumer would want to buy, even if they don’t normally buy a pickup truck.Right.So, anyway, that’s personally I’m most excited about. But like I said, it could be just like, okay, I weirdly like it and other people don’t. That’s possible. But we’re gonna make it anyway, and then we will just have a niche audience, I don’t know. But if it does, then we’ll make a more conventional pickup truck.Do you have a motorcycle?No. I rode motorbikes a lot when I was a kid. So I did, like, dirt biking and then rode a motorcycle on the road. And then I almost got killed when I was 17, so ... Yes, I remember.Yeah. So it’s like I ... You know, most people are paralyzed, but depending on how you count it, the probability of death in a motorcycle versus —It’s quite high.It’s 25 times higher.Yeah, my brother is a doctor. He calls them donor-mobiles, actually.Yeah. Like organ donors. Yeah, that’s exactly why he calls it that.Yeah, so, the thing is, I rode dirt bikes for six years or more, and did all sorts of crazy jumps and things in the dirt bike, but never got seriously injured. And then —But not gonna make one? Not making a Tesla motorcycle?Yeah, then I almost got killed ... Bad memories.A truck knocked ... I got hit by a truck.What about a plane?Literally got hit by a truck.Yeah. So, we’re not gonna make motorcycles. But a few more Tesla products that are cool: We’re almost done with the development of the solar tile roof. So we have those on a few hundred roofs right now. And we’re just doing testing to make sure they have long-term durability.These are tile roofs, these are tiles on the roofs? Yeah.Yeah, the solar tile roof where it looks like a normal, beautiful tile roof. But it’s actually solar. And, like, that development process is longer than we’d like, because we’ve got to make sure that the roof’s gonna stand up for 30 years.Sure.And even when you do accelerated lab testing on a solar roof, it still takes a while. And we’ve gotta put a lot of work into making the installation process easy, so it doesn’t take ages to install a roof.Or rely on government subsidies.Yeah. Long-term, there won’t be any government subsidies. Those are just kind of like short-term things.I agree. You’d be surprised to know I do have a solar roof. And have had one for 10 years.Oh cool. Great. Thank you. Good.I think I have a real old one. I think it’s super old, and it seems to be working just fine.Yeah. I mean you probably have the retrofit solar, like that’s on top of a normal roof. Yes.So we have that. We’ve like kind of a regular —This is tiles. This is the tile —This is integrated with the roof.Right.So the solar tile roof, where it’s integrated with the roof. You don’t even realize it’s solar. And of course we have the conventional retrofit solar, so we are working on, you know, steadily improving the aesthetics of the retrofit solar. Then we’ve got the Powerwall battery storage system. We’ve got the Powerpack, which is used for utilities on industrial scale. We’re gonna have some other exciting announcements on the stationary storage front. So when you —This is within the homes?I can’t talk more about it, but there’s —Presumably.We have a large product on the stationary storage side that I think will be very compelling for utility customers. Okay, all right. So, a Roadster. Any planes?No plans to make planes at Tesla.All right. Well let’s get to rockets then. SpaceX. Last time we talked, you said you wanted to die on Mars, just not on landing. Which was a very funny joke, although it’s probably not a joke, it’s probably —Well, it’d be ironic if that had happened.Well, you know.Better not ... I think we just be careful ... I have to be careful about tempting fate, because I think often the most ironic outcome is the most probable.Yeah, that’s kind of the way it should go, right?Yeah.Yeah. “This is how Elon Musk must die!”Reality, yes.“He must die in landing on Mars.”It might happen.Right.You know, like the ... It just very often seems like reality tries to ... Actually, technically, there’s a friend of mine, Jonah Nolan, who had this like modification of Occam’s razor where he said he thinks “the most ironic outcome is the most likely.” And then I think that there’s some truth to that. And then also I think sometimes the most entertaining outcome is the most likely. Whether that entertainment is in the nature of drama, comedy or something else —What would be more entertaining than that? You tripping on the way to see the martian and just banging your head?I mean hopefully me dying on impact on Mars is not the most entertaining outcome.No, that’s not entertaining.Yeah. Yeah.It’s ironic.’Cause then what happens next? It’s like, okay, you’re a crater.Yeah. Right, right. That’s true. Okay. All right. Okay. Let’s start ... instead of discussing your death, your impending doom, let’s discuss what’s going on at SpaceX, which has had a more, a smoother ride, so to speak, of what you’re all doing with the rockets. You’re gonna do an astronaut? What are some of the things you’re doing?Yes. Yeah, so this year’s been great for SpaceX.Right.We successfully launched the Falcon Heavy rocket, which is the most powerful rocket in the world by a factor of two. So that’s twice the power, twice the thrust of the next biggest rocket. And we actually launched a Tesla — my Tesla Roadster to Mars orbit. And although ... Like a lot of people thought this was like some ego thing or whatever, but ...Well it feels stunty, come on. You’re launching a —It’s ... I’m trying to ...It’s a stunt. You’re trying to —I’m trying to listen to the reality simulation, which is do the most entertaining thing.Yes, exactly. Okay.That’s pretty entertaining.All right, it is. It sure is.And you know, we had a lot of, you know, like playing David Bowie. And where, like, “Hitchhiker’s Guide to the Galaxy” stuff in there, we’ve got the Asimov Foundation series etched in glass. Like there’s a lot of like little things.Anything really weird you stuck in there you didn’t tell anybody about?No.Like a sandwich? I don’t know.There might be. I don’t know all the things that are on there. But there’s probably some weird things in there. The ... like the reason we did that is actually because, normally, when a new rocket is launched, you just put a dummy payload, which is like a block of concrete or something. Like, literally, I think when Boeing launched the Delta IV Heavy, they launched a block of concrete or something. Right. Not creative in any way.Super-boring.Right. Super-boring.So we were like, okay, what is the least boring thing we can launch?Okay. All right. All right. So it’s up there. What are the prospects for SpaceX right now? You’ve got the rockets, the Falcon Heavy, you’ve got astronauts?Yes. Absolutely. So we launched Falcon Heavy, we launched the Block Five or version, sort of version five, technically version seven, of Falcon 9 this year. We were able to re-fly a rocket three times, which is great. We came close to catching the fairing with this weird ... we actually got a boat that, that’s quite a big boat, and then put this giant net over this boat and so it’s like this boat that’s a giant catcher’s mitt —For rockets?Yeah to catch the nose cone when it’s falling back from space.Okay. All right. Okay.Yeah, that’s pretty fun.And you caught it?No. No. We missed, unfortunately.Okay, all right.But we get close. We got close.All right. Where is this boat?I think it’s moored in L.A. or something.All right. It just floats around and catches nose cones?Yeah, yeah. It’s a boat with a giant net.Okay.And it sort of —What’s the net made out of? Metal, right?No, I think, like, nylon or Kevlar.Okay.Yeah, so we were close to catching the fairing. And then next year, the exciting things are we’re gonna be launching astronauts for the first time to the space station.Okay.It’ll really be the first time a vehicle from the United States launches astronauts into orbit since the Space Shuttle, which —Which has been some years, right?2010 or something like that?Yeah, it’s been some years.Yeah, yeah, so since then, the United States has relied upon the Russian Soyuz, which actually recently has had some issues. And that ... so for the first time, around the middle of —You’re gonna give them a ride there.... middle of next year. Yeah, the ... for the first time since the Space Shuttle, a U.S. vehicle will transport U.S. astronauts to orbit.What do you think of the Space Force? The Trump Space Force?Well, this may be a little controversial, but I actually like the idea. I think it’s cool. You know, like, when the Air Force was formed, there was a lot of like pooh-poohing, and like, “Oh, how silly to have an Air Force!” You know, because the aircraft in World War II were managed by the Army.Right.And so you had the Army and the Navy and the Coast Guard and the Marines, and then ... it became pretty obvious that you really needed a specialized division to manage aircraft. And so the Air Force was created. And people today may not realize back then it was wildly panned as a ridiculous thing to create the Air Force, but now everyone’s like, “Obviously you should have an Air Force.” And I think it’s gonna become obvious that we should have a Space Force, too.Out there, to do what?Well, I mean, I kinda think it’s ... You know, it’s basically defense in space. And then I think also it could be pretty helpful for maybe expanding our civilization ... You know, expanding things beyond Earth.Right.You know, the Space Force could be something that ... Like, I think we could just have a base on the moon, for example. A base on Mars. Be great to expand on the idea of a Space Force. Like, you know, I think ... for explorers ... anyone who has an exploratory spirit, and I think that especially applies to a country like the United States, where you know it’s kind of the distillation of the spirit of human exploration. I think the idea of being out there among the stars and among the planets is very exciting.Yeah. Do you think the Trump administration has a commitment to it, or is it just, “Let’s have a Space Force?”I don’t know ... I haven’t had detailed conversations.Right. Right.But I do think it will become obvious over time that a Space Force is a sensible thing to do.All right. And, Mars. Last time we talked it was 2024, was it? That you talked about getting there?Yeah, we’re still aiming for 2024.Okay. And you going? Or someone going?I don’t know if I will go or not. It may be just an unmanned mission, you know. I’m not sure if there’ll be people onboard or not. But there is a Mars rendezvous opportunity, ’cause you can only do a launch to Mars roughly every two years. So around the 2024 timeframe, there’s a rendezvous opportunity for Mars, which hopefully we can catch. There’s one in 2022 —So an unmanned flight to Mars?Hopefully, there are people on board. But I think there’s a pretty good chance of at least having an unmanned craft go to Mars. I think we will try to do this.Try to do this?Yes.And working with the U.S. government? Working with?Well, I suspect by the time we make enough progress to wanna try to do it, I suspect that the U.S. government will be interested in doing this, too, or being part of the effort. But I think ... the vehicle that we’re designing right now, which is sort of code-named BFR, I’m thinking of changing the official name to Heart of Gold.Okay. As in Neil Young?Well, I do like that song, but it’s more like the spaceship in “Hitchhiker’s Guide to the Galaxy.”Oh, right. Oh, sure, yeah.And it’s powered by infinite improbability. I still think it’s the great ... This is like a very great power source.What was BFR? What did BFR stand [for]?BFR is, to some degree, a Rorschach test on acronyms. But officially, it is the Big Falcon Rocket.Okay, the Big Falcon. What is the other thing you want to call it? Big Fucking Rocket, what?It’s a Rorschach test.Okay, Big Fucking Rocket. That’s what I would say, that would be mine. So, how do you assess your ... Again, first of all, one, do you think NASA should continue to exist, or all these space agencies by the government? How do you look at competitors, say, like what Jeff Bezos is doing?Yeah, I certainly think NASA should continue to exist, NASA does a lot of really useful things, and these go beyond astronaut transport. There are missions to rovers on Mars that are thanks to NASA. There are these planetary probes, there’s the Hubble Telescope, there’s a ... So, NASA does a tremendous amount of good, so I definitely think we should ... NASA should continue, and ideally we should actually increase the budget of NASA, and we’re really ... I think it’s high time that we went beyond Earth orbit again. I think it’s very exciting and inspiring, and I think it really gets the whole world fired up.It can, yeah.It can, yeah. I mean, when the first humans stepped foot on the Moon, it was probably the most inspiring thing, maybe in history?Probably. Yeah, I just saw the movie, the “First Man,” it was like —Yeah, it’s like, if it’s not the most inspiring ... I think it’s the most inspiring thing in history for Earth as a whole. We should try to do more of that stuff.To Mars, or wherever.Yeah.All right, we’ve got to get through a couple more things, I know you have limited time. But how do you look at what Bezos is doing with Blue Origin, because I suppose that’s the most comparable private thing going on?Yeah, I think it’s great that Jeff is spending lots of money on space. And they are a competitor, but it’s good that he’s spending money on ... that he’s spending a lot of money on developing rockets. I think it will encounter some challenges getting to orbit, it’s remarkably difficult getting to orbit. But he has the resources to overcome those difficulties.He does, he seems to be.He seems, he’s got some spare —He’s got some cash.Some spare change in the couch, I think.You’re not buying a newspaper, are you?No, I don’t generally acquire things.Yeah, just curious.I create companies, but I don’t really acquire them. So I wouldn’t ... I have no plans. It does seem to be popular these days.It is, it is. Benioff bought one, but ... yeah.Yeah, yeah, totally.What would you buy if you could?Wait, is there something you think I should buy?I don’t know, what do you want to buy?I mean, do you have any suggestions?I don’t know ... I was just interviewing the publisher of the New York Times and I said, “Would you like a billion dollars from one of these people?” He didn’t want it, I found that unusual. Think of the things you could do with a billion dollars.Don’t know.Jeff has more of them than other people, but ... you know?Yeah, he does have a lot. Speaking of the vagaries of stock price, though, it’s like Amazon shot way up and then it went down. And I think Amazon is a great company and Jeff’s done some amazing things, and Amazon is obviously one of the greatest companies in the world. But I imagine that they experienced challenges when the stock price rises so much and then falls, and it’s —Yeah, not quite as much as you. It’s usually over a package delivery, it’s not quite the same level of difficulty.Yeah, but it’s, what, dropped 30 percent or something. That’s quite a lot, you know?Yes, it does, it goes up and down. And he faces issues with the government and everything else, and the tax, and stuff like that. So let’s finish up the last two things. Boring Company, I was just with Eric Garcetti in Los Angeles —Oh, great, yeah. Eric’s been a —He’s a big fan.Yeah, Eric’s been a great supporter.Yeah, he has. He says, “Anything to cut traffic.” He doesn’t care. And he told me he thought ... I was like, “Why do you think these people are interested in traffic so much?” And he said, “Because no matter how rich you are, everybody can get caught in traffic. And so they just want to do something about it.”Yeah, Eric’s been really supportive of our activity in L.A. I mean, technically, our first tunnels are in Hawthorne. But we do expect to, over time, create a network of tunnels under greater L.A. And I think this is really the key to getting around the city very fast. You’ve got to go 3-D. Essentially, we have a 3-D ... our offices are 3-D and dense, but we then have a 2-D road transport network, so it’s ... And everyone would just go in and out of the buildings at the same time, so, naturally, you’re going to have traffic. It’s like —So you’re thinking all around, lots of roads within the tunnels?Yeah, many levels of tunnels, so —Right, like a subway system?Yeah, but even subways tend to be essentially two-dimensional. You’ll have a subway cross another subway, but they’ve never really tried to make many layers of subways. The cost of tunneling, historically, has been prohibitive. And they’ve also been incredibly slow. So, if it takes ... I don’t know how long. Say the New York Subway had a one-mile extension or something, and it cost —Well, San Francisco, they’re still building it.Yeah, exactly. I know that L.A. has a subway, although people don’t ... most people don’t —It’s good, I use it.Is it good?Yeah, it’s good.You’re the first person I’ve met that actually uses the subway.I use it, sure. I use all public transportation.Well, they had a two-mile extension, or two-and-a-half-mile extension on the subway that cost $2 billion. So the typical cost for a subway, per-mile cost for a subway in the U.S. has been about a billion dollars a mile, so that is not a very scalable solution.So tunnels?Yeah, so you really have to ... We have to massively improve the technology associated with digging tunnels so that —And the tunnels themselves, being 3-D tunnels versus 2-D tunnels?Being many layers. I mean, you could do ... you could certainly have a subway system which had many layers of tunnels, but the tunnels are so prohibitively expensive that they don’t do it. But you can go down 100 levels if you want to, you could have 100 layers of tunnels on top of each other, it’s ... You can go further down than you can go up. So the deepest mines are much deeper than the tallest buildings. But, really, the key is a massive improvement in tunneling technology. That’s the linchpin, that’s fundamentally what it amounts to. And as I got sort of digging into tunnels ... Ha-ha, good one.Do you say that? Please don’t do that, you need to stop. Is that how you amuse yourself?Yeah, yeah, no, I’ve got a million of ’em.“Digging in?”Tunnels are really so underappreciated.They are, okay. All right, okay.They have no place to go but down.Oh my god. All right, okay. These are dad jokes, you know that?I am a dad, so —I get that, but —Yeah, totally. So —I’m glad you’re amused with yourself, go ahead.Yeah, no, no I definitely am amused by myself, it’s a terrible habit. Terrible habit.That’s obvious. So, tunnels!Yes, tunnels. So, the —Elon, you’re not even high and you’re laughing at yourself, come on, let’s ... Tunnels! Tunnels!No no, it’s a terrible habit, I laugh at my own jokes, even with the terrible ones. So, what I discovered is that there are massive improvements possible in tunneling technology, and I found ... I always look at things from a fundamentals-of-physics standpoint, and so if you sort of apply physics’ first principles to any given technology endeavor, you can sort of envelop the possibilities. And what I discovered in talking to the engineering heads of the various tunneling companies is that they actually did not know what ... I had no idea what the true potential of tunneling was.’Cause the first question I’d ask is, “Well, is your tunneling machine power-limited or thermally limited?” This was a very obvious question from a physics standpoint. Nobody knew. None of them could answer that question. I was like, “Okay, this is not a good sign.” And the answer is, basically everything’s power-limited within the framework of how much you can transport heat away from the face using some sort of liquid cooling system. But we’re so far away from that, it’s ... We’re crazy far away from that.Of being able to do that?No, of being anywhere near the thermal limit. Things like increasing power is relatively easy, and then you hit the threshold where you’ve added so much power that you’re melting the drill head.Exactly, yeah.So then you have to put a lot of effort into cooling the drill head in order to not melt it, or go with advanced ceramics. But then you still have to cool the bearings and the bearing housings. So I’m used to a lot of this stuff from rocket engine design, for example. The turbopump on the Merlin engine runs at like 36,000 RPM. It’s got 10,000 horsepower and weighs —So applying the rocket technology to what you’re doing with tunneling?Yeah, essentially taking rocket technology and automotive technology and applying it to drilling technology.Right, so the problem is, it’s too hot? It’s too hot.We need to massively crank up the power to the drill head, and then ... then we need to cool it. But the first step is simply jacking up the power like crazy, and then automating the placement of the tunnel reinforcements, so that the tunnel —So you don’t have to continue to be going slowly and building it?Yeah, like right now, tunnel machines will drill for a bit and then they’ll stop, and people will put in ... very slowly put in the —The reinforcements?The reinforcing segments. And so tunneling machines basically go at half-speed.Right, I think of that a lot about house construction, how slow it is. Why is house construction so slow?Well, you can make house construction crazy-fast if you’re in a factory.Yes, or other ways. Just a totally different topic, but it’s the same.Yeah, construction in general is ... I think there’s a lot of potential for disruption and for entrepreneurs to enter construction in general. There’s a tremendous amount of opportunity. Anyway, so massively cranking up the power of the drill, then making the drill battery-powered ... which is not something they’d ever considered. But if you don’t make it battery-powered then you’ve got to have this massive cable —Behind it?Yeah. And then the cable, in order to have the cable manageable at all, has to be an 11 kVA ... 11,000 volts cable, and even then it’s thick. And then you’ve got to have step-down transformers for the drill head-Down the way?Because the drill head’s going to operate at 480 volts or thereabouts, it’s not going to operate at 11,000. So you’ve got these massive transformers, this crazy cable length, the —Slow?Yeah, it’s very slow, and then this is what blew my mind. They’re using a diesel locomotive. The standard practice is to use a diesel locomotive to transport the tunneling segments to the drill head and to transport the dirt out, and to use it — and a one-way.So it’s like an old coal mine?Yeah, it’s pretty weird. So, if you’ve got a diesel locomotive in a tunnel, then you’ve got to put massive effort into blowing clean air into the tunnel and getting ... ’cause you’ve got the —How else would you get the dirt out?Oh, well, we’d just use an electric car.Right, right, right.Yes, we took a Model 3 chassis and converted that into a train, a Model 3-powered train chassis, and so now we have a —So you don’t need to worry about the rest of this stuff, right? No tracks, no?It’s not consuming oxygen and spewing noxious fumes, this was a big improvement.Right, so when are these happening? When is this ... when will one be useful? The Hawthorne one? The test tunnel, it’s a test tunnel?Yeah, we’re about to finish the first test tunnel.At what cost?I don’t know, I think it’s probably ... Excluding the equipment, probably cost us $10 million for a mile.Right, to put this in? To put this in. So, I’m going to finish up —It’s one-way, admittedly, but —So when will people be able to use it, actually use it?We’re planning on having an opening party on Dec. 10th, in six weeks.On December 10th, six weeks?Yeah.And what’s gonna go through there?Yeah, you wanna come?Sure, I’ll come.Yeah, this’ll be a very one-dimensional party.It’s the day before my birthday, that would be great. That would be great, or something. One-dimensional party, very funny, very funny. So, I’m going to finish up. One thing I didn’t ask ... All this is money, the amount of investment you put in here. Did you, when you had been looking to go private with Tesla ... I just have a few more questions. When you had been looking to go private with Tesla, you had talked to the Saudis, how do you feel about them now? I ask every internet executive this now, given the amount of money they have in the system.Yeah, well I mean, it’s important to appreciate that the Saudis have been approaching me for two years about going private. It wasn’t like spur-of-the-moment.But I’m talking about in the wake of Khashoggi’s murder.Yeah, I mean, that sounds pretty bad. So ... that is not good. That is bad.That is bad.That was really bad, it was really —So, do you think about that? Because there’s been this sort of techlash against Facebook, that’s not your area, Facebook and social media ... But there’s been a real backlash against where the money is coming from, the damage on society. You’re not the only person in tech, but it all washes over tech. How do you look at that?Sorry, are you asking about the Saudis or something else? Okay.Let me ask about the Saudis first. Would you take their money now?I think we probably would not, yes.Okay, and what about their influence in Silicon Valley, given the billions that are being poured in here?I know I can’t speak to that, I mean, it’s not ... Saudi Arabia’s an entire country, so I think you don’t want to, if there’s one really bad thing that occurred, nail down the whole country, it’s not great.It’s their ruler.Sure.It’s their ruler, it’s the guy who runs everything.They didn’t elect him, you know?No, they didn’t, that’s right. No, I get that, I’m not impugning all Saudis, but it is the government.I think we should just consider that there is a whole country, and there’s, you know ... There are a lot of good people in Saudi Arabia, and Saudis who are outside of Saudi Arabia. So I think you cannot paint an entire country with one brush.No, no, I’m just talking about the people who have the money.I think there are serious issues, it’s not good.Serious issues. And what about the techlash itself? Again, that’s the word they use, the techlash. I mean, you had been a critic of how — the responsibility around AI, around diversity of AI. About the power that’s held by Facebook and Google and others, in previous interviews we’ve done. How do you look at that now? You’ve been one of the few that have raised issues about worrying about the ethics of it, and everything else?Yeah, I think there’s probably ... It probably makes sense if something is responsible for a public good, and could potentially negatively affect elections or something like that, that there probably should be some regulatory oversight to ensure that we’re not negatively affecting the democratic process. That the quality of news is good and not unduly influenced. These seem like sensible things.Are you still worried about the power that Google ... At the time we’d talked a couple years ago, you were worried about the power that Google and Facebook were assembling in AI, and you were worried about AI itself. And I think one of the things that you had said that really struck me was that it wasn’t going to kill us, it would treat us like house cats. I thought that was a really striking way to think about it.In the long term, if it ... As AI gets probably much smarter than humans, the relative intelligence ratio is probably similar to that between a person and a cat, maybe bigger. I do think we need to be very careful about the advancement of AI and —And you’re still worried about it in that way?Yeah, I think ... I mean, my recommendation for the longest time has been consistent. I think we ought to have a government committee that starts off with insight, gaining insight. Spends a year or two gaining insight about AI or other technologies that are maybe dangerous, but especially AI. And then, based on that insight, comes up with rules in consultation with industry that give the highest probability for a safe advent of AI.You think that — do you see that happening?I do not.You do not. And do you then continue to think that Google —No, to the best of my knowledge, this is not occurring.Do you think that Google and Facebook continue to have too much power in this? That’s why you started OpenAI and other things.Yeah, OpenAI was about the democratization of AI power. So that’s why OpenAI was created as a nonprofit foundation, to ensure that AI power ... or to reduce the probability that AI power would be monopolized.Which it’s being?There is a very strong concentration of AI power, and especially at Google/DeepMind. And I have very high regard for Larry Page and Demis Hassabis, but I do think that there’s value to some independent oversight.They’re in the thing. All right, very last question. I’m not going to go into “simulation,” because that’s the last time you blew everybody’s mind when we talked. Are we still in a simulation? No? Yes? This would be quite a thing right now.I think sometimes when I mention the simulation, people infer that, “Well, therefore we shouldn’t take what appears to be reality seriously.” And I do think we should take what appears to be reality seriously, yeah.Okay, but you did say there was a chance that we are still in a ... Last time we talked —I said, “What appears to be reality.”You’re right, you said it, you’re right. Okay, in this reality, when you look at it, how are you feeling about the future, when what appears to be reality ...?For some reason, I feel optimistic. And I’m not sure if that is irrational or not, but that is my —Why are you feeling that?My current gut feel is weirdly optimistic.Because, given this polarization?I don’t know, don’t know.Does this polarization affect you? You’ve pulled yourself off the Trump councils, I know you and I talked about whether ... I said you shouldn’t go ’cause he was gonna screw you, remember? We had a whole —Well, you were right.I am right, thank you, Elon. I know that. But you feel, in the midst of this polarization, these bombings, the president continually being divisive, you feel optimistic?Yeah. By the way, I still think it was worth trying on the Trump ... to be on the Trump councils, and especially just to be an advocate for climate, I did my absolute best, and it’s sort of —Yes, I know you did. I think I called you, I think I said, “You’re not Jesus, it’s not going to work.”I definitely do not think I am Jesus.No, I know you don’t. I think I was just trying to egg you into getting off the councils.Arguably, it was unlikely, but it was worth a shot, yeah.Right, would you do it again?Do you mean now, or ...?Yeah.I don’t know, are there councils?No, there aren’t. Do you continue to engage on climate and the things that are important to you? I know gay rights and transgender rights are, also.Yes. And, actually, I’m not sure if you know this but in terms of ... LGBTQIA? This like a very quite complicated —Mm-hmm, whatever. Don’t, don’t.Yeah, but —You’ll miss a letter.Totally. I’m like, “Do I have all the letters?”There’s a new letter, no there’s a new one.Oh no, okay. But there’s an independent organization that evaluates companies in terms of their ... let’s at least for now, say just LGBTQ-friendliness. And we’ve gotten 100 out of 100 every year for like four or five years running, so —Yes, you’ve been very supportive.Yeah, absolutely.But optimistic, you’re optimistic, given all this polarization? Are you not worried about it? Are you thinking about the midterm elections?I am thinking about the midterm elections, and I did vote, by the way.Me, too, today.Though I do wonder what effect a vote in California has.Right, fair point.There’s so much gerrymandering of electoral districts that it seems like ... I voted for the sake of voting, but things are very divisive right now, politically. But it’s probably not wise for me to wade into political debates, it’s a no-win situation.Right, I got it. But how do you feel — as a citizen, how do you feel?I definitely wish people wouldn’t yell at each other quite so much, I wish there was less hate.Any solutions? I guess you can’t come up with a gadget for that, can ya?No. I mean, I think the ... I feel we’re doing a lot of good here at Tesla on the climate stuff, and also making products people love. It’s one thing to make an electric car, but can we also make a product that people love, that really makes them happy?Right, well that’s the point, right?There’s not many products you can buy that really make you happier. And so Apple did that for a long time, I still think, obviously, that Apple makes great phones, and —The earbuds make me very happy, I don’t know why.The ones without the cable?Without the cable, I love them. I look terrible, I love them. You know, the earbuds [AirPods]?Yeah, the one without the cable?Yeah.Yeah.I still like Apple products, they still make me happy.No, I still use an iPhone and everything. But Apple used to really bring out products that would blow people’s minds, you know?Right.And still make great products, but there’s less of that.That’s your goal?There’s less of that. I don’t think people are necessarily running to the store for the iPhone 11. But I think with Tesla, we really want to make products that people just love, that are heart-stopping.Right, okay, my last question. If you had to redo anything this year, Elon, what would it be? Besides your ... apparently, you did sumo wrestling? Obviously that’s one of —That was five years ago.Okay, all right.My back still hurts.Your back still hurts. What would you redo, and you can’t pick sumo wrestling.I would definitely not do that again. Forty-five minutes of sumo wrestling has caused me five years of back pain, so ... I mean, it’s fair to say I would probably not have tweeted some of the things I tweeted, that was probably unwise. And probably not gotten into some of the online fights that I got into. I probably shouldn’t have attacked journalists, probably shouldn’t have done that.I don’t know why you do it.Yes.Yeah, do you want to say you’re sorry? No. You can if you want.I’m sorry to some journalists.Okay, I’ll give you that, I’ll give you that. Okay, I’ll give you that. Elon, podcast secured.Thank you, Kara. It was great to see you.Thank you so much, I appreciate it. You kept your promise. Elon and I have been emailing about this, and you do keep your promise compared to a lot of other people, and I appreciate it.Always, it was great to see you.It’s been a really fascinating discussion, and I will think about buying an electric car, probably not. I’m not going to try to —I mean, why not?Make a scooter. Make a scooter and I’ll go for it. They actually are electric, what am I talking about? They’re electric.I don’t know, there was some people in the studio who wanted to make a scooter, but I was like, “Uh, no.”I love the scooter, no, get on the scooter.It lacks dignity.No, it doesn’t lack dignity.Yes they do.They don’t lack dignity, what are you talking about?Have you tried driving one of those things? They —Yes, I do it all the time, I look fantastic.They do not, you are laboring under an illusion.I truly do. Well, I think I look good, and therefore —This is an illusion.“It lacks dignity.”It lacks dignity.All right, well, everybody at Lime, don’t worry, Elon Musk is not coming for you.Electric bike, I think we might do an electric bike, yeah.All right, okay. All right, perhaps. All right, Elon Musk, thank you very much. I appreciate it.That was a pleasure, thank you. It was good to see you.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}