{"id": "San Francisco’s Prop C homelessness tax was a big win for Marc Benioff, but legal challenges may be coming", "paragraph": "Tuesday night was considered a sweeping victory for supporters of San Francisco’s homelessness tax, Proposition C, after the measure won 60 percent of the popular vote. But it looks as though the battle has only just begun.Proposition C will raise the city’s gross receipts tax on companies by an average of .5 percent on annual gross receipts over $50 million, with funds earmarked toward helping the homeless. Opponents are challenging the results of the election, saying that it needed to pass by two-thirds instead of a simple majority in order to stand on solid legal ground — an assertion that is not supported by the city attorney’s office. The risk of legal action is now causing uncertainty among San Francisco city leaders over whether they should spend the estimated $250 million to $300 million a year the tax will bring in, since they might have to give that money back if any legal challenges are successful.Citing “current legal uncertainties associated with the measure,” the city controller’s office sent a letter to San Francisco Mayor London Breed saying that it will collect taxes for Prop C beginning in 2020 but hold off on spending the funds until there’s further clarity. That’s assuming that current election results remain final in the coming weeks — if the numbers change (not likely) and Prop C actually has two-thirds of the vote, then a legal challenge becomes moot.Getting this resolved by the courts could take years, according to the San Francisco Chronicle, and Prop C’s funding for the homeless would be sit unused in the meantime. Breed, who opposed Prop C, discussed the implications of that possibility in a press conference Wednesday.“There’s still some uncertainty around Prop C. We’re not sure when the funds will be available to be used,” she said at the press conference, which was posted online by NBC.  “We can’t wait for Prop C to go through the court systems in order to act.” she said. Breed also wrote in a press release Wednesday that she agrees with voters that the city should build more housing and shelters and that “business can pay more to make that happen.”Salesforce CEO Marc Benioff, one of Prop C’s biggest supporters, dismissed legal concerns.“The people have spoken. It’s a 60 percent landslide victory for them,” he said, according to a transcript of a meeting with reporters on Wednesday. “There can always be legal challenges, but the reality is that the city needs to go ahead and now implement Proposition C — it’s the will of the people,” he said. The argument boils down to a legal question about whether special tax measures like Prop C require a two-thirds vote or just a simple majority to pass. Currently, there are two pending cases over previous San Francisco ballot measures that could either strengthen or weaken Prop C’s legal footing. Because Prop C received 60 percent of the vote, it would fall short of a hypothetical two-thirds requirement — but whether that’s necessary is up for debate. Jess Montejano, a spokesperson for the No on C campaign, which is led by the San Francisco Chamber of Commerce, wrote in a statement that the city ultimately won’t “see a penny” from the measure because the vote didn’t result in a two-thirds majority.So far, opponents of Prop C have not formally filed a lawsuit on the matter, but San Francisco City Attorney Dennis Herrera has said that if they did, his office would defend the popular vote. “We take our duty to protect the will of the voters very seriously. A clear majority of voters passed Proposition C, and we will defend their decision in court,” Herrera wrote in an email to Recode sent by a spokesperson. Tech’s opponents of Prop C have largely stayed out of the conversation after the vote.Square spokesman Aaron Zamost — Square, along with Stripe, was one of the most vocal opponents of Prop C — declined to comment on whether the company supports potential legal challenges to Prop C, saying, “We look forward to continuing to work with City Hall to build a better San Francisco.” Stripe spokeswoman Kelly Sims declined to comment, pointing to the company’s previous statements in opposition to Prop C. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}