{"id": "Amazon’s HQ2 was a con, not a contest", "paragraph": "To dozens of cities across the United States, Amazon’s widely publicized search for a “second headquarters” looked like thousands of new jobs, up for grabs. To Pivot co-host Scott Galloway, it now looks like a “ruse.”“I lease office space all the time for my businesses and I always tell my real estate agent, ‘We can lease any office in the world as long as I can walk there from where I live,’” Galloway said on the latest episode. “Amazon is now talking about having three headquarters, Seattle, Crystal City and Long Island City. The Bezos’s also own three homes, and the average distance from those three homes to a headquarters is 6.4 miles.“This was never a contest,” he added. “It was a con meant to induce ridiculous terms that they then took to the cites all along that they knew they were going to be in.”In other words: By soliciting bids from lots of place where it was never going to move, Galloway alleges, Amazon was probably able to get more tax breaks from the pre-determined “winners.”“I would bet, Kara, that when they pick two cities and they went to 2 and 3, they didn’t say, ‘Well, only half our headquarters is going there, so we’re going to let you cut the tax subsidies and incentives in half,’” he explained. “This just has ill will written all over it, and I think people started to figure out what was going on ... It’s the Olympics on steroids. A lot of high fives and ribbon cutting, and then 10 years later, we realize it was a bad idea.”You can listen to Pivot with Kara Swisher and Scott Galloway wherever you get your podcasts — including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a full transcript of Kara and Scott’s latest episode.Kara Swisher: Hi everyone, this is Pivot from the Vox Media Podcast Network. I’m Kara Swisher.Scott Galloway: And I’m Scott Galloway, future ambassador to Estonia after delivering southern Florida to President Beto O’Rourke in 2020. Oh, Beto. I’m so sad for you, Scott, that you didn’t get your Beto as senator from Texas.Yeah, gets 49 percent in Texas, raises money on a national level. Hello, Mr. President. But more importantly, Kara, key question: A few days in, how are you feeling about the election?Well, it’s a complicated topic and I have a lot of feelings. I have many feelings, I’m full of feelings about the election. I’m going to say how my son felt. So we get in the car and my son ... he wasn’t with me. I was at an election party last night, and he woke up, he was reviewing all the things with me. He is 13 years old and he goes, “I got to say, eh.” And that’s what he said. “Eh.” He goes, “Democrats really can’t deliver it, but the Republicans kinda suck too.” And I was like, “And: scene.” That is exactly what the situation is. So, eh. Yeah. So you’re not terribly upset, not terribly happy. Just sort of meh. Yeah. We just can’t have nice things, as they say. We just can’t have nice things in this country. So that’s the way it is. It’s fine. You know what? Gridlock is good. As far as I ... In this situation, I’m good with gridlock, so it’s fine. That’s what we got. That’s what we’re getting. I’m going to live with that. Gridlock is good. So, anyway!Bring it down to tech. Do you think this means anything in terms of the tech sector? No, no. I think they’re not going to get regulated now because “gridlock is good.” You know what I mean? I think there won’t be any moves, any serious moves, unless they can all agree that tech, that may agree on the bipartisanship that technology companies need to be regulated. Maybe that will happen. I think you’re gonna see a lot of that from the states, like Gavin Newsom in California and some other states. You’re going to see action that sort of makes the tech companies come to heel a little bit. On the national level, I’m not so sure. I’m just going to have to find out. But Pelosi certainly is behind it, it’s just a question whether she can get the Senate to do the same. So we’ll see. We’ll see if we’re going to have a privacy bill or anything else. Probably not. Gridlock is the way, is the name of the game. Let’s talk about big stories that are going on. Obviously, you had a good prediction last week about Amazon being in the Virginia, the Washington, D.C., area. And, in fact, there were some leaks that it was looking at Crystal City, Virginia, Dallas, and New York City. Actually Long Island City in New York. Tell me what you think about this. I refer to this not as a contest but a con. I think it may have blown up in Amazon’s face. We’ll see.Because?Time will tell, but imagine you’re the wealthiest man in the world and you get to pick, or you have more options than anyone in the world, and you’ve decided, “Okay ...” So, I’ll personalize this. I lease office space all the time for my businesses and I always tell my real estate agent, “We can lease any office in the world as long as I can walk there from where I live.” That is the exact same instruction that Jeff Bezos gave to this ridiculous con, this ruse. Because if you look at... Amazon is now talking about having three headquarters, Seattle, Crystal City and Long Island City. The Bezos’ also own three homes, and the average distance from those three homes to a headquarters is 6.4 miles, so this was never a contest. It was a con meant to induce ridiculous terms that they then took to the cites all along that they knew they were going to be in. Also, the whole HQ2 and 3 is also a bit of a con and bad faith. It’s like if you’ve ever been to your kid’s charity school auction and there’s a frenzy for bidding on dinner with the headmaster and someone bids $9,000 and someone bids $10,000 and then they decide right then, well, we’re going to do two dinners. Thank you for the $19,000. Because I would bet, Kara, that when they pick two cities and they went to 2 and 3, they didn’t say, “Well, only half our headquarters is going there, so we’re going to let you cut the tax subsidies and incentives and half.” This just has ill will written all over it, and I think people started to figure out what was going on. So what did they do? They’re like, “Oh, the con is up. They figured out this wasn’t a contest and we’ve abused the Commonwealth and wasted resources and time of municipal officials. What do we do?” Announce it into the busiest news cycle of the year. No accident that they announced it last night. Right? Well, here we are. Here we are. What’s really interesting is having a second headquarters. I don’t quite know what that means. I’ve heard rumors of Apple having a second headquarters, etc. I’m not sure what the point of a second headquarters is.Money. Give us money. It’s a handout. Sticking your hand out. Yeah, but why? Second headquarters ...Just call it a headquarters and make it an office? It was an office, they’re just going to call it… ?Yeah, but if you call it a headquarters you get everyone whipped up and every elected official wants to be the person to detonate a prosperity bomb in their Times Square, so they’re willing to write big checks. So it’s branding. So, it’s a new stadium. Yeah, that’s right. It’s the Olympics on steroids. A lot of high fives and ribbon cutting, and then 10 years later, we realize it was a bad idea. Right. Well, we’ll see. I mean, it’ll be interesting. It does seem to have gotten flat. The balloon has gotten flat here on this Amazon headquarters. I’ve always thought it was a ridiculous circus.You don’t think it’s going to be a big deal. You just kinda, it’s kinda come and gone. No, I said that. On CNBC they were to covering it like, oh, breathlessly. And I said, “I hope you’re enjoying this circus.” They’re like, “What do you think?” I’m like, “Not much. I don’t think much of it at all.” I don’t think about it, really. I don’t think it is that big a deal. I don’t think it’s that ... I don’t know, analog places, that whole game is lost on me in every way, but I can see why the TV or whatever breathlessly covers it. It’s just kind of silly and it doesn’t help the ... What I really am interested in is how companies that are in the cities, like right now in San Francisco with Prop C, how the businesses helped the cities and how they take up their civic responsibility, because I think especially tech businesses really haven’t picked up, in terms of what they need to, the responsibility of being a civic citizen of any city they’re in. That’s my focus, really. When are they going to actually behave the way banks did years ago and give money to the opera or give money to music or kids, whatever, programs and things like that. So that’s what I’m looking for. And you don’t think, on average, they’re good citizens? I think Marc Benioff has been, you know what I mean? But I don’t, no. I think they operate in their little areas and they have lovely kombucha shakes up on the 10th floor and looking down and they don’t participate in the city at large, and they drive up rents and I don’t think ... I think there’s a reason people, for example .... San Francisco, come to San Francisco and see where everything is headed, if you want to see the future. You can see haves and have-nots, filthy streets, not a lot of civic engagement by the tech community, which is the biggest employer in San Francisco. So you’ll see, you’ll see the future as far as I’m concerned. We’ll see if we can clean it up, but it’s up to now the city officials to clean it up and figure out a way, and most of tech didn’t like the idea of Prop C for lots of reasons. Some of them good, where does the money go? But in general, it’s not a feeling that they ... even if they’re of the city, they’re not of the city. So I think companies have to start acting like they belong to a community. Thank you very much. Do you think they’re going to do that on their own, or we just going to do ...I approve this ad for Kara Swisher for mayor. What? I’m sorry.I’m in. I’m right behind Beto. Do you think it’s fair or realistic to expect they’re going to do it, or we need to elect people that have the backbone to hold these companies accountable?To make them do it. They should do it. They should do it, but you know, whatever their ... we have to make them. That’s all. We just have to make them. Yes, exactly. And not roll over for them and give them these perks and things like that. It’s just a ridiculous game. To your point ...It should be a privilege for these companies to be in San Francisco. Yeah, I agree.Not a tax break.Most beautiful city in the union. I spent 10 years there, but I don’t go back a lot.Not anymore. Don’t go back.When I go there, the impression I get in the way ... I would describe my experience there as, I went to go meet with an individual who runs one of these tech companies who’s early 30s, a billionaire, and going into the office this thing I noticed was the number of severely mentally ill homeless people on the street below that building. I thought, “We really have become a dystopia.” I mean, it is just a contrast. It’s changed a lot in the past two years. It’s rattling. I mean, really rattling. It is. It’s rattling. And so we have to do something about that, and companies should be a part of the civic fabric of a society and they have to move in and they should do it on their own, but you know, we’ll make them. We’ll have to make them. That’s all. Yeah.Let me finish this other big story. Go ahead.The divided Congress, what do you think that divided Congress means? So, I think there’s this fissure on a bigger level, and I think of how it translates to business, and that is: We now have about 70 percent of the Senate is elected by about 30 percent of the populace. A lot of these red states don’t have big populations, either they lost population or they just get two senators regardless of the fact that Wyoming has a population that’s smaller than most congressional districts, but at the same time, over the last 10 years, if you look at who’s accreted the majority of the income gains, they tend to be people into the cities with college educations, which is Latin for progressives. So you have the economic power or the people capturing the income gains are progressive and yet you have the political power going to the red states. So what I think you’re going to see, Kara, over the next several years is kind of this “woke as a business strategy.” Similar to what Nike did with Colin Kaepernick or Dick’s getting rid of assault rifles. I think that a lot of companies are going to decide to try and be overtly political and appeal to progressives who don’t feel represented politically, but quite frankly have all the money. So you’re going to see increasing political viewpoints. Yeah, like Nike, Patagonia. Exactly. Starbucks. Companies are going to come out and say, “Hey, progressives, we’re your company.” It might be a principled thing to do.Because you have the money.It might be generally how they feel, but it’s also a shareholder-driven thing to do. Yeah. That’s interesting, because you have the money. That’s interesting. What Land O’Lakes did with that awful person. I can’t even say his name. He won. I can’t believe it. You’re going to see a lot of that.I’m not going to speak ... Whatever. Really? Oh, God. I’m glad Land O’Lakes did that. All right, Scott, what’s up? What’s next?  Let’s try something out. The midterms are over, but can we come up with an assessment of how fake news ... How did social media do? Were we influenced? What happened here? What’s your view? Well, it’s interesting. I was just talking about this with ... I was talking to WNYC in New York about this. I think that they’re trying. They’re starting to clean it up, obviously. They keep announcing how many, like I took off 30 accounts, whatever. This is a cockroach problem, right? This is going to be an ongoing problem. It’s not going to be suddenly just cleaned up, and so I think what we’ve got to do is as these stories die down, like the Russia story, whatever, we’ve got to really hold these companies’ feet to the fire on persistently making it a cleaner and cleaner place. It reminds me, I was trying to think of an analogy, but it’s like they’re chemical companies that are dumping stuff into the river, they got to clean it up now, and they got to figure out a way. Now, look, there’s been some damage. There’s been some poisonings, but they’ve got to clean it up now and figure out a way to do what they do and grow how they want to grow without continually doing this.So every time they make an announcement, they call me, I don’t care. I was like, “This should be your job.” It’s like saying the New York Times should spell the word “and” right. I just, I feel like we’ve got to make it their jobs and make sure they realize that that’s what they need to do. So let’s move to the how, and I want to propose an idea, and you tell me why it would or wouldn’t work. I’m fascinated with this concept of identity. I’m in Los Angeles right now, and everyone is just so friendly in the Starbucks line, then in the moment there’s a little bit of anonymity, and you’re in your car, there’s road rage everywhere. Then take that times 10 when you can invent a fake identity or 100 of them on Twitter or YouTube, and there’s not only a lack of civility, there’s people willing to engage in things that are unthinkable and damaging to the fabric of our society. Why wouldn’t we demand or legislate that when people go online in … on formats that have shown themselves to be very powerful, influence elections, suppress voter turnout, that you have to have an identity and be who you say you are?Yeah. Yeah. I think that’s critical. I think being anonymous makes sense in some cases. In some countries, that’s the problem, and in being able to protect yourself in countries that are autocratic. So I think it’s a big question, but in other countries, it’s not the case. I always think that being anonymous ... And these bots, it just drives me crazy that they haven’t been able to handle these bots, these bots gin up trouble and then humans get involved with them. To me, the bottom, the lowest bar is going to be get rid of bots and to make a lot of this advertising transparent. It starts with that, and then get rid of fake accounts, get rid of fake accounts and make sure everybody who has an account is a person, whether it’s a good person or not, that’s what’s going to be harder to decide. But, make sure they are actually a person. I think that’s what ... I’ve always thought anonymous was always a problem anywhere you go, because people act badly. I’ve heard smart internet analysts say that if any sort of identity mandate was actually put in place that Twitter would basically go out of business. That you have something between a third and two-thirds of all Twitter traffic that they advertise to justify their entire ad business or their ad model would literally just go away. That two-thirds of it is bot-driven and noise. Yup, yup, yup. That’s the problem. They don’t want to show exactly how unpopular they actually are. You know what I mean? I think that’s with a lot of things. Again, these companies would be better off creating a better service. I don’t get why they want to have a shitty experience for people. That’s the problem, because some of it’s so wonderful. I mean, I’ve had such a nice, interesting time on Twitter with this election, reading people, having opinions. It has a goodness to it that always gets superseded by the badness. To me, it’s really ... it should be a business problem, that they should recognize that. Yeah. I’m going to put on my tinfoil hat and come across as a conspiracy theorist, but I write a lot about politics and I’ve been very critical in certain instances about the GRU in Russia. And whenever I’m critical about Russian activity I immediately get comments saying, “Scott, love your stuff, but you got to get off the Russia bandwagon.” I started noticing that same sentence structure, same theme across different areas where I post my content from different sources and different identities. Now, I genuinely believe that if I were an economy 1/15th the size of the U.S. and I wanted to wreak havoc or promote my agenda, I would identify a thousand people of influence, or in my case, a million people of influence and set these troll farms loose on them.I now believe that there are bots or bad actors going after almost anyone in responding and putting up content and they’re not who they say they are. Does that sound ... am I paranoid? And which doesn’t necessarily mean I’m wrong, but do you think this is happening? No, I think ... yes. I mean yes. Broadly, yes. These are well-orchestrated campaigns by different people. And the thing that you have to realize is they don’t care what side they’re on, right? That’s the thing. They’ll go after Samantha Bee, they’ll go after Roseanne Barr, they’ll go after ... What I think is gonna happen is when they start going after — and they are starting to do this — companies and affecting, like, Disney. That’s happened already to Nvidia and it’s happened. Like, when they start to really, especially with video manipulation and things like that, you ain’t seen nothing yet. It’s not going to be a tweet. It’s going to be serious manipulation of video, of other kinds of things, and I think we’re just at the beginning of that for sure. But you know, it’s going to be a “great” future for us, Scott. That’s where it’s going. I’m in a down mood today on the internets because I think they haven’t...I was wondering how you were doing. I was trying to think of something to cheer you up and I couldn’t think of anything. I’m in LA-.You know what? Scott Walker lost. I’m good with that. I feel good about that. It would have been nice to see Ted Cruz go down.Dana Rohrabacher lost.Yeah. Oh yeah. Did that Devin Nunes go or is he still there to drive us crazy?I don’t think so. I think he’s in a district, I think he represents his district pretty well, actually, but the honest answer is I don’t know what happened. Well, good. He’s not head of the committee anymore. Goodbye, Devin. He’s the worst. He’s the person who uses tech for bad. There’s someone I would really like to ... Well, maybe I’ll interview him and let’s see how that goes. Anyway, last thing, we have predictions, but we’re going to contextualize it, too. So we always end the show on a prediction. Give us a prediction. Let’s just do a prediction. You have one. Correct? You have one to bring to us? Because you were good on the headquarters. You’ve been good on a couple of predictions. Casper has still not been sold, but otherwise you’ve been pretty good on it. Oh, that hurts. Casper absolutely will be sold. I think you’re right.Okay. So this is more macro, but I think the consumer world is going to distill to a small number of what I call recurring revenue bundles, and similar to what Amazon has done with Prime, you’re going to see some kind of mega brands, a Nike or a Walmart, decide, “Okay, I’m in charge of all of your, not only your shoes, but your fitness and maybe even your healthcare.” You can get a knee replacement from a Nike-endorsed orthopedic surgeon. You could stay at a hotel that figures out a way to get you breakfast that’s not terribly unhealthy for you, that has a gym that is Nike-approved and ...Where did you come up with this scheme? This is what I do. This is how I fake making a living.I just called it a “scheme.” That wasn’t really nice, but it is a scheme. Where did you come up with this?Well, I think, as I said, I smoke a lot of pot, so that helps. And I have an MBA, so that’s kind of the master cocktail for ridiculous business ideas that people will pay you a lot of money to hear. I’m pretty sure we’re going to edit that out, what I just said, I’m pretty sure we’re gonna edit that out. So you would pick ...No, but I think recurring revenue bundles are going to be the next big thing.Recurring revenue bundles. If you look at a company that makes more than $10 billion or $20 billion or creates more than $10 billion or $20 billion in market value over a 12-month period, you’re going to ... It’s going to be an equivalent or a mimic of what Prime is to Amazon. Some of these things. Like you’re an Apple person or you’re a this person? I don’t...100 percent, but it might go places you might not think. Apple might say, “We have a watch picking up on your health patterns. Kara, you would love Lululemon ...”Yeah, I’m not doing that, Scott. And we’re going to do a relationship with Lululemon and you’re going to let us know where you are and going to deliver stuff to you and make your life easier around health and fitness. No. I’m going to say no to this. I’m going to give you a big fat no on this. I don’t think they’re going to get into...You don’t buy it?I don’t buy it. I don’t buy it in any way. I don’t think Apple has any, I don’t think they have any expertise to do this, and I don’t think they have any interest in doing it, so I don’t think they will. I think they’re going to sell you a phone. That’s what they’re going to do, and people are going to stick to their knitting, as I like to say. They’ve all got to get into recurrent ... And by the way, the phone, I mean ...You may want them to, but they’re not going to do that. Apple’s not going to get me Lululemon. By the way, my son wears Lululemon. FYI. He likes their shorts.Every company — this is the key — every company has to engage in monogamous relationships. Right now they’re dating, which is expensive and hard. They have to enter to monogamous relationships with consumers.Somehow you enter ... really? They can’t be promiscuous? Crazy.That’s 100 percent. Think about what’s happened with airlines where it’s all distilled down to a small number of networks. So I’m flying Air France. It’s an inferior airline, but I am in this monogamous relationship with Sky Team because I’ve fallen in love with Delta because I fly Delta a lot, so now I do this stupid ... I’m in this relationship with Sky Team that I can’t get out of, and that’s what’s going to happen. It’s going to be a series of four or five small networks, one for your media, one for your apparel, one for your travel, one for your health, and it’s going to be a race to see what brand can be that, bring you that bundle.I think this is ridonkulous, Scott. It’ll just be Amazon.Ridonkulous?! You’re hanging out with your teenage boys too much. Ridonkulous!Amazon’s just a store! Yes. No he’s not, he’s very smart. That’s a good one. So my prediction, a bold prediction around recurring revenue bundles ...Is ridonkulous. I think Amazon is it. And your prediction is I’m wrong. Because Google could have done it. That’s ridiculous. Google could have done ... any of these companies did. I don’t want a relationship with Google when I’m getting my lunch, or Nike. I want shoes from Nike. I don’t want my lunch from Nike. “Ah, my Nike lunch has arrived. It’s delicious. It involves carrots.”You wouldn’t want, say, you wouldn’t want Emirates to plan all your travel. You wouldn’t want ...No. I wouldn’t want Emirates, because you know what? Since I’ve been insulting the Saudis and everybody else so much for their dirty money, I think I would not want to fly on their airline because I think I’d be flown somewhere ...Would you want Amazon to give you and your family your health insurance? No. No. I’ll tell you, here’s where I do like, here’s where your ridonkulous idea does work. Say you’re Airbnb. I do trust them on Experiences. They can do adjacent things, hotels and airlines. I could see that relationship becoming a little more serious. I would trust them because I trust them on their Airbnb home, so I could see that, if it’s adjacent. If it’s adjacent, Scott, I would do it. Otherwise, no thank you. Yeah. So Airbnb is absolutely one of them. Airbnb could move into all sorts of travel and just kinda take it off the table.If Airbnb suddenly wants to buy me shoes? No, thank you. That’s all I’m saying. Yeah. But think about how many places that could go. Airbnb, it’s either gonna be Airbnb or Expedia or another ... the Four Seasons is another kind of brand that could probably come up with a recurring revenue bundle. Yeah, the Four Seasons. Is that where you stay, Scott? Is that where you stay, is the Four Seasons?Well, this is an interesting point. Do you know what Four Seasons is? The Four Seasons ...Or are you stuck to going there?The Four Seasons and Ritz Carlton, I used to always stay at those two brands. One, because they do a decent job, and two, whenever I travel someone else is paying, usually. But I’ve stopped staying at these brands, and it represents kind of the end of the brand era because I no longer need to defer to the shorthand of the brand and I can go on my social graph or these weapons of diligence, TripAdvisor [and] Google. I can find out that the Waldorf, an aging brand that I would never associate with in LA, is actually the cool new hotel, and that’s where I’ll stay.So you’re seeing, at least in travel, kind of new and innovative is the bomb, and brand is declining importance, so kind of the sun has passed midday on brand. Interesting, interesting. You know what Four Seasons is? Holiday Inn for rich people, because they’re all the same anywhere you go. Thank you. That was my thought on Four Seasons.Actually, I don’t know. There’s huge variance in how the Four Seasons in Austin or Chicago, pretty weak. The Four Seasons in Toronto or in Budapest? Right, Scott, I’m enjoying your hotel recommendations right now. Speaking of which ...I love hotels. I travel to hotels, not to cities.San Francisco, there’s strikes going on because of robots delivering food, and one of the reasons … anyway.Although, speaking of robots, I just rented a car from Hertz and I’m rethinking that in fact Uber may be worth $120 billion and we should replace every individual with the robots. Have you rented a car recently? Yes. I do it all the time. I think it’s an awful experience. I had a terrible experience at Hertz.You’re right. It’s an awful experience. It is. You’re right. That’s a very good thing that needs to be developing, but we’re gonna discuss that another week, because I have things to do. I’ve got to go watch the Trump press conference right now.You do. What’s on the slate for Kara? What is the most interesting thing you’re doing this week? This week?Yeah.I’m going to be interviewing Marc Benioff, but I can’t tell you for who or why. It’s a big interview. It’s gonna be on TV.Wow, and you’re a big fan of Marc’s. So, Marc Benioff. Yes, I am. It’s gonna be at the top of Salesforce tower. That’s all I’m gonna say. I’m going to try to helicopter in and then jump from the helicopter, take a rope down the building and then crash through the window and then start the interview. What do you think?Better yet? I think he should build like a terrace and you should go have like a Mussolini speech. Yeah, something like that. Just address the entire city.Something along those lines. Anything for audience. Anyway, Scott, I’ve got things to do. Good stuff, Kara. Have a good rest of the week. All right, thanks. Looking forward to talking next week.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}