{"id": "How a Democratic fundraiser taught everyone his Silicon Valley tricks", "paragraph": "On a recent episode of Recode Decode, RevUp Software CEO Steve Spinner talked with Recode’s Teddy Schleifer about how political fundraising has changed in the past 10 years and how it’s going to keep changing in the future. Speaking before the midterms, Spinner — formerly a big-money fundraiser for Democrats like Barack Obama and now distancing himself from partisanship — reflected on how he used data to “put the right ask in front of the right person at the right time” in 2008 and 2012. RevUp, he explained, lets users tap their own Rolodexes to figure out who to focus on rather than mass-emailing all your contacts and hoping for the best, a common tactic.“No one in business would conduct their work that way, just winging it, sending out one email to every vendor out there and hoping that someone replies or just, without any research, reaching out to people indiscriminately,” Spinner said. “We would do research. We would try to handle it in a professional, efficient manner. We don’t do that in fundraising.”You can listen to Recode Decode wherever you get your podcasts, including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a lightly edited full transcript of Teddy’s full conversation with Steve.Teddy Schleifer: I’m here with Steve Spinner, the founder and CEO of RevUp Software. He’s the campaign chair for Congressman Ro Khanna and he previously worked as the California finance chair for the Obama-Biden 2012 campaign. Steve, welcome to Recode Decode.Steve Spinner: Nice to see you, Teddy. So we’re here to talk about Steve’s background in political fundraising. Obviously, a lot of listeners here might be more familiar with startup fundraising. I used to cover, in my old life, campaign finance and donors and know Steve. But for folks who don’t know who you are, I want to start with how’d you get to Silicon Valley? You’re not from here originally.Like so many people from California, they come from elsewhere, originally. I am definitely like that. I was born and bred on Long Island, New York, to a doctor’s family.Where in New York?Long Island, or if I’m supposed to correctly pronounce it, Long Giland, but it’s a while since I’ve had that accent. And, I broke my dad’s heart at college when I took economics and fell in love with that and told him I wasn’t premed, and ever since then, I worked on the east coast and I worked a lot internationally in my 20s. I worked in Europe and in Asia and then I worked in Atlanta for the Olympics and then went to business school up in Boston and then worked at NBC in New York, at 30 Rockefeller Plaza. Did that in the late ’90s, when it was owned by General Electric for a number of years. What were you doing at NBC?Business development, corporate development? So I was there when MSNBC was formed and I was involved in all the internet activities that they did and had a fantastic time there. And did that for a couple of years in New York City. And then an opportunity came up that if the deal happened, I knew it was, they were going to ask me to leave the bosom of 30 Rockefeller Plaza. A wonderful, wonderful building to work in, overlooking the Christmas tree. Even though I’m a proud Jew and I love ...You can still go ice skating, so there’s some solace there.Yeah, I’m not, I’m not very good on skates. But I loved the office and then the opportunity came up and they had me come out to California and I’ve never looked back. So I came over here in ’98.Still with NBC, then. Yeah. NBC initially, I was there for another couple years. Had a wonderful ride there. And you know, had been doing business development, turned me into a general manager, turned me into an executive. Really formative years professionally for me in my late 20s, early 30s. And I’ve been here ever since. So, I’ve been here for 20 years. And I’ve done a number of startups out here, have done things on the investment side. But yes, I did definitely get involved in politics for the first time in 2005 right after the Kerry loss, where I first started getting involved in fundraising. Were you a political junkie growing up or is it something you were just not really ...?No, the exact opposite. I am the problem with the 20-somethings, so I am the epitome of that. I was very, very focused on my career, learning skills that I thought I would need for the rest of my life professionally. And I was not at all, at all engaged, even though I went to Wesleyan University for undergrad and I’m a proud Wesleyan graduate. I was not politically engaged in my 20s and into my early 30s. And I’ve regretted it ever since, having not been involved earlier in my life. But I made up for it ...You have.More than made up for it in the years since.There you go. Let’s talk about ... So, in 2004 John Kerry loses, you said after that, that was the moment where you started getting involved. What was the first time you got involved in campaign finance? Yeah, so the first moment was a perfect example of Silicon Valley leadership slash potential naivete. And I was the poster child for that where little old me, after the loss said, “You know what? Maybe if I had been involved, maybe I could have had a small difference in the outcome.” And many of us felt the same way. And so, very simple, I just called up a couple of friends of mine who had been very engaged in politics and had done it at a senior level, were at the time known as very, very strong fundraisers. And I just said, “Hey, look, I can’t work in politics. I don’t want to work, I like being a tech person, but I want to get involved. I want to help try to see if I can make a difference, albeit a small one.” In the aggregate, it adds up to a lot, if a lot of people do. And so they said, “That’s great. Come to an event, come contribute, that’s great.” I went to it in February of 2005. Who was the guy who invited you?Well, the first one was a guy named Donnie Fowler who was running for DNC chair. And the second one, a few weeks later, was for Senator Ted Kennedy. And after those two checks, the third one that I could ask for, and I’m like, “Whoa, you haven’t met my wife.” These checks are coming too fast and they’re too big. I can’t afford to do all this writing. So if you can’t write all these things, what else can you do? And that’s when they introduced me to raising. The art of fundraising. Which is different, because, I mean, you’re not a billionaire, you’re a regular guy. Exactly.But the art of fundraising is there’s givers and there’s fundraisers and some people straddle it. So it’s 2005 and you’re sort of introduced to this by a couple people in Silicon Valley. And that’s it. I tried to treat it like business and say, okay, if I’m going to do this, what are the right ways to do it? What are the best practices that you can share? And I was very quickly disappointed when they said there are no best practices. It’s fundraising, you know, you get an invitation, you get an email, you get a link and you send it out, or you talk to people. And after many times, many failed attempts to try to get the best practices of what are the dos, the don’ts, I just, everyone threw up their arms and I just started doing it myself. And I’m sure for the first six, nine months I made every possible mistake you can, every amateur thing you could do.This is for the 2006 midterm cycle?In 2006. Just trying to help. I was helping Mark Gorenberg with win back the House.Another venture capitalist in town.But he was major political fundraiser. He’s kind of slowed down. He’s not as ...In the last decade, he has. Ever since Obama won. Yeah. But at the time, he had been Kerry’s California chair. What I did for Obama in 2012, he did for Kerry in 2004. And so I just started helping him and I just started realizing that there’s a very high correlation to raising money for a candidate as there is raising money for a company. You have to be really passionate about what it is that you’re trying to get people excited about and inspired so much that they’re interested in giving, in whatever appropriate amount it is for them. And if you could just use certain skills that you would do in a business world, which is try to put the right ask in front of the right person at the right time and be respectful — and the keyword there is be respectful — then people are more likely to be interested in participating. It’s the opposite of this spray-and-pray of sending out an email to 5,000 people or 500,000 people and getting 0.0001 percent to click on it and then give low, medium, high dollars. Mine was the opposite. Mine was a curative manner of just trying to be, you know, if I knew someone liked climate change, to be able to put a climate change event in front of them. If I knew someone liked to go to a small intimate event of six, 12 people, to put that in front of them. If I knew that someone liked to go to big events of 1,000 people, to do that. If people were willing to travel, to be able to do that as well. The big thing was, I’m preempting this here, talking about Obama, but the big event was the Obama-Oprah event in Montecito and Santa Barbara in 2007. That was one where we were involved in the Obama campaign and that’s one that had just such interest nationally, at the time. But you know, I was able to be, after Oprah herself, the largest fundraiser for it, just because there were so many people that would ...Oprah and Steve Spinner.Yeah, no. There is a cool picture about that, but that’s about the extent of that. But let’s just drill down a little more on how fundraising is done and what made what you were doing different. I mean, fundraising is not that different from basic human relationships where you’re thinking about people you know, and you try and bond with people that ... You’re not just going around and saying, “Hello, these are the Forbes 400, let’s ask each of them for $2,700.” Basically you’re using, I’m assuming, I’m sure at first, Silicon Valley, the people you know in town. Describe the art of the ask. How’s it done? Pre-RevUp.Before RevUp and even before me, historically, for fundraising at very high levels, let’s just talk about the presidential level. Let’s talk about Obama in 2007, since I just preempted it with my last comment about Oprah. Before 2007, what had happened in 2004, what happened in 2000 and even in the ’90s, a lot times the best “fundraisers” at the time were uber-wealthy individuals who had for many, many years been extremely, exceedingly generous with their own funds, giving to their causes, more importantly giving to others’ causes as well, so that when they got passionate about a candidate that they wanted to see be president and they wanted to open their home and be a fundraiser, that that’s when they would start cashing their chits and say, “Hey, remember when I helped you with your fundraising effort over there? Can I have you help me over here with mine?” And there’s nothing wrong with that, whatsoever. That’s the way any type of fundraising goes, whether it be philanthropic or political.That’s the way it worked because those were big dollars being asked and given by big people. And you do it, law of big numbers, and those were the biggest fundraisers at the time and a lot of them got the perks of it, being the ambassadors and so forth.Sure. And some of the big fundraisers are brand marquee names, you know, the George Soroses of the world, the Oprahs of the world. A lot of these people are celebrities asking other celebrities for money.Correct. Correct. And you know, that obviously could not be me. I mean, I was super, super excited about Senator Obama at the time. I was one of the first 50 people to get involved in the campaign, months before it was officially announced in early February of 2007. And I just wanted to help. Couldn’t do it full time, didn’t want to do it full time, wanted to still have a job, still have a career, but be able to help where I could. Which was, if I can’t write a big check, and even at the time they couldn’t take them. It was $2,300 max you could individually write. But I could help by being a fundraiser. And by being a fundraiser, it meant not calling all these chits because I didn’t have those. It was, as I had mentioned, just research and get to know my friends. And at the time, I had about 2,000 people that I knew — broadly defined, “knew” — through LinkedIn and Facebook. Again, it’s so many years ago, this was the early stages of social media. And I would just be very, very careful about just understanding and I’d have copious notes, copious pads of paper about who liked what. As I was mentioning earlier, who liked to go to big events or small events or who could write big checks or write only small checks. Who would like to travel for events, who’d like to go to a climate change event or a women’s-only event, at the time. And I just always tried to be very, very careful to put the right ask in front of the right person at the right time. And if you do that, you do that well, then rather than this 0.0001 yield that online does is you get 40 percent yield, 50, 60, 70 percent yield.And obviously, this is a very much an underdog story, but it’s not as if you knew zero people with means in America. Oh, of course. No, I mean, I knew some, but I didn’t know them necessarily in this vein so much. It’s just when you write, when you take an email and you just customize the top line of it and you just recognize that, you know, “Teddy, great seeing you the other day. I know you’re particularly interested in climate change events. Here’s a really good one for you.” All of a sudden, you’re going to read that email, you’re going to recognize that that’s a unique email that was sent to you and there is a higher likelihood, a higher yield potential, from that. Let’s talk about, you were very, very successful. I mean, I think in 2012, I know we’re jumping around a little bit, but 2012 you were top five. So I started, so in 2007, 2008, I was top 10. Give us a sense of, who were some of the other people in your stratosphere? Well, I mean it wouldn’t be a lot of names that people that follow here would necessarily recognize and so forth. But there were a lot of traditional fundraisers in there and I was one of the few first-time people in the top 30. And it was something I was exceedingly proud of. But what the campaign was really excited [about] was the way that we did it: It was the first time that people had used “data” in a way that now would be defined as data analytics. Back then, it certainly wasn’t that classification. And you know, they liked that we got some great press around it and it continued the momentum.In 2012, I took that to a whole new level. In 2012, I was reported as being top three in the country. Got it. And how much did that raise in retrospect?A lot.A lot. Okay. The good thing about this, you can see campaign disclosures, but campaign fundraising is in some ways like venture fundraising. It’s very competitive. There is some ego involved and who’s raised what. Steve has focused more on raising what is now $2,700 chunks. But just for folks who are not aware, there’s a whole world of — which we can get into a bit — so-called soft money, which is super PACs and millions of dollars. And that’s not the world you are involved in. That’s not the world I live in. I liked the hard money, the official, the FEC-reported money, where people are proud to make the contribution and there are limits. There are limits. I like a world of limits. And I would deal with everything from the max of not just the 2,700s but to the committees of the DNCs, the DSCCs, DCCCs, the victory funds and so forth, which would be up to $75,000 in total. But not this stuff that you read about, the hundreds of thousands, certainly millions or even tens of millions of dollars. That’s a world that I have not played in for professional, political and personal reasons. Do you ever step back and reflect on how crazy the last ... I’m sure, you know, you were talking before about how you never really been ... you didn’t grow up seeing yourself as a political animal. But you made it into the top tier of finance folks, basically just through hard work and an innovative idea that, “I’m going to be more strategic about how it’s done.”But also, and I appreciate that, and there is obviously a great amount of truth to that, but it’s also to do it in a way that is putting the donor first. Being respectful. I’ve said that a couple of times. I say that a gazillion times. Respect in fundraising, I can’t say that enough, how important that is, not just for me but for anyone who wants to do it, whether it be for politics or whether it be for nonprofits or academic fundraising. Anything you do, if you can be respectful of the other person, you’re more likely to have a positive outcome and they’ll feel really good about it as well. And then the last thing is that you had mentioned the competitiveness of it. Absolutely. Historically, it had been terribly competitive and in some cases, it still persists. What I’ve always enjoyed is working collaboratively, working in teams, sharing credit, that the whole is greater than the individual parts.And so it’s not just the individual fundraising I did, but you know, I wrote the business plan for Tech for Obama, wrote the business plan for Obama Victory Trustees, wrote the business plan for South Asians for Obama because, you know, obviously the white Jew in me, that’s obvious that I would write that business plan. But those efforts, together, raised many, many, many multiples of what I as an individual could. But you do it so that everyone participates. Everyone gets credit for it. It’s the big tent kind of thing. And that’s where the real value of what I was able to do came in. Because you know, my time, there’s only a certain amount of time I can [put in] as a volunteer fundraiser, there’s only so many people I know. But if you can build initiatives that take hold, that grow roots and that, not just one or five or 10 or 20 people, but 100 or 300 people can participate in and they can make it their own, then you can have this huge, huge, huge multiplier effect and raise that much more money. So let’s finish the story here. So after 2012, you’ve pioneered this new way, you’re still fundraising voluntarily. I’m still doing it manually. Still looking at it manually. This is, and remember, you didn’t grow up dreaming of inventing political fundraising software.Absolutely not.How did this idea for RevUp come about? So one of my closest friends is Ro Khanna, and he had been running for Congress. Obviously, I wanted to help him. I was helping him on the fundraising side, and a lot of opportunity came up where people had been reaching out to me about what I’d been doing for Obama and would that be available, would I help them individually for this race or that race, etc. It’s just one of those things where there’s only one of me and as flattering as it is I don’t like to say no, but I just don’t have enough time to say yes to everyone.What’s your day job at this point?At that time I was helping ... Well, I helped with Obama with the re-elect and I was planning what to do next.Kind of stewing, yeah.Yeah, so I was helping Ro from a campaign perspective, but I was getting ready to either join a tech company out here or start my next thing.Got it.So in that period of time of figuring out what I wanted to do next, I realized what we had done, what we had accomplished for Obama-world had been really unique and really successful. It was something unique that I had done and that there could be an opportunity to help many, many campaigns. So that’s what I wanted to do, so we started doing that. Spoke to the lawyers, made sure that we could do it the way that we wanted to do it because it had never been done before, spoke to both sides of the aisle because the only way you could do what I wanted to do was if it was not a partisan play. Even though I’m a Democrat and I’m a well-known Democrat, from the get-go, since incorporation, we had to treat it like a tech company, which means, just like Google and Twitter and Facebook and Salesforce works with anyone out there that wants to buy the software or leverage the technology, we would have to be the same thing. Which politically is a challenge for me, but professionally and personally, you have to ... I mean you have to do ...Totally. Yeah, right.Yeah, I have a fiduciary responsibility to do what’s best for the company and for investors. The product could thrive if it just had more people using it and testing it and so on and so forth, so Ro was our, he was our prototype client, then we moved to 15 clients for the next year. Then we moved to 50 clients after that. These are clients or campaigns or committees or organizations that are trying to raise money that are in the political sector.This is 2013?No, 2014.2014, okay.The idea came to me in 2013, but we started building the software in February of 2014. So as I said, Ro was our prototype in that year.Ro is now, he’s been on the podcast before. He’s now the Congressman for Silicon Valley.He is. He loves coming down here.Good. Let’s just show them a little bit more what this is. In the old days, there were professional political fundraisers who probably had something they would call software. What is RevUp and how does it work? I know it’d be easier if you showed me on your phone or computer screens, but verbally, let’s give it a shot.Oh, I can communicate it verbally. For anyone out there listening, imagine you’re someone that ... you’re inspired by a candidate or you’re inspired to help out a nonprofit or someone you know reaches out to you from a campaign or from your university that you went to or nonprofit that you’re supporting, and ropes you into, brings you in to be a fundraiser. The initial use case for the software was as a fundraiser tool for a volunteer, for a “bundler,” as they call them. If you put yourself in that light as everyone’s imagining that, you all have jobs. You all do something else for your life. If you’re gonna do this, this is not something that you have comfort in. It’s outside of your day job. So you’ve committed, you’ve said, “Yes, I’ll help.” And you’re sitting in front of your computer and you have no idea who you should ask, to help. We all know many people, everyone knows hundreds of people, some of us even know thousands of people. Well, what do you do? You have two choices. You can either send out one email about the opportunity that you’re fundraising for, to everyone. That’s not fundraising, that’s spamming your network and hoping that some people respond. But that’s actually what the vast, vast, vast majority of people do.BCC, “Hi, I’m trying to raise a million dollars for candidate X.”Exactly.“Can you give 2,700 bucks?”Or $27.Yeah, right.Or $5. It’s spamming your network. Whatever comes in you’ve raised, so in that case you’re a fundraiser. A lot of times most of it you won’t get and ...That’s a low-dollar approach to high-dollar giving.Right, but anyone that’s doing it, it’s an any-dollar approach.Yeah, an any-dollar approach.It’s the only way that they know how because their time is valuable and they have no information to know any better, to do any better. They’re doing the best that they can with limited information. That’s the whole point. The other way of doing it is that you say, “You know what, an individual ask or an individual email or an email to a small group of people that’s customized is likely to have a higher yield.” But who should I ask? I still know the same thousands of people. So you sit there and you start thinking through your Rolodex or thinking through your mental contact list here, and maybe even you might actually even look through your LinkedIn list and so forth. You’re one by one by one going through this, and as you’re doing it, you’re like, “This is the most unprofessional, inefficient way possible.” And you get frustrated and you push your computer away and you procrastinate.That simple act of procrastination causes that fundraising effort to fail by 50 percent, right there, and every day that you continue to procrastinate, add another 5 percent to the failure rate. Until finally, eventually you’re like, “Oh my god, there’s only six days to the event and I haven’t done much yet. I gotta buckle down and do it.” You start just reaching out to top-of-mind people that come to you, people that you think are individually wealthy, people that you think individually might be interested in this, people that owe you chits, just completely top of mind. As you’re doing it, you’re like, “95 percent of the people I should be reaching out to I’m not reaching out to, and I’m reaching out to a whole bunch of people that I probably shouldn’t be reaching out to. I’m never gonna do this again.” Usually, it fails. So with that in mind we said, “That’s the problem.” No one in business would conduct their work that way, just winging it, sending out one email to every vendor out there and hoping that someone replies or just, without any research, reaching out to people indiscriminately. We would do research. We would try to handle it in a professional, efficient manner. We don’t do that in fundraising. So what the software does is we said ... so it’s data analytics on the fundraising side. It is not the system of record. It’s not the CRM. We don’t compete with any of the companies out there that take the money through their system.You’re not actually raising the money. It’s a way to organize the contacts for raising money.We’re not the links that the money’s going into, and so there are a bunch of different companies out there of all different sizes. Those were all of our partners. We are very, very careful not to do anything like that. What we do is we help the fundraiser, or now we also help — disproportionately, even — the finance staff, the development staff, the advancement office. The tool now has transitioned even more so into a staff-driven set of tools.We’ll talk about what are you guys doing in the future.Yeah. That is ... So now, as a bundler, that same analogy is now with one click you can upload your Gmail, your Outlook, your LinkedIn, your contacts, your iPhone contacts, any Excel spreadsheet CSV list you have. If you know thousands of people, it will merge, purge, de-dupe them, clean them all up, single Rolodex.And then it goes out to thousands of political and charitable databases and it will bring all that data, put it against your contacts, put it against the profile of the organization that you’re raising for, and based on that profile of that organization and all those 10,000 databases, will then force rank every single person you know highest to lowest likelihood to be interested in potentially giving.So at that point it’s like ... Let’s say you’re raising for Ro Khanna’s campaign and you have someone in Palo Alto who is a doctor who’s given money to Democratic Congressional candidates sometimes, not always. Maybe they’re South Asian, and then it matches it up with, okay, Ro Khanna, he’s a new candidate. He’s South Asian, and it matches up and says, “Okay, maybe this person ... they should be in the 75th percentile for the people you call.” Then someone else who has only given to Republicans for their entire life but the last six years they’ve given to every single Democrats, suddenly it’s an easy ask. It’s basically a way of ordering the thousands of people you know into how you should prioritize your time.Right. The part that I’m particularly attracted to is not going back to the same well over and over and over again. That’s a major, major problem in political giving, is that the same people are getting hit up many times every single day. If you can believe this, only 2 percent of the US population gives money to politics.That’s higher than I thought, actually.Most of that money is by .1 of 1 percent.Sure.And so everyone calls the same folks and everyone really, really calls that .1 percent. So yes, this software will certainly have that 2 percent in there and certainly will have the .1 percent in there and it’ll say, have they given before but they haven’t given currently? Have they given less now than they normally give? So go back and ask for more. Have they given to other things like you, but they don’t know you, so maybe if they only knew you, they’d want to give to you? Absolutely, we go, and there’s many different types of filters and parts of the algorithm that will boost people up and boost people down, of people that have historically given. Absolutely. My passion is to go after the other 98 percent, introduce it to people that have never given before. The Ro Khanna example, as you just mentioned. Sure, there are some wonderful donors in the tech and the South Asian community that have given to politics before ...Those are the obvious people.And those have been some of his donors.Those would be like the top-of-mind person. Maybe that person doesn’t even need the software for that person.Exactly. Well no, you always need the software ...You have to be clear, yeah.You always need to know in what order and how fast and what’s the likelihood and what’s the appropriate ask and all that good stuff. Again, you’re trying to be respectful here. But the power of it was to go and identify people who had never written a check, is on no one’s list, but maybe because they’re a South Asian male in tech living in Silicon Valley, maybe rather than a 90 or an 80 or a 70 score, rather than getting a zero score, maybe you get a 43 score. You focus your time and energy around people in the 60s and the 50s and the 40s. People that no one talks to, no one reaches out. Most people don’t even know they exist, but because there are hooks, respectful hooks of potential interests, of attractiveness, of a connection that that campaign or that organization or that university might have with that person, isn’t it a better thing to grow the pie and go after people that nobody goes out to, and there’s a much higher likelihood of them saying yes because there’s no competition for the same dollar?Wouldn’t the pushback be, and I’m sure you’ve heard this before, that part of any human relationship is just the soft touch and the ability to ... Maybe there’s some, oh, you know, they don’t check any of the demographic or historical attributes that would indicate this person’s likely to give, but maybe you’re just really good friends with them and you feel like ... Or maybe you saw them last week at the coffee shop and there was just that human connection that the software can’t predict. How do you deal with that?Look, you should always preference people you know and touch points that are more current and more accurate. So if you know things about people that are outside of software, that trumps anything that any software will give you.So even if it says “this person’s not a giver” and you just have a, maybe just something in your belly that makes you think this person will give, you should still hit them up.Right. They’re not a giver, yet. That’s the whole thing. They haven’t given yet. That’s the part that I find is both the opportunity as well as the challenge, and I like the opportunity part. Let’s talk a little bit about what you’re doing now. You guys just raised $7.5 million. You announced it last week or a couple weeks ago.Yep, about a week ago.By the time this is airing, probably a couple weeks ago. Your background is in politics, this came up as a political idea, but you mentioned development offices, endowments. Just for the grand scheme of things, political fundraising is a very small amount of the fundraising world, overall.Correct.So this is a bid to make the Princeton University development office or a hospital or anybody that’s raising money, you’re now pitching this as a software for anybody who has to cull a database and figure out who to call.Exactly. So if you think about giving last year and fundraising in the United States, it went up to, it crossed $400 billion that this country was generous to open up their wallets and give. Of that, only 7 billion, in total, over two years in this cycle goes to politics.People act like ... that’s always the common criticism of campaign finance reformers, who say there’s so much money in politics, and I think it’s Mitch McConnell or maybe John Boehner who has this quote about more money being spent on toothpaste than on politics.Exactly. That is, unfortunately, true. The reason why that feels the way it is is that so much money is used on broadcast television because it’s still exceedingly effective to getting out the message, so everyone sees it. So they see more money, more ads, and you just get oversaturated with ads. The other reason why is that a very, very small percent of the population is just getting hit up so much and they’re very, very vocal about that, as they should be. So that’s why you’re getting that view. So the much larger market, by so many orders of magnitude, are nonprofits at large, and especially as you mentioned, higher ed and healthcare as very large components within that. That is what we’re doing with the software. We’ve had a very successful couple years coming out with first our prototype, our alpha, our beta, coming out of self mode a couple years ago growing. We now serve nearly about 300 campaigns and committees and so forth. We’ll continue to grow that. Next year will be super-exciting given that it will be a presidential cycle and so many races as well there, but we did do the financing to very specifically go into the larger markets and do what we do in data analytics, working with the CRMs, with them as partners, but now go into these larger categories and do exactly what we’ve done in politics into these larger categories, because they’re chomping at the bit for next-generation type of tools.These are pretty, not stodgy institutions but these are, they have the formal development offices. These are ... Is there any party that worries about just some of the skills not translating or some of the software not translating?I mean, look. Everyone does it in their own way. There’s certainly best practices of how a lot of these organizations do it, and these are very, very professional people. The larger the organization, the more people they have and the more structured they tend to be. As a result, the more professional they can be. They have more staff, they can have more tools, they can have more training, etc. But there are half a million nonprofits. Everyone’s raising. It just depends on how much resources you have at your disposal, and so we just want to be a tool to complement what they’re currently using. I know a lot of these guys are using, whether it be Raiser’s Edge or Blackbaud or they’re working with Salesforce and probably a hundred other companies out there as a system of record to be able to help them on the data analytics side for both staff as well as volunteers to have the same level of effect in those verticals as I’m honored to say that we’ve had success this last few years. We’ve been just blessed with all the awards in the industry that we’ve won. We won best fundraising technology, most innovative product of the year two years in a row, best startup, best analytics. We deployed our mobile app last year. We won the award for best mobile app. What we’re doing as a data analytics company has not been done before in these three verticals, and what I’m super proud of, where I’ve lived for the past two decades, is to be a Silicon Valley company bringing Silicon Valley tech to these three verticals that have historically not had the opportunity to benefit from that, at least from a data analytics perspective.It’s well known on the internet that you’re a Democrat. But this is the software where you’re definitely using, there’s some prominent Republican clients out there. Describe how much you do politically, personally, these days? Yeah. I’ve had to cut back in many cases, which is very, very hard for me on a personal level because that’s my genesis in all this. But for instance, we’ll be very involved in the presidential races next year. I won’t, as an individual, be able to participate because how can I be personally helping one when I’m working with 5, 10, 15, 20 people that may or may not be running? Sure. On a personal level I’ve had to do some cutting back. I mean, I still help this candidate over here or this candidate over there. Obviously you’re still involved with Ro Khanna. I’m still helping Ro. There’s this guy, Sri Kulkarni in Houston, Texas, who is a very, very exciting candidate, that is basically the Ro equivalent on the foreign policy side. He’s 14 years State Department, and a bunch of different very, very challenging environments, placements he’s been over the years. He speaks six languages fluently. A very exciting candidate there that’s running in a Houston district. I’ve been helping them as well. I still help a number of candidates here or there. But, where I really, really dug in and was National Finance Committee and chairman of this, or co-chairman of that, and so forth, I probably won’t be able to do.Give up those fancy titles.How can you do that when you’re helping them from a professional purposes? That’s the whole point, which is that’s how I can work with Republicans as well as Democrats. That’s how I can work with multiple Democrats in the same race. Because they can all use the software. Right. Here we are in the state of California and on the Dems side there’ll be races where there were four, five, six candidates in the same race for a Congressional district that we just experienced for the last year and a half here. In June, most of those, all but one or two will lose. But we were able to help with multiples of them because we’re just a tech company. So, if you pick exclusives then you’re trying to pick horses. You’re not really a tech company whatsoever. And then you’re part of the advocacy apparatus. Yeah. You can’t build a ...You’re trying to be a Google or Facebook software platform that folks can use or not use. That’s independent, though, from, “Hi, I’m Steve Spinner, I was on the Obama Finance Committee.” Exactly, exactly. That’s the only way that people trust you that you’re gonna treat them the same as the other people because you treat everyone the same. We try our best from a customer service or partner success perspective you treat everyone exactly the same.People that know that we have multiple clients in the same sector, it’s never been an issue in four years. People that know that we sometimes have clients on the opposite side of the aisle, it’s never been an issue in four years. Where I take that as one of the things I’m honestly most proud of is because I’m a proud Dem. I’m a card-carrying, scar-ridden Dem, that I can meet with Republicans. I mean, where did I meet you, Teddy, originally? I met you ...I think it was the Mitt Romney E2 Conference. Exactly. Which I was covering when I was at at CNN. I want to talk about how fundraising has changed a little bit over time. You start in 2005, this is pre-Citizens United. This is one of the key Supreme Court decisions that created super PACs. I think there’s been a lot of discussion in the media. People in my industry used to cover political money about, has Trump changed the game at all with fundraising? I’m just curious. We’re coming up on the 2020 cycle, is fundraising different than it was a decade ago? It’s much larger. Sure. I mean it’s much, much larger. It’s much more successful online than it’s been. Every four years, you get this new bar that it crosses, and you don’t think it can get any more successful than that. And of course, four years later it’s twice as much as it was before. So yeah, it continues to evolve. There’s still a long, long ways to go. There is a certain amount of marrying of spray and pray. Blind fundraising just increased the size of the list and you don’t care about the terms. Right. This is online, low dollar. Yeah. You’re on the Beto O’Rourke email list. That’s a whole nother industry. That’s not your industry. It’s not me at all. Yeah. I can’t stand it. Yeah. But, it’s the opposite of the respect part that I talk about. Yeah. How many hundreds of fundraising emails do we all get every day? We delete 99 percent of them. Yeah. That I can’t stand. They also have lots of screaming headlines like, “The country’s in crisis!”That’s actually one of the things that’s helped worsen the narrative in politics. It’s on both sides. Pox on everyone. Yeah. The big changes that have happened — and there are many people that would say this and I’m not the only one — is Democrats historically always had a huge, huge advantage with small-dollar online donating. That started with Howard Dean in 2004 and it’s only picked up, ever since. For the first time ever in the last couple of years the Republicans with Donald Trump was able to do a certain amount of that and do it quite effectively in 2015, especially in 2016. That’s persisted through this cycle, through the fundraising that they’ve done on the RNC side. But outside of that, one anomaly there on the Republican side, there’s still a huge difference, a huge competitive advantage of small dollar on the Democrat side than on the Republican side. The other thing is that Democrats have ActBlue, which really is a ...It’s like a portal. Do you want to describe it?It is. It’s just a way to easily be able to make multiple donations over time, stores all your information, makes recommendations and so forth. It’s just been very, very successful for Democrats. They have a company called NGP VAN, which is one of our partners. That’s also very, very good at being the system of record. And so, the technology has always been, historically, an advantage on the Dems side, especially as it deals with small dollars. On the big dollars, and especially on the soft-money dollars, Republicans have historically always had a lead on that, especially obviously ever since Citizens United. Yeah, I just want to explain it for folks. I mean, so basically, the way that lots of campaign dollars were raised today, and the only way they were really raised pre-Citizens United was, there’s a federal limit for how much a donor can give to a campaign, or a committee. And after Citizens United, they created the creation of super PACs. Pools of cash where people can cut checks of unlimited size. That’s what a lot of the headline-grabbing stories are. Peter Thiel giving a million dollars to Club for Growth, or Sheldon Adelson giving 25 million dollars to a party-sponsored Senate super PAC. That’s what people think of when they read a campaign finance story, but then there’s also just the ... I mean $2700 is not nothing obviously, but it’s not 25 from Sheldon Adelson. Right. You have the super PAC where you can write unlimited and it’s disclosed. Correct. There’s also write-unlimited and it’s still not disclosed and that’s what they call “dark money.” Thankfully, that’s decreased, but that’s just still something I’m very, very uncomfortable with, and many, many people are very, very uncomfortable with because of lack of disclosure. Right. I mean, there’s some Democrats that are more and more comfortable with... This is epitomized by Charles and David Koch who created a large of organizations that are 501C4s, so they get some sort of tax exemptions in exchange for being theoretically non-advocacy organizations. Right. But the thing is, I’m always very protective and defensive of donors when they give hard money up to the max. And when I say that, “protective,” meaning that they’re allowed to do it. And if they want to do it once that’s great, if they want to do it 2500, times they should be allowed to do that. They shouldn’t be hit for donating. I always have a problem when donors get hit because they support when they get criticized. This is all public information. It’s all public information. They’re required to, but they’re doing what they’re allowed to do because they’re inspired to do that. There’s something about that candidate that they like a lot. They can’t necessarily give time. They can’t necessarily travel for them, but they can write $250. They can write maybe $2700. They shouldn’t become part of an attack ad, and some people do that. To be fair, this is on both sides, right? I mean there are ...Well, no. It’s usually on the Republican side to Democrats historically. But where it’s really gotten bad is on the larger checks, the soft money. Where now those guys are writing the large checks and they’re getting hit. In many cases they deserve to get hit for that. I like to protect up to the max, the $2700, and then beyond that, it’s discretionary on the donor. This did change with Harry Reid… Charles and David Koch, for instance, did not used to be household names. They’re obviously extremely wealthy. But, this became a big deal with Harry Reid, who went out there and attacked the Kochs during the 2012 campaign-Correct. ... by name, I think, on the Senate floor. That’s on the soft money. Yeah. On the big seven, eight, nine figures.Sure.I’m always very, very protective of when they-Someone expressing their democratic right to give $2,700 bucks. Or $250. Yeah. I actually saw a Dem-on-Dem hit piece last week right here in the Bay Area. Two Democrats, an assembly race, and I saw someone doing an online posting there where they were just were hitting people for writing $250, or $500, or $1,000 because they were supporting the other candidate. That really upsets me. Yeah, I think it’s $200, right? Beyond that, that’s when you start getting named in campaign finance reforms. Above $200, yes. Right, okay. You have to disclose. For folks out there, yeah, if you give more than $200 you will be findable by people like me, and I guess people like Steven, and other folks as well. Trump, I mean this is mostly on the Republican side, there’s an argument to be made. I wrote a lot of stories about Trump’s fundraising woes. During 2016, there was a lot of Republican donors like the folks at the Romney Summit we were just talking about who felt Trump is running against the system, draining the swamp. I think it’s led to at least some budding conventional wisdom that political fundraising doesn’t matter anymore. Trump can just hog the airways. The whole point of raising money, presumably, is to buy media attention. To what extent do you think he has actually changed how political fundraising could be done at least? I mean, this is a much longer conversation than the last few minutes of this. He’s definitely changed some aspects of it absolutely. But I do not believe that in the next cycle for the re-elect if he is the candidate on the Republican side, that the media will do in that race, even as a sitting president, what they did in the last one because it was comedy. In terms of campaign coverage. Yeah.Yeah. I mean it was Trump 24 hours a day on all networks, not just on the Foxes, but he was also on MSNBC all the time. Sure. As a sitting president, they’re even now starting to cut back. There’s been a lot of news about that over the last month, month and a half that one of the reasons why-The rallies aren’t getting live anymore. Well, one of the reasons why the president’s going out so much is because a lot of his comments are not getting covered as much, and the rallies, even those are not getting covered as much. And so, he’s trying to say things that are newsworthy, or he’s trying to make them newsworthy to force him to get coverage like what he did last night in Montana because people are trying to cut back on that because they realize it is an unfair advantage. I mean he won disproportionately ... Well, there were many reasons why Trump won last cycle, but one of them was that he just had so much earned media that he didn’t have to pay a penny for, and 10 times more than his closest competitor, and 100 times more than some of his other competitors. So you don’t feel like that was a moment in time, that Trump was — maybe there was a media fascination with him? He obviously also self-funded somewhat. He self-funded his Republican primary race almost entirely. He gave some money, not as much as he promised to give during the general to his campaign. But, at least in the primary, right, I mean, he was outspent. That was the whole point. He loved to make fun of Jeb Bush, right? Right. But that’s how he was able to make up for the shortfalls. Right. He did fund himself to the level that he need to get in the game. Yeah. And have a team that he needed. But he was able to more than make up for it with his comments that caused him to get all this extra media. He starts out as having higher name ID than almost anyone else on the stage. Yeah. And so, when you start out with just by your name ID from TV, from “The Apprentice,” being able to have 15, 17, 18 percent support, and name ID of 35, 45, maybe even up to 60 percent name ID, how is anyone else supposed to be able to compete with that?Yeah. You see that as not necessarily that consequential for the way that your business of political fundraising has done? No, not for me. I mean you still have to fund your campaigns. The part that actually gets me excited from a RevUp perspective is, historically money is the number one, and the only one that matters in, do you make a decision to run for office, or not? Can I raise the money? And if you believe you can raise the money, then you raise your hand, and you run for office. I actually hate that. I believe that money should not be the reason why you decide to run for office. It should just be part of the execution plan. You should run for office because you think you can do a better job, that you can help people, and you can move us in a positive direction. What RevUp can do in politics, and what RevUp can especially do for non-profits and universities is lower the bar for you to more easily be able to raise the amount of money you need, if you’re a candidate, to run a competitive race. Right. Do you agree in general with the idea that money is necessary but not sufficient for competitiveness?Yes, yes. You don’t need to have the same amount. You absolutely don’t need to have the same amount. Well, there’s a minimum threshold for ... Beto O’Rourke doesn’t need to have $38 million in a month to be a competitive candidate. He might lose. Absolutely, but yeah, absolutely, or you can have races where you’re raising 28 million dollars and you lose like crazy to someone who you’ve raised three, four times more money. You can have other races where you raised one million dollars and it’s one-fourth the amount of money as the other person and you win handily. Yeah. But you have to raise a certain amount to get in the game. You have to raise to be able to have a team and to be able to get your message out. There are other things that matter, absolutely. That’s why it’s called a campaign. There are many facets of it, but money gets you in the game. That’s what RevUp is focused on in politics, is to lower the bar to make it easier for you to raise the minimum that you need to be able to run a competitive race. The same thing, fulfill the entire mission and charter for a nonprofit and a university. Right. It doesn’t mean you’ll win, but at least you can kind of play the game. Exactly. Steve, fascinating conversation, and thanks for coming on the show. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}