{"id": "Full Q&A: ‘Will & Grace’ co-star Sean Hayes on Recode Decode", "paragraph": "On the latest episode of Recode Decode, hosted by Kara Swisher, “Will & Grace” actor Sean Hayes talked about how he became a producer after the show ended, why the cast reunited for multiple new seasons on NBC, and how the rise of digital platforms like Amazon and Netflix aren’t as different from traditional players as people might assume.“These are the new networks,” Hayes said. “That’s all. Everything is exactly the same. Everything is ... They make deals with people. People are going to these streaming companies because they can do with their creative freedom, the deals are better, there’s more ownership, you can swear, you can tell real stories. A network is a dinosaur business because they have to rely on the affiliate still and advertising and that they are limiting because you have to watch what you say and do.”This interview was recorded live at the Boomtown Brewery in Los Angeles, at a Recode event sponsored by ZipRecruiter.You can listen to Recode Decode wherever you get your podcasts, including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a lightly edited full transcript of Kara’s conversation with Sean.Kara Swisher: But tonight, we have a really great guy I’ve known for quite a while and I think he’s one of the funniest people I know. But he’s also pretty ... He’s beyond what you think he is. He’s obviously famous from “Will and Grace” and he’s over there doing his emails because he’s also a Hollywood producer.Sean Hayes: No, I just find you fascinating. I find you fascinating.I know that, thank you. Sean is one of the smartest people in Hollywood, thinking about where things are going in the digital age too, and so we’re going to talk about the show. We’re going to talk about his career and a little bit about the things he’s doing, including he’s doing some investments and different things like that. So, Sean Hayes, get up here. Thanks. Thanks, everybody. Thank you so much. It’s such a pleasure to be here with you.Is it? Yeah, here. And you said you didn’t know how to get here to this part of town. Well, gay people wear glasses.Yes, I know, we do. We like them. And black, too.And what? Black outfits.Black, yeah.Exactly.Well, yeah. Something like that. Hi, everybody.Hi. So, you didn’t know this area of town, right? You were like, “What the hell is ...”I did, I never come down here, and you realize that when you drive downtown Los Angeles that it really is like a whole other cool vibe that I’m not nearly cool enough for.Right, so you stay over on the west side.I stay on the nerd side, yeah.The nerd side, okay. So, let me talk a little bit about a lot of things, including “Will and Grace” and other things like that.That works out perfect ...That works out perfect because you’re there on “Will and Grace.”... because I’m here.But I do want to get into the idea of what you do because you do things well beyond. And I think I was surprised by how much producing you do and things. So, it’s really important. First let’s talk about your background because I ask everyone about their background. You came from Illinois.Illinois.Yeah, Illinois. And you grew up in a small town? Yeah, I grew up in Glen Ellyn, Illinois, it’s a suburb of Chicago. Dad left when I was 5. Mom raised five kids by herself. So ...And dad left? The reason, you mean?Yeah.Wanted to drink and wanted to party. And I was like, “That sounds like a great idea, but I’m 5.” Yes, right. Okay.”Wish I could join you.” My mom was extraordinary, but she worked all the time, but she was still a great mom, as great as she could be. So, we kind of parented ourselves.What did she do?She had the option when my dad left to have a secretarial kind of position or start a nonprofit organization feeding the poor and the homeless with a nun friend of hers.Okay.And that’s what she chose. And all of us were like, “You didn’t take Door No. 2 which would’ve paid for food in our mouths.” Right, right.But we always got a couple ... We were one of those families that needed the food.Right. So, she did the right thing. For 25 years, she helped run a food bank called Northern Illinois Food Bank which is part of Second Harvest, which is the bigger thing. I don’t know if anybody’s heard of that.And then raised five kids at the same time.And then raised five kids, yeah.So, you’re saying you raised yourself.Well, we parented ourselves. We had to learn how to ... We kind of weren’t ... We didn’t treat each other great because we were hurting, so that we hurt sometimes. But we also laughed a whole lot. And then the older we got, there was a lot of drinking in our house. Our house was the cool house where all the kids came over to drink and hang out. And I just wanted to sleep and practice my piano.Okay, all right. And your brothers and sisters, what did they end up doing? My oldest brother, no idea what he does, something in a warehouse. My second-oldest brother, I have no clue. My third-oldest brother, no idea. And my sister ... Because they start talking over the phone, I’m like, “What are you doing?” “Well, we do this stuff in the warehouse where they keep track of ...” I’m like, “I can’t keep track, I can’t figure it out.” So, my sister was ...You speak to them still? I do, yeah. Yes. You know, we all have different relationships with everybody, but I’m probably closest with my sister. She’s the most emotionally available and so that’s where I lived as well, around the corner.In that emotionally available part of the corner, yeah. Yeah. Try to. And she was a cop in Glen Ellyn, where the scariest thing is somebody’s bike gets stolen.Right. And then she moved to Wisconsin and is now ... working at a place. It’s a waste of time.All right. Okay. We’ll ask her.I could tell you what it is if you really want to know.Yes, I really want to know! Okay. So, she works at a place, it does two things in the same office. They sell stationery and they sell the equipment that kills farm animals.Okay. Yeah.Same thing.Like they cut off the balls of, you know, cows and such. Really? That’s what she does?She doesn’t do that, she sells the equipment for it. How does the stationery get ... I understand that cutting off balls part, but how does the stationery become part of that?I have no idea.Okay, but they do.That’s what they do. The same company does that.All right. So how did you get out of this place? That’s really the question.Why? Why would you want to? I know, right? I was 5, 6 years old, I came home from school, my mom said, “There’s a woman across the street teaching piano, do you want to take piano lessons?” I said, “I’m not doing anything else.” So, I started taking piano lessons at 5, stuck with it. Started entering competitions. In high school, I got into theater because that’s where the funny people hung out and that made me laugh. So I was a concert pianist and I thought I was going to do that with my life and be a conductor. And ended up pursuing music, piano, and theater minor. Never really graduated and then got an honorary doctorate. Okay. Okay. I’m still not clear how you got to Hollywood, but go ahead.Oh, oh, sorry. Sorry. So, I ...So, you would do all this in Chicago? You were doing this in Chicago.I was in the middle of a sentence.All right, sorry. Kidding. I was a music director at a dinner theater in St. Charles, Illinois, called Pheasant Run Dinner Theater and we did a lot of great shows. And there, people started getting auditions and stuff as an actor, but I was in the little tiny pit, wishing I was... Because when you’re in the pit of a musical, night after night after night after show after show after show, you’re like ... It’s like watching the same movie over and you can’t really talk to anybody because you have to be quiet. I’m like, “This is living hell.” Right. But it was a great job. So, it’s a dinner theater. It’s like “Oklahoma.” Yeah. We did “Oklahoma,” “West Side Story,” “Evita.”And then you had to serve ... Yes, “Evita.””Evita.” But the actors didn’t do the waiting the tables or anything.Okay, all right. Okay.But it was legit. It was legit theater. The Sun-Times and the Chicago Tribune and everybody would come down and review the shows. They said our “Evita” upstaged the original.Oh, okay.It was really great shows. All right.Really amazing shows. Right.Anyway, so I got there ...So, you’re stuck in the theater pit in St. Charles, Illinois.Illinois, yeah.Okay.And then, but I start auditioning ... Sorry, back up to 5 or 6, 7 and 8 years old. My mom and dad, when we were all really little, had us audition for commercials and stuff, which I thought that was odd.Wow.So, like a man came over and interviewed us one by one. One second. You get it? If you’re listening, I posed for a picture. All right. Okay, good.And then the person came over and we talked. And I started going downtown, taking auditions for United Airlines commercials, whatever. Anyway, nothing happened with that. Then I started doing this Pheasant Run, and did some acting in high school and college. And then I was like, “It’s so much more fun to be up there than in the pit.” So, I started auditioning and just booking commercial, after commercial, after commercial, after commercial.Right. And then, I was like, “Well, this is all we get in Chicago.” Or, like, “We get commercial work.”Right, commercial.A lot of movies don’t come to town.Not at all.And if one does, you have 10,000 actors auditioning for one line. And you know ...Right, exactly. In a “Home Alone” setting.Yes, exactly.Right, right, “Home Alone.”Exactly. What was I auditioning for?“Now, he’s really mad.”I auditioned for “While You Were Sleeping” with Sandra Bullock.Oh, yes. Of course.I was like 19, maybe. That’s right.Still waiting to hear. Still waiting to hear. That’s a terrible movie. Yeah, yeah.And so, did that. And then ... The actors and the friends of mine started booking stuff, so it was like ... Anyway, so I started doing that. Did you do Second City or anything else?I did. I did the training program in Second City for a couple years. But I never performed onstage.Right. So, that happened. I’m catching you up and then ...Okay, good. I’m still waiting to get to Los Angeles.What? I know.Okay, so we’re still in Chicago.So then, I decided I’m just going to do it. I’m going to do it while I’m 24 years old. Right. Right.If I don’t look back, I’m young enough. If it doesn’t work out I can come back to this job, right? And so, Anna Chlumsky, who’s on “Veep” ...Right.… was in “Fiddler on the Roof” at Pheasant Run Dinner Theater at the same ...Okay.She was also in “Annie” right after “My Girl.” Remember that movie? “My Girl” with Anna Chlumsky.Yeah. Yeah.So then she did that and came because she lived in Chicago.Right.And I’ve been friends with her since she was 9 years old. Anyways, so she was in ...A child star who then became a regular, later came back to do “Veep.”Yes. Right.Right.And she’s on “Veep” now. And actually, Katrina Lenk who just won the Tony this year, she’s a Pheasant Run ... There’s a lot of people from Pheasant Run who are working.Clearly.Yeah, it was very cool.Wow.And so, anyways ... So, pack my car, I say goodbye to “Fiddler on the Roof” cast and I move to Beverly.“Sunrise, Sunset.”Yeah. Yeah. Sung it all the way to California.Did you?Yeah. Wasn’t annoying at all.So, you go to Los Angeles and you’re in commercials again, right?Yes. You were in the Doritos commercial. And so I had a little bit of ammo because I had a demo reel with some commercials. Yeah. Right.So, I got a commercial agent right away.Right.Because I was a bigger fish in a smaller pond in Chicago. So, just kind of keep that going.What was your biggest commercial there? I had two spots on the Super Bowl in 1998. Doritos.Doritos and Bud Light.Yeah.And the Bud Light spot, I was shopping with my wife and there was this clothes rounder and you’d hear, “Psst.” And all these guys are inside the clothes rounder, like barbecuing and watching the game. Right. I was like, “This is awesome.” That one. And then the famous Doritos ...Let me hear it in the straight man voice. “This is awesome.”No, that was the straight man voice back then because people didn’t know, that was just fun. “He’s a straight guy who’s fun,” you know? I would say, if I didn’t act ... If you didn’t say Jack was gay in “Will and Grace,” he would just be the kooky nextdoor neighbor.Right, right. Like Jim J. Bullock from “Too Close for Comfort.”Yes, you’re right, you’re right. You’re right.But anyway ...So you did Doritos. And the Doritos one was ...Doritos, right? And that same ... I was at Sundance, the Sundance Film Festival with a starring role as Billy in “Billy’s Hollywood Screen Kiss” while those two commercials were airing.So that was it.So there was a lot of what they call “heat” behind me. Yes, okay. All right.You’re probably familiar with that, with all of your ventures.Yes. Yes, I have a lot of ventures. Yeah.Yes, we’re going to talk about those in just a bit.Okay, fine. Okay, let’s move on.And so, because of that, I was sitting at a theater at Sundance Film Festival, starring in this movie, this NBC exec is sitting in the audience. I haven’t even seen the movie yet. He taps me on the shoulder, he’s like, “You’re Sean Hayes. You’re in this movie.” And I said, “Yeah.” He goes, “We’re casting this sitcom, ‘Will and Grace,’ would you come in and read for Will?” And I was like, “Well, not right now because I’m about to watch the movie, but maybe when it’s done, blah, blah, blah.”Right. So, I didn’t have the money to change my ticket to fly back early to see it. Because I wanted to experience Sundance because ...Sure. Yes. Fine, yeah, yeah.It was like another week or two left.I’ve been there.But that train has left and they found the brilliant Eric McCormack to play Will. By the time I came back, they said, “Would you read for, ‘the other guy’?” And I said, “Sure.” And that’s how it happened.Wow. That’s like ... And then it just did for a long time.And that was it.How many years? How many years was that on? That was on eight years and now two and then a third next year.Two, third season.Eleven total.That was a very different era of television. You were just the star on the show.Yeah, that was very ... Yeah, yeah, yeah.Right? I’ve never done a TV show, either. I’ve just been in commercials and maybe a guest spot in one of those crime reenactment shows. Where you were like a dead body or what? No. Thanks for the confidence, but no. I was ... I don’t remember. It was like ...Were you a murderer?”I saw the body down by the river.” Oh, right. That kind of thing. Okay.In that same straight guy voice.Okay.Yeah.So, “Will and Grace.” Why do you think it took off back then? I know. Isn’t it bizarre that it ... It still, it blows my mind that Warren Littlefield ... It was a script of three ... Warren Littlefield was a great producer.Amazing.Right. It was a script of three couples. And one of the couples was a gay guy and a straight girl. And Warren said, “Why don’t you ... Screw the other couples. This is the most interesting thing.” And “My Best Friend’s Wedding” had just come out, with Julia Roberts. Right, and her best friend was gay.Right. Was gay. Right, was ... What’s his name?That guy. That guy.That guy.Yeah, British guy. Rupert ...Rupert Everett.Everett, right. Yeah, yeah.And I never met him, but he seems angry in interviews.Yes, he does. Yeah. Okay.But I hope he’s not. I think he probably is.Okay. Have you seen him much lately?No. That’s a very good point.Thank you. Thank you. I like to cut to the chase.Really? Done.And so — by the time we’re done, this mic pack will burn a hole through to my intestines because it’s touching my skin. No, so that had come out. So Warren said do that. And that’s kind of why it happened. But it still blows my mind that NBC picked up a show about a gay guy. Right.And even in the pilot, after it tested, stupid people had no idea Will was gay, even though he said many things that would allude to the fact.”I’m gay.” Right, you’re gay. People didn’t know that?People didn’t know because, you know, they’re testing, “That guy’s funny. Well, that girl’s funny and this is ...” Right.But they’re like, “Wait, that dude’s gay?” That was my straight guy voice.How long? How long what? Did it go on that they didn’t know he was gay? Come on. Well, I don’t know, they clearly found out by like the third, fourth, fifth episode.Right. But, that show was highly ... There was actually a series of political shows on the air.Well, Ellen had done the coming out. We always say, “She opened the door and we kicked it down.” Right, right.So, without that ... And we all, passing the baton.Right.And then you have “Modern Family” with an out couple with a kid.Right.Hopefully, I’m not saying “we did it,” but hopefully we helped ... They’ll help somebody else.But then everybody changed back, it seemed like. Right? Well, there was a joke that the character of Karen, played by Megan Mullally brilliantly on the show, when Bush was in office after Clinton, we were still on and Bush was in office, I go, “Karen, as a gay man ...” She goes, “Honey, didn’t you hear gay isn’t in anymore?”Right. Yeah, yeah.It’s funny, it’s like it’s in and then it’s not. It’s like, “How is it either?”Right, right.It should just be human.So, what do you think “Will and Grace” did? Did it normalize gays or ... Well, people used that word ...Because you play ... Right. ... and I know why they use that word.Right.But to me, it rubs me the wrong way because ...Well, tell me why?... I’m going to tell you if you just give me a chance.All right then, fine. Normalize ... I know, right? Not even a breath. I like this, you’re always trying to top me here. I like it.Well, I am a top.Do you know what? Straight guys never try to top me. Well ...I’m just saying.Because you’re gay, we’re both gay.I know, yeah. I think she missed the joke, you guys got it. She missed it. Because she’s thinking about the next thing. She doesn’t just be in the moment. So, what now? What was the question? Besides, while you’re trying to top me on figuring out what to do next. Why is “normalize,” you’re so angry about it.No. Just because the word “normal.” I’ve always felt normal. Right. Right.But people use the word.Yes, got it.Right. So, that whole thing. But to use your word normalize, do I think “Will & Grace” normalized ... Well, you guys know that I think just like “The Jeffersons” or “Good Times.” By the way, “The Cosby Show,” present problem excluded, at the time, “The Bill Cosby Show,” that was like people were floored that a black man could be a doctor.Right.And a black woman could be a lawyer. That was amazing! And to black people that was like, “Yeah, that happens.”Yeah. Yeah, yeah.And so I think the same thing with “Will and Grace” was, people were just like floored that two gay men could be friends but not have a relationship. And actually be best friends through all of it. And that I think is what people are constantly striving to create in Hollywood, are relationships you’ve never seen before. Because that is a great percolation for a lot of new fodder. For a new fodder. So you do that for eight years and then it ends, right?Yes. And the reason it ended is just things after ...Mutual. It was like, “Maybe we’ve exhausted it.” And the network was like, “Yeah,” because the ratings weren’t as huge. I mean, they were pretty big still.They were big, yeah.Anybody would kill for those now. Right. But you know, also it’s that syndrome of, in the time of “Will and Grace” ... I think this is most of it. In the time that “Will and Grace” was on the air, NBC had gone through maybe six presidents in eight years.Right. And different owners.And different owners.Right. So, of course, who’s our parent? Like, who’s watching this for us? Who’s watching out for us? So, I think ...Well, at least it wasn’t Les Moonves, but go ahead.Right.Sorry, I had to get that in.No, for sure. Okay.But I figure there’s a little bit of that syndrome going on with the new guy was like, “I want my hands on hit shows.” Maybe?Right. Might not be true. But I think maybe part of it was.Right. And so you all ...So, out with the old because it had been on ...You all went on.Yes, we went on to do things.To do things. One of these you did was produce a lot of things.Yeah.People don’t realize, I think, that you’re sort of Ryan Seacrest-y, so to speak.People say that about Ryan, yeah.Yeah. So, I knew the ... I try as hard as I could to be self-aware, sometimes, I fail miserably on a daily basis. But when I try to be self-aware, I try to see what was in front of me, and knowing history, what happens with sitcom characters that have impact like mine had.Right.And so, you go, “Well, I need a place to go when I get up in the morning, how am I going to fix this? What’s the solution?”Because you get one hit and then that’s it. And then you don’t see them again.And a lot of the actors are like, “Yeah, that’s fine.” And a lot of actors enjoy just acting and that’s great. My brain works a little bit like yours, where it’s just like, “I need ...” The next thing.And I need multiple things going on because it’s ... it fills my soul. That way I don’t have to focus on myself.Okay, good. Right. Interesting.And so ... See the damage? All right. If I just keep busy, then the tears don’t come, but ...It’s true.Boy, is that true, right?Yeah. I once said to someone who asked me, “Why aren’t you in therapy?” And I said, “I don’t know. I’m pretty happy.” And they go, “You’re blocking.” And I said, “It’s working.”You’re what? You’re ...I’m blocking.Yeah, you’re blocking. That’s why: We stuff and we block.Yes, it’s working.So you should play football. Yeah. So, then ... See?So you’re doing “Will and Grace” and you decide to produce.Yes. So, then I was like, “Where am I going to go? What am I going to do?” And then, Tom Hanks is a friend. And I saw what he was doing with Playtone. I thought, well, there’s a perfect example. And I would say I want to embrace that, say WWTHD: What Would Tom Hanks Do? Right, okay.Right?Is he running for president?Wouldn’t we all be better off?Yeah, probably. We’d be better off with a dog, but go ahead.We would be. At least it would listen to us.A cat. Yeah. Some cat.Yeah, a dog would bring us together, at least.Yeah, yeah.Isn’t it interesting. Well, we don’t have to go on with that.Okay, we’ll go on that later. Put a pin in it.Yeah. But, yes. So I decided to do something about that and started producing with my friend that I went to college with, Todd Milner, who was a genius. And we had two shows that we started out with. One was “Situation: Comedy” because that was just the start of people not figuring out multi-cam sitcoms. Why aren’t people watching them anymore? And so, we had a kind of “Project Greenlight” show, do you remember “Project Greenlight?”Yeah.But for TV. Right. So, we had submissions of people sending in half-hour multi-cam sitcoms. And we were going to read them all, weed them down. Pick two or three. Shoot them and have America vote on which one they wanted to see go to series, which ended up being way ahead of its time because that’s what Amazon started doing.Yeah, that’s right. Exactly.And then built this gigantic studio.Right. But, we ended up doing it. NBC decided not to. “Well, that’s a cute show, we’re not putting it on the air.” The one that won.Yeah, yeah.So, the other one was called “Underexposed.” We gave a very vague script to three filmmakers to make ... Go off and you have 24 hours to make a short film based on, “Hello.” “Hello, how are you?” “Oh my God, what’s that?” “It’s coming this way.” And they had to interpret what that was.Okay.And so, and the judges were Trudie Styler, Jon Favreau and Craig Zadan, who was a good friend of mine, who just passed away. Anyways, those were our first two shows. And then we didn’t work for seven years and then we’ve done tons. We produced “Grimm,” “Hot in Cleveland.” “Grimm” was a huge hit.Yeah, “Grimm” was. And then “Hot in Cleveland” with Betty White and all those great girls. And then ...”Hollywood Game Night.””Hollywood Game Night,” which is still on, we’re shooting right now. “History of Comedy,” on CNN right now, and a bunch of stuff.Right.And we just shot our first movie called “Lazy Susan” starring me, where I play a woman.Okay.I play Susan.“Lazy Susan.”I play Lazy Susan. The whole time you’re a woman, or you’re man being a woman?The whole time I’m a woman. A hot woman, the entire time.Yep. How do you look?I look not attractive. You would not be into me.Okay. Okay, all right.Yeah.Yeah. Well, I like now, the whole ... Yeah, well ...You’ve got the lesbian thing going on right now.Let’s talk after this.Okay, all right.I do, I told you that last time, I dress like a lesbian.You do, I was going to say that. And you do, too. Yes, I do, indeed.Yeah. I was just recent ... I was telling people I was ... I’ve been doing some research on some of the e-commerce companies. Stitch Fix is one of them, so I was trying ... Stitch Fix is where they send you stuff and you send it back. Do you know about these things? No, tell me, what? The company went public, I think. It went public. And they send you five things and then you ...What do you mean?Five pieces of clothing.Well, you have to say clothing.Clothing, I’m sorry.They send you five things. Like a watch, my niece. They send you a box of Coco Puffs.Yeah. They send you five pieces of clothing. And they kept sending me clothing. It was all wrong for me. There was frills going on, there was all kind of ...Yeah. There’s many of those.I send it back. I keep sending it back. And then one day stuff started coming that I liked. Yeah.And all of a sudden all five things were things I liked. Like five things. And so I kept them.This is a great story.I’m getting there.”And they send me five things I love. Anyway, Sean, so back to producing...”Okay, I’m going to get back to producing. So, the stylist — and I’m going to finish this story because you’re such an asshole. All right?Okay.And the stylist said, “I finally figured you out, you’re simple and androgynous.” Oh.Which I don’t think was a compliment, but was exactly right.I like “simple.”Simple and androgynous. So, this is my look. Anyway, back to you.Yeah, but it’s comfy. It’s comfy, thanks.I don’t like ...That’s a real hot look. I don’t love wearing this stuff ...Yeah, yeah.... because the second I walk in that door of my house, pajamas, sweats, I mean, like ...All right. Okay. Now, back to producing. So, tell me how things have changed with producing. Seriously, because in Hollywood you have to think of digital.Yeah.We were over there talking about podcasts. Yeah.But how do you look at yourself as a producer? Has Hollywood changed a lot? Yeah, well ... There’s a million things we can talk about that. But you have to ... I’m going to say something that sounds like a joke, but it’s not. You have to find a hole and fill it, right?Yes.So you have to find out, you have to figure out what’s not out there and provide that entertainment. But you know, now producing ... There’s different kinds of producers, right? We’re both creative and packaging so we act like our own little mini-studio. So we will find a writer and a director and an actor and the idea and the IP and try to patch it and put it together. Which is a lot of work, but we run in overdrive. So we do that with many, like with 20 things at one time. And so I think now ... The good news for us is people need content more than ever.Right, there’s so many outlets.And there’s so many outlets which is also bad for viewerships and making money because you have split now this pie of viewership in a billion ways, which is good and bad. There’s good and bad to that. If you find your niche like you have, you can make a living, a pretty good living. So we have a deal at Universal Studios. So now we have our ...Just NBC.… are able to provide content mainly for them, for the studio, not necessarily that, but for the studio and what they’re looking for. And so ... But ... I don’t know. So day to day we tried ...So why do you have a deal Universal, not NBC, versus doing things for all ... Because you have more choice there. You go to Amazon. Like look, “Marvelous Mrs. Maisel,” the hottest show, I think right now is on Amazon.Amazon, right? And then you have now ...And Jennifer Sulky, who used to be vice president at NBC is now president at Amazon.President. Yes. Took over from the guy who had some issues. Yeah. Roy Price.Get in line.Yeah. I am, get in line. You’re right. We’ll talk about that in a second.  Why don’t you as a producer ... Do you think about Amazon and Google or Apple is now moving in. Apple did a deal with Jennifer Aniston and Reese Witherspoon.Yeah. Yeah, yeah. I think Apple is doing it right though, because Apple had two shows a year or two ago.They were terrible.And they asked me to host “Carpool Karaoke” and I was like, why? Why would I host that? Because James Corden does it brilliantly.That’s right.And now you’re breaking that off making it. And I started telling them everything, that why that wouldn’t work and like, “Uh huh, got it, thanks Sean.” And then ... But now they’re doing it right. They’re stockpiling and they’re going to launch huge. That’s exactly how ... But they have billions of dollars to do that. Right. That’s what I mean. How do you look at that when you have that and then you also ... Google is obviously going to get into it somewhere, they’ve been trying to do YouTube originals.I always ask people like, where is this going? Because nobody knows, right?Right.So where is this going with 500,000 new shows every year? Right. So tell me. I don’t know. That’s why I want to know.I don’t know.Nobody knows, but that’s why I’ll always be employed. Because ...That’s what I mean.Yeah. There will be ... But the problem is ownership. So the networks now have ... It’s becoming a dinosaur business.Right.But I think the streaming companies that figured it out, but everybody wants to ... We’re all held hostage now because unless you’re not a writer/producer who’s created the show as in non-writing producers like myself and there’s many of us, there’s no ownership. So you have to make better deals if you can with the success that you’ve built.Right. Better deals with who? ... Have you thought about going ... Like look, Shonda Rhimes has gone to Netflix.She’s a writer/showrunner.Right. Ryan Murphy, same thing.Writer/showrunner.So that they will be going to them from now on because the money is better and the freedom is better. Yes. Right?Right. Exactly.So, they can do whatever they want.So it’s almost like ... By the way ...What does that do when Shonda Rhimes and a Ryan Murphy leave?But that, leave what? Right?Right.So, that’s the thing. It’s like these guys are just ... These are the new networks. That’s all. Everything is exactly the same. Everything is ... They make deals with people. People are going to these streaming companies because they can do with their creative freedom, the deals are better, there’s more ownership, you can swear, you can tell real stories. A network is a dinosaur business because they have to rely on the affiliate still and advertising and that they are limiting because you have to watch what you say and do.Right. So what would you prefer to do as a producer ...Well anybody creative would like to be out of the chains of ...To do different things. Right. Have you talked to some of these companies? Have you gone to meet with them? Yes, of course. And?Yeah. We have relationships everywhere. Right. So what is your digital? Who do you do that with now? Because you have at NBC, at Universal.So my company, Hazy Mills Productions, we have employees ...Why is it called Hazy Mills?Because I’m Hayes and Todd Milner.Oh, I see now. It’s okay.And we went to college at Illinois State University in the middle of the cornfield and all you would see is these mills.Okay. Got it.So it’s Hazy Mills.Okay. I Like it.You’re welcome.Okay. Thank you. So in our company, we have employees that are heads of reality, digital, film, TV, comedy TV, drama. So everybody has different ...And different things.Right. So we are working on all of those things every day. And so now podcasts, we want to get into podcasts, which we spoke about before this thing.Right. Right. And why do you feel like you have to do that? Because WWTHD. What Would Tom Hanks Do?Right.Did he do a podcast?No, but I’m just saying, you constantly have to think forward and think about ... Tom started a production company so long ago before other actors started them. And so I just thought that was so cool. And so in keeping with trying to stay on top of that and where this is going, you know, Jeffrey Katzenberg is launching NewTV. So we had a conversation with him about that.With Meg Whitman.What’s that?With Meg Whitman.Yeah. Meg Whitman.Who I know very well. From eBay.Oh, you do?Yes, very well.I don’t know her.Well, she’s from eBay and so I wonder how she can produce television, but okay. Right?Okay. Well, we’ll see. We’ll see, right.Yeah.Yeah.Well, it’s 10 minutes ... What I’m to understand is it’s 10-minute increments. Do you guys know about this? Yeah. This is a new ...So it’s a new thing where they’re producing 10-minute shows.That are very expensive.That are very expensive. But it’s for the on-the-go person on the phone. And then, right, whatever, I’d be on the subway, you can watch 10 minutes or wherever.I have a problem with that, I have to say.Tell me what is ...Because I think it’s a mistake to think young people want to watch edible food, “edible” TV. Snacky.I kind of agree, and I don’t know the full plan so I can’t comment on it fully, but I ultimately ... people who would want to sit down and watch an hour program or half-hour program.But some watch all of “Mrs. Maisel.”In one sitting.Yeah. One sitting. But you know, well no, not one sitting. Well, but yeah.Yeah, you know what I mean. He binged it.But I’m saying, they’re able to watch a thing over a period of time.Yeah. But I mean this is a ... It’s a new way to produce content and distribute it. So who knows? It might work. So getting back to as a producer you’re always looking for different angles. You would do a deal with anybody, like that kind of thing. Well, yeah. What’s that?Would you do a web deal in contrast ...?As long as it makes sense for us, yeah. And it was people who understood our brand and yeah. I mean, we’ve been so happy and very well taken care of with NBC Universal Television.Do you think people will ultimately watch everything on these small devices? Is that how you think as a producer? I think yes, I think forever, they will. You’ve heard this a million times, your TV is actually going to be a monitor. It is a monitor.It’s not a TV anymore. Yeah, it is now.It is now, essentially.So it’s just a bigger monitor, it’s a small ...I don’t think I watch “Will & Grace” at the time that it’s on ever, ever. Oh, really? I don’t. No. No. I don’t watch it on the night unless ...Yeah, nobody really does anymore, anything.And why would I?Yeah. Exactly. Right.Why would I?So talk about the return to “Will & Grace.” So here you are doing this production stuff, very successful shows. You’re a producer, you’ve had quite a few hits. Why did you decide to do this? To come back? Yeah.We did an election video in 2016 to lend our voices in the best way we knew how, which was through this show, instead of tweeting or standing on a soapbox or whatever. So Max Mutchnick, one of the creators of “Will & Grace,” came up with this idea. We haven’t seen each other in 11 years or whatever, 10 years. Let’s ... Because everybody wanted to do this election video, because if we write it and we’re like, yeah, of course that’d be great. So the crew, us writers, everybody got together for free. Nobody got paid. We did it in secret, NBC didn’t even know. We went to this stage that was below another stage, and we called it “Hot Food” as the code name.Right. That’s a long, long story why that happened. So we shot Hot Food, released it, and millions and millions and millions of people watched it and we’re like, “Wait, what?” And so, that’s how it happened. And then the network called us like, “Would you guys want to do this?” And we actually had a dinner at my house, just the four of us. And we talked about it and we were like, “Yeah, it seems like now is the time.” And by then we’d had that conversation after our current president got “elected.”Okay. All right. We will get to that in a second.And so, yeah. And so we thought we had something to say about that and we have something to say about these people, these characters living in a time that everybody else is living in. That’s what’s cool about the show. These characters …[cheers next door]Woo, it’s like something is over there. Yeah.Yeah. We should probably be over there. Yeah. Exactly.These characters experience things the same way America does.America does.So at the same time.Did you worry about that sort of return to like ... there’s several of them now, after ... “Murphy Brown” just came back. Yours is very sharp.Thanks. The writing is amazing.It’s superb. I worry about when things come back, whether they’re going to be as good as ...Yeah. I do too.Was that a worry for you?No. Because we had long, long conversations about what this would look like. And before, we were like, “Let’s do it.” Because now, we have proof of concept. Now we knew people wanted it to come back. So before we decide to, let’s really sit down and talk about what this looks like, what these characters would be, and so, great. And they’re very self-aware enough to write the character, self-aware. So ageism, all of those things were written because we have to write what the audience thinks.Right. Right. And what do you ... Some of these things which shows are not good, they’re not ... They shouldn’t come back. They are not ... Right. They were quick fixes for ratings for a network in this kind of climate.Exactly. Right. In this kind of climate, meaning?Meaning the downtrodden...That the ratings are so much lower.Yeah. That they get lower and lower every year for every single show in television. Right.Except for events like the Super Bowl and all those things.Right. And so how do you deal with that? And live musicals, those as well.Right. How do you conceive of a show if that’s the case, if there’s going to be lower ratings.Well they have to figure out, and I’m sure they aren’t, already have ... And this is the part that I’m not in behind closed doors of is they have to figure out how to make deals with the advertisers about same-day plus-three plus-seven in DVR numbers. I don’t know how that works, but you can’t just say, well, you got a point five and your show is canceled. Now there are other factors that culminate in the decision of making a show a hit. So you have to take that into consideration.So what if it is?Yeah. What if it is? Right.Right.Because our numbers got a huge and three .... plus three like last year, in plus three or plus seven. We were like the No. 3 show on television. There was like “Big Bang” and football...And “Will & Grace.”Yeah.Why do you think it’s been successful now? Is it just the writing or is it the timing? I think so. I think to find ... From an actor’s perspective, I think we’re so in the skin of the characters that people pick up on that and see that we try to play it as real as possible. Because the problem with the format now, it is so old, it is aging, that a lot of people act ...The format. The comedy. Yeah, the sitcom.The format is ... A lot of actors act presentationally. Because it is very theater. Yeah. So it feels unreal. And yes, there’s nothing real about our show, either. It’s fake, but I guess people react to ... And yes the writing and it’s just ... If you cut all the bullshit out about what we’re talking about right now, it’s just funny.Yeah. Yeah. Absolutely.That’s all people give a shit about.Yeah. Yeah. And do you ... You’re going now for three seasons and how long do you expect this to go on? I would like it to ...Were you surprised how will it did? Yeah.Because the first show is what? In the Trump White House? Is that right? Yeah. Yeah. Yeah.You were having sex with the Secret Service agent.Yeah. Right out with a bang. Right.Right.Right. Right.I remember that, years ago.Ridiculous. Yeah, that first season was back with 16 episodes. We’re doing 18 now and 18 next year. So, that will bring us to around 240ish episodes. “Cheers” was on 275, “Big Bang” is going to be on 279. I would like to do 280.280. All right. So because ...Yeah. Because “Big Bang” will be the longest-running one in history.Right. And you’d like to just ...Why not? It will be fun, right?Yeah, absolutely. So what do you imagine is going to happen? Are you still getting married? My character?I saw you in the show the other day recently.My character?Yeah. Your character.Yeah. He’s getting married to Estefan Gloria, who is a flight attendant played by Brian Jordan Alvarez. And yeah, so the season will end with a wedding and we’ll see how that goes. Yeah. Do you like that Jack is getting married?Yeah, I think it’s hilarious. There’s so many areas we still haven’t touched on with the characters and that’s one of them, Jack being married. Like, what’s that like? Right, exactly. And one thing that you do a lot of is ...Talk too much.No, I think it’s great. You talk plenty, but it’s funny enough. Is really take aim at the Trump administration. You really do. All your Sessions ... Or your Pence jokes.Yeah. Yeah. Yeah.There were several Pence jokes.Yeah. Yeah.But I was like, I could not believe they said it on network television.Yeah. Well, he’s a bad man. I understand that. I get that sense. Yeah. So somebody ... I think more can be done through the power of comedy than just yelling and screaming. Yeah. Yeah. What was the Pence joke? It was so good. There were so many. There were several. You did several of them.Yeah. We did ... I was talking to Karen about getting plastic surgery done. She’s like, “It’ll take that Mitch McConnell neck right out of there.” So that was great. He’s a bad man, too.Oh, my God. The turtle. Yeah.The turtle, yeah.Yeah. Yeah. Yeah. He’s, they’re all bad men right now.“Four turtle doves, four turtle necks.” That’s the invention of, that’s why they invented the turtleneck. Because Mitch McConnell.Right. Exactly. Because of Mitch. So you could cover up...Yeah. He’s a turtle neck. Yeah. You know he’s married to Elaine Chao. Yes. I do know that. Which is so ironic. Wouldn’t you like to be in their home, to watch that ... I want to have dinner with Michele Bachmann. Do you? Why?And Mitch McConnell, all those people. Because I don’t think they know gay people. Yes, they do. They can’t possibly. I think they do.Really?Yes. And?I don’t know. And they don’t like them or they like them?I think ... I don’t know. I don’t think they think about people in those terms. So I want to finish up talking about politics. So here you are. This is a highly ... I’m shocked by some of the things that are on “Will & Grace.” And I love it. I like that they’re doing it.Yeah. Yeah. I do, too.They go very far for a network show, even more so than the ones on Netflix or anywhere else, which is really fascinating to me.Yeah. Yeah.How do you guys feel about that? How do you feel ... Do you feel at risk doing that? Or is it just ...No. I think again because of the more niche-y audiences now. We have our loyal audience and we’re there for people to enjoy it if you want to come along. But it has a point of view and I think that’s why it does well. That’s another reason why it does well.Because some things change, I agree.Yeah. And that’s a strong point of view.I think it has to be genuine. I think a lot about companies.And I think that’s why people responded to “Roseanne” or whatever show that’s a hit. They’ve a very strong point of view. There’s something to say about that.What did you think of that of what happened there with Roseanne?What happened with Roseanne?Yeah.What do you say?I don’t know. What do you say?I don’t know. I asked you first.I think she is appalling.You do.Yes.I think she’s ill. Yes. That’s what I mean.And that makes me sad for her. Yes it does, but I thought it was really interesting how they ... The reaction was really interesting to me. Yes. And I found it surprising that she was unaware that the president of NBC [ABC] is an African-American. Yeah, that’s true. Yeah, that’s true. That would be an issue. But the thing is ...When you kind of have met her ...What was interesting is the quickness of social media and stuff like that. Now you, do you participate on all that or not at all? I do, yeah. Twitter and Instagram.Yeah. You have an account. And what do you think about that? How do you do that? Because she just started typing, probably ...People who know me in that world, I don’t ... I’m not a politics person. I just ... It’s not who I am. It’s not in my DNA. For some reason you’re making me talk about it, I feel uncomfortable, but I don’t ... I’m not one of those people. Right. But what do you use it for then? What do you use social for?To spread joy. Have you ever heard of that, Kara Swisher? No. Not at all. I don’t do that. That’s not my job. Pain and suffering. No. Yeah. I mean, that’s kind of like my brand, I guess.But where I want to get at with Roseanne is, are celebrities aware of the impact that they have using social media or do you think they have ...Absolutely. What do you mean that they are aware of? Of course they are aware of.I mean I know, but not everybody uses it. I can tell you a lot of celebrities don’t use it. I had to bother a billion of them for them to use.Want them to use it for politics or use it in general?No. Use it for their work, to get their work done, and get the ...Yeah. I mean, I guess you kind of have to, right? It’s part of the gig now.Right, so you use Twitter, what else do you use? Twitter, Instagram and that’s pretty much it. Yeah.Yeah. You don’t use Facebook.And I text a lot. You text a lot. OK, I don’t get...Oh, Facebook, sorry. Facebook.And Facebook yeah. Facebook a lot. We ... Some people at Facebook said ... Me and my husband Scotty were — their quote, not mine — “the pioneers of video on Facebook.” Right. Explain what you do?Because we did lip sync videos and we were the first ... Some of the, if not the, first people to actually post content for enjoyment on Facebook. So we lip sync to famous songs and we ... And that, by the way, that’s the end of the sentence. Yeah. And then what do you ... Why did you do that? And not on YouTube? Why not on YouTube?Why’d we do that? Because if a day goes by that I’m not feeling creative in my brain is the day like we spoke where I have to look at myself and be sad so I don’t want to do that. So we create stuff and he is a music producer, composer. He does the music for “Will & Grace” and “The History of Comedy” along with his music producer Leo Rosner and they’re great together. And so we were like ... We were literally sitting there and he goes, “Hey, come listen to this Jennifer Hudson and Iggy Azalea song.” And I was like, “Oh yeah, that’s really cool.” “Hey, we should lip sync to it.” I’m like, “Why?” “We should make a video.” I’m like, “For what?” He’s like, “Just because.” I’m like, “No, I’m going back inside unless.” Because his office is in the back, “I’m going back inside and I’m sitting on the couch, watch TV.” Right. So he’s like, “Just listen to it.” I’m like, “I listen to, oh, it’s cool.” He goes, “Just memorize the rap part.” I’m like, “Ugh, it’s too much work.” Okay. So I took the dog for a walk around the block and put my airpods, earbuds, whatever.AirPods.And listened to it over and over again. It was kind of fun to do it. And then I was like, “Okay, let’s do it,” one or two takes. We put it on the web. And I was like, that’s kind of funny. I literally thought my friends were going to see it and that’s it. 40 million people and we’re like, what? And then that just started it. So then we started doing that over and over again. So why didn’t you make a business out of that? We tried so hard.Yeah. But you were on Facebook. That’s why.Exactly. Nobody was interested. No. Nobody on Facebook. Right. And then we didn’t know how YouTube worked and I don’t know.What do you mean you didn’t know how YouTube works?No. I mean like, so you put it up. Okay, great. So then what? But there are a lot of YouTube stars. I don’t know if you’ve heard of that.I know, but I’m busy doing 10,000 other things.I get that.To go and have a meeting at YouTube. But like how do we monetize that? All right. Well, you need a producer, but you know what? I’m just going to make the videos, put them up and go back to my work.That’s how most of the YouTube stars work. You know that?What’s that? They all like live in one area of Los Angeles.Oh, of course. But I’m like, that’s for them. I’m an actor, producer. So you don’t have time for that, even though you have 40 million downloads. Don’t you look at that number and say maybe there’s something going on here?If somebody wants to take that on and show me where to stand and what to say, I will do it.Right. But you’re not. I don’t want to ... I’m not ...You don’t want to be a YouTube star?To build that business is exhausting. Right.It’s exhausting. You have to put out content constantly.You do.While I’m doing all those ...I was with a YouTube star on the weekend and that’s what she was saying.Yeah.She was saying that it’s exhausting.And they have a window, just like an actor has a window. Just like anybody else would. Yeah.  They absolutely do. She’s exhausted by it, I think. But still, it’s quite huge. Yeah. It is.It’s a constant ...So I have to go to bed, Kara, every night knowing I made people happy without making money. I see. Okay. Do you feel good about that? What’s that? Do you feel good about that?I feel really good about that.Good. That’s nice. So did you stop doing them? Or do you keep doing them?We just did one in Spanish about a month ago and then we might do a Halloween one. Like what? What’s the Halloween one? Yeah.Do you know “Kooky”? The song?No.[hums song] Who sings that? Dusty Springfield maybe?Okay. Maybe.Maybe. I don’t know. “Spooky!” Not Kooky. “Spooky.” “Spooky.”Okay. “Spooky.”I sound like a dad. I’m just like, “Not Kooky, ‘Spooky.’”So last bit. You’ve been married eight years?I’ve been married I think four but together 12.But 12. So you met on the set of “Will & Grace”?He was the DJ on the Ellen DeGeneres talk show.Wow.When it first started.Right.And so you could say, I kind of met him that way. And you had a marriage-marriage? A gay marriage.A gay marriage. It is legal now. Yeah, I know, I heard. Right now. Just when I got divorced, but go ahead.Timing is everything. So in our backyard, with like eight people, it was great. And he’s a music producer. Yeah, he makes music, he does music for “The History of Comedy” and I said that already and he actually composed the theme for “History of Comedy” and I played it. I want to finish up. No reaction, by the way.I heard you. The reaction was inside my brain. Sure. I wonder how it’s like just to spend a couple of hours there.It’s hard. It’s really hard.It’s really like a haunted house, like getting people scared on your left and right. Right? Around this corner it’s like — whoa! — Michael Myers.It just came back. I know, I can’t wait, I love it. Are you excited? Are you going to see it?Yes, of course. I cannot see it.Why you so scared? Because it’s ... you already have it in your brain.Because I went to ... I am Michael Myers. I went to see it when I was a teenager. Right?Yes, of course.I guess we were around the same age, right? And my boyfriend at the time had seen it before me and he got up to get popcorn during part of it and ...And the scariest part was that you were with a guy.Yeah. That’s scary ... He was a very nice ... I was a great girlfriend. Let me just tell you.Okay.To straight men. You know why? Because I slept with him, I wasn’t clingy, and I wanted him to leave me alone. Men like that. Men ... honestly, we’re the perfect girlfriends. Think about it.That’s hilarious!Lesbians make the perfect girlfriend to straight guys. Think about it.By the way, really quick sidebar, about “Halloween.”Yes.But sidebar. Don’t you think it’s fascinating when gay marriage wasn’t legal and people were fighting against it, that me and you could have legally gotten married?I can’t believe you didn’t ask me. John Lovett asked me.But, isn’t that kind of creepy?Yes. Okay, glad we’re the same ...It’s weird.Like my ...We can still get legally married, but you’re already married.Scary.The scary moment in the movie, he grabbed my ankles under the ... under this chair ...Yeah.And I’ve never gotten over that.Wow!I know. It was really cruel. So, do you not like scary movies at all?I hate scary movies. I won’t see “The Purge,” those aren’t really scary, they’re just gross.Wow, yeah. Or like, “Saw,” or anything.But what about ...I don’t like ...... what about, “Get Out,” which is like a thriller? I barely made it through that one.Oh that’s a great movie.I know this. I did go to that cause I heard it was good. So I did go see it. But, I don’t like ...“Fatal Attraction”?No. But it’s not a horror film.I didn’t like it.Oh, all right.I don’t like it. Like, I go to “man movies,” I go to like ...“The Lion King”?That’s fine. Okay. It’s okay?Yes.Scar dies.I went to see the Michael Moore movie this weekend, with my children. My sons. My teenage sons.Oh! Fahrenheit-Fahrenheit-... Fahrenheit-“Fahrenheit 11/9 ...”... nine. And?I loved it. Oh, I can’t wait to see it.I love a Michael Moore movie.Let’s talk about documentaries for a second. We gotta go, or no?All right, yeah no, go ahead. Keep going.Okay, so wait, “Whitney.”Then we’ll get some questions.That was a great one.Yes.Lesbian.Whitney as in who?Whitney Houston.Everyone knows that, yes, go ahead.I know, but like, that’s it.Okay, thank you. The lesbians knew that a long time ago.I know.Yeah. Kelly McGillis, we know. We know the whole story.Kelly McGillis. Fight with Jodie Foster. Go ahead, move along.I didn’t know that.Yeah, I’ll tell you later.Okay, so wait. Whitney ... I saw the Mr. Rogers one, which was great.Great, it was amazing.Not a lot happens.No, no.He was just great to kids.Well, it’s Mr. Rogers. Yeah, but great. You’re not gonna get suddenly ...Right, there’s no drama.Right. But, great documentary. Jane Fonda: great documentary.I had not seen that one, but I’m going to.Very good.Warren Buffett?I didn’t ... Oh, I saw that one, yeah. Yeah.How about the McDonald’s every day? I know, you know what, I’m going somewhere to Omaha next week, to go meet someone.That’s very specific.Very specific. But, what? Who? Warren Buffett.You’re going to meet him, for what?He’s a fan of the podcast. He wanted to meet me.Just you two?Yeah.Oh my God, I would love to meet him.Dinner. He’s ...I met his daughter, she was very nice.He wants to have a steak dinner. I’m a vegetarian, I’m gonna eat a steak. I’m really gonna get a ...No.Yes, I am. Well, you don’t have to.But I’m going to.Why?‘Cause it’s Warren Buffett, and he offered me a steak and so I’m gonna have it.Oh, right. Isn’t he a brilliant ...Yeah.That man’s brilliannt.Yeah, he is, so ... yeah, stuff like that. Anyway, yes. Documentaries ...So anyway, I don’t know, there’s a couple of other ones. “Making a Murderer,” you know, there’s a second season.Yeah.So what did I do? Googled it, ‘cause I wanted to know the outcome.What?’Cause if it’s a happy ending, I would watch it. If it’s not, why waste my time?I don’t understand that. I don’t even ... what do you mean?“Making a Murderer,” did you see the first one?Yes, I did, but it’s not happy at all!Okay, so the second one, shh, listen to me, stop talking. The second one, is about a prosecutor from Chicago trying to overturn the verdict. I see, right.Right, so I was rooting for those guys. Cause I don’t think ... I think they’re innocent. Right.So, I was like, “Oh, I can’t wait,” because I saw the trailer for it, I can’t wait. I’m like, “Wait a minute, if she doesn’t win and overturn the verdict, I’m gonna feel really bad about it.”But then you found out anyway, by Googling.But if she does, how thrilling is that gonna be?Right.And so I won’t tell you how it ends.Okay, fine, so I’m not gonna watch it anyway. So it’s fine.Okay, cause it’s got murder in it?Right, so I’m gonna take some questions from the audience in a second. But the last questions that I wanted: When you look at this environment, or the midterm elections ...Oh, we gotta talk about SonicCloud, too.Oh, SonicCloud, yes, investments ... What invest ... You do investments, also? Yeah, I have several, but one that’s really on fire.Because that’s a thing, Hollywood people doing tech investments.Well, it’s not a thing that’s only in Hollywood. There’s other human beings that invest.Yes, that’s true, but every now and then Matt Damon pops up in the investment ...Because he’s famous. But ... so you hear about that investment.Yeah. And then they fail.Most human beings invest.That’s right, okay, so ...So, “you Hollywood folks invest” is a nice little Kara Swisher dig to the Hollywood community.It’s true though, I really have to come troop down here to meet Ashton Kutcher every three years about whatever he’s investing in. But, go ahead.Oh, really? Does he ...He actually is a very successful investor.I know, I need to invest what he’s in.He was in Uber, he was in ...I know, amazing.Yeah.So anyway, I invested in this thing that’s very ... getting very large right now, which is called SonicCloud. SonicCloud is an app on your phone that makes hearing more clear for people with moderate to profound hearing loss. Okay.Wow, how’d you get into that?My friend ... one of my very close friends, Larry Guterman, who directed a movie called “Cats and Dogs.”Yeah.Hilarious movie. Back in 2000, I think. He has hearing loss, so he invented this, with many other people. And so it also allows you to stream media — music, TV and movies — without the use of captions or hearing aids.Oh, wow.So, it’s revolutionary. And, right now it’s doing really well, and there’s other things happening that I probably can’t talk about. Among people who have hearing loss.Right, which is hundreds of millions of people.Right.It’s not just hearing loss, it’s anybody ...He filled a hole, in a niche.That’s right.That’s right.But, it’s people who have even mild ... who would like to hear more clearly.Right.Right.Did you invest in any other internet companies? Or things?Yes, something called KnowMe.KnowMe, what do they do?It was what somebody, I think the iPhone now adapted it, but storytelling through ... You used to hold the phone and just record and as soon as you let go, it stops recording. And it would piece together those videos. You could tell a story. Right, and what happened?Didn’t do well.Didn’t do well?No. Do you like investing in internet companies?I do if I know it’s Google.Right. Yeah, there’s only one Google. I know.It’s done. I know.It’s actually in a bit of a trouble. Do you think about the damage the internet companies are doing to our society, ever? I think about it all the time. Oh God, that’s so heavy.I know.What the internet companies are doing to our society, in what way?I don’t know, the election?Well, yes, of course. Yeah. Yeah.I mean, but it also does good things. But, yes. It does a lot of bad things.I think it does. Anyway, let’s ask questions from the audience. Sorry to end on a bummer question.Questions, questions? Right here.Audience member: Do you, in your business dealings as a producer, or even as an investor, do you find that being a gay man in this continent still has its barriers in that world?Sean Hayes: So he asked if I was, as an out gay man, if I came into problems in investments or producing or other ventures, if that ever comes into play. I’m sure it does, it’s never ... I never feel it or hear it, because I don’t, I stopped taking care of people’s feelings in that area a long time ago and their uncomfortableness. So now I just kind of own who I am. So if they have a problem, I don’t know about it.I don’t think so, as much in Hollywood ...I don’t think, not in Hollywood really, yeah.Yeah. I don’t think so. Hasn’t stopped me.But boy, the second you take a step out.What do you mean? Oh, anywhere else?Just like, yeah.You think?I’m not a big star in, you know, parts of Texas.How is it in Illinois? That’s, you know, really ... it’s an unusual ... you’re right, they like the lesbians more.I went to a high school reunion, my high school reunion three weeks ago.But you would be the most famous person from your high school, presumably, right?I don’t know about that. But, yes.Imagine, yes. Who else?But... So, and everybody was so lovely. I actually am one of the few who loved high school. And there was one guy who didn’t look at me and I was like, “Hey!”, and my hand was outstretched to shake his hand and he just didn’t look at me and put his fist up for a fist-bump. I was like, oh, so gross. Really? You thought that was ...Where’s the evolution?Really, he thought it was just anti-gay. Or maybe you did something?I got that vibe that I’m familiar with.Yes, I’m familiar with it too. Yeah. I’ve had it happen to me. And, did you not do anything? You didn’t want to say anything?But, what’s the point?Yeah, what did he do?That’s like trying to change a Trumpster.Right, well you can. Don’t you think?I can ... I think, the news today reports ... and the extreme left and the extreme right, because there’s a lot of drama there, and that’s what people are into. And nobody reports on the independents or the undecided. Right, why do you think that is? Cause it’s ratings?There’s no story.There’s no story, what is these ...I mean there is a story, I think it’s interesting, but there’s not the flaming drama.Right, is that where we’re headed, do you think?Where, to...?In that thing, where we’re, the part ... the bipart ... there’s no such thing as bipartisanship.But then, they always say we need to campaign to the undecided and the independents.Right, exactly. But what do you imagine is going to happen in the midterms? I don’t know. I think that both sides are fired up. I’d like to believe that the left is more fired up now. But, we shall see.Do you wanna have a left and a right? Do you really wanna have that?No, I think we should have, I think we should have an independent.Right, in the middle between everybody. Yeah.Yeah.It really is ...Don’t you think, maybe, it’s heading that way?I don’t know, I think people every day ... Trump does something like the Saudi thing that I was telling you about, that they’re “rogue killers” now, he just repeats what this obviously fascist dictator in Saudi Arabia is saying.I think, I don’t have ... I’m not as well-versed in politics as you are, I don’t have like statistics and history to call up in my brain in an instant. So I react emotionally, like most of the country does. And just from an emotional standpoint, it’s embarrassing. He’s embarrassing.Yes, of course. But I think people ... It never ends, and people ... It still goes on. And so, it’s ... you know, largely because he happens to be the president of the United States, so you really can’t avoid the president of the United States. Right, I wish he would heal ... I wish he would say healing things, but he never does.Why do you imagine he would?I don’t, I would like that. But it will never happen.No.But it will be nice.Yes, but, did you ever watch “The Apprentice”? Because I did.Yeah. Yeah, did he ever say anything nice on it?No, I mean, I understand what you’re saying.Yeah, he’s never … I’m just saying it would be nice if somebody said like, “Hey!” Because on “60 Minutes,” did you hear him talk on “60 Minutes,” anybody? Where she was like, she said something to that effect. Like, what about, you always talk badly about the Democrats. And he said something negative again to that, her question, about the Democrats. And you’re just looking for him to say ... when she says the word, Democrats, she’s talking about a hundred million people, you know? If you divide, you know ... and he just won’t say anything nice about the hundred million people who live in this country who aren’t Republican. Yeah.It’s astonishing. Just that fact.Really? The only part of it that is astonishing to me is that there are people who are surprised by it, his behavior.No, I got it. I’m on board with just how crazy it is.He just will never say anything nice. It’s really fascinating ‘cause they go, you know you were saying before, this time, now he’s ... people are finally gonna get sick of this.Right, and they don’t. They eat it up.No, they don’t. That’s a bummer.And they believe what they believe. And they think the same about us.Would you ever run for office?God, could you imagine?Yes.I actually sat there, on the couch when it was all happening, on Election Day in 2016, and I said out loud, I go ... when he won, I go, “This means I literally could be president.” I literally ... I seriously could be president of the United States.It’s Jack.Anybody can. Yeah, anybody can.Yeah. I don’t know about that, he’s pretty famous. I think he got very famous during “The Apprentice” on NBC.No, I know, but I’m saying: He has no experience.Of course not, yes.So, in that sense, anybody could.Yeah, I said ... yes. Also, Tom Hanks, for example. You must encourage your friend to do so. It should be funny.Yeah! He would be ... yeah, I wish he would. I think actually we should have not-actors being presidents. That’s my feeling. Anyway. Another question, any other questions? Right here.Audience member: Can you speak to how the revenue model has changed from the production side, from the traditional network television to these platforms like Netflix or Amazon?Sean Hayes: Yeah, it’s really disheartening. Are you in the biz at all? No? Yeah, it’s ... You know, like I said before, you’re constantly trying to figure out how to increase revenue through a platform — like these guys have about ownership — and so you try to subsidize in other ways by creating podcasts or whatever you can before they get on board and suffocate us that way. But, I don’t know. I don’t know the answer. I don’t know. But, you know, a little company like ours is always trying to figure out how to increase revenue. And it’s all about ownership, so we have to figure that out.Ownership, meaning you have the show, so ...You have to own part or all of the show.Right, exactly. That’s exactly right. Or you have to figure out if you’re going to do a distribution, what’s worth it. Or you use the different platforms ...Yeah, because they own the distributing, right, and they have the upper hand in everything because they’re writing the check. Anybody, anywhere, that writes the check for anything, has the most power.Did you ever think of taking venture money? To do different options?We’re talking about that.Right, I’m curious, lots of people have not done that yet.Yeah and there’s stuff that’s happening that I can’t really discuss.But you see, you see that happening. I was just interviewing the Sweetgreen guy, sitting on $122 million in venture capital, for the first time in ...For who?Venture captial is from Silicon Valley.I know, for what though?Sweetgreen. The food ...Oh, Sweetgreen, yeah.You know, the chain.Yeah.That’s a lot of money, $122 million.That is a lot of money.To expand and create their business. And that’s venture money and the first time that it’s really been applied to fast food. You know, usually it’s a different kind of thing.Yeah. What about water? Are you going to invest in water?Water?Yeah.What do you mean, water?Haven’t you read about that? People investing in water?No. Water what?The stuff you drink.Yes I know what water is. Thank you. Yeah, how investing? I have not heard about this.Because that ... We’re gonna need that ... Global warming and ....Yeah. Isn’t that the plot to an Arnold Schwarzenegger movie, when he lived on Mars? That was.Yes, what was that movie.Yes, Red… what was it? It’s the plot.What was that movie, anybody?Controlling water on Mars.“Total Recall.”“Total Recall,” that’s exactly the plot.Which is what I just did to think of the ...Yes. Yeah, we’re gonna run out of water, but you and I will be long dead, so what’s the difference?We will have cases of it in our garage.Garage, something like that. Right, any other questions? Any other questions? Right here.Speaker 3: When you’re choosing what to produce, is it just content that you personally would like to watch? Or how do you pick?We ... yes, part of our edict is that. And our mission is to create things that only we watch and it has to have comedy, even if it’s a drama. Has to have a little bit of comedy. But it has to be something we’d watch, yeah. For sure.And finally, any other questions? Any other questions? Oh, right here.Speaker 4: What’s your favorite thing about being “just Jack?”I love the character Jack because there are no rules. You can ... He lives in almost an alternate universe where he can act and be and say almost anything. He can go from job to job to job. And it’s always funny to me what the writers came up with. I mean ... And it’s, you know ... A lot of actors shy away from the thing that made them famous, which I think does a disservice to them and their fans.Right.So I kind of was like that, maybe 15 years ago. I was like, I’m gonna show the world that I’m an actor and not wanting to talk about Jack. Now, of course, I embrace it wholeheartedly, because you guys do. And the audience does and I know ...And you’re a little like that.What’s that?You’re a little like that.Yes, of course cause I play him, so ...Right.... There’s a lot, there’s a big part of me that’s like Jack. But most of it, I’m not anywhere near.Right, but I mean ...I’m married, I’m boring, I am ... I have a business mind as well and you know.He has a business mind.It’s going really well for him.Yeah, exactly.It’s not. It’s not, is the joke.I’m just curious, do you have a favorite episode? I remember when you were talking to your son and they had the boarding ...At the conversion camp?Jane Lynch was in it.Did you notice the painting of Pence in the background?No, what?Yeah, they had a painting of Mike Pence in the background at the conversion camp.Really? I need to go back and watch that. I missed that.Last year’s episode is called, “Grandpa Jack” and Jack finds out he’s actually a grandfather, which is hilarious.Right.And his parents, which is Jack’s son, Elliot. So, Jack’s son Elliot and his wife are from Texas and they’re taking their kid to a conversion camp, because the kid’s gay.Right.And then, at the conversion camp, there’s a painting of Mike Pence and ...Jane Lynch and Andrew ...And I go down there, I give this big speech about how it’s okay to be you, you create your own family wherever you go and blah blah blah.Right, that was a great episode.Yeah, I love that episode.It was really wonderful.From long, long time ago probably, the Cher one was ... And also where I come in, I’m high on coffee and I talk really fast.Okay, good. Okay, last question. What do you imagine you’re going to be doing in 10 years?I love that question. I have no idea and I love not knowing. But, I don’t think I’ll ever have a job behind a desk, because I would go crazy. I think I have to create, always something. We have a children’s book coming out called “Plum.”Really?That my husband Scotty and I wrote. It’s how the Sugar Plum Fairy got her wings, because I’ve been fascinated with the “Nutcracker” ever since I was a kid.Really?I memorized every note.Have you seen the new movie? The new Disney movie?No, but isn’t it ironic?It’s coming out.Crazy timing?Yeah. And so, I know every single note.Looks beautiful, actually.It does look beautiful. I know every note of the “Nutcracker,” and I was wondering where do their people come from? Where’s their origin stories? Because it’s like, it’s like a story on acid. It’s like “Alice in Wonderland.” Yeah, it is.It’s like the Prince is fighting and Mouse King, like, what’s happening?Right.Right, so ...Why are you obsessed with the “Nutcracker”? That’s so interesting.As a kid, I listened to it over and over and over again.Really?I know every single note. When I say every note, I know every note of every instrument of every song in the ballet.Wow, that’s astonishing.I memorized it. I could do it for you now, if you want.No, thank you, okay, because ...And, so anyway, I’ve been obsessed with it so that ... so I was doing Broadway. I was doing “An Act of God” on Broadway ...Yes, which is where we met.Yes, where we met. And, during the day, I didn’t have anything to do, can’t sit still.Yeah.I have to look at myself.Right. Okay, got that.So I said, “Scotty, let’s write a children’s book.” He’s like, “Great!” Three months later, we wrote a children’s book. Two years later, it’s out.Wow, so it’s coming out for the ...It’s coming out tomorrow.Tomorrow? Oh my goodness! Well, congratulations on that.Thank you.I like the “Nutcracker,” but I took my kids once to see it. Which they didn’t appreciate, I can tell you that. Is that the end of the story, like you get stuff? Five things you get sent?No, but we were walking out and a woman turns to the other woman, as we were walking out and said, “Ah, one more ‘Nutcracker’ closer to death.”  What?! Wait a minute, what? What does that mean? Like we saw ...Meaning, like you go to see it, like Christmases, or something. Everyone goes. “One more ‘Nutcracker’ closer to death!” Honey, that’s hilarious.I know! I thought it was ... it was my favorite moment. I was like, she’s 100 percent right.One more “Nutcracker” closer to death. That’s actually the logline of our book. So, we’re gonna sell a lot to children. Anyway, thank you so much for doing this show.You’re the best, I love you very much.Thank you for coming out to this.Thank you guys.Thanks, and when you do your podcast, I will come on your podcast.I would love that.That would be really good, I’m excited, we’re excited for him to do one, too. You know, you can make a lot of money. There’s lots of advertisers. I know.Yeah, anyway, thank you so much.The networks will be on it. All right, thank you so much.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}