{"id": "‘The Front Runner’ director Jason Reitman says technology has taught today’s young people how to be great filmmakers", "paragraph": "Jason Reitman’s new movie “The Front Runner” chronicles the sex scandal that ended Gary Hart’s 1988 presidential campaign, which means it’s set in 1987 — a year when Reitman was only 10 years old and not yet making movies.Back then, becoming a filmmaker was a goal with high barriers to entry. But if he were growing up today — and if his father weren’t the director of beloved movies like “Ghostbusters” — Reitman thinks he might be one of the kids on YouTube, learning filmmaking technique accidentally.“The old way was, you play a concert the day you learn guitar, right?” Reitman asked on the latest episode of Recode Media with Peter Kafka. “And your first time you ever play out, of course you don’t know how to play guitar. You literally just picked up the instrument.”“Think about how young people [today] know their angles and the use of light, and the use of lens,” he said. “You see people take selfies, and they’re raising the camera, because they understand what it does to their face. All these ideas of lensing and camera work are things that are just inherent to a generation.”An ardent fan of seeing movie theaters in his personal life Reitman, is one of the directors who has not yet made the leap to a digital platform like Amazon or Netflix. But he’s no luddite, either; he told Recode’s Peter Kafka that he was impressed by the editing style of YouTube videos, as well as professionally-made movies like Sean Baker’s “Tangerine” that can be shot entirely on an iPhone. And, he said, his attachment to the theater may just be because of when he grew up.“I’m sure if I was growing up right now, I wouldn’t think twice about it,” Reitman said. “I’d be like, ‘Yeah, I watch everything on Netflix. Why would I care?’”You can listen to Recode Media wherever you get your podcasts — including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a full transcript of Peter’s conversation with Jason.Peter Kafka: This is Recode Media with Peter Kafka. That is me. I’m back. Thanks to everyone for your patience. I’m gonna have more extended thank you’s at the end of this podcast, but for now, to introduce you to Jason Reitman, who has not one, but two films out this year. One is called “Tully.” It came out in the spring. The other one is called Front Runner, which should probably be out as you’re listening to this. Welcome, Jason.Jason Reitman: Thanks for having me. Thanks for coming. You’ve made some of my favorite movies, which is what I tell most of the directors that come on here… because it’s true.Don’t lie to me!Because I get to pick and choose. It’s true.Don’t butter me up.“Juno.”Thank you.“Thanks For Smoking,” “Young Adult.”Thank you.What am I missing? I’m missing a whole bunch. “Up in the Air?”“Up in the Air!” That one makes me anxious, which is why I think it blocks it out.Why?’Cause it’s about losing your job, or one of the plot lines is about losing your job.It’s interesting because we made that movie in the midst of a recession, but when I started writing it, we were in the midst of an economic boom. So when I wrote the movie, the idea that he fired people for a living was kind of ironic. And then by the time we were making it in 2010, and shooting-It was very real. ... Yeah, we were shooting in St. Louis, and we were shooting in Detroit. They were two cities that got really hit hard. Detroit, obviously. St. Louis, the Anheuser-Busch plant had closed and 10,000 jobs, or something like that, were gone. And, I remember my father came to me, ‘cause he actually produced that movie, and he said, “You know, you’re capturing a moment. You have to treat this realistically.” And that was the moment we decided, what if we cast all real people who had lost their jobs and put them in the movie?Right.And we put out an ad as though we were making a documentary about the recession and we brought in all these real people, and we interviewed them, and then took them through this roleplay where we kind of fired them on camera-It’s kind of unbearable even now to ... It’s on Netflix and it’s also downloadable, so it’s definitely, it’s probably on my phone right now as we speak. Watching those scenes makes me really upset. Well then, I guess I did my job right, so I will take that as a compliment. Thank you. Congrats. I’ll talk to you a little bit about “Tully,” but let’s talk about “Front Runner” since that’s the movie that is out. That is the Gary Hart story. I think a lot of people who listen to this about tech, and media, and politics, will know the Gary Hart story, but want to give them the 30-second synopsis?Yeah, sure. Well, look, they may not. I’m 41 years old and when I heard a Radiolab centered around Matt Bai’s book on Gary Hart and the scandal, I didn’t know the story. I was 10 years old when this happened and I was much more interested in the trajectory of the “Back to the Future” trilogy than I was about politics, at the time. Gary Hart, in 1987, was the presumed next president of this country. He was 10 points ahead of George Bush. He was 25 points ahead of every Democrat.Telegenic. I mean, charismatic, Kennedy-esque, and had big ideas. And look, this is a guy in the mid-80s who was saying, “This country’s addicted to oil. That addiction’s gonna take us into the Middle East, where we’re gonna encounter Islamic terrorism and not know how to fight it.” This was a guy who’s kind of ahead of everything, and he had an affair. He met a woman at a party, on a boat, and invited her to his house in D.C. and a Miami journalist followed her there. And they wound up, Gary Hart and this journalist, a couple of others, in his alleyway in the middle of the night. In a scene that is right out of a movie, where no one knew what to do, ‘cause no one had ever been in that position before. He famously told the press of it, and I guess it’s the Washington Post, specifically, “Go ahead and put a tail on me, you won’t find anything.” Yeah, that’s actually kind of a misunderstood part of the story. And one of the reasons I wanted to make a movie was that “follow me around” quote, which is kind of — when you ask people about the Gary Hart story, and they say, “Oh, yes-“Monkey Business.”.... Monkey Business.”And a photo. The name of the boat, and a photo. So, and what we misremember is that the “follow me around” quote came out the same day as the Miami Herald article. They were already following him. They were tailing him, they in his alleyway. And then after the fact, it was kind of misremembered or retold because it’s much more interesting to think that the guy said, “Follow me around. Come get me.” And then they did, when that didn’t happen. And the photo, this famous photograph, came out six weeks after he left the race. So, he was done. He was already out of politics.I was gonna ask you. That wasn’t in the movie.It’s not in the movie because look, I’m a filmmaker, I’m interested in story. I’m interested in how we remember things.It’s an iconic image, at least it’s burned in my head. Of course.I was 17 when it came out. So that-And that’s what makes it so perfect. So, what I’m interested in is, look at this thriller of a story. In less than a week, a guy goes from being the next president of the United States to leaving politics forever. A guy, who understood computing economy, Russia, the Middle East. He becomes president, probably don’t go into Kuwait, probably don’t go into Afghanistan, probably is not an Iraqi war. The history of our country is a lot different.So, instead of him, we get Michael Dukakis and Michael Dukakis loses to Bush in a landslide. Yeah, of course. Right. So, but what do we remember? Do we remember that, “Huh, we kind of gave up on this guy in less than a week, perhaps this is worthy of debate?” No, what we remember is, “That boat sure had a funny name” and this photograph that actually came out after the fact, we re-contextualize and make that the idea itself.This is about media, this is about politics, this is about hubris. What does this story, set in ‘87, tell us about 2018 politics?Well, I think it brings up all the questions we’re asking now. The questions about gender politics, the questions about where does a public life start and where does a private life start? Particularly in the era of a reality TV presidency and the celebrification of presidency and politics. And this line, this wall that goes up between the candidate and the press. In 1987, when this moment happens, it becomes the job of the press secretary to never let this moment happen again and because of that you get only manicured statements. You have zero relationship, real… Prior to Gary Hart, politicians and journalists ... You know this, I don’t mean to say this as if you don’t know this, but they’re socializing together. They’re drinking together. They spend time. The journalists knew who these candidates were as people and they could tell us who they were.And there’s a line there, I think you attributed it to Ben Bradlee in there, saying, “Yeah, we knew. We knew when Johnson was screwing around, and didn’t report on it.” They all agreed not to.And yeah, Ben Bradlee really said that. He also really said this other line in the movie which is, “If TV news starts covering something, if other newspapers start covering things, if tabloid news starts covering things, how do they not?” And this is the moment also, where the Washington Post says, “We don’t control the story anymore.” And look, I wake up, I’m like everybody. I wake up and the first thing I do, I check out my phone and I go, “Oh fuck, what happened?” And almost always, there’s a New York Times or Washington Post story and one is about something real, you know, Kavanaugh hearings, midterms, what have you. And then right next to it is from the same source, from the New York Times, Washington Post, a story about Pete Davidson and Ariana Grande. It’s like, really? I’m getting this same news from the same service and it’s on a parallel level?So one thing that is ... I don’t know if this is confusing, but I thought about it the entire time I was watching the movie was… If Donald Trump doesn’t happen then I really have a good idea as to sort of where this movie’s at. This movie’s saying, “this is the beginning of sort of how we go to where we’re at today now in terms of the celebrification of the president and the way we ask them to act and behave and the way we treat them.” But the idea that a presidential candidate was blown out of the water because he had a single affair that was documented, right? We’re in pussy-grabbing tape ... Donald Trump blows all that out of the water. Right? Yeah?I’m not sure if that’s true. I think he’s a unique case and-Well, I guess that’s one of the big fundamental questions of our age.Yeah, and we won’t really know this for five, ten years, maybe longer until hopefully we are out of this hellscape and we have perspective on it. But-If we’re allowed to look back, yes. ... Yes, seriously. But it brings up a lot of questions and right now we are trying to have conversations, but it’s really difficult. You go on Twitter, the level is a 12. You get your head ripped off the moment you say anything on Twitter. So, there’s something about having the prism of 1987. Having a story from another era where you can actually break this down and go, “Okay wait, how did we get here?”Do you and then ... I think you were intentionally removed from this, but do think Gary Hart deserved to be kicked out of the race for this? What’s your take on sort of whether or not he should have been allowed to be a presidential candidate after this if you’re having an affair?I don’t have a take on that. And I purposely don’t have a take on that. I don’t think it’s my job to tell the audience, “Hey, this is what you’re supposed to think.” I hate filmmakers who do that. Any time a director comes in going, “I have the answer,” I immediately tune out. What I’m interested in is filmmakers who have questions, movies that have questions. And this is based on a book that had a lot of great questions about, all right, we seem to gloss over this guy pretty quickly, it went away like that, and we never really reconsidered the potential of this candidate, who he was, how smart he was, how thoughtful he was and what road we went on because of that. And I think we’re looking to have this conversation: Here’s a movie that has the opportunity for either side. It’s a movie not from Gary Hart’s perspective, it’s from the journalist’s perspective. It’s from ... and even within the journalists, you have not only the Herald and the Post, but even within the Post, you have a conversation between five different journalists and editors trying to figure out the right thing. It’s his campaign people who are in the midst of a scandal and you have men on the campaign trying to save him. And you have a young woman, who’s tasked with the job of taking Donna Rice and bringing her home and is forced to look at this candidate that she’s been sacrificing everything for and go, “Wait a second. Who is this guy and how do I really see him?”You do some really interesting stuff with Donna Rice. The way you introduce her in the movie. She is shot from behind. You don’t see her face for a long time. She’s sort of this body, which I assume is very intentional. Well, yeah. What I would tell people I was doing ... People would say, “What movie are you doing next?” I’d say, “I’m doing the Gary Hart scandal.” They would always do this ... They would go, “Monkey Business! And what was her name? What was that blonde’s name?” And they would talk about her as though Donna Rice were an object. So, knowing their presumption, at first, we don’t let them see her. You get to this boat scene, you think it’s gonna be salacious, and you’re not given that. And you’re left to wonder, “Wait, why don’t I get to meet her yet?” And you only get to meet Donna Rice in the movie once her life has been stolen out of her hands. She’s now a human being who was, is, smart, educated, ambitious, and her life was stolen from her. And now the audience, hopefully, has to rethink, “Oh, that’s right. I went in with these presumptions about who Donna Rice was.”I’m assuming you were making this, still finishing the movie, filming, editing, when the #MeToo stuff broke out ‘cause that’s about a year ago. Did that change the way you viewed her character in any part of the story? Did you adjust the movie sort of because of that?I mean, it’s interesting, right? ‘Cause the movie has to be seen in light of the presidency, which happened after we wrote the movie and the #MeToo movement, which started after we wrote the movie. I’m fortunate. I’ve been working with the same producer for over 10 years now, Helen Estabrook, who produced “Up in the Air” and all these other movies we were talking about. And she and I have conversation about gender constantly. And I think that’s one of the reasons why the relationship between Clooney and Vera Farmiga and Anna Kendrick is as interesting as it is in that movie, and it is certainly the reason that we took the approach on this film. Helen would say, and this is prior to the #MeToo movement, she would say, “Look, you have to remember the particular burden that is put on the shoulders of women in the midst of a scandal. It’s different than the burdens put on men.”Because it is almost always told as the man’s story and this is either an unseemly look into his private life and we shouldn’t have done it, or this is he’s got a tragic flaw and he’s not worthy to be president. But it’s always about him and the woman is very often just a side story, if that. An object.Yeah, an object.And we were interested in what if you were the one female editor at the Washington Post and rather than just only speaking your side, you have to speak for your entire gender? What if you are the only woman on the Hart campaign, and because you are a woman, you are tasked with bringing Donna Rice home and get her back to Florida? And in those moments, you have these reflective moments between each other. What if you’re Gary Hart’s wife? What if you’re Lee Hart?And you’re not crying in a corner. You’re strong and you want to stand by your husband. And you’re angry at your husband, and your anger has to be exposed on a public level. And you feel, rightly so, that this anger doesn’t belong to the press. It belongs to her. How do you think about that from the outside?You’re releasing this movie on Election Day?Yeah, we’ll be limited LA and New York on Election Day, and then it will platform out from there.Does that seem like a better or worse idea now than it did whenever, how many months ago?I mean, I don’t. It’s a bit of a stunt. If I’m being honest, it’s a bit of a stunt. There’s only one thing that people should be doing on Election Day, and it’s seeing “The Front Runner.” No, it’s voting.After they vote, they can go see your movie.After they vote, they can ... No, look. On Election Day, people are going to vote and they’re going to be glued to their TV. And we’re going to be seeing where this country is going. And that ...So maybe they can see it the day after.Exactly. Look, in the morning, we don’t talk about “The Sopranos” episode or the “Mad Men” episode anymore. We talk about politics. We talk about what’s happening in this country. That’s our entertainment, and that’s what’ll be happening on Election Day. And I hope over the course of this month, as this film comes out, as you’re looking for a way to kind of have a conversation, like a rational conversation about this moment and see a cool thriller of a movie that’s entertaining and funny, you go see “The Front Runner.”We mentioned you had two movies out this year. The movie we just talked about stars Hugh Jackman. “Tully,” which came out earlier this year, stars Charlize Theron. How do you get Charlize Theron and/or Hugh Jackman to star in your movie in 2018, 2017, 2016?God only knows! I’m a very, very fortunate director, and I’ve been lucky since day one. I was ... My advice to young filmmakers is always “First, be born the son of a famous director.”Let’s spell that out. It’s Ivan Reitman.Yeah.Made some of the great, great formative movies for me in the 70s and 80s.I love it. This is literally, by the way, I wish you could see this. This is the first time you are smiling in this conversation.Oh, really?Yeah. You started talking about my dad’s movies, and by the way, that is what is unique about my father is my father’s movies make people happier.Your movies make me happy too, but ...You admitted at the beginning of this conversation that my movies make you anxious.I also ... I enjoy anxiety.Well played.“Stripes,” “Animal House.”Yeah. I once spent a summer watching “Stripes” every single day.Oh my God. “Meatballs.”Yeah.Which really struck a chord with me.By the way, my father was a CI ... what is it?A CIT.CIT, yeah.Yeah, yeah.Yeah, he was ... You know there was always one guy at summer camp, the guy who always has a guitar? That was my dad.Pretty much my ... I didn’t go to summer camp, so my idea of summer camp is pretty much formed by “Meatballs.”Never?Yeah.Ever?Yeah, I went to like day camps. It’s not the same.Got it. Where’d you grow up?Suburban Minnesota.Huh. That’s like lakes and stuff.Yeah, yeah. That’s like a ...My parents weren’t into it. I went to the JCC Day Camp, like gaga. It’s not the same thing. I’ll get into my siblings later. And then “Ghostbusters.” Must I mention “Ghostbusters?”Yeah, of course. Basically, all the Bill Murray movies. So you grew up with a dad who did that.Yeah.And was your thought, “That’s what I’m going to do, too” or “I want no part of what my dad does”?No, my initial instinct was stay far away.Yeah.I mean, why enter this profession? If you’re the son of a famous director, clearly you’re an arrogant no-talent that has an alcohol or drug problem. Why go into a job where this was the presumption of me? And I at first went pre-med, thinking...So you were really thoughtful about it, like “I do not want to be ...”Oh yeah. I’m aware.”...a famous person’s son doing what he does.”I know how people treat those people. And I thought no one questions why you become a doctor. No one’s ever like, “Doctor? Really?”And my father visited me at school and said, “What are you doing?” And I told him, “I’m scared.” And he said, “Well, being scared really isn’t a reason to do anything.” And he pushed me to follow my heart and become a storyteller and in that moment became the first Jewish dad in history to say, “Don’t be a doctor. Become a filmmaker.”Good job, Ivan Reitman. So you got into movies that way, and I think you mentioned, he helped you produce some of the movies earlier on or some of the ...He produced “Up in the Air.” That was the only one.Oh, that was the only one?Obviously, I was very wary of my father being a producer on my work ‘cause I was already thoughtful enough about nepotism and being accused of it. So “Thank You for Smoking” was done ... “Thank You for Smoking” was actually financed by Elon Musk and Peter Thiel and David Sacks and these guys who had sold PayPal to eBay and found themselves billionaires and wanted to make movies.What was the production company then?It was called Room Nine Entertainment, which I guess was a college dorm room at Stanford?Okay.And they literally each cut a check for a million dollars, and that’s how we made the movie.Good job, Peter Thiel. That’s not something we often say on this podcast. But good for you.But in making movies today, ‘cause you make the kind of movies that don’t get made very much anymore. And if they do get made, they often are Amazon movies or Netflix movies. You put movies in theaters. We were talking about the Nicole Holofcener interview I did recently, and her movie is now a Netflix movie. She didn’t get to make it in a theater, but you have figured out still somehow, some way to get these things into theaters.Look, I’m really lucky. And it’s what you brought up initially. I get to work with movie stars like Hugh Jackman and Charlize Theron who are interested in making thoughtful, interesting films. And I was lucky that Bron, this Canadian company that makes movies, that’s making great movies, thought these two scripts were worthy enough to finance and produce.Have you thought about ... I’m sure you have. What is your thought about making a Netflix movie or an Amazon movie instead of doing this route?It’s an inevitable part of the journey now, right? And I’m sure if I was growing up right now, I wouldn’t think twice about it. I’d be like, “Yeah, I watch everything on Netflix. Why would I care?”I’m in love with the movie theater process of going to see movies, in the dark, with a group. A collective audience, I think that’s really important. Laughing with strangers, crying with strangers is really important. I’m really grateful for film festivals because of that, as the movie theater experience changes.But look, your business, my business. It’s all changing. Where we consume media has changed.So Nicole said her last movie was going to be a theatrically-released movie. It didn’t work, and then there was some issue with casting and she couldn’t get it financed with the cast she wanted. It eventually ends up at Netflix who says, “You want to make it with Ben Mendelsohn as the lead? Go for it.”Have you thought about sort of the upside there, weighing that, “If I do it for Netflix, at least right now, I can make whatever I want” versus “Yes, I want to have the communal experience of putting it in a theater and maybe that’s worth it.”I mean, here’s the funny thing, is ... I’ll tell you the week everyone sees my movies. I get emails always the same day, and it’s the day my movie goes onto airplanes. The week they’re on airplanes, suddenly I’m getting emails from everyone I know.“Heyyy!””Hey man, I love your film.”Yeah.”I was on a flight to Omaha and, man, your film. I don’t know why I didn’t see it in the theaters, but it was great on the plane.”And you take that as a compliment.Hey man, if they want to spend two hours watching your movie, you should take it as a compliment.Yeah.And look, life changes, the world changes. A hundred years ago, movies didn’t exist. So look, narrative changes, and we have to be flexible, to a certain extent. And the part of me that is in love with the movie theater experience, of course half of it is just a romantic clinging to childhood. And I love going to the movie theaters. Sometimes, I go and I buy a ticket and I buy popcorn ‘cause I just want to sit in a movie theater. I don’t even care what’s playing on the screen. I love it.It’s a nice feeling, especially in a good movie theater, too.Yeah. You know what? I like the crappy ones, too. And when I’m traveling... I’m a horrible traveling partner. I could be in Rome. I’ll be like, “We should go see a movie.” I love seeing how people watch movies around the world.Is it different?Oh yeah. I shot a commercial once in a tiny mining town in Mexico, and their movie theater was a small room with folding chairs and, do you remember those projection televisions? It was like a Mitsubishi with fake wood grain and the front would like hinge forward, and inside there was like a red, blue, and a green bulb...Yeah, yeah, yeah. You needed a lot of real estate for it.And they would project on the inner screen of the box?Yeah, you needed a big living room for it.Yeah. But that was the movie theater there. And the craziest movie was playing. You would never guess if I gave you a hundred guesses and put a million dollars on the line.We won’t sit through a hundred guesses. What was it?Muriel’s Wedding.Oh, yeah.Yeah. There was no way you were going to guess it.They just found a movie, and someone said, “We have this movie. We can play it.”Or they just have great taste. It was a great film.Excellent. So you think inevitably that one of your films is going to be on Netflix or on Amazon or on Apple, and it’s just going to happen. And you were going to just sort of suck it up?I mean, I have to imagine, that’s just how...Or you’ll hold out as long as you can?Look, you want people to see the movies. And look, I’ve had friends who’ve directed movies that go straight to Netflix and everyone sees them. If you’re up on the front screen on Netflix for a week, forget about it. That’s millions of people who are otherwise never going to see it.Let’s say you’re making ... you want to get into the movie business today and your dad is not Ivan Reitman. Just imagine.I can’t relate. I don’t know what you’re talking about.What are you doing? Are you making movies on your phone? Are you not making movies? Are you saying movies are an outdated form and we’re going to make TV?No, no, no. Definitely not an outdated form. I think, look, this is the exciting thing about right now. The democratization of filmmaking is happening. When I started, you needed to buy film, you needed to rent a film camera and get the insurance that went along with that, you need to process this film and get it somehow inside an Avid or, if you were older than me, cut negative.Now, look, Sean Baker made “Tangerine” on an iPhone. Sean Baker made one of the best films of the year that came out. And it was all on an iPhone. If you have a phone, which is most people ... I’m presuming that you can get a phone.Yep.All right? Let’s start with that barrier to entry. It’s got to have a good enough camera to shoot something. You can download all kinds of software to edit, most of it free. And you can distribute through YouTube or whatever you like. And you can reach millions of people. You have a kind of a group of filmmakers who are learning to edit.You look at the kind of hypercutting of young editors on YouTube, and it kind of blows you away.And you think that’s directly the result of technology. That’s not having the ability to get the stuff. It’s the ability to experiment.Oh, sure. Think about it. The old way was, you play a concert the day you learn guitar, right? And your first time you ever play out, of course you don’t know how to play guitar. You literally just picked up the instrument.Yeah.Now, you have ... Think about how young people know their angles and the use of light, and the use of lens. You see people take selfies, and they’re raising the camera, because they understand what it does to their face. All these ideas of lensing and camera work are things that are just inherent to a generation. And you would pick up your phone, and you still think you’re making a 90-minute movie, because that’s the form you like, and that makes sense to you?Duration is obviously a really interesting question. Our attention span is shrinking, and yet we are in love with these kind of eight-hour pieces, these, what used to be called miniseries, but I don’t even know what the modern name is for it. That’s only interesting. That’s what compels me. Narrative is flexible, and that we’re ready to consume all kinds of stuff. So you’re not fixated on, “No, it should be a two-hour thing, because that’s the best form for this,” as opposed to, I don’t know, I had Steven Soderbergh on, and we talked about “Godless,” and that’s 10 hours. There’s something about the duration that seems to work. You have plays going back historically, which are around that duration. You know that thing where whatever that 90 beats per minute, or 100 beats per minute, is the beats per minute that we’re naturally drawn to? If you clap your hands three times and you do it too slow, they’ll speed it up, the fourth clap. If you clap it too fast, they’ll try to slow it down. Somehow, we have a biorhythm that takes us to a duration, and for whatever reason, plays, movies, we want to watch movies around that length. You think that’s the natural state. And I mentioned the release date for “The Front Runner,” do you spend time getting involved in marketing/promotion, and thinking about how these things are going to play out and participating in that strategy, or are you happy to hand that off to a studio that can do it?No, you gotta be involved, because you don’t want people to lie. I want people to understand why we made this movie. And look, you look at the Gary Hart story, there’s 10 different ways to spin it. There’s one way to spin it as being pro-Hart, and another as being pro-journalist, and it involves so much plot, you have to get involved and go, “Hey, this is a movie that takes all sides. This is a movie that leaves it for the audience. You’re gonna see it with somebody, and the two people in the audience are gonna see different movies, and you’re gonna argue about it after.”And I’m not sure if all those ideas get out if I just go, “Hey, thanks,” and walk away. We were earlier talking about a bunch of things, you mentioned your enmity for Facebook, which is now a more popular idea, to be anti-Facebook.I was early on that. Are you thinking we should be promoting this on social media? We shouldn’t? Or we should push it out this way on social and this way on TV? Or that, you’re happy to hand over?You have to, but I don’t pretend to be an expert in that. And the studios are now very sophisticated with the people they have and the departments they have that are looking at the analytics and are figuring out ways to reach people. I gotta say, “Tully,” which I just saw in preparation for this interview-How was the flight that you watched it on?I watched it on my Roku TV in my basement, and I took one break, which is, for me, that’s the big reason to go see it in theaters, watch the whole movie, you don’t get up and go talk to someone in your family. But it played great. But the only reason I knew about that movie, and it’s kinda targeted right for me, was I heard you on Shawn Fennessey’s podcast last spring. It seems like that’s a movie that got drowned out, for whatever reason. There’s a lot of noise out there, and it’s hard to cut through, and I’m not within the Marvel Universe. So these movies succeed because people talk to each other about them. That is the exciting thing about social media, it’s an environment where people go, “Hey, I like this. Hey, I don’t like this.”Do you ever think, “Maybe I should be in the Marvel Universe, maybe I could do a really interesting X-Men”?I don’t know. What Marvel movie do you want to see me make?I don’t know that I do. But there is that idea, that you could do-No, “Ragnarok” was amazing, the Taika Waititi film. And the Wolverine one. “Logan?”Yeah. Well, that was brilliant. I don’t think of that as part of the Marvel Universe, only because it was made over at Fox, who made it independently, it was really done as a director-centered film. Most of the Marvel movies are not director-centric. I don’t think that’s a insult, I think that’s just a reality. It’s just, blow it out bigger. Are you interested in doing a really big budget thing with monsters and maybe it’s related to some existing idea?If it had a core theme that I was into... OK, one day my father calls me and he says, “You gotta come over to the house and watch ‘24.’”And I’m like, the Kiefer Sutherland show? And he’s like, “Yeah, you gotta come over.”Like, alright. So I go to my dad’s house, he’s got a movie theater in his house, we sit down. We watch four episodes, four hours of 24. And it’s great, it’s phenomenal. That show was really good. I’d say to my dad, “There’s so many shows about terrorism, why is this show so good?”And he looked at me and said, “This isn’t a show about terrorism. Terrorism is a location. This is a show about a man trying to save his family.”And when I started to apply that to all filmmaking, this was one of the great filmmaking lessons I’d ever learn. Don’t confuse your location for your story. Juno is not a movie about teenage pregnancy. Teenage pregnancy is a location, a location to talk about innocence and the moment we decide to grow up. So when you talk about the science of a film, or aliens, or sci-if, all of that is location to me. If I got to tell a personal story as personal as all these other films are to me, as “Tully” is to me, as “The Front Runner” is to me, within a larger movie, hell yeah, I would do that movie. Look at “The Fugitive.” The Fugitive is a personal story. Even “Die Hard,” frankly, is a personal story. Yeah!“Die Hard” is a marriage clinging on for dear life, and there just happens to be these eastern European terrorists in Nakatomi Plaza. Sorry, I just went on a “Die Hard” reverie. Yeah, but think about how that movie ends. That movie ends with pulling the wristwatch off. Yep. Shoes off because he’s anxious about...“Shoot the glass.”Yep. So great. Every day, we say “shoot the glass,” on set, because we’re constantly using filters, things like that. And my DP Eric and I, who met each other when we were like 15 years old and can’t believe to this day we get to make movies together, every day on set at one point it’s like, “Eric, shoot the glass.”I wanted to end with a big, thematic question but here’s just the thing that’s in my head. What, you don’t want to end on “Die Hard?”No, no. I love “Die Hard.” We could just do an entire “Die Hard” podcast. I don’t know if anyone would listen, but I would listen. 1987, you make a period piece [set] in ‘87, what was the most surprising thing when you went back and researched what was happening in 1987 that you had to emulate or replicate?So much. Here’s the thing with a film like this-Pre-internet. Which is the thing that always blows my mind. Yeah. So ‘87, you have the birth of satellite truck, which is creating the 24-hour news cycle. You have CNN giving satellite phones to their journalists to report for the first time. A current affair goes on television, it’s the same moment as Tammy Faye Baker and … not Oliver Stone. Oliver North. And Oliver Stone, but yeah. A lot of things are happening at once, so the question as a director is, how do I get this information on screen without making the audience feel like “Hey, look at this. Look at that. I’m spoon-feeding you.”Just, where’s the beef? How do you get that moment into the movie without spoon-feeding it to the audience?So the real task, and it was fun to do, was to find a way to just populate the screen with all this information that made it feel as though you’d just happened upon something, you’d accidentally saw that detail. Creating an environment rich with information that never was telling the audience “This is the point of the movie.” Having three conversations going at once, where you have to make a decision that is similar to the philosophy of the film: What is important versus what is entertaining?And are you spending time going, “Let’s bring in that Spuds McKenzie ad” and someone goes, “No, it’s actually 1991, it’s not period, you can’t have it.”By the way, absolutely. We’re thinking about, what were the popular movies, what were the popular songs, what clothes, what hair?And the 80s are tough, because the 80s are big hair and neon colors. It’s that “Wedding Singer” version of the 80s. So it’s very easy to lean into this shocking pink version of the 80s that is fun but a little less real and not as nuanced as the film we’re trying to make. So how do you capture this era with all its detail and texture, that is still true to a political campaign?Did you get feedback from authentic political journalists, who were around at the time?Yeah. Every campaign person, we would send this questionnaire, and the questioner would ask, “What did you drink at the time? What did you eat at the time? Who was your favorite sports team? What was your favorite song? What did you always have in your pocket?” All kinds of little questions. What was the most surprising answer in that questionnaire?The most surprising? I actually don’t know if anything was that shocking, it was just a great level of detail. What does Gary Hart like to drink? If it was a bad day, a vodka, if it was a good day, a chocolate milkshake. That’s a good way to end, right? Let’s make it a chocolate milkshake day. Thank you Jason Reitman, you’re great. We appreciate it. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}