{"id": "Recode Daily: Google and Amazon respond to their employees’ concerns", "paragraph": "Last week, 20,000 Google employees around the world walked out of work to protest the company’s handling of sexual misconduct claims. Yesterday, Google CEO Sundar Pichai formally responded to employees’ concerns with a memo detailing changes to the company’s sexual harassment and misconduct policies, including making arbitration optional for claims, updating sexual harassment training and revamping its reporting system. Here’s a well-timed Q&A with Pichai, in which he talks about the walkout, company culture and steering Google through the most turbulent period in its history; Kara Swisher has some pointed thoughts about the issue in her New York Times op-ed. [Shirin Ghaffary / Recode][Want to get the Recode Daily in your inbox? Subscribe here.]  At an all-hands staff meeting, Amazon executives defended the company’s controversial facial recognition technology, after employees raised civil rights concerns about the potential misuse of Rekognition. Since news emerged that Amazon has been marketing its tech to ICE and other law enforcement agencies, the company has faced extensive criticism from civil rights groups and Amazon shareholders, along with the internal dissent. Here’s a transcript and analysis of the meeting. [Davey Alba / BuzzFeed News]Tesla board member Robyn Denholm will replace Elon Musk as the company’s new chairman immediately, a move that comes more than a month after CEO Musk was forced to step down as the company’s chairman as part of a settlement with the U.S. Securities and Exchange Commission over allegations that he violated securities laws. Denholm, the CFO of Australian telecommunications company Telstra, has served on Tesla’s board since 2014 but has fewer ties to Musk than most of the company’s directors. She will leave Telstra to work full-time as head of the board; her task will be overseeing a maverick billionaire who has run Tesla almost as an extension of himself. [Tim Higgins and Robb M. Stewart / The Wall Street Journal]Disney’s new streaming service, which will launch in late 2019, will be called Disney+. And, as announced last August, Disney will pull all its programming from Netflix next year. CEO Bob Iger made the announcement during the company’s earnings call. Disney’s Q4 results delivered record profit and revenue; Iger said the growth was driven by “exceptional performance” of “Black Panther,” “Star Wars: The Last Jedi,” “Avengers: Infinity War” and “Incredibles 2.” [Michelle Castillo / CNBC]Vice Media plans to reduce its workforce by as much as 15 percent through attrition and cut its selection of digital sites by at least half. Revenue at the Brooklyn-based company is expected to be roughly flat this year, coming in between $600 million and $650 million, on par with 2017. That number is more than $100 million below the projection Vice offered private-equity firm TPG in the summer of 2017, when the investor gave Vice a $5.7 billion valuation, the highest of any new-media company. But Vice lost more than $100 million in 2017 and is on track to lose more than $50 million this year. [Keach Hagey, Benjamin Mullin and Alexandra Bruell / The Wall Street Journal]U.S. chipmaker Qualcomm posted a loss of $493 million in net income during its most recent quarter, compared with a profit of $168 million during the same period in 2017, as the company’s mobile-modem unit recorded flat sales and its licensing business continued to be impacted by its dispute with Apple. Qualcomm, which saw sales in its licensing segment fall approximately 6 percent year over year to $1.14 billion, did not record any licensing revenue during the latest quarter from Apple, which is continuing to withhold royalty payments from the chipmaker over an ongoing legal fight involving Qualcomm’s licensing practices. [Micah Mainderberg / The Wall Street Journal]San Francisco’s Prop C homelessness tax was a big win for Marc Benioff, but legal challenges may be coming. Opponents say the city “won’t see a penny” of the funds earmarked for the homeless. [Shirin Ghaffary]What happens to free speech when we all live in a virtual world? When Oculus founder Palmer Luckey worries about anything, that’s where his mind goes. [Kurt Wagner]Twitter co-founder Ev Williams says in retrospect that showing how many followers you have wasn’t “healthy.” “It really put in your face that the game was popularity,” he said at the Web Summit in Portugal. [Theodore Schleifer]Amazon’s HQ2 was a con, not a contest. On the latest episode of Pivot, Kara Swisher and Scott Galloway talk about Amazon’s two new “headquarters,” the toxic waste of social media and the mixed bag of the 2018 midterms. [Kara Swisher]How to make your dog Instagram-famous.This headline. And this one.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}