{"id": "Google has responded to its employees’ demands about sexual misconduct. Here are the changes it will and won’t make.", "paragraph": "Last week, 20,000 Google employees around the world walked out of work to protest the company’s handling of sexual misconduct claims, in one of the largest instances of tech worker collective action in history. Today, Google CEO Sundar Pichai formally responded to employees’ concerns.Overall, organizers gained some wins in their demands. Helping to put an end to forced arbitration in sexual misconduct cases is a major change that could have a ripple effect across other large companies.But some of the workers’ demands were unmet or only partially addressed. “We commend this progress, and the rapid action which brought it about,” wrote the Google walkout organizers in a statement this afternoon. But they said the company must also address “issues of systemic racism and discrimination, including pay equity and rates of promotion, and not just sexual harassment alone.”There are also still some unanswered questions about the specifics of management’s proposed changes, especially whether they apply in full to the temporary, vendor and contract workers who make up a significant chunk of Google’s workforce. Those workers didn’t receive the email this morning about the policies and were not invited to the town hall meeting to discuss them, according to a statement from the advocacy group Tech Workers Coalition, which includes employees at Google. Temporary, vendor and contract workers are not normally invited to Google company meetings like TGIFs and All Hands, according to a spokesperson from the company.Below is a summarized list of the organizers’ demands (which you can find in more detail here) and how they are — or are not — being met, based on the company’s response in an action plan document it released this morning.Google did not address the demand to share compensation data with employees. It did make some commitments to changing its hiring practices at the director level and above to increase diversity.The company said it will commit to having a ”diverse slate of candidates on the interview short list” for new or vacated positions. Still, the company said there will be some “limited exceptions” for highly specialized roles that require unique skills. Those exceptions need to be approved by both the VP-level hiring manager and VP of staffing and operations.3. A publicly disclosed sexual harassment transparency report. Google didn’t concede to a public sexual harassment report but did make commitments to provide some details about sexual harassment incidents to employees.In their demands, employees asked the company for the number of harassment claims at Google over time. Management agreed to this, but only for “substantiated or partially substantiated claims.” A substantiated claim is what the investigation team is able to prove through evidence, according to a Google spokesperson. The company also didn’t specify if it would include other information requested, such as types of claims submitted, how many victims and accused have left Google, and if the accused received exit packages.4. A clear, uniform, globally inclusive process for reporting sexual misconduct. Google will create a new Internal Investigations Practice Guide that explains how sexual misconduct concerns are handled at the company, with input from employees who have made complaints previously.One key ask from the walkout organizers was for management to allow employees to be accompanied by a companion in meetings related to HR investigations involving harassment or discrimination. Google did promise to establish a process to allow that. The company will also offer new support services for employees who make sexual harassment claims, including providing them with counseling.Google also said it will create a specialty team of advisers on the Employee Relations team — which is part of HR — to look into all sexual harassment and discrimination concerns. 5. Promote the chief diversity officer to answer directly to the CEO. In addition, appoint an employee representative to the board. Google is not meeting either of those demands. The company’s chief diversity officer, Danielle Brown, will not report to Sundar Pichai as requested by organizers’, according to the Los Angeles Times. There was also no mention of adding an employee representative to the board of Google’s parent company, Alphabet. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}