{"id": "We have to rewrite antitrust law to deal with tech monopolies, says ‘Positive Populism’ author Steve Hilton", "paragraph": "To effectively regulate the tech sector, we first have to unlearn a lot of things we take for granted, says “Positive Populism” author Steve Hilton.“[There’s a] story we used to tell, a true story, about whether Facebook knocked out Myspace and Google knocked out Microsoft, and these tech companies don’t stay powerful for too long,” Hilton said on the latest episode of Recode Decode. “It feels like that’s not really true anymore.”On top of that, he told Recode’s Kara Swisher, not-very-old axioms about corporate regulation no longer apply. He cited the example of onetime Supreme Court nominee Robert Bork, who argued that “the size of a company is only a problem” if it prevents customers from getting “decent-quality products and services at a reasonable price.”Today, multiple tech giants operate in parallel to one another, giving away high-quality products for nothing, which prevents most competitors from challenging their dominance.“When I was learning economics at university, we had this notion of predatory pricing, which is when you price your product below marginal cost in order to shut out the competition, and that was seen as a problem,” Hilton said. “Well, now, predatory pricing is the business model, which is we give it away free.”He proposed a “sacrificial” idea — meaning a theoretical change that probably wouldn’t work, but points in the right direction — for reining these tech monopolies: Stop leaving antitrust rulings up to “the whim of an individual regulator or a judge.”“The framework that I propose [in the book] is based on market power, market concentration, which is over a certain proportion of a market, you’re deemed to be a monopoly and basically part of the public sector,” Hilton said. “You have maximum pay rates for a senior executive, minimum pay for workers, tight regulation on how you behave ... And let’s say you’re under 10 percent of the market, then you’re totally competitive, and maybe there’s an incentive to do that, where you have no regulation or whatever.”You can listen to Recode Decode wherever you get your podcasts, including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a lightly edited full transcript of Kara’s conversation with Steve.Kara Swisher: Today in the red chair is Steve Hilton, the co-founder and former CEO of Crowdpac. He’s been on the show before talking about that. But he’s also the host of a show on Fox News called “The Next Revolution” and the author of a new book. Steve, welcome to Recode Decode.Steve Hilton: Great to be back.I’m gonna let you say the title of this book because it makes me laugh.What’s wrong with it? Do you promise to burst out laughing like they did at the UN when President Trump ...Yes.Okay, perfect.That was the appropriate response.Okay. The new book is called “Positive Populism.” Yes, I know. That makes me laugh.“Revolutionary ideas to rebuild economic security, family and community in America.”“Positive Populism.” All right, before we get to it, let’s explain ... you’re a British political hack, essentially. Thank you very much.You worked for several different people and ...But you forgot to mention my restaurant that I started and ran, my corporate socialist responsibility consulting firm.I don’t care about that. We talked about that before. What I care about ... so anyway, so since we talked ...Also the Hungarian part. I always wanna get that in.Right, since we talked, you were running Crowdpac. Explain Crowdpac for the people.So Crowdpac is a crowdfunding site for politics. The idea behind it was to make it easier for candidates — independent candidates and independent-minded candidates of all parties and none — to run for office without relying on the traditional big donors and the party machines, so that when they get elected, they wouldn’t be dependent on anyone other than their constituents. Like an Indiewire for ...Well, yeah, and just to sort of enable small donors. Small donors obviously haven’t had the greatest success. Obama had great success with small donors, Bernie Sanders, that’s great for those big presidential campaigns. The idea was to bring that energy and dynamism of the small donor movement to every race, not just federal but state and local as well. Andy Flora, he did that, Andrew Gilham did that. A lot of people. Different candidates have different success with that. Exactly. So we were a platform to enable that. We started out very strongly of the view that we ought to be a nonpartisan platform. That was our position, and when we last spoke, that’s what Crowdpac was. Right at the beginning, actually, everyone said to me, “That’s crazy. That’s not how politics works in America. You’re gonna have to pick a side. You won’t be able to make the nonpartisan thing work because there’ll be suspicion of you on both sides.” And that basically turned out to be true. So I’m pleased to say that Crowdpac has done really well in this cycle, particularly. But as you could predict, the energy, in terms of small donors and people running for office and the kind of independent-minded person running for office — the person who’s not a political hack, who hasn’t done it before — that’s basically all been on the left.And so we looked at the data and basically followed the user and it turned out that, I think the last time I saw the numbers, when I basically stepped down as CEO earlier in the year, I think it was 87 percent of the candidates on Crowdpac were Democrats. So you were running a Democratic organization.Right, and like 94 percent of the dollars raised were on the left. And so it was just increasingly untenable for me to be heading up that organization.Right, because you’re not increasingly on the left.Exactly. And so we made a strategic decision ...Untenable? Did they just say, get this ...No, actually, I initiated the process because it was clear that actually the Crowdpac’s success was being held back by the fact that the CEO, me, was identified as being on the right. And I think that the ... so I initiated a process, we talked to senior management and the board and said, “I think it makes sense for us to ...”Where does something like that go? Just create partisan fundraising organization? What happens?Well that’s what Crowdpac now is. So we took a strategic decision to officially become a progressive, left-leaning organization and actually removed the small number of Republican candidates from the platform.How many were there? Like two?I don’t know, a handful.Were they sort of lefty Republicans?No, I would say they were slightly more of the sort of crazy side of Republicans, those ... I know you might challenge that term as applying only to a small group.No, I do challenge that, right, these days. Everyone has a chance to go crazy for a while. So you left that, how do you look at it as a success? Because you also wanted to be an information vehicle ...Yeah that was an initial ... I think we ... typical tech mistake, frankly, looking back on it. But you learn from them. I think we wanted to do too many things, we didn’t have sufficient focus. So originally, the initial idea, the very first idea that I pitched to investors when I was doing the rounds was this very focused crowdfunding platform. I literally, my stupid elevator pitch line was, “Kickstarter for politics.” That was the phrase that I used. Very much focused on the crowdfunding. And then as time went on and I met my co-founder, Adam Bonica, who’s very impressive, professor at Stanford of political science who’s really done a lot of brilliant work on data and analyzing campaign finance data and what that can tell you about candidates. And so we built out this whole data model and we thought, well that’s really great, because we won’t just enable people to give money and candidates to raise money, we can also provide objective information about elections. So we become a broader platform and this is what ... We used this phrase, “platform for political participation” — raising money, running for office and voting.And giving out information.And giving out information. So we spent a lot of time building out voter guides and profiles of candidates and races and so on. And in the end, A) that was a distraction, frankly, for our team from the core work that we initially, that was my initial plan, and in the end was the thing that really took off. And secondly, it was just from a business point of view not obvious how we would monetize that ...No, how would you? “Thanks a lot for the work you’re doing.”... in a way that wouldn’t compromise the integrity of the information and make people suspicious of it. And so in the end we decided to drop all of that and it was exactly when we made that focus that things really started to take off.And it’s still raising money.Yeah, absolutely.And who’s running it? Who’s the CEO?My co-founder Gisel Kordestani.Is running it. So what’s your affiliation with it now?Well I’m literally a ... I’m not on the board, I came off the board and I’m not in the management and I just don’t have any contact with them.Because then you went over to Fox and have this new show.Well, we did it in parallel. The show’s now about a year old.Right, exactly. But, what do you mean? I wanna get to your book in the next section, but the increasing politicization of things. Talk about that, because you’re leaving a job because of that. Did people complain?There was a bit of that. But it wasn’t just that. It was also things like ... actually, funny enough, even the designation “nonpartisan” was a barrier.It sounds so much better in British. Nonpartisan.Yeah, okay. Maybe that was the problem. Sounds like a cheese.Everyone should have said it with a British accent. We conducted our whole lives in a British accent.One of the things we were trying to do is to build partnerships with organizing groups, people who were helping candidates run for office and so on, and present our tools.And there’s lots of them.Exactly. And some of them, we established very good relationships within. A good example I think is Sister District, for example, working partnership even when I was there. But there are others who just said, “Look, I’m sorry, we just don’t wanna work with a nonpartisan platform. We are Democrats and we wanna work in an ecosystem that’s entirely Democrat.”Democrat.And so that was happening anyway. Because they wanna target those voters.And then my increasing prominence, I was on TV and whatever. And I’d always been openly a “conservative,” if you like, although actually I don’t really like that label either. So we’ll get to “Positive Populism” in minute. But it was never a secret.Just walk around like a conservative.That’s right.I’ve heard you can’t do that in Silicon Valley.It’s very dangerous.No, it’s not.I’m joking.Good God.I’m joking.I know.And the thing is, it wasn’t as if Crowdpac was getting a compensating increase in traction amongst Republicans because I was increasingly well-known. That wasn’t happening either. So we weren’t getting any benefit. From your being ...From me being on TV, as it were, and identified on the Republican side. But it was holding us back. So what is the point of this? It makes more sense to just ...Be more progressive.And also just to ...Go where your customers are.Exactly right. To catch up with the reality. And then once you make that decision — that we’re officially a left-leaning platform — it just makes no sense for me to be running that. Right. And so you leave and you started this show on Fox News called “The Next Revolution.” Explain that also for people, because I want them to get a context.So Sunday nights at 9 Eastern we do it live. We do it live! As someone once said.I’ve been there. I’ve been on your show. Usually from LA, although once a month from New York or D.C. And it’s an opinion show. It does have a theme which comes really from my prejudices, I guess, which is ... I say every week, “This is the home of Positive Populism.” The book title came from what I say every Sunday. And so what I’m trying to do on the show is make an argument for exactly that. For a populist policy agenda that isn’t all about being angry and yelling and screaming and complaining about things. Rather it’s about saying, “Okay, how do we solve the problems that have given rise to populist phenomena like Donald Trump or Bernie Sanders or Brexit or whatever?”So that’s the idea, and we do it every Sunday. And one of the things that’s really distinctive about it that we did on the very first show and has really taken off is this segment we do every week called Swamp Watch, which I love, and it has had a great response, where we actually dive into the anatomy of this phrase everyone now uses, “the swamp”, we’re sitting in it now in D.C. as we’re talking. And the connections between big money and the corporate interests and the donations and the lobbying and the revolving door between Congress and the private sector and the way that all ends up influencing policy. And we do a lot of good work, I think, exposing that. And, by the way, we do it in a very independent-minded way. So I’ve gone after Wilbur Ross and Scott Pruitt and Steve Mnuchin and Ted Cruz, most recently.Oh, that’s easy. That’s low-hanging fruit.Well, on the connections between, for example ...Pruitt’s real low-hanging fruit. But I agree with you, you’re right.The way you serve on a committee and you regulate, I don’t know, the transportation industry, and then you get a ton of money from transportation interest.So you take those on. You’ve taken on a lot of issues. You went after a whole bunch of things that I was surprised at. So being ...I don’t wanna give the wrong impression, however, that’s just to make sure our listeners understand that I do try to be independent. But on the other hand, it’s not like I’m sort of importing a bit of MSNBC into Fox, I don’t wanna give people that impression.So you’re not Rachel Maddow of Fox News. Well, a little bit.Well, I like to think that we go deeper into the kind of ... because my background is in policy and government. I like to think that we go a bit deeper into some of the issues and explain why this is happening.Instead of a screamfest, the regular screamfest on both — or bag of rage which is what I call Sean Hannity, but you don’t have to call him that. I certainly wouldn’t. My dear colleague and friend.In any case. But that’s the show, that’s the show, he’s mad. And yours is more like, let’s look at each of these policies. You have a little mad on the show. All of them have to.Exactly, I don’t want to pretend it’s something it’s not, but I also would like ... I think one other dimension to it ...You have a much smarter show. It’s the only reason I agreed to go on it.Thank you. I think that the other thing I would say is, there’s something about your tone, one’s tone. I try and do it at least with a smile on my face, literally but also figuratively in the sense of trying to be positive about all this craziness that’s going on and trying to direct it towards solutions.But it’s to generate ... I mean, the way it’s … one, it’s partially entertainment to do this, to create those panels of people screaming at each other. And it’s cheap, by the way. It’s a really inexpensive way to do it. And it’s not smart or substantive or solution-based. They’re all the same in that way because they’re not trying to look for solutions, they’re trying to ... “Are we not entertained?” It’s like “The Gladiator.”And I think taking on big topics, that used to be ... you would be more in the William Safire school, considered conservative opinions that are then expressed in an intelligent way.Yeah, and also the other thing I like doing is having people on who’ve written interesting books, whether they’re from the right or left or no particular political place, just looking at an issue. And occasionally topics that I feel strongly about that you just wouldn’t expect to see on cable. An example was — it was actually my wife who first pointed it out to me but we were both really horrified — it was an amazing story by a New York Times reporter a couple of months ago on the trade in apes. And it was one of those brilliant pieces of reporting, put it on the front page and just lengthy reporting, and you just read every word. I read every word of it and thought, “This is so good and awful. But such a good report. Let’s have him on to talk about it.” It was interesting because, actually, the audience responded really well to that and you might have thought, well, that’s not the sort of thing, and it’s animal welfare and who cares about that? Turns out, a lot of people do.Of course. But they get a steady diet of anger. Again, on both sides it’s a steady of ... exactly. Literally the other night my mom said something and I went and looked on Fox News and that’s just what they had said and I was like, “Oh my God, she’s been near the television.” It was really interesting. She does that all the time. It’s the ability to think on your own about issues is getting harder. So your show is much like that. So you do this weekly and then from this, was the idea of “Positive Populism.” So why don’t you start going into that and we’ll talk more about it in the next segment. How do you describe that? Give me a quick definition and we’ll get to it. I think the reality is that that word, populism, I know it’s been around for a long time but it’s been kind of revived in the last few years and applied to these various political phenomenons.On many sides.Brexit, Trump, Bernie Sanders on the left as well, not just exclusively on the right. But I think if you ask people, “Well, what is populism?” I think to the extent that anyone has anything to say about it, they would say, well, it’s against things, it’s against the elites, it’s against controlled immigration, it’s against big business or trade deals or whatever. It’s always what it’s against.I think, as I argue in the book, there’s a lot of good reasons for people to be angry with some of that. But what I wanted to do was say, “Okay, fine, you’re angry, but how are we gonna solve that?” And there’s a line I use that’s a bit pat but I say, “Anger without an agenda just leads to further rage and frustration and actually self pity.”And so you’ve gotta turn that anger into something constructive and that’s really the point of “Positive Populism” is that, okay, what are we for? Not just what are we against. What is populism for? What’s it in favor of? What’s it arguing for?So how would you define populism? When we get back in the next section I want you to talk about more specifics of what you think.I would say there’s four things. And I’m gonna say them and you’re gonna say, “Well that’s a platitude.” And I’m gonna explain why it’s not. So the first thing is that I think it’s not particularity ideological, that’s why I’m now uncomfortable with labels like “conservative” or “right” or ... it just doesn’t feel right to me. It’s not ideological, it’s very practical and pragmatic and it’s defined, in my view, not by ideology but by interests. What are the interests it’s trying to advance? And to me there are three in particular. It’s pro-worker, pro-family and pro-community. And you said, “Well, who’s against that?” Well, if you look at the way policy’s been constructed and implemented over the last few decades, not just the last ... it’s not a partisan thing against Obama or whatever. Under Obama, Bush, all of them, policy has not been pro-worker, it’s actually been in favor of the owners of capital and so on. It hasn’t been pro-family. By the way, when I say pro-family I don’t want people to hear that as some kind of ...Straight people. Straight, white people having children.No, I say very clearly in the sections on family, I totally ... and when I worked in the British government, we introduced marriage equality and I’ve always been for it and there’s an interesting argument about the way, at the same time, I’m digressing now but at the same time as marriage equality has advanced, and that’s a great thing, marriage has retreated in the straight world. And that’s kind of an interesting thing.Only gay people wanna get married and go into the military. But go ahead.But actually there’s an interesting twist to that which is also, marriage has become a class thing. So the way I put it in the book is, now marriage is for gay people and rich people. Yeah, there was just an interesting article in the Times about this. So I think that various things, not just policy, have actually helped undermine families of all kinds. And when I say pro-community, what that really means is trying to restore a sense of ... I think everything’s become too centralized. Power’s become too concentrated, both in the economy and in government, and so dispersing power ...Back to the locals.Exactly, is a really big theme of this. And I think that would give more people a sense of control over what goes on around them and that would make them less angry.Right, and more sense of belonging. All right, we’re here talking to Steve Hilton. He’s the host of “Next Revolution” on Fox News. He’s also the author of a new book called “Popular Populism.” He’s explaining that. When we get back we’re gonna talk about what that means in practice because something’s gotta give here in this country and across the world.We’re here with Steve Hilton, he’s the host of “The Next Revolution” on Fox News but he’s also the author of a book called “Popular Populism.” He used to run a company in Silicon Valley called Crowdpac which is trying to do, especially, Kickstarter for funding of elections and information. He left that and now he’s focused on his show and also on this book. So let’s talk more about “Popular Populism.” Positive.Positive, sorry, not Popular. Popular populism, that’s funny. “Positive Populism,” they’re never paired together. So why is that? Let’s talk about what’s happened. Because I think Donald Trump has ridden the wave of angry populism. You aren’t getting enough, you got screwed, the elite’s got you, the whole, you know ...And not just him, let’s be fair, Bernie as well. Yes, the same thing. Yeah.And actually, the language was very similar. That was one of the interesting things, I think, during the 2016 campaign, 2015/2016, those two years where they were making their arguments, is there’s such huge overlap between the things that they said, Bernie and Trump. I remember Trump talked constantly about the other candidates, Bush and so on, as well as Hillary, the phrase used there, “the puppets of their donors.” He talked a lot, actually. Okay, you can say he hasn’t done anything about it subsequently, but in the campaign he talked a lot about the way that big money was controlling politics, exactly like Bernie did. There was a real alignment with them around trade and the way they talked about that. Even immigration. Bernie had to sort of close that down to get anywhere, but there’s quite an amazing interview in 2015 Bernie gave where he said, “Open borders, that’s a Koch brothers’ proposal. What are we going to do? Bring in all these low-wage workers? That’s going to hurt African-American kids,” and whatever. Very similar arguments. I think that that is exactly ... you’re right, that it was always what we’re against, and I think that that’s the problem. It’s like, well, what are we going to do about it?What else? List the other things they’re against, they’re against ... it’s fear, it’s based in fear, it’s based in you’re losing out, it’s based in you’re getting less.You’re getting screwed by the ...You’re getting screwed, and the other guy’s doing it.Yes, that’s right. And that’s historical. Well, maybe not, because I’m listening to the Andrew Jackson book, which is very complex, actually. Much more so than has been written about. He’s not Trump at all, he has some terrible things he did and also a really interesting politician. But it’s throughout U.S. history and throughout history in general, you could say the French Revolution is populism. How do you look at it over time?Yeah, and the American [Revolution], actually. I think that’s right. Especially its focus on, again, it sounds a bit of a cliché, but that theme of people power, putting power in the hands of people, is a ...Which is also called mob rule, too. I mean, that’s what it’s been called sometimes. Well, as long as it’s been dispersed, we can get into that. But I wanted to mention the historical underpinnings at least. Funnily enough, I’m not a historian, I remember when this word came up in the last couple of years, I embraced it. If we get to go back, I worked as you mentioned earlier, in politics in the U.K., my first job out of college was working at the Conservative Party headquarters in the U.K., where Margaret Thatcher was prime minister. So for various reasons, my parents are Hungarian and I know that there’s no connection directly between communism and Hungary and the Labor Party in the U.K., but I found myself on the right in identifying with Thatcher. Partly because she had a story in the ’80s that she was for the workers. By the way, that was quite interesting, she sort of changed from that. So I’ve always been on that side of the political fence but increasingly felt that it didn’t really feel comfortable. For example, when I rose through the ranks and went and did other things, started businesses and came back, when my friend David Cameron went to become the leader and I worked with him on a policy agenda that a lot of people said, “That’s not conservative,” and we were accused of betraying the principles, all that stuff. And I felt “yeah, actually” — we didn’t say it, but I just felt this label doesn’t really, I think it’s too ideological, it doesn’t fit me. Right. So when the “populist” word started being bandied around, 2015, 2016, I thought, actually I like that. I didn’t really know anything about its historical precedent, so I’m not really best placed to comment on that. But I think from what I’ve read and seen and heard, that is right. It’s always been this resentment-driven ...Off with their heads. Yeah. This resentment-driven approach. Is that what it’s like in Trump populism now? Because that’s what ... It’s fear-based almost, it’s not positive. I think we’ve just got to move beyond that. Come on, Steve. Once you’re there, you’ve got to actually solve the problem. No. I think people can remain bomb throwers. When you’re campaigning, you know that you’re a campaigner, and then you have to govern. Yes. But people are very comfortable in campaign mode, especially this president, is very much happy to stay there. Yeah, but I’m not. I’m in the guess ...I’m saying, populism now is seen as Trump populism. At least in this country. And the same thing in other countries. Yeah. Okay. That’s really one of the reasons I wanted to write the book, because there’s very little... I mean, I don’t know whether you’ll necessarily be pleased to hear this or not, but there’s very little of Donald Trump anywhere in the book, because it’s not about that. My argument is, long after he’s gone, whether it’s another two years — or, to horrify you, another six years — long after he’s gone, we’re still going to have these problems, because they’re deep structural problems. All through the way we run the economy and society and services like education and training, the future, all the stuff we often talk about. Those are really deep, long-term problems and we’re gonna have to have some answers to them. Long after he’s gone, whoever comes next, Democrat, Republican, whatever. So what I really wanted to contribute to is the start of a conversation about an intellectually coherent set of ideas that would advance the interests of the people who have been left out. Is the word now — and words matter — is the word now sullied in that way, because that’s how people think of it?Oh, for sure. I would absolutely acknowledge that. I say that. Because it links with nationalism, it links with ...I would say you’re right, words matter. I would say, I think racism is one thing that’s obviously not okay and needs to be strongly condemned. Again, I’ve do that very clearly on the show, I’ve tried to distinguish between racism and xenophobia. But nationalism ...But I’m saying, how do you reclaim that word?Well, by this, by talking about it. But most importantly, I think, what I really care about is putting these ideas out there, regardless of whether, and these arguments out there, whether or not these exact ideas and policies get implemented is not the point, than to start a conversation, but really to build a movement of people, actually in all parties. I don’t think this needs to be a right or left thing who think about this and say, “Yeah, that’s right, I can advance the interest of workers in our policy conversations, and families, and believe in decentralizing power,” and that all adds up to a populist message and a populist approach, whether that’s through the Democrats or Republicans or Independents or whatever. It’s a long-term thing. All right. So let’s go through the ones you’re talking about. So what would be the policies to help workers?One of the most basic things you see is this incredible economic insecurity and anxiety that comes from not being able to live on what you earn and not having a reliable income. And there’s so many different measures you can look at that through. One that I think is particularly striking shows how long the problem’s been going on, if you look at the 80 percent or so of, I think the term is “nonmanagerial and nonsupervisory workers.” I think that 80/20 thing, I know it’s a bit of a cliché, but it works in this setting, where I talk about the elites and so on. And of course I’m one of them. Yes, you are. You’re more elite than I am. Do you know that?Of course. And I totally acknowledge that. There’s a difference between the elites and elitism, which is a set of policies that help the elite. Right. So you’re like a nice elite.I’m a traitor to my elite class because I’m trying to help the workers, I guess. Anyway, the thing is that I think it’s not the 1 percent, that’s the point I was going to make, that we always hear about. It’s more like the top 20 percent.There’s a brilliant, brilliant piece in the Atlantic, cover story a couple months ago, that the author talked about the 9.9 percent, not the 99, as being the real ... and this notion of the inherited meritocracy. People who’ve got there on their own merits and have risen through the ranks of education and hard work and now have captured those benefits, and people are left behind.So this data point I was going to give you, 80 percent or so are nonsupervisor, nonmanagerial workers. If you take inflation into account, their incomes have been flat since 1972. This is not just the last, the great recession. It’s amazing. There’s been this huge disconnect that used to be there between economic growth, productivity and the economy, and incomes, where they all went up together, roughly. And around the early ’70s, that relationship just broke. Right. And suddenly the workers’ pay was flat, but the economy still grew. Whatever. And there’s lots of other measures too, and they’re changing the labor market.So the policies for that one. Well, the No. 1 thing, I think, is to assert a principle, which is, if you work full-time, you should be able to live on what you earn. At the moment, there are tens of millions, probably more, I haven’t looked at the exact data, who do work full-time and can’t live on what they earn. Right. So earned income tax credit, they say. Because they get all these subsidies of various kinds from the government, tax credits and food stamps and so on. And of course those things are vital, because you couldn’t live without them. But my argument is, you should get that from your employer, not from the government or another source.Yeah, that’s a hard sell, Steve. Okay. So my idea in the book is what I call the business-friendly living wage. It’s really interesting, actually, it may highlight an area for compromise. Ro Khanna from Silicon Valley, where I’m based, and Bernie, just introduced a bill the other week I think it was called the Stop BEZOS Act, and the Bezos thing was some kind of acronym. And they made the point, which I 100 percent agree with, which is, this phenomenon is basically a subsidy to corporate America. So they pay their workers too little for them to live on, and the government tops off their pay. So they can get away with low wages. But at the same time, there’s another bit of the equation, which is the government takes money from the companies in the form of taxation, corporate taxes and payroll taxes.So my argument is, let’s raise the minimum wage to the level of the living wage, which varies from place to place depending on housing costs and transportation costs. But make sure that you can live on what you earn, you really can. Right?That’s going to be very high in some places, way higher than the minimum wage. But at the same time, let’s cut their corporate and payroll taxes, or both, or some combination, so that the net impact on the bottom line is neutral, so that what they don’t do, which is also counterproductive, is have to lay off workers because they’re more expensive, or replace them with automation. Right. Now, the Stop BEZOS Bill, the Bernie Sanders and Ro Khanna thing, addresses the exact same problem but through what I would say is a worse solution, which is to take the amount of the subsidy and tax them more, so that’s just increasing the tax, which I don’t think is a particularly helpful thing. Right. But it shows that there’s a lot of shared ground. But doing minimum wage is so controversial, it’s the same thing. They consider it taxing, that’s the same. Yeah, but someone’s got to pay. Of course, then there are other things, like why is housing so expensive in the first place? And there’s a lot of argument there. I was on Bill Maher last week and I made the point that zoning regulations are a huge factor in housing being so expensive, which is true, because there’s not enough being built. And one of the reasons there’s not enough being built is because zoning regulations favor the people who already have property rather than those [who need it], exactly. Look, there’s lots of things we can do also to reduce the cost of living as well, but I think there’s a basic dignity point, which is if you work full-time — and by the way, a lot more people still do. I know we all talk about the gig economy and so on, and there’s a lot we could do there to make that fairer ...Yes, of course. That’s something Gavin Newsom’s been pushing, the idea that we change the way economic incentives ...But still, most people do still work in full-time regular jobs, actually. It’s not just all disappeared in favor of ...But it’s obviously changing, though. Yeah. But not as rapid ... Anyway, look. There’s a basic dignity point and a moral point there. It creates broken societies when people feel on the edge. Exactly. And then there are other things that you could do. For example, again, this is not particularly new thinking, but perhaps new from someone on Fox News, is that there are multiple ways in which the owners of businesses treat workers unfairly.A great example is noncompetes, which are actually outlawed in California, generally, and one of the reasons I think you’ve got such a dynamic tech sector. You can just quickly go to a competitor and whatever. But I think it’s something like 18 percent of American workers are now covered by noncompete agreements, which is insane. These are supposed to be for genius scientists who’ve got incredible ... That being applied to people who work in fast-food restaurants to stop them getting a modest pay raise by leaving McDonalds and going to Burger King, it’s completely ridiculous. So there’s lots of smaller steps, as well, that you can take that add up to a pro-worker policy agenda. And I think everyone should be in favor of that. You sound a little communist-y, I like it. I like this. Oh my god. Now I’m really in trouble. We’re here with Steve Hilton. We’re talking about his new book, “Positive Populism.” Populism is now sort of a dirty word with a lot of people now, and it feels scary. Populism now feels awfully scary. Very mob rule, nationalistic, racist, all these things that are being linked with it, largely due to Donald Trump’s pushing it. In other parts of the world — we always forget other parts of the world — where it’s surging, it’s a lot to do around immigration and issues around that too. So you were just talking about how to help the worker. The second one is how to help the families. I think most people agree that this country is anti-friendly to families, actually. There’s no policies about maternity leave, except, say, in Silicon Valley, which has very strong ones, actually. Or California. Some people think those are onerous. What are their family policies? I would assume better maternity leave. Definitely, all of that. But I won’t focus on those, because you can basically assume I agree with all of those. Right. And introduced many of them as part of the British government where I worked, or they were already there in the U.K. I want to talk about some new things. One of the things, and just to take a step back from it, I think one of the problems in this area has been that the right, for years and years, has gone and on about family values, all the time. Yes. But first of all, that hasn’t extended to everyone, so it’s excluded “nontraditional” families, as it were.Yes. We noticed. So I’m against that. But the other practical thing is that they’ve not been prepared to accept or even look at any kind of active help for families. It’s all lectures and preaching about “families are good” and “we love families.” But when it comes to actually helping, “no, that’s nanny state, big government.” So that’s been a problem. But equally on the left, I think you’ve had a problem with a rhetoric about supporting working families with practical measures, that’s great. But also a reluctance to engage in some really pretty obvious science now about the importance of family stability and so on. And I think the answer to both is in the end not ideological, but practical. I’ll give you an example, which is if you look at the data on when families break up, whether they’re married or not, if you just look at the peak time period when typically a family that’s together, when one partner leaves, it’s not universal, but the peak time is within the first year of the first child being born. And it’s pretty obvious why that would be. Yeah, it’s a tough time. You know that. It’s incredibly tough, it’s stressful, you don’t get any sleep, you argue, etc. So there’s so much evidence now that practical help through that incredibly difficult period can help keep families together and kids growing up in a more stable home and on the right track. And there’s two things I point to that are practical examples. First of all, in the U.K. there’s a ... Well, I’ll just start with here, in Colorado. It started in Colorado in the ’70s, something called the nurse-family partnership, which is one of the best-evaluated social policy interventions in history, in the sense that the number of times it’s been evaluated and is shown to be successful. But it’s limited to at-risk populations. And the way it works is a trained nurse visits your home. They do ... In Louisiana, there’s a whole bunch of them. Right. And they just help with practical things, literally. Like getting ready for the birth and then after the birth, literally how do I get the baby to sleep? Or feeding. All these things, just all the basic questions that is assumed that people know the answers to, because there’s millions of books and videos and online things. But it’s not the same as someone who really knows what they’re doing that you trust, coming to your house. Positive government intervention. Right. And they, at the moment, that is very patchy and underfunded. So my proposal ...And it’s not available for everybody. No. And it’s explicitly designed right now as an intervention.Which makes sense, that’s the most ...Sure, but my proposal is, I call it universal home visiting. I think it should be available. You don’t want to force it on people if they really don’t want it. But I can’t imagine a family that wouldn’t benefit from that. The most literate and well-educated and well-informed family, they can’t do it either. And Kate Boo wrote an amazing piece, if you ever want to read it, about “swamp nurses,” it’s a program in Louisiana, it’s astonishing. It’s a sad story because it’s almost impossible to pull some of these people out of abject poverty and ignorance, the lack of education they’re in. And it’s wonderful. But you sat there and you were hoping so hard that it works, it made sense. It’s sensible. The other thing I’d say is that certainly — and I spent a lot of time on this in the U.K., there’s a program in the UK called health visitors, which started I think in the Victorian era. And I wanted to greatly expand. The thing that is interesting is, the immediate reason for doing it is help with a new baby. And mothers are desperate for help, so it’s a good moment to establish that trusting relationship with a professional. Yeah. So you feel like you’re getting a benefit. But actually, what really is great is, over time, the visits can get less frequent and so on, from every other day to once a week to once a month and so on. But actually, they become trusted to help with other things and these other social issues that are going on. Maybe your partner’s drinking too much, or there’s a drug addiction incipient problem, or the health isn’t that great in the family, or just mental illnesses. And what they can do is connect them to local resources that can help. And say, you know what? In a gentle way, not in a nanny way. Because they would know them. They know them. And of course part of the program would be training the visitors, as it were, in terms of what resources are available. There’s a whole community aspect to that. None of this has to be the government. It’ll need to be funded by the government throughout because otherwise it’s not going to happen. You’re not going to make this universal by relying on charity. And then the last one, community, and I want to sort of approach this in a way because most people feel that communities are breaking apart, local communities. Especially, oddly, Tom Friedman, this is a big thing of Tom Friedman’s in his last book.  The idea that we move things, we push things down to the communities. Which I think has been sort of mutated by ultra-conservatives about all states rights, which has been an issue in this country from the beginning of the ... from the very beginnings of time. When actually, local is a great idea, it’s just not... it’s done in a way where it feels ignorant or it feels not that the ...Local doesn’t mean state. I think that there’s a really ...No, smaller than that. I try and sort of take ... way smaller. And so I roam through the pathway of decentralization, as it were. Yes, it’s true that we should decentralize some things from the federal level to the state level, yes, but don’t stop there.Give me an example. Well, healthcare for example is a good example. But way further than that, from the state ... you’ve got California, fifth biggest economy in the world. If you’ve got all the power in Sacramento, that is hardly localization. So from the states to cities and counties ... but the area I’m really interested in and I think is probably the freshest area in the book, is the neighborhood. I think the neighbourhood is potentially an interesting area because you’ve got potential human connections because you can actually see and feel and meet ... feel, probably shouldn’t use that word ... You can meet people and you can look in their eyes.It’s a minefield out there now!I know, I know. But the thing is that that’s not going to happen just like that because you tell people, “Oh, you should get together and do things.” People are busy, you’ve got to give practical reasons for doing it, and a benefit. So one starting point is there’s a ... it’s a cliché now and there’s lots of ... it’s been written about a lot and replicated a lot, but years ago, one of my great friends from university, she moved here, Merida, with a guy from New York and they’d been living in Brooklyn for a long time and there’s a place called the Park Slope Food Co-op that they took me to, which is very well-known. And the lovely thing about it is that it’s a true cooperative in the sense that you can only shop there if you are a member and you have to work. Yeah, there’s one in San Francisco. And just two or three quarter-hours a week or whatever. And there’s a connection there. And what it really has made, that place is a community center because there’s a reason for going. Yes, you got to go do your work but you get benefits, low prices, whatever. So my question was, can we try and apply that thinking to other local services? There’s a concept called civic service, where let’s try and think of — and this is one idea — but let’s try and think of local services, it could be the local library or whatever, that could benefit from that kind of engagement. Where everybody’s part of it rather than being served. Exactly. Another one is this notion of, I call it compulsory community tendering, where you require ... this could be a more forceful way of doing it where you could require local government to take services that are operated in the local area either by some distant corporation or whatever, and say we have to give the local neighbourhood the chance to run this. Now they may not want to, but maybe they do. Such as a...?Well, I don’t know. Maybe it could be a health center or a clinic, I mean, I don’t know. There’s all sorts of options people will ... a playground, the park ...Well, you know, a ...You’ve got to give people reasons to get together locally and a benefit from doing it. Well, the breakdown of local communities, I think, is at the heart of so much of ...The other thing I would say about all of the ideas in the book, some of which ... I mean, I talked for a while at Stanford, and the most transformative part of that was teaching at the d.school, the design school, which is really about teaching the methodology of innovation that many of the technology firms follow, in terms of real focus on users and rapid prototyping and testing. And one of the concepts that we used at the d.school that I think is a great way of capturing the status, if you like, of some of the ideas of my book is we have this notion of a sacrificial prototype, which is, “I know this is a stupid idea, I know it doesn’t work, whatever, but I’m going to put it out there, just to get the conversation going.” It’s better than just talking about something conceptually. Let’s give a tangible prototype, at least an idea that is something defined and you can rip it apart and say, “Well, that doesn’t work, and that won’t work, but how about this?”And not all of the ideas in my book, but some of them are of that nature, where I’m really not ...Right, you’re just going to start the conversation. Exactly. I’m really not attached, or saying, “You have to implement this exactly as I’ve written it down.” They’re ideas, they’re not policies. They’re there to start a conversation. So one of the things that people have, and let’s talk a little bit about the tech industry, we only have a few more minutes, is this idea that tech and social media has brought down this concept where people are isolated, lonely, engaged in their phones. And it’s true. It is true. How, with the techlash, and perhaps — I’m going to preface it, your wife has worked for every tech company in America right now, Rachel Whetstone — but separate from that, how do you look at what’s happening with those, and where do you see ... is it part of the policy, to regulate some of this? Or do you ...Oh, yeah. But if it’s with another part of the argument on populism, which is the concentration of power in the economy and the way businesses have got too big, not just in tech but in every sector, and they’ve been allowed to swallow up competition and stop entrepreneurs, or make it much, much harder for entrepreneurs to challenge them and knock them off their perch. And that story we used to tell, a true story, about whether Facebook knocked out Myspace and Google knocked out Microsoft, and these tech companies don’t stay powerful for too long. It feels like that’s not really true anymore, that story. No, I think it’s a couple ... there used to be just one. I mean, was it IBM or was it AT&T or was it Microsoft, and now there’s four or three and they’re rolling down the highway like semi trucks. And nobody can get around them. And they’re not particularly monopolies, but they kind of are. Because they don’t really compete with each other, they’re not ... really I think they squelch innovation, as a group. I agree. I would say Facebook, Google and Amazon. And there’s an interesting ... Generally, my argument is we’ve got to really rethink our whole antitrust approach to be much more aggressive, where at the moment the whole approach is based on this notion that was really introduced by Robert Bork. I mean, he’s best known for the Supreme Court …“Being Borked.”… that whole thing, but actually probably his greatest policy contribution is this notion of consumer welfare — that’s the phrase — which is that concentration of economic power ... The size of a company is only a problem if it hurts consumer welfare. In other words, if they’re not getting decent-quality products and services at a reasonable price. The problem is they’re getting decent quality. Right! A great quality, and the services are amazing, and nevermind price, it’s free!Now, when I was learning economics at university, we had this notion of predatory pricing, which is when you price your product below marginal cost in order to shut out the competition, and that was seen as a problem. Well, now, predatory pricing is the business model, which is we give it away free. Right, and because they know the right prices to hit. I was literally at dinner with the head of Walmart the other day, and he’s like, “God, their pricing at Amazon is so hard to follow.” You know what I mean? They were the low-price leaders, and of course they have to chase it really fast. So I think that we’ve got to broaden the ...But you have a company like Amazon ... if you’re talking about communities where nobody shops anymore, or you have Facebook, nobody goes to church anymore. Google, you find things ... I mean, it’s all separate. Well, there’s two questions. There’s the ... well, the way that it’s all united is we’ve got to broaden it out. We’re not just consumers, we’re workers and we’re family members and we’re community members and we’re citizens who vote in elections. We’re not just consumers. So the idea that regulatory framework is just on, “Are you getting good stuff at cheap prices?” is so out of date. So what’s going to happen there? What do you see? Well, what I’m arguing for — and recently I had a constructive conversation with the former head of the FTC about it and I don’t think this is outlandish at all, this direction of travel — is to broaden that definition. So it’s not just ... and the specific proposal that I’ve got in the book — again, this probably really is one of the sacrificial prototypes — is we’ve got to move away from the regulation of antitrust on the basis of the whim of an individual regulator or a judge in a case and actually have some rules here. And the framework that I propose is based on market power, market concentration, which is over a certain proportion of a market, you’re deemed to be a monopoly and basically part of the public sector. So you can’t pay your ...You become a utility.Yes. And for example, you have maximum pay rates for a senior executive, minimum pay for workers. Tight regulation on how you behave. A little bit lower, between 10 and 40 percent or whatever. Yeah, that’s never passing. One second. You’re deemed to be dominant and you have slightly less regulation. And let’s say you’re under 10 percent of the market, then you’re totally competitive, and maybe there’s an incentive to do that, where you have no regulation or whatever. And of course, as I say, people will argue about what are the right levels and so on. And it sort of depends how you define it. If you define Amazon as a retailer, it’s quite a small percentage. Online retailer, very big. Book retailer, it becomes total monopoly basically. So those things will be argued about.It’s difficult. That’s the whole thing. You can’t pin anything on them as easily ...Yes, but I think let’s just start the conversation and try and get a bit more granular about it. I think there is an issue, the issue is about tech addiction, as it were. I think that is less amenable to this kind of concentration of power argument. Because I think even if you had a thousand Facebooks all with incredibly addictive technology, you’d still have that problem. So my solution to it is not to use a phone at all, and I’ve not had a phone for six years. That’s the extreme. But I think that the future, and you know this far better than I do, but as the devices are kind of disappearing and the tech is merging more into ... Your body.In a weird way that might make it better, I don’t know.Right. Except if it’s all pervasive.Yes, but it means you’re not literally looking at a screen. I don’t know. Also, I can’t tell how seriously they’re taking it, frankly. I think that ...Who, the tech companies or regulators? Well, the tech companies. I think it’s interesting that in the last year or so, Mark Zuckerberg has started to talk thoughtfully about using this phrase “time well spent,” which came from Tristan Harris, the design ethicist who is trying to help the companies do this better. That seems to me a serious engagement with the issue at least. They’re not just blowing it off. I guess. I think it’s bullshit. Okay, well, that’s your view. I know it’s bullshit. Well, I think that ... funnily enough, I did, in my past life, I ran this company Good Business in the U.K. And one of the ... we were a corporate responsibility consulting firm, we worked with big companies. And this issue came up a lot in other contexts, particularly utility. We had some utility companies who were being obliged by the government to promote energy efficiency.No, I think people are thinking ...So the question came up quite a lot. McDonald’s was one of our clients, and it was like, how do you make a virtue of trying to get your consumers to use your product less? How do you actually make that ...Well, look at Patagonia. There’s a bunch of companies. I would say that there are tech leaders ... I think Kevin Systrom is one of them. Very much so. We’ve talked about this stuff a lot, he’s the only one that ever would engage with me on these topics, years ago. Brian Chesky. There’s a couple ... I would say Marc Benioff often, when he’s not being Marc Benioff, is very much so. There’s a lot. It’s just a question of whether they see it as not just a duty, like take your medicine, and more as this is an ethos that is good for society.And also, what we tried to argue at Good Business, and I wrote a book called “Good Business: Your World Needs You,” is try and see your social contribution as core. So it’s not so much an add-on or the guilt ...It’s not No. 14. Can you think of a way to genuinely benefit commercially from helping to solve social problems rather than create them?Absolutely. And one of the things that I always say is either you do something about this ...But that requires real creativity. ... or you buy yourself a Mercedes that is weaponized. You’re going to have to have walls and you’re going to have to have ... you know what I mean? And then the real, the populism, we don’t like so much. The ugly populism will be dangerous for these people. But it’s interesting. For example, we talked earlier about the predatory pricing, giving it away free. Well, if you start charging ... I don’t know, I don’t want to do the job for them, but I think they must be creative thinking about it, but you’ve got to get commercial about it otherwise it will never be serious. You’ve got to rethink the business model. Absolutely, 100 percent. All right, just finishing up, last thing. What will happen to Trump populism in the last election? Very quickly. Do you mean midterms or ...Yeah, midterms and going forward. It feels very much as if the backlash to Trump’s election will be the dominant focus and particularly with the mobilization of women candidates and women voters in response to a combination of both sides of Trump’s victory and Hillary Clinton’s defeat. But that feels like the story of this particular election.And does this ugly populism peter out, as it often does? No, I think that’s why it’s very important. I’m serious about trying to turn this into a movement so that we put something against that that’s constructive and positive, because I don’t think it’s going away. I think the problems are getting worse, precisely because there isn’t a policy agenda to deal with the concentration of power. And you haven’t talked about immigration and the mass migration around the world. This is a bigger issue, and conflicts around the world leading to displacement of people and refugees. It’s just not easy. It’s interesting, it does strike me, and then we have to finish, is sometimes when Trump says things he’s directionally correct and has a lizard brain for the right thing, but always is focused on the wrong thing. Like with tech companies, with their “conservative bias.” I’m like, “No, they’re not, but there is a problem over there.” But he’s always identifying the exact wrong problem. Exactly the wrong problem. And over here they’re doing the real damage, which is ... I think one thing I would say is that he’s absolutely right about China. We haven’t got time to properly get into that, but I do think that that’s a real shift in policy from where you saw the consensus and the foreign policy establishment, which is like, if you suck up to China and engage with them and whatever, they’re going to get better on human rights, they’re going to become more of a market economy, they’re going to ... it’s absolutely, totally wrong. You know, I’m on that side too. Right. But not the way he’s doing it. I’m like, “What are you doing? It’s not about plastic toys, it’s ...”Correct. But you know, there are signs that the regime which looks so powerful and invulnerable even a year ago, there are signs of it wobbling a bit actually and saying, “Hang on a second.”I think they’re racing right past us. I think we’re focusing on the plastic toys and they’re busy innovating the future of AI and everything else. That’s why we’ve got to both impede them from doing that and support our own efforts. But why focus on the plastic toys? That’s over. I think that he may be in the wrong but I don’t think the policy generally ... I think there are smart people in there who actually get the broader picture. Yes, absolutely. All right, Steve, this is great. Your book is called “Positive Populism.” It’s available now, on Amazon. Yeah, you would never know ... Okay, I’ve got to say this. I paid for a site called positivepopulism.org.What was it, $25?Which also enables you to buy at Barnes and Noble and independent retailers and so on. Good, good. Well, you should read it. Steve’s a really thoughtful person in Silicon Valley and it’s always nice to have him in and talk about these issues, because they’re very important ones going forward for the whole country. And we do have to move in a positive way and you do sound a little leftie now. I don’t know what’s happened, you’ve been hanging out in Palo Alto too long. No, it’s Fox News, it’s turned me left. Yeah, all right. The left wing of Fox. Here we are.I’m joking. I don’t like it, I think the left-right thing ...I hate it, everyone hates it.I don’t buy it at all. They’re exhausting, but they’re more exhausting on the right, right now. But they’re exhausting on all sides. Anyway, it was great talking to you. Thanks for coming on the show. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}