{"id": "Turn and face the change: Recode and Vox.com are partnering", "paragraph": "So here’s the deal — I think I can say with a modicum of humility (hard for me, I know!) that just over a decade ago, Walt Mossberg and I — along with an amazing but small writing team that included just John Paczkowski on launch day — changed the way we covered tech and, thus, changed the way tech was covered.Which is to say — via the AllThingsD and then the Recode websites — we have been telling it like it is about Silicon Valley and beyond, taking no guff from the powers that be, and backing it all up with deep reporting and hard-edged analysis. (We also used some really naughty Photoshop stylings — see here — to do so.) Over the years, we added to that crew with a series of stellar reporters and editors and more, some of whom are still with us and some who have gone on to do rocking work elsewhere. Along with our 16-year tech conference run, we have added TV shows, podcasts, newsletters and excessive tweeting to the mix. And we have changed homes, from the Wall Street Journal to a startup to Vox Media, as we saw various opportunities and challenges present themselves. Which is to say, like the industry we cover, we don’t mind changing to try and please you. In fact, we welcome, embrace and invite change over to dinner, especially because we know that it is critical to be entrepreneurial in media in order to survive and thrive and best serve our readers. Which is why we are doing it again.This is the founding pillar of the new Vox-Recode partnership that we are announcing today. Recode has its roots in business journalism but covers an ever-growing area that now undergirds stories of all types and topics. Vox — Vox Media’s general news network — is built to explain the news but cannot fulfill that mission if it can’t expertly report on the technologies driving the news. Recode brings those experts, having built itself around voices whose authority comes from knowing their subjects cold and from deep sourcing within the industry. It has also set itself apart by treating Silicon Valley with skepticism. In its podcasts and live journalism, it has been far ahead of the rest of the industry in seeing how new technologies were upending everything from media dynamics to interpersonal relationships to political campaigns. And then it has told those stories with clarity and frankness.We simply can no longer escape the future hurtling toward us, which is why understanding the technologies shaping our lives — and the companies creating and profiting off them — is fundamental to understanding the world we live in and the way we live in it. But times have changed and the leadership teams at Recode and Vox have recently started a conversation on how technology journalism should look in this new era. And that means doing things differently than has been done in the past.Why? Because there is almost nothing in our lives that Silicon Valley does not impact anymore — for good and, far too often these days, for ill. Social networks spread discord and hate across our politics, a myriad of addictive devices hook us in and then drive us apart, and new technologies like artificial intelligence, automation and robotics could mean vast changes across our workplace. That’s why we are shifting our editorial approach to focus writers on pointed narratives rather than simply topics or specific companies. We will remain skeptical, infused with the recognition that disruptive technologies unleash unexpected consequences, that the collision between human behavior and complex algorithms never goes precisely as anticipated. And we will be alert to uncovering the hidden ways that technology is changing everything from geopolitical power balances to personal relationships, even as the owners of those technologies decry responsibility for anything more than increasing engagement. These are big stories with enormous consequences. They deserve an audience that includes the insiders and obsessives that make up Recode’s core readers along with a broader, much bigger set of readers, to match the many ways that tech coverage has shifted from niche to general interest. This is a big reason why we’re partnering with Vox: Their platform, editorial support and distribution power will allow us to better amplify our work, expand our mission and reach a wider audience. The partnership will make Recode bigger and Vox’s coverage better. To do this, we are rethinking everything from what we cover to the formats in which we cover it — we want to build a technology publication that is thoroughly, uniquely prepared for this era. Look for more great Recode products as we invest in more writers, more resources, more editorial reach with a more ambitious editorial vision, and expect a relaunch of Recode.net on Vox.com early next year.To help make this the best it can be, we are also looking for an ambitious editor to lead Recode and its talented staff to the next phase. So if you think you have a vision for what’s next and you want to boss me around, let us know. (Apply here!)A quick thanks to Dan Frommer, Recode’s editor for the past three years. He’s leaving this week to pursue new projects. We’re looking forward to seeing what he does next. Let me be clear, for those who enjoy heedless media speculation: The Recode brand remains the same; the Code conferences remain the same; the podcasts remain the same; the television specials we do with MSNBC remain the same. And I am not going anywhere either, because Recode has allowed me — whatever the medium — the great gift of being able to do what journalists are supposed to do. Which is to say, to use an old journalism bromide: Afflict the comfortable and comfort the afflicted. So, once more into that fantastic breach: Vox explains the news. Recode understands technology and media. Together with Vox, and through our newsletters, podcasts, videos, television and live events, we’ll make the Recode brand stronger and more widely consumed than ever.And we change, because George Bernard Shaw wrote: “Those who cannot change their minds cannot change anything.” As always, our aim is to change everything.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}