{"id": "The ‘Stories’ product that Facebook copied from Snapchat is now Facebook’s future", "paragraph": "Stories is the most interesting and important product at Facebook.That much was evident during Facebook’s third-quarter earnings call today, an interesting and uncharacteristically transparent call with investors during which CEO Mark Zuckerberg name-dropped multiple competitors and admitted that Facebook has had trouble building a business around some of its core features, like video and private messaging. Stories, the ephemeral photo and video posts that Facebook copied from Snapchat, was mentioned continuously throughout the hour-long call — a total of 71 times, according to the call transcript.Stories has been a huge hit inside of Facebook’s apps, especially Instagram and WhatsApp. Zuckerberg even said that people will share more to Stories than they will to Facebook or Instagram’s feeds in the “not-too-distant future,” making Stories one of the most dominant ways that people share photos and videos online. “I just think that this is the future,” Zuckerberg said. “People want to share in ways that don’t stick around permanently, and I want to be sure that we fully embrace this.” \n    Related\n  There is a problem with Facebook’s obsession with Stories, though: The business isn’t there yet, which means that as users turn their time and attention to Stories, and away from the feed, Facebook is scrambling to build a business that can capitalize on that shift in attention. “This happened very quickly. This whole trend has been — is much newer than the trend with News Feed and feeds overall,” Zuckerberg said of the user adoption. On the monetization front, Zuckerberg was blunt. “We’re earlier in developing our ads products for Stories,” he said. “We don’t make as much money from them as we do from feed ads.”Facebook has talked about this before, but the interest in Stories has never been so high. Part of the reason is that Facebook has said for years now that it’s  looking for places outside of the core feed to sell advertising, something that is particularly important given that Facebook isn’t growing as quickly as it has in the past. Despite selling ads inside Messenger, inside its Craigslist competitor Marketplace, and inside its new video section, Watch, Stories seems to be Facebook’s best option to make more money off the set of users it already has. In the meantime, expect Facebook’s revenue growth to slow down while the company gets advertisers to buy into Stories and its vertical video ad formats. “I’m optimistic that we’ll get ads in Stories to perform as well as feed over time, and that the opportunity will be even bigger, because it looks like Stories will be a bigger medium than feed has been,” Zuckerberg said. “I can’t tell you just yet what that time frame is going to look like,” he added. Zuckerberg rarely mentions Facebook’s competitors. When he does, it’s usually because Facebook is outperforming them, and he almost never calls them out by name. That wasn’t the case on today’s earnings call. In the first few minutes of Zuckerberg’s prepared remarks, he mentioned YouTube, Apple (specifically iMessage), Pinterest, Twitter and LinkedIn. “While [Facebook’s video section] Watch is growing very quickly, we’re well behind YouTube and still working to make this a unique people-centric experience,” Zuckerberg said, offering a rare admission that Facebook is not just competing with someone, but actually losing to that competitor. Zuckerberg then talked a bit about Facebook’s strength as a messaging service — it owns WhatsApp and Facebook Messenger, each with more than 1.4 billion users — before he name-dropped Apple. “We’re leading in most countries, but our biggest competitor by far is iMessage,” Zuckerberg said. “In important countries like in the U.S. where the iPhone is strong, Apple bundles iMessage as the default texting app and is still ahead.”What ... is going on? It’s certainly possible that Zuckerberg is seeding the idea that Facebook isn’t as dominant as everyone thinks in order to ward off potential antitrust concerns. It wasn’t that long ago that Zuckerberg was asked by Congress who Facebook’s competitors are, and he didn’t have a good answer. A lot of people left that hearing with the idea that, perhaps, Facebook has an internet monopoly. As my former colleague Tony Romm pointed out on Twitter, Zuckerberg may be bracing for a change in congressional control. Whatever the reason, it was rare.  You should expect to see even more Facebook video in your feed moving forward. That’s because Zuckerberg claims that Facebook has had to “rate-limit its growth” on the network because it was cutting into other behaviors Facebook wanted to encourage, like “social interactions.”“We needed to figure out a way that video can grow but people can also keep on interacting and doing what they tell us that they uniquely want from Facebook,” Zuckerberg said. “And now I think we’re starting to work through what the formula is going to be so we can take some of those rate limits off and let video grow at the rate that it wants to.”On one hand, it’s bizarre that Zuckerberg and Facebook would cut back on video distribution, considering how hard it has pushed video — both live and produced video — on its publishing partners over the years. (Though the company has said in the past it wants to cut back on passive video consumption.)But the bad news with more video is that, like Stories, Facebook hasn’t built the kind of robust business around video ads that it has around its regular feed ads. “Video monetizes significantly less well per minute than people interacting in feed,” Zuckerberg said. “As video grows, it will still displace some other services where we we’d probably make more money.”It was the second admission from Zuckerberg, along with Stories, that users are starting to spend time using products and features that Facebook doesn’t monetize well. You can expect these to come back up if and when Facebook’s revenue growth starts to become a problem down the line. Facebook’s user base in its most valuable markets — the U.S., Canada and Europe — is no longer growing. That isn’t a shock, as we’ve seen this trend coming for the last few quarters, but today’s earnings call made it official. Facebook’s U.S. audience hasn’t grown in the past two quarters, and the company reported its second straight audience decline in Europe. Facebook is massive in the U.S. and Europe, and eventually, the company was bound to run out of potential new users in those markets. But it still matters, because those markets are the most valuable to Facebook’s business. Each user in the U.S. generated $27.61 in revenue for Facebook last quarter. Each user in the “Asia-Pacific” region generated just $2.67 in revenue. The top three growth markets for new Facebook users last quarter: India, Indonesia and the Philippines.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}