{"id": "Who does Facebook fire after a bombshell New York Times investigation?", "paragraph": "The New York Times published a bombshell report Wednesday: An in-depth account of Facebook’s repeated struggles over the past two years to clean up mess after mess, from Russian election interference to privacy breaches and data leaks. The story leaves one wondering: Will someone be fired for Facebook’s role in all of this? And if so, who? And, if not, why not?That’s because it includes a number of bizarre details, like that Facebook “employed a Republican opposition-research firm to discredit activist protesters, in part by linking them to the liberal financier George Soros.” Or that Facebook was guilty of “lobbying a Jewish civil rights group to cast some criticism of the company as anti-Semitic.”Those are odd enough, but more damning is the focus on poor decision-making of Facebook’s top two executives, CEO Mark Zuckerberg and COO Sheryl Sandberg. They both are depicted in the piece as underestimating or misjudging the company’s problems at every turn, and perhaps even actively ignoring them. In Zuckerberg’s case, the Times reported that he, at least early on, wasn’t very involved in the important conversations around Facebook’s response to Russia’s election meddling efforts. When Facebook first published an admission that a foreign government had used the site to sow discord ahead of the election, but declined to name Russia for fear of angering Republican lawmakers, Zuckerberg “did not participate in the conversations.” And when top Facebook executives debated whether or not President Trump violated the company’s terms of service ahead of the 2016 election, Zuckerberg “did not participate in the debate.” “At critical moments over the last three years, [Zuckerberg and Sandberg] were distracted by personal projects, and passed off security and policy decisions to subordinates,” the Times wrote. In 2017, Zuckerberg spent a good portion of the year traveling around the country on a listening tour, posing for photos on tractors and in ice cream shops. Sandberg was more involved, but primarily behind the scenes. She oversaw the team responsible for Facebook’s response to almost all of these issues, including head of public policy Joel Kaplan and head of communications and policy Elliot Schrage. The story claims that Sandberg was angry when she first learned executives were digging into Russian election meddling without permission in early 2016, and was later an advocate internally for keeping critical information about that investigation out of the public eye. That included a decision in early 2017 to exclude a very important detail from a report the company published: That it was Russia who had used the service to try and influence voters ahead of the election. Sandberg and Kaplan were reportedly afraid naming the Russians might anger Republican politicians. This section of the story about the company’s decision not to name Russia in its first public white paper about the incident summarizes how both executives came across more broadly throughout the piece:If Facebook implicated Russia further, Mr. Kaplan said, Republicans would accuse the company of siding with Democrats. And if Facebook pulled down the Russians’ fake pages, regular Facebook users might also react with outrage at having been deceived: His own mother-in-law, Mr. Kaplan said, had followed a Facebook page created by Russian trolls.Ms. Sandberg sided with Mr. Kaplan, recalled four people involved. Mr. Zuckerberg — who spent much of 2017 on a national “listening tour,” feeding cows in Wisconsin and eating dinner with Somali refugees in Minnesota — did not participate in the conversations about the public paper. When it was published that April, the word “Russia” never appeared. So does anyone pay for these serious missteps?Zuckerberg has been asked that question a lot over the past year, but Facebook rarely seems to fire anybody, even when there are clear and significant screwups. After Facebook’s Cambridge Analytica data disaster became public in March, Zuckerberg said that it was “my mistake.” A few months later, after Zuckerberg had to testify before Congress about the same issue, Recode’s Kara Swisher asked him again who should be fired. “I think it’s a big issue, but look, I designed the platform, so if someone’s going to be fired for this, it should be me,” he said at the time. The reality, of course, is that Zuckerberg will likely never be fired. He controls 60 percent of the voting power at Facebook, and he isn’t going to fire himself. What about Sandberg? Of all the executives listed in the Times’ story, Sandberg came out looking the worst. Not only were some of her decisions cringe-worthy, like her repeated efforts to keep details of Facebook’s Russia investigation under wraps, but her very commitment to the company was called into question. “Some colleagues believed that Ms. Sandberg — whose ambitions to return to public life were much discussed at the company — was protecting her own brand at Facebook’s expense,” the Times reported. It’s also hard to miss the fact that many other named executives from the Times’ story are no longer at the company, and almost all of them came from Sandberg’s side of the business. Schrage is out; General Counsel Colin Stretch is leaving; Chief Security Officer Alex Stamos is gone. While it seems unlikely that Sandberg — a Facebook board member and the executive who built and still runs Facebook’s entire business — will actually be fired, The Verge’s Casey Newton summed it up well: “The long knives have come for Sheryl Sandberg.”The only other prominent player left from this saga is Kaplan. Perhaps he’ll leave soon, too. Kaplan, described in the story as a “well-connected Republican,” was seen throughout the story advising Facebook’s top executives to make decisions to avoid Republican backlash. (Ultimately, Republicans have found other ways to attack Facebook anyway.) Not only do Kaplan’s decisions to downplay the Russian misinformation efforts look bad, but this is the same Kaplan who made the very bad decision to appear unexpectedly in the hearing room behind his friend Judge Brett Kavanaugh last month, creating a firestorm internally from angry Facebook employees. The truth, though, is that the issues outlined in this story came from the top. Whether it was poor decision-making or an absence of decision-making, Facebook’s problems ultimately trace back to just two people: Zuckerberg and Sandberg. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}