{"id": "Recode Daily: Bitcoin turns 10, Apple’s first $100 billion quarter?", "paragraph": "Bitcoin was born 10 years ago, when a person or group using the pseudonym Satoshi Nakamoto released a nine-page white paper describing a “peer-to-peer electronic cash system.” After a few years as mainly a techie project, the digital currency broke into the mainstream around 2013, and looked like it was on the path to broad acceptance, if not inevitability. In the past decade, bitcoin has become a source of fascination for investors, speculators, true believers and skeptics around the world. What it hasn’t become, though, is the one thing it was built to be — a payments system. [Paul Vigna / The Wall Street Journal][Want to get the Recode Daily in your inbox? Subscribe here.]  When Apple reports September-quarter earnings today after the bell, perhaps the most important number will be its forecast for the December quarter, including the busy holiday shopping season. That’s when, if things are going well, the new iPhone and Watch lineup — plus Apple’s just-announced new iPads and Macs — could potentially drive the company’s first $100 billion quarter. [Neil Cybart / Above Avalon]Amazon’s Alexa intelligent assistant can now talk about the midterm elections. Say “Alexa, what’s my election update,” and your Echo device, basing answers on your location, will tell you about gubernatorial, congressional or Senate candidates. As votes come in on Election Day, Amazon is working with the Associated Press for Alexa to deliver election updates and tell users how a candidate is doing based on their name, and deliver up-to-date results in closely watched congressional or U.S. Senate races. [Khari Johnson / VentureBeat]Early voter turnout is surging in several key U.S. states, suggesting more that Americans may cast their ballots in next week’s midterm elections compared to previous years. A week ahead of Tuesday’s election day, 22 million votes have been cast around the U.S. so far, according to the United States Elections Project; in 11 states, more early votes have already been recorded than early votes recorded in total in 2014. If trends continue, turnout could beat the 49 percent recorded in 1966, a number that has not been surpassed since in a midterm. [Erin Durkin / The Guardian]Facebook CEO Mark Zuckerberg has been summoned to appear in London before an “international grand committee” of Canadian and U.K. members of Parliament to testify and answer questions about Facebook’s data privacy practices and disinformation being spread on the social media platform. Scheduled for Nov. 27, the proposed event would be the first time that the two parliaments have conducted a joint hearing. Zuckerberg has already appeared in front of the U.S. Congress and European Parliament, but has sent other representatives to speak to members of the British and Canadian parliaments, who have both requested his testimony. [Ali Breland / The Hill]Alphabet’s Waymo self-driving car unit became the first company in California to get permission to test autonomous vehicles on public roads without human operators. The California Department of Motor Vehicles’ permit allows Waymo to oversee up to 40 fully autonomous vehicles that can drive day and night on city streets, rural highways and highways that have posted speed limits up to 65 mph. Waymo’s Chrysler Pacifica white minivans will go driver-free initially around its Mountain View headquarters and neighboring Sunnyvale, Los Altos, Los Altos Hills and Palo Alto; Waymo employees will still be aboard, just not in the driver’s seat. [Carolyn Said / San Francisco Chronicle]Border control checkpoints in the European Union are about to get increasingly — and unsettlingly — futuristic. The EU has launched a six-month trial of iBorderCtrl, an AI lie detector that looks for “biomarkers of deceit.” Deployed at border crossings in Hungary, Latvia and Greece, a virtual agent asks travelers questions like “What’s in your suitcase?” The system records travelers’ faces using AI to analyze 38 micro-gestures, scoring each response. The virtual agent is reportedly customized according to the traveler’s gender, ethnicity and language. [Melanie Ehrenkranz / Gizmodo]“I thought the web would stop hate, not spread it,” says Kara Swisher in a New York Times op-ed accusing social platforms and Silicon Valley funders of operating with “sloppy disregard” for the consequences of hate speech, leading to disasters that they have to clean up after. “And they are doing a very bad job of that, too, because they are unwilling to pay the price to make needed fixes. Why? because draining the cesspool would mean losing users, and that would hurt the bottom line.” [Kara Swisher / The New York Times]Tech employees are much more liberal than their employers — at least as far as the candidates they support. Corporate political action committees aren’t as motivated by partisan politics as individuals tend to be. [Rani Molla]It’s way, way too soon to pat ourselves on the back for the gains of the #MeToo movement. On the latest Recode Decode, “Good and Mad” author Rebecca Traister explains why women’s anger is having a resurgence, and how to keep yourself from getting burned out.[Kara Swisher]“The Front Runner” director Jason Reitman says technology has taught today’s young people how to be great filmmakers. Everything from selfies to YouTube has armed Generation Z with an “inherent” appreciation of film technique, Reitman says on the latest episode of Recode Media. [Peter Kafka]They did it!Ultrascientific Halloween candy ranker.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}