{"id": "IBM is making the third-largest tech acquisition ever", "paragraph": "IBM is making one of the biggest acquisitions of all time in the tech sector, shelling out $34 billion to buy Red Hat, best known for its flavor of the open-source Linux operating system that runs on servers.The legacy tech giant is making a bet on cloud computing in the all-cash deal that the two companies announced Sunday afternoon. Red Hat, which was founded 25 years ago and is based in North Carolina, was valued at about $20.5 billion at the end of trading on Friday, which means the offer represents a roughly 60 premium.This is the third-biggest tech deal in the history of U.S. tech, according to CNBC. And it comes at an acquisitive time in the enterprise space: Microsoft made a splash with its $7.5 billion purchase of Github earlier this year; Amazon and Google are also striving to gain the edge in cloud computing.Despite its pre-Web 1.0 dominance, IBM has struggled for relevance in this age, and has seen its share price fall by 30 percent over the last five years. It is clearly betting that a big acquisition can change that.“The acquisition of Red Hat is a game-changer,” said IBM CEO Ginni Rometty. “It changes everything about the cloud market.”We’ll see about that. But, no doubt, it is a major gamble.“Brilliant move by IBM,” Box CEO Aaron Levie tweeted this afternoon. “Transformation requires big bets, and this is a good one.”Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}