{"id": "Facebook’s top political ad spender is ... Facebook", "paragraph": "The political advertiser spending the most money on Facebook ads is ... Facebook?Just two weeks ahead of the midterm elections, the social network released a new “ad archive report” outlining which politicians and political groups have spent the most money on Facebook ads over the past six months.Ironically, Facebook topped its own list. (Well, technically, Facebook didn’t include itself on its own list, but included its spending as a footnote instead.) The social network has spent almost $12.5 million in the past six months to promote its own election integrity products, including the ad archive itself, which shows users who paid for what political ads. (Even though Facebook owns the platform, it still runs ads through the same system as other advertisers. The money simply changes pockets.)Second on the list was Beto O’Rourke, a Democratic congressman from Texas who is running for the Senate against incumbent Ted Cruz. O’Rourke has spent more than $5.3 million on more then 6,000 ads. Third on the list: President Donald Trump, who, of course, is not up for reelection until 2020. The ad archive is new this year. Facebook announced it last year as part of its plan to avoid another election disaster like it had in 2016, when Russian trolls used Facebook to try and sow political discord among voters ahead of the U.S. presidential election. The thinking is that clearly labeling all political ads, and showing who paid for them, will help prevent bad actors from manipulating Facebook users.Despite taking first place on the list, Facebook is not a traditional political advertiser. None of the ads Facebook ran over the past six months are for a specific candidate or issue, but they are focused on the election. That Facebook outspent all of the actual political candidates and parties gives you a sense for how desperate the company is to convince its users that it’s taking the upcoming midterms seriously. O’Rourke’s race against Cruz will be one to watch. Early poll numbers show Cruz has a notable lead over O’Rourke in a very conservative state, but Cruz has spent just $424,000 on Facebook ads since May, according to the data. O’Rourke has spent more than 10 times that much. We may never know if that money was well spent or not, though Facebook has been suggested as a key differentiator in helping both Trump and President Barack Obama win past elections.Here are a few other example of political ads on Facebook from top spenders, like President Trump and and Concealed Online, a group trying to “help citizens gain the education to safely handle firearms and successfully defend themselves and their families.”Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}