{"id": "Why nonprofits should think more like tech companies", "paragraph": "Philanthropy doesn’t need to be “hacked” by Silicon Valley — but the leaders of nonprofits can learn a lot from the way tech companies do business.On the latest episode of Recode Decode, Stanford University lecturer Kathleen Kelly Janus talked about the field of social entrepreneurship and her book, “Social Startup Success.” In it, she argues that there’s more overlap between what works for nonprofits and for-profits than people might assume.“That is the essence of philanthropy and nonprofits, to test small ideas so that we can use government to scale them for good,” Janus said. “The problem is that a lot of nonprofits get stuck on their individual solution and don’t really take the time to investigate whether they are solving the problem in the most effective way.”She told Recode’s Kara Swisher that one of the limitations is that people “go into this work because they care about the causes, not because they’re data scientists.” So when it comes to important tasks like measuring one’s impact, nonprofits might need outside help.“They want to know that they are having the most impact that they can possibly have. The problem is, it’s really hard to do that,” Janus said. “Seventy-five percent of nonprofits say they collect data. Only 6 percent of them feel like they know how to use it well. We need to do a better job of supporting nonprofits to be more rigorous with their data to know how to use that data that they’re collecting so that they can figure out how to do better.”You can listen to Recode Decode wherever you get your podcasts, including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a lightly edited full transcript of Kara’s conversation with Kathleen.Kara Swisher: Today in the red chair is Kathleen Kelly Janus, a lecturer a Stanford University’s program on social entrepreneurship. She’s also the author of the book “Social Startup Success: How the Best Nonprofits Launch, Scale Up and Make a Difference.” Oh, it’s so nice to be talking about social things. Kathleen, welcome to Recode Decode.Kathleen Kelly Janus: Thanks for having me, Kara.It’s been an ugly period of time in startup land, I think, but here we’re going to talk about what you’re doing. Give me a little bit of your background. I want to know how you got to writing about this social entrepreneurship, because Stanford has a very big program in that. There’s a lot of really interesting things going on there.Huge program. I was raised in a small town. I was raised in Napa. My grandparents moved there when it was prune country, long before it was wine country. I was raised in a family where, we were Irish Catholic and it was our duty to give back to the community. Oftentimes, you would find my sisters and me tagging along with my parents, giving back at soup kitchens. My parents sat on dozens of nonprofit boards over the years. So, the conversations at our dinner table didn’t just revolve around the people in our community that didn’t have enough to eat, but the nonprofits themselves and how they really struggled to survive and thrive.I’ve always had this real passion for giving back, particularly to nonprofits. When I was a young lawyer in San Francisco, I looked for ways to get involved, didn’t find them and ended up co-founding my own nonprofit, Spark, which engages young professionals in giving back to gender equality issues.Spark was amazing. We had a ton of momentum. We had a ton of buzz. And just when we hit our stride, we hit this wall. We couldn’t get the capital that we needed to grow the organization. Many years later, when I began teaching social entrepreneurship at Stanford, I became really curious. Well, who are the organizations that are scaling this wall and what were they doing that we weren’t doing at Spark?Talk about the idea of what a social entrepreneur is. Take some that Stanford has, Stanford has a lot of programs. I know Lauren Andreessen’s involved. There’s a whole bunch of people involved in it. Explain that for people.Social entrepreneurship is a new form of creating social change. It used to be about checkbook charity, about let’s say ... Bill Drayton, the godfather of social entrepreneurship, says, “It’s no longer about just giving a man a fish or even teaching a man to fish. We need to revolutionize the fishing industry.” That’s exactly what social entrepreneurs do. They’re thinking about how you can solve the underlying problems of, say, homelessness, so you don’t have to just give a man a bed, that you can prevent homelessness from happening in the first place.Mm-hmm. At Stanford there’s a degree in it, correct, that people ... or not?There are dozens of social entrepreneurship classes at Stanford. That’s really exciting because I’m seeing in my students that it’s not just a certain type of student who’s going to go in the nonprofit sector. It’s computer science majors, it’s engineering majors. There is a passion and an interest of young people to get involved in social causes, like never before.When you talk about that concept, I want to get to your book in a second about some of this too, but one of the things that I think a lot of people feel are lacking are that interest in social issues and all that coming home to roost right now in these hearings that have been going on and about the responsibility of companies like Facebook and Google and others. Why is that shifting? Because it didn’t seem like there was a whole lot of that before in startups, that they did not think of anything but growth, growth, growth. Social issues were very low on the totem pole if there at all, or they were relegated to a status that never got fixed.I think young people are changing. We’re seeing an incredible generational shift, where now 55 percent of millennials say that a company’s social cause work was a really important factor in deciding whether to go to work for a company. So companies have no choice but to get involved in social cause work if they want to hire and retain great talent.Mm-hmm. And how does that work here in Silicon Valley? I want to get to your book in a second, but when you’re trying to get companies to get that, you don’t want it forced upon them, presumably.No, it has to come from companies themselves. It has to come from the passion and interest of the founders, of the employees. Every company is going to have a social cause program that’s going to look a different way. What I will say is that the sooner that you can integrate social cause work into the fabric of a company’s culture, the more effective it’s going to be and, ultimately, the more fulfilling it’s going to be for the employees as well.Let’s talk about the ones that have worked. Every company, there’s been Google.org, there’s been all kinds of things in the tech sector — and we’re gonna focus just on the tech sector. Talk a little bit about what’s worked and what hasn’t worked.I’ll tell you an interesting story. I went on this book tour, my book came out in January, and I happened to be speaking at Google and Facebook the same week. It happened to be that I was speaking at Facebook the day that the Cambridge Analytica news broke. So, I saw it on CNN that morning. I go in and the executive that was showing me around said, “I’m so sorry the cafeteria is in disarray. We had this all-hands on meeting for this external thing that’s going on.” And I said, “Oh really? That external thing that I saw on CNN this morning?”Yeah, how you ruined democracy. Go ahead.It was so interesting, speaking at Facebook, and hearing the passion of those employees who were looking for ways to get involved in social causes. Mark Zuckerberg made a really interesting decision early on in Facebook that his philanthropy would be separate. The philanthropy arm of Facebook is the Chan Zuckerberg Initiative, which is doing incredible work. I have a lot of respect for Priscilla Chan and Mark Zuckerberg. They’ve been very committed to a lot of great social causes, but they’re selling them so short by not harnessing this incredible passion that their employees have. So when I heard questions from the employees at Facebook it was like, “I’m just going to be here for a couple years until I can go start my own thing,” because they were looking to get involved elsewhere because they weren’t finding that support internally.Shift to Google where I spoke that same week, where the .org work has been integrated into the company from very early on, and there is a commitment to giving their engineers and their employees time to work on social cause work. The questions were very different and the opportunities to give back were so different. For example, when the fires happened in northern California, Google employees came to the table and said, “We realize that it’s really hard for people to get information about where these fires are. We think we can use our mapping tools to make that information available.” And they did. And it was critical to support those regions. That’s the kind of change that companies can make for good, if they allow their employees the opportunity to give back as a part of their job.Does every company have to have these, though? It seems like a de rigueur thing that companies have. I know Airbnb has one. They all seem to have launched those kind of things.They don’t have to but if they’re going to want to survive in today’s hiring economy, I think it’s going to be necessary. The next generation is ...Gen Z?Gen Z is even more committed.Yeah, I like Gen Z.Sixty percent of teens say that they want their work to have an impact in the world. So, again, it’s employees and it’s consumers. Consumers are also demanding products from companies that are values-based. I think it’s a really exciting time for philanthropy and to be involved in social cause work.I’m going to go to the nonprofits themselves in a second, but I wanted to stick with companies for a minute. I just interviewed Rose Marcario from Patagonia, for example. That’s a heavy values-based company even to the detriment of their own business, which seems to have gotten better the more committed they are to values, the certain values they have around ... whether it’s suing the federal government over different things, over parklands and things like that or being very strident against the government, against Trump particularly, or whatever they’re doing, or saying, “Don’t buy our stuff. Recycle it,” and things like that. It seems to have worked rather well for them.Yeah. I think Patagonia is a great example of a company that has been incredibly not only impactful through the way that they’re doing business but also have shown that it can be good for business, too. They’ve seen an incredible revival of their company.All right, so talk a little bit about nonprofits themselves. When you were talking about social startup success... How have nonprofits changed? Because when I was in Silicon Valley a couple years ago, many years ago, I remember going to something, it was right near Kleiner Perkins and they were helping nonprofits become more technical and do better. It was sort of a hopeless cause because most of these nonprofits were stuck in some age that just doesn’t exist any more. Talk about the way nonprofits have moved.Nonprofits are struggling. My research showed that this wall that we hit at Spark, getting past $500,000 in revenue, is a real thing, that two-thirds of nonprofits in the United States are $500,000 in revenue and below. They are on this treadmill to constantly fundraise for payroll the next month, when they should be focused on their impact. Imagine if we expected that of CEOs, right? Nonprofits who responded to my survey said that they spend 75 percent of their time on fundraising. Companies would never get anything done. So we’re basically expecting nonprofits to solve some of the hardest issues of our time — like climate change and increasing inequality — with one hand tied behind their back. My book, “Social Startup Success,” is all about trying to figure out, well, what are the strategies that nonprofits are using to get ahead — like testing and innovation, measuring impact, fundraising more creatively, developing better ways of telling the story — so that we can teach the next generation of nonprofits, and the last generation of nonprofits, how to be more effective. These strategies are teachable and the problem is that we’re not teaching them.The second part of your book is how they scale. You’re talking to them in — “[how] nonprofits launch, scale and make a difference.” You’re using tech terms to do that. Talk a little bit about what nonprofits have to do.In my research, I found that it wasn’t just charisma or a great idea that allowed a nonprofit to get ahead or not. I went out and I surveyed hundreds of nonprofit leaders. I sat down with 100 social entrepreneurs, with their staff, and asked them what the key was to their success. It turns out that it’s these five strategies that I talk about in the book — testing and innovation, measuring impact, collective leadership, fundraising experimentation and storytelling — that allow organizations to lay that foundation for success.Let’s go through those. So go through the first one.Testing and innovation.Which you don’t think of when you think of startups, really.No, and yet that is the essence of philanthropy and nonprofits, to test small ideas so that we can use government to scale them for good. The problem is that a lot of nonprofits get stuck on their individual solution and don’t really take the time to investigate whether they are solving the problem in the most effective way. Organizations that continue to be innovative as they grow are the ones that are able ensure that they’re having the most impact.Right. What else? Testing, like what? Give me an example.An example would be Beth Schmidt, who founded Wishbone.And what do they do?It’s a crowdfunding platform for low-income kids to get involved in extracurricular activities. When she was teaching in a low-income school in Los Angeles she realized that her kids didn’t have these opportunities to follow their passions. She didn’t go out and just start a nonprofit. She took the time to really identify, what is the problem and how can I help with my solution? She assigned a paper asking them to write about their passions. She photocopied that paper, sent it out to her friends and family and said, “Would you give these kids money to follow their passions over the summer?” And she got back thousands of dollars in the mail.She really figured out how to tweak the engine before she began to run it. Doing things like figuring out how to get scholarship money so that the cost would be lower, how to engage the kids in the fundraising themselves so that they could get that skill. This is really drawing on a lot of the lean startup principles that we see in the Silicon Valley, the minimum viable product, figuring out how to test, measure, build.  By drawing on some of these Silicon Valley practices, she was able to scale this organization to be a multi-million dollar organization that has served thousands of students across the country.Right. Testing and innovation before. Excellent.Measuring impact is really critical.Which they don’t do.No. This is something that really defines the next generation of nonprofits. This real rigor towards data. I thought when I first learned this, “Well, that make sense.” These are the ones that are able to go out and talk to donors and say, “Here’s what impact we’re having.” Then they get funded, but it’s not that at all. They want to know that they are having the most impact that they can possibly have. The problem is, it’s really hard to do that. Seventy-five percent of nonprofits say they collect data. Only 6 percent of them feel like they know how to use it well. We need to do a better job of supporting nonprofits to be more rigorous with their data to know how to use that data that they’re collecting so that they can figure out how to do better.Give me an example someone who’s done that well.One organization that has done this well is Braven, an organization that helps college students who are from low-income backgrounds learn soft skills like networking and resume building. When they had their first cohort of freshmen, they needed to know whether they were having an impact early on. They couldn’t wait for years to see if these students were graduating, so they tested proxies, like were those kids going to class, as a proxy for whether they would ultimately graduate.They asked their mentors if they would recommend them for jobs as a proxy for whether they would ultimately get a job. By using this data to show that they were on track towards graduating their students at faster rates and getting them jobs at faster rates, they were then ultimately able to tweak their program so that they could be as effective as possible and grow the program by getting the confidence of the donors that they needed to get to that next level.Okay. Is it an anathema towards that or it’s just not an ability, or not thinking of it properly?I think ...Because all tech companies use data. That’s how everybody differentiates themselves.I think the challenge is, nonprofit leaders go into this work because they care about the causes, not because they’re data scientists. I think as someone personally who’s a little bit of a dataphobe, I can relate to that. I think what nonprofits have to realize is that it doesn’t have to be this big complicated thing. You can just figure out the two or three things that matter, like Braven did, and go after them rigorously. And also leverage the help of tech companies and data scientists who do know what they’re doing. This is something that nonprofits have also been doing well.Yeah, they have recently. All right, what else?Also, fundraising experimentation. This is a really important piece of it and particularly developing ways of generating earned income. This is, again, another signature component of the new nonprofit. It’s not just about philanthropy.The old way was ...?Checkbook charity. Take donations and give services and then come back in a year and get your donation renewed. Right. Have a party. Yeah. The gala. That’s not very sustainable. Organizations like Hot Bread Kitchen in New York — which are using bread recipes from low-income women to help both train them to go into jobs in the food industry and then sell the bread to sustain the organization itself — are finding ways to bring in earned income. Hot Bread Kitchen has a café. They do wholesale to Whole Foods and JetBlue. They have an incubator for small businesses from the food industry. This is really exciting that these organizations are able to survive beyond just philanthropic dollars.Besides the hand-to-mouth aspect of checkbook ... You’re talking about doing it every year. This is a way to diversify your business, presumably, which is a business, right?Absolutely. I think what we have to be careful about is recognizing that not all causes are going to be amenable to earned income. There’s not a huge business.It’s not a T-shirt business.Yeah. A lot of T-shirt businesses. Racial justice issues, human rights. People aren’t going to be paying for their human rights if they can’t afford the bus to get to the courthouse in the first place. Philanthropy is not dead, but where organizations can bring an earned income, it can be very useful.Okay. What else?The other strategy that these organizations use is collective leadership. What does that mean?They’re flipping the traditional hierarchy of the CEO being on top and putting their staff upfront. In the book, I talk about Jim Nordstrom who did this famously at Nordstrom. “The Nordstrom Way.” He talked about how customers should be first, and the people who were closest to those customers, the salespeople on the floor, are the people who have the most control over the outcome.Nonprofit leaders also realize that they cannot do it all themselves. Although we are in this world where we revere our leaders — like we equate Facebook with Mark Zuckerberg, we equate micro-finance with Muhammad Yunus — that actually the best nonprofits tap into the talents of their entire staff to leverage their talents and to keep them engaged.How do you get a company, a nonprofit, to do that? ‘Cause usually, they like their charismatic founder. It sometimes turns out to be bad, like every fourth one.I think the problem is usually we like the charismatic founder. Whether it’s donors or media, we all want to hear from the founder, because it makes a great story. The best organizations figure out how to use “we” language, not “I” language. How to make everybody a part of the social cause and the movement, not just the ...Give me a good example of that too.Charles Best from DonorsChoose, which is ...Yeah, who’s great.Yes. An incredible crowdfunding platform.Explain what they ... Crowdfunding for teachers.For teachers, so teachers can put their projects up on the site and fundraise to get them funded. Charles Best always brings it back to the teachers. He always brings it back to the staff and the leaders. He understands his role as the face and the voice of the organization, but he never misses an opportunity to give credit to others and that is the beauty of collaborative leadership.Okay. The last one is storytelling.Storytelling. Yeah. I think we all have this tendency to think that if someone who gives a great TED Talk, a great political speech, gets up there and they’re just such a natural ... When I went out and talked with these leaders, it’s not natural at all. It comes from a lot of practice and they realize that you cannot build a movement if you can’t tell a good story.For example, Nadine Burke Harris, who founded the Center for Youth Wellness, had the opportunity to give a TED Talk about ACEs. This was the talk of her life because she realized she could shift the conversation if she could make this go viral. She talks about how, at the end of six months, preparing for this speech, her husband literally could have given this speech for her because she had given it so many times across the dining room table.That is a level of commitment that we see in storytelling. It’s not just for founders, it’s also for staff or your board members, who can be incredible champions for your cause. Everybody needs the tools to be a brand ambassador for an organization. The onus is on the nonprofit organizations to put those tools...Have they used social media tools and other things to do that? You’re talking about TED Talks, which not many people get to do. What are some other techniques that people have used?I tested for social media in my original survey, because I was really curious if there would be a correlation between the organizations that were emphasizing a social media plan, organizations that weren’t. And there wasn’t. I do think social media is a place that can have ...Or technology tools, whatever.Of course, technology tools. We heard from Dave and Charlotte Willner, the power of Facebook to allow ...Yes. This was a couple ... You can explain.Yeah, the couple who wanted to raise $1,500 on Facebook for RAICES.Which they did.Yeah. To help bring families back together who were being separated at the border. Within one week, raised $20 million. That is the power of technology and social media to help social causes. That is allowing philanthropy to take shapes and forms that we’ve never seen before. That’s very exciting.It is not the only way to have a cause go viral. The Center for Youth Wellness, for example, uses Google Analytics to see how they’ve changed the conversation, by seeing how many times people are googling ACEs. Nadine Burke Harris was talking about how Oprah had on “60 Minutes,” this talk about ACEs. She didn’t feature Nadine. We were all like, “Wait a second. You should have been on Oprah.” She said, “No, no, no. That’s impact. When other people are using your story and not attributing it to you, you have changed the conversation.” I think it’s that egolessness that makes organizations and leaders so powerful.Have organizations embraced this kind of stuff? We’re going to talk about that next, where philanthropy is going, but how hard is it to get an organization off, like a nonprofit organization off? They do represent to me, besides healthcare, the slowest-moving change agents around.It’s really hard. It goes back to the fact that donors are not investing in nonprofits to give them the tools they need to make a difference. Eighty percent of nonprofits, of philanthropy in this country, is restricted. Explain what that means.That means that those donations have to go to certain programs. Let’s say, if it’s a reading program, it can only go to the reading program. It can’t go to what donors might call “overhead” expenses. We would never go into a restaurant and say, “I’ll pay for the food, but definitely not paying for the plate or the chef’s time to prepare it or the electricity to keep the lights on.” Yet we do that with nonprofits all the time.That’s a really good point.Somehow, we feel entitled to restrict our donations to the part that feels good, like teaching a kid to read, but not all of the components that go into ...That’s probably because many have abused it. You see report after report of them using all the money for their own overhead.I think those reports got sensationalized, but all of these strategies that we talk about in “Social Startup Success,” that’s overhead. That’s capacity-building. That’s investing in nonprofit leaders to do the work on the social causes that we care about.There’s a great TED Talk by Dan Pallotta where he talks about the overhead myth and how we do need to invest in overhead because that’s all the R&D and the marketing that gets companies off the ground.Right. That’s a really good point.We need the same kind of investment in social causes.I want to finish up talking about where philanthropy is going. There’s a lot of money here, for example. A lot of different entrepreneurs have started their own philanthropies, Mark Zuckerberg obviously, Pierre Omidyar and his wife Pam. Obviously, Bill Gates and his wife also have started that, Melinda Gates.They’re doing some really astonishing things. Is that the way philanthropy is going to go in the future? What’s changed? That’s where much of the money is in philanthropy. Or maybe I’m wrong, but it seems like some of the most exciting ones are out of tech right now.It’s a very exciting time in philanthropy. About 2 percent of our country’s GDP goes to philanthropy, about $340 billion. This is a huge investment that big foundations like Omidyar, Gates and others are making in social causes. They’re doing it in new ways. They’re investing in this very kind of social innovation that we’re talking about, new ideas that are being applied to social causes that are allowing for scale like we’ve never seen. That’s all really exciting. What I think is challenging as new donors think about ways to make a difference, a couple of things. One is that we forget about the poverty in our own backyard. We are living in a valley of billionaires and yet one in six children goes to school hungry every day.Yeah, in the San Francisco area.Every day. Yeah, and there’s a great report that the Giving Code by Alexis Cortes Culwell and Heather McLeod Grant which talks about this poverty paradox that we’re seeing in the Silicon Valley and how a lot of the philanthropy that’s happening is going to higher institutions, and ... there’s a story that they tell where this donor was making an incredible contribution. A $10 million gift to a nonprofit. He spent a year trying to negotiate what the terms of the gift would be, and finally ultimately gave the gift. He was at his Harvard reunion with a bunch of guys and had planned to give a certain amount but saw what everybody else was giving and by the end of the night he made a $25 million gift on the spot.To Harvard.To Harvard. Where there’s a lot of poor people.Yeah, ’cause they need the money, yeah. Good god.So you know, I think that there is this scrutiny of nonprofits that we don’t see in higher education institutions and other places where people contribute their money. And I think that people need to take it upon themselves to understand how they can give back to people in our community who are suffering as well. And I think they need to do that by ensuring they are educating themselves and learning from those who have gone before them. Sean Parker, a couple of years ago, came out with this piece in the Wall Street Journal talking about how he ...This is the Napster founder, and he was an early Facebook investor.Yep, how he wanted to “hack philanthropy.”Yeah, I remember.You know, which is exciting. I’m all for, you know ...Sean has a lot to say.... thinking about new ways to approach philanthropy, but let’s not forget that there are people who have been on the ground with their sleeves rolled up trying to tackle these issues for decades, and what can we learn from them and improve on in order to really make an impact in these social causes that we care about.Yeah, I forgot that hacking thing. They love to talk about stuff like that. They have to first declare it broken so they can fix it, right? Yeah. Is that irritating to you?Well, I think that I’m in the education business, so I try and keep it positive.It’s irritating to me. Yeah. Oh, do you? I find it deeply irritating. But are there some hacks that, I mean ... There are some hacks, you’re talking about hacks here in your book, correct?Absolutely. I mean it’s ...’Cause there are antiquated ways we’ve done philanthropy in the past.Absolutely. And I think that there’s a lot of old-school nonprofits out there that need to renovate. They need to clean house and think about doing new ... Taking new approaches like measuring the impact of their work more rigorously so they can figure out what’s working and what’s not, and get better at what they do. But this isn’t rocket science. The strategies that I talk about in this book are not new. They’re just what the best organizations are doing.Where do you imagine philanthropy’s going in the future?You know, I’m really hopeful about the next phase of giving. I really believe that we are living in a golden age of philanthropy, where there are more ways to give back than ever before. We see this with ordinary citizens giving back, like the RAICES fundraiser on Facebook. We see this with people who are giving their time, they don’t ... People don’t just want to write a check and be done, they want to roll up their sleeves and get involved in the nonprofits that they care about. This is what’s happening in RAICES ... fundraiser.People going on ...People are saying, “Yeah, no, I don’t want to just write just a check. Now what can I do?” And so we need all hands on deck to solve these really pressing social problems that we’re facing, like climate change, like increasing wealth and equality, and so I think the fact that more people want to get involved is really exciting, and we need to educate the next generation so that when they do graduate from college, they are ready to hit the ground running and they don’t have to waste their time learning these very basic skills like fundraising and measuring impact on the job.Right, absolutely. And if you had to pick out a philanthropy that’s doing it in a really innovative way, what would you pick? Give me two or three stories of that.I’m a huge fan of Tipping Point. Okay. Daniel Lurie.I know that you’ve had Daniel Lurie, the founder, on the show. When I went on and I asked organizations who is your favorite funder and why, Tipping Point came up most often because of the fact that they give multi-year grants. That nonprofits don’t have to worry about whether they’re gonna get funded next year and it leads to a more honest conversation. This is a big problem in the sector. There’s no incentive to talk about failure when you have to get funded. And yet anyone from the tech sector knows that failure’s a critical part to learning and getting better.Yeah, they like to celebrate it. Right.And doing better work. And so it allows them more transparency and allows Tipping Point to then come in and help the organizations figure out how to solve the challenges that they’re having.Just for people who don’t know, Tipping Point gives money to organizations. They’re a funder of philanthropies.They are. And they’re supporting anti-poverty work in the Bay Area.Yeah, they’ve also doing that, yeah, homelessness, anti-homelessness.Yeah, and so it’s the multi-year grants, it’s the capacity-building, it’s investing in all these strategies that I talk about in “Social Startup Success,” like management training, like fundraising, like storytelling. They bring in a media coach ...Yeah, they’re good at that.Yeah, to help their nonprofits, because you know media coaching shouldn’t be something that’s just relegated to companies. I mean, this is something that nonprofits arguably need just as much. And so by investing in the nonprofits that they support, I think that ultimately they’re able to show better results. And I hope that Tipping Point will be a model that other philanthropies will learn from. And individual donors as well.Mm-hmm. What else?I am a huge fan of organizations that are thinking about how to invest in not just organizations themselves, but in, say, initiatives. Chan Zuckerberg is doing incredible work with their hospital ... Sorry, their preschool that Priscilla Chan has led, and looking at adverse childhood experiences and how they can bring their talents from the foundation to bear in this preschool that is helping kids recover from adverse childhood experiences. I’m also a huge fan of the Emerson Collective. I think that ...Laurene Jobs.Laurene Powell Jobs has done a fantastic job of not just investing in the causes that she cares about but using her voice and realizing that her voice on immigration issues is going to be equally as powerful as any money that she can give to nonprofit organizations. So you will see her in the halls of Congress, advocating for immigration reform legislation. And that is a really important role that philanthropists big and small can ...She also does a lot of artistic and social media things that have ... It’s a really interesting thing. They did a Carne y Arenas, the VR experience, they funded that. What it’s like to be an immigrant. Which I thought was very moving. Absolutely.They did this art, this photography project that got very viral where they put pictures of all the immigrants in front of Mitch McConnell’s office, like giant photographs of immigrants, just to see who they are.Amazing.And I thought that was ... Everyone’s like, “Oh it’s a waste of time.” I’m like, “No it’s not. It’s a visual representation so people can’t look away.” It’s not a waste of money.And that can be sometimes the most powerful way to change hearts and minds. Jeff Skoll has done this through participant media where he made waves with “The Inconvenient Truth,” the film that he funded on climate change and ...Mm-hmm. This is an eBay founder.Yep. And so thinking about film as a way to change the conversation can also be a really important contribution to social causes. Absolutely. Lastly, are we gonna ... Like when you think about what happened with the Facebook thing with RAICES, is that the way big funding is gonna happen from now on? These moments of boom. It happened in Haiti. It happens, you know, on Twitter, or wherever. Is that the way fundraising is going to go in the future, where there’ll be these big, large explosions of fundraising, or not?I think it is going to be one big part of the way that fundraising happens. And I think that’s really exciting. I think one thing we saw with ...Like this guy, [Andrew] Gillum, in just political fundraising. He was using a single app that really got ... It was really interesting. It was just ...Well, I think Obama and his presidential campaign really showed that a $5 contribution ...Sanders.When brought together with millions of other $5 contributions, can actually make a big difference. And that is an equalizing of philanthropy that we’re seeing that is really exciting, because it’s giving ordinary citizens the feeling that they can give back. I remember being a young professional saddled with student loan debt and feeling like I would stretch myself to make a $100 donation, and it would be a drop in the bucket. But now people can really see and touch and feel the impact of their contributions through these large donations in ways ...It also feels like a game. It feels like a “Let’s get the number.” It’s just interesting. I’ve noticed like a ton of them now.Well, I’ll gamify philanthropy any day if it helps social causes. Let’s go.So again, this is ... For these philanthropies to start doing this, they have to start thinking more innovatively. That’s essentially what you’re saying.Absolutely.They have to think innovatively and how they’re going to put their messaging out, how they’re gonna put their ... How they’re gonna create their organization, how to invest in their organization, essentially.Yeah, absolutely. But it also means that we need to be supporting nonprofits so that they can integrate some of this innovation into their work. Great. Thank you so much. This is Kathleen Kelly Janus. She’s the author of “Social Startup Success.” We’ve been talking about philanthropies and where they’re going. The book is available everywhere, correct?Absolutely everywhere.Absolutely. Thank you so much. It was great talking to you.Thanks, Kara.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}