{"id": "Why Airbnb will be worth more than Uber", "paragraph": "Last year, Airbnb raised a $1 billion round that valued it at $31 billion — a lot of money for a private company, but a distant second to Uber, which this week received proposals that could value the ride-hailing company at as much as $120 billion when it goes public in 2019.On the latest episode of Pivot with Kara Swisher and Scott Galloway, Galloway predicted that that power dynamic will get flipped, and that Airbnb will be the more valuable company in the long run. The reason, he told Swisher, is a “boring economics case” of the moats surrounding each company’s business.“Uber has incredible supply, but with $50 million, you and I could start a ride-hailing service in D.C.” Galloway said. “Because we could create local demand, and local supply.”“Airbnb has to have global demand, because if you’re coming in from Austin, it means you’re not there,” he added. “If you’re from Copenhagen, you need to have no Airbnb in Copenhagen. Whereas, Uber can have regional competitors everywhere. We’re starting to see that with Didi in China. So, the moats are tiny rivers.”Uber CEO Dara Khosrowshahi has said that the company’s long-term vision is to be the “Amazon for transportation,” connecting customers to not just cars, but also trains, buses and more. Galloway proposed an alternate way forward for the company: Become a super-smart travel agency.“I think Uber needs to become Expedia, before Expedia becomes Uber,” he said. “Uber should be: All right. I’m headed to Paris next week. I type in Paris. They know my weight class, economically. I put in the date, and I press a button, and it says, ‘Here is the entire recommended travel itinerary.’ Everything from flights to hotel.”You can listen to Pivot with Kara Swisher and Scott Galloway wherever you get your podcasts — including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a full transcript of Kara and Scott’s latest episode.Kara Swisher: Hi everyone. This is Pivot from The Vox Media Podcast Network. I’m Kara Swisher. Scott Galloway:    And I’m Scott Galloway. And here we are face to face in New York City. You know, I’d like to think that you finally decided to invest in this relationship, and that you’re here because of me. It may be about someone else. Is that it? No. No. No. Who are you here to see? Nobody. Hillary Clinton. Hillary Clinton. You’re literally running to see Hillary Clinton? I am. You have lunch or coffee with her? Yes. I’m going to see her, because we have a big interview tomorrow night at the 92nd Street Y. It’s our third interview. Yeah. It’s a charm. Third time’s a charm. You know who I’m having lunch with? Who? Not Hillary Clinton. No, Mr. Otle. Yeah. Who is that? First name Chip. Okay, who is that? I don’t know, who is that. Chipotle. Come on, that’s not very good. Oh my God! You know what? Hold on. Listen to me. Chipotle, marijuana, Netflix, Cialis ... You need to stop. You need to stop. I was just at Google ...And Vitaminwater, the five food groups. All right here’s the deal. I was just at Google, at the Google News Group, I was giving a speech among a panel thing. I was coming down in the elevator and this guy was like, “I love you and Scott. That Scott guy cracks me up. I like when you riff with him.” Nice. This guy was like a huge fan. One of my dozens and dozens of fans. The second guy listened to it while he works out. It was all guys, it was interesting. Yeah, I’m all bros. But I’m just telling you, we were, two times in one place. It was very exciting. That feels good. Thanks for that. So they like us, they really like us, at Google at least. Big stories this week, let’s go right to them. Tim Cook, the CEO of Apple, gave an impassioned speech on data privacy in Brussels. He said that Apple supports a federal privacy law in the U.S. Let’s take a listen to some of what he said. Tim Cook: Our own information, from the everyday to the deeply personal, is being weaponized against us with military efficiency. Every day, billions of dollars change hands, and countless decisions are made on the basis of our likes and dislikes, our friends and families, our relationships and conversations, our wishes and fears, our hopes and dreams. He said he supports a US Federal Privacy Law, which there’s one in California. What do you think? What do you think about this? Important speech? Yeah, well he’s got a ton of moral authority. He’s likable. I think he’s principled, but him taking a stand for privacy, is like Sergey or Sheryl taking a stand against devices that are addictive to the young male brain. It’s just, OK. It’s an attack on Google and Facebook. Yeah, it’s an attack on its competitors. Well, so what? Smart thing to do. Smart thing to do. He’s been doing it for a while. I think it’s principled, but where I think he misses the mark or loses the script, is when a terrorist uses an iPhone, the FBI says, “We’d like to get into this iPhone to see if other acts of terror are unfolding,” gets a court order and then Apple waves its middle finger in the face of the court order. I’m good with that.Oh, okay. I’m on the other side, you’re wrong. You think the government does any-All right. What if it had been a Blackberry? What if it had been a Blackberry? I don’t care. I don’t care. I like the stance. I like the stance. Okay, one of our kids doesn’t show up after school one day, and with Find Their iPhone, you’re gonna want to know-Don’t do that. Don’t bring the kids into that. Well, that’s what happens. It’s an emotional reaction. It’s an emotional reaction. Okay. No! No! They should not do that. Guess what, the government has other ways. Should they get search warrants for your house, if your spouse doesn’t show up? That’s what happens. Yes, of course. So your iPhone is more sacred than your house? Yes, but they have made a promise with the user of that phone, get it to the user of that phone, even if it’s ... I’m sorry. I’m with Tim on this one. If someone is thrown into the trunk of your Fiesta, they get a search warrant-Oh, no you’re going to do all of these things. ... Hold on. You bought into this religion where Steve Jobs is Jesus Christ and the iPhone is the cross. He’s not Jesus Christ. It is not. Here’s the deal, the government has other ways of catching... If not getting into an iPhone is the only way the government can catch a terrorist-Repository of all information. No it is not. No. It’s called intelligence, it’s called the CIA, it’s called all kinds of ways. They have lots of ways to get this information, and they-So, they shouldn’t get into my home then. They have other ways. This is the part, no. They should get into my laptop. The trade you’re making on this is so big later down the line, that it’s critically important that they have these abilities to encrypt things. I trust judges more than I trust Apple.I do not trust judges. I do not trust our government, which is shown to be ... No. No. Oh no. You’re not one of these deep state people. I’m not a deep state — oh are you kidding? No. But I do believe he’s right, you’re wrong. You’re a hundred percent wrong.I’m used to that. But here’s the deal, this speech on privacy, he did this in an interview with me where I asked him, “What would you do if you were Mark Zuckerberg?” He said, “I wouldn’t be in that situation.” Then he went to town on that issue. Yep. He was very good. You did that interview. I did that interview. Yeah. He’s been on this, and Steve Jobs was on this, too. You can look at clips of me and Walt interviewing him, same thing. They’ve been sticking to this for a long time, pre-Google, pre-Facebook, pre-anything like that, so it is a bit of an opportunity for them. Yep. Yep. And it is a religious situation going on in Silicon Valley, the tech-religious. Where people, it’s Apple essentially and Microsoft on one side and some others, who are just furious at Google and Facebook. Then at the Google and Facebook side, they think Tim is sanctimonious, and that he’s lecturing him. Yeah. I’m like, “I’m good with him doing that.” Yeah. I think it will be sort of fun if they start going after each other ... Oh they are. We had a little bit of pushback, from Sheryl and from Mark saying it was “extremely glib,” I think they’re all right. In my opinion, Apple has … it will be interesting to see if Apple holds the same mores around privacy when it comes to their app store, and as they start to get into more complex targeting. They have to be purer than ...But that’s how the world is bifurcating. You’re either wealthy and can afford a device that only pulls on your data 50 times a day, which is iOS, or you want a free phone, and you have a device that gets to pull 1,000 points a day, which is Android. Which is Mark Zuckerberg’s argument. Yeah. But I do prefer the first. I don’t think it’s a good thing, but that’s how the world is bifurcating. Yes, exactly, where you get to buy privacy, essentially. Well, advertising and targeting, especially advertising, this isn’t a new thing, have become the tax of the poor, and the technologically illiterate have to pay. Yep. It is. I bet the one thing in common with all your media is, it’s not littered with ads telling you, you have restless leg syndrome. Right? You go home on a Thursday night. You can watch Modern Family. You can download it right away on ABC.com. Mm-hmm. Or you can download it and pay three bucks from Apple TV, and most people in our cohort choose, their time is more than 18 bucks an hour, so they download, they pay three bucks for a 21-minute story. So you get the cheaper ones. Let me ask you a question, would you support this U.S. Federal Privacy Law? There’s one in California, obviously Europe has been rather stringent. I think California, once Gavin Newsom gets in power, is going to be its own country. It’s going to pass all kinds of laws. Yeah. It’s the fifth largest economy in the world. I’m in. It’s going to. I think Gavin, that’s the way he’s going. Yeah. What do you think about this U.S. Privacy Law? It makes sense probably to have it done at a federal level, such that companies don’t have to go through the friction of figuring out 50 different legislations. I am not a fan, actually, of regulation. I think the more elegant solution ... I mean, what do we want here? We want to thread the needle between curbing their influence, but at the same time, not kneecapping this incredible machine of capitalism and value creation. I think the way you do that, is by breaking them up. I think this regulation-That’s your go-to thing. Breaking them up, but go ahead. I don’t mind. It works, when has it ever failed? It’s a fair point. The problem with GDPR when you look at Europe is, I worry that it’s actually cementing the position of the leaders. The big ones, yeah. They have them lawyers ... Complexity favors the wealthy and the incumbents. The laws, regulations. This legislation is complex and expensive. There is some basic — immediately inform people, give people data transparency, give people data mobility. Notify them when they’ve been hacked. Notify them in hack. Those should, I think be law. These people are fighting immunity for too long, at the very least. That makes sense. I think we’re going to get that. I think, especially if the Democrats get into power. I just wrote about this, this internet bill of rights, and that’s one of the top 10. Do you think it should be federal? Yes, I do. Yes, I do. Yeah. If not, it’s going to be big states like California, Massachusetts, and New York, and it’s going to be federal, essentially. Is it GDPR 1.1, or is there ...No, it’s gotta be more. You can’t have the right to be forgotten here. It’s not going to happen, because of the First Amendment. There will be differences, but it should be enough that, I think the government should sit down with these companies and say, “Look, these are the rules of the road.” Or else, they’re going to lose all their immunity. They’ve had immunity for far too long around these things. Anyway, next thing, Uber. Yeah. What? 120 billion, they’re saying IPO at $120 billion. What do you think of that? Well, first off-There’s a lot of people disputing their ability to make any money. Well, let’s have some fun with this. Okay. I think Uber is an incredible product. Yes, agree. I think it’s amazing. Think about conceptually, you have a multi-trillion asset called Cars, that get 4 percent utilization. Right. So 96 percent of the time, nonutilized, figure out software. It’s literally like, “Let’s come with an app. Let’s you and me leverage the U.S. Navy.” Right. Right. It’s just staggering what they’ve been able to figure out. One of my favorite experiences, and I want to ask you, what is a cool Uber experience you had, I go to the Cannes Creativity Festival. I get off the plane, I pull up the app, I want to see a picture of a car, hit it, and I see an icon of a helicopter come up, and I’m like, “Okay, what the heck?” I press it, and it says, “Meet us at baggage claim.” They zip me off in a sprinter van. I get in this lawnmower with a rotor that looks a kid who’s up from my paper route, with a military uniform, and they fly me across the Cote d’Azur and I land in Cannes. It was for 80 euros. It was just incredible. Yeah. Uber’s changed my life. I love it. So you talk about something you love, and I’ll tell you why I think Uber is ... All right. I’m going to give you my Uber t-shirt, because when I wear it, people throw things at my head. But go ahead. It’s the best t-shirt I have. It’s soft. Well, so you know what’s also a lot of fun? If you’re ever driving up or past a crowded place, just roll your window down and go, “Uber!” And see how many people come to the car. It’s a ton of fun, and then look at them like they’re just fucking crazy, “Why are you bothering me?” Anyway, I think Uber has basically cemented-You’re a sick puppy, but anyway, go ahead. You know it. Go ahead. You know it the most. I do. I’m very aware of the situation, and we have yet to go out for drinks. Okay, so we have a caste system we’re bifurcating into a nation of 350 million serfs, serving 3 million lords, and Uber is the ultimate example of how we’ve institutionalized this. So you’re a lord, presumably? Oh yeah, because I’m fortunate. Because I had access to free education, and had a shaved head. What am I? Am I a Duke? Oh no! You’re the strong man. You’re the one that says, “It will be done!” And then next thing you know, the person has their head chopped off. All right. I have different thoughts on Uber, just because I’m furious about this Saudi thing, with the money they’ve taken, and the ...Okay, but hold on, and tell me if you disagree with this. All right. 120 billion dollars, that’s a value of-Majority thuggish, murderous, money. What, I’m sorry? That $120 billion IPO, that’s the value of Airbus, couple hundred thousand employees, middle class moms-Yeah, do you think it’s worth that? Well hold on. Give me some running room here, seriously. All right. All right. Okay. Here, I want answers. Then value of Procter & Gamble 180 thousand, more value than the entire auto industry. 12,000 employees. It will be 12,000 people and their investors are splitting 120 billion dollars, so my question is, how have they figured out a way to turn two and a half billion employees into driver partners, which means they don’t get healthcare, they’re not subject to minimum wage laws, they make on average $10.50 an hour, and they have no participation in that 120 billion dollars. My question for Dara is one thing, are you just lipstick on a pig? I like you, I think you’re nice, you’ve calmed down the waters there. But should the two and a half million people that built this company participate in the $120 billion dollar windfall? I agree. Yes. They have to. Someone was just talking about this the other day with me. But are they? No, they’re not. I don’t think they are. They have to. That would be something else. One word, union. Hey Uber “driver partners,” perhaps you should reach out to the UAW, which by the way, I’m a member of. Oh, the unions have been hollowed out, but move along. Go ahead. Okay, but let’s restore them. If I were these driver partners, I would say, “Look, we need to participate in that $120 billion windfall, or Dara, regardless of how charming and nice you are, we’re going to fuck up this IPO.”All right, another way you could do it. Again, I’m going back to Gavin Newsom. He was talking about changing the ways employers and contractors, instead of having the old way and we’re judging on those, we create whole new ways of work categories. Right. We require these companies to do things like that, or have healthcare benefits. Again, something they could do in California, which would impact Uber massively. Yeah. That’s Arun Sundararajan, my colleague, he’s done some great work about that. But how does that … ? So, at one point 25 percent of Sears was owned by the employees. The question is, how do you turn these — and by the way, if you talk to Uber drivers, fair is fair. They like it. It gives them flexibility. I know that. They have to own a piece of this thing. This is such a thing built by its drivers. Two percent of it. Right. Two point four billion dollars. That would be life changing. Instead of going to the murderous, thuggish Saudis. Two and half million drivers, that’s a thousand-I’m trying to get dismembered here. Bone saw. I feel a bone saw coming our way. I know. Murderous thugs. Anyways, a thousand dollars per driver. Two and a half billion dollars to two percent dilution. You know Dara, pony up. I’m starting to believe you have empathy. All right? Show me. Show us. I’m going to write an entire New York Times column about this, saying this. I’m on your side. Okay. You’ve convinced me of this. I’m in. But I don’t think it’s worth 120 billion dollars. You don’t think it’s worth 120 billion dollars? No, it’s ridiculous. I’ve had lots of economists and me, the breakdown. This is not Amazon. They have no moats. Well, Lyft has come out of nowhere, right? All right, so do you think they have moats? Everyone’s like, “Oh, this is like Amazon later.” Do they have ... They don’t seem-No, it’s a very boring economics case of why Airbnb will be worth more than Uber. Because Uber has incredible supply, but you and I could start ... With $50 million, you and I could start a ride hailing service in D.C.Right. Because we could create local demand, and local supply. Right. Local drivers, and local-Right, that’s what I said too. Prices. Airbnb has to have global demand, because if you’re coming in from Austin, it means you’re not there. If you’re from Copenhagen, you need to have no Airbnb in Copenhagen. 100 percent. Whereas, Uber can have regional competitors everywhere. We’re starting to see that with Didi in China. Yep. So, the moats are ... Yep. No moats. They think the brand is a moat, and they act as a moat. ... tiny rivers. Credit card. $10 billion, $20 billion, $50 billion maybe? $120?!Yeah, exactly. Having the credit card is good. What if they start, you go into the subway and then you use your Uber app to pay for it. This is what, and I want to hear what you think, but I think Uber needs to become Expedia, before Expedia becomes Uber. Uber should be: All right. I’m headed to Paris next week. I type in Paris. They know my weight class, economically. I put in the date, and I press a button, and it says, “Here is the entire recommended travel itinerary.” Everything from flights to hotel. It’s a little bit what Airbnb was trying to do, a little bit more experiences.  But go upstream and downstream, right? Yep. Sort of what Google maps does. It tells you how to get there, subway, walking et cetera. I’ve never taken advantage of how much I use Google maps. I have to say, they do offer me restaurants and things, but I don’t avail myself — it’s not in my face enough. You don’t use it for directions? I use it for directions, but I don’t use it for anything else. I see them offering me things, but it’s not in my face enough. Back to Uber, they are awash in Saudi money? I did not know that. Oh, $14 billion of their... They own a ton of it. They put in $3.5 billion just recently, and before that, they put a bunch in either through PIF or through the SoftBank fund. The SoftBank fund was the latest one, with $9.3 billion, and the Saudi’s represent half of that. My question is the following, what would have them do about that? I don’t know, but here’s what I would not want them to do. So Dara pulled out of the thing. Calls and says, “I’m pulling out of the thing,” which is fine, he obviously had to. But here’s what I didn’t appreciate, when Travis went over there and he’s like, “Hey, Kara they’re letting …” He didn’t say that directly, but Uber did this. “Hey, Kara, they’re letting women drive now.” And they have movie theaters! And they have movie theaters. I was like, “Fuck you! It’s not a favor that women can ... Oh thank you so much sir, for letting women drive!” Then they jailed the woman activist who made that happen. They jailed her for that, so she’s been in jail for years. It’s just, ugh, I’m sorry. I don’t know how they sleep at night, taking that money. I just don’t. I just don’t. But here’s the thing, should companies-They can’t give it back. ... There’s no way. And by the way, the Saudis own a lot of Snapchat, they own a lot Twitter, they did through Kingdom Holdings, whoever, and then the high net-worth individuals there, of which there are many. There’s like 150 princes or whatever, however many there are. They’re going to buy this stuff, and they can buy it in the public markets. I’m not good with that. They can buy treasuries, anything else, but anyone who takes money right now from these people going forward, to me is just awful. I hear you. Here’s the problem, as an entrepreneur, I raise a ton of money, and I’m sure I’ll raise more in the future, you’re willing to disarm, but you’re not willing to disarm unilaterally. Right. The question is, I pay 23 cents on the dollar to the government for them to think long term, and I’m fine not taking their money, as long as my competitors can’t. So I think this is really up to the government to step in and say, “You can’t have money from Saudi into this country. Freeze their asset sanctions.” Otherwise, it’s like-It’s not gonna happen. They literally killed a journalist, and Donald Trump is talking about, like it’s the media’s fault that the pipe bombs show up at CNN. Oh, I love the most recent excuse. “We drugged them, and we were going to ask him if he would go back to Saudi Arabia, and if he said no, we were gonna let him go.” They have another one. Now it’s premeditated. It’s ridiculous. It’s like the Bill Cosby of geopolitics here. This is not going to come from our government. Literally, the head of our government right now, is saying it’s the media’s fault, for the pipe bombs that were mailed to it. I just don’t even — I’m in a very angry mode today about that. But again, I’ll press back on you. All right. What do you do? You’re an entrepreneur, it’s competitive, you need low cost to capital ... You don’t take the money. ... and you let your competitors take it. You do. And you hope that your consumers-No if you want a soul, you don’t take it. If you don’t want a soul, you take it. So, you’re soulful and unemployed? Look, all the money is dirty in some fashion, but that’s particularly dirty money right now. Yeah, particularly gross. Okay. It’s particularly gross. I’m sorry, I have a soul. Wins and fails. Scott, wins this week? I had terrible wins. My first one was Invisalign. I don’t know if you noticed, but I have these trays in my mouth. Yeah. I used it. I get the sense I’m going to be gorgeous. You’re going to be gorgeous. My dentist, Craig Spodak, is the Tesla of dentistry. You’re doing an ad for Invisalign. They’re not paying us either. What’s the deal? Yeah, all right. I can’t speak or eat, and both of those things got me into trouble, so there’s a lot of benefits to Invisalign. All right. Okay. Win. My real win of the week, and just everyone must know we don’t rehearse, because you’re always like, “I gotta get out of here. I’m having tea with Boutros Boutros-Ghali or something.”No. I’m, no. So, anyways, my win of the week ... I think he died, but okay. But other than that, he’s doing really well. Okay. Other than that, he’s just fine. My win of the week is, I’ve been thinking about this probably too much, I’m going to get you out of the Fiesta. You and I are going car shopping. What? I figured out the car for you. What? Okay. The scooter, Skip scooter. No, no, no. I’m going to scooter. It’s a two thousand ... We’re going to the dealership. No, I’m not getting another car. It’s a 2011 matte black Porsche 911. No. Oh my God! Okay, hold on. Hold on. You fit all the criteria for a Porsche perfectly. Can I just tell you, just because you think I’m a lesbian, you think I like a man car? No. No. No. Lesbian wasn’t even going to come into it. You fit all the criteria. All right. Tell me. You want to hear the criteria for driving a Porsche? Okay. Okay. The first is, you’re shorter than 5’10. All right. Yes. You have to be short to drive, or short-ish to drive. Okay. I get into a Porsche, and I look like a Q-tip behind a German automobile. You have great hair. Anyone in a Porsche should have great hair. I do have great hair. I do. You have great hair. Okay, so you’re bought in on that one. All right? All right. You have money, right? Yeah. Most people who drive Porsches have really little penises, so having no penis qualifies. All right. All right. You know, Scott, we’re stopping. So sunglasses, great hair, rich, short. Boom! Porsche, there is no substitute. All right Scott. We’re going to get into other issues. I’m stopping you. If Nazi’s can build rockets, they build great sports cars. No, no, no, no. N to the O. I’m never buying another car again. Oh come on. Come on. I’m never buying another car again in my life. In my life. Porsche, there is no subset there. That is my promise. I’m never buying another car in my life, ever. Ever!You know what ... Ever. I bought my last car. It’s great to enjoy your youth once you’re old enough to really enjoy it. Buy a Porsche. I’ve bought my last car. I’m making that my fail of the week, car people, because I’m never buying a car. Let’s get to one fail. Facebook losing its Oculus founder. Oculus, the whole thing is stupid. No it’s not. Virtual reality, you bought into this? No, it is not. VR? I love VR. Oh my God. That’s going to be another, next week. VR, right up there with 3-D printing. No, VR is going to be a big thing. “Open new worlds!”Two things, I ran-What are commercial applications for VR? ... I did a VR, when I was riding a roller coaster in Hong Kong. I know, that’s a lot. Oh there’s a lot of commercial application for that. I can feel nauseous on my own.I’m just telling you, it was great. It was an amazingly fun experience. How do you measure the value of that? Then I did something in the mall, these things, I can’t remember what they’re called. Strapped the computer on my back. My kids and I had the best time. Hours of fun, with VR, in a VR environment playing with each other, doing different things. Amazing. Okay. Video games and fun stuff in malls. Yeah, exactly. So what? That’s a 500 million dollar industry. No it’s not. It’s much bigger than that. This is the biggest fail in technology. No, you’re wrong. The empathy things, I think it has not been ... What are ... empathy? Empathy, things that you want to experience, I think it’s going to be big. I’m going to go out on a limb. Well, in five years, it’s been an enormous dud, you know why? So what? Because one of our new Jesus Christ, Mark Zuckerberg, said it would “unlock new worlds.” It hasn’t unlocked anything. It could. I think it will. AR. I’m with you on AR. Okay. AR, all right.Holding up a phone to an apartment building-So he left. So you don’t think the Oculus founder, but what I’m thinking more is that, all of these leaders are leaving Facebook. That’s what I was talking about. Yeah, but I think on Oculus, it basically said the jig is up. The realized virtual reality is stupid. Oculus will probably be closed down in the next 24 months. All right. Oh, okay. We’re going to move onto predictions in a second. Okay, then let’s move onto predictions. Oculus ... Done. Is going to move ... This is your prediction, our next segment. I think Oculus is gone, in the next 24 months. It’s too bad, because ... What about Magic Leap? Well, I want to promote Magic Leap, because I live in Florida, and we only have two real unicorns down there, Chewy and Magic Leap. Mm-hmm. Chewy! I think VR is ridiculous, right up there with 3-D printing, internet of things, all of these over-hyped... Internet of things? Why is that …? What are you talking about? You only have one internet of thing, your iPhone. You don’t need to connect your blender to the internet. No you don’t, but I have Nest. You have these regulating your house, locks, things like that, sure. Yay. It’s not a small thing. Internet of things, it’s not working. All right. Okay. I think VR is an enormous dud. I think it’s already dead on arrival. All right, okay. Any other predictions? What are yours? My prediction? I think Uber is going to go public, but it’s not at that number. You think it’s a lower valuation? I do. I do. Then what would they do? I think they would use the stock to go buy a bunch of hotel and transportation companies? Yes, yes. They gotta get while the getting is good, just the way Apple did. Yeah. I agree. If they go out at that number, they better start buying things that actually fill in the blanks. There’s a lot of blanks there. What do you think happens before then? Do you think the labor force rallies or what do you think happens?  No. I think they’re wildly disorganized, and that’s an advantage to Uber.Nothing happens? I wish they would. I wish there was some great Cesar Chavez of the people of Uber, or something that would organize them. That would be great. 12,000 employees, 120 million dollars, that’s literally 10 million dollars in equity value, for every employee. We’ve never seen that in the history of corporate. I know. We’ve never seen that in America. I think they need to be part of it. I think in the Airbnb thing, he’s [CEO Brian Chesky is] trying to figure out a way to give the renters of the places equity. Yeah, some sort of equity. That’s smart. He’s trying to do that. Actually, Facebook is close. Half a trillion dollars. That’s because he’s a thoughtful, interesting man. You like him? I love him. I have a man crush. You develop crushes. No I don’t. He’s at least thinking about it! You don’t hear it from them, until you hit them over the head with a hammer. So envision this, you’re rolling down ... What’s that? The 280. That highway out there that connects San Francisco. You’re in the Porsche and in the back is Evan Spiegel rubbing your shoulders. Porsche. No, I like him. I like Evan. I’m sorry that he’s got some troubles, but I like him. All right. Scott. Yeah. I have to get out of there. Yeah I know. I’ve got to go have coffee. I know. Hillary Clinton, blah, blah, blah. No. I have to interview her, and I have a little pre-interview thing. What’s the most important question you’re going to ask the Secretary? Well it’s changed this week, because the pipe bombs and stuff like that. Yeah. I was going to talk to her about the mid-terms, obviously Russia, because she was right in my last interview about what the Russians had done, so I’m going let her take a little victory lap off that. I think the elections, the impact to the Clintons, whether they should be around. I have to ask her about her comments about Monica Lewinsky.Just order the 21-year-old giving a president a blow-job, non-abuse-of-power lunch special, and see what happens. See what happens. See what happens.We have to talk about that. But I think this thing today, these attacks on Democratic, it’s moved everything to the side. It’s a really disturbing ... and she of course was-What are your views on that though? Do you think it’s part of the coarseness of our discussion? No, it’s what happens from the coarseness of our discussion. It’s what happens, and it’s dangerous, and it’s scary. The fact that the President of the United States gets up and says what he says is appalling. I don’t even understand how someone could do that. I don’t understand how people could work for people that do that. Back to the Clinton’s, let me ask you this ... Clintons aren’t our problem. Do they keep doing what they’re doing, or do they take a victory lap and exit stage left? I have two minds. I think they should be able to do so. I think she should. I think John Kerry gets to talk, John McCain got to talk, he ran a very unsuccessful election campaign. Yeah. Men get to talk after they lose. Women have to skulk away, and put on the sackcloth and ashes, and shut up. I do get the issue around her husband and everything else, but I want her ... The things she did was say, “Women’s rights are human rights, and human rights are women’s.” Yeah. That took a lot of guts to do that, in China, back then. I want that Hillary Clinton. Well the bottom line, we probably picked the wrong Clinton for president, right? She probably should have been president. Well ... She’s this uber-confident, hard-working person. What a shock. The men got to go first. There you go, right? Scott, thanks so much. And a lasting prediction for the elections. I interviewed Rebecca Traister this morning. She wrote a book about women and rage and anger, and I’m in an angry mood today. Yeah. You’re all of those things. Today, yes I am. Anyway, I’m going to stay angry too. Thanks. Looking forward to talking to you next week. By the way, if you have questions for us on the podcast, shoot us an email at pivot@voxmedia.com. Our show is produced by Rebecca Sananes. Nishat Kurwa is Vox Media’s Executive Producer of Audio. Thanks also to Eric Johnson, and thanks for listening to Pivot from Vox Media. Join us next week, for more breakdown on all things tech and business. If you like what you heard, please subscribe on Apple Podcasts or wherever you’re listening. All right, Scott. See you next week. Thanks. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}