{"id": "The media is responsible for President Trump and it still hasn’t learned from 2016, says Rolling Stone’s Matt Taibbi", "paragraph": "Rolling Stone contributing editor Matt Taibbi’s latest book, “The Fairway,” is all about “how mass media keeps thought in bounds.” And as someone who has covered U.S. politics for the past four presidential campaigns, he’s not convinced that the media has changed in any significant way since 2016. “You’ve seen a lot of quasi-reflective changes in the media” since Trump’s election in 2016, Taibbi said on the latest Recode Media. “One thing you haven’t seen is less coverage of Trump, like we’re doing more of it and we’re more profitable than ever. And that’s because this is what sells.”“We replaced a million hours of Trump with a million hours of ‘Trump is bad,’” he added. “... We took a lot of heat during 2016 for giving him billions [of dollars worth] of free coverage and we had this fork in the road, like, are we going to cover him less, or are we going to cover in the same amount but in a different way? And then we chose Door No. 2.”So far, Taibbi told BuzzFeed’s Steven Perlberg, he’s not convinced that journalists have accepted responsibility for “dumb[ing] down the process long before Trump even ran for president,” turning presidential elections into a reality show. And they may be over-estimating their understanding of regular people who voted for Trump.“We’ve come up with a lot of explanations that are shorthand for us, but not for them,” Taibbi said. “‘All of Trump’s voters are racist and they’re all sexist and that explains everything.’ Well, that’s a big part of the picture but it’s not the whole picture.”“When we told him that his behavior was unacceptable and he should no longer be in the race after the McCain thing, he just blew it off and said, ‘I didn’t say that,’” Taibbi added. “And his followers loved that, precisely because they hated us so much.”You can listen to Recode Media wherever you get your podcasts — including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a full transcript of Steven’s conversation with Matt.Steven Perlberg: This is Recode Media from the Vox Media Podcast Network. I’m Steven Perlberg, I’m in for Peter Kafka. I’m a media and politics reporter at BuzzFeed News and I’m here in the Vox Media Studios today in New York City. Let me first say something that Peter usually says, which I’m sure you’re all familiar with. Please tell someone else about the show. Thank you very much. So today I’m really excited to be in the studio with Matt Taibbi. He’s a contributing editor at Rolling Stone. He’s the author of several books and he’s the author of a new book called “The Fairway” that he’s releasing as an email newsletter. It’s very 2018 way to release a book. Matt, welcome to Recode Media.Thanks very much for having me. So, lots to talk about, but seeing as this is a podcast that focuses on the business of media, I want it to start with your new project. You’re releasing a book and some of your writings on Substack. For our listeners who aren’t familiar with that platform, what is Substack and why did you start working with them? It’s an email subscription site where there’s all sorts of content, lots of different kinds of writers who are essentially sending out emails of content on a regular basis. And when I was approached to do this, the only room in my contract at Rolling Stone that wasn’t covered was books. So I thought that it would be really interesting to do something that I’ve always wanted to do, which was serialized books, try that out. I think in the internet age, it may be a new way for people to experiment with different kinds of content they wouldn’t otherwise get to try because we’ve always had this middleman, whether it’s a publisher at a magazine or a newspaper or the book publisher. This allows you to directly go to the reader and allows me, after decades in the business, to play around with things that I wouldn’t get to do normally. All right. And you’re sort of the ... in a little bit of a rare case where you’re like a magazine writer, but with a national profile. So you have an audience that might say, “I’m willing to pay.” And what is it, like $5 a month for your work?Exactly, yeah.The book that you’re serializing, can you describe it? Because it’s a little bit different than some of the work that you’ve done in the past? It’s fiction, right? Sure. Yeah. Well, the first one I did was called “The Business Secrets of Drug Dealing.” And this was a project that came about because I had a longtime friend, somebody I’d met in the course of my work as a journalist, who kind of came out to me after a few years as a high-level marijuana kingpin, basically. And so we sat down and tried to figure out a way that we could tell that story. Now, he’s never been arrested on a drug charge, so he had to be anonymous, and we ended up co-writing what’s essentially a fictionalized version of his adventures. This was a new kind of writing for me because what we really did is we sat down and I interviewed him over and over and over again, hundreds of hours, probably. And then we just took the best details and sort of reconfigured them into a narrative. And it was cool, it was a lot of fun, and it’s his voice. If you read the book, it comes out as him, not me.The process for you is similar to reporting, right?Oh, yeah.Some similar sort of process but different kind of form.Well, yeah, it was a different form, and then there was the additional thing where a lot of it, it really is fictionalized, which is something that was completely new for me. And that was really a collaborative process with me and this unnamed African-American drug dealer. We sat down and figured out how would it go, how would a meeting, how would a buy like this go, what would happen if you stiff this kind of person on a deal?And that was a lot of fun. And when I sat down to write it, one of the things that was really interesting to notice was that the pace of the writing was a lot faster than my own. And I’m somebody who tries to write in a way that’s very fast. So, it was a lot of fun. It was a blast to do. It was as much fun as I’ve had writing, in my career.As someone who’s so familiar with what it’s like to work at a magazine, someone who’s worked at a media startup, I think you’re seeing a lot of reporters now and different writers looking at email newsletters or at least ways to say like, “I have an audience, let me monetize it direct to my reader. I don’t trust Facebook, I don’t trust Google. I don’t trust, like, large media organizations.” What was that experience for you like? How has that been different than working in sort of the traditional media landscape? Well, first of all, your audience isn’t given, right? You have to earn it.You have to earn it. And the price point is high enough that it actually has to be pretty good material for people to stay. When I write something for Rolling Stone, X number of people are going to see it every time no matter what I do. This is different. And it’s also, you’re not writing with the same kind of immediacy that’s behind periodical journalism. Like when you are responding to something that’s in the news, people are already primed mentally for that experience because it’s already in the ether, right? There’s this feeling of, “this is in the air right now.” When you’re sending something to somebody by email once a week, right? And it doesn’t come when the event happens, but it comes on schedule and it’s something that’s more reflective. That’s a much harder thing to do.It’s kind of funny that the email newsletter has endured in the way that it has in the media business where it is still actually a pretty lucrative business model. There has been this return to the email newsletter over the past few years. That is sort of interesting and I think you see writers embracing that.I think there’s a lot of reasons for that.It pops up in your inbox, it’s for you.Right.And it’s not in your feed.You chose it and that’s a big part of what’s going on in the media that people can’t stand right now is the manipulation that goes on and what the algorithms at platforms like Facebook ... You’re walking along, you’re hanging out with your kids, and all of a sudden your phone buzzes because Facebook has decided that you need to see this equilibrium-upsetting headline about something. People actually, even though they do it, even though they do look at the headline and they do spend hours and hours and hours scrolling through stuff, there’s a part of them that hates it. And that then that wants to make the choice to pick up something the same way they used to pick up the newspaper whenever they felt like it.Right. One of the things that you’ve written about and you’ve written about for “The Fairway” on Substack, is cable news. And much like the magazine business, very much changing. But in a way, cable news is sort of more important than ever before. We have a president who is obsessed with it. Even though the industry at large is facing all these challenges like an aging population and cord cutting. How do you think cable news is handling the Trump moment? Terribly.You’ve been critical, why is that? And how?For a variety of reasons. First of all, the cable era was enormously responsible for the Trump era. Let’s start with that, right? I mean, you have to go way back in history to see all these changes. I grew up in the media and my father was a television reporter, so I watched all the different stages of change in television reporting. And the 24-hour news cycle had a profound effect on the way we cover news because now there was a new emphasis on not doing one-, two-minute hit a day on something you felt was interesting, but instead we found stories that were visually appealing and that could string people along for hours. The classic example is a baby falling down a well or a disaster or something like that. We’re like, “Oh, well, what’s gonna happen next?” And the campaign was ... it turned into a story where we trained our audiences to be like, “You can’t turn off the station because anything could happen at any given moment.” Right? Because there’s so much coverage of like a Trump rally and ...This was before Trump, even before — I’m sorry to interrupt. No, no. Even before Trump, we did so many hits about this stuff and we micro-analyzed every tiny little thing and told people that it was all important. And then Trump comes along and we had created a bad reality show. Trump was a good reality show. He was somebody who created insane, crazy, horrible drama, and we, of course, we couldn’t resist putting it on television at all hours because it was perfect. It was perfect for this — sales-wise for the medium. And the one thing that you haven’t seen since Trump has become president — and you’ve seen a lot of quasi-reflective changes in the media — one thing you haven’t seen is less coverage of Trump, like we’re doing more of it and we’re more profitable than ever. And that’s because this is what sells. Right? I mean, I remember Michelle Wolf at the White House correspondents dinner, one of the things that she said that was sort of overshadowed by the Sarah Sanders controversy was like, you should be thanking Trump, he’s...Of course.And it’s a criticism that Trump has said as well, I do think that you’re starting to see cable news executives ... This week, for instance, Fox News didn’t take either Trump rally live, they went back to it. Obviously, they’re still covering Trump, everyone is wall-to-wall, but it seems like news executives are starting to look at things like Trump rallies — which there are a lot right now, it’s ahead of the midterms — and saying like, “How much airtime, just live airtime, should we really give to this guy?” Because CNN got absolutely killed by the media press for — and a lot of people — for just kind of giving him all the free airtime during the ...Yeah, my take on that is that this is a superficial change. It’s the way I put it is, we replaced 1,000,000 hours of Trump with 1,000,000 hours of “Trump is bad.” Right.And we just took what we were doing and we added on this new thing where we’re openly against it and we’re adding this new editorial take on it. And do you think, from sort of the Russiagate perspective or just writ large?No, writ large. Trump has earned that kind of treatment by reporters and I get that, but I think that there are both commercial and ethical reasons why we’ve decided to take this switch. I think what happened after, and I wrote a lot about this and of the next chapter of “The Fairway,” it’s, we took a lot of heat during 2016 for giving him billions [of dollars worth] of free coverage and we had this fork in the road, like are we going to cover him less or are we going to cover in the same amount but in a different way. And then we chose Door No. 2, and rather than then had this reckoning after the election, like, “My God, 40 years of dumbing down the campaign process led us to this.” Instead, the new thing was, “Oh, democracy dies in darkness. We’re going to be the intrepid crusaders.” Trump like ... Come on, we brought this about, we dumbed down the process long before Trump even ran for president. And we haven’t reckoned with that. Do you think that democracy dies in darkness? Like Marty Baron likes to say, “We’re not at war, we’re at work.” There’s this sort of renaissance of traditional media right now with the Times and the Post, but in a way the Times and the Post, these traditional media outlets, feel ill-equipped to handle the Trump moment. As soon as right-wing Twitter trolls are on them, they’re like contorting in ways that they don’t understand that maybe people are operating in bad faith. What is your outlook on the traditional newspapers and how they are handling this moment? Because it’s been good for business, but at the same time it’s been fraught.  It’s been great for business, which makes me skeptical of all of these changes because I look at it in much the same way that I look at the way the Democratic Party has responded to the Trump phenomenon. After the election, there could have been this come-to-Jesus moment where we said, “Wow, how did we lose all these voters?” Right? “Let’s go back and figure out what it is about our pitch to people that isn’t working.”  And so instead of spending the last two years coming up with a New New Deal that might’ve been more appealing to ordinary people, we instead — they doubled down on “Let’s focus on Trump’s negativity. Let’s investigate and let’s do all these other things,” right? So Trump was always at the center of the picture. Whereas, I think there’s a bigger picture about what journalism’s mission is, right? Like, you’re not seeing more stories about poverty or important issues, what you’re seeing is a new twist on Trump. And that’s why I’m skeptical about all of those, because people like me have forever struggled to get certain kinds of content into the press. And it’s now even harder because everything has to have a Trump angle to it. Right. I want to read something that you wrote recently about this. You said, “People should trust reporters. It’s the context in which they’re operating that’s problematic. Now more than ever, most journalists work for giant, nihilistic corporations whose editorial decisions are skewed by a toxic mix of political and financial considerations. Unless you understand how those pressures work, it’s very difficult for a casual news consumer to gain an accurate picture of the world.” That’s sort of like what we’re talking about. But I’m curious, what is the pressure? I mean, I’m a reporter. I cover politics and media. Nobody’s telling me like, “Hey, you need to take down Trump.” I mean, that’s just not how we work. No, it doesn’t work like that. It doesn’t work like that. My mandate is to break news and write features of impact and guest-host the occasional podcast. But what do you see as the sort of perverse pressures on reporters right now? It’s drilled into you from the beginning, from the first days of you enter into the business, you just get, you learn on a sub-intellectual level to guess what kinds of stories fly and what kinds of stories don’t, right? If you want to do a 10-part series on why private equity people don’t pay a whole lot of taxes or the seven different ways that they evade taxes, it’s an important story, right? And it’s an interesting story. I keep hearing about it often, very often.But compared to any kind of story that has a Trump angle to it, it’s just not going to sell as well. All right. So this is in the back of your mind whenever you’re talking to your editors, whenever you’re thinking about what you’re going to pitch to editors, you just know that a certain kind of story is going to be met with, “Meh, yeah, maybe.” Right? And the other stories are going to be like, “Yeah, let’s do it today.” Right? How do you get to a place where that kind of journalism can be backed by a successful business model? I mean, is it something like the email newsletter business or a ProPublica-type model? Because there are important stories about poverty. I think about this all the time with, like, climate change. It seems like every year there’s one big magazine piece about climate change that goes viral and everyone’s like, “Oh my God, have you read this?” And then like nobody talks about it on Twitter for another year. And then there’s another one the next year. So there’s got to be some way people do want to read that stuff. They do want to read about poverty. They do. I’m not asking you to solve the media business here, but is there a business model that makes sense? Where you can do that kind of work, pay journalists a good wage, get people to read it and everyone’s happy. Well, that’s the million-dollar question. I think on the one hand there’s always been some kind of subsidy that has figured into journalism work. Like the original bargain of the public interest standard basically said, you can use the public airwaves to have a TV station and do TV news as long as you promise to reinvest some of your profits from your dumb stuff back into real journalism. And for a while we did that, right? And then we started to drift away from that in the ’90s. There were other subsidies that figured in. If you go back to the very beginning, we allowed newsletters to have free postage, right? Once upon a time. But in addition to that, journalists need to find strategies to kind of sneak past important content, past this problem.For ages — when I was doing the financial services stuff, I used a lot of storytelling techniques. I tried to take stories about Wall Street and create villains and heroes, recognizable faces, use wild language, metaphors, all that stuff. And that sometimes will get you past the threshold of getting people to read it.Or you need some sort of benevolent billionaire to come in and buy your publication and pump resources into it.Of course. I worked for Jann Wenner throughout this entire time. If you have an eccentric rich person, who’s willing to be like, “Yeah, sure, do that,” that’s another way to do it. It’s just not a business model that you can count on. Right. So you mentioned the financial crisis. I started reading your work — not to make you feel old or anything — in college during the financial crisis, and you came to a lot more national prominence writing about politics and the financial crisis. You famously wrote that Goldman Sachs is a “great vampire squid wrapped around the face of humanity, relentlessly jamming its blood funnel into anything that smells like money,” which became a famous famous line of yours. It’s been 10 years since the financial crisis.Yep.You wrote a story recently saying economically, nothing’s changed, and we’re still in the same situation. I wonder, since this is a media podcast, media discussion, what are the lessons that the financial press or the press learned at all from the financial crisis? Ten years on, do you see anything there? I mean, a little tiny bit, but not really. I think the big obstacle that I had with that story — and again, I was really lucky that I had editors who thought it was interesting and we got a response early to this stuff. But the reason that we got a response is because what we were doing was basically translating the kind of incomprehensible language of the financial press for ordinary people. That was essentially what it was. It was, if you pick up the Financial Times, you won’t understand what a credit default swap is.Right, what subprime mortgages are. Yeah. And Rolling Stone can kind of explain that in a way where an average reader can say, “Okay, now I get it.”Yeah, exactly. And the sort of metaphors you’re using.Right.But it’s still, you’re saying that the financial press is still unintelligible to that reader. Yeah. It’s not aimed at the ordinary person, right? If you pick up most financial outlets, and this is not their fault because that’s where their customers are, for the most part. People who are most intensely interested in ...Investors and companies and CEOs, yeah.Exactly. But there are moments when ordinary people have to learn what’s going on and we don’t have a mechanism for helping people wade through all that stuff. And I think one of the things that we found out in the financial crisis was, layers of complexity had been added to the financial world that were now beyond most ordinary readers. Like people didn’t know what a derivative was. They didn’t know how mortgages were sold, they didn’t understand securitization, they didn’t understand. Most people still think that when you get a mortgage, your bank is holding it, you know?Right.And so that’s why fallacies like “the subprime mortgage crisis was caused by the government forcing people to lend out mortgages.” That’s why that took hold, because we just didn’t have that kind of educational process going on. And unfortunately, I don’t see that there’s a lot that has changed. There’s been more interest in it. There are more blogs that have taken it on, but it’s not institutionally part of the business.Plus, media companies that might’ve done some of the toughest reporting on these matters were hit hard by the financial crisis itself. Of course, yeah.So that sort of reporting, maybe, is not there quite as much anymore. I wanted to ask something that may be a little bit more uncomfortable, but a topic that I think we should talk about. Last year during your book tour for a book you wrote called “I Can’t Breathe,” as the #MeToo movement was really picking up steam, a book that you co-wrote about your time in Russia editing The Exile, it’s an English-language newspaper, it came back in the public view. This is a book that came out, I think, in 2000, 2001.Mm-hmm.And it detailed sexual harassment and even sexual assault. And you wrote at length about this. You defended the book as satire, but you apologized for The Exile’s misogyny and you apologized for writing dumb and hurtful things. At the same time, The Exile was really about presenting the real Russia, kind of tearing down what regular foreign correspondents did in Russia. I feel like we’re at this moment now in time, the #MeToo movement, the confirmation of Brett Kavanaugh, where he’s been accused not only of sexual assault but of perhaps misrepresenting misogynous things from his past like what someone may write in a high school yearbook. And I’m wondering in this context, I know you’ve talked about it some, but have you rethought your own experience in the wake of the Brett Kavanaugh hearings? Well, I’m not trying to be a Supreme Court justice. I wouldn’t nominate me for the Supreme Court. I’m a writer, and more particularly, I’m a humorist. The Exile was a shtick. It was a gross shtick. The whole point of it was… The idea behind The Exile was we were living in this community full of American expats who were ugly Americans at their worst, right? They were there, they were completely taking advantage of a third-world country that was in chaos. They were doing blow and taking gazillions of dollars in consulting money.And our whole idea was that The Exile would be the newspaper for these people. Right? So we created this sort of gross Andrew Dice Clay-style ugly American voice of the paper. And it wasn’t real. Unfortunately, there were aspects of it that sort of became real over time. Because the paper’s advertising base was almost entirely the worst kind of nightclubs and strip clubs and brothels even. We did a lot of partying during that era, and we did a lot of drugs, and we kind of turned into the people that we were satirizing over time.Right.But the original original idea of the paper was just to be disgusting and to flout every single American convention. And so there’s a lot of stuff in there that, if you’re just picking it up cold and you’re not in that environment, it can be really jarring. I did write some stuff that was really stupid and that I wouldn’t do today, but the specific allegation from last year was that I had actually sexually harassed my employees and that kind of stuff, which was completely untrue. And if anybody had bothered to call any of the people who were named in the book, they would have figured that out quickly — and did, actually, once somebody did that. But yeah, of course I have regrets. The Exile, I regret not because, not necessarily because it was offensive to any particular group, but just because it was mean in a way that was really gratuitous and unnecessary. Like, I think when we could have done something that was closer to Spy Magazine that was just kind of like appropriately nasty, and that would’ve been good enough. But we were young and high, and it got out of hand. I mean, I think that ... caveat being we’re two white guys talking about this, but...Sure.But we are at this sort of moment where everyone is kind of rethinking what is okay, and there are all these gray areas. I think some of the things that you wrote from a more misogynist point of view, that’s what stuck with people, I think has been written about at length. I guess I was curious how you thought about what you wrote in the past in the context of, certainly not direct sexual harassment or sexual assault, but just how this stuff comes to the fore again and what sort of responsibility people should take. And not to say that you should be some sort of pariah, but like, how do you think about it? When you’re watching ...Well, you know, you can tell what I think about it by how I write now. Back then, the operating humor that we had grown up with was Sam Kinison, Bill Hicks, Richard Pryor, where everything was fair game and it was actually considered kind of a liberal position to be as disgusting as possible and to say the forbidden thing, even if you’re being offensive. You listen to Richard Pryor’s routine about like the stuttering Chinese waiter, right? You could never do that today, but when I grew up, that was supposed to be the thing that liberals were celebrating. Like, “Hey look, we’re saying the forbidden thing.” Right.That was the humor I grew up with. We tried to do a lot of that stuff. When we picked on people, we completely were unbelievably cruel about physical characteristics, whether they were men or women, but if there were women, we did it, for sure. And when I came back to the States, that went out of vogue pretty quickly. I learned a lot of things, that that was inappropriate, and I’ve completely changed the way that I do a lot of those things. But do I think that that should be disqualifying forever? No. I’m embarrassed by it, for sure, but it’s a lesson that you learn.Just sticking with the Russia, you get back and the Russia story sort of feels over, in a way, for years. And now you find yourself sort of in this group of journalists who are like accidental Russia experts who spent time in Russia, someone like a David Remnick or who ...Masha Gessen.Right, exactly. Spent time over there and then now all of a sudden, Russia is strangely the biggest story in the world. But you’ve been critical and you’ve been skeptical of a lot of the journalism surrounding the Mueller investigation and the Russia probe. And I wonder if you could describe, why is that? What do you see as the sort of problem with that?First of all, a lot of us are.Sure.A lot of us who worked during that period, even those of us who didn’t particularly like each other, people like Masha Gessen, Leonid Bershidsky over at Bloomberg, who was a colleague of mine at the Moscow Times once upon a time. A lot of us ... most all of us were vehemently anti-Putin when he came to power, but there are elements of this story that just didn’t add up for a lot of us, or that just seemed sloppily reported. My kind of moment where I was concerned about the story came very early with the release of the Steele report. I had done a lot of stories about short sellers who were shorting stock, who had used the technique very similar to what went on with the Steele report in order to sort of move the tape on stock. You hire a private company to do a negative research report, you foist it into the hands of a regulatory agency, you tip off a reporter that it’s now in the hands of the FBI or the SEC. They do a report that the company’s under investigation. Then you cash in when the stock plunges.There was an element to this with the Mueller report that just set off alarm bells for me. We’re doing a story about handing a report that we can’t verify from one intelligence person to Barack Obama or to Donald Trump. If you follow those early stories, the entire arc of the story was about the journey of that report.Yeah, and this was before, I should say, this was before I joined BuzzFeed News. When we published the dossier, I was actually in talks with Ben Smith at the time. So it was an interesting week to be talking to them about a job. I’ll bet.But yeah, that sort of defense from BuzzFeed then and now was right like that, “This document is being talked about at the highest levels of government. The president, the president-elect have been briefed on it, and we’re in this sort of new era, maybe, of journalism where our readers are smarter and can decide.” And you know, CNN had done a report saying, “There’s this document.” And BuzzFeed said, “That thing that everyone’s talking about in government and media that everyone’s seen, but you, the reader, have not, here’s what it is,” with all the caveats involved. So you’re saying that you think that was an irresponsible journalism decision that sort of set in motion this frenzy?It’s a tough ... I mean, like I couldn’t have done that story. I would’ve been scared to do that story. If somebody had said, “Here’s a report that says X, Y and Z. I can’t tell you any of the sources are, I can’t tell you where any of this information comes from, you’re just going to have to trust me that I’m a trustworthy person, and it’s serious. And so therefore, go and report that this report has traveled from a senator’s hands to the CIA,” or whatever it is. That would make me very nervous. That sets off alarm bells for me as a reporter. If there are parts of stories that I can’t confirm, I start asking questions like, “Well, why?”Right.And there’s been a ton of this that’s gone on in the Russiagate story. It doesn’t necessarily mean that I disbelieve it. You see a lot of stories where there are four unnamed intelligence sources all saying something that is totally unverifiable.Right. Do you think that ... One of the criticisms that you hear often is like all of a sudden the media, which is supposed to be deeply suspicious of intelligence sources, is perhaps overly relying on anonymous intelligence sources, maybe to their peril. So, I get that. I think that one of the things that you’ve written is that you don’t believe that there’s this collusion, but Russia certainly interfered in the election and they’re sort of bad actors. That’s what it looks like. There’s certainly more evidence for that than there is for other things. What bothers me ...Yeah, let’s pick a story that’s from the New York Times or Washington Post, like a big story that you were like, “This makes me feel uncomfortable.”Yeah. So recently we had a story that ... I’ll give you two. Okay? There was one from pretty early on where the New York Times said, “Trump campaign officials had repeat contacts with Russian intelligence.” All right? And again, it was four current and former officials, none of them named. Now, I knew and anybody who lived in Russia knew that you constantly have contact with intelligence officials there often, whether you know it or not. And the story didn’t specify whether the contract was knowing or unknowing, like what the nature of it was, but the headline was incredibly damning, right?I was very concerned about the vagueness of it, the inability to verify it. And then, sure enough, James Comey came out months later and said, “Well, that story isn’t true.” All right? And so if I’m the reporters, I’m really pissed about that, right? Like, “you burned me on this.” Right.Then later, more recently, we had a story that said, “Oh, all of our informants in Moscow have gone dark.” Now, I get that the sources in that story had to be high level.Sure.Of course they were, but how do you confirm that story? Think about it as a journalist. If you get a call, it doesn’t matter to me if the source is the head of the CIA.It’s not like you can go find those intelligence sources and confirm with them. Right? I mean, can you look at the string of cables that have suddenly ceased? You can’t, right? I even called the paper and asked about that. I said, “What’s the deal with this?”You said there’s no public editor, so I have to call myself. Right. Yeah, exactly. And so there’s lots and lots of ...Did you get a response?I did. Some of it was off the record so I can’t get into it, but the point is that there’s kind of been an epidemic of this sort of thing where you have an intelligence source telling you something and it drives the story forward, sure, but we don’t know whether we’re being made dupes or not. And there’s a whole history of us being made dupes by this particular crowd, and some of them, in some cases, by individual people.And by good reporters, right?Right.Sort of falling for that. I think that there’s been just a ton of great reporting about the Russian investigation but I think that’s a reasonable point that these are traps that papers like the Times have fallen into before. And I think that one of the big questions right now is the use of anonymous sources and the overuse of anonymous sources. I think that that’s something that all reporters think about, but when you’re dealing with this super-high-level stuff it seems completely unavoidable.Well, it’s very difficult. We all do.I’ll grant you.This podcast is on the record, though.Of course. And what do you do if a high-level intelligence source comes to you and tells you something that is very difficult to verify? Sy Hersh just wrote a memoir, right?Yeah.And he wrote something in there where ... the intelligence agencies were upset about the extent to which they had been betrayed by a Soviet spy to Israel. It was an Israeli spy who had betrayed us, I guess it was. And they invited him and showed him all the stuff that had been given to the enemy. And Hersh talked about how, “I who had always sought the secrets was now being handed the secrets.” And there is a huge huge difference in ... If you’re digging something up, that’s when you feel really confident in something. But when someone is calling you and handing you something ...Right.That’s when you know ...Someone has an axe to grind.Right.At the same time, obviously, the information could be true, but when someone hands you something they obviously have something. There’s a reason people talk to reporters.Right. And this particular community is a community that didn’t normally, will not tell you that the sky is blue if you’re outside. Right? And so all that makes me nervous. And now it could be true, but it’s a factor that ordinary people are not aware of when they read these stories.Pivoting to 2020. We got another presidential campaign that will start the day after the midterms, in earnest. It feels like things are going to get started really early this time. You’ve covered many campaigns. If you had to pick right now a campaign to embed yourself into to write your next book. It’s obvious who the Democrats are, the handful that are most certainly going to run. What campaign do you think would be interesting as a reporter to cover, not necessarily who you think’s going to win because we’ve been wrong before in that. But what is an interesting story to you in 2020?Well, I stayed away from the Sanders campaign last time because I had kind of a relationship with him. I worked with him before and I didn’t want to wade into that. But if he runs this time, I think I wanna go that route.He would sort of be the front-runner at this juncture?He could be, yeah. Because I think there’s really two stories that are going to be key in 2020. One is, will Trump be able to be a viable candidate? Will he win again? The other one is the schism that is going on in the Democratic party and the sort of fight for the party’s soul. Which to me is really an incredibly interesting story about fundraising, when you get right down to it. It’s like who’s going to pay for our fundraising efforts? And Sanders has said “We’re not going to take money from here. This other group is.” I think that’s a profound and interesting moment in our history. Are we going to finally wean ourselves off that model? I think I’d like to cover that part.And it’s going to be wild to have and it’s going to be really interesting to see how news outlets react if Trump is presumably still president during this, someone narrating the Democratic race in real time on Twitter. What does that look like? And counter-programming. Counter-programming rally for rally, maybe and it’s just going to be completely a style thing in 2020 in a way that it has never been on the Democratic side before.We should not forget that Trump was incredibly effective on using the overabundance of candidates on the Republican side to his advantage.So is Michael Avenatti gonna come in and there’s going to be 20 other “serious” Democrats and Michael Avenatti’s going to be throwing bombs at the debate and everyone going to be going wild and all of a sudden he’s the 46th President. Is it possible?It could be.Or, the rules of gravity will apply this time.I hadn’t considered that, but that’s possible. Sure, yeah, it sure looks right now like... Because what happened last time on the Democratic side was there was a backroom consensus that we’re not going to have a whole bunch of people competing for the pie. The fundraising pie. This time that’s not happening. A whole bunch of people are jumping in, it’s a free-for-all.You’ll get Howard Schultz, you’ll get the Rock, you’ll get Mark Cuban.Right. Yeah. No, exactly, yeah, it could be all kinds of people. And that tends to be to the detriment of the party because you see all the worst aspects of all these people come out. That’s what happened with the clown car episode last time. They all looked ridiculous and Trump took massive advantage of that. Because he was the only real reality star in that crew of idiots. He just came out looking much better than all of them.Has the media learned anything from 2016 — I mean, it’s obviously not a monolith — that they will take into 2020 in terms of how to cover someone like an Avenatti? The sort of “why not me” candidates or just the circus of it all? Or are we just going to keep plugging along like we do?I doubt it, because for me the huge lesson that should’ve been learned in 2016 was that we had become way too cut off from the population, right? And I knew this from having covered many campaigns before that there is a bubble, that is real. You’re literally walled off from the rest of the people when you’re on the campaign trail. The Secret Service doesn’t let you out, you’re like in a prison together.I remember covering the Obama campaign, coming on the plane and seeing on the press section walls of the plane, each person had posed with the candidate like a yearbook style picture. And I like Barack Obama, but wow, that’s a really bad look for us. We were supposed to be kind of separate. Trump apparently with reporters in the White House, insists on it.Really?Yeah. Probably to have leverage over them.Like as a blackmail picture?Right. “No, you’re taking the picture with me.” I’ve had White House reporters tell me this.That is really funny. That’s a good move. Excellent. Excellent. But the fact that people completely blew off Trump’s chances despite the fact that he was packing these huge Wrestlemania-style arenas showed how completely out of touch we were. And it showed it that we no longer had a sense of what is important to a lot of voters. And I think what happened in the postmortems was, we’ve come up with a lot of explanations that are shorthand for us, but not for them. “All of Trump’s voters are racist and they’re all sexist and that explains everything.” Well, that’s a big part of the picture but it’s not the whole picture. It doesn’t explain the failure of the other candidates as much. It doesn’t explain the dissatisfaction the people felt before Trump even entered the race. So I don’t see that that problem has changed a whole lot.And I think what one of the things you’ll see in 2020 is if candidates on the Democratic side are going to take any cues from Trump, and antipathy towards the media is going to be one of them, right?Oh yeah.And I think you’ll see this sort of insurgent, “Breitbart of the left” has become a little bit of a cliché. But even the Intercept — which is a company where you used to work at — you’ll see these sites be really aggressively covering the soul of the Democratic party fight that you were talking about in a way that will change the media landscape. It’s something that I think about as a media reporter that I think is going to be really interesting.Yeah, I remember covering Howard Dean when he first became a phenomenon, he had this sort of “I’ll introduce myself to you” tour that he called the Grassroots Express. Where he invited everybody from all the biggest news companies on a plane trip around America. It was like this weird road trip and all of the big elite newspapers and TV networks sent representatives and they spent the entire time asking him questions like, “Are you too left to be president? Are you too much of an intellectual to be president? Are you too anti-war to be president?” So they’re really telling him basically ...Is that you’re all those things.Yeah, you’re all those things and if you want to be president you’re going to have to move a little bit in this direction. ‘Cause that’s how the press corps rolls. We sort of tell you what presidential is and people try to fit into that.But when Donald Trump is president maybe that gets upended a bit because presidential … the definition has changed.Sure! That was a huge factor last time because Trump completely defied all those orders that we usually give to candidates. We tell them straight up, “You can’t do this, you can’t do that.” We’re going to call you “fringe” unless you do this. We’re going to call you “bookish” or “professorial” if you do this. And Trump just crapped all over it, and when we told him that his behavior was unacceptable and he should no longer be in the race after the McCain thing, he just blew it off and said, “I didn’t say that.” And his followers loved that, precisely because they hated us so much. And that was the part that the press corps never caught on to is that he was ...There’s a wing of the Democratic party base that is deeply suspicious of the mainstream media, in maybe the exact same way that the Trump base is. And so I think that’s gonna be maybe a rude awakening for some members of the press that they thought this wing of American life still trusted them, but doesn’t.No. And again, it’s because for the most part, you can do this job without talking to people. This is an insight that I’ve unfortunately had to learn over the course of ... this is going to now be my fifth presidential campaign. You’re hanging out in the plane, you’re traveling from city to city, you don’t talk to anybody. You’re getting scoops from the process, horse race scoops from the comms person. Something that you don’t have to go out and talk to the ...Right! It’s in the hotel. You go from the event to the hotel and that night at the hotel, over a couple of highballs, you sit down and they say, “Oh, here is what the numbers show.” And that’s the journalism. And where the reality is, where if you want the real story, show up at the city two days in advance. Hang out in the opium recovery ward and find out what people are really thinking. They hate us. They hate that whole show. And that was a huge factor in what Trump was doing. Trump was basically doing a barnstorming tour that was anti-elite. And to those people, a reporter who makes $180,000 is elite and Trump isn’t. Which is odd but there is an element that’s real to it.All right, we are going to have to wrap up things there. Thanks, Matt, so much for coming on the podcast.No, thank you for having me on.I really appreciate it. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}