{"id": "The exec who built Snapchat Discover is leaving the company", "paragraph": "Nick Bell, Snap’s VP of content and the guy who built Snapchat’s Discover section, is leaving the company. Bell, who has worked at Snap for more than four years, announced his departure internally on Monday morning. “After nearly 5 years and a once in a lifetime ride, I have let Evan know that I am leaving Snap to take some time off to recharge before deciding on my next adventure,” he said in an email to colleagues. Cheddar first broke the news. Bell was responsible for all of Snap’s content and partnerships, which included deals for original video and stories that appear in Snapchat’s Discover section. Snap has a number of deals in place with high-profile publishers like ESPN, the Daily Mail, NBC and the NFL, and is also working on a slate of new original shows exclusive to Snapchat. Discover certainly has its flaws — a lot of the content has felt very racy and tabloid-y in recent years — but Snapchat and some publishers still make money from the deals. Bell was on the Recode Media podcast last month, and we asked if he was planning to stick around for a while. “I will be at Snap as long as I feel super excited about the company and as long as I feel super excited about what I’m doing day to day,” he said. “And right now, you know, we’ve talked about some of that stuff today. Right now I’m having a blast and I’m excited about this stuff we’re launching towards the end of this year.”Of course, that’s the kind of thing people say when they aren’t ready to announce that they’re leaving their job. But it still creates some awkward questions. Is he no longer “super excited” about what Snap is doing on the content side? If not, why not? And what happened in the past month to change that?There is one theory. In his four-plus years at Snap, Bell has reported to CEO Evan Spiegel. But Snap just brought in two new executives to replace the recently departed Imran Khan, Spiegel’s No. 2. One of those execs, Jared Grusd, is Snap’s new chief strategy officer overseeing all partnerships and content. Bell was likely going to report to Grusd, not Spiegel, moving forward.On the other hand, discussions that Bell might be leaving had been going around the media industry for months. He was heavily involved in bringing Grusd to Snapchat, according to a source, so it’s possible that Grusd was always intended to be Bell’s replacement. Why they couldn’t just say that when Grusd joined, I don’t know.Either way, Bell leaves at a time of transition for Snap’s executive team, and there’s no denying that he lived through four-plus roller-coaster years at the company. “We are so grateful for Nick and everything he has built at Snap,” Spiegel said in a statement provided to Recode. “It has been an incredible journey that began with our vision for what content could be on mobile. Today, more people are watching more premium content on Snap than ever before, and we couldn’t be more excited about the momentum we are seeing with Snap Originals. We will miss Nick, and we wish him all the best.”Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}