{"id": "Recode Daily: Twitter earnings, Why the stock market is falling", "paragraph": "Twitter lost nine million users last quarter, but as expected, it’s framing that as a good thing. The company has been focused on cleaning up its service — specifically bots, spammy and malicious accounts — and says it made some progress there this past quarter, including reducing how many of those accounts can sign up in the first place. Twitter’s business, meanwhile, is growing: The company reported $758 million of third-quarter revenue, representing 29 percent year-over-year growth. And Twitter is now consistently profitable — adjusted operating earnings reached $295 million, up 43 percent. Shares are up about 13 percent in pre-market trading. More to come at Recode. [Earnings release]Also reporting financial results today: Alphabet, Amazon and Comcast.[Want to get the Recode Daily in your inbox? Subscribe here.]  Tesla reported an unexpected $312 million profit for the third quarter — in spite of CEO Elon Musk’s recent antics — thanks to a surge in production and sales of its Model 3 sedan. Microsoft’s first-quarter revenue was up 19 percent over the previous year, to $29.1 billion; its net income rose 34 percent, to $8.8 billion. And AT&T’s stock fell 8 percentafter the company reported a net loss of 359,000 DirecTV satellite subscribers last quarter. Meanwhile, the tech-heavy Nasdaq Composite Index plunged 4.4 percent, its biggest single-day slide since August 2011, and Wall Street’s so-called “fear gauge,” the CBOE Volatility Index, is at 25, the highest it has been since the market swoon earlier this year. Here’s why the stock market is falling, and looks likely to stay down for the rest of the year.Law enforcement agencies are investigating after pipe bombs were found addressed to former President Barack Obama, former Secretary of State Hillary Clinton, billionaire philanthropist George Soros, former Attorney General Eric Holder, Rep. Maxine Waters (D-Calif.) and Rep. Debbie Wasserman Schultz (D-Fla.). Manhattan’s Time Warner Center was evacuated when a suspicious package intended for former CIA director John Brennan was delivered to CNN’s offices there. President Donald Trump responded to the news by condemning “acts or threats of political violence” and calling for unity. [William K. Rashbaum / The New York Times]When Trump calls old friends on one of his iPhones, Chinese and Russian spies are often eavesdropping. Trump’s aides have repeatedly warned him that his cellphone calls are not secure, and have tried to pressure him into using his secure White House landline, but he has still refused to give up his iPhones. White House officials say they can only hope he refrains from discussing classified information when he is on them. [Matthew Rosenberg and Maggie Haberman / The New York Times]Movie studios are digitally preserving their stars for future cinematic resurrection. Samuel L. Jackson, 69, will appear as a much younger version of Nick Fury when “Captain Marvel” hits screens next year. And since the late Carrie Fisher recently appeared in “Rogue One: A Star Wars Story,” the blockbuster franchise is now digitally scanning all its leads to create 3-D replicas. Here’s how visual-effects companies like Digital Domain — which created the Tupac hologram at Coachella — capture famous faces from every conceivable angle for digital recreation. Meanwhile, people are dying to get into Disney World — the theme park has become a favorite spot to scatter family ashes. [Erin Winick / MIT Technology Review]A single ticket sold in South Carolina won the Mega Millions lottery jackpot, which had metastasized to $1.5 billion. It’s the largest US jackpot won by a single ticket, and it’s the nation’s second-largest jackpot ever, just short of a $1.586 billion Powerball prize split by three tickets in January 2016. Now the big question is: Who won? [Jason Hanna and Faith Karimi / CNN]Why Silicon Valley investors just can’t quit Saudi money. People talk about money from “the Saudis.” But it’s not that simple. And who exactly are “the Saudis,” anyway? [Theodore Schleifer]One way to track the rise of tech — check the expense reports. Amazon, Uber and Lyft are among the Top 10 most frequently expensed U.S. vendors this quarter. [Rani Molla]Snap hired two new executives to replace departing Imran Khan, CEO Evan Spiegel’s right-hand man. One of the new hires is from Amazon — the third former Amazon exec Snap has hired this year. [Kurt Wagner]Taking a page from YouTube, Snap VP Nick Bell wants to find the next generation of media stars. Celebrities are only interesting some of the time, Bell said on the latest episode of Recode Media. [Kurt Wagner]We want candy.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}