{"id": "Unlike some athletes, former NFL star Maurice Jones-Drew doesn’t want to be a venture capitalist", "paragraph": "When he moved home to the San Francisco Bay Area for his final season in the NFL, Maurice Jones-Drew was thinking about playing football in front of his family — not turning himself into a big investor after he retired from the League.“My grandpa always used to always tell me, ‘Dude, you’re a football player,’” Jones-Drew said on the latest episode of Recode Media. “‘You’re not an engineer. You’re not an investor. You’re none of this. Your whole life, you’ve played football. You went to college, let’s be honest, you went to UCLA, got a good education, but you went to play football, so be a football player.’”Jones-Drew has made some tech investments, including in a VR company based near where he grew up, but these days he devotes most of his energy to analyzing football on the NFL Network and providing color commentary for the Los Angeles Rams’ games. If he wanted to become a venture capitalist, though, he’d fit the profile. Several NBA players — including former Lakers star Kobe Bryant, current Houston Rockets player Carmelo Anthony and the Golden State Warriors’ Kevin Durant — have all started tech investing funds, as has former San Francisco 49ers coach Joe Montana. But for Jones-Drew, a visit to the offices of Sequoia Capital in Menlo Park convinced him that he’s not cut out for the VC life.“My concern with the investing is that it’s such a low hit rate that it scares me,” he told Recode’s Kurt Wagner. “I’m real soft when it comes to that. I grew up with no money, so it’s like, I got money, I’m gonna try to keep it as long as I can. But they were talking about how they try to hit it like a 20 percent, 30 percent rate. If they hit, then they’re happy.”You can listen to Recode Media wherever you get your podcasts — including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a full transcript of Kurt’s conversation with Maurice.Kurt Wagner: We are here in LA at NFL Network studios. I’m with Maurice Jones-Drew, former Pro Bowler, NFL running back. Welcome to Recode Media.Maurice Jones-Drew: Thank you guys for having me. Yeah. MJD, I think you said is okay?It’s perfectly fine. Okay, good. We’re going to go with that. Welcome to the show. I was actually a little surprised that you were available now because it’s Monday and “Monday Night Football” starts in like less than three hours. I don’t know what a typical Monday is like around here, I imagine it’s kind of chaos these last couple days? What’s it like during the season? It’s really not too bad on Mondays, it’s more recap.Okay. Kind of looking over what happened on Sunday or Thursday. For me, it’s my longest day because I do fantasy. I tape early in the mornings at 8:00 and then go all the way to about noon, then I get a two-hour break and then I come back, write a couple articles and get ready to do Monday night end game.So you’re writing, on top of being on ...Oh yeah. You got to try to touch everything, do podcasts as well. So I try to do a little bit of everything. And respect because as someone who writes as well, I can tell you it can be very time-consuming. I didn’t say in the intro but you are now a network analyst for NFL Network. You also do the Los Angeles Rams play by play — or sorry, color commentary. Color, yes. Tell me if you will, obviously it’s kind of become common for ... Everyone who is a color analyst today is usually a former player. How does that process actually work?I think mine was much different. It’s weird, the Rams just called my agent and was like, “Hey, we want to try Maurice out. If he wants to do it, you know, come and do it.” I was like, “All right, cool, never did it before,” and they were like, “Oh don’t worry about it, we want ours to have a different flow to it than the normal, traditional way.” And if you listen to our broadcast, it has a little bit of slang in there, a little different, much more, I guess, millennial, where we try to reach a younger crowd. Because the Rams, they do have an older crowd, but we have a lot of younger people that are joining up. Youngest coach in the NFL, right? Head coach?Yeah. Much younger than me, which is nice. Yeah. He’s what 31, 32?I think he just turned 32, maybe. I don’t remember exactly but it’s just a different feel, and they wanted that because we’re in LA and LA is a different vibe than most cities. So it was nice. The first couple times, I was horrible. God awful, pretty much.Was that something that you figured out on your own or did someone pull you aside and be like, “Hey man, you’re pretty bad”? No, no. I knew I was bad and I kind of went in there like, I’m just trying to figure this out. But I have a great play-by-play guy, JB Long, who has done this a bunch and he’s worked with a ton of people and it was really just getting comfortable with him, understanding him, and knowing what he’s going to do and kind of learning him a little bit. After, I want to say maybe a couple weeks, six weeks or so, we were able to kind of find our groove and we just started to grow after that. It was funny, he took me to the side before one game and was like, “Let’s go work out together,” and we went and worked out and we talked about a lot of different things. Nothing about the game. And it made it easier for me because now this is not necessarily a coworker of mine, this is like a friend of mine. Sure. We were just trying to move forward and so it was nice to have a guy who’s been in this business, had done a ton of those things and to get advice from different people throughout the way. A lot of it, JB was just kind of like, “Be yourself, say what you say, if you ever get stuck look at me, I’ll coach you through it and then we’ll be good.” And from then on out, this is year three and we’ve been having a ball since. Yeah. It’s a tough job for sure, and people are supercritical online, as I’m sure you have learned. What is something that maybe surprised you as a former player, once you’re in the booth? Was there something that maybe you thought was going to be super easy or that was actually way harder than expected?Well, everything about broadcasting is about timing. So podcasts, you have hours and you can have sometimes you have segments that are minutes: Three, four, five minutes you can speak. When you’re doing play by play or color, it’s literally 15 seconds. Yeah.You form an idea or thought of what you just saw and then be able to spit it out quickly and then you have to get it out because then JB has to get in to describe the next play. That was all timing. And some of these teams, like you’ll play ... Our first game was on Monday night against the Niners and Chip Kelly. No pressure. Right. And then literally, they’re on the ball in two seconds and they’re just going fast. So it was crazy but it was a lot of fun learning and understanding it. And now I have kind of my flow on what I feel and what I’m comfortable with, as well as what JB’s comfortable with, and we’ve been able to kind of work together to make our own music, in a way. Yeah. And it works well for us. I think I read somewhere that in order to become even a TV personality ... There’s some kind of training I imagine that you go through, I think I read something ... am I making this up? No. My road was different, so let me say that. Okay, yeah. What was your road? Maybe that’s what I read about. So my road was, in college I had a teacher, we all kind of took remedial English when we first got there. You had to pass the class and they can move you on to different places. And this is at UCLA?At UCLA, yes. I went to all-boys Catholic [school] so I knew how to write and do all the different things. There were some kids that I went to school with that didn’t know some of the basic principles of writing. The teacher saw that I was kind of advanced in those situations and she was like, “Well, you know what? Let’s have you speak in front of your peers.” Learn to speak, right? You all play ball, you all have to be able to speak in front of the media and enunciate your words and not have this southern dialect. Sure. We had some guys from New Orleans with a different dialect that you could barely understand, some swamp people-type stuff. She told us that the hardest thing you can do was speak in front of your peers, like people that you know. Yeah.So every week, I’d have to write something and then be able to regurgitate it in front of my boys and they’d be throwing stuff at me or talking trash or laughing if I messed up. And it made me more comfortable because if I can do it in front of them, if I don’t know you it’s much easier. So when I got out of that, I actually got drafted to Jacksonville a couple years later. In Jacksonville, I had a radio show that I was able to practice and learn the arts of radio, which is completely different than TV. While you were playing, by the way. Yeah, while I was playing. Which is rare, right? I do not see a lot of players hold a regular radio show, TV show ...I have to give credit to my agent, Adisa Bakari, who kind of pushed me in that direction as well. So I had a radio ... and you have to answer the tough questions, which I felt comfortable answering those tough questions. There was a time where we were in the playoffs and a guy dropped a pass and people were like, “Oh if he didn’t ...” I’m like look, it’s easy to sit on your couch and say you would have caught that, right? Sure. But in the moment ... and I learned how to defend my teammates but also be critical in certain situations and still be honest. So doing TV and radio for two or three years, I did that. And then there was a play, we were playing the Jets, I took a knee on the goal line and thanked all my fantasy owners and then got a radio gig with the Sirius XM. Which for 10 years or eight years I had that, which went really well. Which also seems rare to me because I always feel like people or players, they don’t love the fantasy thing. They don’t love people coming up to them and being like, “Hey! You’re on my fantasy team!” but you’re kind of leaning into that whole thing. Yeah, it didn’t bother me. At the end of the day, it was a way for me and my buddies to still be able to communicate. Because I was on the east coast, they were on the west coast, right? So that was a way for us to keep our communication going and be able to talk and it forced us all to have a group chat and all this different stuff with it. It was nice. At the end of the day, people just want to compete anyway, so I saw it as such. Some guys didn’t like it which is understandable. So, you don’t have to. But I embraced it and enjoyed it and that’s what really opened the door to where I am now. I had Sirius XM for I want to say six years while I was playing, or seven years while I was playing and then a year or two after, and we just finished that up because I took the Rams job and so I couldn’t do both. It was just too much on my plate with NFL Network. Yeah. All those things are reps. Right. At the end of the day, just repping how to talk, how to do certain things, taking certain classes when I needed to, doing improv, which helps out a lot, right? Yeah.Be able to think on your toes, which helps out in some of these situations. Do you still do improv? Not as much. I just watch movies. Do you want to announce when your next improv show is ...Yeah, right. I wish. So all of us can come cheer you on. It would be funny. It was funny, a lot of people here didn’t know I did improv, well, I took a couple classes. And for the most part, I’ve always done improv because I’d go out with my boys and we’d always make stuff up that you have to kind of go with it. I did it for the network one time and people didn’t know I could do it. It worked out well but you always try and perfect your craft. I think that’s always a key, just like at running back, I always was training and watching and studying other people to figure out how to perfect my craft. I do the same here. Where I go to different classes, listen to different people speak, do a little public speaking sometimes which is pretty tough, and you just learn that each different type of speaking or broadcasting has a certain lane that you have to follow. I’ve just kind of taken that and followed those rules and just put my own spin on it and here I am. One of the things that I’m always both impressed by and also kind of makes me cringe is the former players who go out and have no problem being critical of your former teammates or current players. And I know that’s part of the job, right? You are there to analyze. But how do you get comfortable with the idea of criticizing people, since you’ve been in that scenario before? If you drop a pass, it’s simple to say, you have to catch that pass, right? Sure. And that’s where I kind of keep it. I don’t really go into the personal, or like “this guy is a bad person,” I don’t go there. I think when players do that, that’s more of someone, a producer or someone in their ear trying to rile them up to go try to get them to attack people. At the end of the day, we are about clicks and getting people to watch and ratings ...Yeah. It’s a media ...It’s a media deal. I try not to do that because I have relationships in the NFL that I hold in high regard and are dear to me. So the players that I do know, or like the Rams for example, I’m always on the bus with them, I always talk to them. If there’s a time where I need to be critical, I’ll be critical, but it won’t be like, “This guy is bad, oh this guy needs to make a play.” Yeah. It’s very simple, you could reword it. I think some guys, they just go out there and attack guys. For example, with the whole Le’Veon Bell situation ...Sure. There were some people that were like, “Oh he’s selfish, he’s this, he’s that.” And just for people who maybe aren’t familiar, he has a contract, but he’s holding out. Well that’s the paternal — He’s on the franchise tag, which unless you sign it, you have a contract. If you don’t sign it, you don’t have a contract. Correct. So right now he just doesn’t have a contract. The Steelers have his rights, so if he does decide to come back or when he decides to come back, he has to play for the Pittsburgh Steelers. But he doesn’t have a contract, so he’s not holding out, he’s just not working right now. Got it. So some players were calling him selfish and saying different things. And my response to that is, you know, Le’Veon Bell has been one of the top running backs in this league for the last four or five years, consistently. Yes he’s had some off-the-field issues, and young players, when you get money in your pockets, most do. But they need to compensate him a certain way, they need to pay him for his worth and what he’s been able to do. And for players to go out and speak on that, that’s selfish on their part because Le’Veon was all for you when it’s your turn to get paid, right, and those type of things. Some former guys came out and were like, “Oh if I was in the locker room, I would do this.” And I know them dudes, you wouldn’t do any of that, right? So stop trying to make yourself bigger than what it is. Just be honest. I think honesty is the key in the media. At the end of the day, if you’re honest and don’t try to fabricate and try to make, “Oh I would have said this in the locker room,” like no, you wouldn’t have. You’re talking about a guy and his money and his family, you’re not ever going to cross that line, period, if he’s there or he’s not there. I think that was one of the big issues that you see in the media. Some players, they may think a certain way, but in all actuality they wouldn’t do that in real life, right? They’re just saying what they think because they’re so far away from it. Do players ever come up to you if you do say something critical? Are they listening?Oh, yeah. They go back and listen to the broadcast or something?Yeah. So Le’Veon and I have the same agent and there was a time where I said, you know, he needs to pick his game up a little bit. And I got a text ...You got a phone call from ...I got a text and a phone call and I explained to him, you know, look, that’s my point of view. I’m looking outside-in. You know what’s going on inside the building, I don’t. Yeah. But I wasn’t too critical, I was like hey, he needs to do certain things, he needs to just do this and that. And I get it because I played and you don’t want people to tell you what you’re supposed to do. But I explained to him, look, I have a job to do and I always have what you’re doing in your best interest, I’m always in your best interest. I still have to do my job, right? Right. And if I see a play where I think you messed up, I’m going to say it, period. Yeah. I’m curious, given how not only your current role but how long you’ve been following the media industry, what do you think of, where are we headed right now with the NFL and television? I think it was last year or two years ago, the ratings were down and it was like oh, is it Trump or ... Don’t believe it. Well this year, they’re back up, right? Yeah, yeah. Don’t believe in none of that. When you’re the big dog and your business is worth close to 11, 12 billion dollars, whatever it is, and everyone’s trying to catch you, everyone’s going to do everything, right? Sure. Now, granted, the ratings were down and normally they’re down every year during an election year. Right. This was a big one because it was Trump and all that stuff. Yeah. It was Trump and Hillary and it was a lot of stuff going on, yeah, so that happens. But the money never changed. And that’s what people have to realize, the ratings can go down, but as long as the money is going up that’s all that matters. I think obviously with Colin Kaepernick and his situation and taking a knee and all that, America split. Some people aren’t watching because Colin’s still not playing. Some people aren’t watching because players are taking a knee. At the end of the day, stadiums are still being sold out. TV, the most-watched games are NFL on TV, period, right? Yeah.I’m a big “Game of Thrones” person, love it. They still have more people watch Sunday night games and Thursday night games when there’s a great matchup than they do anything else. And football will always be that way. It’s America’s pastime. It’s America’s game. And I think once people get out their feelings and quit taking stuff personal and just quit being emotional and understand the message from both sides — specifically, Colin Kaepernick’s message that people aren’t being treated fairly in this country and that needs to change — I think football will go back to being great and that’s what it’s about. What do you think about the kneeling thing? Do you have any strong opinion one way or the other? I protested when I played, over the same thing. We were in Green Bay, I was in Oakland, I scored and I did the hands up don’t shoot. And at the time, I was raising three black boys, where I’m going to have to tell them how to act when you get pulled over, and I don’t think that’s okay. The same conversation my grandfather had with my mother and my uncles, that my mother and uncles had with me, I’m going to have to have with my boys. That’s four generations of teaching people how to act when you get pulled over. A lot of people don’t have to do that. And so I’ve definitely spoken about that a ton when I was playing and I still do now, about how I have to raise my kids, regardless of where I live, right? Regardless of how much money I make, and we’ve seen that with Lebron, you still have to act a certain way because of the way I look. And I think that’s wrong. And obviously Trump has come out and said some things and done some things and people have reacted to it, but at the end of the day, innocent people are dying every day from people who are supposed to protect and serve us, and that’s not okay. We’re not saying that every person is wrong and we’re not saying that every police officer is bad, because they’re not. My brother-in-law is a cop and he’s a good one. I know a bunch of cops are on my ... I coach youth football, I have two cops on my coaching staff, they’re good cops. But there’s the few bad apples in those situations that make it bad for everybody. Yeah. And so those are the things that Colin Kaepernick and everyone that’s fighting this, this social injustice, are trying to fix. Like change, reform these things and make it different. And when you try to change a structure of a country that’s been running a certain way for a long time, you’re going to get a ton of backlash. And that was understood. It feels new, even though to your point, you were doing something similar when you were a player, different way of expressing it, but the same idea. I guess I’m curious, you mentioned how this can impact maybe people watching football or not watching football, do you see this as the kind of thing that we’re going to still be talking about in a couple years or is this going to be the norm?I don’t think it’ll be the norm. I think again it’s kind of changed a little bit, the narrative, because players were kneeling in the beginning — well, Colin was kneeling in the beginning — because he wanted to change some things. And those things are starting to happen, don’t get me wrong, they’re starting to happen. But now, players are kneeling because he’s not allowed to play the game anymore. He feels as if teams have — which I feel a certain way about it as well — but I feel like he’s better than a lot of quarterbacks that are starting right now in the NFL and he should be in there. But these owners and teams have a right to pick who they want to do, and he has a right to go after the league for that. I think that’s what the kneeling is about now. You still have players going out, going on police rides, trying to get the police and community to get back together. Those are important things that ... This is why it all started. Had nothing to do with the national anthem. Yeah.Had nothing to do with the veterans. Granted, that’s the narrative that people spin to, but Colin made it really clear in the very beginning, and rightfully so. At the end of the day, people just want to be able to live their life not with fear. And right now, we’re working towards that goal, but we still have a long ways to go. Yeah. What’d you think of the Nike campaign?I love the Nike campaign. I thought it was awesome. I feel like it showed that he is different and it’s okay to be different. It’s so funny. It’s easy for someone that’s not in your shoes to say, “I would do that,” or, “I wouldn’t do that,” right? Sure.But unless you’re in that position, you really don’t know what you would do. I feel it’s wrong for a lot of people to criticize players for not standing behind Colin Kaepernick, because they have families that they have to feed and that’s where they make money. It is what it is. Colin knew going into it that this was a possibility and he still did that, and I applaud him for that. Yeah. For Nike to jump on and stay with him throughout this whole process, who’s one of the bigger sponsors of the NFL, it’s huge to show that you know what, at the end of the day, we are going to be on the right side of history. I think that’s a statement that, for a company like Nike to step up, shows other companies that you can do it, which other companies have tried to follow off as well. I want to get your opinion about futuristic technologies. Where do you think we’re going to be watching a football game in five years? Is it still going to be traditional TV?It’s starting to change now where you’re watching on your phones and stuff, which is awesome, because everyone’s on the go. It’s weird the way things are starting to change. It’s a different dynamic now where Sundays used to be the day that you and your family would hang out and watch games together and do the family deal, where now most people are on the go, trying to go somewhere, are always on their phones, so you get a chance to consume it that way. There’s also a lot of football, and I’m a big football fan, but by Sunday evening ...You’re drained, yo. I could be very well drained from football, especially I also like college football, so it’s ...You’re getting everything. Add another day of the week in there. I had an opportunity to, a couple years ago when I first retired, to invest in a VR company. What’s it called?It was called RAD3. Okay. “It was called.” Does that mean it’s not around?I mean, I don’t know if it’s still called that or not. Yeah, got it. I know VR’s where they’re still in. I know they have a VR arcade in Walnut Creek, so if you wanted to go check it out, it’s pretty dope. Check it out, okay. Myself and a high school teammate of mine who played for the Patriots started a game with them called Dime Time, and it was a game to teach young kids how to play quarterback, without playing quarterback. Sure. So, teaching you how to go through your reads and teaching you different concepts and teaching you what coverages look like, by animation. It was like a video game. I could see the game going that way. I could see the whole ... They can experience ... that commercial they had where you put the thing on and you do what Michael ... I could see those things happening.But at the end of the day, it’ll be hard to consume it being in the game because the game is so fast. It’ll be crazy for people. Some people get nauseous from it. Some people just wouldn’t understand it. You always need that bird’s-eye view, and I think the television companies were doing a great job with that and then the production of it, so I think iPhones or Samsungs or whatever mobile device you have will be the way that people will ...You’ll still have TVs. You’ll still have Apple TV, all those different things, but I still think cable and DirecTV will still be around. Yeah.I have people telling me like, “In three years, DirecTV will never be around.” I’m like, “Mm, I don’t think so, bro.”I get a lot of young people don’t pay for cable and they use Amazon Prime or whatever it may be, but the avid football fan wants more, and you’re going to get that from watching TV and watching different things or on your phone and doing those type of deals. I think it may lean more towards the mobile devices, but it’ll still be a lot of TV being watched. I think the thing with VR, for me, and I’ve seen the different angles at which you can watch a game and look around, feels like you’re in the stands, whatever. I think the big thing, for me, is that I still consider watching sports a pretty social element of my life. I usually am with a friend or ...Sports bar. Yeah, sports bar with my wife and with whatever, so unless I’m home alone, I’m not probably going to throw on a VR headset. And even then, it’s got to be a better experience than TV, which is pretty good. That’s the thing that the NFL is having trouble with right now is that the TV experience is much better than in-game.It is, and in-game’s expensive too. It’s expensive. They’re trying to find ways to make it a little bit more fan-friendly. What does that mean? Is there a risk of ... We see with the LA Chargers, for example. They can barely sell out this small soccer stadium. Are people not going to go to games?Yeah, but they have their own issues, why they’re not selling out. True. For sure. It has nothing to do with … Them leaving San Diego is the main reason. A lot of people were upset with that.Sure. And they’ve been upset with the way their team has been run for years, right? That’s a bad example. That takes that one. But I could say, for example, when the Rams moved here... When the Rams moved here, it was weird. The first game was sold out. It was crazy because it was LA, they’re back, and they weren’t good. Are they playing in the Rose Bowl or at USC?They’re playing at USC, the Coliseum. Okay. Which is big, the Coliseum. Yeah, it’s a 98,000. It was sold out. Yeah, that’s a lot of fans. But they weren’t good. Yes. It was like, “ugh,” you know what I mean? You have to be good consistently to get people to come and watch. That’s the key. And in the league right now, you have like four or five teams that are really good, maybe eight that are really good, and the rest are either mediocre to bad. Teams are always rebuilding, always changing. There’s no real consistency, and that’s what hurts you more than anything. Everyone’s trying to find the next Sean McVay or the next Sean Payton. The next Bill Belichick. Everyone’s trying to find this guy, but you have to give your guys an opportunity. The thing about Bill Belichick is he’s been coaching the Patriots for 19 years or something crazy like that. Consistency, that’s the key. A lot of people are impatient, and a lot of fan bases are impatient. They want to win, so if you don’t win right away, that hurts ticket sales and it makes it easier for them to go and watch you on TV. Do you have any opinion about tech companies, like Amazon for example, or Facebook or Twitter, coming in and streaming a game versus a traditional TV network? No. Why not? I’m all for trying to get it out to as many people as possible. I remember doing a Yahoo ... The Jags played the Ravens last year in London. In London, yeah. We did the pre and post from here, but Yahoo streamed it. And I want to say it hit like 6.5 million people. That’s huge. At 6 AM on the West Coast, right?Right. 9 AM on the East Coast, you have a game that you can see on your phone if it wasn’t blacked out in your area. That’s big. You’re just trying to reach more and more people, and these people were global. It wasn’t DirecTV. It wasn’t your cable, whatever cable box you have. It was people across the world watching this game. I think the more the league can do that, the more fans they’ll draw in, and it’ll be better for this business. Yeah. It seems to be moving that way, for sure. I’m interested to see if it’ll survive on like a Netflix or Amazon Prime subscription, right?Right. That is something that we haven’t really seen, beyond just experiments at this point. It feels like we’re headed that direction, at least for maybe a handful of games. I’ll tell you this, the one thing I learned about the NFL: Money talks. Yeah. No matter what, they’ll find a way to make it work. Yes, they’re testing games and doing things because there’s always a bigger picture behind it. That’s big business. That’s the business of Facebook. That’s why Facebook is buying everything. They’re buying the Oculus, and they’re buying Instagram, and they’re buying this, and Google’s buying that. And Google has their own venture firm that’s investing. Everyone’s trying to buy and get as much content as possible, but the No. 1 content in the world ... well, in the world it’s soccer, but in America it’s football. Everyone’s trying to figure out a way to get that content because that’s what drives, obviously, viewers and subscribers and things like that. And live sports is one of the only things that still gets people to the couch at a specific time. Probably the only thing, right? Maybe politics?Politics, I think ... It’s weird, because when you bring in politics, mostly you’re with people that think the way you think. Sure. Otherwise it’s a very uncomfortable viewing experience. Yeah, it’s weird. I’ve never seen people say, “You know what? I’m a Republican. I’m going to go watch with Democrats.” No. It’s never that. Yeah, no. It’s like, “I’m going to go hang out with my buddies that think the same way I do.” Which is your prerogative. I’ve always been taught ... At De La Salle [High School], they had a debate team, and I did a little bit of it. I always want to know what the other side’s thinking, because you just never know. Like, my argument may be flawed. I don’t know. If I don’t know what the other side’s thinking ... So, I actually do try to hang out with people who think differently than me just to hear their arguments, because if we do end up getting into it, I want to know what you’re thinking or I want to make sure that I’m right in my thinking. But politics ...You should run. Are you going to run for office? Look, someone who actually wants to hear both sides, that’s like you’re a unicorn out there in the world of politics. You should always hear both sides. I think sometimes we lose our reason and we kind of let it be emotional. Sports is probably the only thing you can do when we watch with everyone. My brother-in-law is a Bengals fan, and this past weekend they played the Dolphins. And one of his best friends is a Dolphins fan, so him and his buddy, who are both Bengals fans, go to this Dolphins bar in Atlanta and they’re watching it. He said it was the best time ever.Yeah?He was like, they were yelling at them when the game was going, and then he was yelling at them at the end because they won. But it was all in good spirit. Sure. I think that’s what makes football, because everyone understands sports and they try to keep it lively. It can be a fine line sometimes. You mentioned investing. You said you invested in a VR company. Mm-hmm.And you live in the Bay Area right now. Yeah. I’m surrounded by tech. You’re surrounded by tech. What’s your status as an investor? Is it something you actively do?It’s tough because I have so many kids. I have three kids now, so I try not to lose a lot of money because they take a lot of it with youth sports, which I’m really big into that as well.There’s been opportunities that I’ve ... like you buy stock in Facebook when they come out, or different platforms like that, Twitter and different things. There’s actually a group led by Ryan Nece, who is Ronnie Lott’s son, I forget the name of it. It’s ...An investment group, though?It’s an investment group, yes. Okay. With this group, we’ve been working together trying to figure out a way to work together and do some investing. But he’s so connected and into tech. I got a chance to go to Google Ventures. Got a chance to go to Sand Hill, we were talking about before. Yeah, Sand Hill Road. The Rosewood Hotel. Rosewood Hotel. What is the big VC up there on Sand Hill Road? It’s a couple of them, but ...There’s a bunch of them. Sequoia?Sequoia!Okay. Went to Sequoia. Met with them. They were talking about some things where ...And my concern with the investing is that it’s such a low hit rate that it scares me. I’m real soft when it comes to that. You don’t like the risk. I grew up with no money, so it’s like: I got money, I’m gonna try to keep it as long as I can. But they were talking about how they try to hit it like a 20 percent, 30 percent rate. If they hit, then they’re happy. And they’re like the best in the biz, historically. Exactly. They told us a story about how they spent one-point-something billion dollars, and they invested in this molecule that ends up selling and that one molecule paid for the whole thing three times over, right?Sure. It’s a real dangerous game, and it’s kind of hard, especially now with everyone popping up with something. Snapchat is tough. My brother works at Snapchat. Oh, really?Yeah. He’s out here in LA, so he always talks about it. But it’s always something new coming up. You just don’t know if it’s going to hit or not, so that’s always the scary part. Like Uber, Lyft ...How do players deal with that while they’re still playing? I imagine they get tons of people throwing things at them. You always hear, “So-and-so lost their money. They invested in a bunch of car washes,” or “They invested in restaurants,” or whatever. What was it like as a player to have that happen?It was crazy. You always get hit with different things, but I had two great men that were surrounding me, my financial guy, who works for UBS, Stacy Oster. Great guy, really scrubs everything, real conservative, making sure everything’s good. Takes his time with it, too. Doesn’t rush it. A lot of times people be like, “I need it by tomorrow.” Like, we’re not going to get that, so chill out. Sure. Then, obviously, my agent, Adisa Bakari, who’s at the Sports Entertainment Group, was another one that I would like to run stuff by because he’s a lawyer. He would run it through his investment lawyers to make sure everything was good, do background checks, make sure that people were clean. And a lot of times, you do a background check, the person’s dirty that you’re dealing with so you usually get away from it. A couple of times, it ended up working out where it was a good investment. There were some times it was a good investment, we just took too long and we missed it. For me, my biggest investment when I was playing ball was in me. Sure. Your next contract. If I was healthy and I was doing things, I got endorsements, my next contract, so that’s what I was investing in more than anything else. A lot of players are so funny. My grandpa always used to always tell me, “Dude, you’re a football player. You’re not an engineer. You’re not an investor. You’re none of this. Your whole life, you’ve played football. You went to college, let’s be honest, you went to UCLA, got a good education, but you went to play football, so be a football player.”My agent used to say the same thing. Sometimes players come out and they feel like, “I’ve always wanted to do this,” but you never put in the amount of time and effort to do it. That’s why, like I told you in the very beginning of the show, I sucked as a broadcaster at the very beginning. Horrible. But I put those 10,000 hours in of watching tape, watching myself, making sure I’m critical of myself, being coached by different people, doing improv classes, different things to help me become a better person, to find my niche in what I want to do within the media. I think a lot of players need to understand that when they start investing is like, all right, dude. You have money, that’s great, but don’t be like, “I’m going to go open up a car wash.” You’ve never washed a car in your life! Right. What do you know about a car wash? What do you know about running something? Even now, like I opened a gym in the Bay Area, or a facility. It’s crazy, so many things have popped up in the last ... We opened it a year ago. I funded everything, and all my buddies come in and they train out of there. Great business. We went from 15 people to almost 600 in a year. Like members to the gym?Yeah. It’s not necessarily a membership gym. It’s more of people that come through. Gotcha. How we have it is like a salon. It’s made up like a salon because I’m not there every day. Okay. I had to do it where they’re independent contractors. We work ourselves throughout. But we created a baseball organization out of the facility. We created a basketball organization out of facility. We’re creating a track one out of the facility where we’re branching off to do different things. It’s crazy. The heads that come with it and the stuff that comes with it and things that break. I’m like, what am I doing? But, at the end of the day, it was my love for my community to help our kids have a place that they can train and be better. I trained in Miami. I trained in LA. I trained in all these different cities. There was nothing in the Bay Area, or the East Bay at least, that I can say, “This is where I trained.” Yeah. So we created this space for young athletes as well as adults to come and work out. And we’ve grown. We’ve done a great job with it. You always hear about, especially the players on the Warriors, oh they live in Silicon Valley and they have ownership group in the NBA who’s very connected to the Silicon Valley tech scene, so they’re cropping up investing. You finished your career, most of your career was in Jacksonville, but you finished your career in Oakland. You’re from Oakland originally.Yeah.Does playing in the Bay Area, is there a benefit to players actually playing out there and being close to all of this?Yeah, if you’re good. Yeah?I think if you’re a good team, yeah, no question. For me, going back home was more I just wanted to play in front of my family again. Growing up in the Bay Area, playing youth football in Antioch, to going to De La Salle, to going to UCLA and coming back and playing Stanford and playing Cal there and having that go. It’s just such a special place when you’re able to go back home and play, and you play well. In Jacksonville, we had a couple times we came out to the Bay Area. I think I came out two or three times, it wasn’t anything fun. To be able to wear the black and silver in front of my family members who were all Raiders fans for the most part — my wife’s family’s a Niners fan but, ehh ...Yeah. It’s all good.You can stare them down at Thanksgiving. They were Raider fans when I played.What about, sorry, but what about ...That’s what I was gonna tell you. That, when you, when you’re able to do those, you create relationships, right? So, the kids that I went to high school with may now work at such and such tech or may do this. It opens doors. Just like going to New York. If you played in New York, if you look at Michael Strahan, if Michael Strahan played for the Houston Texans he wouldn’t be Michael Strahan who he is today.Sure.Because of that market that New York provides. Well, the Bay Area is a little bit different where you get an opportunity to see tech every day. You talk about the Warriors’ owners, those are tech guys. They are able to open doors for you and different ventures that you may be able to ... if that interests you. I remember at the Raiders, we would have dinners or lunches, their player development guy would set up, I think his name is LaMonte, LaMonte Winston. LaMonte would set up dinners with CEOs and VCs and all these people and you’d meet them and you’d hang out and you’d talk and you’d be able to pass cards and email and do all those things. Still today, there are still people that I met at that that I keep in contact with, if its either through a fantasy league that we’re in or through whatever else it may be. Where I live now, in the city I live in now, my neighbors are all VC people, so again, it’s definitely a plus living in the Bay Area. Now, it’s expensive, don’t get my wrong, but the opportunity there is tremendous. There’s people that either I coached their kid in youth football or they’re my neighbor and there’s different opportunities that were presented to you because of how you carry yourself or because people want to have you around. Yeah. So you came out to the League, I believe, in 2006?Yes.Social media didn’t really exist in 2006. No, it didn’t. Good thing, right? Now, obviously, hard to imagine life without it. What was it like as player to basically come into the League with no social media and by the time you left what, nine seasons later, it was probably all anyone talked about? Well, I’ll say this much. UCLA was the third school with Facebook, I wanna say? Second or third.Sure. We were one of the first schools with Facebook and so, it was weird being able to have a site. It was kind of like Myspace in a way, right? Everyone had a Myspace or things like that. But to have Facebook, that was only for college kids in the very beginning, which was amazing right? So you remember signing up? Oh, no, no question. Signed up and was poking everybody and friending all my friends and all the stuff you’re supposed to do. But that was more like, intimate. It was more just for college kids. Now, when Facebook opened up to everybody, I was a little upset about it because I felt like that took away the special interaction that I had with people that were in college. When I got to the pros, I turned off my Facebook at that point. Just because you were too busy or because people were harassing you on it or? Nah, it just didn’t seem authentic to me anymore after that, ya know? It was for college kids and it should’ve been for college kids. Now, granted, at that point I was 20 years old. I didn’t understand the financial benefits of opening it up to everyone, which now I do and I see why they did it. But, at that point, it was just for me, personally. It was just like, “Ah well, it was fun for college, I’m in the pros now, let me leave it alone.” Which was not very smart. Why is that? Well, ‘cause I probably would’ve had a bigger following if I would’ve kept it. Sure. Once you delete it, you have to start it back up again and do all those different things. And as a football player, especially now, you get a lot of endorsements and things because of the followers you have. The reason Odell Beckham got a $25 million Nike shoe deal was because he has like 17 million people that follow him or something crazy, right? Sure. Your reach is much greater than, obviously, what mine was. It’s funny. Rashad Jennings was a guy who, we were in Miami training, I want to say, might’ve been 2008 or 2009.He’s a teammate of yours? A teammate of mine who now is doing acting in Hollywood. He came to me and was like, “Hey man, you need to try this Twitter thing.” I’m like, “I’m not doing anything with social media. I’m done. I just want to play football. I wanna train, play football, have fun, chill.” He’s like, “Man, listen, go get you a Twitter. Trust me. You’ll love it.” So I got it, started watching, kind of seeing/following people. I’ve always been interested in news and I used to read the newspaper all the time. That’s why he brought it to me. He was like, “Bro, this is like the newspaper, just on your phone.” Eventually I started tweeting these couple things out, you started getting responses and you started seeing people from different places. I fell in love with Twitter. You were managing your own Twitter account? I manage all my own stuff. Gotcha. I don’t do the whole publicist ...A lot of athletes or famous people have agents ...To me, that’s trash. If you’re gonna do it, do it. If you’re not gonna do it, don’t do it. It should be authentic if you’re gonna go out there. People know who I am. I’m always going to be me, I’m never going to be anyone else. I can’t have anyone be me. I have my own little corny jokes, or dry sense of humor that I throw out there; dad jokes or whatever it may be that people know it’s me. At least the people that know me know it’s me. And so, it’s funny, Twitter, I was ... 2010, I had hurt my knee. I’m out for the year and I’m watching the Chicago Bears game. The NFC Championship game against the Packers and I tweet something out about Jay Cutler, saying, “When the going gets tough, quit.”Quarterback for the Bears.Yeah, yeah, yeah. Jay Cutler, quarterback for the Bears. And so, there were a lot of Bears fans that weren’t really happy with that. Actually, it was a two-piece joke because it was like, “the Urban Meyer rule is in full effect.” And then “... when the going gets tough, quit.” Because he just did that in Florida. So a lot of Florida fans were upset with me; a lot of Bears fans were upset with me. It was all over the media. Everyone took it. That’s when I realized how powerful social media was. At that point I think I had 20,000 followers, the next morning I woke up with 500,000. Wow. That was your moment of viral social media. It was real. And it was one of the first things that ever happened. I then realized, okay, I have to be careful what I say on here, because not only are other people watching, there’s kids following, there’s different things. Even though I knew what I said wasn’t wrong, it was true, but... You’re still active on Twitter.Oh, always active on Twitter. I answer fantasy questions. I tweet at people sometimes. I always try to tweet out. I’m big into the high school recruiting scene, so I always retweet the kids that I train with or work with, helping them get recruits. I deal with a lot of coaches in that situation. I always tweet out certain news sites or whatever it may be that I feel like is more on my side of thinking, obviously. Every now and then I’ll tweet out the other side of thinking. I enjoy it because it gives you a platform to really express who you are. Now, there’s some times I may not use Twitter for a month, then I’ll just pop up. I may not use Instagram for a month, then I’ll just pop up. Is that the other site you use? Your brother’s at Snap. I have a Snapchat but I’m more of a looker than a Snapchat... That’s too much. I’m not that young. How do you deal with trolls? I’m sure you have, as a famous person, I’m sure people like to call you out for things or whatever. I’m okay with the trolls. It’s the death threats that you get a little upset with. I’m sure. I could see that. Right. Again, those are people ... I grew up in a rougher area, it doesn’t really bother me, the trolling. People are going to talk bad about you, that’s what some people do to make them feel better. But after the Chicago Bears situation, I had a couple death threats and I wasn’t too happy about it, to say the least. Yeah, I can imagine.But lot of that is people ... No one is going to really ...Yeah. Most people are just talking. They’re like, “I’ll do this to you when I see you.” And I’m like, “Well then, pull up. This is where I’ll be.” Or, another great example, I was with the Jags and a bunch of Raiders fans were like on my timeline talking crazy. That Super Bowl, I forgot where we were, but I was like, “This is where I am. I live in the Bay Area in the off season. This is the bar I go to every time. If you’re feeling froggy, just show up, I’ll be there on Tuesdays, just catch me there.” And again, you do it to quiet people down. Did you ever get scared someone might actually show up?No, no one’s gonna show up. Ain’t no one that bold in this day. People just talk.Yeah. Well, you’re also quite large. I handle my own. Right? You would be fine. Again, those are people expressing themselves. And that’s what we have to see it as. And so like after seeing it from the other side, I get it. People are passionate about their teams and their fan bases and so you always want to let them express themselves. As a father of three, how do you think about social or tech for your kids? When I told you I had three boys, one of them was my nephew. He’s moved out and lives with his mom now.Gotcha. My cousin. So you have ...?Two boys and a girl.Gotcha. They all have Snapchat. How old are they? 10, 8 and 7. Okay.But again, you just have to educate them on it. And that’s what I try to do. I’ve never been a parent to try and shield my kids from the world, because those kids end up doing bad things when they’re hit with adversity. I’ve always tried to be honest with my kids about questions they’ve asked. I’ve always tried to, you know, teach them how life is. My kids are pretty different. They watch the news.Oh, wow. Like Fox News and CNN News. It’s so funny.Like the real news.Like the real news. They’ll be up late at night watching certain channels. I’m like, “Yo, turn it off.”Wow. “I can’t help it.” “Yeah, turn it off.” So, they’re engaged. 2016, they were really big into politics. They had their own voice. Not my voice, their own voice, and we would speak on it. That’s how my family is. We can sit down and disagree over certain things and still be able to break bread and enjoy each other’s company. That’s just how we are. I’ve always wanted to raise my kids to be able to think for themselves and not push my views on them because my views are my views. My wife’s views are her views. Their views are their views. They should be able to hold an intellectual conversation with anyone at the age of 10 on anything. Yeah. So you don’t mind if they have a Twitter or ...They don’t have Twitter. They only have Snapchat.Snapchat. Little bit more intimate, that way. Yeah. And the more of it, you can kind of watch who’s following ‘em and those type of things. What do you feel about ... I know you said you’re big into youth sports, what do you think about the obvious, tackle football for kids? I love it. Yeah? Not worried about it?I think it’s the best thing going. Not at all. Why not? Because you can get hurt doing anything. And I’ll give you a great example. This year, I coached 10U [youth football]. It cracks me up. One of our players got hurt. Broke his foot and sprained his ankle. You would think it’s at practice. No. It was jumping on a trampoline. Another kid got a concussion. You think it was at practice? No, he was riding a scooter without a helmet. Yeah. If you’re gonna stop players from playing football, then don’t let them play at recess because a couple years ago my son had a team that had five kids get hurt. None got hurt on the football field. One got hurt playing tag at recess, ran into a pole. Another broke his arm skateboarding. The stuff that kids do. So how many concussions do kids get when they fall off something? Off a bike or they could fall off the swing set. We don’t quantify those. I think, for me, this is my analogy I tell people. When, let’s say you wanna have heart surgery. Do you want the guy fresh out of med school doing it? Or do you want the 20-year pro doing it? Everyone chooses the 20-year pro and that’s what it is for football. Yes, it is a very dangerous sport but if you have a kid that is playing at the age of 5 or 6; both my boys played at 5 and 6. The hits aren’t that hard. They are learning how to protect themselves. And if they do make a mistake, there’s no real risk at that given point. Because they’re not being hit hard enough.Yeah, because you’re talking about kids who aren’t coordinated. You’re talking about the pads being bigger than them the majority of the time. It’s like little bodies, big heads.Right.But they’re learning that, when I go across the middle, okay, this may hurt. Ah! Okay, I know how to protect myself. Then, instead of putting a kid at 12, who will then play against someone who has been playing for six years and their first year is at 12? You’re guaranteed that 12-year-old is going to get hurt. And then, let’s wait till high school? You’re guaranteed that 14-year-old is going to get hurt. Guess what? Now kids are lifting weights. They’re bigger, stronger, more coordinated, and your kid doesn’t know how to protect himself, where these other guys do. And then you get hurt.I always tell people, when they come and they ask me for my opinion, I always say play early. Play as early as you can. And flag is not football. Right? And don’t get me wrong. I think it’s a great sport and I think a lot of people do it. It’s a kind of a side dish to tackle. But the flag rules are completely different than the tackle rules and the reason being is that you have to be a much more physical person. And I have a lot of kids who have played flag for two or three, four years and now they’re coming to tackle football and, at the age of 10, it’s a big jump because they’ve never seen contact like that. The thought of, you have to run as fast as you can into the other person to protect yourself, they don’t understand it. And I always tell them, if you go 50 percent and he goes 100, you’re gonna get hurt. It’s been a great teaching point. A lot of parents have bought into what we’re doing at our organization and we’re going to try to continue to grow this thing because the game of football is special. I always tell people, I’m from a small town called Antioch, California. We’ve had five guys go pro out of this town. Or six. Maybe more, actually. Myself, Sterling Moore, Taiwan Jones, Jeremy Newberry, Anthony Trucks, TJ Ward, Terron Ward are the ones that I know about. There are probably more, but football allowed us to leave this small town in the Bay Area, East Bay. We’re the first city in the Bay Area, the delta where all that stuff is, to go see London, to go to New York City, to travel the world and do different things. Take care of our family, set up our families forever. Who am I to not allow my kids or anyone else’s kids that right to be able try and get that and get what football has done for me?I always tell people, it’s better off starting early than it is starting late.That seems like as good a spot as any to stop. All right. But this was awesome. MJD, thank you so much for your time.No problem. Next time, see you in the Bay Area. Let’s do it up north. All right. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}