{"id": "Former Deputy Attorney General Sally Yates explains how Donald Trump is trying to corrupt the Justice Department", "paragraph": "On the latest episode of Recode Decode, hosted by Kara Swisher, former U.S. Deputy Attorney General Sally Yates talked with Recode’s Kara Swisher about how things have changed since she was fired in Week Two of the Trump administration.Yates had spent most of her legal career in the U.S. Attorney’s office in Atlanta before being appointed as Barack Obama’s deputy attorney general toward the end of his tenure; her 10 days as the acting attorney general in early 2017 came to an end when she defied President Trump’s attempt to ban Muslims from the country. But the majority of people who work at the DoJ are career civil servants, rather than political appointees, and she argued that they might have trouble keeping a “spring in their step” now that the president is attacking their place of work regularly.“It’s not even a thing anymore when the president tweets some of this stuff or says it in speeches,” Yates said. “We just kind of move on to the next thing. Doesn’t even make it through a full 24-hour news cycle. You know, if we get to the point that that’s how people think our justice system works, at the risk of sounding melodramatic here, stuff starts falling apart.“The folks that I know that are there wouldn’t allow that to happen,” she added. “But there’s the subtle sort of signals that you get, too, that can really infect the process as well.”She also talked about why she’s not planning to run for any elected office (including president), the future of the #MeToo movement and where the Mueller investigation will end.“To a certain extent, when people talk about how, ‘If the president’s not indicted, well, that’ll prove that nothing wrong happened’ … This is the old quintessential boiling a frog slowly,” Yates said. “We’ve already learned a lot of stuff that’s really troubling all along that if we had gotten all at one time, I think people would have been really shocked. Because it’s dribbled out slowly, it’s hard to understand, and there’s so much other stuff coming at people every day.”(Editor’s note: This interview was recorded live at the AllRaise Summit in San Francisco on Nov. 1 — before the midterm elections and before President Trump fired Attorney General Jeff Sessions.)You can listen to Recode Decode wherever you get your podcasts, including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a lightly edited full transcript of Kara’s conversation with Sally.Kara Swisher: I am going to take off my sunglasses for Sally Yates. All right, I got to say, I spent Halloween night with Elon Musk, which was something else. But the only thing I was thinking about the entire time he was talking was Sally Yates, so I am so ... I mean, he is fine with his rockets and crap, but this woman, I don’t admire almost anybody and ... it is true, it really is. I cannot actually think of anybody at this moment except for Sally Yates, what she has done and what she did to stand up and tell the truth and do her job and be a badass is something that really inspires me and I’m super excited. I am going to try not to gush, I won’t actually ... I am gonna ask you some tough questions, but she’s exactly the kind of person we should all want to be and behave in life.  Sally, come on up. Sit down. So I interview a lot of people, I do, and I just ... I want to talk about a lot of things, but you are aware of what AllRaise is, correct? What’s going on here?Sally Yates: Generally, I mean, it is a different world than the world that I have spent the last 30 years in. I was so inspired by what I just saw.She was interesting. She is like, “Wait a minute.” I was sitting there watching these women present just a second ago and so was kind of interesting. So let’s just get into it. Let’s ... you all know what Sally has done and what she does. Why don’t you give us an update of what you have been doing since you left the Justice Department? Yeah. I actually had a gift I think a lot of people at my stage of my career don’t have. That was a chance to be able to make an affirmative decision about what I wanted to do. You know, a lot of times you just kind of keep doing what you are doing, or you move to the next step in the same progression, but when I left DOJ, I really had no idea what I wanted to do. So, I spent a year visiting at Georgetown Law School, which I really loved. The students there are so plugged in to what is going on in the world, and that was great. I was traveling and doing a lot of speaking and writing. But I realized something, and that was I missed being a lawyer, I am really not an academic. I am more of a real-world kind of person, and I missed that. But I also did not want to just be a lawyer, because there are too many things out there that I really care about, and want to still be able to try to have some impact.We will talk about you running for president later. You should, we will discuss that. I am not liking your answer. So you went, you got back into doing law.So I got back into practicing law.Had you, you’d been in the Justice Department for how long?Twenty-seven years.Twenty ... So you went right from law school, or was there ...?No, I practiced at King and Spalding, a firm that was originally started in Atlanta. Griffin Bell, who had been the attorney general in the Carter administration, started the practice there, an investigative practice. They call it special matters. Our clients do not have criminal problems, they have “special problems.” I was there for three years, and went to the Justice Department, went to the U.S. Attorney’s office in Atlanta thinking I was going to stay a couple of years and go back to the firm, and 27 years later ...I am discerning a southern accent that you have. But you, so you decided to go to the Justice Department from private practice. Why did you do that? What was the impetus to do that?At the time, I didn’t go for the right reasons. In fact, I would not have hired myself later if I had been honest about the reasons. I went because I wanted more hands-on experience, I wanted to try cases on my own. In big law firms, they are usually staffed with a dozen people.Yes, and you move up.Yeah, but that’s not a sufficient reason to go to DOJ and that is why I would never hire anybody who offered that as the reason later because, you know, at the risk of sounding kind of corny about this, the immense responsibility you have at the Department of Justice of representing the people of the United States, you are not just like a regular old lawyer. You are responsible for seeking justice and for equal justice in this country.Yeah. That is why we are sick to our stomach right now with the little elf who is running it. But go ahead. And so, when I go there, I was really totally unprepared for how completely ... captivated is the wrong word. It doesn’t denote really the seriousness of it. But how totally taken I would be with the mission.What, you know we are talking a lot about, they just gave a presentation about the different things that you need to do. What were you like as a young lawyer? I mean, were you aggressive? Were you, it was a different world. You are talking about the Carter administration. Oh yeah. It was a very different world. Look, it was the late ’80s when I started at the U.S. Attorney’s offices in Atlanta. I wanted to go in to the organized crime section, but they would not put me in that section. The first assistant, which was the top career person there, thought that it was kind of too rough and tumble for a woman to go into organized crime — I know, I know, that is so patronizing — at the time, so he put me in the white-collar section, because he thought that I would not be tough enough.What, did you do anything about it? Did you ...?At the time, well, and I hate to admit, I mean, I think I was plenty tough to handle organized crime.They are all so stupid. But go ahead. They seem like, when I listen to all of the coverage of them, they seem dumb, as a group of criminals.Which actually is kind of why I liked fraud better. Right, okay.Because it was more challenging.Right, better criminals.White-collar work, actually, it is better crime. It is not about whether they did it, it is not like if they, you know, if somebody goes into a bank and robs a bank, like what they were thinking at the time is pretty irrelevant. In the white-collar area, the whole thing you are trying to figure out was what were they thinking? What was their intent at the time? And I found that really challenging and interesting, and I liked it.So what were you like as a lawyer then? They did not let you do this, you did not object. You just did ...Well, no. There were not very many women on the criminal side. I suppose I was a tad aggressive, which I have learned with one of the U.S. attorneys there, I remember going to a meeting and before we walked into this meeting, the U.S. attorney looked at me and said, “I really think that the agency would appreciate a more demure woman”. Right.Can you ...? I mean, “demure.” You would never use that. So I just kind of nodded and he did not get a more demure woman.Oh. Okay. In response to that.So you rose through the ranks of the Justice Department and moved into a very high-ranking position, through all of these administrations, so it was Carter ...I wasn’t in the Carter administration, I’m not that old!Yeah, not but with that. It goes back. There were lots of administrations. You served in both, my point being, in Republican and Democratic.Right. Right.And you felt good about that job until recently, correct?Yeah, I mean until the Obama administration, I was a career civil servant. So that means you stay, regardless of administrations, and like 99.9 percent of the people at the Department of Justice are career. But when President Obama came into office, I was appointed to be the U.S. Attorney in Atlanta, which is a political appointment, which means you leave with the administration.You leave with the administration. And then moved to the Justice Department, correct?Yeah. Last two years as the Deputy Attorney General, which is the No. 2 spot.The No. 2 spot. What did you think when you got that job? Talk a little bit about getting that position. You got that at the end of the Obama administration?Yeah. Last two years. And I had spent a lot of time in D.C. I was on what is called the Attorney General’s Advisory Committee. It is a group of about 15 U.S. Attorneys from around the country that are plugged in and involved in shaping policy for the departments. So I had been doing that for the six years prior to that. I got to know Eric Holder very well, and so he was a great mentor and good friend of mine. And I really liked that work. I liked being able to have an impact on something broader than an individual case or even a single office.Right.And really believe in the administration.And the things you worked on was the broad swath of the things the Justice Department was doing, and the Obama administration was very aggressive on a number of issues, especially Eric Holder was.Right, right. And look, the DOJ, it’s 130,000 employees. It’s a big department. It’s not just U.S. attorneys and litigating components, it is all the agencies; FBI and DEA and ATF and the Marshall Service and the Federal Bureau of Prisons, so it is a lot of stuff. And then there is the whole national security side as well that you are working with counterparts. You know, CIA and NSA and others there, so it is a really broad portfolio, which I loved, because that is part of what made it so interesting and challenging.And so you worked on all of that versus individual things, correct?I worked on all of that in the last two years.So fast-forward to the Trump administration. You were realizing what was going on, and it would have been known in the Obama administration, some of this stuff. You all were working on this. I know you can’t talk about every part of it, but you felt it was your duty to bring it up, and to make noise about it, correct?Yeah, and you are talking about the Mike Flynn stuff now?Yes. Exactly.Yeah. The investigation into Russian interference in the election, yes, had started back during the Obama administration, and you know, God, this seems like a lifetime ago when we talk about this, it really does, but ...Today is birthright thing. Oh God, don’t even...That is today. Tomorrow will probably be ...Let’s just get to the midterms. But at the time, during the transition [between] administrations, it became a big thing whether Mike Flynn was essentially telling the Russians not to worry about the sanctions that the Obama administration was imposing based on their interference in the election. As I said, it seems like a lifetime ago, you may not remember, but nobody could really figure out why the Russians weren’t reacting when we imposed the sanctions that we did. And we discovered, through some recordings we had access to, that Flynn ...I like how you say that, “Some recordings we had access to.” I would like to have recordings I have access to.That is kind of all I can say. Okay. I am getting what happened. Okay.In fact, he had been talking to the Russian ambassador, and you know to sort of say colloquially, kind of tell him, don’t worry about this, we will take care of it. And then — this is all in the lead-up as Trump is about to take office — then this becomes a thing and they start asking the Trump administration about it. And they start falsely saying, “No, there was no discussion with the Russian ambassador about it.” And they start getting more and more specific, and the Vice President even goes out and says, “I talked to General Flynn and he told me that they talked about Christmas greetings, and down the plane,” and all sorts of other stuff and just sort of forgetting that sanctions thing. So yeah, we then hit the point it was clear they weren’t going to stop lying about it, or providing false information about it, that is was unclear who knew at the White House that this was false. One thing we did know was that we were not the only ones who knew that he had been having these discussions with the Russian ambassador. The Russians obviously knew it as well. And he had been out publicly providing false information about it, which creates a potential compromise.Right.And you really do not want your national security adviser compromised with the Russians. It is not a good way to start. Yeah, yeah. I even know that.Yeah.So you do this, you go, talk about what it takes to go and do something about that, because in normal administrations it would be like, “Oh my god, the Russians are invading, we have to do something.” But what was the calculation from your part, from being in this kind of dicey position?Well, it was not what I anticipated, I can tell you, when I agreed to stay on as acting AG, which is a tradition for the No. 2 to stay until the new Attorney General is confirmed. There is this other tradition, and that is that nothing happens during that time, and you can just sort of stay the course, you keep the trains running. My chief of staff actually told me it would be so quiet there would be time for a lot of long, boozy lunches.Right, right. You were hoping for long, boozy lunches.Yeah, I had those later, but just not during that time. So it was not what I expected. But on the other hand, you couldn’t ignore the gravity of this situation. And you have got a brand-new administration. Again, you do not know who knows what, but you know you cannot sit on this information. For one thing, I am assuming that the Vice President didn’t know he is out there telling the American people something that is demonstrably untrue. So from that standpoint, he should know that that information isn’t accurate. The President and others should know that their national security advisory, if he is lying to them, they should know that, and we should not have that guy sitting there, compromised with the Russians, and so...With national security clearance.It is not what I had in mind, in terms of what that time was going to be like. But what else could you do?So talk about making that decision, because in Washington they make all kinds of political calculations where they don’t, they don’t, they shove it under the thing, or they do not do something about it. Talk a little bit about what you were going through in your head.Well, look. We talked about it internally with the different national security agencies, so I talked to CIA, because I wanted to get a sense from, particularly, the people at the agency who deal with this stuff every day, is this actually the kind of stuff the Russians would use? I didn’t consider myself to be the world’s expert on that. I wanted to get the expert view on that, and they confirmed to me, it is exactly the kind of stuff that they would use, either overtly or more subtly. And so, we had discussions, I cannot really reveal those in terms of how the short straw came to me to be the one ...But there you are.But there I am. Yeah.Right. Did you expect the reaction you got, including being removed?Well, there was that travel ban thing that also kind of came in there too ...Yes, I know that. I am going get get to that. But the reaction, it set it up, correct?You know what I expected? I expected that they would do something about it. We went over there and told them, I mean, I call up the White House counsel, tell him I have got something.Don McGahn.Don McGahn. Vitally important, I need to talk to him about right away, and it cannot be on the phone. So that is kind of a big thing, for the acting Attorney General to call the White House counsel and say, “I need to come see you right away and we need to talk about this in a SCIF, in a secure place.”What did he say? “I am having a long, boozy lunch”?So I did. So I went over there, he saw me immediately, and I told him what was going on. Went back the next day to answer some of his questions about it, and then the travel ban happens over the course of the weekend. Actually, it was the Friday afternoon that I had gone back to have the second session with McGahn about the Mike Flynn situation...That was the Friday afternoon.… when I learned about the travel ban, so then there is the weekend, and then the Monday that I issued the directive, and then I am fired Monday night, and then nothing happens to Mike Flynn for a couple of weeks, quite some time after that. Until the story broke in the Post about it.How did you decide what to do around the directive? Just, you couldn’t do it. You could not ...No, it was more than that. We are now talking about, this was travel ban one, we are on 3.0 now. And so again, it seems like a lifetime ago. The travel ban I made my decision on actually applied to people who had valid visas and people who had valid green cards, who were lawful, permanent residents in the country. We had some people who were literally mid-flight when the president signed the first travel ban and who could not get back into the country because of his executive order. I learn about this Friday night from my principal deputy reading about it in the New York Times, not exactly the ideal way to find out about something like this. I’m literally ...That you have to, that you have to carry it out?I have people in court the next morning defending it because actions are being filed all over the country for different individuals who are trying to get back into the country, so we grapple with it all weekend, trying to figure out from the White House what they are trying to do and who’s in and who’s out. And bring everybody in Monday morning and have a long discussion with the Trump appointees and the career people about, all right, here are all of the challenges, what are our responses to these things? The Department of Justice is this incredibly hierarchal organization. Normally for something of this import, lots of layers below have worked this all up. And there have been lots of memos done and it is all just still ... There was no time for any of that stuff. It is literally 72 hours from when I first found out about it to when I am told, we’ve got to, DOJ has to take a position on the constitutionality of the travel ban in court Tuesday morning. We’ve got to take a position as to whether it’s constitutional or not, and in talking it through — and I can’t reveal what those discussions were — but it was really clear to me that ... I wasn’t convinced it was lawful or constitutional. Beyond that and importantly to defend it, it also became evident I was going to have to send Department of Justice lawyers in to argue that this travel ban had absolutely nothing to do with religion. Religion was completely irrelevant. And that’s in the face of all the statements the President had made both on the campaign trail and after he had been elected. I didn’t believe that that was a defense that was grounded in truth, and we were the Department of Justice. I don’t think any lawyer should go in and be arguing something that’s not grounded in truth, but I sure don’t think the Department of Justice should be doing that and certainly not in something ...The reason I wanted you to talk about this and tell the story, to people who aren’t ... I think most are familiar with it. What is it about you that made you do that? Because not everybody does, I’m telling you, they do. They will argue it. They will, you know, they will go through it. And lawyers did. Yeah. Look, I loved the Department of Justice. I felt privileged every single day to be part of that institution. I believed in the mission. I believed in our responsibility. I had experienced firsthand how it felt for people in the community to count on us to be the ones who were administering justice, so I’d spent nearly 30 years doing that. I had a really strong feeling, and a really strong commitment to what I believe that institution is supposed to stand for. I’ll be damned if I’m just going to abandon all that at the end and say that none of that matters when that’s actually all that matters is what that institution is supposed to stand for. Did you expect to get fired? You did. I thought there was a really good chance. Although — and this may be just incredibly naive on my part... He would suddenly realize he’s not an idiot! And, what?I didn’t think ... I’m not that naive. I did actually have some sliver of hope that this would give them pause. They ultimately did abandon travel ban one after several courts struck it down, but I did have some hope that this would give them some pause and they would actually have a process now, and you would get input from agencies and the department and others. So, there was some part of me that thought, you know, maybe that’ll happen. But I recognize that there was a good chance I was going to be fired. I didn’t really want to get fired. I mean, I had spent nearly 30 years of at DOJ.Yeah, so you didn’t want to get fired.That’s not exactly how I wanted to put the period on the service there, getting fired, but anything else ...That’s kind of a good way to get fired. But God, I got to tell you, 72 hours, 72 days, I would do the exact same thing all over again. To have done anything else would have felt like a betrayal.What do you assess now, as you’re watching what’s going on with the investigations and things like that? Look, it’s a ... There are lots of policy issues with which I disagree with this administration. I mean, we don’t have long enough to go through all of those, but that’s actually not the thing that worries me the most. ‘Cause policy is policy ...Policy, you know, elections have consequences. I hate to say it. You have to expect that there are going to be policy decisions with which you disagree. But what is really damaging is, the rule of law in our country only works if decisions are made at the Department of Justice based on the facts and the law and nothing else. At least since Watergate, both Republican and Democratic administrations have recognized that — not only for it to work that way but for the public to have confidence that it’s working that way — there’s really an impenetrable wall between the White House and the Department on cases and investigations. You talk about broad policy kind of things, but cases and investigations. From the very beginning you’ve seen this President not only disrespecting that, but repeatedly trying to reach in to DOJ to gin up an investigation of his former political rival or to ... even things ... I know Joe Arpaio seems like so yesterday, but think about, you know, the President actually called the Attorney General of the United States to try to get him to drop the criminal investigation of Joe Arpaio. I mean, that’s just one small example.What I worry about more than any of the litany of policy differences is the loss and the normalization of that kind of breakdown of the rule of law and what that means for future administrations and what it means for the public’s confidence. So what does that mean and what ...Well, right now he’s reaching in, trying, knocking at the door all the time. And I think you’ve seen ... Rod Rosenstein, for example, has, I think, done a good job of resisting with respect to the Mueller investigation, and Bob Mueller really needs to have the running room that he has to be able to get to the bottom of that. So, it’s hard to know if there’s any actual impact on decisions, but I know some of the folks that are still there and I have confidence in them, but whether it’s actually having that impact or not... It’s not even a thing anymore when the President tweets some of this stuff or says it in speeches. We just kind of move on to the next thing. Doesn’t even make it full through a full 24-hour news cycle. You know, if we get to the point that that’s how people think our justice system works, at the risk of sounding melodramatic here, stuff starts falling apart.But when you were in that Justice Department, when the people that are serving there who are career, what can they do? Nothing. Because they have to take orders, a hierarchical system, right? Yeah. Well, for one thing it has ... Can you imagine going to work every day at a place where your President is basically calling your agency corrupt? I mean, almost every single day, there’s something, either an FBI or DOJ or otherwise. That doesn’t exactly give people a spring in their step when it comes to doing their jobs. I don’t have any evidence and I am hoping that it is not the case that it’s actually having any impact in terms of specific case decisions that are being made at the Department. Again, the folks that I know that are there wouldn’t allow that to happen. But there’s the subtle sort of signals that you get, too, that can really infect the process as well. Where do you imagine — and I want to talk a little bit about what people can do, like what do you do or how do you cope through that? What are some of the things you get inspiration from in doing that? But where does it lead, then the Mueller investigation and everything else? Do you feel like it’s going to pace ... We talked yesterday about Bob Mueller. You know, this recent thing where they were trying to smear him. Which is just absurd. I mean, I know Bob Mueller, he’s like the most straightlaced guy you’d ever meet. I was telling Carol, he doesn’t even wear colored shirts. He only wears white shirts with his suits. He is just the quintessential — I’ll date myself — Joe Friday, “just the facts, Ma’am,” kind of guy. So this latest thing is just really sickening. Yeah. I didn’t know colored shirts were compared with sexual harassment.No, no, no. No, I get that. But maybe. So where do you imagine it going? Because they tried that. It didn’t work. Yeah, it’s hard to know. One of the things that they’ve done really well and exactly like you should be doing it is, there are no leaks coming out of the special counsel’s investigation. That’s how that’s supposed to be done. And so, I think the press corps has been surprised just about every time when, you know, another indictment comes out or a plea comes out. There’s a body of law out there that provides that a sitting President can’t be indicted while he’s President. There’s an office of legal counsel decision that says that — or opinion that says that — that doesn’t necessarily have the force of law, but there are a couple of routes that he could take. He could do a report that would go to the Deputy Attorney General, to Rod Rosenstein, that Rod could then provide to Congress that would lay out what it is he’s found. There could be other charges of other individuals that are to come. This is my long-winded way of telling you, I don’t know.Okay. Yeah. I’m waiting for Roger Stone to be arrested. That’s my ... and then I’ll be happy. So where does it lead to, though? What happens in these kinds of things? Are we somewhere where we don’t know where we are anymore? Well, I guess it sort of depends on what happens next. I mean, we already know. To a certain extent when people talk about how if the President’s not indicted, well, that’ll prove that nothing wrong happened … This is the old quintessential boiling a frog slowly. We’ve already learned a lot of stuff that’s really troubling all along that if we had gotten all at one time, I think people would have been really shocked. Because it’s dribbled out slowly, again, we’ve ...It’s hard to understand. It is hard to understand, and there’s so much other stuff coming at people every day. And do you feel confident that at least some of the government agencies do have a handle on the Russians now? Or is it still that’s even not getting fixed? Look, I know that the agencies are working on trying to prevent the Russians from interfering in midterms or the next Presidential election. They were kind of doing that on their own. There was no impetus from the President to do that, no statement from the President directing them to do that, and regardless of where you are on the Russia investigation of what happened in 2016, good grief. All of us should want to ensure that we’re doing everything we can to prevent them from doing it again. Doing it again. Yeah.All right.It’s not a 300-pound guy sitting on the bed.So here you are. Yeah. Here you are … fired. But working, you seem to have gotten a job. You can say it. I’ve gotten used to it.All right. Good. “Fired by Donald Trump” seems to be something I hope I can have happen to me someday. Why aren’t you thinking of political things? You said you aren’t, you said “No” to me. I just interviewed Hillary Clinton and she did some sort of “No” that nobody was happy with. She did actually say no, but for some reason she didn’t say no, no enough. But you were quite definitive about not running.About not running for office? Yes. Yeah. That’s just not something ... Look, I believe in public service and hope someday I may have another opportunity for public service, but public service and running for elected office are not exactly the same thing. That whole process is just not anything I’ve ever really felt ...People are interested in you, you’ve been approached, correct?Folks have been, yeah, have been very nice about it.Why wouldn’t you do it? I mean, Mark Cuban’s thinking of doing it. I don’t know.Well, because Mark Cuban’s thinking of doing it!I think I’d rather have you there, Sally, than him. And I know him very well. Why don’t you think that? Why? You know, we’re talking about women running in this election. We’ve got Stacey Abrams in Georgia. I’m assuming you back her.Yeah. I’m supporting Stacey. Yeah. Yeah. Oprah gave an amazing, as usual...Only Oprah could end up making President Obama be the second story, because President Obama is coming to Atlanta tomorrow to campaign for Stacey Abrams. Does she have a pretty good chance or what?The polls show it neck and neck right now, 48-48, which is remarkable because, look, Georgia is a red state. So for the polls to have it at 48-48 is really amazing. It’s got to get to 50, though. Georgia is one of those states where you have to have over 50 or it goes to a runoff.Do they run against each other again?Again. Yeah. There’s a libertarian candidate that’s in there right now. All right. Okay. So you’re not thinking of running for office? No. Although, my husband wants me to.Oh, he does? He always says, every time I get asked this question, he says, “Just leave a little bit of wiggle room, so if you ...” I think your husband is wise. But again, why? Because you don’t think you’d be good at it or you just don’t want to be subject to ...No, I ...Only because there’s a lot of women running, and you need to give them inspiration. That’s all.I know, and I think it’s fantastic that they’re running, and I’ve been particularly just amazed when I’ve been out speaking, all the particularly young women running all over the country, and it doesn’t have to be for statewide office, whether it’s like city council or county commission or whatever. Or, if they’re not running, they’re helping someone who’s running on a particular campaign, or they’re getting involved in issues. You were talking about what people can do. There’s a lot of stuff like that you can do to try to define what the values ought to be for our country. I don’t think that every single person has to be a candidate him or herself. I’m going to finish up talking to you a little bit about #MeToo and where that is. How do you look at these cases? The Harvey Weinstein one is wobbling a little bit because of a bad detective in New York. So how do you look at the whole panoply of that? Obviously, I’m assuming you’ve had your own share of issues like that. Being “demure,” I think demure is probably not the worst, not the worst thing that you’ve heard. How do you look at that right now from a legal point of view, and in getting women to positions of power so things like that don’t happen. Yeah. You know, it’s ... you’d think we’d be past this by now, wouldn’t you? I mean, God, I think back to the, you know, “I think they’d appreciate a more demure woman,” although I wouldn’t consider that harassment, that’s more just annoying.Just obnoxious. Just an asshole. You’d think we’d be past this stuff, but yet in the last year, I’ve had so many conversations with other women, particularly my contemporaries, who’ve told me stories, if not an out-and-out sexual assault, some other indignity that they suffered at some point in their career and felt like they just had to silently suck it up and take it. Frankly, back in the day, other women were part of the problem, because I remember back when I first started practicing law, there were not many women in positions of authority in the legal profession. I think there was sort of a feeling of, “Look, if you’re gonna make it here in this man’s world, you kind of have to be one of the boys and you just don’t make a big stink about stuff like that.” And so, shamefully, I think particularly a lot of women back at that time were not nearly as supportive of other women as they should have been then. I think that’s changing now. You sure have seen in the last year that women just aren’t going to take this stuff anymore. I have just flat had it.So give a few tips, and then we’ll answer some questions, of what you think are the critical parts that have helped you. One of the things ... we just had a thing of like having a posse, like I’m myself forming a Militia Etheridge, which is lesbians with guns. Be scared. Be very scared. What are your things, the advice you would give to people?With respect to the #MeToo movement?No, in general.Oh, God. In this, there’s another thing, and you faced those things. I think that the #MeToo movement, like what has been going on is like a tax that women pay, like an extra burden they have to deal with in becoming successful. Yeah, I think it is, and I think that particularly for those of us that are a little older now, we have a responsibility to do more to be protecting younger women. When I say protecting, I don’t mean as in shielding. I mean as in ... I hate the word “empowering” because I just think it’s so overused, but it seems to apply here, but empowering younger women to know that they really don’t need to be fitting into somebody else’s idea of how they should behave or who they should be. You know, I remember when I was coming along, women really tried to carefully calibrate sort of their image. You didn’t want to be too aggressive, too assertive, or it would be too much, but yet you didn’t want to be the wallflower either. You are constantly having to calibrate just the right level of aggressiveness. Hopefully, that’s over now, that women can feel comfortable if you are the hard-charging one, you can feel really comfortable to be that and not have to try to fit into somebody else’s view. That’s a different thing than it was back in the day. What inspires you? You know what? As I said, I spent that year at Georgetown and I was doing a lot of speaking at colleges and universities and it actually goes back to the day of the women’s march, which I couldn’t participate in. I was acting AG at the time, so I was kind of ...You wanted to, right?I did! Actually, I was at the Whole Foods that afternoon when it was over in D.C. and freezing cold that day. All these young women are just pouring into the grocery store because the Metro was overflowing there. They had signs and the hats and the whole thing. I’m there with my security detail and I just tell them, “I’m going to stand over here.” I just wanted to watch for a while. There were all these young women who were totally comfortable in their own skin. They knew who they were. They knew what they believed in. They weren’t the least bit hesitant to say it out loud. For the last year and a half or so that I’ve been speaking at colleges or universities or other places, I’m inspired by not just those women that were at the march, but the young women who come up to me and tell me that they had never thought about public service before. They had planned on going into business or into that, but they really feel a calling now to want to be part of defining her country, not to leave that to our elected officials that we have now, but to be part of that. That’s really inspiring to me that in the midst of all of this right now in our country that the silver lining out of all of that is that the 20-somethings that in the past might have been very self-focused are much more focused on our world and our country and something outside themselves. Much more than I was, for example, at that age.Last question and then we’ll get ...I’m sorry.That’s okay. No, it’s great.Much too long an answer.If you had to pick one characteristic of yours that you think has been critical to your success ... I’ll start. Me, obnoxiousness. Go ahead. You’re not obnoxious. I see that.Persistence. Persistence.As in “still she...”?Oh, no. In fact, I wish I hadn’t picked that word because of that. “Nevertheless, she persisted.” I’m pretty damned dogged.Persistent.I’m trying to think of another word so I won’t be glomming onto that right now.It’s all right. She’ll share it with you.[audience members yell “grit”]Grit’s a good one! That’s a good word. But that sort of always … From the time that I can remember from law school all the way through, I guess if there’s been one thing that probably has contributed to whatever success I’ve had, that would be it.All right. Questions from the audience? We have a thing going around. Ah, Mallun, fantastic. This is Mallun [Yen].Mallun: Sally, what can you share with us ... It also feels like a little bit of ancient history now with the Kavanaugh and the Supreme Court hearings. Yes, I’m sorry, is that a bad way to end the afternoon? Is there something you can say to us about this?Yates: Is there something I can say what?Mallun: The Kavanaugh hearings and the ... Is there something you can say to us about the Kavanaugh hearings that have nothing to do with beer?Yates: That’s gonna make you feel better?Yeah.Mallun: Or just a commentary, or maybe it’s just cathartic. I don’t know.Yates: I don’t think I have anything that’ll make you feel better. I think out of that whole ... Well, one thing that’ll make you feel better. How about Dr. Ford? I mean, you wanna talk about ... I watched ... All of us, I would imagine, watched her testimony and ... I testified before Senate hearings before, but that was part of my job to do that. This was not her job. She did not have to do that. And I watched her go in with just remarkable dignity and grit and courage and I can’t help but believe that, putting aside the results of all of that, that that had to have inspired other women to also find the courage within themselves.I juxtapose that against, to me, the lowest moment of the whole thing — and there were a lot of low moments — of when the president at that rally was mocking Dr. Ford and this woman, whom he himself before had said was credible and compelling. But he had decided that politically he needed to run over her. So, he just hit the gas. And I will never forget that crowd there in the rally laughing at her expense and thinking back on her testimony when she talked about the thing that stuck with her.Laughing.Was that laughter at her expense. And there they were, laughing at her again. To me, that was the lowest moment of the whole thing.Well, gosh, Sally.So, sorry. Let’s think of a higher moment.Audience member: On that cheerful note ... Ruth Bader Ginsburg is still really healthy. That’s my...Yates: She can plank longer than I can.She can plank. She’s a planker.Audience member: Well-preserved. So, I started out my career as a lawyer too, so I may be biased, but I wanted to get some suggestions from you perhaps on what we can do to support the rule of law. I think one of the things we think about is this thing that affects civil society and all of that, but it’s venture capitalists and people that rely on our business infrastructure really staying very much constant, the rule of law is of utmost importance to us. Have you given any thought to what you might suggest for ordinary people who are going about their business lives? What can we do to reinforce and support the importance of the rule of law in our country?Yates: I’ve been asked that and I still don’t have a great answer to that question because it’s really hard in your day-to-day lives to be able to have an impact on that. When I was at Georgetown, I put together this convening of people, 50 percent Republicans and 50 percent Democrats, where we brought in people to emphasize the importance of this issue and to emphasize the nonpartisan nature of it.Through that, one thing that came out is that — I know it sounds kinda silly — the phone calls and letters and all that your elected representatives get about this being something that’s important to them ... One of the biggest problems we have right now is the lack of a check on the executive.Sorry, I just took your picture.Oh, were you… I’m talking with my hands a lot.Keep going.Is the lack of a check that we have on the executive. I’m not suggesting to you that all of a sudden this is going to make all the difference in the world, but I think our elected representatives need to know how unacceptable that is to us, whether it’s in town halls or letters or calls or talking with other business executives. What we don’t wanna do is lose our sense of ourselves to where we’re just ...They do everything to get elected. If you stop them or get in their way, that’s when they react.If they know this matters, if they feel like they’re at risk if they don’t do something to push back on this, I think that’s the only thing that really ...And vote, hard.Oh gosh, and vote.Vote hard. All right. Another question? We had one more. Or was it over here?Audience member: Hi, so I wanna get back to the election and I would love to hear ... You’ve been out talking around the country. I’d love to hear what you think it will take to beat Donald Trump in ‘20. What kind of candidate? Let’s leave Sally Yates aside for a minute. What kind of candidate do you think will be the best case to race against him?Yates: Look, I don’t claim any particular insight in the political world. That’s really not been my world. I’ve been a prosecutor all this time.Audience member: So speculate.Yates: Okay, speculate. I think you need sort of the antidote to Donald Trump. I think it’s gotta be somebody who appeals to our better angels, to our best instincts and — I know all of this sounds kind of trite — to the unifying values of our country. Right now, we have somebody who is appealing to absolutely the darkest, fearful instincts in people. And to me, for the sharpest contrast — again, it’s not on any particular policy issue because people of goodwill can have genuinely different views on that kind of stuff — but it’s about a fundamental question of who we are as a country and how we treat immigrants and how we treat each other and the rule of law and do we respect a free press and all those sort of basic, core founding principles that haven’t really been in danger in the past, but actually are now. I think you need somebody who is the embodiment of that, who can articulate that, and who also isn’t going to be so stage-managed so that everything seems poll-tested, because I also happen to believe that people vote for somebody they trust. They may not agree with them on every issue, but they sort of decide whether they trust that person to be making decisions on their behalf. To me, it’s got to be somebody who ...So far, it’s just Oprah right now that you’re talking about right now, but go ahead. Who else?Oprah was amazing, actually, when she was talking about Stacey Abrams.She’s gotta stop this. She needs to run or something. I’m not sure who it’s gonna be. I haven’t even been focusing on candidates so much, yeah.Anyone inspire you?I’m thinking. Look, Barack Obama hadn’t really emerged at this point yet.That’s true. That’s right. That’s a fair point.We don’t really know who’s out there at this point.Some person.Some person.All right. Last question. Very last, right here.Audience member: Hi.Hey.Audience member #4: Thank you for all that you’ve done, first of all, and thanks for coming in to speak. It’s very inspiring. Just switching topics a little bit toward technology. We’re all venture capitalists in the room and we are chatting with founders who really have to think about this question of data privacy. You’ve obviously seen really prominent people from the tech world trying to explain how technology works and how we deal with privacy. I’m just curious if you have any insight into how the DOJ is thinking about either chatting with founders or tech companies or even prosecuting them down the line. What will the world look like from a legal perspective and how should we be thinking about guiding our founders going forward?Yates: I don’t think any of us know what the world is gonna look like from a legal perspective like two, three, five years from now. I think one thing we do know is that I think it’s gonna look different than it does right now because I do sort of feel like we’re at a juncture where ... And I couldn’t begin to tell you exactly what form this is gonna take, but there’s gonna have to be some type of regulation that addresses some of that.Were you thinking of that at the time? Were you starting to look at those things?Yeah, we absolutely were. The problem, though, is that all of these issues are supercharged issues in Congress. Sometimes, it’s not even that it breaks down on a Republican-Democrat thing. It just breaks down. And candidly, they don’t really have the expertise.Candidly? Candidly, we saw it on display. A 4-year-old has a better sense of tech than they do. But go ahead.Right, so those hearings are really not the best vehicle for trying to craft important privacy legislation or otherwise. They get staff people, who certainly know that area.So, a national privacy bill, for example?Yeah, I don’t know that that’s gonna happen.There’s one in California.I don’t think that having piecemeal privacy laws is probably the best idea here.Right.I know some tech companies are pushing for a federal privacy law. Exactly what form that takes and whether or not you can, Congress will get to the point in the next year or two to be able to do that, I’m not sure.Related, obviously, just as far as you’re famous for the Microsoft trial, was there antitrust considerations going on among these big tech companies?Considerations, yeah. I can’t talk about the specific.How do you look at it from the outside now?I think that certainly ... Look. there are all sorts of issues. It’s sort of like the law school exam question in terms of every issue you can imagine is tied up in the tech world right now, from antitrust to privacy to all of those issues, it’s one big cabal now. Figuring out how smaller tech companies compete when the larger companies have ...So much dominance.Yeah, exactly. I don’t have all the answers to that. I think there certainly are people who are working on that, but whether that actually turns into anything or not is hard to know. At least in the short term. I think it’s gonna have to, though, over some period of years, because we’ll just keep lurching.Yeah, regulation is coming, for sure. Some sort of something. Some action. Stuff like that. All right, last question. Sally Yates, what’s your current mood?What’s my current mood?Yeah, what is it?I don’t even know what that question ...I’m pissed. But what is yours? Current mood.Oh, current mood. I thought you said “current move,” like this is some kind of California question that I don’t even know what this means.Actually, it is actually a word. Some millennial said to me recently, “What’s your day move?” I’m like, “What?” It’s what are you doing today. I was like, “Oh, I’m sleeping. It’s my day move.”Ooh, God, I’m gonna end on a downer.All right.I’m kinda anxious right now, both in terms of the midterms and what that means in terms of whether we actually are gonna begin to have the check that we need, whether all these people ... I’m a little nervous about whether all these people who were writing and protesting and marching and all of that, are they actually gonna vote?I’m hopeful in that regard. I guess I’m anxious and hopeful at the same time, if that can be kind of a weird cabal there.That’s how everybody is. Thank you. Thank you, Sally Yates.Thanks!Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}