{"id": "Facebook’s top execs ‘make tobacco executives look like Mr. Rogers’", "paragraph": "Facebook has endured scandal after scandal in the past two years. This one feels different.The New York Times published a jaw-dropping report Wednesday that laid out how the company sought to cover up knowledge of Russian meddling and discredit its critics; the paper said COO Sheryl Sandberg oversaw a campaign of dirty tricks while CEO Mark Zuckerberg ignored problems or deflected responsibility. And in short order, once-implausible questions about whether Zuckerberg would fire Sandberg or policy VP Joel Kaplan have become plausible.But Recode’s Kara Swisher says no matter what, the buck has to stop with Zuckerberg himself.“Sheryl Sandberg ... really comes off the worst in this story, although I still cannot stand the ability of people to pretend that this is not all Mark Zuckerberg’s responsibility,” she said on the latest episode of Pivot with Kara Swisher and Scott Galloway. “He is the CEO. He has 60 percent. He’s an adult, and they’re treating him like this sort of adult boy king who doesn’t know what’s going on. It’s ridiculous. He knows exactly what’s going on.”Galloway said he did not take any pleasure in criticizing Sandberg because she had “written eloquently on personal loss and the important discussion around gender equality.” But he mused that those accomplishments gave her “unfair” protection, and that it might also be true that she will be “unfairly punished.” (Zuckerberg, for his part, said Sandberg “will continue to be” at the company and credited her with leading the efforts to clean up Facebook thus far.)“Winston Churchill said at the outset of World War II, ‘Never have so many owed so much to so few,’” Galloway said on the new podcast. “And it got me thinking. Can you think of any individuals who have made so much money doing so much damage? I mean, they make tobacco executives look like Mr. Rogers.”You can listen to Pivot with Kara Swisher and Scott Galloway wherever you get your podcasts — including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a full transcript of Kara and Scott’s latest episode.Hi, everyone. This is Pivot from the Vox Media Podcast Network. I’m Kara Swisher.And I’m Scott Galloway here with breaking news. HQ-14A is Kara’s, you guessed it, Fiesta. Congratulations, Kara.No problem.Well done.You know, we were going to talk about this Amazon HQ2 mess, which was also sort of bad press for them this cycle because of where they selected, and some objections to them picking places where you had predicted they would pick. So they announced a second headquarters in New York City, and also a sub in Washington, D.C., along with a smaller facility in Nashville, which is basically one of their distribution facilities.We were going to talk about this, but really there’s nothing to talk about today but Facebook, right? Correct? I mean, this New York Times story which really brought together a lot of stuff. A lot of amazing reporting has been going on over Cambridge Analytica from the Guardian and from lots and lots of sources. I’ve been whacking at them in the New York Times in my opinion column and stuff like that, but this really brought together a lot of stuff, and included some facts and details that were so disturbing in terms of deflection and trying to push blame elsewhere that even I, who have been really critical of Facebook, was astonished by it.So I’d just love to get your take, or whatever you want to talk about.Well, first, what are you hearing? Before we jump on here, you just started reading a letter. You know these people. I don’t. What are you hearing?I think the repercussions, especially for Sheryl Sandberg, who really comes off the worst in this story, although I still cannot stand the ability of people to pretend that this is not all Mark Zuckerberg’s responsibility. He is the CEO. He has 60 percent. He’s an adult, and they’re treating him like this sort of adult boy king who doesn’t know what’s going on. It’s ridiculous. He knows exactly what’s going on. And so to begin, I will say let’s put the responsibility where it belongs, on the person who controls the company completely, and that’s Mark Zuckerberg.But he’s got all these executives, including Sheryl Sandberg, who is the COO; Elliot Schrage, who has left, but he was the head of policy and communications; Joel Kaplan, their man in Washington; and this group of people and many others at the top really did, as I have been saying, abrogate their responsibility for what happened. And not only that, they had a bunch of dirty tricks to do so. You know what I mean? According to the New York Times.So there’s going to be all these repercussions on all of them in terms of their personal relationships, in terms of their outside of Facebook profiles, which Sheryl Sandberg has a big one from “Lean In” and stuff like that. But this is a letter from Patrick ... I just got it sent to me by someone. Patrick Gaspard, the president of the Open Society Foundation, just saying, “The notion that your company at your direction actively engaged in the same behavior to try to discredit people exercising their First Amendment rights to protest Facebook’s role in disseminating vile propaganda is frankly astonishing to me. It’s disappointing to see how you have failed to monitor hate and misinformation on Facebook’s platform to now learning that you are active in promoting this distortion is beyond the pale.” I mean, you’re going to see tons of this, I think.There’s going to be a lot of it.No question.But my question for you is, don’t you believe ... And people say I’m piling on, but I’ve been at the bottom of the scrum for a while, and I’ve always been very reticent to be critical of Ms. Sandberg, because I believe she is a protected class of a protected class.Meaning what? Meaning ... Well, she’s an inspiring woman. She’s written eloquently on personal loss and the important discussion around gender equality. And what has happened is I believe she’s the ultimate sheep’s clothing around a wolf.That’s interesting. That’s an interesting way to put it.She has been the most effective heat shield in history.Yes.Think about this. Let’s talk about Fox. What if Rupert Murdoch ... What if it came out, and you and I have similar feelings about Fox, but what if it came out that the Wall Street Journal was taking ads that were sowing havoc, and that their online properties had been weaponized by the GRU, and it ended up that Rupert Murdoch hadn’t put in place any safeguards whatsoever to stop the contamination of our elections.Yeah. Right. I said it this morning on ...Would he even travel to the U.S.? I don’t think he would, because I think he’d be worried he’d be arrested when he deplaned. Right. No, I agree. I mean, what’s interesting ... Someone just wrote me this, actually. I’ll read it directly. “Some will settle down, but I think she looks really bad coming out of this. As you say, in a way, she’s the most vulnerable since she’s a professional hired woman, and Zuckerberg is the founder, a dude no one thought he had people skills, altruistic motives.” Anyway, everyone expects so little from men. You know what I mean? She will bear the brunt of this, but you’re right.That’s interesting. Yeah.But they’re all responsible. Look, they’re all highly paid. They’re billionaires.Great point.They’re beyond billionaires.You know what quote comes to mind for me? I love war history, and Winston Churchill said at the outset of World War II, “Never have so many owed so much to so few,” and it got me thinking. Can you think of any individuals who have made so much money doing so much damage?No. No.I mean, they make tobacco executives look like Mr. Rogers.Well, you know, it’s interesting you say that, because just this week I interviewed Marc Benioff for a show that’s going to be on Sunday on MSNBC. It’s one of my specials there called “Revolution.” Thank you for that ad. And it’s actually a really good interview, but in it — and there’s clips out there — he talks about them being ... He said, “Facebook is a cigarette company.” And then I said, “Well, people die from cigarettes.” And he kept going, he goes, “Yes, and they’re a cigarette company.”They’re dying on Facebook. People are being pulled out of cars.Yeah, and so it was really interesting. Recently, before Marc’s interview, I did one with Tim Cook, and same thing, he had some real criticisms of Facebook. And at one point, I asked him, “What would you do if you were in Mark Zuckerberg’s situation?” He said, “I wouldn’t be in this situation.”Yeah, that was a great line.It prompted so much anger from Facebook. I remember at the time they focused not on what Tim was saying, which was a very cogent discussion of what they should do. Instead, focusing on that one comment, and as it turns out, Mark was so petty that after he heard that comment in this New York Times article, he switched the phones to Android. I mean ... Which is serious punishment. Have you tried using an Android phone?No. No, I don’t. I use Apple.Oh, my God. Using an Android phone is like paying for dinner with a Discover card. It’s like saying, “Don’t have sex with me.” It’s the ultimate prophylactic that says “I should be ...”Oh, Scott. Once again.”I should be screened out of the gene pool.” If you use an Android phone or have a Discover card, your family tree should come to an end.Instead of listening to very cogent feedback from someone who is pretty good at his job, they would focus on that, and they were so focused on the comment. And I kept saying, “Can you listen to what he said? Are you not adults? So what, they took a little shot at you.” “Well, they’re doing it for PR.” As it turns out, they tried to slime Apple. They tried to slime George Soros because he said negative things. They hired this horrible group of people called The Definers, who believe in sort of aggressive ...The Definers? Is that a cult where everyone’s wearing Nikes and then drinking cyanide?I know, they just wander around. And the guy from The Definers quoted, “We like to muddy the waters.” He just said it. Like, good. That’s what he does. So it was fine that he said it on the record.But right now the “I’m so, so sorrys” just are not going to cut it. Once again, like with Beacon, or whatever thing that Facebook does that’s shitty, “I’m sorry” is not good enough now. And what’s really interesting is what the repercussions will be. First, they’ll be personal repercussions on all these executives, especially Sheryl Sandberg. There’s no question.What does that look like, though? I was thinking this morning, we’re all going to be in violent agreement.Getting dumped from things. Getting dumped from committees. Especially around the anti- … the stuff around George Soros, and the sliming. All right. Getting dumped from lots of groups, I think, one. Or boards, or something like that. I do think that might be coming. Just not wanting to be affiliated with them.Two, and it depends on what comes out after this, because once this floodgate opens that the New York Times has opened, more is going to come. All of a sudden, everyone’s going to drop a dime on everybody. Yeah, I agree.So then that’s the repercussions of everybody dropping more dimes, and you know there’s emails and everything else, so that’s one thing.The second thing, which I think is more serious, and Facebook put out a statement this morning about it, saying that one part of when they knew was incorrect in the New York Times story because they have testified before Congress, and these politicians coming after them, and they were already coming after them, is going to increase exponentially. And Facebook’s attempt to push it off onto Google or Twitter or others is just not going to work. They are the target of these politicians, and you know that Senator Warner, Senator Burr, Senator Klobuchar and various congresspeople are going to just come at these people real hard, and that’s really the danger, to me.But when it comes after them ...I don’t know. It’s just worse.... is it antitrust? Is it regulation?It could be any. It’s going to be worse now. This is going to be worse.Now, the issue is ... Let me be fair to Facebook. They’ve done a lot of things since then to fix stuff. Like, I think they’re announcing some stuff soon about more to do it, but they’ve been doing a lot to fix it. It’s just that Mark Zuckerberg — and I quote it in a column I’m doing for the New York Times this week — he cannot focus on what happened. He only wants to focus on fixing things, as if he ... It’s like you said, an arsonist cleaning up the mess or something. That wasn’t you, that was Anand, but you know, the idea that they’re the ones to clean this mess up.Yeah. What surprises me is that people are surprised, because this is an individual ... And I like your point about ... You know, the fear is, all right, big tech.... and all of a sudden, what might happen is we fire the woman. Right? There’s only one woman who’s the senior executive, and all of a sudden she’s about to become ... I think she was unfairly protected, but I wonder if she’s about to be unfairly punished, to your point. I think it’s an interesting point, because you’re right. He’s responsible. He’s the CEO. And the controlling shareholder.Yeah, and he controls the company, but I’m a little surprised that people are surprised that he’s not their Jesus Christ, because look at his background. All right? He dropped out of college. He screwed over his close friends in college. Then he royally screwed over his best friend soon after he started Facebook. His first professional endeavor was a website that evaluated women on their physical appearance, and he last year proposed a third class of stocks that said he could sell all his stock in Facebook and still control a flock more vast than Christianity. I mean, what could go wrong? Doesn’t this person just reek of poor character, and been totally insular? It’s hard to imagine how a guy like this who became a billionaire so young, became so powerful, doesn’t become totally insular and detached.I remember that interview you did where he started sweating like a maniac when he just didn’t understand that people were worried about him knowing a lot of information about them, and he just seemed totally flummoxed by the whole thing. I’m just surprised that people give him as much credit, that they’re shocked that this stuff is going on. Because the article, some of it’s really ugly, but isn’t it just more of the same?Yes.Isn’t it everything we already knew?Yes, it is. It is. It is. It is. This is something ... This is why I’ve been going crazy about this for so long is because they literally are the personification of this group-think in Silicon Valley that everything they do is bathed in gold. Every decision they make. And they live in violent agreement with each other. You can see it in the lack of diversity. You can see it in the lack of ... Without a lot of voices in the room. Now, they say they disagree, but they don’t. There’s nobody putting brakes on any of these people, because we treat them like boy kings. It’s as if my teenagers were running the show, you know what I mean? And, by the way, my 13-year-old would do a better job, honestly.I agree.Because they think about these things.I think whether this has repercussions ... And we should move onto the next thing. Whether this has repercussions, here’s the deal. Young people aren’t using this product as much, and the issue is that’s where we’re going to see it. Is it going to affect advertising? Is it going to affect usage and stuff like that? And I do think there is a lot of risk with Congressional inquiries into this.I think you’re half right. I think that a red state DA or kind of a flyer might be a small Latin American nation or small northern European nation just outright bans Facebook.Well, yeah, Margrethe Vestager’s been so strong on this for years.Yeah, but you might see someone like Uruguay just say, you know what, we’re banning Facebook where you just can’t have it here. You could see a country just go gangster on these guys.In terms of the actual business, I always maintain that people talk a big game about being angry at Facebook and where do they go to express their outrage? Instagram.Instagram, right. I actually don’t see the business letting up and advertisers don’t really have any choice.I don’t know, with the Kevin Systrom, I wrote about that with him leaving, I thought that was a very bad sign.Yeah, but I don’t know. I don’t see their business decelerating, that’s the weird thing.I’m gonna disagree with you on this.There’s a dissonance here, but where does P&G and Unilever go? If they decided to pull their advertising from Facebook and Instagram.Listen, we’ve seen this before with AOL. I’m sorry, I’ve seen it.Hold on, they’d be lauded for their noble, principled stand and then their stock would go down three to five percent the next day ‘cause everyone would wonder how they’re gonna drive traffic to tide.com. These guys have no choice. This is a danger of a monopoly or duopoly, advertisers don’t have any choice.We’ll see. These things die very slowly but this is not, these are not good directionals ‘cause the question is if they fire anybody, which they won’t. The lack of accountability. The very least, this lawyer Joel Kaplan in Washington seems quite ... his misjudgments are quite perplexing to me, including sitting behind Brett Kavanaugh at the hearings. Talk about conflict of interest. This is a person who’s Facebook’s person in Washington. And he can have an opinion about Brett Kavanaugh, just keep it to himself. On both sides, by the way, speaking of, I can’t believe I used that term.But it’s just, we’ll see. We’ll see. I’m gonna disagree. I think this is a really bad.I have a couple of questions, though, from a person who’s not a journalist but a commentator. You’re a journalist. Couple things stood out in the article to me. First is, they’re clearly going after each other. Yes.That is clearly ... the board members went off the record.Erskine Bowles. Erskine Bowles was very angry, it looked like in that story.And he’s clearly ...I heard that.Going on background.Well I don’t know. Guessing.Or somebody is.I would guess, yes.Information’s coming out of the boardroom.Yes, that’s what ... The dime dropping is going to be the problem. I haven’t even looked at my emails today. I’m sure there’s 20 dimes dropping into Kara Swisher’s email.And a couple political ramifications, I believed until about a month ago that Sheryl Sandberg was probably one of the five or six most likely nominees for the Democratic nomination for president.I said no. Ugh, no, you’re wrong.I think she was planning to run for president ...No.And then ...You’re wrong.That’s done now. The other thing is, I think Charles Schumer just got himself a competitor for his next election.I agree.He looks terrible here.I’d have to say, I noted, I did a podcast with him in which he kept praising Facebook and I was like, “What are you talking about? They’re a disaster.” It was, I put up the exchange today on Twitter and at the time, I was perplexed by it.But now that he went after Warner and Burr, now I get it. Or Warner, I guess. Just Warner, ‘cause he’s on his side, but I was, at the time, I literally finished the podcast and I’m like, “What was that? He has no sense that there is some issues here with this company.” Then I thought, “Maybe he’s just a luddite.” You know what I mean? Maybe he just doesn’t get it, but I guess he got it. I agree.Last thing, the scariest thing I thought about the article — and you tell me what you thought the most disturbing thing … the fact that they actually fomented the notion that Soros was behind this.Yes, it was. Man...Oh my gosh. They’re trading in conspiracy theories.The Definers.It’s just wow, that is really, I mean, that is the stuff of a movie.Gotta tell you, how much of an asshole do you have to be to call yourself The Definers?The Definers. Yeah, that sounds like a bad ’70s rock band.“We’re the Definers.”“We’re The Definers. Our latest hit ...”Yes.“Next up, The Definers.”You can see them sitting — I’m sorry, it’s gonna be all guys sitting there going, “That’s a cool name.” No woman would sit there and go, “Yeah, I call myself The Definer.”The Definers. That is dudes.Oh my god.Yeah, that’s dudes.Jeez Louise. All right.What was the scariest thing in your mind that came out of that article? What was the most shocking thing?Oh, I gotta read it again. I gotta take notes. The dirty tricks. I saw them react like petty assholes to a lot of stuff, but this was like whoa. Then I remembered what they did a couple years ago against Google. They fomented a fake kinda thing at Google and got in trouble for it. Then I remember calling, I remember when they did that.I, again, shouldn’t be surprised. The dirty tricks are very disappointing and the treatment of Alex Stamos — who I know pretty well, who I knew at Yahoo had tried to uncover a lot of hacking stuff — I don’t think he ... he probably should have told them quicker and stuff like that, but instead of focusing on the fact that he didn’t tell them quicker or tell them correctly, was that versus, “Oh my god, we have a leak.”But he’s clearly the whistleblower here, right?Oh yeah.He’s the person who called the Times. He comes out of this actually looking pretty good.He’s talked a lot. He’s been on podcasts and stuff like that. He’s now at Stanford teaching. I like him a lot. I’ve dealt with him a lot when he was at Yahoo. A lot of these CEOs wanna cover up this stuff or find a way to make it less horrible and he’s not one of them, it seemed like it. I don’t know. I don’t know who’s talking to who, but clearly, there’s 50 people talking here. There’s gonna be 500 people talking now.All right, next thing. Let’s go into an ad break. We’re gonna take a quick break and when we get back, we’ll talk more.In the next advertiser segment, brought to you by Quickbooks, we’ll hear from a business owner who turned their side hustle into a full time career. Thanks to the sponsor of our show, Quickbooks for Nat’s story. Learn more at Quickbooks.com, that’s Quickbooks.com, now back to our show with Scott Galloway.All right, Scott, that was the overplayed, sorry, it’s not overplayed by any stretch, but what’s the most under-reported story this week?Sure, I think a pretty big deal is that Apple has decided to officially distribute their iPhones on Amazon.Mm-hmm. That is a big deal. It didn’t get a lot of attention, you’re right. It did not.Yeah, effectively, one of the keys to building a brand is your distribution, right? Hermes doesn’t distribute through Walmart. Levis, Red Tab won’t even distribute through J.C. Penney. Actually, they’re in J.C. Penney but they won’t distribute through orange tab through different points of distribution ‘cause you wanna line up, right?Macy’s won’t carry anything that’s in Sears. The distribution has a big impact on a consumer’s perception of your brand. Apple, the ultimate luxury brand, is now on Amazon. That’s a big move. I believe that it’s another signal that Apple has jumped the shark and we’re at peak Apple.Really? Okay. Talk about that.If you were to say what is the most value creative decision in the history of business, most people would say it’s Apple’s introduction of the iPhone.Okay.The rocket ship that took them to a trillion. I think they get the brand right, but the decision wrong. I think the ultimate gangster move here that created the first trillion dollar company was Apple’s decision to take literally billions of dollars out of broadcast advertising.They actually under-indexed on advertising to pour into this dying medium called stores. They have made these temples to the brand that are just mindblowing in terms of how good they are and how good you feel about ...I still am happy in an Apple store, I have to say. I was just in one.They’re wonderful. Then if you buy an Android phone — back to Android — you go into a place with bad lighting with a guy named Roy and he sells you an Android phone and all you can think about is going back to the Apple store.Yeah.Distribution is ...They should have food at the Apple store, don’t you think?They should have a cafeteria there. I’d live there.I would live there.I would like to live there.I would work there.Anyways, they ... Incredible, incredible bold decision to create, I think they have $7 billion or $8 billion in leases, 500 and whatever 50 stores around. When they go into Amazon, I think they’re basically saying we need the growth and they’re denigrating their distribution. I worry over time ...That’s a fair point.If it’s the beginning of the end of their margin.That is an interesting point you make.Their margin support.I think I agree. They gotta sell more iPhones. I do think about that. I didn’t really buy the new iPhone. I didn’t. It just wasn’t enough. You know what I mean? I probably will, probably get to it. I was on that year plan I don’t understand whatsoever. I’ll probably replace them in some way, my kids too. But you’re right, I think they have to sell more, and obviously the issues in China where they’ve been having a lot of growth are gonna be myriad going forward, especially with these tariffs and trade talks. That is, if the Trump people can stop being in the reality show of attacking each other every day inside the White House, if they can focus on it. But some of this China stuff I think is problematic for them.Then there is the question of whether they have a new product that’s really exciting that I will spend more money on. I will spend more money to maintain my Apple presence, but is there something exciting that I would spend a lot of money on?Everyone talks about services, but this is gonna be really interesting because even Nike, which you’d argue is one of the best brands in the world, when they had decided to officially distribute or eliminate a number of SKUs on Amazon, it didn’t work. Even Nike couldn’t force Amazon to clean up all the gray market stuff, unauthorized distribution.I’ve bought Apple things on Amazon. I have.Accessories though, right? Or refurbished phone?Yeah, accessories. Not refurbished phones. I don’t buy refurbished phones.Yeah.Sorry, my friend.This is a fairly big deal but it’ll be interesting ...I agree.To see if it works ‘cause typically ...Under-reported, I agree with you on this.Typically, Amazon, they always say ... Amazon says we’re partnering with Apple and Apple says we’re partnering with Amazon. Typically, Amazon partners with a brand the way a virus partners with a host, and that is, it works out really well for one of them. I’ll be curious if this works for Apple, and it’ll be reported kinda six months in what happened.Right. My only unreported thing is today the Saudi prosecutor seeks death penalty for five people allegedly involved in the journalist Jamal Khashoggi’s death. I mean, honestly, this was reported a lot but it sort of fell off the pages during the midterms. But, honestly, these people ... What I tweeted was the lying liars have lied, what a surprise and they’re thugs. Again, good luck taking their money, Uber and others. I just think it should ...Basically these are the five guys ...This is what we should keep reporting on. The witnesses who are gonna be killed, yes, that is what they are. They’re the fall guys. Basically, they were doing their job.We’ll see.They were sent to assassinate someone and they did what they ...I don’t know. Hopefully not. Hopefully these people will bang at it and remains a reported story and they link it to the higher parts of the government. There’s no question to me that these people don’t breathe without permission. You know what I mean? In these countries, especially. To pretend ... Again, someone died. In this case it was an actual murder, but nothing happens at the top of any of these companies or any of these countries without these people knowing, I’m sorry.Yeah, someone knowing.And pretending like you’re some adult, I just don’t ... You know, one of the things that was interesting in that New York Times piece, I had had a problem with Mark answering my questions about the impact of his inventions on real people and about people dying. In the New York Times piece, the board got really frustrated when they were revealing the Russia problems, he whirred through solutions without discussing why it happened.You know what I mean? The same thing. It’s the same idea and they were very frustrated by, it’s whirring was the ... That’s what he does. He whirs. Anyway, it was interesting.Should we talk about a win of the week? I wanna plug something.Win of the week, yes, let’s do that. Win of the week, go ahead.My colleague at NY Eastern, Jonathan Haidt, who is just this rockstar thinker.Is this the guy I wrote the ... which book did he write?”The Coddling of the American Mind.”Coddling, yes, coddling.It just came out. I should have him on the podcast.It is so ... oh, you should. He’s fantastic. Mm-hmm.And it’s really fantastic research. It shows that the rise of smartphones in combination with sort of this bulldozer concierge parenting where we clear out all the obstacles for our kids has created a generation of kids who’ve never been safer — there’s less drunk driving, there’s less teen pregnancies — but we’ve also created the most emotionally venerable generation. And they get to college and they’re hugely depressed. Interesting.And you can literally track this generation and now there’s these ... there’s colleges, including my alma mater, that are dis-inviting speakers because they’re offensive.Oh, right.They’re worried they will be traumatized.Oh, this is this gang who just cares about people ... oh come on, this is not our biggest problem. I’m gonna disagree with you on this one. I hate all these writers that write about this. I will read his book, but I don’t think them not being about to hear speakers ...We’re creating a nation of snowflakes.Oh, come on. That’s what college students do.We’re creating a generation of snowflakes. They’re a pain in the ass. These people are like, “Oh, we can’t speak at colleges.”They’re dis-invited.Like oh, I’m a victim. Oh, the mob of Twitter. Oh come on.They dis-invited Sam Zell. Oh, well. I mean, is he really that bad?I don’t know.I mean, for God’s sake, learn from the guy. But that’s what ... that happens in colleges all the time. I don’t know. I just, I don’t think it’s our national crisis the way some of these writers have gone.You have students yelling down professors.Oh, no. Oh, you’re kidding.In class and where does that happen? It happens on the East Coast. It happens on the West Coast where we have ...I don’t care.... we have wealthy parents coddling their kids. So, I have a question. I know your 13-year-old is in the other room. Are you a coddler?No, I’m not a coddler.I’m a total coddler.Not me, no.Oh, my gosh I’m a total coddler.And here’s why, let me just say if someone yells someone down, they yell someone down. Who cares, Scott? Honestly, this is not our greatest crisis of America.Oh, I can’t handle it. Literally, in America where everyone gets to blah all the freaking time, these people are complaining about not getting to blah. Oh, no, not that. It’s the slippery ...So my dog ...They say the word slippery slope, I’m gonna push them down the slippery slope. We have a Vizsla, and whenever my wife and I argue, the dog senses it and it goes upstairs. It just can’t handle controversy.I’m just telling you you’re wrong.And I’m the same way. When my wife goes after one of our kids, I freak out and I have to go upstairs. I don’t can’t handle it. And I realize ...They dis-invited people, so what?She is doing what they need to do. One of Jonathan Haidt’s great analogies is that ...I’ve heard this book is good.We have so many ... we’re trying so hard using so many clean wipes around our kids’ lives to disinfect them that they’re not building the immunities they need.Yes, okay.I thought that was an outstanding.That is probably true, that is true. That is true.That was an outstanding analogy.That is a good analogy.I was bullied a little bit. I don’t know if you were bullied.No.But I look back on it ... Oh, really? I was.Never. Not once. You did the bullying.I did not. I protected people from bullies. Wow. That’s outstanding.I ran the playground, Scott. What do you think? Hello. I ran it so well.I can totally see that. I can totally see that.It was tight. I ran a tight playground.I’m running your ass over in the Fiesta. So, yeah, but I think you learn coping mechanisms and when I see what happens at my kids’ school, they literally ... there is just so much emphasis on protection and it may have gone too far.I’m a more “suck it up, sister” mother type of thing.Good for you. Alex is gonna ... we’re all gonna work for Alex. Alex and Louie, they’re lovely. That’s true. That is absolutely true, 100 percent.So Jonathan Haidt, “The Coddling of the American Mind.” I get that. An outstanding book.The only thing I’m gonna say is these intellectual dark web people exhaust me with their whining. Stop, like if you say stupid things, you’re gonna get people attacking you. When I say stupid things on the web, people attack me. That is the game. If they want to be famous, they have to suck it up.Yeah, but there is a ... I do think there is a Princess and the Pea construct.Suck it up.Where all of a sudden everybody is just so offended and so angry at everything. Too bad.And the moment you’re a victim, you’re right. If you’re offended by something, you’re automatically right.Oh, suck it up.I don’t think it’s the way it should be. Suck it up, Scott. Suck it up.Well, right back at you. Suck it up. I’m gonna suck it up. I suck it up all the time. Snowflake. Snowflakey. I’m not snow. I don’t care either way. I don’t care if people like me or dislike me. I do not care. It’s fine if they want to bar me from things, I don’t care. I’m not gonna get all indignant. I’m not gonna have a hissy.By the way, my brain almost exploded today.I can see you having a hissy.I was about to go on ... I was getting miked up to be on MSNBC and I look up and you’re there on “Morning Joe.” I was ... I did it two weeks ago or a week ago. Yeah. That was timing.That was tape recorded?Timing is beautiful.Wow, it seemed very timely. I know, with the chemical spill and everything. I look like a genius. I look like a freaking genius, I do.By the way, and you’re gonna hate this question, is there just a ton of sexual energy between those two?There is. I’m sorry to say.I’m about ... they’re about to throw down on the desk.There is energy. Oh my god.They did, they kissed for me. Go look at my Twitter, they kissed for me. I put it on Twitter.Oh my god. They’re so hot. I would like to see them have sex. I’ve got to say people were like ... they have a lot of detractors on Twitter, when I put that picture up. I was like, “You know what? I had the most fun at that place.” They’re dreamy.I am down with their whole jam. I am good with their jam. Their jam is good. I get why you don’t like it. I do, so just butt out. Same thing.Nah.All right, any ... the only thing I would say for the thing that was the win was the forced arbitration thing that moved from Google to Facebook. Facebook and Airbnb. Fail. Last quick fail and then we’ll go. Fail. What’s the fail?Quick fail. Oh come on.Facebook, Amazon.It’s gotta be, it’s Facebook stuff. I know everyone’s piling on, but this is just really discouraging. It’s upsetting. It really is upsetting. Fail. Facebook, I hope we have the backbone and our elected officials have the backbone to do more than just whine and actually address this problem.I think the fail this week was Sarah Sanders, the editing of that video. When they had that video.Oh my gosh.That to me was ... and taking away the press.Speeding it up. And then Kellyanne Conway?I love that Fox is on CNN’s side. I know.Then Kellyanne Conway said, “Wait, they do that on ESPN all the time.” It’s like slo-mo replay or something.Oh my god. Really?You know who I love though? Her husband. George Conway. Speaking of marriage jams that I love. That’s awesome.He’s now formed a group. It’s called like ... it has some fantastic legal name. What is it? It’s like Definers but it’s good. It’s ... what is it?I think it’s the key to their marriage. I think that’s foreplay. Oh my god, Scott. They are so like five minutes from divorce or something.I think he goes out and he says something and she comes home and she says, “If you say that again ... “, and then they go at it. No, no.I think it’s total foreplay.Scott, Scott. Oh my god. I’m trying to keep this clean and you always manage to bring in like ...Do you think he has an Android phone? Do you think that’s killing his vibe?Anti-Trump club. He’s competing with the Federalist Society and it’s called, hold on ... oh wait, this is such a good name.Do you know Kellyanne Conway? Do you know her?I have never met her. Checks and Balances. Oh my god, the group is called Checks and Balances started by George Conway. I love him.Checks and Balances. I love him. I would like to be his friend. I would like to go to their house for dinner. If they would invite me, I’m here in D.C. Conways, George Conway, I have a man crush on you, like I can’t stand with this Checks and Balances. It is so good. It’s better than The Definers. I would not want to get in the way of Kellyanne Conway. You better be careful there. You might disappear.You know what? I can ... Don’t worry about it.Seriously.I just want to be his best friend. I just want to hang with him.You want to roll with him?Yes. There is a great profile in the Washington Post about the two of them that is brilliant. It’s a brilliant depiction and since then I’ve just been ... they’ve been my like Kardashians, I don’t know. Anyway, all right, Scott. It’s time to get out of here. This is a lively one this week. I will see you next week.Last thing. I know I keep expanding this. The most interesting thing that came out of your Benioff interview?Oh, that’s coming on Sunday. Yes, the stuff about the homeless. I think he has been pushing this shaming, some people think of him as a blowhard. I asked him that directly. I don’t care if he’s ... he’s a good blowhard as far as I’m concerned and he’s pushing on the homeless stuff and pushing for them to give money and to take their hands off of their giant sums of cash and hand it out to people less fortunate and look for solutions, because it’s not an easy solution in San Francisco, the homeless problem. It’s not ... nobody looks good. The whole gang doesn’t look good there, but these people with money and means and ideas should be part of the solution, and I like that. Go Marc.Go Marc, in this case.Superhero Marc.The best part was his shirt.He looks like a guy you want to hug. He’s very big and huggable. He’s big. He’s like 6’5”. He’s really tall.That’s a big dude. He was like eating food. He brought David Blaine. I don’t know why he was there.The magician?Yeah. I said, “The magician?” And he goes, “Well, he’s a person too.” David Blaine?I’m like, “Yeah, but he’s a magician.” He was there. I don’t know why. He had a crew. He brought David Blaine. Whatever. He was late and he brought David Blaine, so there you have it. Whatever. Wow.We had a great time. It was at the top of Salesforce Tower. You could see the ... speaking of the fires, you could see the fires and the smoke ... the smoke from the fires. It was ...Yeah, speaking of under-reported, right?No. That’s been reported.Literally California is on fire and there’s just so much chaos, we barely notice.It’s very sad. I was there for two days.It is sad.It was hard to breathe. I actually felt like I was in Beijing or something. It was really sad and it cast a pall over the whole city and the people dying. The extent of it has not been known and it’s sad that entire towns have been decimated and people have died in just terrible circumstances. Actually that’s another fail of the week. I know I’m all out here, to come out and say that the Forestry Service is at fault here.Oh don’t even. Don’t even.I’m thinking, “Okay, I live in Florida. Are all the hurricanes the Forestry Service’s fault as well?” It’s just ... that’s just so ...That was a depressing moment, but again, what a surprise. Yeah. There we go.Anyway, it’s time to get out of here. I will thank you for doing it. We’ll look forward to talking next week. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.One senator says the company \"actually encouraged anti-Semitism\" by hiring an opposition-research firm.A Verge affiliate site"}