{"id": "What happens to free speech when we all live in a virtual world?", "paragraph": "Palmer Luckey thinks a lot about the future of technology, but he doesn’t worry much about it. The Oculus founder, who is now building tech for the military, doesn’t lose sleep over the kinds of concerns that weigh on a lot of technologists, like artificial intelligence or facial recognition software. “I’m a big optimist on technology,” Luckey said Thursday from the Web Summit tech conference in Lisbon. “In science fiction, so often technology is portrayed as this doomsday technology, like one thing or another is going to crush us all. I think that the reality is actually pretty boring. “Society is going to continue to get better, technology is going to continue to get better. [We’ll] have little stumbles along the way, but fundamentally the nature of humanity is not going to change too much,” he added. “I think we’re going to get through all this stuff.”That’s not a huge surprise coming from Luckey, whose entire career has been on the forefront of building new technologies. He sold his virtual reality company, Oculus, to Facebook for $3 billion well before VR was a mainstream technology. (It still isn’t.) But what if Luckey had to pick something on the tech horizon to worry about? Free speech, Luckey said. That’s not surprising considering there are some who believe Luckey may have been fired from Facebook for being a conservative. (Not true, says Mark Zuckerberg.) But Luckey’s concern is probably not what you think. He believes that, eventually, we will all spend “huge portions of our lives in virtual environments,” presumably like the movie “Ready Player One” or like the virtual avatars Facebook pushes as a way to stay connected with family and friends.  “I worry about a time in the future where people are spending a huge amount of time in virtual spaces and do not have the ability to talk about certain ideas, with the ability to really have any concept of free speech,” Luckey said. “I worry about a world where we have a hypothetical right to free speech ... out in the real world, and that that right doesn’t matter because very few people even spend most of their time there.”It’s an interesting concept. If it’s true that we’re all going to spend time “living” in virtual reality, who will be tasked with making the rules of that society? The government? The tech company that created it? Will there be any rules? It’s certainly not a problem right now — at least not in virtual worlds. VR headsets are far from mainstream. Augmented reality headsets, which blend the real world and virtual worlds, are in their infancy. Free speech in the real world is still a major problem for tech companies trying to police their platforms for racist or dangerous speech. Just ask Luckey’s old employer, Facebook. But Luckey is clearly planning for a world most of us cannot yet imagine. “I also think that worry is happening on a timeline that’s so long,” he said. “I’m pretty confident we’re going to solve those problems well before it’s any kind of doomsday.” Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}