{"id": "Recode Daily: Inside the hype and reality of the voice technology ‘revolution’", "paragraph": "Voice interfaces like Alexa and Siri have been adopted faster than almost any other technology in history — even surpassing the smartphone in their four-year trajectory. Approximately one-quarter to one-third of the U.S. population already owns a smart speaker like the Echo or Google Home; the global number of installed smart speakers is going to more than double to 225 million units in two years. But to be revolutionary, they will need to find a greater calling — a new, breakout application. Here’s an in-depth look at where voice tech is succeeding (music, radio, podcasts), where it’s not (shopping) and who the winners will be. [Rani Molla / Recode][Want to get the Recode Daily in your inbox? Subscribe here.]  Amazon is now selling Apple’s latest devices on its website — including iPhones, iPads, Mac computers, Apple Watches and Apple TVs, but not the Amazon Echo competitor, HomePod. Amazon previously stopped selling the Apple TV media-streaming device on its site in 2015 because it wasn’t compatible with its own video service; it previously only sold older iPhone models. [Mark Gurman and Spencer Soper / Bloomberg]Google is trying to define a recognizable in-house hardware identity, something that’s hugely important as the company tries to move beyond search, software, advertising and artificial intelligence to compete with such hardware stalwarts as Apple, Amazon and Samsung. Meet Vice President of Design Ivy Ross, a former jewelry designer who added the mint-green power button to the Pixel smartphone, turned your Google speakers into river pebbles and signs off on every Google hardware product before it hits the shelves. [Katia Moskvitch / Wired UK]German database giant SAP is buying Utah-based startup Qualtrics for $8 billion in cash. Qualtrics, which specializes in “experience management,” or XM, provides tools to help companies gather feedback and optimize their products; it was scheduled to hold its much-anticipated IPO this week, which could have valued the company at more than $5 billion right out of the gate. Founded by CEO Ryan Smith with brother Jared and father Scott, Qualtrics is known for not accepting any venture funding until it had been in business for a decade. [Matt Weinberger / Business Insider]Alibaba sold more than $30 billion worth of goods during its 24-hour self-created shopping holiday called Singles Day; the 10th edition of the sales festival easily topped last year’s sales of $25.3 billion. Here’s how the Chinese retail giant turned the celebration of singledom — it’s always on Nov. 11, or 11/11, a date chosen for its likeness to “bare sticks,” which is Chinese slang for bachelors —into a sales event bigger than Black Friday and Cyber Monday combined. In 2009, Alibaba started promoting the day as an opportunity for consumers to splurge on gifts to themselves, offering steep discounts through its consumer shopping site for branded goods, Tmall. [Eamon Barrett / Fortune]The previous story was from Fortune magazine, which was just purchased for $150 million in cash by Thai businessman Chatchaval Jiaravanon — the storied business publication’s second new owner this year. The 88-year-old magazine, which first published months after the 1929 stock-market crash, continues to carry weight with business elites, reflected in the attention paid to rankings such as the Fortune 500, special issues like “World’s Most Admired Companies” and cover profiles of prominent chief executives.[Jeffrey A. Trachtenberg / The Wall Street Journal]First there were the influencers, and then the microinfluencers. Now meet the nanoinfluencers — people who have as few as a thousand followers, are good at social and are willing to advertise products. Their relative lack of fame is one of the qualities that makes them approachable by companies; when they recommend a shampoo or a lotion or a furniture brand on Instagram, their word seems as genuine as advice from a friend. Brands enjoy working with nanoinfluencers partly because they are easy to deal with. In exchange for free products or a small commission, nanos typically say whatever companies tell them to. [Sapna Maheshwari / The New York Times]Facebook followed Uber and Google and is ending forced arbitration for sexual harassment cases. Arbitration is now a choice rather than a requirement at Facebook. [Kurt Wagner]Former Snap No. 2 exec Imran Khan has a new title: Entrepreneur. Khan plans to launch an e-commerce startup in 2019. [Kurt Wagner]Tarot cards for tech optimists.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}