{"id": "Full Q&A: Former Secretary of State Hillary Clinton on Recode Decode", "paragraph": "On the latest episode of Recode Decode, former Secretary of State Hillary Rodham Clinton spoke with Recode’s Kara Swisher in front of a sold-out crowd at the 92nd Street Y in New York City.Reflecting on the reasons for her loss in the 2016 presidential race, Clinton bashed Facebook’s executives and offered her support for the “internet bill of rights” drafted by Democratic Congressman Ro Khanna. But the conversation also delved into a range of other topics, including the security of the 2018 midterms; the #MeToo movement, Christine Blasey-Ford and Clinton’s recent comments about Monica Lewinsky; and why she’s concerned about China’s current lead in artificial intelligence.”China is currently creating the most intense surveillance system that’s ever been created in the history of the world using facial recognition and AI is behind it,” she said. “… I care about the coercive control that governments will have over our lives, and everybody should care about that.”“We have willingly now for more than a decade given up our most personal data that is the real guts, the bloodstream for AI,” Clinton added. “You know, our personal data is the most valuable commodity in the world right now. I mean, it’s far more valuable than any energy source or any other commodity you can think about, and we have given it over. We’ve given it over to companies, by and large, but that is just one little step away from governments.”You can listen to Recode Decode wherever you get your podcasts, including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Or watch the full podcast taping on YouTube. Below, we’ve shared a lightly edited full transcript of Kara’s conversation with Hillary.Kara Swisher: Hi, is it your birthday?Hillary Clinton: Today is my birthday. Truly. All right. What better way to spend it than right here at the 92nd Street Y? That’s what I think. You told me backstage your grandchildren are mad, are angry with me. Yes, they are. Okay.Yeah. Because you left a party. I did.Yeah.I did. They put on a little party for me. It was ... Yeah, exactly. It was so sweet. Sort of made a cake. Actually, they decorated the cake. And we played a game or two and then I said, “Well, I have to go.” “Why? Why, grandma? Where are you going?” I said, “I have to go talk to Kara Swisher. That’s why.” I’m happy to be here! Good.Yeah. We have a lot to ... we’ve got a lot to get through and a lot to talk about. We do. Hillary and I met yesterday to talk a little bit about what’s going on today and there’s a lot in the news. There’s so much happening!So much happening. I mean, really. We’re going to have, we’re going to go from topic, to topic, to topic. We have questions from the ... are you going, are you okay? Yeah, I’m getting ready. This is the third interview we’ve done. We did one before, way before the election. That’s true. We did one right after the election. Right, spring of 2017. Right. Right after. And then now.Exactly. Third time’s the charm. Yes. What I was saying to Hillary backstage is, every time Mark Zuckerberg talks to me it ends in disaster and tears for Mark Zuckerberg. You’re welcome.I’m not hiding anybody’s data, so I’m in good shape.I’m gonna start with the news of today.Yeah. The bomber. Today this guy Cesar, and I don’t care what his name is, had this on his car.Right. With you with a target on it.Right. Other people, lots of people with a target. Then part of the thing said “this message was approved by Donald Trump.” I know. Ooh, yeah, you’re right. What a surprise. Let’s talk about that, about what’s going on, how you feel about this. Now you got a pipe bomb delivered to you at your home. Talk about that. Well, first, I want to just express my total gratitude to the secret service, the FBI, law enforcement across the country. The fact that this man has been apprehended and there is apparently a very credible, strong case against him speaks volumes about how professional and focused our law enforcement happens to be. Of course, when there’s a bomb involved you have to have an extraordinary level of calmness and just focus to be able to deal with that, and I am incredibly impressed and appreciative as someone who, as you say, was a target of this kind of alleged, purported attack. Look, I think we’re living at a time when the atmosphere is so volatile, filled with vitriol. We have a president who engages in reckless rhetoric all the time, that aims at demeaning, demonizing all kinds of people. He whips up the crowds that come to see him and it’s almost an addiction relationship that we’ve got him up there just urging them on, they chanting, and giving back what he needs, I guess, to make himself feel strong and important. It’s tragic, but it’s also really dangerous. We’ve seen, that is an example of the danger because look, this man, if he is the person which appears to be, he is responsible for his actions. But we do know enough about demagogues in history to know that when you engage in that kind of action and rhetoric as we’re seeing it from the highest office of our country, aided and abetted by a huge echo chamber … There are people, this guy has a criminal record, there are unbalanced people. Look, I remember when the young man in North Carolina got in his car to drive to Washington, D.C. with his AR-15 to liberate the children allegedly held in the basement of the pizza parlor.That you ran. Oh, that I ran, of course, yes. You know what-There was no basement-Can I just say--and no children, but he did shoot up the place. But there’s excellent pizza there. There is, it’s a great place if you’re ever in Washington. When you, you use the word demagogue. Trump to you is a demagogue.Absolutely. When he is doing this, like today, the reaction, how did you react to his reaction to-Look, he’s just ... I mean, to me, he just goes through the motions. I mean, at moments like that, when you really need a president — a president who unites the country — somebody on his staff sticks a paper in front of them or words on a teleprompter, which he’s then told to go out and recite. He does it in a begrudging, not very convincing way, and then he just waits for the chance when he can get into one of his rallies again or have any kind of audience that he can unleash himself. Madeleine Albright wrote a book earlier this year called “Fascism: A Warning.” I really recommend it because I’m not only a huge admirer and friend of hers, but her perspective as someone who had to flee Czechoslovakia twice, first from the Nazis, then from the Communists, is something Americans need to be reminded of. She has a quote in there where Mussolini, a demagogue, an authoritarian who used that kind of rhetoric, who inflamed the passions of thugs on the street, who beat up, intimidated, and eventually murdered political opponents, members of the press and the like … Mussolini says, “When you pluck a chicken feather by feather, nobody notices.” Well, I think we now notice. I mean, how can we not notice?Well, except that day by day it’s a different thing. Last month was this, then there was that, there has been about six things in a row. When you’re talking about that, where does it, where do you think it’s going to lead? It depends upon what happens in this election. I have never been surer in my life that an election is consequential for literally the future of our country. If I had lost to kind of a normal Republican-Like who? Like who? What’s a normal Republican?Yeah. Yeah, well, I’m not naming any of them, they’ll be ... they would be too nervous about that. But somebody with whom I disagreed with on everything like I have in the past, I wouldn’t be happy. But I do remember, after 9/11, and those of us in New York have special reason to remember, George W. Bush went to an Islamic center and he spoke to the people there, and he spoke to the people of our country saying, this is about terrorism and terrorists. It’s not about law-abiding people who we live with in our neighborhoods and our communities. Can you imagine that happening today? I can’t, because we’ve seen no evidence that it could, or if it did, again, it would be begrudging, unconvincing, and then out the door, and back into the crazy stuff that we hear all the time. Look, this election, now 10 days away, will determine whether we actually have workable checks and balances to hold this administration accountable. In the absence of that, winning the House, maybe winning the Senate, I really do fear as to what will be next. What kinds of behavior and action we might see from him.Do you fear? Because you are ... I fear for the country, yeah. What about yourself? No. You are their favorite person to talk about. Locking you up, hurting you-Right. -bombing. Yes, well, you know ...I’m sorry, but is that not frightening to you? No. No, and I’ll tell you, I mean ... First of all, you cannot, if you at all are able, live in fear. You just can’t. I mean, there’s so much else that is great about my life, including my grandchildren and everything else that goes with it. I saw what they said about me. I saw the t-shirts they were selling, I saw the mugs they were selling. I saw the bumper sticks they were selling at their convention. I’d never seen anything like that. I mean, it really did go far beyond the bounds of political disagreement. A lot of it was just plain old fashioned sexism and misogyny and I realized, but I was vying to become president, which apparently was quite threatening to certain kinds of people. They were doing everything they could to diminish and demean me. Margaret Atwood, who wrote “Handmaid’s Tale,” said, “Oh my gosh, it was medieval, wasn’t it? What they did to you.” Yeah, they tried, but I would never give them the satisfaction of thinking that they had ever gotten to me, even if they did get to me, which they have not. That’s not going to happen. Now, however, when you do get a pipe bomb sent to your address, you do worry about all the other people. I mean, people who open your mail, people who deliver it, people who might be in the vicinity. Of course, I worry about what we can do to keep everybody safe, but circling back to where we are right now, you’ve got a concerted, consistent attack on our democracy. You’ve got someone who is degrading the rule of law. The very bureau, the FBI that ran the investigation to find this guy, has been insulted and attacked by this president. You have the delegitimizing of elections. Every effort being made to suppress and purge voters, to not count votes, to try to “rig the system,” as it is sometimes alleged, but clearly it’s happening in places like Georgia, as we speak. Where if there were a free, fair, transparent election, I am confident Stacey Abrams would be the next governor of the state of Georgia.When you’re in this situation, what do you imagine is going to happen next? If this election-Right. -doesn’t go that way?Well, first of all, I’m doing everything I can. I hope all of you are too, to make sure it does go the right way. We’ve got the most amazing candidates. Lots of women, lots of people of color, lots of young people. I mean, it would just be such a great sea change. Look, if we’re not able to rein him in, I think there will be wholesale firings, particularly in the Justice Department, perhaps including Robert Mueller. There will be increasing corruption, because remember, the level of corruption is something we haven’t seen since probably the 1920s and the Teapot Dome scandal. So many of the decisions that are being made look to be connected to what’s in the financial interests of the president’s family, corporation and corporate allies. We’ve got the likelihood that as bad as voter suppression has been, and it is, that it could be even worse. We know that his views about every issue is resulting in the wholesale elimination and reversing of regulations. I mean, until he became president, I thought the issue about the dangers of asbestos had been settled. There’s so much more damage. Some of it very obvious, very clear, makes the headlines, and a lot of it just slowly eroding the function and services of government. How much do you feel at fault for this? Do you feel at all in terms of, do you think about that? I know-Sure. No, no, look, yeah, if I’d won, none of this would be happening. Yeah, I do. I do think about it. Do you think about that at all? Of course I do, and I wrote a whole book about it. Yeah, I read it. I read it. Which now is out in paperback, for anybody who hasn’t read it yet. In it I talk about, look, we made mistakes. I made mistakes. I don’t know any campaign or any human being who doesn’t. That kind of is baked into it. But there were some very unusual, unprecedented activities that were going on in that campaign. Obviously, you and I have talked before-Right, we’re going to get into that. -about the Russians-Right. -and what they did and what the impact of it was, I believe, likely to have been with respect to the outcome. There were things happening that had never happened before and that was then, now nearly two years ago. From everything we know, a lot of it is still happening because there’s no incentive for this administration to really do what should be done to keep foreign adversaries, not just the Russians, but if you’re sitting in Tehran, or in Beijing, or in Pyongyang and you say, “Hey, the Russians did this. Hey, let’s let us give it a try.” You’re going to have even more foreign interference, influence peddling, propaganda going on and there’s no concerted effort to try to stop that.When we talked right after the election, you were raising these issues-I was-Around the Russians. I was. Most people, the minute we got offstage, it was Breitbart, Fox News, all the others saying you were crazy. Yeah, they’ve said that before. Yeah. They may not listen to you, but they’re still saying it. You talked about this, and in detail. What have you learned since of what you think happened there? Then let’s get into social media’s relationship. Yes, right. Well, after the election, I did not know what happened. But I was determined that I would try to find out to the best of my ability, given fast-moving events and unveiling of information. Look, I really believe that there was a combination of factors that change the outcome at the very end. Starting on October 7th, the day was so consequential. It started with the first public admission by our intelligence agencies in the Obama administration that the Russians had been hacking. Okay. It was also a warning that we don’t know what else they’re doing. We’re trying to figure this out. That was in the morning. A few hours later, the Hollywood Access tapes came out. A few hours after that, Wikileaks dumps John Podesta’s emails. Now, I don’t believe in coincidences. Why were those dumped? They were being held to be dumped in order to divert attention from anything that might derail Trump. You know, in the first Mueller indictment, which some of you may be interested in reading both indictments so far. The first one, on social media, basically has a line in it where it’s an intercepted conversation or email where the Russian general is directing his intelligence agents, do everything negative you can to Hillary Clinton, but not to Bernie Sanders or Donald Trump. We support them. This is something that had been churning and going on for many months and we know about the DNC emails, and now all of a sudden, the Podesta emails. What was fascinating about it is the way that they were weaponized. This pizza, so-called pizzagate thing, came from a totally innocent email that the right, aided and abetted by the Russians, whipped up into this ridiculous, terrible conspiracy accusation. We now know a lot more than we did when I started writing my book. But when I was writing my book I had enough evidence, the Russians, the suppression of votes, which was particularly obvious in a state like Wisconsin… sexism, misogyny. There was enough evidence to be able to make the assertions that I made in the book, because when I came to talk with you in the spring of 2017, I hadn’t finished the book.Right. I felt confident enough in the face of the disbelief and the dismissal of what I was saying. Well, I didn’t know about the Trump Tower meeting. I didn’t know about the many meetings and connections between people close to Trump, and his campaign, and Russians, Russian agents, Russian proxies. There’s a new book out which seems to be the best analysis of this by Kathleen Hall Jamieson, who’s a professor at the University of Pennsylvania, who is an expert in elections and she has studied everything. Here’s her conclusion, this is not mine. Here’s her conclusion: The manipulation of social media certainly changed people’s minds. I mean, you would not invest money and effort, a huge intelligence operation coming from Russia, the role that Cambridge Analytica played, all the rest of that, unless you were hoping to change some minds on the margins, a couple thousand here, a couple thousand there. Then the hacking and then the use of the Wikileaks obviously was another big factor, which she actually thinks was even more consequential. Then of course, October 28th, we got this surprise from Jim Comey, which devastated me, and then a few days later he, on a Sunday afternoon, does a little two line email. Just kidding, basically. Nothing there, which didn’t do me much good. This all happened. When I talk about “what happened,” I’m not just looking backwards, I’m trying to say the Russians are still in our electoral system. We know that media and other sources of information are being manipulated. We understand that. Let’s do something about it because we can’t afford for this.Before we do, one of the things you talk about is social media. You’re not on Facebook that much, I guess. No, not too much. Yeah, okay. Yeah. Talk to me about that. The idea of what they’ve done. Sheryl Sandberg was a big supporter of you. A lot of Silicon Valley was. Not as much as Barack Obama, it was interesting. How do you look at those? What is their culpability in this from your point of view?Well, I mean you’re really the expert on this, Kara, and the stuff that you write and the lines you connect is really informative to me. I think that what happened is a very clever adversary, political adversary in the case of Cambridge Analytica and others, but literally a national adversary, national security adversary in the case of Russia, just exploited the heck out of Facebook. Right, and used it for the way it was built.Used it both as it was built, but also manipulated it and the purchase of information, the purchase of posts, the purchase of ads, the purchase of whatever that was going on, paid for with rubles in, yeah, exactly. In the first instance, there was a very well-organized effort on Facebook to go far beyond the usual methodology that we’d seen, first off in the Obama campaign. I had the same people working for me basically, and they were going kind of Obama 2.0, and we were working really hard in this arena, about how you identify voters, and give them information, and answer their questions, persuade them. What was happening in the campaign, though, and this was a combination of all the efforts going on, is that Trump and his team were playing a whole different game. It wasn’t until after the election and questions started being asked, that Facebook, or Twitter, or anybody else began to try to delve a little more deeply into what their platform had been used for. What do you think of those companies, then? Look, I think we are in a very, we’re certainly in a new, uncharted territory. I think that the companies themselves are going to have to be held accountable. How so?I’m a supporter of the efforts of Congressman Ro Khanna, Professor Berners-Lee, others who are trying to come up with some kind of regulatory platform that would give support to the continuing open platform we want there to be, so people can communicate, but with more accountability imposed upon the companies, so that they would have to recognize that’s what’s happening now is far beyond anything Mark Zuckerberg thought about in his dorm in Harvard. When you have the military in Myanmar using Facebook to stoke genocide against the Rohingya, that is not something that is going to bring people together and create community. Just the opposite. It is being used for the worst kinds of political purposes. Now, Facebook just admitted Iran has taken a page from the Russian book and they’re in there trying to figure out, “Okay, how do we sow discord, how do we create divisiveness within America?”What I want people to understand is, yeah, it might have been most apparent to us from the first time in the 2016 election, but our adversaries play a long game. And part of their long game, and this is part of Putin’s whole worldview, is to cause as much divisiveness within the United States, pitting groups against each other, creating, as they did during the campaign, phony demonstrations and really aggressively negative ...Advertising.Advertising, in order for people to kind of get off balance and …What would you say-... walk away from our democracy.Have you seen Mark or Sheryl since the election?I have ...Say, “Thanks a lot, I appreciate it”?No. I mean, look, I think they ... they knew more during the election than they admitted, but I think they didn’t understand the full implication of it.What about the Obama administration?Well, I think that, you know, they were in a terrible bind. When it became clear that the Russians not only had hacked materials, emails, from the DNC, but now we know from the second indictment by Mueller, stolen a lot of our voter data, which is sort of a lifeblood and ... So we always wonder, well how did the Trump campaign or one of their outside groups know to target, you know, Joe Smith in Eau Claire, Wisconsin with this message? Well, they stole the data we had acquired, both our campaign and the Democratic National Committee that gave us our persuadable targets, you know, people who could go either way. When all of this was being discovered, I think starting in August of 2016, the intelligence officials within the Obama administration went to see what’s called the Gang of Eight. The Gang of Eight are the four leaders in the House, four leaders in the Senate. The majority, minority leader and the chair and ranking member of the intelligence committees, that’s what’s called the Gang of Eight. They went to brief them and as I understand what happened, they basically said, “We’re very concerned about this, and the President’s going to confront Putin and Brennan’s going to deliver this message to the Russian national security director, etc., and we want to warn the American public because this is a threat to our election.” And Mitch McConnell said, “If you do, I’ll say it’s partisan, and I will go after you for it.”That’s basically what happened. That put the Obama White House in a really difficult position. Now, they also thought I was going to win. I mean, all of their polling, all of their analytics plus ours, everybody said I was going to win. So I think that their thinking on this, which I really ... I can’t help but understand how difficult the problem was, was what do we do? McConnell does this, which he’s fully capable of doing, as we have seen since, no line can not be crossed in order to undercut our democratic norms and the regular order of the Senate. I think they just decided that they couldn’t do it. Now there were some effort to try to get out to the rest of the world — Harry Reid wrote a letter to Jim Comey saying, “If you know things about what’s happening in the election, you owe it to the American people to tell them.” But the trade-off they faced was a difficult one. I wish they could have figured out some way to try to ... because we were trying to get as much information as possible and we didn’t know what they knew, that was not within our purview.Are you worried ... I want to get to the 2020 elections and some other issues. Are you yourself worried about these elections now with the continued ...?Well I’m worried because even the intelligence officials in the Trump administration are worried. They went ... you had the director of national intelligence and homeland security and the CIA, everybody came to the White House briefing room a couple of months ago and basically said the Russians are still in our systems. Now, they were trying to talk to the guy who lives at the White House, and they did it by hoping that what they said would be on “Fox & Friends” so that he would actually see it and maybe, you know, think about the country. If they’re worried about it, and Dan Coats, who’s a very ...National security.He’s a, yeah, he’s a ... yeah, he’s a Democrat, he’s a director of national intelligence. He’s a very thoughtful, smart guy. He basically said, “Yeah, the light is blinking red.” Now, I don’t know how much more specific you could be. The Russians are in, how are they in, what are they prepared to do, for whom — since Trump is not on the ballot. Well, we know they got into voter registration databases. There are so many concerns about already existing voter suppression and purging that’s going on in many states but Georgia seems to be the prime example. Say it doesn’t work and that we have an election and the Democrats win the House. Are you in favor of impeachment proceedings?I think that if there is evidence of high crimes and misdemeanors, well then, that’s the responsibility of the House, but I don’t think that they can assume that until the Mueller investigation is done. That seems to me to be the appropriate process. But there’s a lot that has to be done anyway. Every single committee has to do investigations and hold hearings about what is being done in the agencies as they attempt to turn the clock back, and it’s not just turning the clock back on the Obama eight years. It’s literally turn the clock back a half a century. Really trying to just rip the guts out of civil rights enforcement and all kinds of other important matters like the environment, climate change. Whatever we know is important, they have it under their thumb right now. A House under a Democratic leadership, I think will have to come with a positive agenda. We need to reinstate the Voting Rights Act, we need to do a whole lot of other things, deal with campaign finance reform and the like, and begin to do a lot of investigations. They’ve got to get off the dime quickly so that they can start reporting to the American people about it. The final thing on this whole area is, you know, when Mitch McConnell said the other day that they were likely going to look to social security, Medicare, and Medicaid because the deficit and the debt have exploded because of their very, I believe, irresponsible tax cut, you’ve got to do both offense and defense. People need to know before they vote on November 6 that the Republicans will come right after your social security and your Medicare and you Medicaid. I saw that after Bush won his second term. As soon as he won, they began going after social security, Medicare, and Medicaid, and we had to really stop them from being successful.You seem rather passionate. I am really, really ... I see it.Well yes, I am. We’re going to talk about 2020 in a minute. Do you want to run again?No. No.That was a pause...Well I’d like to be president. I think, hopefully, when we have a Democrat in the Oval Office in January of 2021, there’s going to be so much work to be done. I mean we have confused everybody in the world, including ourselves. We have confused our friends and our enemies. They have no idea what the United States stands for, what we’re likely to do, what we think is important, so the work would be work that I feel very well prepared for having been at the Senate for eight years, having been a diplomat in the State department, and it’s just going to be a lot of heavy lifting.So are you going to be doing any of that lifting? Do you feel like ...Oh I have no idea, Kara, but I’m going to ... I’m not even going to even think about it til we get through this November 6 election about what’s going to happen after that, but I’m going to everything in my power to make sure we have a Democrat in the White House come January of 2021.Who among ... we’re going to talk about your role in that in a second, but who among them are you interested in?Well, I know everyone who’s running or thinking of running or possibly running, but there’s always that period between, “Hey, that sounds like a really good idea,” and then trying to actually think it through, see if it is the right thing for you to do, see if you can raise the money, all of the questions that go into it. So I’m not going to handicap the race before anybody actually gets into it. I think we’d have a number of excellent candidates who would be really formidable on the campaign trail, but let’s wait and see who it is. I mean we may have as many as 15, 20 candidates and that’s a big group to try to sort itself out. I’m just going wait and watch it happen.Do you have anyone you’re particularly interested in?No, I’m ...No ...There are a number of excellent potential candidates. Look, first of all, if we don’t win on November-I’m going to start naming names and see what you ...Oh okay, if you want to, but-All right, I will. Okay-But if we don’t win on November 6, honestly ... I know that sounds farfetched, but this administration, if they continue to control all branches of government and they have been stocking the courts with ideologues, you will find that it will be much more difficult to run. People who have never had to face the fire, once they get out there and they start being the target of the vitriol and hatred that comes against anybody who criticizes Trump, that’s going to cause a number of people to do a bit of soul-searching. I think we’ve got to give everybody who is thinking about it or even people who wake up on November 7th and start thinking about it, we’ve got to give them the space to make what is a really serious calculation depending upon what the political situation is.Can talk a little bit individually? And then I want to get to Saudis. Warren.What?Warren, Elizabeth Warren.Oh, Elizabeth’s a great ... look, she’s running for reelection, she’s obviously going to be reelected overwhelmingly, and she’s got a great message, she’s got a great passion for the fight to restore the middle class. If she decides to run, she’ll have a lot to say.Bloomberg.Well, you know, I think Mike Bloomberg becoming a Democrat should at least suggest he’s thinking about it. I had the same thought.Yeah, I mean, great minds and all of that. I think he is ... he has overwhelming resources, but he also has a real interest in running things and making them work better. He’d have to get out there and persuade Democrats that he was actually in the primary to be the Democratic nominee, but if he gets out there, I think he’ll have a lot to contribute. Let’s see ... Kamala Harris.Kamala is a fantastic human being as well as a terrific senator, and she just brings a whole very fresh and open approach to a lot of these issues that she cares deeply about, that she’s worked on as attorney general, as a prosecutor before that. Being from California is a big deal because the California primary will have by far the largest number of delegates. The politics and her obvious interest in these important issues would stand her in good stead.Oprah. You know, look, she’s an icon, and she has said she’s not interested and-I don’t believe her.You don’t believe her? Well, then-I’m teasing. I believe her.You believe her. You do believe her. Well, I believe her because I mean, I mean she’s got almost the perfect life right now, you know?Right.She has ... I’ll tell you a story that is kind of related, although a little off topic. When Aung San Suu Kyi, who I got to know quite well when I was leading the opening of the United States to actually go back into what was then called Burma, Myanmar, she was the human rights icon, “the Lady.” The lady who had lived in house arrest, who had stood up for democracy in her country. She and I had a really long couple of conversations about her decision that she was going to go into politics. I said to her then, I said, “I can understand why you want to do that, you want to be part of helping to forge this democracy that you have fought for, suffered for, over so many years, but once you go from icon to politician, it will be a very different world that you will face. The calculations, the thinking that you have to make as a politician oftentimes pushes you to compromise, forces you to have to ally yourself with people that you agree with one time out of a hundred. There’s just a lot that goes into it. It is the making of sausage.”I think that Oprah is so smart, I think she would say, “Look, I can help influence the debate, I can be talking about important things that we need to ...” you know, be a country that starts talking and listening to each other again rather than getting into the political arena.So she wouldn’t want to like hang out with Sean Hannity, for example.Well, no Democrat likes to hang out with Sean Hannity. You know, I mean that’s one of the problems. The propaganda value that Fox provides to the Republican Party is incalculable. It is so incredibly important to their brand, to their messaging. They just turn themselves over to be in an alliance with Fox. I think that it’s difficult to go on their shows, very few Democrats any longer do because you know, there’s no such thing as having a reasonable conversation. You’re just going to be beaten up and chopped up and delivered to the audience so ...Would you go on Fox News?I’ve gone on Fox News. I’ve been on Fox News, and you know, look, there are a few people that you feel like you could have a reasonable conversation with. Sean Hannity is not one of them. That would not be my recommendation to Oprah and anybody else.I would agree. I’m going to get off these things, I want to talk about you ... I’m going to talk about personal things with you and also but running. One of the things that has happened, let’s start with the political part. There’s been a lot of articles, “Hillary should shut up,” “Hillary should not talk,” “Hillary’s got to go away.”Right.Okay. But those articles are there, you know them.Of course, yeah.What do you think of those?I think they’re ridiculous.I got that. Where, from your perspective, do they come from?Well, I don’t know. I noticed that there were no articles telling Al Gore to go away or John Kerry to go away or John McCain or Mitt Romney to go away. Mitt Romney is going to the Senate, that’s where he’s going. I don’t really know. I think ... we could speculate, but I don’t have any evidence or information-Oh, please speculate.Speculate, okay. Look, I think some of it, and I write about this in my book, some of it is just of the same category of the sexist behavior and sexist kind of talk around me and my campaign, but not only me. You mentioned a couple of my former colleagues, from having been in the Senate. Elizabeth Warren’s on the floor of the Senate delivering a speech against Jeff Sessions to be Attorney General and she’s reading from a letter by Coretta Scott King, who had doubts about Jeff Sessions years before when they wanted to make him a judge. Mitch McConnell goes to the floor and as a majority leader, he has certain prerogatives and he basically orders her to stop talking because she is attacking the character of a fellow senator. That’s where the phrase comes, you know, “Nevertheless, she persisted.” She kept talking, and he ordered her off the floor. I never saw that in eight years. What was especially interesting to me, because I was watching it in real time, is that she left the floor and a Democratic senator, a good guy, comes and reads the rest of the letter, McConnell never says anything. Or Kamala Harris questioning, in one of her hearings, and as a former prosecutor, she’s really going after the witness, might have been Jeff Sessions again, and the chairman basically told her to cease and desist, that she was being disrespectful. Now, excuse me. I have seen a lot of the back and forth in the Senate, people can get a little heated. Then look at what happened to the Kavanaugh hearings, right? I mean the way that Kavanaugh spoke to and treated Amy Klobuchar was just outrageous. And also similarly, to Dianne Feinstein. So yes, I have my own experiences. I wrote about those, but I also said in my book, the press, and the political press, is still kind of dominated by an attitude about politics that is very male-centric, very male-oriented. I’ve given hundreds of speeches ... maybe thousands by this time ... and I’ve been on lots of platforms with a lot of male speakers, and male speakers get worked up and they start to shout and they may even pound the podium. Well, I’m the one who is “speaking too loudly.” I’m the one who is being criticized by the political press.So I think some of it is that really pervasive, persistent double standard that exists, and I regret that, because it stands in the way of a lot of women being taken seriously and going as far as they can. You have to persevere through it, you can’t give into it. So when they say that, I basically ignore it for obvious reasons. If you don’t want to hear what I have to say, don’t report on it. Don’t talk to me, don’t come to this event. I mean, you know? There are a lot of ways to avoid it. All right, so …Let’s move though to the personal. We talked ... Hillary and I met yesterday to talk about this issue. Right.The stuff you said about Monica Lewinsky, really disturbing to me and a lot of women. Do you want a redo on that one?Well look, I have talked about this before. This was a really painful, difficult time in my life and it was also hard for the country. I feel very sorry for what she went through and what she was subjected to by the Starr investigation and everyone who mistreated her — mistreated her, in my opinion, just disgracefully. So yes, I’m very sorry about what happened to her. I also know that my decision to work through what happened in my life was very debated by a lot of people who watched it-Whether you should’ve stayed or not stayed?Well yeah, that ... but that’s a question for any person in any kind of relationship, marriage or otherwise, where you confront this kind of real challenge to you. Look, through a lot of work and a lot of counseling, I decided to forgive my husband, to continue with our marriage, our family. I understand how now, 20 years later, a lot of decisions are being reconsidered or looked at again from different points of view. I totally get that, because I’ve spent my entire adult life standing up for women, defending women, in court, in politics, everywhere that I can, and I believe strongly that this moment is a especially critical for women’s voices about their experiences to be heard and be taken seriously.I do want to get in your head, is why say something like that? When she’s a young woman in a position of not-power? Well, you know, I’m not going to rego, re-litigate everything I’ve ever said for 20 years. I’m just going to say what I just said and say that I am very focused on doing everything I can to make women’s voices heard and respected, and I’m hoping that with all these amazing women running for office right now, we’re going to have so many new women’s voices, and if we get out and vote on November 6, we’re going to elect more women, more exciting women to go to Congress, to go to state houses, to be in the debate, and that’s really what’s going to help change. Not just have newspaper articles about things that happened, but actually change attitudes, change laws, change people’s behavior.Have your attitudes changed about-I’ve always been a staunch believer-Yes, you’re the woman who said-Women’s rights are human rights, absolutely. My attitude has been consistent and it’s always been consistent and I think that people will have to take responsibility for themselves and their actions but I also think that we need to make sure that no voice is stifled or ignored any longer.Do you see why people were upset by that?Well, people have been upset with me for reasons that are ...All right.Going back I guess since my birth, it seems like. Yeah, but this one is ...So yeah, I mean ... I accept that. I accept that people can be upset about things that I say or things that I do but I have been consistent, I will keep fighting for the same thing and I will always keep fighting for women’s rights and roles.What do you make of this #MeToo moment?Well I think it’s long overdue. Look, when I was coming up in college, law school, there were lots of really uncomfortable moments. I write a little bit about some of the harassment that I faced, although I never felt like I was really at risk or in danger, but I do write about meeting with a bunch of men in an election that I was part of in Indiana in 1976 and a guy not liking what I said reaching over and grabbing my turtleneck and just really threatening me, and that was not really pleasant. I know how hard it was for those of us who were in that, you know, that time, to be taken seriously. Not to be dismissed or made fun of or laughed at. All the things that women have had to contend with. And we’re now at a point, having gone through that, and a lot of us my age, you know, you just sort of sucked it up. You didn’t, you know, you didn’t complain, you didn’t explain, you just sorta tried to get your best outcome. And I remember when I was taking the law student test, I was one of very few women in a big room at Harvard, and I had come with another woman from Wellesley College, and we were sitting there and the men were just literally taunting us, harassing us, I guess trying to throw us off.So, I’m really very grateful that we now have a movement, a moment, where young women in particular are able to, not only speak up, but to defend themselves, to be as brave as they can be and that they’re not alone doing it.Do you imagine it’s gonna last? Look what happened with Kavanaugh.Well, that’s the danger, isn’t it? I mean, I think-What did you think-There is a backlash.What did ... did you think he would-Well look, I’ve had ... I’ve had a lot of reasons to oppose him, and I laid those out in some Twitter threads about what he has advocated for and decided as a judge. I think it was a very unfortunate choice and the most consequential aspect of it may be, and this is the reason I believe Trump wanted him there, is after being one of the main advocates for the most aggressive, outrageous prosecutorial behavior in the late ‘90s, he’s now concluded, conveniently, that presidents should be exempt from any kind of investigation. So we’ll see how all this plays out.But there is a backlash. You know, at the end of it, I really thought, if you compare Anita Hill with her dignity, her stoicism, her integrity when she appeared and tried to do her civic duty to provide testimony, with Dr. Ford, who was trying really hard to explain herself and to not go too far. She didn’t wanna overstate it, and she wanted people to understand it. You had two different kinds of approaches that women can take in presenting themselves. And they were both treated the same way. You know, the person that they were giving evidence against basically came in and just took a really high pressured, very aggressive tone of voice with all kinds of accusations.With Clarence Thomas, it was the “high-tech lynching.” And with Kavanaugh, it was “a conspiracy and everybody’s against me.” And so, here are two women, both of whom professionals, had to already go through a lot to get to where they are in life, and the sheer force of that, you know, kind of primo male presence was enough to overlook what they were saying.Did you believe her?Oh yeah. Of course. Yeah, why would you subject yourself to this? I mean, she did not seek it out. She felt like she had a duty to provide that information, and she was very brave, I thought.All right, we’re gonna get some questions from the audience.Okay.Should ... we talked about this yesterday ... “Should the U.S. end our relationship with Saudi Arabia?”Well, we should certainly be imposing some accountability on Saudi Arabia. There’s two elements ... well, there’s two elements to this-You’ve met Mohammed bin Salman, right?Yeah, look, I mean, you know, we’ve had a long, since literally FDR, long relationship with Saudi Arabia. A lot of it focused on our need for their oil, which we don’t need so much anymore. And then later sort of focused on, you know, their role in the region and especially post-1979, their counterbalance to Iran. So, there are reasons to have a relationship that is focused on our interests and our security, but it’s very clear that if we don’t send a signal to the new ruler, the Crown Prince, that he could very well continue down a path that would destabilize his own country and destabilize the region to their detriment and ours. And, the premeditated murder of Khashoggi was so cold blooded, so barbaric, medieval, that it’s hard to imagine they never stopped to think maybe somebody would know we were doing this.Right.But if they did, they must have concluded, “We don’t care.” Because the only country we care about, in terms of their reaction, are not the Turks, who we already have some rivalries with, but the United States and, you know, “We don’t have to worry about President Trump and Jared Kushner.”Right. Do you think that Jared Kushner signaled that to them, as some people [claim]?Well, we don’t know all of the signaling that was done during the campaign nor in the immediate aftermath of the election. We’re learning more about secret meetings in the Seychelles and efforts to try to have secret back channels to Russia and visits from representatives of Arab nations, so we know there was a lot of activity that I have to believe was meant to further the interests of the Trump family and, including real estate interest in this city, that were then taken to the next level with Trump making his first visit there and on from that.There are reports that Kushner may have shared American intelligence, or at least intelligence gathered by Americans maybe from other sources with Mohammed bin Salman, the Crown Prince. I don’t know that to be a fact but the very idea that it’s being talked about is deeply troubling.Is he incompetent or competent?Oh, I think they always have a goal in mind. I think that they, you know, they ... they have a really weird idea about democracy. You know, Trump’s open admiration of dictators, his desire to be able to order people around, to go after his “enemies”, go after a free press. Everything that he does on a daily basis, I think those views are shared by his closest advisors and they’re always looking for some advantage, and it could be an advantage for their own personal financial interest. It could be an advantage for how they see dominance and power. But, it doesn’t, as often as it should which is all the time, correspond with our national security interest.Do you wish you had turned around at that debate and said, “Back off, jackass”?Well-That was a physical evidence of it.Yes, you know, I did think about it. I-What stopped you?I will tell you, it’s something I’ve talked a lot about with my women friends who are in politics or used to be in politics, and boy, we’ve had some great conversations about it because, I mean, the dilemma, and hopefully the more women we elect, the more women we have up on the stage, the more it won’t be just one woman carrying all the water. You’ll have a lot of different women, like men in politics who are ... come in all sizes and shapes and, you know, ideological perspectives. So, we talk a lot about it and their common conclusion is, “Wow, that woulda been really hard to do without looking either weak or angry.” And I certainly didn’t wanna look weak, since he was playing, you know, the alpha male. And that was something that goes through the minds of voters, particularly Republican voters, particularly male voters. Like, “Is this person strong enough to be commander in chief of the military?” ... And all of that. But also being angry, that’s why I’m so glad there’s these books being written by Rebecca Traister and others who are talking about legitimizing women’s anger because right now, it is still seen as an aberration or as threatening. And-So, I’m just curious. What would you have said? I can stand behind you if you want.No, you know, I would have said something like, “Back off. You’re not going to intimidate me. We’re supposed to be here talking about the issues that matter to the American people, so quit your game-playing and answer the questions.” Something like that.All right. Okay. That’s a good one. So, that sort of answers this question: “What would you say to men? What do you wish we knew?” Back off, stop your game playing. Stop with the sexual harassment.You know, I think there is a lot ... I mean, I’m really glad that you asked the question and that Kara chose it because there’s a lot of confusion. You know, I have two brothers. I had a dad who was a chief petty officer in the Navy during World War II. You know, I have lots of male friends. Obviously, I’m married to a man. So-Yeah, I hear the generals really like you.Yeah, the ... got a lot of generals I like. So, I ... look, I think we’ve gotta get back to basics. What do women want? The age old question that Freud asked? We wanna be respected. We wanna be treated with equality. We want our chances in life not to be decided by the fact that we are women. I remember ... I was doing a Voice of America call-in question when I was First Lady, and the question came from a man who said he was in Iran, which I thought was interesting. And it was after my Beijing speech about women’s rights are humans rights. And he said to me, on this broadcast, he said, “I just don’t understand what that means. What does it mean to have a woman’s rights? What does that mean?” So I said, “I want you to shut your eyes, and imagine everything you can do. You can walk down the street without being afraid. You can go to a soccer game and cheer your lungs out if you want to. You can go to work. You can have a family that you are proud of and a part of. Whatever you could do, I want you to think that a woman should be able to do exactly the same thing that you can do. That’s what we’re asking for. We’re not asking to be better than, or given extra-special privileges, but we wanna be treated as your equal. And everything that we can bring to the table be respected.” So-Yeah, I want extra-special privileges, but go ahead.Yeah, well there are outliers that we have to deal with. You know, if you know Kara, you know she’s not kidding.I’m not.But this is a conversation that needs to take place in homes, in businesses because I do think for most of us, and I guess for nearly all men, that’s just not what you were raised to believe. You were raised to be the protector, the supporter, you know, the patriarch, whatever it might have been. Whatever the particular category was. And so yes, this is a huge cultural shift, and so I take it seriously and it’s gonna take a while to work through our families and our workplaces, our societies.Yeah, it’s hard ... I have two sons, and they tried to drive me off the sidewalk the other day, since they own the sidewalk, you know.And you found yourself on the edge, right?Right, and I’d shove the crap out of them. As you know my theory that all men should be raised by lesbians and then moved back to the general population. Such good men, and they’re really good at sports then. Okay. So: “Are the Democrats becoming the victim of too much political correctness?” Just a few more. I know you have to go.Okay, no ... look, I think ... I think this is a much tougher question than it sounds because the easy answer is, well, you know, “We don’t want political correctness. We just want people to express themselves and be honest and authentic in what they say and believe.” But I think it’s also the case that what’s often called political correctness is politeness. It’s not being rude and insulting to people. It’s respecting the diversity that we have in our society. So, I don’t know exactly how to answer that because, you know, the Democratic party is a much more diverse political party attracting people who are African-American, Latino, LGBT, whatever the reason why people feel more comfortable where they are taken in, where they are included as part of a political movement or party.And I don’t think it’s politically correct to say we value that. And I don’t wanna go around insulting people. I don’t wanna paint with a broad brush. “Every immigrant is this. Every African-American is that. Every, you know, every person with different religious beliefs or whatever” ... you know, that’s childish.What do think of Cory Booker’s and his comment, and feel free-Oh, I adore him-No, what do you think about him saying, “Kick them in the shins” ... essentially ... start to get to that kind of political-Well, that was Eric Holder.Eric Holder, oh, Eric Holder, sorry.Yeah, I know they all look alike.No they don’t. Oh, well done. Now, Hillary ...I was paid by Mark Zuckerberg to do that.Okay. Can I just say-No, what I-Can I just say, you’ve been reading Trump’s tweets beautifully.Yeah, thank you, thank you. No but look, I think this is out of frustration because Trump dominates the media 24/7, and he’s brilliant at distract-and-divert. If he’s in a little bit of trouble over here, well, hey, look at that shiny object over there. If something bad is actually happening in the world, go to a rally and get everybody all whipped up about, “Lock her up”, and all of that. He’s really very adept, and it’s the classic demagogue tool kit. So, there is a frustration. They don’t want civility, they want consent. They want you to agree with them on Kavanaugh. They want you to agree with them on immigration. They want you to agree with them. They don’t wanna debate and goodness gracious, they don’t want facts, evidence, truth, or reason to be part of that debate.So, I think it is frustrating for a lot of us. I include myself, when you are just pummeled by these people because they have their propaganda, Fox News. They have all this other stuff out in the ecosystem of the media. They’ve got the president. They’ve got all of this, just hammering on people like me all the time. And then when somebody says, “Well shouldn’t you be civil?” Well, I believe in. I mean I, maybe too much. I didn’t turn around and say what I said I would have said. So, I don’t think that is any way equivalent because we live in, unfortunately, the world of false equivalency, that is not equivalent to the relentless, very dangerous attacks that are waged against Democrats and others all the time by the president.Do you have an answer to, “Lock her up”?Well, I’m just waiting to be able to say, “Lock them up.”Okay. All right, good one. Well played, Hillary. All right. How would you ... oh, Secretary Clinton.Oh, Hillary’s better.Okay, Hillary. How would you ... which one do you like? I’m just curious. Which one do you they have to use for you?I’ve had “Hillary” a lot longer.Okay good. Has two Ls, everybody. “How would you encourage the government to handle AI?” Just a few more. I know you have to go because it’s your birthday.Wow, we could talk about this for a long time.Go ahead, Hillary. You’ve got the crowd. I think they don’t mind hearing from you.I think ... I mean, one of the things I wanted to do if I had been president was to delve deeply into what we have to do about AI. I mean, if you follow the debate between people who are quite knowledgeable about technology, it’s like split right down the middle. There are those that think it’s gonna be the demise of the human race, and those who think it’s gonna be the greatest breakthrough for the human race. Well we need to figure out which is which, and are there ... are there plans we should make that would try to rein in some of the AI before it is unloosed on the world?Now other countries are moving very fast ahead, China being the best example. I mean, China is currently creating the most intense surveillance system that’s ever been created in the history of the world using facial recognition and AI is behind it. They are literally leading the way about how you control people. How you control their behavior, certainly, but they’re also moving toward track how do you change their behavior and their thinking? So, they’re starting a program to give points to people where people will be rewarded by certain behaviors. Some of that will be taken from the surveillance that is being done. “Oh, Mr. Yang over there. He did a nice thing. We’re gonna tell him, we’re giving him some credit.” Well, how do they know that? Because they’ve got cameras everywhere and they’ve got Mr. Yang’s face recorded.So, the AI that I am fearful of is not just the robots that might decide to turn around and kill you one day ... That does give me some pause...They don’t care about-But-They don’t care about you.They don’t care about that, yeah. I care about the coercive control-The people that have control of AI.That governments will have over our lives, and everybody should care about that. And we have willingly now for more than a decade given up our most personal data that is the real guts, the bloodstream for AI. You know, our personal data is the most valuable commodity in the world right now. I mean, it’s far more valuable than any energy source or any other commodity you can think about, and we have given it over. We’ve given it over to companies, by and large, but that is just one little step away from governments. And, some governments are already coercing or very nicely asking with a big fist behind the head of companies to provide that information. But then companies are negligent and irresponsible, and that information is gushing out anyway. So, I worry a lot about the control. You know, it really is like “Brave New World,” “Nineteen Eighty-Four,” all of those allegedly science fiction social commentaries that we read decades ago. Now the tools are becoming available, and we’ll watch what happens in China and I think it will scare the heck out of a lot of people in this country and Europe and elsewhere.And we’re doing nothing about it-Doing nothing about it.One of the current ... we have no CTO, we have no chief science officer-No, because they don’t ... I mean, you know, science is a bother.I think the guy who was doing ... yeah ... I think the guy who was doing technology did real estate for a long time.Yeah well, that would be the pool to pull from, right?All right. Two last things. “From one nasty woman to another …” — I don’t know what nasty woman’s in the audience, but I think there’s a lot — “... where do we go from here?”To the ballot box. I mean, you know, please, please. There are so many important issues to talk about, and obviously we couldn’t talk about them all in just one of our fun conversations ... our third, as Kara said. But everything depends upon this election. And I can’t stress it too much. I mean, I know, if young people voted at even half the percentage that people over 65 vote, this country would look very different. And I think part of the challenge is to convince every young person that elections are always about the future and it’s far more about your future than it is about mine. And I think anything you can do between now and the time the polls close on November 6th, there are some really consequential congressional races here in New York, in New Jersey, in Pennsylvania. Places that are within easy distance that you could go and knock on doors and make phone calls, or even stay at home and do the same by contacting a campaign.If we turn our vote out, and we overcome the suppression efforts in places like Georgia ... I was just in Florida with Andrew Gillum, who is a fabulous candidate, absolutely great, and you know, he’s doing everything he can to get as big a vote as possible so there can’t be any question that somebody could undercut him. So, that’s what we’ve gotta do. And there’s nothing more important than as ... Then, once we hopefully take back the house, maybe hold our own in the Senate, pick up some governorships, then we’ve got to say, “Okay, an agenda.” And let’s drive that agenda. And it needs to be as big a list as we can because we have to get as much done in a year as possible before the presidential campaign takes off in earnest, and to lay down the groundwork about this is what citizens, this is what voters should expect.So, there’ll be a lot to talk about after we are hopefully successful in this election.All right, last question. Is it your birthday?Yeah it is. It is my birthday.That’s my toughest one.[Birthday cake rolls in]Aww, my gosh! That’s so cute. Jennifer! That is so cute. Oh my gosh.I think there’s candy in there for your grandchildren.I think that’s fabulous-looking.Yeah.Yeah, I can go back and tell my grandchildren I got something out of coming.You can bring it to them.That is so cool. Thank you.All right. Hillary Clinton, what’s your current mood?My current mood?Yeah. What is it?Optimistic, positive, determined. You know, I mean, don’t let them get you down. That’s all I can tell you. Don’t let them get you down.That’s right.Thank you. Thanks everybody.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}