{"id": "Recode Daily: ‘Davos in the Desert’ minus Masa, Apple iPhone XR review", "paragraph": "“Davos in the Desert,” the Saudi economic summit that begins today, will be nothing like last year’s inaugural event. The sheen has worn off of the Future Investment Initiative (live stream here), which was visualized as a new kind of international finance conference that would take what has succeeded for decades in Davos as the World Economic Forum and bring it to the desert of Riyadh. But after the now-admitted killing of American resident and journalist Jamal Khashoggi earlier this month, the three-day event has transformed from a star-studded gala into a scarlet letter in the eyes of Silicon Valley, and has been close to decimated by cancellations from Western speakers, and most recently, SoftBank CEO Masayoshi Son, which could test his multi-billion-dollar partnership with Saudi Arabia.[Theodore Schleifer / Recode][Want to get the Recode Daily in your inbox? Subscribe here.]  Apple’s latest iPhone goes on sale this Friday: A month after the launch of the flagship XS and XS Max iPhones, here comes Apple’s “cheap” version, starting at $749, a device meant to blend some of Apple’s most sophisticated technology with a certain level of fiscal accessibility. And for millions waiting on an upgrade, the XR might be the right phone at the right time; Here’s a roundup of early reviews. The Verge says it’s “better than good enough” — “a no-brainer upgrade” if you don’t want to spend the $$$ for the iPhone XS’s better screen. [Nilay Patel / The Verge]Amazon’s version of a futuristic 7-Eleven is coming to New York City — its latest cashierless Amazon Go convenience store will to be located inside an upscale shopping and office complex across from the World Trade Center. Amazon Go stores use a combination of sensors, cameras and computer vision to automatically charge customers for the right items upon exit without them needing to stop and pay. Amazon has so far opened three Amazon Go locations in Seattle and two in Chicago, with another on the way in the Windy City. [Jason Del Rey / Recode]Facebook is losing yet another founder of one of its billion-dollar acquisitions. Brendan Iribe, the co-founder of virtual reality headset maker Oculus, announced that he is leaving. Facebook purchased Oculus for $3 billion in 2014, and Iribe’s departure means that the founders of all three of the social media giant’s largest acquisitions to date — Instagram, WhatsApp and Oculus — have all parted ways with Facebook, which was once viewed as a safe haven where founders could largely operate independently. Now Facebook is being criticized for its apparent heavy-handedness with founders at a time when it’s leaning more on subsidiary properties. [Seth Fiegerman and Laurie Segall / CNN Business]More than a third of U.S. adults patronize fast-food restaurants and pizza shops on any given day. According to data gathered from 2013 to 2016 in the National Health and Nutrition Examination Survey, 44 percent of those who eat fast food do so at lunch, and 42 percent at dinner. The percentage of adults who ate fast food rose with increasing income: About 32 percent of people who earn less than 130 percent of the federal poverty line — $32,630 a year for a family of four — ate fast food daily; 2 percent of people above 350 percent of the poverty line — $112,950 a year or more for that size family — were daily consumers. Meanwhile, here’s a look at the weird world of secret fast-food menus. [Nicholas Bakalar / The New York Times]“You Are Jeff Bezos” is a text-based, online choose-your-own-adventure game that illustrates in detail the appalling amount of wealth that people are allowed to amass and then just keep to themselves. For instance, as Jeff Bezos, you start with $156 billion, and maybe decide to repair Puerto Rico in full ($139 billion). That leaves $17 billion, which you, Jeff Bezos, can use to abolish the electoral college ($380 million), double every Amazon employee’s salary ($15.8 billion), pay back taxes to the EU ($293 million), and still have $527 million left over. Meanwhile, this Friday Rockstar launches its biggest, most ambitious game, Red Dead Redemption 2, but the achievement comes at a substantial cost for its human developers: Here’s a look at the treatment of workers in the video game industry.[Casey Johnston / The Outline]The world’s longest sea bridge — 34 miles — finally opens today.Connecting Hong Kong and Macau to the mainland Chinese city of Zhuhai, the $20 billion bridge is a key element of China’s plan for its own Greater Bay Area. [James Griffiths and Sarah Lazarus / CNN]Unlike some athletes, former NFL star Maurice Jones-Drew doesn’t want to be a venture capitalist. On the latest episode of Recode Decode, MJD tells Kurt Wagner that the low success rate in tech investing scares him: “I grew up with no money, so it’s like, I got money, I’m gonna try to keep it as long as I can.” [Kurt Wagner]Wired’s 25th anniversary is a peek into the past, present and future of magazine design.100 websites that shaped the internet as we know it.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}