{"id": "Facebook found and removed another ‘politically charged’ disinformation campaign, this one from Iran", "paragraph": "Facebook has removed more than 80 Facebook and Instagram accounts and Pages that were participating in what the company is calling “coordinated inauthentic behavior” ahead of the U.S. midterm elections.  These accounts, which originated in Iran, were posing as U.S. and U.K. citizens and sharing “politically charged” content, like posts about race relations and immigration, said Nathaniel Gleicher, Facebook’s head of cybersecurity policy. The accounts were removed not because of what they were posting, but because they were run by people pretending to be someone else, Facebook said. Just over one million people followed one of these pages or accounts. The oldest of the accounts was created in 2016, but most of the activity from these accounts took place in the past year, Gleicher added. Facebook first noticed the activity last week, and says it has already alerted U.S. and U.K. government officials and law enforcement. “We’re not in a position to assess the motivation of these bad actors and what they were or were not trying to accomplish,” Gleicher said Friday morning on a call with the press. He added that the efforts were “consistent” with disinformation campaigns Facebook has seen in the past. “It was sowing discord and it was trying to target sort of socially divisive issues as opposed to being specifically targeted on events that are about to occur,” he said. This is the second such campaign that Facebook has identified from Iran. The company says that there was “some overlap” between these pages removed and the ones discovered over the summer. Of course, Russia was also behind a massive disinformation campaign that went undetected leading up to the 2016 U.S. presidential election. Those efforts changed the course of Facebook forever, and have created an all-hands-on-deck kind of situation internally as the company prepares to avoid another similar disaster ahead of the 2018 midterms. The midterms are in 11 days. Facebook showed off its “election war room” yesterday - the office where it’ll monitor and respond to possible election interference efforts leading up to the midterms. Here’s what it looks like. pic.twitter.com/sGiiJgA4xgSign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}