{"id": "John Skipper, ESPN’s former president, is back ... at a rival sports media company.", "paragraph": "The rumors of sports’ death have been greatly exaggerated, says former ESPN President John Skipper. “I don’t think interest in sports has declined at all,” he said on the latest episode of Recode Media with Peter Kafka. “What you just have is a dramatic increase in the amount of content overall that’s available, the places you can watch it. And so consequently, the peaks of everything are smaller, right?And Skipper is contributing to that content bounty in his new role as chairman of DAZN (pronounced like “da zone”), an online sports streaming service that launched in the U.S. in September. Already an established carrier of multiple sports in Japan, Germany and Italy, DAZN is focusing on boxing in the U.S. for now, with an eye on the rights to other sports that are currently locked up by companies like ESPN.“Just in terms of buying the most popular live events in this country, those rights are tied up for a long time,” he said. “I do run into my own deals very often in this new job ... I have no regrets. They were the right deals to do, and we’ll do the right deals to do now for a new service.”Although he declined to share specific numbers, Skipper said DAZN already has more paying subscribers worldwide than any other streaming service, including ESPN+, which announced in September that it had one million. And he’s skeptical that, when the NFL broadcast rights next become available, tech monoliths like Google or Amazon will necessarily be the ones to scoop them up.“Every time I hear that they’re inevitably coming, I believe that I hear some commissioner of some big league in the United States whispering into a reporter’s ear that they’re coming,” he said. “... To have only bidders, broadcast and pay and cable television companies — who are facing very, very significant issues with their two streams of revenue — to have them as your only bidders, I don’t think is a comfortable position for them to be in. They’d like new bidders. I think they would like DAZN to be a bidder.”You can listen to Recode Media wherever you get your podcasts — including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a full transcript of Peter’s conversation with John.Peter Kafka: This is Recode Media with Peter Kafka. That is me, I am part of the Vox Media Podcast Network. I’m recording this at the Vox Media headquarters in New York City. I’m here with John Skipper. Hey, John. John Skipper: Hey. You never said anything about recording this. Yeah. Uhh ...It was a joke. We normally stream it live, but in this case we’ll do it on demand. Hello! Hello. Last time I talked to you in a public setting, you were running ESPN, you had that job until I think December of last year? Mm-hmm. You have a variety of titles now. Do you want to list them all or do you want to explain the most important one? No, no. The only title I hold is executive chairman of the DAZN Group. Okay. I thought there was Perform and it’s very confusing because there’s an acronym, and there’s also a holding company. But you’re running DAZN? Would you like for me to clear up all this confusion as simply as possible? Yeah, go for it. So I’m chairman of the DAZN Group, which is a holding company for a variety of sports media entities which we’ve recently divided into two groups, one called Perform Content, which is a business-to-business operation, and one which is now called DAZN Media which is business-to-consumer and consists entirely of the — not entirely — it consists principally of the over-the-top streaming services that we do around the world. So you may be seeing or have seen references to something called DAZN, which you were saying. Which I’m told by you and others is pronounced “Da Zone.” It’s confusing. It’s pronounced “Da Zone.” All right. In whatever part of the world you’re in. Less confusing in some parts than the other, and I would also stress so I, the holding company, has a board. I’m chairman of the board. But it’s an operating role, and I run the company with Simon Denyer who is the founder and CEO, and he has taken on the role of CEO of the DAZN Group but remains on the board. I feel like we should have a footnote somewhere and we can have an org chart and then people can go look all this up. Oh, I just thought we’d clear it all up now. Yeah, it’s perfect.So, it would make it easier. It’s actually not very complicated, but what we wanted to make sure we did was organize the company in such a way that we could have a management group in place of each of these two divisions, that we could have the resources we need to grow both divisions and so the businesses, to some extent, could operate autonomously in the market. So, one of the reasons this is confusing to me and news to a lot of people is that, one, this is not a company that’s based in this country, and two, it’s relatively new. The overall company itself is not that new. It was founded in 2005. What’s new is the DAZN part and the launching the over-the-top services.And you made an important point I would like to emphasize. We are brand-new to the United States, we launched on September 22, the 22nd of September. We’ve been in business with a number of U.S. entities for many years, mostly out of the business-to-business group. We were quite well-known in other parts of the world. We are here to begin to establish a brand identity, but we are quite aware... I don’t know if it’s a matter of confusion or if it’s a matter of just lack of awareness. We have not had the DAZN brand in this country before September 22 and we’re here now. So I want to talk about the product and what you’re doing there, but I just want to back up a little bit. You used to run ESPN, biggest, most powerful player in sports. You helped make it that. Now you are helping to run a much smaller sports streaming service, sports service. How is your life different now than it was last November or last December? I am very excited about being in the role of running a rapidly growing company. I’ve been in the role of disrupter/competitor before. I did work at Spin when Rolling Stone managed that space and really was the dominant player. I did launch a magazine at one point, against one of the most dominant magazines ever in a genre. That was when you were at ESPN launching against Sports Illustrated. Yes. And the results, I think, were pretty excellent and I think that experience will serve me well as I think about how to grow DAZN, how to create a disruptive company, grow a company, I learned many things both at those jobs. I’ve been an entrepreneur, I’ve worked at small companies. Most of the things I need to do now, whether it be doing rights deals or to think about how to do digital content, how to think about having a workforce that comes from the most diverse possible pool of people are all things I think you’ll see replicated at DAZN that I’ve done previously. But what’s sort of day-to-day different? I mean, imagine everything. I just imagine there’s almost a whiplash from going to running this giant entity, which is then part of a bigger entity at Disney, to working and running a much more nimble thing?So, if I approach it exactly as you ask it, day to day, it’s dramatically different, right? Like it’s a little bit of a reverse mirror. And of course, I’m a pretty optimistic person, I could make the case that being part of a big company has great resources, it’s fun, it’s fun to be in a position of influence and power, but it’s a lot of fun to be at a place where it’s more nimble, where you do have a greater freedom, where you get to make decisions in a hurry and move on. And while I’m an operating chairman, I’m not spending my time thinking about many of the things that I’ve done running companies before. I’m trying to concentrate on strategy, on overall direction, organization, we talked about that a bit, what to do next, how to do it. I’m not taking notes on the production of live events and passing them along to anybody. I’ve been trying to avoid that.But you’re in ... I was reading a Sports Business Journal piece about you negotiating a rights deal, and you were going to leave, and then you flew back or you didn’t fly back and you only had one pair of underwear and you had to go buy more on Rodeo Drive?I really don’t want to discuss my shorts. That does not seem like a good place to buy underwear, by the way. Rodeo Drive? It’s an expensive place. That’s what I was going to say. It’s a true story, but it doesn’t contradict what I just said because we think that it’s potentially a transformational deal for us, and so I am perfectly prepared — nobody’s ever questioned my work ethic — I am perfectly prepared to dive in and do anything. That was a deal with Oscar De La Hoya.Golden Boy. Yeah. Yeah, it was a deal with ... started with a guy, David Tetreault, and Eric Gomez and Oscar were intimately involved as well as some other team there. I had some good help from a couple folks at DAZN, so it is fact as it was reported, which is, I did stay with a little bag and I understood that my advantage was, I was in the room, they had a ticking clock, which is their deal. Their current television production deal runs out December 31, they have a fight on December 15, they have to figure out where to put ... The ah-ha moment was when I looked across the table at Oscar and Eric and David and said, “We are only interested if Canelo will fight on DAZN, and DAZN exclusively.” And they said, “We would be happy to hear what your proposition is for that.” And it was those words kind of in my ear as I sat in the American Airlines lounge that I thought, “Well, if they’re prepared to hear the proposition I don’t know why I’m going away to go figure out what that proposition is.” This seems like a good counterpoint, or a good way to underscore the difference between what life was like at ESPN and where you are now, because I’m assuming at ESPN, it was very difficult to get a lot of rights deals done, but in the end you had a nearly unlimited bag of money, you could almost always outbid the competition if you wanted to, and you pretty much got every deal you wanted, I think, for a long time. And here you don’t have ... You are owned by a billionaire, that’s Leonard Blavatnik, did I pronounce that correctly? Yes. Thank you. But you’re scrappier and you can’t just show up and win. Well, I was always pretty scrappy, I think, and I do not want to characterize my days there as you did. I got a lot of freedom. I wouldn’t suggest that I felt particularly shackled or involved in bureaucratic difficulties. Nor would I accept that characterization that I had an endless bag of money. But you had a lot of it. We had a very successful business. Yeah. We spent it wisely and appropriately, and effectively. Now I have to be a little more creative, and I think was creative in thinking about the fact that the one place where people pay for sports content is pay-per-view boxing. So there is a pool of money that exists there. About $250 million was spent on Canelo Alvarez’s last three fights. I now have to find those people — not a trivial marketing task — and convince them that what they were paying $80 a pop for is much more effectively and economically purchased by getting a $10 subscription to DAZN.Yeah, we should back up and explain what the service is because we haven’t. It’s $10 a month ...So let me. First of all, you’ve got — again, you’ll hear me, I started to say “see” but I guess you don’t “see” on a podcast, although I see you. There’ll be a picture of you...I’m going to consistently go back to trying to explain this as a global company, and as a global company we have different permutations of a service around the world. It looks one way in the United States, but what it is is an over-the-top streaming service to sports fans. It intends to aggregate content so it’s not a single-sport proposition for the most part, it’s not a linear network.Boxing-heavy in the U.S. right now. It is, because opportunistically ...That’s what’s there. What we can buy right now. And I think where we could buy something that we could turn into a subscription, which is ... that is what we care about. Again, I’m not going to see cable distributors right now, we can talk later about it. There’s no advertising on the service, so our task right now is to find content that is available that we can buy wisely and turn it into subscriptions. And in the U.S., that is fights, and pay-per-view is money people spend, which I think they’ll spend on the subscription, and that’s why we did the Alvarez deal. Traditionally, the model for boxing and also wrestling and MMA is, you’ve got smaller fights throughout the year, and they build up towards a big fight and you pay 70, 80, 100 dollars to the cable distributor to watch that particular fight.Right. And you’re saying, instead of doing that, just pay us 10 bucks a month, we’ll give you everything you need the whole time. You don’t have to buy another pay-per-view fight. That’s correct. And what we’re going to do is, we are aggregating a large inventory of fight content. We are partners with Combate and Bellator and the World Boxing Championships so that you have a fairly ... if you’re a boxing fan, you get a steady diet of fights. I think the pay-per-view model was an excellent model for some number of people to make a lot of money for a while. It did end up choking off the interest in boxing because the biggest events of the sport were taken basically out of the view of most of the public and sold to people for $80 a piece. Because you had to decide if you were going to spend 80 bucks or your friends were going to pool it together or whatever it was. You had to make a decision, to lay out a bunch of cash on a one-time deal. It’s a great business model, but when you think about a sport as popular as boxing, which puts a limit on their audience of about a million to a million and a half people to watch their biggest events, we get ... You get that for mid-level college football games, and you get that for a mediocre NBA game. So what they’ve done with the height of their sport is to choke it off. Now what we will do is return it to, available to anyone who wants to buy a subscription. $10 a month is pretty economical. Do you think that’s why boxing has become a niche sport? Or it’s become a niche sport for societal reasons and the economic model just sort of reflects that? No, I think it’s become a niche sport because of the economic model. There may be some underlying societal and cultural things that may inhibit in some ways, but I think it’s inhibited itself. It’s also the fact that the best athletes in the world who fight don’t fight often enough, right? Because they’re building up over six to eight months to a pay-per-view event, and our hope is that we can get the best fighters — it’ll mostly be other than the three or four top guys — to fight more often and regularly on DAZN so that fans get to know them.Right, I know the Ultimate Fighting guys are sort of trying with that, they’re trying to incorporate the wrestling model, where you get to know the fighters more often. They struggle with that as well. Well they struggle with it ...Are you a boxing fan, personally? I am now. Yeah, okay. Professionally, you are. Look, I was a boxing fan growing up, right? I grew up with Mohammed Ali and ABC when you could watch the fights in the afternoon and you actually knew about him. And then when you had, you know, the confluence of Hagler, Duran, Hearns and Oscar De La Hoya in a time when you really cared about all those guys. Yeah, I remember Mike Tyson for me was the last person that someone who wasn’t a fighting fan would know. Yeah. Who was a popular athlete in that sport. Can you name the heavyweight champion of the world right now? Nope. I can’t even tell you who McGregor fought in that stunt match last year, even though I wrote about it. Floyd Mayweather. There you go. And the heavyweight champion of the world — which is disputed, of course, another issue — is Anthony Joshua, who is English of Nigerian descent, and we are going to put his fights on DAZN as well. But one of the issues we have to overcome is that the average, even sports fan, in the United States does not know who Anthony Joshua is. It’s disputed because there is a gentleman named Deontay Wilder who holds one of the five belts.But do you succeed here by getting a bunch of the existing boxing and fighting fans to pay you $10 a month or do you need to broaden that audience and go for, “If this is really going to work, we’ve got to actually make this a more mainstream sport again?”We succeed if we can be in enough countries with a good enough product to drive dramatic numbers of subscriptions around the world. In the United States, I think we can drive a million-plus subscriptions with boxing. We are in the process of talking to lots of people about other rights deals. We have no intention to make it a fight network or a fight channel. You’ll start there, because that’s where you...That’s what we could start, aggregate the first million subscribers, begin to look at where there are opportunities that will be, in many cases, inventive, niche. I mean, just in terms of buying the most popular live events in this country, those rights are tied up for a long time. In part because of what you did at your last job. I do run into my own deals very often in this new job, which is a funny  ... Like, “Oh man! I wish I hadn’t done that!”No, no, I have no regrets. They were the right deals to do, and we’ll do the right deals to do now for a new service. But we’ll find some things that can drive niche users, we’ll try to create some content that people care about going forward. But they’re different models and different places in the world. We launched in Japan and we have the vast majority of live rights in the country already. In Japan, you sort of are ESPN. In Japan we are sort of the broadcaster and ESPN. We own the rights, the overwhelming majority of rights to the J-league, the Japanese football league — real football. Yeah, soccer. And not American tackle football. And we own the rights to the baseball league, as well. You guys are a subscription business, we are an advertising business, which means we need to take a break so we can hear from an advertiser. I got a thumbs up from Golda. We’ll be right back with John Skipper. I’m back here with John Skipper, who has three words he wants to say. Sugar Ray Leonard was the fourth fighter there. I do have Oscar De La Hoya on my mind because we got that deal done, and he was a prince to work with, so it was good fun. Okay. All the boxers in the deal are duly noted. You know, periodically I’ll hear from someone on your team explaining a new deal they have, and then I have to do a bunch of Googling because I don’t know anything about boxing. And I’m a relatively red-blooded American sports fan, and it’s just not on my radar — again, unless it’s a stunt fight like Conor McGregor. Maybe once a year, I’m vaguely aware that something happened.Right. Do you think you are going to convince me to become a boxing fan? Or are you just ... there’s other people you’re going to spend time on, who are persuadable? There is a pool of three to five million people who care about this very deeply and who have paid for a pay-per-view fight in the last three or four years. We gotta find those people first, convert a large number of those people. I think you’ll get interested at some point. Anthony Joshua, Deontay Wilder are two fairly spectacular heavyweight boxers. I think we’ll spend some time trying to break Joshua through in the country and you’ll likely get more interested. Where will we get you? I have no idea. You’ll get it for professional reasons.So there’s a bunch of people who are investing in fighting, right? Ari Emanuel over at Endeavor, Showtime, HBO — which really built its initial reputation on boxing — announced they’re out of the business, at least temporarily. And again, it’s not a resource issue for them, or it shouldn’t be. They’re owned by AT&T now, they could invest as much as they want in this. What do you make of HBO moving away from fighting? I think they understood that the pay-per-view proposition did not move the needle enough for them to remain in and compete, which is basically what Peter Nelson said, right? ‘We didn’t make this subjectively, we made it based on analytics and what it does for our business,’ and I think their scripted, high-end content is much more important. They’ll concentrate on that. It’s a good decision.“We’d rather spend our money on ‘Game of Thrones’ than a fight.”Yeah. And I think they’re straightforward guys. I think that’s the right explanation. And our goal here, clearly stated, is going to be to put pay-per-view fights into Da Zone so we will, we believe, create a shortage of those over time and then we’ll become an important entity in this sport. I wanna back up a little bit. How did you get to this? You were out of work. Did you want to do something in sports? Was that a given for you, or were you thinking about other stuff? You have multiple talents. You’re a learned man. You like reading and writing. I was introduced to Simon and Len Blavatnik by Michael Lynton, who’s an old pal of mine, who in fact hired me at the Walt Disney company many, many years ago.Most recently, was running Sony Entertainment.Yes, and Simon and Len felt that they had something in DAZN, which they thought could be explosive and be a big company and were looking for a complement to the team they had. And they found me and I pretty quickly thought it was a great opportunity.Were you out there saying, “I wanna do more sports stuff,” or were you thinking, “Maybe I shouldn’t be doing sports stuff because I already ran ESPN and there’s nothing bigger than that”?I explored the idea of being a consultant and actually formed an LLC and spent a little time talking to people. Got several clients and resigned all those clients in the first week because it took me about three days — there’s at least a couple people who’ll laugh when they hear this: It took me about three days to realize I’m not a consultant. What makes for a consultant that you don’t have?I do not know. I just know I didn’t have it. I like operating things. I like being in the mix. I like building things and making a difference and I’m not a great adviser. I’m a little bit more of a doer. And I like the intellectual challenge also of thinking about how to position companies and drive them. I did talk to a variety of people about other general entertainment things and about other companies. The time between when I met Simon and Len and when I took this job was less than 30 days, so this struck me very quickly ...You were eager. As doable, fun, exciting and a right way to use the experience I’d had before.And it was a given to you that you were gonna do something. You didn’t think, “I’m just gonna go off in the wilderness and collect my thoughts.”No, I’m not a big wilderness guy either. I’m not against the wilderness, and I’m generally fond of the wilderness…You’re living in New York City now, right?… but I do live in New York City and I like the action. So no, it was probably not a serious consideration for me to sit around.So let’s talk about the circumstances of your departure. You announced in December of last year, you said, “I’m leaving. I have a substance abuse issue.” Everyone, I think, was surprised and confused about that. And then in March, you had this extraordinary interview with Jim Miller. You said, “Specifically the reason I left was I had a cocaine problem and someone who sold me cocaine tried to extort me.” So, when you are talking to other people about taking jobs, what kind of questions are they asking you about the circumstances?I did that interview for a specific reason, and that was to provide a candid and open explanation of what happened. I have no further comment on it.Yeah, but what are they asking you, though? A prospective employer.Prospective employers who are interested in what I could do for their business, which is what prospective employers are interested in.Yeah.And I don’t think I gave them any reason to be concerned.So you didn’t feel like you had a hurdle to jump over there.One of the reasons I did the interview was to provide a candid and open explanation of what happened so that I would not have to be confronted with those questions.I feel like you’ve given this response more than once to someone like me.I have not, actually.Okay.I designed it exactly for you!Thank you.Because of course I haven’t done much press in a long time. I’m happy to use your podcast to make it clear to everybody who will ask me that they will get the same answer.Well, I wanna keep trying just ‘cause.I’m sure you will. Because you knew I would.You’re an outstanding journalist, reporter.There’s a couple of specific things. One, you said essentially you were the victim of an extortion plot. Did you or anyone at Disney or anyone at ESPN bring this to some sort of law enforcement and say, “There’s been an extortion attempt here?”I don’t have any comment on it.And do you think that you have laid those questions about you ...? Because I think you talked about it in the Jim Miller interview that people were wondering, “Well there’s gotta be some other story here. There’s gotta be something.” This was happening in the full flush of the #MeToo stuff that was coming up with Weinstein. Everyone said, “Well there’s gotta be something else.” And I think you said something to the effect of, “There is nothing else. You can check it out.” It was kind of a Gary Hart line. “Look all you want. You won’t find anything.”No, that’s a bad example. It is a bad example. You can debate it either way.You have very smart viewers, but I wonder how many of them actually know ... no let’s keep going.You know why? Because they just listened to me interview Jason Reitman, who just made a movie about Gary Hart.Oh okay, so they probably do know.Yeah. Hopefully some of them will have retained that information. Do you feel like that worked, that that interview then extinguished those questions?Well, since you’re asking me the question, I’m not sure I can definitively answer whether it did or not. I can definitively tell you I don’t have a comment on it.Trying to think of how many other ways I can ask this... Do you think that had that — I keep calling it the “Weinstein stuff…” Had those stories not been out, had that movement not been out, had you gone through what you went through that you would have been in a position where you could have stayed on at ESPN? You could have gone and rehabbed and come back six months later?I don’t want to speculate about that. What I will tell you, because this does matter to me in that question, is that one of the reasons I did the interview was to make it clear that as people were searching for answers, it had nothing to do ... My behavior was exemplary relative to how I treated other people in the workplace. I don’t recall anybody able to uncover a scintilla of inappropriate behavior. I was a champion of diversity, including getting women in more executive positions, making sure that we had more diversity behind the camera, on the camera, that we had a workplace that was open and tolerant and allowed everybody to succeed and did that. So that does strike sort of a strong chord with me so I’ll answer that question, which is, that’s one of the reasons I did it. It is interesting that you caught yourself immediately. You know, Mr. Weinstein has become the poster person ...And it was the first story and I think probably ...I’m sure it wasn’t the first story, it was the story that began the momentum …That’s right.… that sort of created a corrective, finally, right? I mean, we’ve lived a lifetime of stories, whether people telling you about something or you’re a woman who was a friend suggesting something happened and it became the moment which publicly, the tide... I think and I hope that it began to become corrective as opposed to just anecdotal, or said another way, that the burden of proof has shifted, right? The burden of proof has shifted to believing the aggrieved as opposed to defending the oppressor.I think that is true. Maybe it’s shifting back again, according to Donald Trump, who’s now running on, he’s using Kavanaugh as a campaign piece.Well, it may be, but I don’t think it has shifted back in the culture as a whole. I mean, anytime you have dramatic societal change, you have ups and downs and fits and starts. I still sit here as somebody who grew up in the segregated South, sort of astonished at both the progress and the lack of progress, simultaneously and contradictorily, that we’ve made on civil rights.It’s a good path to go down. You and I did an interview onstage a couple years ago, 2016. We were talking about some of the niche sites you guys were doing, like FiveThirtyEight, and there was one called Undefeated which had not launched yet, but the idea was it was gonna be a black-run publication about African-Americans. I said, “Why are you doing it?” You said, “I think there is nothing more important in our culture right now than race relations.” So that was one example of you spending time and effort and money on that. The programming efforts I think you made specifically to bring African-Americans, other minorities and women on camera more often. Since you’ve left, there’s now this narrative that one of the problems at ESPN was that it was too political. Do you think when people are saying that that they mean you guys spent too much time talking about Democratic versus Republican party or do you think that’s code, or maybe not code, for talking about race and promoting, having that discussion on air?I believe strongly in a progressive work environment and progressive society and I did not spend any of my time at work thinking about society other than as a context. I spent time at work thinking about what we should do at work and I’ve done that every place I’ve ever worked. That’s the only context I think about it in. Now, I personally believe that almost everything you can do that creates tolerance and openness and allows you to hire from a wider pool of talent is good for business. I did not feel at any point in time, nor at any position I’ve had in the past, or the one I have now, that I will do anything that is bad for business. All things are complex, right? And suggesting there’s any way to separate the strands of social and cultural and business and finance and progressivism and activism and tradition is naïve. All these things end up intertwined together.It seemed like, under your tenure, you said, “I, for whatever reason, in part because I can, I’m gonna tip the scale a bit here. I wanna make a point of bringing more diversity on air. I wanna give Michael Sam, the college football player who came out before the draft — seems like he was punished for it — I wanna give him an award. I wanna give — I’m gonna butcher the name — Jenner ...Caitlyn.Thank you. “Caitlyn Jenner an award. And I wanna do that.” And retroactively now, it seems like, there was pushback against it. Do you think that you made a mistake in promoting a particular social agenda?I made a series of decisions. I didn’t have a moment in which I decided to do anything or not do anything in some sort of programmatic way. I am proud of the decisions I made. I think they were all in the service of trying to be an open and progressive environment at ESPN. Allowing everybody the chance to succeed. And we did give the Arthur Ashe Award to a variety of people who we felt deserved it for different kinds of things that they had done. They were always about acts of courage. It is courageous to take stands relative to the ability of people to be themselves. I agree with you. I’m just wondering how much you heard either internally at ESPN or from viewers or from Disney saying, “You don’t need to show that kiss.” This is the Michael Sam kiss after he came out, was that ...Did I mention that you can get a DAZN subscription for just $10 a month?Absolutely! So, that’s my polite way of saying I have no interest in going backwards and discussing decisions I made or second-guessing anybody else’s opinion on it or speculating on it.Fair enough. I think I’ve asked you a bunch about it. You’re pretty clear.I am completely fair. I have no quarrel about the question. I’m being quite straightforward about my interest in discussing it.I do wanna talk about what you did at ESPN, relative to what you’re doing now. We talked about this at the beginning. You didn’t have an unlimited pool of money, but you had a lot of it. You were quite clear that you were, when we talked in earlier versions of this conversation, that it was very important for you to buy rights so that Rupert Murdoch couldn’t buy those rights. That was your focus. Do you feel, in retrospect, that all those decisions were the correct ones, given where ESPN is now?I find myself in a dilemma of wanting to answer a question which I have a good answer to, to not wanting to contradict my previous statement that I’m not interested in revisiting the deals I made at ESPN. But I’m going to not resist the temptation. We paid a lot of money for the NBA. It was worth every penny, and any suggestion that that was an overpayment is naïve, lacks an understanding of the business. If you overpaid for rights, you’ve made one of two mistakes. You’ve negotiated badly. I can guarantee you that there were multiple parties that would have paid more than we paid. So we didn’t overpay. Or you can buy something you don’t need. And I would ask anybody to imagine a current ESPN without the NBA. Would they be better off or worse off? It would be worse off. So, it was a good deal.So now, going to your current job, you look at a world where in the U.S., because of your work at ESPN, many of those rights are owned by one company and a lot of the other big rights are owned by other large companies. Presumably, at some point, you will be interested in pursuing an NFL deal or an NBA deal. When those come up, given that there’s been an overall sort of decline in sports viewership, do you think those rights will be more affordable than they have been in the past or do you think they’ll be more expensive because the Googles and Apples and maybe the SoftBanks of the world will wanna buy in?Let me sort of go around and answer that a couple of different ways. The first is, again, I’ll go back to we’re a global company. We’re interested in the things that move the needle the most. In Italy we’ve bought 30 percent of Serie A, which is by far the most important content there. So that’s what we would like to do.That’s Italian soccer.Italian soccer. Consequently, we have a very successful, about two-month launch of a service in Italy where we are, at this point in the Italian football season, one of the two sports media companies that matters the most. In Japan, we bought the rights to the two most important domestic leagues and we are arguably the most important service there. In Germany, we’re one of the three most important services because we have European football and American sports content and other soccer and products from around the world and we can create that kind of business. In this country you can naturally assume that we’ll be interested in the rights that move the needle most. We’re here to establish the brand, to demonstrate the technological platform, and to be here and be in business. This is going to be more iterative than I was used to, right? I was used to sort of a full-on assault methodology. This is going to be, we’re going to pick up pieces as we can, so we’ll be interested in everything.I get that that’s the case, but when an NFL deal comes up in a couple years ...Yeah. See, I was gonna go on to answer the second part which was, “Gee, are they gonna be less expensive, more expensive?” Again, it matters where you are in the world, right? There are places in the world right now where because pay TV was never as penetrated as it is in the United States, where rights costs are stagnant, even declining. So we will look to take advantage of those markets to get in now and try to create a dominant over-the-top position. Do I think sports rights in the United States will go down? No. Anytime in the near future, I do not.Even if the trends which you were well aware of, viewership for those has been declining.It’s really only barely about viewership, right? It’s really about what you can build or what you can generate in revenue based upon that viewership. I think it’s arguable. I don’t think sports viewing as a whole is actually down. What’s down are the Nielsen ratings on the big events on broadcast networks and on cable television. Lots of people are choosing to watch different ways, consuming sports in different ways, betting, playing fantasy football. I don’t think interest in sports has declined at all. What you just have is a dramatic increase in the amount of content over all that’s available, the places you can watch it. And so consequently, the peaks of everything are smaller, right? Broadcast television primetime is down dramatically more than sports.For a long time the argument used to be, “Everything is down except for sports, sports is special.” And then everyone sort of realized ...Sports is still special.It’s special, but if people are watching less TV, they’re also watching less sports on TV.It’s still special. It still drives a disproportionate share of interest, passion, viewership. And we think we can create a different business model, which is going to be the business model in the future, take advantage of that interest, go in a direct consumer relationship with the fan, get data from the fan, create new ad models.We think we’re a first mover in a lot of places. This country will move last because you have more big sports media companies with more money as part of big overall conglomerations. You have the highest penetration of paid television in any country in the world by far. And that’s going to decline slowly because there lots of big companies invested.With a lot to lose.A lot to lose.You’ll think they’ll ... Even though you’ll hear throat-clearing from a bunch the networks saying, “I don’t know if we need to be in sports.” You think when push comes to shove, they’re going to stick around?Oh, I don’t think there’s anybody in a broadcast network thinking, “Oh, we don’t need to be in sports.” There still is a lot of money in the paid television system. I, now, of course, believe it will be disrupted by new companies. So let me be on the record that it will be disrupted by new companies.You can hear John smile as he says this.But there’s still a lot of money, there’s over a hundred billion dollars in distribution fees that is overwhelmingly tied to sports. What is must-have content that will keep you from changing your provider or make you change your provider? It starts with sports, sports and sports.So you spent a lot of time thinking about this at ESPN and I’m sure you think about it now. When do you think you’re going to see the guys in Silicon Valley who really have unlimited amounts of money say, “All right, we’re in and we’re going to pay more than the TV guys can pay.”I don’t ...I thought somebody was knocking. No? Just my imagination?Look, these are smart companies. They will come in as soon as they have a compelling reason to buy sports and a compelling strategic imperative that it will drive their business. I don’t think that that is self-evident that there is an ... That it is where they will spend their money. They’re like everybody else. Everybody loves sports. It’s fun, everybody when they think about it goes ...Well, some of them don’t like it all, they literally don’t understand it, but yeah.Be great to be in sports. The sports guys want them, right? The sports leagues will say, “No, no, no, we know that YouTube’s around the corner.”Every time I hear that they’re inevitably coming, I believe that I hear some commissioner of some big league in the United States whispering into a reporter’s ear that they’re coming. And of course the leagues ... It’s good for the leagues, I would be doing the same thing in their position. To have more bidders is always good. To have only bidders, broadcast and pay and cable television companies who are facing very, very significant issues with their two streams of revenue to have them as your only bidders I don’t think is a comfortable position for them to be in. They’d like new bidders. I think they would like DAZN to be a bidder. So I don’t think we’ll have any resistance to our being, again, we’ve bought the Serie A, we bought the Japanese baseball league, the Japanese soccer league, and we’ve bought Champion’s league, and we own ...It just seems when push comes to shove, those same leagues, especially the NFL, but I think all of them still are afraid of moving away from their traditional model where they know they can get 100 percent reach and they don’t have to ask someone to plug in a Roku box or figure out their router. They’re very reluctant to actually make the leap and take their most valuable stuff and make it a digital-only thing that they will sell to Google or Apple.The commissioners of leagues big and small have the obligation to deliver as much money as possible to their constituents and they have the obligation to try to grow the game and make sure it gets better. And of course those two things can be in conflict if you’re moving from more widely distributed platforms to less distributed platforms. On the other hand, having a very significant amount of experience in this area, I discovered that revenue at some point is the more important of those tasks. I will tell you a fun anecdote, which is there was once a moment in time when we were trying to get the college football playoff onto cable television and were told that just wasn’t possible to do so. And so I devised the strategy of bidding for cable, to put it on cable, and a bid to put it on broadcast television, and guess what? The bid for cable television was acceptable and it moved from Fox to ESPN.Which is at some point in January, I’m going to watch Alabama play someone. Gotta get ... It’s Alabama always, right? I’m not a huge college football guy, but I think it’s Alabama.You’re always okay, if you never watched a college football game for the last five years, you’re always in safe territory at a social event to say, “I think Alabama’s going to win this year.”Right, and that’s why I do think that anecdote and Rupert Murdoch launching Fox by buying NFL rights is why I do think someone, whether it’s Amazon or Facebook or someone is gonna go, “I hate this idea, and I don’t like sports, but fuck it, let’s just spend way more than the network’s going to pay.”They’ve just gotta decide that it makes sense. And I have to say, I always think it’s smart to think, as you’re trying to execute some strategy, to think about the people who are your competitors and what are they thinking? And if I’m Amazon, I’m mostly thinking about sticking to my business, and my business is selling things online, or getting people to spend their time on Amazon to buy things online. Last time I checked, getting people to Amazon Prime is worth a lot of money relative to a regular customer. So if sports would move people to Amazon Prime, I would assume they would try to do it. If it wouldn’t, I don’t know why they would buy sports because they want to be in sports. It has to be a strategic reason.You are a sports fan. Uh, yes.Do you think it matters that guys who run tech companies, and by and large — I think Tim Cook is a outlier here — are not sports fans? Jeff Bezos does not watch sports as part of his routine, Mark Zuckerberg’s not into it. Larry Page doesn’t know what football is. I don’t think it’s that significant, only because they’re all whip smart and if they can do things to grow their business, they will do it. I think you have sometimes the opposite thing, which is you have male executives, particularly at big companies, who want to be in sports and will end up making a big deal to name a stadium or to get season tickets or to buy rights because they love to be in sports. Love to be in sports, love to be in that shot of them in the box.Yup. So I do think sometimes exuberant decisions are made, but I think they tend to get made to be in sports when it’s not really critical for your business as opposed to anybody not being a sports fan refusing to make a critical decision that will help their business. I don’t think that’s going to happen.What is the coolest thing you can do now today at this job that you could not do in your last job?I don’t know. Besides talk to me.I don’t think ... I don’t know that I have good answer to that. I got to do cool things, you know. I’ve worked at Rolling Stone, I got to do cool things that were ... I just mainly got to do cool things. I got to do cool things at Walt Disney company. I get to do very cool things now. What do I get to do that’s cool now? We’re a global company, I’m going to Japan the first week in December, we got big business there. I’m very excited about that. I am looking at the map of the world and I am in a furious rate putting check marks on places I’ve never been before, because again, we think this is about scaling up this business. We are, right now, the global leader in over-the-top sports streaming services. We have more subscribers than anybody else in the world. How many subscribers is that?It’s more than anybody else in the world. So whoever you can think of, tell me how many subs they have, we have more. I won’t disclose that yet. ESPN said they had a million for their ESPN-plus. Did that number surprise you, by the way? No, and we have more than that. Not in the United States.More than a million global, right? I mean, part of it, right? There is no one else who’s a global streaming sports subscription service.We have not given any public numbers. I’m not going to break that precedent here. We have been public because there was some purporting reasons, that we have over a million subscribers in Japan. So there you go, more than a million. What else do we need to get to?I don’t know. You don’t really use this as a promotional platform. You know I’m always willing to do so.You could promote all you want.Did I mention that you could get a subscription to DAZN for just $10, which is only one-eighth of a cost of a paper you find?I’m going to keep back to this, is ESPN. So ESPN has a million subs and they were able do it for a bunch of reasons. One is, they moved their Insider service that you launched. And two, every time I go to the app or anything else, they’re pushing this thing. You guys don’t have a platform like that where you can put this in front of my face. As powerful as my podcast is, it is not gonna get you a million people. How are you thinking about figuring out how to navigate that environment where you don’t have the same resources to market a product?Again, we have to do a country-by-country strategy, and you’re asking me I think specifically about our strategy here. Again, it’s sequential. We’ll have to be opportunistic, we have to be smart, we’ll have to be inventive. I’m quite confident in our ability to come up with things that will drive subscribers, and it may be a niche sport that’ll get us 25,000 subscribers. It may be a piece of original content that’ll get us 16,000 subscribers. It might be doing a deal with somebody else, to merge our assets. It might be any number of things. We’re going to have to be more creative. Again, I have lots of experience working to try to create a new business out of something. I did that often at a big company, but we still did it the same way you do it before. You had to think of some benefit to the end user. You got to think of some reason that a company wants to do business with you. You got to figure out how to drive a new marketing model.But there is a difference there, right? Because you can’t at a Disney or an AT&T or a Google brute-force your way into X number of subs. You can buy that many billboards, you can pair up with Spotify. There’s lots of ways to do it that you guys could theoretically do, but it’s much harder for you to do.You’ve read Malcolm Gladwell on David and Goliath and certainly, Goliath has some significant advantages and he writes about — and you’ve read it — that what you have to do is to get your competitors to either play in your arena, when they really shouldn’t, or you have to let them concentrate on what is important to them. And those tend to be big things, they tend to be sometimes protective things, and you have to work on things they’re not thinking about. I don’t actually think, I don’t know of anybody who asks Golden Boy if Canelo would move his fights off of pay-per-view. So we have to do that again, we have to figure out and it’ll be one thing at a time. And I can pretty much guarantee you that we will not get to the end of the year before you hear about a couple of other things where we’ll do something that’s a little bit disruptive, it’s a little bit fun, a little bit opportunistic. John, you look like you’re enjoying yourself.I am enjoying myself, this is fun. But again, I’ve never worked anywhere where I didn’t have fun. I generally do, but there is a liberating aspect to being able to be disruptive, and it’s fun to be the first person, or to work at a company that’s doing something first. And these guys, again, my hat’s off to Simon and his team. These guys are doing this first. It kind of astonishes me. You know, sometimes good ideas, you go, “Why didn’t somebody else think about and start doing this?”Well, people have been asking, you know, asking Netflix forever, “When are you guys gonna do sports?” And they’ve got a very specific why they’re not going to do it. It is interesting that no one has tried to do an international sports streaming service.Look, it’s complicated. Including, the technology to do this is very complicated. And you heard Brian Rolapp at one point say, “Gee, we need these companies to get better. Because if we are going to put the NFL on them, it would break the internet.” It would. When we were looking at BAMTech, we looked at the universe of companies ...Back in Disney.The universe of companies that could do this, and the two that could do it were BAMTech and Perform. Those are two companies that have an end-to-end solution for how you ...So you bought one of them and you’re working at the other one.It is a funny thing. Again, back to, you know, what I learned at other places, it turned out be important here. I did learn that Perform had a ... And by the way, the first time I met Simon was back talking to them about their platform and they were looking for investment at the time, but it’s not trivial, you know? And even the big companies you talk about stub their toes, right? The U.S. Open experience in England, I don’t think was a comfortable experience for Amazon. There’ve been many other ...World Cup broke for YouTube this summer. These things are hard. And what’s hard about it is scaling a simultaneous live event to a lot of people. We do it quite regularly at a over a million viewers to people. The Anthony Joshua fight world wide at more than a million people watching concurrently. We believe we can do 10 million, and of course we’re busy preparing to do 15 and 20 million. And as long as we can stay ahead, we have technology ahead, we’re first mover, we get launched ...You’ll hear us announce next year, our goal next year is to be in 20 countries before the end of ’19. We’re in seven now. So you’ll see us moving quickly in other places in the world. You’ll see us actively acquiring rights in the world. You’ll see us improving our technology. We know we can continue to improve our product, and we’ll do that, and you’ll see all of that, and I’ll be happy to come back on six months from now and we’ll talk about all of that.John, how much is a DAZN subscription? I believe you can buy one for $10 in the United States, and something fairly equal to that in yen in Japan. And I’m tempted to say lira, but they no longer have lira in Italy, they have euros.I don’t think we have a lot of Japanese listeners. We have people in other countries, but not a lot of Japanese listeners for some reason.And there’s no deutschmark anymore either, so. It’s euros, yen, dollars, Canadian dollars.$10 in the U.S. They can make a check payable to you or they can go online. I would think they will go online. Go on, go onto the app store, download the DAZN app. You can get a free month. Second month is only $10, divide that by two, it’s $5 for the first two months and you’re off and running.You’re bouncing in your chair. Thank you, John. Thanks for coming on the podcast. Thank you, Peter.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}