{"id": "Full Q&A: ‘Good and Mad’ author Rebecca Traister on Recode Decode", "paragraph": "New York magazine writer Rebecca Traister, the author of a new book about women’s anger called “Good and Mad,” says it is way, way too soon to pat ourselves on the back for the gains of the #MeToo movement.“I don’t see any of this ending in our lifetimes,” Traister said on the latest episode of Recode Decode, hosted by Kara Swisher. “I don’t think it should. This has been centuries behind us, and it’s centuries ahead of us, and the aberration and the error was in not being mad all the time, being somehow convinced that we didn’t have anything to be mad about.”“Whatever happens in the midterms, whatever happens in 2020, this is not fixed with an election,” she added. “... In so many ways it’s so much easier to think of this as a story about individual bad people, and individual politicians, and if we could just get rid of Donald Trump or just get rid of Harvey Weinstein or Les Moonves, we’ll solve the problem, when the real project ahead of us is remaking the entire system. And that is a project that will extend well beyond our lifetimes, but to which we must all commit.”Traister said there’s a long, clear history women using their anger to change culture and policy, some of which has been whitewashed by those who ostensibly agree with the outcome. And when people lose their historical memory for the slow, often frustrating pace of social change, they can feel burned out by setbacks.But whether #MeToo supporters are hitting the history books or hitting the streets to protest, Traister said there’s one “universal” thing they all can do to avoid burnout.“Here’s the solution to exhaustion, is you become part of a group and a network where, when you need to take care of yourself, you can and know that you are connected to people who are doing the work,” she said. “And then you tell those people when they need to take a break and take care of themselves. That’s the solution. The exhaustion comes when we’re on our own and feeling alone and driven into this fury, and then there’s no-one to rely on for support or help.”You can listen to Recode Decode wherever you get your podcasts, including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a lightly edited full transcript of Kara’s conversation with Rebecca.Kara Swisher: Today in the Red Chair is Rebecca Traister, a fantastic writer for New York Magazine, one of my favorites, and The Cut. She’s also the author of a new book called “Good and Mad: The Revolutionary Power of Women’s Anger.” Rebecca, this is a very good day to talk.Rebecca Traister: Very good day, very bad day.Very bad day. Welcome to Recode Decode.Thanks for having me.So I want to talk about your book and your background. But I do want to get into today. This is just a disturbing day for the media and others. And there’s a lot of rage going around and obviously these pipe bombs are being found all over the place, aimed at Democrats, essentially. And you have a president responding.And the media.And the media, and the president responding saying it’s their fault or that they did it to themselves or something like that. And so I’m really kind of irritated right now, I’m particularly irritated. And also because it all falls into this stuff.But let’s talk a little bit about your background, how you got to this. I like to know what people have done and how they get places. So give us a little bit of your background of how you got to this topic and writing in general.Well I didn’t have any particular grand plan to become a journalist. It always felt like a very glamorous career. I grew up the daughter of academics, and the idea of writing something and putting my name on it and getting paid for it was basically the equivalent of being a movie star. And I didn’t go to journalism school. I went to Northwestern, which has an incredible journalism school.It does, it does.But I did not go to Medill. I got a degree in American Studies. I studied literature. And then when I came to New York after college, I actually worked for ... my first job was for an actor, as an assistant. I thought maybe I would work in the movies.How did that go?It was a personal assistant job.Yeah, yeah, exactly.It was a lot of coffee and a lot of delivered expensive sushi and some crazy travel with famous people. And then in my mid-20s I got a job as an assistant at a magazine that was being edited by Tina Brown and that was being funded by Harvey Weinstein.Oh yeah.Talk Magazine.Talk Magazine, oh man.And I was a secretary there. I was the secretary to the number two editor.That must have been a ride.It was, I was there ... almost my entire tenure there was before it launched.Oh, wow.I quit very quickly after the first issue. So it was like a year of preparing to publish a magazine.That must have been a hot mess.Ohh.Hot mess is how I’d...I met a lot of really good friends there. And I actually, that’s where I met journalists, the young writers and editors who worked there [were] so talented. And they encouraged me to think about becoming a journalist myself.Right.And helped me to get a job as a fact checker and a reporter at the New York Observer, which is a weekly newspaper. And when I was there, I was taught sort of the very nuts and bolts of how to be a reporter. And I was put on all kinds of beats that I didn’t much care about, real estate sales and the gossip column. But I learned how to meet a deadline, and how to write a lede. And I always had feminist politics, I grew up in a home that was political. My father came from a super left New York family. His relatives had been party leaders in the mid-20th century. And my mom came from a Republican household but had turned left.So I always had left politics, and I was particularly interested as a student in various kinds of inequality — gender inequality, racial inequity, and how they shaped literature.And social justice.And social justice. But it wasn’t quite ... I wasn’t an activist. I don’t quite know how to describe it. On campus, I never took part in a Take Back the Night march, which was happening a little bit on my campus in the 90s. I was not an activist by any stretch of the imagination. I often wonder, if I could go back and ask myself…. I knew no one called themselves a feminist. I was in a million classrooms where people would make an observation that began with, “I’m not a feminist, but ... “ It was deep anti-feminist backlash time. I wish I could go back and actually know the answer to the question of would I have actually called myself a feminist then? I don’t know whether I would have.And you certainly didn’t object to those.No. I was feminist in my curiosity and in how I read the literature that I was studying. But I don’t know how ... I was just not an activist feminist by any stretch of the imagination. But I had curiosities and about gender, but I couldn’t have imagined making it a career. And then I got a job at Salon, the online magazine. And it was writing a sort of squishy section about “women’s stuff,” like sex or education. It could have been anything, just what used to be called “The Mothers Who Think” column. And I started to write from a sort of rudimentary feminist point of view. And this was in 2003, 2004. And those pieces started to get readers, which then there was an incentive for my bosses to have me keep writing from a feminist perspective. So I got to develop a beat. And I became a feminist journalist. A lot of ...Were you following in anyone’s footsteps? I mean Gloria Steinem was a feminist journalism. You remember the Playboy piece?Absolutely. There had been a very robust feminist media through the 70s. And there had been ... Katha Pollitt was writing feminism in The Nation throughout that deep backlash period, where basically there wasn’t anybody else. Ellen Goodman, to a certain extent.But she was cute.Anna Quindlen. That stuff wasn’t, except for Katha, who was super feminist, in mainstream press, there wasn’t like a politicized feminism.As it had been before.As it had been before, through the 80s and 90s, that had sort of disappeared. The notion of a feminist media that is now, for anybody listening now, they’re like, “Sure, there’s a feminist media. There’s a feminist blogosphere, there’s a feminist …” You know. That was not ...There was one, and then there wasn’t one.And then there wasn’t one for a long time. And so this was a period in which ...Actually, it was very similar, what happened to gay publications. There was a whole bunch of gay, like Advocate and everything else because there was nowhere to go. And then the mainstream media subsumed all of that stuff. So it was present, but not heavily present.Right. And there was a feminism on the margins. There was a zine culture, there was a music culture, riot grrrl feminism, but it was not anywhere near a mainstream set of media or pop culture, for a long time. But about the time that I started experimenting, writing basically pop culture criticism from a feminist perspective, there were other people, other journalists my age, I think there was that sense, it was like a generation that hadn’t lived through the post-movement vilification of whatever disruptions you’d made. And it was like, there was a sort of hunger to like, wait, can we go back to talking about this now?Right.And that was happening, I was doing it, but there were also dozens of other people doing it. Some of them coming out of activist spheres, out of the Dean campaign and the netroots stuff in 2004 came a lot of women who were irritated by gender politics on the left. So that was the sort of moment that the feminist blogosphere, as it was then called, sort of blossomed. And those were the years during which I first started developing my beat. And it was a lot of pop culture criticism, and then ...What were you aiming to do? What was the goal for you?I wish that I had had a cogent kind sort of vision of what I was trying to do. I felt it was exhilarating because it was like I could look... It was a great freedom of getting to make my own beat, and getting to decide what I got to write about and then considering it through a feminist lens. Now obviously, especially at the beginning, I hadn’t been schooled in any of this stuff. I actually hadn’t taken Women’s Studies classes, I didn’t know much about social history in the United States, I really didn’t. And so a lot of the stuff that I wrote then was quite blinkered, with regards to gender and race and class.What do you mean?It was very rudimentary stuff. I didn’t take ... there was no history, there was no texture. It was kind of like, “Well, this seems sexist!” I don’t mean to … some of it was smart! I’m not a stupid person. But it was totally unschooled. It had none of what I aim to do now, 15 years later, which is trying to tell a bigger story.”That seems sexist!”Right. Seriously, that was a lot of ....“Pantyhose!”Right! “High heels, what’s up with that?” It was like the Seinfeld routine of feminism. It wasn’t quite that bad, but it was very, there wasn’t a sense of this stuff that had come before. For example, you say, “Oh, well Gloria Steinem was doing this kind of stuff. This is what Ms. Magazine was.” Well I hadn’t, at that point, I knew what Ms Magazine was, but I hadn’t read those stories. And one of the things that happens, and this is not within lots of social movements, that sort of get pushback in a backlash and then get revivified by another generation. The generation that emerges doesn’t know that the people have been there 30 years before. And I think that’s okay, by the way, and I think there are frustrations, that’s part of what leads to generational frustration. But by the way, there’s a certain exhilaration in thinking you’re discovering something for the first time that can hook you into these ideas. You don’t necessarily come into these things wanting to say like, “Well, my foremothers were writing these exact same sentences.”And let’s go all the way back to the Declaration of Sentiments, perhaps.Yes. That’s a pretty good document.Right. And in fact, in the book I just published, one of the most moving pieces of journalism that I came across was one by Vivian Gornick, the brilliant writer and essayist. And she was writing in the 1990s, looking back and having been part of that second wave in the 1970s. And talking about the exhilaration that she felt reading some of the suffragists and abolitionists when she was a young feminist in the 70s, and thinking “Oh my God, these people, they’re saying what we were saying a hundred years ago!” And she writes about how it was thrilling, but that it wasn’t yet sobering. And that it should have been sobering. And of course, the reason that it should have been sobering is because it was like, wait, if people were saying this a hundred years ago, and we’re still saying it today, then something happened in those intervening hundred years where we didn’t get to the promised land.Yeah, exactly. Absolutely. They were quite woke back then.Yeah. Well, about some things. They were very racist, in ways we’re still ... those are the long-term...Issues, absolutely. Between people of color and women of color.Right. The inequities that have marked really every progressive coalition and that are very damaging to them. And #MeToo.I mean, everything. But anyway, the early work was very much just a thrill at getting to like ... honestly, and a lot of it was this pop culture stuff, a lot of it was like “Britney Spears cut all her hair off, and it’s a tabloid story, but wait a minute, I think this actually has …”Bigger repercussions.Well yeah. And there’s something about a pattern around gender and power and remaking oneself and the power to control your own image. I don’t even remember what I wrote about that. But that was the sort of initial entry point is like, “Wait, I could look at the world through these glasses and see it in a way that I don’t think is being talked about enough.” And that was true. It was really kind of a desert out there.Now, of course, that sort of, “Let’s look at this from a gendered perspective, or a perspective that takes into account inequalities,” there’s much more of that all around us.In fact, it’s woven through stuff. Exactly, exactly. But that wasn’t really true 15 years ago.Right. So, the book. It’s kind of a perfect storm, it’s a terrible storm right now, of anger and rage, which had been building.Yeah.Which, it happened in the 70s too. It happened in Elizabeth Cady Stanton’s time.Yeah, it has to build to a boiling point. And especially when it comes ... the book is about women’s anger about all kinds of injustice. So it’s about women who exploded with anger over racial injustice and violence and how their anger, in fact, was catalytic to a civil rights movement, to the abolition movement, to the gay rights movement. But when it comes specifically to women’s anger at gender inequality, there’s a specific structural thing that makes it hard and makes it one of the reasons it only happens every 50 or 60 years. Because if you’re going to get angry about gendered inequality, because women are a majority population, an oppressed majority, which is a rare and delicate thing, it means that every woman has men in her life and every man has women in his life. And that means that the people you’re identifying as your oppressors are the people with whom you have some of your most intimate relationships. Familial, your fathers, your brothers, your friends, your, in many cases, your lovers or your partners, your sons. And that intimacy and the fact that to challenge the power dynamic in those relationships means disturbing the nature of those relationships makes it an incredibly heavy lift and hard to get a mass number of women angry enough that they’re willing to sort of wreak that havoc on their personal and their professional and therefore economic lives.I get it, I have two sons.Right.I am always saying like, “Oh, mediocre men.” And my son’s like, “That’s sexist.” I’m like, “Yeah. But it’s true.”Right. This is one of the things I hear all the time is, “My sons.” From all kinds of angles. This is hard, hard emotional work to bring a social justice movement into your own family. No, absolutely. I’m always like, “Not you. But the rest of them.”Right, right. And then you’re like, “But you… ?” Like what is ... and me, and what is my role here, and what is, you know … ?Yeah, I’m often saying, I go, I sometimes say, “All men,” and then my son goes, “Not all men!” And I’ll be like, “Of course it’s not.” You say it off the top of your head. And I go, “Many men.” And then I have to correct myself and say, “Most.” And then I’m like, it fascinates me. So it led to the book, and we’re going to get into more details in doing this. You thought it deserved more.Well it was like that initial lens that I had that I could look at the world and think about it with regard to gendered inequality.Right.There was a kind of revelation I had between the 2016 election and the beginning of 2017 that was like, “Oh my God, anger.” Wait, I knew anger had always undergirded,  I wouldn’t have written about this stuff if I hadn’t been angry about the inequalities. Right.But I’d never thought of anger as a motivating factor. I think in many ways, women are trained not to consider their own anger, to distance themselves from it, to not focus on it, to obscure it. But I could see it, in the years I’d been doing this writing and learning some of the history that I’d never been taught, and also looking around at the world as it is and what needs to happen as we move forward, I was like, “Wait. Anger is a thread that connects all this stuff I’ve been learning and thinking about and reconsidering.” And in fact, it’s a thing we’re not supposed to look directly at, if we’re women. So that was the sort of motivating idea behind the book.I agree. I think that’s what changed the gay rights movement, anger. Backed up. They were right. Everyone was like, “Whoa, careful, let’s get along, let’s compromise.” And I kept thinking, no, that’s exactly what has to happen, the only way it’s going to make change is by being angry. And they changed everything. Not the compromisers. The compromisers did not do it. It was the angry people.In the book, this is what I write about chaos. And one of the fears about anger, especially from people who have less power, and therefore when they challenge ... anger coming from the powerful to the less powerful isn’t chaos. That’s how power works, right? That’s police killings. That’s not chaos, that’s control. But when people have less power challenge the power system, it becomes chaotic and scary. But act up is a perfect example of that, and I write in the book about Stonewall. And that was also a moment ...No, we say no anymore.“I’m angry, I’m going to throw something.” But if you do that, and you’re the person who has less power, that’s how you get characterized as a mob. As a riot.Right. And we’re going to talk about that, as “mobs not jobs,” I am literally livid right now, I could tell you so many things. Why now has this happened? You’ve written this book to talk about this and what it does, and the power of anger and how it creates chaos and also social change.Well I think that the anger had been building. And it had been building before the 2016 election. There was this period, the 80s, Reagan, the 90s, the Clintons, the Bush ...I’m still mad about the Reagan administration, just so you know.Well, you should be. Because part of what happened is in the wake of those late 20th century, disruptive, chaotic social movements, right? Where people who had historically been barred from certain kinds of power stage mass movements to disrupt and change the way the systems worked. And so you had a civil rights movement, a gay rights movement, a women’s movement in the 60s and 70s that changed the laws, changed the norms, changed the assumptions. And, dramatically in many ways, though [they] did not fix them, altered the ways that institutions worked. The ways that political and educational and economic structures were composed and who could participate in them and who deserved protection under them, right? And that was an extremely chaotic period in the United States.And because, ultimately, it did not stop the United States from being a white patriarchy, where, you know, power was still aligned to white people in the United States and men had still a significantly higher share of it. There was a kind of retraction after that chaos. And what we call in feminism, Susan Faludi wrote the book called “Backlash.” It was the post-feminist backlash period, during which, part of the work of backlash and quelling that chaos and stopping the disruption was in vilifying those who had caused it, which is where you get all the bad stereotypes about angry men hating sexless, humorless feminists.You know the joke, I hate to quote a Roseanne Barr joke, but it’s a good one.Which one?She has, I don’t know why, it’s like man-hating lesbians and stuff like that, and she goes, “I don’t know why they think lesbians hate men. They don’t have to sleep with them.” That’s a good one.That’s a good joke. Roseanne used to be like a ...She used to be funny.She used to be, and she used to be like a-Now she’s real mad.And she’s so mad. Yeah.Or something else. So but the other part of that is telling people that, “Oh, you fixed it all. We’re post-race, we’re post-feminism.” There’s nothing left to be angry about, right? If you’re still angry about inequality, then you’re somehow theatrical. You’re borrowing your outrage from another era, right?Right.And this is a myth ... America, and especially the people who have the most access to power, the white middle class, is most likely to be the storytellers, to control the cultural narratives, the pop cultural narratives, the political stories. The politicians are all like to be people who, themselves, are insulated from some of the effects of what was always pernicious-Right. They have no idea.... and continuing inequality, right? And so they could tell themselves, in part to preserve their own continued power, there’s nothing left to be-Well, because they aren’t being attacked ever. They had no idea.Right. Right. And they didn’t want to have it. It’s not just that they have no idea. It’s that you have no-That’s an interesting question, because when you think about a lot of the stuff that’s going around, #MeToo ... We cover it from Silicon Valley’s perspective, and we had covered the Ellen Pao trial, and we’d covered Susan Fowler at Uber and stuff like that where that was that manifestation of it. That was the tech manifestation of it. And I always think women had 10 stories like this, everybody, and they ranged from very minor ... They weren’t minor. None of them were minor like “sweetie” and that kind of stuff, to the very disturbing, really sexual assault, essentially. And every woman had 10 stories like that somewhere along that continuum, and every man was surprised by it. “Oh, I didn’t realize. It was fascinating! I had no idea.”We just had such a ... I’ve thought about this a lot, because there was this period right before the 2016 election, this kind of the amnesia. The degree to which people who don’t experience it don’t want to think about how ubiquitous these kinds of inequities are. So right before the 2016 election, after the Access Hollywood tape, there’s this period that we’ve kind of forgotten-This is the Trump ...Yeah, after the release of the Access Hollywood tape and then women coming forward with their names. The People reporter, the woman on the airplane telling stories about how Trump had groped or assaulted them. And there was this outpouring. It was a hashtag campaign. It was millions of women telling stories, and I had conversations that fall, that month, leading up to the election in 2016, with men saying, “I had no idea.” A senator said to me, “My wife got groped on the subway,” and I was like, “Of course she got groped on the subway. We all get groped on the subway. How is this a surprise to you?” And men saying, “I had no idea. My eyes are open. I had no idea how frequent this was.” Okay, and I was like, “Wow, maybe men are really seeing.” A year later, in the wake of the Harvey Weinstein reporting, there is the #MeToo movement, which of course is a later iteration of Tarana Burke’s “Me Too” movement, which she founded and led in 2006 and on. And during that moment, I have all these conversations with men who are like, “Oh, my God. I had no idea how common this was!” And I was like, “But we did just talk about this a year ago, right?”Yeah.And then this summer and fall during Christine Blasey-Ford, when you had a whole new batch of women, many of them in that case actually older women, talking about-What happened.... you know, what they’d experienced in high school-Happened to me. ... and college.Happened to everybody.Again, of course, it happened to everybody. But I also had all these conversations with men being like, “I just had no idea,” and I was like, “You guys! We have now talked about this three times! How can you ...” First of all, we don’t want to think about the things that are hard, which is also ties into the answer of how could people who don’t have to be angry because they have certain comforts and privileges, how are they anesthetized to not feel the anger, to not see the inequality? It’s because it’s easier, and we know from the way people talk now, like, “Can’t we just go back to when Twitter was about bad TV?” There’s a desire to go back to a point where we’re not in the midst of a fight for the country’s soul, where we’re not in the midst of a fight where we’re likely to suffer horrible, depressing, terrifying defeats, where we don’t have to look straight every day at the kind of violence and suffering that has always been right there, but there were not circumstances that forced us to look at it. Right?Exactly.And but it’s that desire that’s so dangerous. That desire, which is natural and human-Was to let it go away.... was to pretend things were better than they were. If you were a member of a class and a population-It’s fine.... that could take advantage of the opportunities that had been won and didn’t have to look at what-Now we can relax.... had not been won.Now we can relax.Right? And that was the story of the 80s and the 90s, and then, of course, it sort of hit a symbolically ... You know, with the election of Barack Obama, which was read by many in a mainstream popular media as a signal that, like, “See? Racism was a stage through which this country has successfully passed. We have elected a black president.” Well, and the stories around Hillary Clinton contributed to that, too. “Look, the next president is going to a woman, inevitably. She might as well have been the president.” And that, it was all part of this decades-long lie that was absorbed by the people who had the power to propagate it that we had fixed the glaring and defining inequities on which this country had been built.But there was anger that was bubbling up resistant-Underneath. Underneath.... to that narrative. So you had Occupy Wall Street, which was a furious demonstration in response to economic inequality. Black Lives Matter. That comes during the Obama administration when it’s activists who are furious at the state killing of African Americans who are ... and in fact, thanks to the media and the ability to show streaming video of kids ...Kids getting killed.... getting killed that echoes some of the way that visual media was used to show the ravages of lynching Emmett Till’s body. That is part of what enables Black Lives Matter to erupt in the way that it does, and this determination, an angry determination, to make those who don’t want to look look at the violence that is being enacted by the state against African Americans all the time. And that movement becomes incredibly important to shaping our politics.It’s interesting you say that about it. When you even say, “Look,” they don’t look. I have relatives, and I’m like, “Look at the videos.” They’re like, “Well...” and I’m like, “There’s videos now, and you still won’t accept it.”Right. Well, but that’s true of every ... I mean, one of the myths about the civil rights movement is that it had wide public support and that, you know, no. It was, a minority of Americans were supportive of the Civil Rights movement. In retrospect, again, it’s the way that we talk about Dr. Martin Luther King in a kind of sanitized way that doesn’t even acknowledge the anger that drove him. There’s a way we want to flatter ourselves always in retrospect by talking about all of the great strides we’ve made without talking about how a majority of Americans resisted those strides in the moment that they were happening.Absolutely.So, but there’s no question that Black Lives Matter changed the nature of the discourse around politics, pushed politicians, many of whom, if you look back at 2016, still both Hillary Clinton and Bernie Sanders were resistant to talking, being challenged by Black Lives Matter activists.So you’re talking about the idea of rage being useful. So when you’re talking about in the context of women, women get mad all the ... Yeah, like you said, I get mad and it doesn’t ever seem to push the ball forward, to use a terrible ...Well, I think we don’t-Manly.I think we don’t often acknowledge the ways in which their anger may be politically consequential. So for example, the women who first started saying, “Black lives matter.” Those are the women who founded that movement, which then becomes a mass protest movement that shapes, not just a protest culture, but a football culture, right? This is our industries, our businesses, our national pastimes. Right. Right. Fair point. That’s absolutely true.Right, and I think that that’s true of a lot of our history, because we’re discouraged from considering women’s anger as politically viable and politically consequential. What we don’t see ... We can acknowledge Rosa Parks and Mamie Till as catalytic figures in the Civil Rights movement, but we never talk about their anger. Rosa Parks is brought to us as an extremely tired, saintly-Saintly..... and stoic figure, and we, until very recently Danielle McGuire’s book Dark End of the Street helped change the national conversation about Rosa Parks, but that’s a conversation that women within the Civil Rights movement, that Pauli Murray and Gloria Richardson were anxious to have during the Civil Rights movement, saying, “Wait, let’s take a fuller look at Rosa Parks.” Rosa Parks was a lifelong furious fighter against racial injustice. She was an investigator for the NAACP who investigated the gang rapes of black women by white men in the Jim Crow South, and investigated often false claims of sexual violence made by white women against black men.Right. She did. That’s right. That’s right.This was her life-That was her job, yeah.... was anger at racism and racial violence. One of the reasons that we are still able to write off women’s anger so easily in a popular narrative as hysterical, marginal, unstable is because we haven’t ever gone back and appreciated the ways in which angry women have shaped our rules.Right. Harriet Tubman.Harriet Tubman!She was pissed.She was pissed! You know who else was pissed? Here’s a good example of the way we-You’re right, Rosa Parks is always seen as this sort of saint. It’s true.But think ...Gentle. What do you know about Abigail Adams?She was mad. I read the letters.Okay. Right. If you’ve read the whole letters, you know she was mad.Yeah. Not mad, not insane. She was angry.Angry. By the way, it’s not probably a coincidence that “mad” works in both directions-Right. Yes. That’s true. ... especially when it comes to women.That’s a fair point. Yeah, “hysterical.”When it comes to women, right? There’s a ... right. So-Oh, someone the other day called me ... I have to remember. It was one of those, hysterical. But go ahead.The way that I was taught about Abigail Adams, which is largely through PBS documentaries, right? Is that in the story of the founding-The love story.... Which, of course, is the story of our founding is we revere the disruptive-Fathers.... and chaotic rage of our founding fathers, who you know, N.B., were white men. Right?Yeah, and then the avuncular Ben Franklin.Then built a country. Right. But in the storytelling of that there’s always this one line from Abigail Adams that gets sort of put on the museum walls or in the PBS documentaries, which is, “Remember the ladies,” she writes to her husband, John. Right? “Remember the ladies as you make this …” Right, that was the big feminist statement, but if you actually go back and you read Abigail Adams’ letter, that same letter, she uses the same language of revolution that the founders were using. She says, “Remember, all men would be tyrants if they could.” Right.Right? “Tyrants.” It’s the tyrannical rule of Britain that the founders are rebelling against, and then she says, basically, “If you don’t include women in your vision for this new country, basically purported to be built on liberty and equality and representation, we are determined to foment a rebellion.” She basically, in those letters-Threatens.She threatens a revolution, but that part, those angry parts where she’s using the language of revolution around women’s rights in the 1770s, we’re never taught that part. We don’t get the picture of Abigail Adams, who’s furious to the point of threatening rebellion and using the language of tyrannical rule with regard to gender relations, right?Right.We’re not told that in that same era-She’s the help maid. She’s the wise help maid.Right, and I was never told, I didn’t know the story of MumBet, who was an enslaved woman in Massachusetts working in the home of one of the revolutionary politicians, and she hears the language of revolution and applies it to her own condition where she is badly physically abused within the home in which she is enslaved in Massachusetts, applies for her freedom, wins her freedom, and her case becomes the basis for the abolition of slavery in Massachusetts in 1783. So there’s an example of a woman whose anger, borrowing from the revolutionary rhetoric in her home, leads to the change of a state law that abolishes slavery in that state. But are we ever taught the story of MumBet, who’s later known as Elizabeth Freeman? No. We are never taught the history of women’s anger as part of what changes the laws. Right. Right. So where are we now? You have all these various ... and there’s anger washing across Twitter and social media. There’s fake anger rushing across it. There’s the #MeToo movement. There’s all kinds of things around gender inequality and racial inequality going on. There’s a president who creates anger everywhere he goes. And who has built his own power on-Anger.... the punitive anger of those who have historically felt that they had a grip on power that has been challenged by the less powerful, whose anger is-And there’s so many writers now. I always say they kiss up and kick down to stop the anger from coming up.Right. You know what I mean?Well, because the anger from the powerful is-And his “jobs not mobs” thing is the same thing.So there’s a pattern. What I was referring to before is, when the less powerful challenge the ascension or further accrual of power, this is a ... The Kavanaugh thing was a perfect example of this, right? In fact, the thing that was being threatened was that Brett Kavanaugh might not be appointed to the most powerful ... He wasn’t even at risk of losing his job as a judge. He wasn’t at risk of incarceration, losing his liberty. Nothing criminal. The question was would he get this massive promotion where he’s going to have the power to determine the rights, ability to vote and control your bodies for millions of people for a generation or more. And the objection to his further accrual of power based on credible accusations that he had abused his power physically and sexually in his past, that was recast by the most powerful in the situation, the president, the party that was invested in his further accrual of power, as an attack on him.And I write in the book about the first time that I saw that pattern happen, and once you see it, you cannot unsee it. You realize it’s happening all around you every day. Was, I noticed in 2015 when Freddie Gray was killed by police in Baltimore. He was taken on a rough ride and died of his injuries, and then there were protests in response to his death. And the way the media covered it ... I saw it everywhere. The violence “started” when protesters threw rocks, and that was the first time that that pattern leaped out at me, and I was like, “Oh, the violence done by the more powerful entity to the less powerful entity is essentially invisible,” because that’s just-No, the violence started with the riots.The violence is when there’s the disruption to how power’s supposed to work by challenging it. And then once you see that and you get that that’s how it works, right? That the alleged physical assault, screaming, holding a screaming woman’s mouth closed while trying to rip off her clothes while two men jump on her and laugh, that’s not the attack in question. The “attack” in question is what has happened to Brett Kavanaugh and his family, right? And that is framed by the president, and not particularly challenged by a media that reports on him, that then goes with this sort of idea that there’s an angry mob. The women who are yelling at the capital, the women who are so angry that they are protesting, women and men, their yelling is the only power available to them. This man has just been confirmed to the Supreme Court. The only power they have is to hold a sign and to yell through the vote. And so they are powerless in the situation, but they are cast as the aggressive mob, which is the same thing that happened during #MeToo. It was a “witch hunt,” right?Right.The people who were being aggressed upon were the men, who women were-Which they want to dismiss immediately, like, “Can’t we get this over with?”Yes.And the other day I was somewhere, and it was someone very powerful, and they said, “Well, isn’t that enough?” I’m like, “No.”No.Not even close. You couldn’t have better timing for this book, which is ...Worse timing.Worse timing. I know, I hate to say that’s right. Good job! Congratulations.Yay.Yay! Everybody’s pissed. Things are going downward quickly. So, #MeToo. Everyone’s like, it’s been about a year, right, I think, and it continues. The anger continues and everything else, and one of the things I’ve noticed is everybody saying, “Let’s stop being angry now.” And the other day someone was like, “What would you advise people?” I said, “Stay angry. Stay angry. Do not stop.”Absolutely.And they’re like, “Oh, don’t you want to stop being angry?” I’m like, “No.”No.No. No, because it’s not fixed, and it’s the only tool available to get people doing something.Well, the anger propels people into doing all kinds of things. #MeToo is one of the expressions of the anger. Another is the historic number of women, and especially women of color, running for office. You have women whose anger at all of this has prompted them to support some of the women running for office. You have women whose anger has prompted them to join strikes, whether it’s the fast food workers striking for higher wages or against, in the case of McDonald’s workers, in response to pervasive sexual harassment. The teacher strikers of last spring. There are a million ways in which the moment at which you stop looking away from the things that will make you enraged and you start actually permitting yourself to feel the rage drives people to do something about that rage. And I think it’s one of the mechanical, sort of tactical reasons that rage is discouraged in populations that have been offered so much less power historically.“Calm down. Calm down. Let’s talk.”Well, and because, “let’s talk,” but also if you quell the rage, if you discourage women from expressing it by telling them that if they do, they won’t be taken seriously, they’ll sound hysterical, they’ll sound like children, they’ll be threatening is particularly true with regard to how women of color are treated if they express anger. They’re turned into militant threats in the public white imagination. And if you do that and discourage the actual expression of anger, then women wind up isolated and feeling like they’re probably crazy or the only ones who feel that way, but if they express the anger and can make themselves heard with one another, they become audible and visible to one another, and then they can begin to form connections and organize. And that’s when you get campaigns, activism, protest movements, strikes. Right? And that’s been true throughout our history. That was true in the labor movement when a bunch of young women worked in the Lowell textile mills in New England in the 1830s and they founded one of the first labor unions and staged some of the first walkouts that were the beginning of what would become more than a century’s worth of a labor movement that changed workplace safety conditions. So Lowell, another point. There’s Triangle Shirtwaist Factory was another moment of that.Yes, the Atlanta washerwomen strike in 1881, which was primarily black women who were washerwomen in very tortured working conditions, making soap and things in a hot Atlanta, struck.So anger, anger, anger, anger. It doesn’t seem like it matters to a lot of people. Like, here you have #MeToo and people get exhausted. They get just absolutely exhausted by ... You know that feeling, right?Yeah. Yeah. You mean from actually feeling the anger or participating in it?Yes, exactly. Yes, yes. And that, to me, is the stuff Trump does. He exhausts you with his ridiculous statements, and so you were like, “Which one was it?” It’s meant to do that. Right. It’s meant to exhaust, although I would also say I’ve been shocked by how long it’s gone on. I mean, because I do. I see exactly what you’re saying in this sense that being angry all the time can be exhausting, but one of the things I found writing this book and living through this period-Well, I want to know historical. What happens historically when ... What happens to-Often they, people, keep going. Right.And that’s part of what we’re looking at. I mean, we have to remember that these movements, the civil rights movement between 1955 and 1964 and ‘65, which was when you have the Voting Rights [and] the Civil Rights Act, that’s more than a decade. And of course, the activism had extended before 1955, too. Those were the two. Emmett Till’s murder and the Montgomery Bus Boycott. You know, the Abolition and Suffrage Movement, in the 1830s, the Suffrage Movement begins to take root out of women who are involved in the Abolition Movement. Of course, you don’t get abolition until the 1860s, so that’s decades ahead. You don’t get the 19th Amendment, which gave some women the right to vote, until 1920 when it’s ratified, and you don’t get The Civil Rights Act until 45 years after that. This is -Same with gay [rights].Right. The truth is, we feel exhausted after a couple of years. Perhaps those of us who did swallow that in some way, shape, or form, the lie that anger was out of place in the contemporary “fixed” world. But in fact, we look back at generations of people whose anger drove them through their lives. Propelled them, yeah. And in fact, many generations of people who died before they saw any fruits of their energies or labors. But, the fact that they gave their lives to those efforts, in fact, led to the forward motion that we then made the mistake of taking for granted. So how do you look at the current state of affairs around Me, ... I guess #MeToo would be the most prominent, but there’s other gender and equality ... #MeToo is the sexual part, but there’s the gender inequality in pay, there’s -And the political representational inequalities. ... the political representational. And they’re all branches of the same thing. I believe this is all motivated by a lot of the same thing, which is the anger of the underrepresented, the anger of the subjugated. And the tax. I was talking to someone who, we were talking about this and they were like, “And then this happened.” I’m like, “Do you know it’s a tax on you? You’re paying a tax that white men don’t pay.” Like you carry around a backpack full of rocks that you have to carry all the time. And you’re taxed by systems that don’t include you in how they work and how they operate, which is essentially, by the way, again, the complaint of the founders. Taxation without representation, right? Right.And so, the one thing that has to happen, and I think we have to come to grips with it, is that there is tremendous backlash. And by the way, the one thing I want to state is that the anger of women isn’t always progressive. You also have women who are angry in defense of the power structure that’s being challenged here. Oh, yeah. And that’s white women, and that has long been the case throughout our history. And their anger is potent in this moment, too. And those are the voices -And I have to say, they drive me the craziest. Yes, yes. They drive me ... including the fact that my mother is one of them, but you know what I mean? We had such fascinating discussions around Kavanaugh and what saved it was my son, who would not put up with it which was -Really? Yeah. It was great. Did your mother change her mind at all? You know, it was interesting. I think I’ve told this story. My mom was watching Kavanaugh and said, “Oh, he looks good. I think he’s good. I don’t believe her. And he’s truthful.” Or something, just something happened and ... She’s not a Trump supporter by any stretch, but she is now, obviously. And [she] said, “I don’t believe that could happen.” And my son literally said, “Last weekend I pulled two boys off of girls who were drunk.” And that’s his job. I’ve given him that job. Yeah, I’ve instructed him this is his job at parties and stuff like that. And she was like, “What?” And he goes, “It happens all the time. Like, all the time. And they don’t remember it, because they were drunk.” Or something like that. And then her next move was, “Well, the girl shouldn’t have been drunk. The girls shouldn’t have been drunk.” And my son said, “You know when you’re drunk, it doesn’t mean you want to have sex, just so you know.” And my mom was ... There was nowhere for her to go, and it was great. I was like literally, parenting finished, done. That kind of thing. But it took him to change her mind, not me saying, “Are you crazy? You’ve been sexually bothered.” And, “Oh yes, I have, but... “ I think her thing was, “Yeah I have, but I dealt with it.” “Dealing with it” is one of the things that-“I’ve overcome it.”Right. “Why are you complaining?” Women who’ve existed within the system made their peace with it and in fact benefited from being attached to those who’ve had power within that system are motivated in a lot of ways-Or think they deserve it.Or think that they deserve it. And the whiteness comes into this because white women benefit from white supremacy, both themselves individually, and that cuts them off from the experiences of and alliances with women who do not benefit from white supremacy, women who are not white. This is a major dynamic going forward. And as the anger, the progressive coalition, driven in part by the anger of women, some of whom have been angry their whole lives and some of who are newly angry, is going to be met with what was already in place, which was the punitive anger of a power structure challenge. That’s the Donald Trump campaign. That’s birtherism. That’s the call to open racism, misogyny, xenophobia. That is the wall, the, “Mexicans are rapists,” the calls to hurt journalists that we’re seeing borne out in the fact that bombs are being sent, that violence is being done. That’s not new. This is what mass shooters have been operating from some of this violence for a long time. If you look at the overlap, it’s anger at women who won’t date them, anger at women who won’t fold their clothes or ... That has already been, for a long time, the motivation of so much violence in this country, this fury at the disruptions in power that mean that certain kinds of people who historically have felt that they have a certain entitlement to power no longer feel like they have that same...I think the waking up of that group of people. Essentially you have to have had things done upon you to understand it, right? Now I’m a white woman, but I’m a gay woman. I remember that. I went through the period when it was very dangerous, and so I have some sense of not getting, you know what I mean? And then as you move down the stack, or up the stack as far as I’m concerned, you have more and more of that so you understand it. But as you move up you don’t even ... You’ve never been acted upon.Well, it’s how the sense that being acted upon could mean somebody questioning your appointment to the Supreme Court as somehow a form of violent aggression, especially compared to the context to the act of having been held down at a party and had your clothes ripped off, a hand put over your mouth and felt like you were going to be killed. And the idea that for some people in power, that former thing, that again the injustice of having a massive promotion in power, the further accrual of power halted or questioned could be viewed as a kind of mob act of aggression. It isn’t end to the, “Me Too,” but that’s the rear guard action, right, against it?Yeah. And it will be a forever clash, right? And in terms of ... I don’t see any of this ending in our lifetimes. I don’t think it should. This has been centuries behind us, and it’s centuries ahead of us, and the aberration and the error was in not being mad all the time, being somehow convinced that we didn’t have anything to be mad about. And of course once again, that’s an affliction and a conviction that was held only by those who had the power and the insulation to trick themselves into thinking there wasn’t anything to be mad about. And the thing that we have to come to grips with now, and I find this especially as there has been talk lead up to the midterms and the midterms ... Whatever happens in the midterms, whatever happens in 2020, this is not fixed with an election. This is an ongoing process.Right. We try and use those things in the same way.Right! They’re crucial, they’re absolutely crucial, and I don’t want to take away from that. Just like the removal of extremely bad and violent men from positions of enormous power, that’s a crucial step, is not having Harvey Weinstein in a position to rape women-Or Les Moonves.Or Les Moonves, not only to rape women but to shape our culture. But it is a trick to suggest, and this is part of the easy part. In so many ways it’s so much easier to think of this as a story about individual bad people, and individual politicians, and if we could just get rid of Donald Trump or just get rid of Harvey Weinstein or Les Moonves, we’ll solve the problem, when the real project ahead of us is remaking the entire system. And that is a project that will extend well beyond our lifetimes, but to which we must all commit.Are you hopeful when you say this?In the very long term, I’m very hopeful. Well, if our planet doesn’t burn. That’s really the place where the hope hits a snag because we have a limited ... Something that has not been truer that we hadn’t known was true in earlier periods during which people died in inversions, iterations, of this fight. We have a timer on us right now that I think ... That’s where I can say that in the long term I’m extremely hopeful, but I’m talking the long term, you know, a century-long term. The short term, it’s going to be really horrible, and people are going to lose and suffer and die and go to jail. This is our short term future, and I think we need to wrap our heads around it. And then this other factor, which is, can we rest enough control to try to stave off our natural destruction or unnatural, man-made destruction?Right. And do you ... Alright, we’re bringing climate change into this-Well, it’s there when I say do I have long-term hope? Yes, theoretically, if we survive.Let’s finish up talking about what has to change, leaving aside climate change, I get that.Mm-hmm. Right, okay.Let’s just leave that a sec for a moment. What has to change in the system right now, besides removing people from power that are the obvious abusers?It’s fascinating because I was talking to someone, and they were talking about a well-known person who’s gotten whacked and lost their power, and they were like, “Did they really have to lose everything?” And I said, “Yes, they do. They really do.” And they were like, “Can’t they come back?” And I said, “No, they can’t.” And they were like, “Well ...” And I’m like, “No, they can’t. They do not get in.” What was interesting about one of these people, they were getting into something that I had some influence over. I didn’t, I was able to call the people who had influence. And they were trying to get into something, and I called them and said, “If you do this I’m going to make sure they know that they know that you let this happen.” And I threatened them. I literally threatened powerful people. And I said, “I will make your life a living hell.” And they were like, “Kara,” and I’m like, “No. I’m just warning you. If you don’t do something about it, and if you allow this to happen ...” It was really interesting. It was a really interesting thing that, I never had done that, which was interesting.That was Interesting. You were mad.I was mad. So, what do people do now with all this ... I don’t think that anger is not focused, but if feels a little-It goes in lots of different directions depending on what brought you into it and what you’ve learned since you’ve gotten here. There are so many projects ahead of us. One of them is about, it’s not just removing the individual bad guys, it’s about rethinking who has power within institutions and what kinds of policies are in place that protect certain kinds of people and protect their power and add to it. So, it’s about truly things that can seem unrelated, but like paid leave programs, subsidized daycare, the stuff that happens in an electoral or policy realm that determine, that contribute to-That’s the tax.Who has what kinds of opportunities within the public sphere. Yeah you can’t do as well because you have to go home to kids.To that end, it’s a representational question within politics, and that means not just women, because we know that there women and people of color who legislate on a conservative side, too. But there also is a fundamental representational change that needs to happen. This country is governed by more than 75% white men.Oh, I thought that was just Silicon Valley.Yeah, I know. It’s actually, remarkably consistent.I have this friend, this VC who’s conservative, he drives me up a wall and back down it again. But he said, “Kara, what about people who talk about women’s rights and then take money from Saudi Arabia? Why do I have to listen to them? What about people who say, ‘Black Lives Matter,’ and then they have no diversity?” And I had to say, he had a point.No, it’s a point. That’s the point, is like we can have the individual instances of fury, but we have to engage policy. And these are things like raising wages, federal jobs guarantees, UBI, stuff that seems unthinkable right now because we’re in this moment of incredible right-wing contraction. But this is the stuff that’s on the table, or should be on the table, especially as the Democratic Party moves left, which I hope that it is doing. And it seems to be doing from the ground up with local and statewide candidates actually moving the body of the party, because a lot of this is about changing individuals, but it’s about changing rules and laws and the system that gives people power. And so there a million different directions when you’re talking about criminal justice reform, reinstating voting rights for felons, or all this kind of remaking. And the thing is, we have to think about these things in the very moment that the court, and it’s not an accident that this is happening at the same moment, that the court is now with Brett Kavanaugh on it and this was always what was on the table when we elected Donald Trump and not Hillary Clinton, that the court will now have the power to depress the ability to make these kinds of changes, to further gut things like affirmative action, collective bargaining rights, reproductive rights, perhaps access to contraception itself, voting rights. They’ve already gutted the voting rights act, and that’s enabling this voter suppression all around the country. We’re in a fight where the top powers are in a position to strangle the ability to resist, and insist on not just a reinstatement of the rights that were there, but an expansion of the kind of safety nets and policies...So that they don’t come and get them next time.Right. And it’s because we’re on this cusp, where there is I think, has been building, a kind of understanding that we do have to remake the very fabric, the economic and political and representational structures on which this country is built. That is why we’re in this moment where the top power [is] in its kind of death throes. But just because it’s death throes shouldn’t be comforting because they have the ability to enforce our inability to enact the changes that I think increasing numbers of people know we need to make.Let me ask you. I’ve got to finish up, but are you hopeful?Yes. I have to be hopeful because if you’re not hopeful then you’re not going to fight, and there is nothing for us to do but fight.Right. And if you had to say what people could do right now, besides read your book, what do you imagine? Stay angry?Stay angry. Don’t stop looking at the inequities of the world. Form networks. The most important thing, because everybody’s driven in different ways, right? Maybe it’s making changes within your own workplace, maybe it’s running for office, maybe it’s supporting candidates, maybe it’s striking, maybe it’s going to protest. And you have all these forms of anger driving you into civic engagement, getting an education about the history of social change in this country, which most of us, like we never had-We have no historical memory.Getting that education, I think, is absolutely key. Go to the library. Go read the people who are writing about the history of this, because you’ll find so much that is resonant and that will help guide you forward. Labor movements, civil rights movements, all of it. So, everybody is going to be going in a different direction depending on their talents, their impulses, whatever. But I would say that a universal thing to do is find other people who share your anger, because it’s the formation of networks and potential coalitions... And those coalitions are complicated. We repeat the inequities. We repeat the racial and class and gendered inequities. Every social movement in this country’s history has been riddled with sexism, racism, homophobia, transphobia. So, within those coalitions we also have to listen to the anger of the people we’re trying to form alliances with, and take it in, and really hear it as instructive, including if some of it is at us. But form those coalitions and those networks because this is going to be a lifelong project, a lifelong struggle. And here’s the solution to exhaustion, is you become part of a group and a network where when you need to take care of yourself, you can and know that you are connected to people who are doing the work and then you tell those people when they need to take a break and take care of themselves. That’s the solution. The exhaustion comes when we’re on our own and feeling alone and driven into this fury, and then there’s no-one to rely on for support or help.Yeah, absolutely, which women do very well.So, form networks, listen to other people, be curious about what they’re angry about, and then try and work with the people who you share common goals and frustrations with.Mm-hmm. I had this encounter on a plane the other day. I was reading the New York Times. I had a story in it and this women in the print publication, this women sitting next to us, flying to the midwest, she said, “Ugh, fake news.” I was reading the New York Times. “Those Hondurans, they’re coming in a caravan.” I turned to her and I said, “When in your life did Honduran immigrants ever hurt you? I’m just curious. Just when did an immigrant ever bother you?” “Well, never.” And I said, “So why are you frightened of them?” And we had this fascinating conversation. It was really interesting. What I was trying to do was not necessarily get to compromise, but common ground, not compromise because I didn’t back off. I’m like, “You’re terrified and scared of something you shouldn’t be terrified and scared of, and it’s sad that you’re being manipulated.” I was super in her face about that, and it was a really fascinating discussion because we got to commonality. And I was like, “You can’t name one time you’ve ever been under siege by an immigrant.” And it was really interesting. It was really interesting, and I found it a fascinating thing.Did she react with anger?Initially, and then not. Yes, but that was okay. But I didn’t back down. I thought about it. I was thinking should I continue the anger, and did.I would say conversations, communication is key, which is not the same thing as saying, “Go rage everywhere,” because there are real costs and censure and punishment inflicted on people who show rage in certain contexts, especially women and especially women of color. But listen for other people’s rage, and talk to them.Yeah. I have lots of relatives, “I’m not a racist.” I’m like, “No, you are.” That’s what I do. They’re like, “I’m not a racist.” And I’m like, “No, you are. You’re not getting off on this one.” It’s a really interesting time. But it’s always been here, as you said. Anyway, I urge everyone to read Rebecca’s fantastic book that she has written about rage. I don’t want to use the word rage, right? I don’t want to ... Anger.You can use the word rage. Anger.Yes. Anyway, her book is called, “Good and Mad: The Revolutionary Power of Women’s Anger.” It is revolutionary. It will be. We’ll see-We’ll see.How it ends, how the story ends. Well, we’re going to burn up apparently.We’re not going to see how the story ends, because it won’t extend long-We’ll burn up.-After we’re gone.How sad, Rebecca. Anyway, it was great talking to you. I’m one of your biggest fans. Thanks for coming on the show.Thank you so much, Kara. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}