{"id": "Brandless wants to create the next great consumer packaged goods brand — but it hasn’t built customer loyalty yet", "paragraph": "When Brandless launched in the summer of 2017, it aimed to disrupt the $760 billion U.S. consumer packaged goods industry by offering low-cost, high-quality home products and non-perishable foods.So far, that disruption hasn’t been felt by major CPG retailers.The startup now sells more than 350 “better-for-you” products, ranging from non-GMO gummy candy to stainless-steel can openers, most priced at $3. They are banking on millennial buyers who want more transparency in their products and who believe in Brandless’ mission, which it advertises as “deeply rooted in quality, transparency, and community-driven values.”This summer, the company received $240 million in funding from SoftBank’s Vision Fund, which valued the company at over $500 million. For a consumer-focused company as young as Brandless, that’s an incredibly rare and large investment (and why we’re paying attention to a fledging e-commerce brand). It’s also risky, since Brandless has entered a highly competitive space with little room for error. On the competition front, Amazon continues to expand its Amazon Basics line of products — which total more than 1,000 today —and Walmart’s Jet has its own brand called Uniquely J. Just this month, Target announced 70 items under its own label, Smartly, which cost just $2 each — undercutting Brandless’ $3 price point.Thus far, Brandless doesn’t have a notable market share in any of its product categories. Perhaps more importantly, people who do buy from Brandless don’t seem to be purchasing from them again at the same rate as some of its competitors, according to data from two third-party sources.Of customers who bought from Brandless for the first time in the final quarter of 2017, 20 percent made another purchase in the following quarter and just 13 percent bought something three quarters later. That’s according to new data from Edison Trends, which tracks email receipts for three million U.S. consumers.  For the following charts we looked at data for new Brandless customers in Q3 and Q4 of 2017 so we could view several subsequent quarters of data. People who’ve made their first purchases in more recent quarters had levels of retention similar to these. That puts Brandless in line with Walmart.com and Target.com, which might seem like good company, but those retailers still do the vast majority of their sales in brick-and-mortar stores. That makes their online retention rates not quite as critical to current success, though they’d certainly prefer higher retention rates as well.But Brandless’ retention rates fall far below those of Amazon, Instacart or even Thrive Market, another young better-for-you e-commerce retailer that specializes in discounted natural and organic goods.Brandless, a private company, would not provide any data but said their internal numbers paint a better picture.Edison’s retention levels, however, were consistent with data from Second Measure, a firm that analyzes billions of dollars worth of anonymized debit and credit card purchases. Second Measure found that only 11 percent of new Brandless customers in Q3 2017 were still making purchases a year later. Last quarter, Brandless customers made an average of 1.34 transactions.Retention matters especially for companies like Brandless because it trades in inexpensive goods that need to be repurchased frequently. Low customer retention means customers aren’t coming back.“They are new and building awareness and therefore focused on customer acquisition, so their [retention] number won’t be anywhere near a mass merchant’s,” said Sucharita Kodali, VP and principal analyst at Forrester Research.This problem, of course, is not unique to Brandless. “Across most commerce sites, overwhelmingly purchases are one-time,” according to Jason Goldberg, SVP of commerce at digital marketing agency SapientRazorfish. “Every time I have a new client the problem is, how do we move from one purchase to two? How do we develop a habit around buying that product?” Brandless’ limited offerings, however, hinder it in that department. A person shopping on Amazon or Walmart.com or Target.com might buy kitchenware one month and a TV the next. Big-box stores carry about 100,000 products while Amazon sells hundreds of millions. It’s difficult to compete in scale. “If you only have one kind of thing, it’s less attractive for everyday use or every quarter use,” said Noble Kuriakose, VP of data at Edison.And versions of Brandless’ products, while inexpensive and purportedly of better quality, can be found at all its competitors. The company also doesn’t sell fresh-food products, which are more difficult to store and transport but need to be purchased more frequently.Brandless finds itself in the uncomfortable middle ground of not being niche enough and not being broad enough — yet. It is, however, trying distinguish itself with wholesome ingredients and progressive politics.“The key for Brandless will be whether they’ll be able to stay true to their purpose over time as they extend their product assortment and deliver more comprehensive offerings,” said PwC Consumer Markets Leader Steve Barr. Currently, online shoppers are also spending less on Brandless goods than at its competitors. The average Brandless order size was $34 last quarter, according to Edison. That’s below its peers and even below its own free-shipping minimum of $39 for non-members.Small shopping carts wouldn’t matter as much if customers were coming back frequently. But they’re not.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}