{"id": "Recode Daily: Big Blue is buying Red Hat for $34 billion in IBM’s biggest deal ever", "paragraph": "Earnings this week: Apple reports quarterly earnings on Thursday, after Tuesday’s product announcement event in Brooklyn, where it is expected unveil new iPads and Mac computers. Reporting on Tuesday: Facebook, eBay and Baidu; Wednesday: General Motors, Fitbit, Sprint; Thursday: Spotify, New York Times; Friday: Alibaba.[Want to get the Recode Daily in your inbox? Subscribe here.]  IBM is making the third-largest U.S. tech acquisition ever, shelling out $34 billion in cash to buy Red Hat, the largest distributor of the popular open-source operating system Linux. The purchase, IBM’s biggest deal to date, is the latest competitive step among large business-software companies seeking an edge in the fast-growing market for cloud computing; Microsoft acquired code-sharing platform GitHub in June for $7.5 billion. Despite its pre-Web 1.0 dominance, IBM has struggled for relevance in this age, and has seen its share price fall by 30 percent over the last five years. [Theodore Schleifer / Recode]Epic Games, maker of global video game sensation Fortnite, has raised $1.25 billion in a new investment round, valuing the company at almost $15 billion. Fortnite has generated hundreds of millions in sales for Epic, including nearly $300 million in in-game revenue in April alone. The investment comes with risks, foremost among them: How much longer Fortnite will remain a phenomenon. Its popularity on the video game streaming service Twitch appears to have peaked in July, at 151 million hours of streaming. [Sarah E. Needleman and Katie Roof / The Wall Street Journal]After Saturday’s mass shooting that killed 11 at a Pittsburgh synagogue, the extremist-friendly social media site Gab has been suspended by PayPal, Stripe and its hosting provider, Joyent. Almost immediately after the shooter’s identity was revealed by media outlets, screenshots of his profile on Gab appeared, revealing a slew of anti-Semitic rants. PayPal is the latest major platform to eject Gab: Apple refused to host the site’s app in its iOS store; Google removed the app from its Google Play Store for violating its hate speech policy. Some thoughts on why toxic online behavior is spilling into the streets. [Andrew Liptak / The Verge]AT&T is shutting down FilmStruck, its two-year-old streaming video service for indie, arthouse and classic films. The move appeared to be the latest effort by WarnerMedia, under AT&T’s ownership, to streamline operations by cutting niche-oriented business ventures. FilmStruck, established by classic-movie cable channel TCM, draws the core of its offerings from the Criterion cornucopia of DVD and Blu-ray releases of world cinema, as well as related movies that are yet unreleased on disk. Meanwhile, Conde Nast is shutting down its Vogue, Wired and GQ channels on Snapchat, and letting go of the employees who were brought in to produce them. [Todd Spangler / Variety]Why Silicon Valley can’t escape the business of war: Many working in the tech industry don’t want to be part of the military-industrial complex, as evidenced by employee protests at Google and Microsoft over Pentagon contracts. But the military-industrial complex has long been part of Silicon Valley’s DNA: Defense contracts during and after World War II turned the region from a somnolent landscape of fruit orchards into a hub of electronics production and innovations ranging from mainframes to microprocessors to the internet.[Margaret O’Hara / The New York Times]Hillary Clinton is pretty critical of Facebook, including its executives. Unlike Mark Zuckerberg, “I’m not hiding anybody’s data,” she joked in a live taping of the Recode Decode podcast. [Theodore Schleifer]Full Q&A: Former Secretary of State Hillary Clinton on Recode Decode. Clinton discusses the 2018 midterms, Monica Lewinsky, U.S.-Saudi relations, social media regulation, artificial intelligence and more with Recode’s Kara Swisher. [Kara Swisher]There are problems with Snapchat’s plan to jump-start growth. The biggest one: Everyone already has a messaging app. [Kurt Wagner]Here’s why tech billionaires are fighting over San Francisco’s Prop C ballot measure. Leaders in the tech community are being pulled into a debate about their corporate responsibility in San Francisco and beyond. [Shirin Ghaffary]Amazon’s booming ad business is both a blessing and a risk. The business’ strong profit margins are alluring. But the downside is real. [Jason Del Rey]Facebook found and removed another ‘politically charged’ disinformation campaign, this one from Iran. The U.S. midterms are almost a week away. [Kurt Wagner]Why Airbnb will be worth more than Uber. Kara Swisher and Scott Galloway discuss Uber’s IPO, Apple CEO Tim Cook’s comments on privacy and more on the latest episode of Pivot. [Kara Swisher and Scott Galloway]Meditation in the time of disruption.Slow radio.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}