{"id": "Is Facebook still growing?", "paragraph": "Facebook’s last earnings report was a total disaster. After months of bad news, Facebook unveiled its second quarter earnings back in July and reported less revenue than Wall Street analysts expected — and more importantly, fewer new users. In fact, Facebook didn’t grow at all in its most valuable markets, the U.S., Canada and Europe. It actually shrunk. After years of tremendous user growth — Facebook has more than 2.2 billion users globally, and owns three other apps with more than one billion — Facebook had suddenly hit a wall.Was last quarter a blip? Or is Facebook as big as it’s going to get? We’ll find out Tuesday afternoon when the company reports Q3 earnings. User growth will be the key metric to look for. The reality is that Facebook may be shrinking in certain markets, but its user base is still growing overall. Despite all the concern last quarter — Facebook stock fell more than 20 percent after its last earnings call, and still hasn’t recovered — Facebook still added 22 million new daily users last quarter. That’s not a lot for Facebook, but it’s still 22 million people. Snapchat, for comparison, lost two million daily users last quarter with a much smaller audience. Twitter’s daily audience is growing, but the company hasn’t added meaningfully to its monthly user base in years. So, yes, Facebook is still technically growing. The problem is that all of those new Facebook users came from markets where the company makes little to no money from them. Each Facebook user in the U.S. or Canada generated almost $26 in revenue for the company last quarter; each user in “Asia-Pacific” generated just $2.62. Those in other parts of the world, like South America or Africa, brought in $1.91.If Facebook is adding fewer users than usual, and those users are coming from areas where the company makes less revenue per user, it’s not hard to understand why investors are worried. Tuesday will offer Facebook executives a chance to explain why this is happening — and what the plan is to rectify it. The good news is that Facebook has a lot of potential revenue streams outside of its core Facebook app. Instagram has more than one billion users, and some outside the company estimate that Instagram will do $8 billion in revenue this year alone. Messaging may have the most potential. Facebook’s Messenger service has 1.4 billion users, and just started selling ads, and Facebook-owned WhatsApp, with 1.5 billion users, does virtually no business at all. The problem is that no one, Facebook included, has discovered a great way to turn private messaging into a big business. If someone does, Facebook will be in a great spot to capitalize. But until that happens, Facebook user growth still matters. It matters a lot. And soon we’ll find out if Facebook has another disaster on its hands. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}