{"id": "Recode Daily: The Khashoggi crisis exposed an online intimidation campaign ordered by the Saudi Crown Prince", "paragraph": "The apparent murder of Saudi journalist Jamal Khashoggi has exposed details of a broad online intimidation campaign ordered by Crown Prince Mohammad bin Salman to silence critics of his Saudi Arabian kingdom. Hundreds of people work at a so-called troll farm in Riyadh to smother the voices of dissidents like Khashoggi; the push also appears to include the grooming of a Saudi employee at Twitter whom Western intelligence officials suspected of spying on user accounts to help the Saudi leadership. Many Saudis had hoped that Twitter would democratize discourse by giving everyday citizens a voice, but Saudi Arabia has instead become an illustration of how authoritarian governments can manipulate social media to silence or drown out critical voices while spreading their own version of reality.[Katie Benner, Mark Mazzetti, Ben Hubbard and Mike Isaac / The New York Times][Want to get the Recode Daily in your inbox? Subscribe here.]  Recent news events spurred investor Fred Wilson to share some thoughts with his peers in the startup and VC sector: It’s time, he says, “to do a deep dive on our investor base and ask the question … Who are our investors and can we be proud of them? And do we want to work for them?” Wilson notes that the startup and venture community is coming to grips with a flood of money from bad actors that has found its way into the sector over the last decade — and not just money from rulers who turn out to be cold-blooded killers. In her op-ed for the New York Times, Recode Editor at Large Kara Swisher considers the complex ethical problems the tech industry faces and wonders if the solution is for companies to hire a chief ethics officer. [Fred Wilson / AVC]Facebook has filled one of its most important executive roles with a rare outside hire: Nick Clegg, the former deputy prime minister in the U.K. under David Cameron, is joining Facebook to lead all communications and global policy. Clegg’s experience in British and European politics will be key, given that the European Union seems much more interested in and capable of regulating Facebook than U.S. politicians; hiring a former British politician is also a sign that Facebook sees potential European regulation as a major concern moving forward. [Kurt Wagner / Recode]Republicans are finding a way to work around Facebook with their own apps. Developed by a Washington, D.C.-based startup called uCampaign, apps like Cruz Crew, N.R.A. and Great America are effectively private social media platforms that offer conservatives safe spaces free from the content guidelines of the big platforms. Amid a chorus of conservative complaints that Facebook and YouTube have become hostile to right-leaning views — and as those social media giants take steps to limit what they see as abusive or misleading viral content — a few Republican consultants have begun building a parallel digital universe where their political clients set the rules. [Natasha Singer and Nicholas Confessore / The New York Times]Will tech leave Detroit in the dust? As IPO proposals value Uber at an eye-popping $120 billion, traditional automakers are racing to gain ground on everything from car sharing to driverless technology, reimagining themselves as nimbler software-as-a-service companies. Toyota, for instance, says it’s evolving into an entirely different company, one that focuses more on services that move people around. Auto executives say they need to avoid the nightmare tech scenario of becoming the next “handset makers” — commodity suppliers of hardware, helplessly watching all the profits flow to software makers like Apple and Alphabet. [Mike Colias, Tim Higgins and William Boston / The Wall Street Journal]Here’s the story of the city that had too much money: Vancouver was the first major Western city to experience the tidal wave of Chinese cash — and its unforeseen aftermath. Now the Canadian city is leading efforts to stop it. [Matthew Campbell and Natalie Obiko Pearson / Bloomberg Businessweek]ELON WATCH: “The first tunnel is almost done” TRUMP WATCH: “Facebook has just stated that they are setting up a system to ‘purge’ themselves of Fake News. Does that mean CNN will finally be put out of business?”Why no one really knows how many jobs automation will replace.Even the experts disagree about exactly how much tech like AI will change our workforce.[Shirin Ghaffary]Full Q&A: ‘Will & Grace’ co-star Sean Hayes on Recode Decode.Hayes spoke to Recode’s Kara Swisher at a live event in Los Angeles last week. [Kara Swisher]Peter Thiel cut his largest check to the GOP since Trump’s 2016 win.Thiel is giving $1 million to the Club for Growth, a hardline conservative advocacy group.[Theodore Schleifer]Resy is winning newer, cooler restaurants away from OpenTable.The upstart is taking share. Can it build from there? [Sayer Devlin]23andMe CEO Anne Wojcicki says “one of our biggest competitors” is fake science on sites like Goop.On the latest episode of Recode Decode, Wojcicki says of Gwyneth Paltrow: “Some of the things that she promotes don’t actually have the scientific validity that my team would be able to stand behind.” [Kara Swisher]Making the sound of “Shark Week,” “Puppy Bowl” — and “Housewives.”Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}