{"id": "The San Francisco air quality is so bad that Uber drivers are selling masks out of their cars", "paragraph": "California’s devastating wildfires are causing unhealthy air conditions for locals breathing in harmful fumes — and a good sales opportunity for some Uber drivers.In San Francisco, which currently has the second-worst-rated air quality out of any city in the world, one driver was spotted selling N95 respirator masks for $5 apiece. That’s significantly above market rate. Right now you can buy a 10-pack of similar masks for about $13 Amazon. But considering the masks are sold out at many local stores, riders may be willing to dish out the cash for immediate access to the protective gear.Here’s a picture of the offer, posted to the back of the Uber’s passenger’s seat.This isn’t the first time drivers for ride-sharing apps have sold products out of their cars. Uber even facilitates it in some cities.But unlike the selling of candy or iPhone chargers, some could argue there’s a sinister aspect to profiting from the chaos of environmental catastrophe — a case of what author Naomi Klein famously termed disaster capitalism. Others would say it’s a smart example of entrepreneurism by people just trying to make a living — especially considering that half of Uber drivers in the U.S. make less than $10 an hour after expenses, according to a recent study. It’s worth noting that some Uber drivers have been spotted giving away masks for free.The fires that have ravaged California have been the worst in the history of the state. In the aftermath of the blazes, 66 people have died, at least 600 have gone missing and thousands have lost their homes. In San Francisco and many surrounding cities, public schools were closed on Friday due to the smoke hazard. Air quality levels throughout the Bay Area are in the “unhealthy” range of 151 to 200 on the U.S. Environmental Protection Agency’s Air Quality Index, meaning that prolonged exposure can be harmful even to healthy people. In Northern California, the fires are only 40 percent contained, and relief from the dangerous smoke could be as many as several days away.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.One senator says the company \"actually encouraged anti-Semitism\" by hiring an opposition-research firm.A Verge affiliate site"}