{"id": "As big tech struggles to curb hate speech, civil rights groups have some recommendations", "paragraph": "Twitter, Facebook and YouTube have struggled to police hate speech on their networks for years. Now a group of civil rights and advocacy groups are weighing in with advice on how big tech services can better identify and remove hateful activity.In a new report, six organizations — including Center for American Progress, Color of Change and Southern Poverty Law Center — have drafted a series of policy recommendations, such as:The goal, of course, is to reduce the volume of hate content, but also make sure companies are more transparent around their efforts and success. “This is the first time we’ve formally put pen to paper, saying ‘this is kind of world we’d like to see’,” says Heidi Beirich, a spokesperson for Southern Poverty Law Center, which contributed to the report.These groups don’t have any jurisdiction over the companies, but they are respected groups, and these seem like mostly solid recommendations. It’s worth noting that Google, Twitter and Facebook already do some of these things or include them in their terms of service. But it’s also worth noting that they are still far from maintaining hate-free communities.The report’s authors met with representatives from those companies two weeks ago to share an early copy of their recommendations and solicit feedback. Google declined to comment on the report, and the other two companies did not immediately respond to a request for comment.The coalition’s plan is to create a follow-up report next year that will assess tech companies’ performance against these recommendations.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}