{"id": "Google’s giant employee walkouts are one of the strongest showings of tech worker activism yet", "paragraph": "“Hey hey, ho ho, tech harassment has got to go!” That was the chant of thousands of Google employees who gathered outside the tech giant’s Mountain View headquarters on Thursday to share their anger over how the company has handled issues of workplace harassment.After a bombshell New York Times story came out last week, revealing management’s protection of high-ranking employees accused of sexual misconduct — including giving a $90 million payout to Android creator Andy Rubin — Google’s rank and file are demanding a number of systemic changes to prevent further employee assault and harassment. The walkouts occurred at dozens of Google’s offices around the world today, according to organizers, in one of the largest public showings of tech worker activism to date. Organizers presented Google with a list of five demands, mostly around improving the current process for reporting and disclosing incidents of sexual harassment and discrimination, including ending forced arbitration in such cases. Employees also asked for a chief diversity officer to be promoted to report directly to CEO Sundar Pichai and the addition of an employee representative to the company’s board of directors.The protest comes at a time of growing frustration — not just with Google, but with unchecked sexual harassment and discrimination in the workplace on a national level, employees say. “I feel like I’m leading young boys and girls to slaughter — why would you want to go into tech if it’s like this?” said one Googler in Mountain View who works on an Android app that aims to get children interested in tech. In the walkouts at Google offices around the world, employees shared personal examples of sexual harassment they’ve faced at Google, and what they felt were inadequate responses. One woman who spoke onstage at the main campus said a fellow colleague attempted to sexually assault her at a company offsite, after allegedly tampering with her drink. She said that after she reported the incident, she was told by the human resources department to keep quiet and continue working with the accused teammate.  “For every story in the New York Times, there are thousands more, at every level of the company. Most have not been told,” wrote the walkout’s organizers in a written statement. “Reassuring PR won’t cut it: We need transparency, accountability, and structural change.”Google CEO Pichai — whose initial response to the Times article was criticized by many employees as not being strong enough — has supported the protests in a memo to employees and in statements to the press. In a conversation with the New York Times Dealbook today, Pichai agreed to one of the protesters’ demands to increase transparency around sexual assault. The company declined to say if it would be meeting any of the other specific demands.“Employees have raised constructive ideas for how we can improve our policies and our processes going forward. We are taking in all their feedback so we can turn these ideas into action,” Pichai wrote in an emailed statement to Recode. Organizing efforts first started when an employee, unsatisfied with management’s initial response to the Times report in an all-hands meeting last week, posted an idea for the walkout on an internal employee message board. The post quickly went viral within the company, with hundreds of employees joining in the discussion.“The complete and utter failure of leadership not just at Google but across the whole country is why workers are so fed up and taking action,” one Google employee, who asked to remain anonymous, told Recode. “It’s thrilling and so inspiring, and it proves that we have strength and power when we come together.”The Google protest demonstrates how tech workers — historically a relatively disorganized labor group — are banding together to make demands of how big tech companies should more ethically operate their businesses. Earlier this year, Google declined to renew its contract with the Pentagon to build military AI after receiving strong backlash from its own engineers. Project Dragonfly, another controversial initiative to build a censored form of Google search in China, was also met with criticism — in August more than 1,000 employees signed a letter calling for greater transparency about the project.If Google enacts the protesters’ demands, specifically eliminating forced arbitration for harassment and discrimination cases, it could set a precedent for other major companies to do the same — allowing greater transparency around incidents of workplace harassment and assault. Uber already gave in to mounting political pressure to allow riders, drivers and employees to take such matters to court.Last week, GoogleX director Rich DeVaul resigned — he had been accused of sexual harassment by a young female Google interviewee in the Times article — reportedly without a severance package. “Just the threat of us walking out was enough for the company to remove DeVaul from the payroll,” another employee said. “That proves we have power.” Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}