{"id": "Snap’s former No. 2 exec Imran Khan is building an online shopping startup", "paragraph": "Imran Khan, who spent the past four years as the top business executive at Snapchat’s parent company, Snap, plans to launch a new startup in the e-commerce industry next year. Still in stealth and funded primarily by Khan, the startup will be a new online commerce platform for brands to sell their goods, similar — at least in high-level concept — to more established players like Amazon or Jet.com, according to a source familiar with the plans. Unlike those platforms, Khan’s new startup will likely be more focused or specialized on particular product categories. Khan, who is founder and CEO of the new venture, has a small team of a half-dozen employees working on the project, and just hired Dollar Shave Club’s VP of Engineering Jason Bosco to run engineering. Khan declined to comment on the record about his new project when contacted by Recode over the weekend. Khan was the chief strategy officer at Snap for almost four years before announcing his departure in September. It was a role that included overseeing all of Snap’s business efforts, including advertising, which is responsible for the vast majority of Snap revenue. The knock on Khan from those in the industry was always that, as a former banker, he didn’t have experience running an advertising business, though Snap should do more than $1 billion in advertising revenue for the first time in 2018. He also ushered Snap through its IPO in early 2017 and served as second-in-command to CEO Evan Spiegel. The next challenge will be interesting for Khan, who has never started a company before. It was believed he might get into venture investing, though he plans to run this new commerce business full time, according to a source. He spent a decade in the banking industry with JPMorgan and Credit Suisse before getting some startup experience with Snap starting in early 2015, a few years ahead of its IPO. Snap has run a few commerce-related tests and experiments, but commerce is not yet a significant part of its business. To be sure, Khan is entering a crowded industry with a lot of competition. Amazon is arguably the most dominant company in the world. Then there’s eBay, Walmart and Wish, a startup worth $8 billion that already does billions in annual gross sales. Some up-and-comers have found financial success, including Jet.com, which sold to Walmart for $3 billion, and online pet retailer Chewy, which sold to PetSmart for $3.3 billion. Those outcomes, however, are the exception rather than the norm.Khan’s LinkedIn page shows that he recently founded a company called Proem Group, but that is the name of a trust Khan started. The commerce startup, which hasn’t been named, will be part of the trust, according to this source. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}