{"id": "Recode Daily: Amazon’s HQ2 — a grail for two cities", "paragraph": "Amazon has finally announced the location(s) of its new headquarters: Northern Virginia — in the newly defined neighborhood of “National Landing” — outside of Washington, D.C., and Long Island City, Queens, situated across the East River from Manhattan. These choices were not inspiring choices but data-based ones; the embodiment of Amazon’s emotionless practicality. Here’s what Amazon HQ2 employees will face in Long Island City when it comes to transportation, housing and … sewage. And here’s how the two “winning” locations compare to Amazon’s original hometown of Seattle and the country at large. [Jason Del Rey / Recode]Facebook will allow a team of French regulators to “embed” inside the company to examine how it combats online hate speech — the first time the wary tech giant has opened its doors in such a way. Speaking at the Paris Peace Forum, French President Emmanuel Macron said that the trial project is an example of what he has called “smart regulation,” something he wants to extend to other tech leaders such as Google, Apple and Amazon; the six-month embed is scheduled for next year. Macron also released an international agreement on cybersecurity principles; the Paris Call for Trust and Security in Cyberspace was signed by 50 nations, 130 private sector groups and 90 charitable groups and universities, but not the United States, Russia or China. [Mathieu Rosemain, Michel Rose and Gwénaëlle Barzic / Reuters]Small U.S. cable companies want the Department of Justice to reinvestigate Comcast’s 2011 merger with NBCUniversal. The American Cable Association, a group that represents a collection of small and independent cable companies, sent a letter to the DOJ requesting that officials open a formal investigation, saying that the deal poses “a much greater threat to competition” than AT&T’s recent merger with Time Warner. Government restrictions attached to the deal had limited Comcast’s ability to harm consumers, but those restrictions expired over the summer, opening the door to questionable business tactics such as withholding NBC’s television programming from competing cable providers. [Brian Fung / The Washington Post] You know Jony Ive for the distinct mix of understatement and elegance he brings to the designs of Apple products. Apple’s chief design officer has been working on something a little different: A diamond ring. Unlike most diamond rings that have a metal band made of gold or silver, Ive decided to “think different” and instead created the entire ring out of diamonds. Rather than being sold in a jewelry store, the one-of-a-kind ring will be sold exclusively at a Sotheby’s auction to raise funds to help eliminate HIV/AIDS in eight African countries. The ring, which will be made to fit the buyer, is expected to sell for between $150,000 and $250,000 at the Dec. 5 auction in Miami. Meanwhile, jewelry that belonged to Marie Antoinette, wife of King Louis XVI and arguably France’s most famous queen, is headed to the Sotheby’s auction block in Geneva, Switzerland on Wednesday, Nov. 12. [Jeff John Roberts / Fortune]RIP, Stan Lee, the superhero of superheroes. The legendary writer, editor and publisher of Marvel Comics was responsible for such iconic characters as Spider-Man, the X-Men, Thor, Iron Man, Black Panther and the Fantastic Four. On his own and through his work with frequent artist-writer collaborators Jack Kirby, Steve Ditko and others, Lee catapulted Marvel from a tiny venture into the world’s No. 1 publisher of comic books and, later, a multimedia giant. In 2009, The Walt Disney Co. bought Marvel Entertainment for $4 billion, and most of the top-grossing superhero films of all time have featured Marvel characters. Here are 12 things you might have learned over two decades of lunches with Lee; and here is Lee’s vision of the American dream. [Mike Barnes / The Hollywood Reporter]Amazon is dominant online, but local retail still has advantages Jeff Bezos can’t replicate.Sometimes it’s worth putting on your shoes and taking a walk. [Kara Swisher]The exec who built Snapchat Discover is leaving the company.Nick Bell is stepping down following some recent management changes and four-plus tumultuous years. [Kurt Wagner]Former Deputy Attorney General Sally Yates explains how Donald Trump is trying to corrupt the Justice Department.On the latest episode of Recode Decode, Yates talked about how things have changed since she was fired in Week Two of the Trump administration. [Kara Swisher]Is Daily Beast the new Gawker?On the latest Recode Media, the site’s new editor in chief, Noah Shachtman, says he wants to take “full, big, considered swings” at the targets who deserve it. [Steven Perlberg]Bring Your Parents to Work Day.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}