{"id": "Elon Musk: The Recode interview", "paragraph": "I’ll be honest, I have been email haranguing Tesla and SpaceX founder and CEO Elon Musk for months about talking to me and today on Recode Decode, we have a special interview with one of the most-loved, often-controversial and generally most-talked-about figures in tech.On Halloween night, we sat down at Tesla HQ in Palo Alto for an 80-minute conversation about how those companies are faring, why he was working 120-hour weeks, his public animosity for the press, Donald Trump’s Space Force, accepting money from Saudi Arabia and more. Also on the menu: Musk’s rabid fans on Twitter, dying on Mars, a Tesla pickup truck that will look like something out of “Blade Runner” and talk of an electric bike and VTOL plane — but not a Tesla scooter because those “lack dignity,” apparently.There is one question I forgot to ask: Whether he thought he should remain CEO of Tesla after a year of terrible errors and why he thinks he deserves that job. But he answered that in many indirect ways here, presenting a more rested, happier and in-control entrepreneur who seems to be undaunted by his troubles. My favorite response showed he did understand those issues and his “self-inflicted wounds”: “Yeah, there’s no question there’s, like, self-inflicted wounds. In fact, my brother said, ‘Look, if you do a self-inflicted wound, can you at least not twist the knife afterwards?’ You stabbed yourself in the leg. You don’t really need to twist it in your leg. Why do that?”Why indeed? Take a listen:You can listen to Recode Decode wherever you get your podcasts, including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a condensed version of my conversation with Elon Musk. You can read a full transcript of the interview here.Kara Swisher: I’m here with Elon Musk at the headquarters of Tesla. We’re gonna talk about Tesla, we’re gonna talk about SpaceX, we’re gonna talk about this year, we’re gonna talk about The Boring Company, and anything else Elon wants to talk about, because people like to hear you talk. Let’s start from the beginning, about this year. You’ve given some very interesting interviews. You’ve gotten on Twitter, made some mistakes.Elon Musk: What’s Twitter?What’s Twitter? Okay, let’s start with Twitter. I have an obsession with Twitter, too, and an addiction. What happens with you and Twitter?Well, I tweet interesting things pretty much as they come to me, and probably with not much of a filter.And why?I find it entertaining. I think, “Oh, other people might find this entertaining.” Sometimes they do.Just at night? What are you, at home you’re doing this?Yeah. Mostly at home. I spend a lot less time on Twitter than people probably think. It’s like maybe 10-15 minutes or something.Yeah, well people pay attention when you do that. Yeah. It’s pretty interesting what my most ... What people are most interested in, like some little tweet about “I love anime.” That was it. But it was lowercase “i”, black heart, “anime,” and people loved that. That was like one of my most popular tweets.What about the things they didn’t love? Are you under strict orders not to do that? Is that correct? Will you be? Will you have to change your Twitter behavior?Not really. I think it’s mostly just if it’s something that might cause a substantial movement in the stock during trading hours. That’s about it.Do you consider it a communications medium? How do you look at it? I look at it as a way to learn things, kinda stay in touch with what’s happening. It feels like dipping into the flow of consciousness of society. That’s what it feels like. It’s kinda weird. I guess I sometimes use Twitter to express myself, and that’s a weird thing to do, I suppose.Not so much. It isn’t. Sometimes it’s very funny, other times it’s not so funny.Some people use their hair to express themselves. I use Twitter.You pick fights with the press over Twitter, and then you have all your fans, of which there are many. Are you aware of what they do once you start them off?Well, I have to say, my regard for the press has dropped quite dramatically.Explain that, please.The amount of untruthful stuff that is written is unbelievable. Take that Wall Street Journal front-page article about, like, “The FBI is closing in.” That is utterly false. That’s absurd. To print such a falsehood on the front page of a major newspaper is outrageous. Like, why are they even journalists? They’re terrible. Terrible people.I get that, but do you understand the mood in this country around the press and the dangers of attacking, especially when the president is doing that? In quite an aggressive, “enemy of the state” and everything else. It’s disturbing when someone like you as a leader does that, too, or goes along with it.The answer is for the press to be honest and truthful, and research their articles and correct things properly when they are false. Which they don’t do.Okay. But I’m asking if you understand where it goes to.Yes, of course I do.What do you think of that? Are you worried about unleashing a dangerous cycle that a lot of the press are worried about? Justifiably. I suggest the press take it to heart and do better.What about what Donald Trump does, about “enemy of the people”? Do you look at it that way?No.Just that you don’t like falsehoods.Yeah. There are good journalists and there are bad ones, and unfortunately the feedback loop for good versus bad is inverted, so the more salacious that an article is, the more salacious the headline is, the more clicks it’s gonna get. Then somebody is not a journalist, they are an ad salesman.What about things that are just critical of you that you don’t like? Do you think you’re particularly sensitive? No. Of course not. Count how many negative articles there are and how many I respond to. One percent, maybe. But the common rebuttal of journalists is, “Oh. My article’s fine. He’s just thin-skinned.” No, your article is false and you don’t want to admit it.Do you take criticism to heart correctly?Yes.Give me an example of something if you could.How do you think rockets get to orbit?That’s a fair point.Not easily. Physics is very demanding. If you get it wrong, the rocket will blow up. Cars are very demanding. If you get it wrong, a car won’t work. Truth in engineering and science is extremely important.Right. And therefore?I have a strong interest in the truth.All right. And you are —Much more than journalists do.What I’m trying to get to is, do you want to acknowledge when you do this it does set off ... People beyond you that listen to you, you have a fan base that’s quite rabid, I would say.No, I wouldn’t say that.No? I think they’re great.All of them?No, not all of them.Let’s talk about this year. What has gone on this year with you? It’s been a very difficult year. We had the Model 3 production ramp, which was excruciatingly difficult. It is incredibly difficult to survive as a car company. Incredibly difficult. People have no idea how much pain people at Tesla went through, including myself. It was excruciating.Talk about that toll.Pretty sure I burnt out a bunch of neurons during this process. Running both SpaceX and Tesla is an incredibly difficult ... You realize we’re fighting the incredibly competitive car companies. They make very good cars. They’ve been doing this for a long time. They are entrenched. Mercedes, Audi, BMW, Lexus, you name it. All those car brands. And the history of car companies in America is terrible. The only ones that haven’t gone bankrupt are Tesla and Ford. That’s it. Everyone else has gone bankrupt.You put too much pressure on yourself this year, or it just is what you’re doing?It sounds like you’re not hearing me. Making a car company successful is monumentally difficult. There have been many attempts to create a car company and they have all failed, even the ones that have had a strong base of customers, thousands of dealers, thousands of service centers, they’ve already spent the capital for the factories, like GM and Chrysler, still went bankrupt in the last recession. Ford and Tesla made it barely through the last recession. There’s a good chance Ford doesn’t make it in the next recession. So, as a startup, a car company, it is far more difficult to be successful than if you’re an established, entrenched brand. It is absurd that Tesla is alive. Absurd! Absurd.What do you credit that to?Excruciating effort.By you and —Hundred-hour weeks by everyone.By everyone here at Tesla. Yes. There wasn’t some other way to do this.What I want to get at is why you’re doing that. It’s not a trivial … Why do you think you want to push yourself that hard? Well, the other option would have been, Tesla dies.Right.Yeah. Tesla cannot die. Tesla is incredibly important for the future of sustainable transport and energy generation. The fundamental purpose, the fundamental good that Tesla provides is accelerating the advent of sustainable transport and energy production.Which I think most people credit you for doing. Pushing everyone else into it at the same time, correct?Yes. The success of Tesla is, by far, the biggest forcing function for the other carmakers to get into into electric cars. They’ve said so.No, there’s no question. I was just having a discussion with someone the other day, and I said, “He has pushed everybody into this, really dramatically. There wouldn’t have been this much investment. There wouldn’t have been this.” Yes. It’s very important for the future of the world. It’s very important for all life on Earth. This supersedes political parties, race, creed, religion, it doesn’t matter. If we do not solve the environment, we’re all damned.And this way via sustainable transportation.Yes. It sort of blows my mind, all these social justice warriors driving around in diesel cars. It’s outrageous. You’re doing this to yourself because you think that the world depends ... Not the fate of the world. You’re not a cartoon character. No, I think the electrification of transport, and there’s also an important part of Tesla which is solar and stationary batteries, because you need to generate electricity in a standard, sustainable way with solar and then store it at night when the sun goes down with batteries, and then use that energy from the sun to power cars. Without Tesla, this would still happen. There would still be a transition to sustainable energy, but it would take much longer. History will judge this, obviously, but I would say on the order of 10 years, maybe 20 years.So, pushing it forward by that much.Yes. I think it’s probably fair to say that Tesla has advanced sustainable energy by at least five years, conservatively, and maybe closer to 10, and then if we continue to make progress, we might advance it by 20 years. This could be all the difference in the world.What is the toll on you? What has been the toll on you and your employees? How do you think about that? It’s been terrible. This year felt like five years of aging, frankly. The worst year of my entire career. Insanely painful.Was there any other way to do it? You didn’t think there was any other way to have it happen? Why this year? For this past year, it’s been because of the Model 3 production ramp. Myself and others at Tesla, we had to go in and fix the mistakes in the Model 3 production system, and there were a lot of them. I personally solved a bunch. Jerome [Guillen] solved a bunch. Everyone helped, the entire team. Javier [Verdura], Franz [von Holzhausen], Deepak [Ahuja], everyone. It was ... like, we had the legal team delivering cars in Q3. Todd [Maron] is great. There was a lot of people ... Everyone had to basically go hardcore to solve the ramp.I want to get into Tesla specifically, and about the recent results, which I think people were surprised by. You surprised Wall Street and some of your competitors. But when you’re thinking about doing this incredibly complex thing, do you regret some of the things you’ve done to slow it down itself? You know, some of your tweets, some of it is self-inflicted. Do you not see it that way?Yeah, there’s no question there’s, like, self-inflicted wounds. In fact, my brother said, “Look, if you do a self-inflicted wound, can you at least not twist the knife afterwards?” You stabbed yourself in the leg. You don’t really need to twist it in your leg. Why do that?So why do you do that?It’s not intentional. Sometimes you’re just under a lot of pressure, and you’re not getting much sleep, you’re under massive pressure, and you make mistakes.Is that over? Do you feel like that’s over? Do you feel calmer now?It’s totally over. I will never make another mistake again.No, I’m teasing you. But how do you ... You look well. You don’t look under a lot of pressure. You seem rested. Yeah. Things are back to a hard work schedule, but not an insane work schedule. I was, there were times when, some weeks ... I don’t know. I haven’t counted exactly, but I would just sort of sleep for a few hours, work, sleep for a few hours, work, seven days a week. Some of those days must have been 120 hours or something nutty. You’re gonna go a little bonkers if you work 120 hours a week. Now we’re down to 80 or 90. It’s pretty manageable.And you had talked in the New York Times about using Ambien and stuff like that. That was to regulate your sleep, correct? Yeah. It’s not like for fun or something.No, not at all. No, it’s just like, if you’re super-stressed, you can’t go to sleep. You either have a choice of, like, okay, I’ll have zero sleep and then my brain won’t work tomorrow, or you’re gonna take some kind of sleep medication to fall asleep.You turned in a great quarter. How do you look at where you’re going with the Model 3 and others?I think at Tesla we’re doing pretty well right now. Tesla’s not staring death in the face. We’re in, I think, a pretty good position. We don’t want to be complacent, but it’s not ... Up until around September, we were really faced with, like, “We must solve this or we’re gonna die,” constantly. I feel like we’re no longer in the staring-death-in-the-face situation.What, is death over and sitting in a seat nearby? Well, you never want to get complacent, so we still need to work hard, but I think we’re over the hump. We’re certainly over the hump on Model 3 production. For us, making 5,000 cars in a week for Model 3 is not a big deal. That’s just normal. Now we’re working on raising to 6,000 and then 7,000 Model 3s a week, while still keeping costs under control. We could probably do 6,000 or more, maybe 6,500 Model 3s a week right now, but it would have to stress people out and do tons of overtime.Talk about the new navigation feature. Drive on Navigation?Right.That’s I think one of the first major steps toward full self-driving. You can enter in an address, and from highway on-ramp to highway off-ramp, the car will change lanes. It will go from one highway to the next automatically, and take off-ramp automatically. It’s pretty wild. It’ll overtake a slow car. It’s basically integrating navigation with the Autopilot capability. That’s why we call it Navigate on Autopilot, or Drive on Nav.What are the challenges that you face with these technologies now, from your perspective?Well, the main challenge has been improving the neural net so that we can recognize all types of objects from all eight cameras. There are eight cameras: Three forward, two on each side, and one rear. The big challenge has been solving a wide range of corner cases. So if you have a —These are things that just happen. Yeah, the roads are pretty messy, so you could have, say, skid marks on the road that look like a line. Sometimes tar seams look like a line. Sometimes the lines are just painted wrong, for some reason. One of our biggest challenges, actually, with Drive on Navigation was dealing with forks and gores, where if a lane is splitting, you need to be confident that you’re going either left or right, not down the center. And the car will come to a halt at the first intersection.Now we’re integrating stop signs, traffic lights, being able to do, say, hard right turns or hairpin bends and that kind of thing.What about regulations? The regulatory environment right now? Because that’s gonna be part of it, or else building out infrastructure that will have sensors in roads or things like that? How do you look at that, or you’re just not even thinking about it?Yeah, we’re not really thinking about it. We’re assuming that there won’t be —You’re not assuming.No. The car needs to drive better than a human driver using the same inputs as a human driver. Eyes are basically just cameras. All creatures on Earth navigate with cameras. A fish eagle can see a fish from far away and take into account the refractive index of the water, dive down and get the fish from far away. There’s no question that image-recognition neural nets and cameras, you can be superhuman at driving with just cameras.You don’t need anything else, from the government or from infrastructure or anything. I was recently talking to the Mercedes people. They were talking about sensors in the roads.Yeah, that’s hopeless. That would, at best, be a specialized solution, and whatever city puts stuff in roads ... You can always make something work for a specific solution, like some special-case solution in some town, you can make that easy, but what you really want is a general solution for self-driving that works worldwide.I’d love you to sort of assess the competitive landscape. Faraday just lost another founder today, which was the hot company, or the allegedly hot company, I think that’s probably easier to say it that way. Lucid got a billion dollars. How do you assess — Google’s working on stuff, Uber still seems to be hanging in there. I’d love to get your assessment of all of them.Yeah. I don’t really think that much about competitors. I just say like, you know, how do we make our cars as good as possible? How do we make sure we have like the best engineering and manufacturing talent in the world?It’s sort of like the old adage with, you know, running ... If you start looking at the other runners, it’s not good, you know. Like, you can lose races because of that.Which one of them, do you think, is the furthest ahead or closest to you all?Self-driving, maybe Google, Waymo? I don’t think anyone is close to Tesla in terms of achieving a general solution for working on —Overall solution.Yeah. Yeah. You can definitely make things work like in one particular city or something like that by special-casing it, but in order to work, you know, all around the world in all these different countries where there’s, like, different road signs, different traffic behavior, there’s like every weird corner case you can imagine. You really have to have a generalized solution. And best to my knowledge, no one has a good generalized solution except ... and I think no one is likely to achieve a generalized solution to self-driving before Tesla. I could be surprised, but...So none of the car companies. None of the car companies. No.Do you ever look and go, “Okay, that’s interesting what they’re doing there.”The other car companies ... I don’t wanna sound overconfident, but I would be very surprised if any of the car companies exceeded Tesla in self-driving, in getting to full self-driving.You know, I think we’ll get to full self-driving next year. As a generalized solution, I think. But that’s a ... Like, we’re on track to do that next year. So I don’t know. I don’t think anyone else is on track to do it next year.So the challenge you face is financial, though. Getting funding and stuff like that. And you’ve gotten ... Saudis had bought a big bunch of your stock, that’s just separate, they —They might have sold it, I don’t know.Yeah, we don’t know what they have now. But where do you get the money? Talk about the finances of doing this, because that’s what could really hurt you, is not having enough capital.You know ... I mean, as I said earlier this year, I think we will be cash-flow positive for all quarters going forward.All quarters going forward. So do you need more investment?No, I don’t think so.Do you need to go private? Are you still contemplating that?We don’t need to go private. I think we could execute better if we were private.Without all the attention?Yeah, you know, not to harp on those short-sellers, because people think I have this obsession with them, but I spent like 1 percent [or] less of time thinking about them —It’s the tweets, Elon. But go ahead.Less than 1 percent of my tweets have anything to do with short-sellers. But the issue is that there’s a group of people who are quite smart, very mean, and have a strong financial interest in Tesla’s downfall.And what that results in is a constant attack on the Tesla brand, on me personally, on the executive team, on our cars. You know, every mistake we make is amplified. Going private would definitely result in some short-term drama. Let’s say we’re private, and then we went public five years from now. Then the area under the curve of brand damage by short-sellers would be probably less than the short-term difficulty of going private in the first place. That was the approximate calculus. And then also being public, particularly when everyone at the company is a shareholder, causes a lot of distraction when the share price moves around a lot. It tends to end up being like a mood, to some degree, a mood thermometer. So it’s like the stock goes down, people are sad and feel undercompensated. And then when the stock goes up, people are exuberant, overly exuberant, and you get distracted thinking about what you’re going to buy.Right, right.So, like, neither of these things are great. When you have big moves in the stock, this just causes a distraction.Okay. All right, so last thing on this, on Tesla, these new products. The truck, the Roadster, do you have another thing you’re making?Ha-ha. We definitely do.Do you have a vertical lift and takeoff?The supersonic VTOL jet, electric jet.Yeah. Perhaps a hovercraft like Larry Page, I don’t know.No, hovercrafts are pretty straightforward.Yeah. Okay, sure. For you.A supersonic vertical-takeoff-and-landing electric jet would be interesting to do at some point, I think. But my head would definitely explode if I tried to do that right now.But I’ve been thinking about that design for nine years. It’s great.It’s great? It’s in your head?Yeah. I mean, I wrote down some of it, but ...But the truck is more immediate, [and] the Roadster? When do those come online? I think it’s literally the most exciting product lineup of any company in the world. Certainly from a consumer standpoint. I’ll just go through the things that are publicly announced.You’ve got the Model Y, which is the midsize SUV. You’ve got the Semi truck, which is, can be great for really heavy transport. It’ll be like the heaviest class of truck, of industrial truck.We’ve got the next-generation Roadster. Which will be the fastest sports car on every dimension. Fastest acceleration, fastest top speed, best handling. It’s important to have an electric sports car that’s faster than the fastest gasoline sports car. And it helps address that halo effect that gasoline sports cars have. So I think it’s important to do that to show that, you know, electric is the best architecture.Then we’ve got the pickup truck, which — actually, I’m personally most excited about the pickup truck.Why’s that?Well I can’t talk about the details, but it’s gonna be like a really futuristic-like cyberpunk, “Blade Runner” pickup truck. It’s gonna be awesome, it’s gonna be amazing. This will be heart-stopping. It stops my heart. It’s like, oh, it’s great.Who do you wanna sell that to? People that buy F— whatever?You know, I actually don’t know if a lot of people will buy this pickup truck or not, but I don’t care.Okay.I mean I do care, eventually, you know. Like sure, I care. We wanna get gasoline, diesel pickup trucks off the road.Right.It’s something I’ve been wanting to make for a long time. If there’s only a small number of people that like that truck, I guess we’ll make a more conventional truck in the future. But it’s the thing that I am personally most fired up about.Do you have a motorcycle?No. I rode motorbikes a lot when I was a kid. So I did, like, dirt biking and then rode a motorcycle on the road. And then I almost got killed when I was 17. Most people are paralyzed, but depending on how you count it, the probability of death in a motorcycle versus —It’s quite high.It’s 25 times higher.Yeah, my brother is a doctor. He calls them donor-mobiles, actually.Yeah. Like organ donors. So, we’re not gonna make motorcycles. But a few more Tesla products that are cool: We’re almost done with the development of the solar tile roof. So we have those on a few hundred roofs right now. And we’re just doing testing to make sure they have long-term durability.These are tile roofs, these are tiles on the roofs? Yeah.Yeah, the solar tile roof where it looks like a normal, beautiful tile roof. But it’s actually solar. And, like, that development process is longer than we’d like, because we’ve got to make sure that the roof’s gonna stand up for 30 years.Sure.And even when you do accelerated lab testing on a solar roof, it still takes a while. And we’ve gotta put a lot of work into making the installation process easy, so it doesn’t take ages to install a roof.Then we’ve got the Powerwall battery storage system. We’ve got the Powerpack, which is used for utilities on industrial scale. We’re gonna have some other exciting announcements on the stationary storage front. So when you —This is within the homes?I can’t talk more about it, but there’s —Presumably.We have a large product on the stationary storage side that I think will be very compelling for utility customers.Okay, all right. So, a Roadster. Any planes?No plans to make planes at Tesla.Well let’s get to rockets, then. SpaceX. Last time we talked, you said you wanted to die on Mars, just not on landing. Which was a very funny joke, although it’s probably not a joke, it’s probably —Well, it’d be ironic if that had happened. I have to be careful about tempting fate, because I think often the most ironic outcome is the most probable.It just very often seems like reality tries to ... Actually, technically, there’s a friend of mine, Jonah Nolan, who had this like modification of Occam’s razor where he said he thinks “the most ironic outcome is the most likely.” And then I think that there’s some truth to that. And then also I think sometimes the most entertaining outcome is the most likely. Instead of discussing your death, let’s discuss what’s going on at SpaceX. What are some of the things you’re doing?We successfully launched the Falcon Heavy rocket, which is the most powerful rocket in the world by a factor of two. So that’s twice the power, twice the thrust of the next biggest rocket. And we actually launched a Tesla — my Tesla Roadster — to Mars orbit. The reason we did that is actually because, normally, when a new rocket is launched, you just put a dummy payload, which is like a block of concrete or something. Right. Not creative in any way.Super-boring. So we were like, okay, what is the least boring thing we can launch?And then next year, the exciting things are we’re gonna be launching astronauts for the first time to the space station. It’ll really be the first time a vehicle from the United States launches astronauts into orbit since the Space Shuttle, which —Which has been some years, right?2010 or something like that? Since then, the United States has relied upon the Russian Soyuz, which actually recently has had some issues. What do you think of the Space Force? The Trump Space Force?Well, this may be a little controversial, but I actually like the idea. I think it’s cool. You know, like, when the Air Force was formed, there was a lot of like pooh-poohing, and like, “Oh, how silly to have an Air Force!” You know, because the aircraft in World War II were managed by the Army.Right.And so you had the Army and the Navy and the Coast Guard and the Marines, and then ... it became pretty obvious that you really needed a specialized division to manage aircraft. And so the Air Force was created.And people today may not realize back then it was wildly panned as a ridiculous thing to create the Air Force, but now everyone’s like, “Obviously, you should have an Air Force.” And I think it’s gonna become obvious that we should have a Space Force, too.Out there, to do what?You know, it’s basically defense in space. And then I think also it could be pretty helpful for maybe expanding our civilization ... You know, expanding things beyond Earth.I think we could just have a base on the moon, for example. A base on Mars. Be great to expand on the idea of a Space Force. Anyone who has an exploratory spirit, and I think that especially applies to a country like the United States, where you know it’s kind of the distillation of the spirit of human exploration. I think the idea of being out there among the stars and among the planets is very exciting.All right. And, Mars. Last time we talked, it was 2024, was it? That you talked about getting there?Yeah, we’re still aiming for 2024.Okay. And you going? Or someone going?I don’t know if I will go or not. It may be just an unmanned mission, you know. I’m not sure if there’ll be people onboard or not.But there is a Mars rendezvous opportunity, ’cause you can only do a launch to Mars roughly every two years. So around the 2024 timeframe, there’s a rendezvous opportunity for Mars, which hopefully we can catch. There’s one in 2022 —So an unmanned flight to Mars?Hopefully, there are people on board. But I think there’s a pretty good chance of at least having an unmanned craft go to Mars. I think we will try to do this.Do you think NASA should continue to exist, or all these space agencies by the government? Yeah, I certainly think NASA should continue to exist, NASA does a lot of really useful things, and these go beyond astronaut transport. There are missions to rovers on Mars that are thanks to NASA. There are these planetary probes, there’s the Hubble Telescope. NASA does a tremendous amount of good, and ideally we should actually increase the budget of NASA. I think it’s high time that we went beyond Earth orbit again. I think it’s very exciting and inspiring, and I think it really gets the whole world fired up.When the first humans stepped foot on the Moon, it was probably the most inspiring thing, maybe in history? We should try to do more of that stuff.How do you look at what [Jeff] Bezos is doing with Blue Origin, because I suppose that’s the most comparable private thing going on?Yeah, I think it’s great that Jeff is spending lots of money on space. I think it will encounter some challenges getting to orbit; it’s remarkably difficult getting to orbit. But he has the resources to overcome those difficulties. He’s got some spare change in the couch, I think.You’re not buying a newspaper, are you?No, I don’t generally acquire things.Yeah, just curious.I create companies, but I don’t really acquire them. So I wouldn’t ... I have no plans. It does seem to be popular these days.So let’s finish up the last two things. Boring Company, I was just with Eric Garcetti in Los Angeles —Oh, great, yeah. Eric’s been a great supporter.Yeah, he has. He says, “Anything to cut traffic.” He doesn’t care. I was like, “Why do you think these people are interested in traffic so much?” And he said, “Because no matter how rich you are, everybody can get caught in traffic. And so they just want to do something about it.”Yeah, Eric’s been really supportive of our activity in L.A. I mean, technically, our first tunnels are in Hawthorne. But we do expect to, over time, create a network of tunnels under greater L.A. And I think this is really the key to getting around the city very fast. You’ve got to go 3-D. Our offices are 3-D and dense, but we then have a 2-D road transport network.So you’re thinking all around, lots of roads within the tunnels?Yeah, many levels of tunnels, so —Right, like a subway system?Yeah, but even subways tend to be essentially two-dimensional. You’ll have a subway cross another subway, but they’ve never really tried to make many layers of subways. The cost of tunneling, historically, has been prohibitive. And they’ve also been incredibly slow. The typical cost for a subway, per-mile cost for a subway in the U.S. has been about a billion dollars a mile, so that is not a very scalable solution.So tunnels?You could certainly have a subway system which had many layers of tunnels, but the tunnels are so prohibitively expensive that they don’t do it. But you can go down 100 levels if you want to; you could have 100 layers of tunnels on top of each other. You can go further down than you can go up. So the deepest mines are much deeper than the tallest buildings. But, really, the key is a massive improvement in tunneling technology. That’s the linchpin, that’s fundamentally what it amounts to. And as I got sort of digging into tunnels ... Ha-ha, good one.Do you say that? Please don’t do that, you need to stop. Is that how you amuse yourself?Yeah, yeah, no, I’ve got a million of ’em.“Digging in?”Tunnels are really so underappreciated. They have no place to go but down.Oh my god. All right, okay. These are dad jokes, you know that?I am a dad, so —I’m glad you’re amused with yourself, go ahead.No, no, it’s a terrible habit. I laugh at my own jokes, even with the terrible ones. So, what I discovered is that there are massive improvements possible in tunneling technology.When will one be useful? The Hawthorne one, it’s a test tunnel?Yeah, we’re about to finish the first test tunnel.At what cost?I don’t know, I think it’s probably ... Excluding the equipment, probably cost us $10 million for a mile. It’s one-way, admittedly, but —So when will people be able to use it, actually use it?We’re planning on having an opening party on Dec. 10th, in six weeks.One thing I didn’t ask: When you had been looking to go private with Tesla, you had talked to the Saudis. How do you feel about them now? I ask every internet executive this now, given the amount of money they have in the system.Yeah, well I mean, it’s important to appreciate that the Saudis have been approaching me for two years about going private. It wasn’t like spur-of-the-moment.But I’m talking about in the wake of Khashoggi’s murder.Yeah, I mean, that sounds pretty bad. So ... that is not good. That is bad.That is bad.That was really bad, it was really —Would you take their money now?I think we probably would not, yes.Okay, and what about their influence in Silicon Valley, given the billions that are being poured in here?I know I can’t speak to that, I mean, it’s not ... Saudi Arabia’s an entire country, so I think you don’t want to, if there’s one really bad thing that occurred, nail down the whole country, it’s not great.It’s their ruler.Sure.It’s their ruler, it’s the guy who runs everything.They didn’t elect him, you know?No, they didn’t, that’s right. No, I get that, I’m not impugning all Saudis, but it is the government.I think we should just consider that there is a whole country, and there’s, you know ... There are a lot of good people in Saudi Arabia, and Saudis who are outside of Saudi Arabia. So I think you cannot paint an entire country with one brush.No, no, I’m just talking about the people who have the money.I think there are serious issues, it’s not good.And what about the techlash itself? You had been a critic of how — the responsibility around AI, around diversity of AI. About the power that’s held by Facebook and Google and others, in previous interviews we’ve done. How do you look at that now?It probably makes sense if something is responsible for a public good, and could potentially negatively affect elections or something like that, that there probably should be some regulatory oversight to ensure that we’re not negatively affecting the democratic process. That the quality of news is good and not unduly influenced. These seem like sensible things.At the time we’d talked a couple years ago, you were worried about the power that Google and Facebook were assembling in AI, and you were worried about AI itself. And I think one of the things that you had said that really struck me was that it wasn’t going to kill us, it would treat us like house cats. I thought that was a really striking way to think about it.In the long term, as AI gets probably much smarter than humans, the relative intelligence ratio is probably similar to that between a person and a cat, maybe bigger. I do think we need to be very careful about the advancement of AI and —And you’re still worried about it in that way?My recommendation for the longest time has been consistent. I think we ought to have a government committee that starts off with insight, gaining insight. Spends a year or two gaining insight about AI or other technologies that are maybe dangerous, but especially AI. And then, based on that insight, comes up with rules in consultation with industry that give the highest probability for a safe advent of AI.You think that — do you see that happening?I do not.How are you feeling about the future, when what appears to be reality ...?For some reason, I feel optimistic. And I’m not sure if that is irrational or not.Does this polarization affect you? You’ve pulled yourself off the Trump councils, I know you and I talked about whether ... I said you shouldn’t go, ’cause he was gonna screw you, remember? Well, you were right.I am right, thank you, Elon. I know that. But you feel, in the midst of this polarization, these bombings, the president continually being divisive, you feel optimistic?Yeah. By the way, I still think it was worth trying to be on the Trump councils, and especially just to be an advocate for climate, I did my absolute best.Yes, I know you did. I think I called you, I think I said, “You’re not Jesus, it’s not going to work.”I definitely do not think I am Jesus.No, I know you don’t. I think I was just trying to egg you into getting off the councils.Arguably, it was unlikely, but it was worth a shot, yeah.Right, would you do it again?Do you mean now, or ...?Yeah.I don’t know, are there councils?No. But you’re optimistic, given all this polarization? Are you thinking about the midterm elections?I am thinking about the midterm elections, and I did vote, by the way.Me, too. Today.Though I do wonder what effect a vote in California has. There’s so much gerrymandering of electoral districts that it seems like ... I voted for the sake of voting, but things are very divisive right now, politically. But it’s probably not wise for me to wade into political debates, it’s a no-win situation.Right, I got it. But how do you feel — as a citizen, how do you feel?I definitely wish people wouldn’t yell at each other quite so much, I wish there was less hate.Right, okay, my last question. If you had to redo anything this year, Elon, what would it be? It’s fair to say I would probably not have tweeted some of the things I tweeted, that was probably unwise. And probably not gotten into some of the online fights that I got into. I probably shouldn’t have attacked journalists, probably shouldn’t have done that.I don’t know why you do it.Yes.Yeah, do you want to say you’re sorry? You can if you want.I’m sorry to some journalists.Okay, I’ll give you that, I’ll give you that. Okay, I’ll give you that. Elon, podcast secured.Thank you, Kara. It was great to see you.It’s been a really fascinating discussion, and I will think about buying an electric car, probably not. I mean, why not?Make a scooter. Make a scooter and I’ll go for it. They actually are electric, what am I talking about? I don’t know, there was some people in the studio who wanted to make a scooter, but I was like, “Uh, no.”I love the scooter, no, get on the scooter.It lacks dignity.No, it doesn’t lack dignity.Yes, they do.They don’t lack dignity, what are you talking about?Have you tried driving one of those things? They —Yes, I do it all the time, I look fantastic.They do not, you are laboring under an illusion.All right, well, everybody at Lime, don’t worry, Elon Musk is not coming for you.Electric bike. I think we might do an electric bike, yeah.All right, perhaps. All right, Elon Musk, thank you very much. I appreciate it.That was a pleasure, thank you. It was good to see you.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.A Verge affiliate site"}