{"id": "Washington pummels Facebook: ‘Big tech can no longer be trusted’", "paragraph": "Facebook is, once again, a political piñata.In the aftermath of a New York Times story that meticulously revealed Facebook’s cloddish response to the disinformation and hacking campaigns around the 2016 election, the company is battling renewed criticism from Washington, D.C. \n    Related\n  It’s not like Facebook has had much of a break — though after both Mark Zuckerberg and Sheryl Sandberg testified extensively before Congress, you might think that the company’s brass had lowered the temperature from its Washington critics. But as the company’s internal deliberations become public, it’s getting harder for Facebook to present the “everything is fine” messaging on Capitol Hill.The toughest pummeling came from Democratic Sen. Richard Blumenthal, who said the story was a “chilling reminder that big tech can no longer be trusted.”“Yesterday, we learned that when Mark Zuckerberg told the American people that Russian interference was a ‘pretty crazy idea,’ he knew this was flatly untrue,” Blumenthal said. “Rather than take responsibility for a profound breach of trust, Facebook executives for months sought to withhold significant information and deflect criticism. Worse, in its evasion, Facebook hired toxic political operators that sought to mislead the public and disparage critics of the company.”Mark Warner, a loud Facebook critic as the top Democrat on the Senate Intelligence Committee, took a little victory lap on Thursday, saying that his committee’s work is to thank for exposing Facebook’s problems in the first place.“The New York Times story reinforces the fact that, but for consistent pressure brought to bear by the Senate Intelligence Committee’s bipartisan investigation, we would still be in the dark about the extent of Russian activity on Facebook during the 2016 election,” Warner said. “I’m happy to say that the cooperation has improved significantly, but what’s evident from the story is that for a long period of months, the company hoped this problem would simply just go away.”Ben Sasse, a Republican on the Senate Judiciary Committee, interrogated Zuckerberg during his Capitol Hill visit. Here’s how Sasse reacted to the Times story:“Instead of turning this into another lazy debate about the left, the right, and the 2016 election, Silicon Valley and Washington should be working to combat the very real threat that information operations can pour gasoline on nearly every culture war that divides the American people,” Sasse said. “Facebook needs to stop treating this like a PR crisis and Washington needs to stop treating this like a partisan opportunity — this is a real national security threat.” Several Senate Democrats appear to have in their crosshairs an opposition-research company, Definers Public Affairs, that Facebook reportedly hired to spread dirt on its competitors. Warner’s colleague on the committee, Amy Klobuchar, led a group of Democrats who sent a letter to the Department of Justice to see if Facebook broke any campaign-finance rules with this arrangement, among other requests.“We write to urge that you expand any investigation into Facebook and Cambridge Analytica to include whether Facebook — or any other entity affiliated with or hired by Facebook — retaliated against critics or public officials seeking to regulate the platform, or hid vital information from the public,” wrote Klobuchar alongside Blumenthal, Sen. Mazie Hirono and Sen. Chris Coons.The Times reported that Definers tried to cast the criticism of the company as pushed by George Soros, a prominent Jewish, liberal philanthropist. Senate Democrat Ron Wyden keyed in on that part, and was harsh.“Individuals that promote anti-Semitic bile, like Definers, and the people at Facebook who hired them, threaten not just our safety, but our democracy,” Wyden tweeted. “Facebook has not only refused to effectively crack down on hate-spewing Nazis, the New York Times revealed it actually encouraged anti-Semitism by hiring degenerate right-wing propagandists to concoct conspiracies that tap into anti-Semitic biases.”So what happens now? Wyden is calling for the Senate to adopt new privacy rules that he has pushed after saying: “A corporation that stoops this low in response to legitimate criticism should not be trusted with your personal information.”And Scott Stringer, the comptroller of New York City, reiterated his call for Zuckerberg to step down as the chairman of Facebook’s board of directors: “Renegade executives who are focused only on growth regardless of the risks — and withhold information from the board — put their company, shareholders, and in Facebook’s case, our democracy in jeopardy.”But don’t expect that to happen. If history is any guide, Facebook will keep plowing ahead, Washington will keep slapping it around, and few of the fundamentals will change.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}