{"id": "Trump’s latest China threat could crush the $8 billion Amazon competitor Wish. Here’s its plan to fight back.", "paragraph": "Wish CEO Peter Szulczewski built an $8 billion e-commerce juggernaut on the back of bargain-basement pricing made possible by cheap shipping rates for low-weight goods sent to the U.S. from China.But now, the Trump administration is threatening to withdraw from the United Nations agency that oversees those rates — throwing the future into question for one of the few U.S. online retailers to grow to a mass scale in recent years, even as Amazon’s dominance has expanded.Yesterday, the White House said the U.S. intended to withdraw from the Universal Postal Union over the next year and move to set its own rates if it can’t negotiate terms it felt were fair. The current rate structure, developed originally to help developing countries, was created long before China grew into a manufacturing and exporting powerhouse.The Trump administration has argued that the cheap rates give Chinese manufacturers and merchants an unfair advantage over their American counterparts, and have resulted in scenarios where it is at times cheaper to ship items from China to the U.S. than it is from one part of the U.S. to another. The two countries are currently engaged in the early stages of a trade war.A Trump administration official also told the Wall Street Journal yesterday that China’s subsidized rates cost the United States $300 million a year.For Wish, the threat of postal rate hikes sound like a big problem for now — even if the rhetoric turns out later to have just been a negotiating tactic. The company hosts an online bazaar where shoppers across the globe can browse a giant catalogue of cheap, predominately unbranded goods, from $11 sweatpants and $1 “Make America Great Again” hats to $14 binoculars. Most of these goods are shipped from China. Today, U.S. customers account for around 30 percent of Wish’s billions in gross annual sales, Szulczewski said in an interview. And about 70 percent of those U.S. orders are shipped directly from suppliers — drop shipped, in industry vernacular — to the United States Postal Service, which handles final delivery to customer homes. This arrangement takes advantage of the low China-to-U.S. postal rates that are currently intact. Those rates have been a big reason why $1 shipping fees are possible on Wish, or why a Chinese merchant can make money selling a sub-$10 item that is shipped across the globe. Without the cheap shipping rates, Wish may have to raise prices, perhaps impacting customer appeal.Szulczewski, however, insists the company has been planning for this day.“If this happened two or three years ago — maybe even last year — we would be in trouble,” Szulczewski said in an interview with Recode. “If drop shipping went away overnight, that’d be tough. But we’ve been preparing for this for a long time.”That preparation has involved investing in the buildout of three warehouses in the U.S. where the company stores some of its best-selling goods. The main goal of those investments has been to cut down on how long customers have to wait for the most popular items — from several weeks in some cases to several days when stored in the U.S.But this initiative also reduces the company’s dependence on the artificially low, cross-globe shipping rates that Wish relied on for its early success. In these instances, Wish uses freight-forwarding services to ship these items in bulk from Chinese merchants to Wish’s U.S. warehouses. When a customer places an order for one of these items, it is then shipped within the U.S. using U.S. carriers and normal rates.“The difference between us and much smaller competitors is we have the infrastructure to freight-forward all these goods and the capital to finance these operations,” the CEO said. Wish is still a privately held company, but has raised $1.3 billion from venture capital investors.Companies like Shopify and eBay, as well as Alibaba’s AliExpress business, also rely on merchants who use China-to-U.S. drop shipping for significant business. Amazon does to a lesser extent. “Ironically, this helps Amazon and Bezos,” Szulczewski noted, alluding to Trump’s publicly expressed disdain for Amazon and its leader.The companies declined to comment.For Wish, there are still real challenges to its warehouse approach serving as the company’s answer to the cheap-China-postage predicament. For one thing, around 70 percent of Wish’s U.S. business still does not go through its warehouses — meaning those orders take advantage of the current shipping rates in question. That’s a lot of business to move from one logistics method to another.That leads to another obstacle: Convincing the merchants responsible for that 70 percent of volume to send bulk orders of inventory to Wish without being paid upfront. “These merchants will not be comfortable with just putting $7 million of inventory in Kentucky,” Szulczewski conceded.So Wish will have to pay some fraction of the total inventory value upfront, and then trust its forecasting to promise merchants it can unload all of the items being stored — and to pay the merchants for any inventory that goes unsold. Wish does this in some cases today, but scaling such moves could put a crimp on margins.As for the idea that the U.S. is losing $300 million from the current arrangement, Szulczewski offered up a personal fix.“Come on,” he said. “I will pay that. Wish will pay that.”Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}