{"id": "Marc Benioff says he had rabbis and imams supporting the Prop C homelessness tax — but not tech CEOs", "paragraph": "A few weeks ago, Salesforce CEO Marc Benioff was the lone tech billionaire supporting San Francisco’s Prop C measure to increase taxes on large corporations in order to help the homeless.“I had the priests and I had the rabbis and the imams and all that helping me. But there were no CEOs on my side. I was the only CEO,” said Benioff, speaking with Recode Editor at Large Kara Swisher during an interview with MSNBC for the third episode of the television special “Revolution,” airing this Sunday at 10 pm ET on the network. Now, after Prop C won 60 percent of the popular vote in San Francisco, that’s starting to change, and Benioff finds it “really helpful.”  Last week, Twilio CEO Jeff Lawson announced that his company will donate $1 million toward services for the homeless in San Francisco. On Tuesday, Airbnb announced it would spend $5 million toward addressing the homelessness crisis in the city.These companies “finally have the permission” to help, said Benioff, “and that’s coming from their employees.” Many rank-and-file tech workers were upset that their companies weren’t supporting the measure, according to the Salesforce CEO.Public campaign contribution records show that some tech workers at companies like Stripe, Airbnb and Pinterest donated to the Yes on C campaign — even as their companies came out against the proposition or didn’t take a stance.In the weeks leading up to the election, Benioff sparred on Twitter with tech leaders such as Twitter and Square CEO Jack Dorsey, who opposed the measure, and accused some San Francisco billionaires of hoarding their wealth instead of opening their pocketbooks to help the city’s most needy.Dorsey and others opposed to the proposition pointed to San Francisco Mayor London Breed’s decision not to support it, citing concerns about accountability and how the funds raised from the tax hike would be spent. Dorsey also said the tax would disproportionately affect financial services companies like Square. Benioff himself initially had concerns about the tax, but said he decided to support it after researching its economic impact and talking to local advocates supporting the measure.“A lot of it I think is Pavlovian,” Benioff told Swisher. “You’re kind of taught in business school, you hear business taxes, you say ‘no.’ ... That’s what you’re supposed to do as a CEO. And the reality is in today’s world, especially here in San Francisco, that just is not what you can do.”Watch a clip of the exchange below:To hear Benioff talk more about this and other topics such as his company’s controversial contract with the Customs and Border Patrol and his path to becoming a CEO, tune in on Sunday evening on MSNBC.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}