{"id": "Snap hired two new executives to replace departing Imran Khan, CEO Evan Spiegel’s right-hand man", "paragraph": "Snap has found a replacement for Imran Khan, the company’s chief strategy officer and No. 2 to CEO Evan Spiegel, who announced that he was leaving in September. Khan’s job has been split into two new roles, according to an email to employees from Spiegel that was shared by Snap. Jeremi Gorman is taking over Snap’s ad business as chief business officer. She was previously head of global ad sales at Amazon. Jared Grusd, the current CEO of Huffington Post, is Snap’s new chief strategy officer, and will handle all partnerships and content and corporate development. Khan was an influential voice inside Snap, thanks to his proximity to Spiegel, and helped lead the company’s IPO process early last year. One thing to note: Gorman is the third big hire that Snap has made from Amazon in the past year, including its CFO Tim Stone and VP of finance, Derek Andersen. Snap’s head of engineering, Jerry Hunter, is also from Amazon. Why does that matter? Some believe Amazon could be a likely acquirer if Spiegel ever decides to sell his company, which has been struggling in the stock market for months. Hiring executives from Amazon doesn’t mean this idea will ever take form, of course, but it’s intriguing nonetheless. Snap reports earnings on Thursday after the markets close. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}