{"id": "Facebook’s top lawyer — who said he was leaving the company — isn’t leaving after all, because Facebook is still in crisis", "paragraph": "Facebook’s top lawyer, General Counsel Colin Stretch, announced back in July that he was leaving the company at the end of the year. That’s no longer happening. Stretch has decided to stay at Facebook, given that the company is still dealing with a number of legal and political crises, including multiple federal investigations into Facebook’s data and privacy practices that started earlier this year.More political scrutiny could be on the way following Wednesday’s bombshell New York Times story about Facebook’s efforts to lobby politicians and discredit opponents in the wake of the 2016 presidential election. Stretch told his team about his decision to stay a few weeks ago, according to a source, and he is expected to stay on at least until next summer, though it could be longer. Basically, Facebook’s problems are still big enough, even after the 2018 midterms are over, that Stretch decided he could no longer leave. A company spokesperson declined to comment. Company lawyers don’t usually make a lot of headlines, but Stretch has been more visible than most given Facebook’s issues over the past two years. He testified before two Senate committees and a House committee to discuss Russian election interference efforts last fall, and oversaw much of Facebook’s investigation into Russian election meddling efforts. Stretch was named in yesterday’s New York Times story as one of the few Facebook executives who knew that Russian hackers were using the service ahead of the election well before it was announced publicly — or even presented to Facebook’s board of directors. It’s unclear whether or not Stretch’s decision to stay had anything to do with that report. It’s also too soon to know what the fallout will be from that story, but it’s certainly possible that Stretch, or his bosses CEO Mark Zuckerberg and COO Sheryl Sandberg, may be asked back to answer more questions before Congress. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}