{"id": "Bradley Tusk, a political ‘fixer’ for tech companies, has a plan to make voting from your phone a reality", "paragraph": "As an investor/political consultant for Uber, Bradley Tusk directed the company’s aggressive efforts to mobilize consumers against New York City Mayor Bill de Blasio in 2015, and has since led similar campaigns for FanDuel and Bird. These experiences gave him a thought: What if voting were this easy?“If you give people the ability to advocate politically on their phone, they will do so,” Tusk said on the latest episode of Recode Decode. “The same people who would never vote in a primary, probably don’t know what primary day is, are far more likely ... By the way, I’ve had them acting on behalf of for-profit companies! Gambling companies, in some cases.”Historically, Tusk has taken equity in the companies for which he has worked as a political “fixer.” But now in order to “fix democracy,” he’s funding and piloting a program for smartphone voting in West Virginia, with votes recorded and secured by a blockchain, and not taking a stake in the blockchain companies the state has partnered with “because I want to not care who wins.” For the pilot program, only deployed military members from 24 counties in West Virginia will be eligible to vote online in next week’s midterms. But Tusk’s theory is that, if voting becomes as easy for the general public as calling an Uber, the number of people who vote will increase dramatically, and elected officials will make completely different decisions as a result.“Take an assault weapons ban,” Tusk said. “You’re a Republican Congressman from Florida, turnout is 12 percent in your primary, your district is gerrymandered, so the primary’s the general election. Of that 12 percent, half are NRA members. You probably know intellectually that people toting an AK-47 around your district is not a good idea, but you can’t risk alienating 50 percent of your primary voters.”“Now, people can vote in that same election on their phone, turnout goes from 12 percent to 60 percent, the NRA’s vote share goes from 50 percent to 10 percent, the politics flip completely,” he added.(Editor’s note: This interview was recorded before Saturday’s terror attack in Pittsburgh, where a man with an assault rifle and three handguns killed 11 people in a synagogue and wounded six others.)You can listen to Recode Decode wherever you get your podcasts, including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a lightly edited full transcript of Kara’s conversation with Bradley.Kara Swisher: Hi, I’m Kara Swisher, editor at large of Recode. You may know me as someone who thinks “House of Cards” is way too generous to politicians, but in my spare time I talk tech and you’re listening to Recode Decode from the Vox Media Podcast network. Today in the red chair is someone who has sat here before, Bradley Tusk, the CEO of Tusk Holdings. He’s a venture capitalist, the former campaign manager for Mike Bloomberg, I think he’s been governor of Ohio at one point-Bradley Tusk: Illinois, deputy governor of Illinois.Oh, okay, whatever. One of those states out there. And he’s also the author of a new book called “The Fixer: My Adventure Saving Startups from Death by Politics.” Bradley, this is such a topical topic now since we last talked. Welcome to Recode Decode.Thank you. My book may also make “House of Cards” seem generous to politicians, by comparison.  Let’s just talk, let’s get to the background, explain who you are. Last podcast, you’d worked for Uber, you’d worked for a whole bunch of stuff about regulatory issues around tech companies, that’s how we met. The things that are probably most interesting to this audience is I founded and run a venture capital fund called Tusk Ventures. We’re the only fund that, I’m aware of, that works solely at the intersection of tech and politics. So, we invest in and work with startups in regulated industries where we think that, by virtue of our work, we can really move the needle for the company.And you had worked for Mayor Bloomberg-Yeah, I’ve been Michael Bloomberg’s campaign manager, Chuck Schumer’s communications director, you’ve mentioned deputy governor of Illinois- For?... A guy named, Rod Blagojevich, who is now enjoying a 14-year jail sentence.Yeah, close for you, too.Yeah, and then started working with Uber in 2011, kind of figured out the whole strategy of how we mobilize our customers to beat the taxi industry and then broaden that into a broader venture business in 2015.And you had taken stock in these, that’s what you wanted.Yeah.But your offer to them, because before for, I guess, even Steve Case wrote that book about the Third Wave, that a lot of these new startups are in regulated industries heavily. Your thing was, “Listen, you people don’t know squat about local politics.””You don’t know shit about politics.” Yeah, right.And they didn’t like it and they didn’t want to be part of it. No, I mean the typical answer that I would get and for all of Travis’s flaws, to his credit—Travis Kalanick... Kalanick, right, ’cause we now also have Travis-He’s co-founder and ex-CEO-Of Uber.... Ousted CEO. I like to say ousted CEO.He probably wouldn’t like that as much. Yeah, too bad, that’s what happened.But he did, to his credit, understand the need to take the politics seriously. So, I’m working with him and it’s fun, ’cause these are fun fights and we’re winning, and-Super aggressive.... Value of my equity is skyrocketing, not realizing that there will probably never be one like that again. But I don’t know that, right? So thinking, hey I should do more of these, and so I would get an introduction to some founder, and I’d say, “Look, you’re in this regulated industry, here’s who, if you’re successful, you’re gonna disrupt and take market share away from.”Right, “I’m the fixer.”... “They’re gonna politically hurt you in this way, this way, and this way. I can try to stop that, and I’ll do it for equity.” Not realizing that not all equity is created equal, I didn’t know enough to know that there was a difference. And the response that I’d get consistently was, “Oh, you poor child, you don’t understand. I went to Stanford, I was in Y Combinator. John Doerr’s on my board, and when that stupid regulator sees how smart I am, I can do whatever I want.”That’s when you pop him in the face. That’s when in New York, you would pop someone in the face. Exactly. So there was a four-year period or four-and-a-half-year period from when I started working with Uber, and we took on ride-sharing around every market in the U.S., it wasn’t a small undertaking. Until when I got other startups to start working with us, and then in raising our fund, same thing, every LP says, “I want a differentiated strategy.” It turns out they mean like a different font in the deck. Like when this political guy showed up and said, “I’m gonna get access to all these deals, because these companies are gonna really need my help, and they can’t get my help without me having investment rights.” Oh, that’s too weird. And now that we are in Bird and Circle and Coinbase and Lemonade and Ro and all these companies.All right, name, name some of the companies you’re in.So, in terms of the investment fund ...How much did you raise?I raised $37 million.Which is small.Yeah. Yeah, but we are vesting ...Any Saudi money? I’ve got to ask this week.No. No Saudi money.Kuwaiti? Yemeni?No. So we were joking today ...Russian?… if you are a startup and you are desperate for money, Saudi is probably a pretty good target.Yeah, right. Yeah. If you have no soul. But move along, Bradley.Yeah, but I am assuming that ... $37 million, we invest mainly series A, sometimes C.So small?Yeah. I don’t need management fees to run my business because I have other businesses that make money. So the much bigger upside from our perspective is earlier, and it is just more fun, right?Right.So Bird, we invested in their series A, we have been working all over the country to make scooters legal.Which is the scooters. Right? Having some trouble in San Francisco.Definitely in San Francisco, but we won Miami a week ago, New York is looking good, Chicago.We will get into all these things.We are in Coinbase, we are in Circle, we are in Lem —So these are all bitcoin, I mean...Coinbase and Circle are both, yeah, exchanges for crypto. Lemonade, which is the insurance tech startup.Right.So the thing is getting them their license in every state in the US. Ro, which is a men’s health-care company that has raised a gazillion dollars. FanDuel, Nexar ...Another problematic issue about gambling.Yeah, and that is why they need us, right? Nobody needs me if you do not have problems.Right, because money is cheap everywhere.Yeah, by definition, right? There are lots of VCs that can fund something, but if you say, “I need to win this fight in 13 states, 18 cities, whatever it is ...Like a Bird.Like a Bird, like an Uber, like a FanDuel, like a Lemonade, whatever it is, then we are the only ones to do that.And you had spent your time in politics and doing all kinds of deals. So you decided to write this book, “My Adventure Saving Startups From Death by Politics.” Talk a little bit about the book, and then I want to get into specifics around Bird and these other things with the new regulatory challenges in the next session. But talk about, so you decided to do this book ...For a few reasons, one is. ..’Cause “The Fixer” is not a good image, right? The fixer is the bad guy.Not necessarily, but my editor ... you know, some different profiles have called me that, and my editor really liked the title, and when Michael Cohen started being called that we were like, “Oh, maybe we should change it?” And we were like, “Aw, fuck that guy, we are keeping our title.”Yeah. You sound like Michael Cohen.I grew up with his, his brother was my best friend growing up. I have known Michael for 40 years. I haven’t talked to him for a while.“I will fix that for you. I will take care of that.”Yeah, exactly. So, a few things. One, I actually just love to write. When I was in college I was in a writing program, like there was that moment when I decide, do I do writing or politics? I pick politics, it has worked out okay, but just the opportunity to, hey, I have still hopefully some writing ability, plus a story to tell, was enough to get people interested in the book itself. And look, we can work with, invest in a dozen startups at any given time, there’s 17,000 I think in the U.S. right now, so even though I want the ones in my portfolio to do better than the other ones, I don’t want any of them to get screwed over by like, pay-to-play politics and just entrenched interests squashing innovation.It is one thing when Facebook or Uber now or Google behaves badly. That is one thing, but when a series A company is not able to actually even compete because the casino industry or the hotel industry does not want competition, that is not cool and that is not good for anyone except them. So it was how can we help the other 16,188 startups that we can’t work with at least think about this stuff intelligently? And so the book is, the first third is my experiences in politics; the good, the bad, the ugly. So Bloomberg, Schumer, Blagojevich, all this stuff. Next third was Uber and how Travis and I figured out how to basically mobilize our customers to beat the taxi cartel. And the last third are case studies that are hopefully still entertaining to read in the form of what we did for Tesla, FanDuel, Lemonade, Handy, Eaze, and so on. And ends with my argument for this thing we are working on in my foundation, which is blockchain voting. So people can vote in elections on their phones.It has to be. It has to be on their phones. We are going to get into all of this. And you have like sections on the thing of learning about politics and so, tech people do not know politics?No, they think they do.Yes, how so? Because when I, my lasting memory is having Bill Gates down to The Washington Post when I was there, when he was, right before the monopoly thing, and I’ll never forget he said — he was in one of those editor meetings, we invited him there, and it was, oh it had to be in the 1990s sometime, like the early ’90s, and he said, “I don’t need a lobbyist in Washington, I don’t need lobbyists, I got some lobbyist up in Rockville”, like some guy. And, a federal one. And I said, “Wow, that’s really arrogant of you, because I think people are going to start getting interested in your monopoly power.”It turns out he had a few issues, didn’t he?Right! They didn’t have any lobbying presence. Just one guy, and he became a big lobbyist for them eventually as they started to hire, and all I remember is saying to him was, “You know, Washington is full of ex-student-body vice presidents with subpoena power, and it seems to me that perhaps you do need that.” And then since then, obviously they staffed up, Google staffed up, that’s on the federal level, not just on the local level.But I think there are two reasons why. So on ...But has that changed? It has changed a little bit, because I think the combination of the really big companies having so many problems right now, combined with Uber and Airbnb and other startups just having lots of high-profile fights all over the country.That are regulatory. Their businesses are regulatory.All over the country, and all over the world, has certainly raised awareness. When we were first launching our fund, I had to beg people to meet with me about taking my money, now people will call and say, “If you are on a cap table, it signals that we are taking this stuff seriously, that makes other investors happy, if you want allocation.” May or may not, but that is definitely sea a change in terms of mentality. But you still have people in tech who think they get politics, and that results in two things.One is really smart people who don’t know what they don’t know, and they assume just because they have been really successful in one walk of life, that applies to everything. And the other is, because they are rich usually, politicians kiss their ass because they want their money. Do they really care about anything other than them writing the check? No! Not in the slightest. But you have to pretend. So they get asked, “What is your view on health care, and education, and energy policy, and all of these things”, that go in one ear and out of the other. Some staffer will pretend to take notes in the background, but it makes them feel like A, they know stuff, and B, oh I have all the access in the world because Chuck Schumer is my good friend.He is not your good friend. He is just a guy raising a shit ton of money. Right, right. But they misunderstand that all of the time.They misunderstand that. So how, have they gotten smarter, has tech gotten smarter? Because you know Google is one of the biggest lobbyists in Washington, just the way the TV industry had that, just the way everyone else ...I think I would argue that you have to sort of answer that question in two parts. There are startups and there is tech. Right. Because tech are the biggest companies in the world, so like every massive company is going to automatically get into lots of regulated issues and need, get lots of scrutiny.But this is an issue largely unregulated, which we will talk about.Had been, yeah. But now they are starting to get into places that are about to change.Right.And that is different from startups, which is where we tend to focus. Which is, by the way, most of the regulation, that tends to be the municipal and state level. And that is more around entrepreneur either has this new idea that is not covered in law, because if the bureaucrats could have thought of that they would be entrepreneurs and not bureaucrats. They start getting a little traction, a little market share, the entrenched interest does not like the competition, petition their campaign donors to the governor, the mayor, whoever it is. Right.They lean on them to lean on the regulators who say, tell them this is not allowed, and then we have to come in, beat up the entranced interest, and make sure the law is okay.Right. So that is different.So that is really different, and it fits a couple of different things, right. You have your Googles of the world, or Facebooks that were created in these frictionless environments. In some ways on the early end, it was much easier for them because they did not have to, there is no, there was not “big search” before Google, right?Right, right exactly. They were in sort of green fields.Yeah. Well, there was media.There was media, but they, media, mishandled it for a very long time. So they were able to get really big without dealing with that many political problems. The turning point was when Josh Hawley, who will hopefully lose his senate bid in Missouri.I don’t think so.Hopefully lose. I’m saying I don’t think he will lose, I just am going to hope he loses. He was attorney general, still is the attorney general, in Missouri.A bad Attorney General.He filed, about a year and a half ago, an antitrust suit against Google. And the reason that was so amazing, the Attorney General of Missouri has no jurisdiction over this! But, his polling clearly said, and he was running for Senate, more of your constituents and voters are anti-Google then pro-Google. That went from a world where say “don’t be evil” and everyone would applaud, to now you have local politicians saying, Google is underwater in their approval ratings, I am going to go after them, right?That is different than the startup in transportation, in hospitality, energy. Like Bird or Airbnb, or FanDuel, or Lemonade. All of these companies that are basically tweaking the existing industries and are trying to make them a little better.Like Airbnb with the hotels or...Right, the way that ...Bird with people like sidewalks.Care/of, offering you know drugs, prescription drugs or supplements online. Yeah, exactly. So they are dealing with a different set of regulators, and usually the motives early on are entrenched interests who do not want competition, as opposed to..Or citizens that don’t like..Sometimes, yeah. It depends on what he issue is. As opposed to the stuff we are seeing in Washington right now which are, holy shit these companies got so big, so fast, now we have real concerns about market power and antitrust and privacy and these things we have to deal with it. I guess maybe because most of my investments tend to focus on not just startups, but earlier stage startups, I don’t want them quite frankly facing the techlash. I don’t want them getting lumped in ...Which it is, techlash.Yeah. I don’t want them lumped in with Facebook and Twitter.But they are, they are.They are sometimes, and that makes my job harder. So one of the things you do, in this book, you go through ideas about politics. “It turns out you can fight city hall, pick your narrative before someone else does, subtlety died long before Twitter, people want to be led, it is all fun and games.” So the idea is trying to teach people politics, right? Yeah in a fun way. I hope you buy the book, but if you don’t...Well you gave it to me.The listener. The one-lesson take away from this is 99.9 percent of politicians are desperately insecure, self-loathing people who cannot ... Thank you Bradley, we got that.Yeah. Who can’t live without the validation of holding office. The attention they get in that job is like oxygen for you or me. We can’t live without oxygen. They can’t live without it. Which means, all of their decisions are going to be very logical, in the sense of, “Does this help me win my next election, or not?” Whatever you want them to do or not do has to be framed in that context or they are not going to care. It does not matter how moral you are, or how right your issue is, or how many puppies you are going to save.I am thinking of the homeless issue right now in San Francisco, [Proposition] C. Yeah, well look at that issue.Well there is a lot of tech people fighting.Fighting there on both sides of that one. But ultimately the day to day would be enough people who do vote are frustrated and upset by the amount of homeless on the streets and they say, do something. And that leads to people taking action to … interestingly, the mayor in this case, has actually said this is not the right way to go, which is, I have not studied the issue that closely, but it is kind of admirable for a politician to do that.“I want to tax rich people,” yeah.This is, this would be an easy solution to show the voters that I did something, but it is not going to work so therefore I am not going to do it.So, back to your thing.So if I am listening to this podcast, and I am a startup I am trying to figure out, how am I going to navigate the regulatory environment, whatever your issue is, if you are going to disrupt anyone in political power, they are going to come after you. They do not thank you for your disruption. They don’t say, “It is so wonderful that you are so innovative.” They will punch you in the nose as hard as they can. And the politicians that they donate money to, it is in their interest to take care of their donors, unless you make it so unpalatable and so uncomfortable that they can’t afford to do it.Right. The reason why we win these Uber fights would be a city council member who wins his or her seat with 9,000 votes, all of a sudden getting 14,000 emails from constituents in the district saying, “Don’t do this.” “Okay, I am not going to do this.” So if you can’t figure out how to frame your issue in that context, you have a really big problem.You are splitting it between local and sort of national and stuff like that. I want to go through some of these things. I want to start with local, so that we can figure out where that is going, because a lot of these fights are local now, and statewide. But then they morph into national. Because for example, California has passed a lot of laws, and I think Gavin Newsom is going to run a country, a separate country and run it as if, you know what I mean, if he becomes governor.He’s going to become governor.But California already is out front on privacy regulation, out front on energy, out front on all kinds of issues. Especially big tech, diversity, net neutrality, and stuff like that. So I want to talk about the local thing first and then in the end talk about sort of where we are nationally, because I do think big regulation is coming for tech as we move along. Let’s start though with the local stuff. So you, right now a lot of these companies, like Airbnb and Uber, and now Bird, which is a scooter company, and the others, Lime and Skip, and what else is there? There are so many of them, multi-billion dollar valuations for these things. Uber is investing in them and stuff like that. So talk a little bit about where we are on those. Talk about your experience with Bird, for example.So it is really interesting because Bird, the easy narrative for people is to say Bird is Uber 2.0. Both really, really fast-growing companies, both CEOs named Travis, the Travis at Bird worked at Uber. The reality is, in some ways they are similar but in many ways, they are different. So my vantage point is the political and regulatory strategy around legalization in different markets. With Uber, it was pretty much an all beg for forgiveness approach.So when he would go in and make trouble, like, I was just thinking the other day. Someone was saying, every company that’s been successful has broken rules and then they clean up afterwards. Facebook, Google...If Uber didn’t take the path, I believe, it’s my strategy, so of course I am defending them. If we did not take the path that we took, there wouldn’t be an Uber together. “Remember that thing, it was kind of a cool idea that did not make it?” Taxi was so politically powerful, that the only way to beat them was with real people. And they only way to get real people was to launch and gain some market share, and then mobilize them. So that was the only conceivable strategy. It is different with Bird because there is no big scooter. We are not really disrupting anybody.Well, yes, go ahead.And the issues that are involved, in fairness to the regulators, are legitimate public policy issues. Should we be on the sidewalk or the bike lane, on the street? Helmets? Insurance? I mean, they’re fair questions, right?Right. We can go through any of them. Where should you be located?All of it. Yeah, where should you be located? Where should you charge them? Where can you park them? Where should you ride them? Should a helmet be mandatory? Age minimums, all of that stuff. Fair questions, right?Mm-hmm.There are jurisdictions where the law in no way prohibits scooters. In those cases, there’s no reason to not launch and kinda work through that stuff-Right.With the local regulators.So do you dump them on the streets? In some places, and then in other places like here in New York, the law clearly does not allow it, and we’re working with the city council right now, legislation that’ll be introduced shortly ...Yeah, there’s no scooters. It’s weird.Not yet. My office. Those are the only ones.Yeah, I know. It’s weird to not. Like in DC, I use them all the time.Yeah. They’ll be here soon. My hope is that by the end of this calendar year, we pass it.Right.But Chicago, Philly, Boston, Seattle, they’re still not even there. Right? We just passed Miami. Bird isn’t, but the others are.The others are.Yeah, I wanna talk about why certain ones are getting picked.Yeah, so, but ultimately, it’s a different process because you don’t necessarily have to beg for forgiveness because there are places where-There’s no laws.Yeah, there’s no laws, or they’ll just say, “Look, we’re not opposed to this, but these are valid public policy questions. Let’s figure it out.” Right? And to Bird’s credit a lot of what we’ve been tasked with is, “Okay, go figure it out with Chicago. Go figure it out with Seattle. Go figure it out with New York.” Right, but initially they’d been dumped. They did. That was a little bit before we got involved.Right.And it was more of the original Uber strategy.Right.Of just dumping.Like 300 scooters on the corner.And the backlash led to at least one kind of at least temporary ban, which was in San Francisco where Bird right now doesn’t operate. The city gave out some permits, picked a couple of winners, and Bird was not one of them. Now, San Francisco, I mean, you’ll either totally agree or disagree with this, but it’s almost a two-part thing if you’re a startup trying to enter that market compared to every other market. So part of it is, it’s a reasonably big city, but the Bay Area is really where the heft is. It’s not so much the city itself.So it’s less about market share and opportunity. It’s more around media and VCs, senior product, and get interested. And Bird doesn’t have an exposure problem, right?Right. Everybody in the tech world knows Bird. What they have now is a city of 800,000 people that they can’t operate in.Right. An important city.Yeah, and important city. Now, it’ll come back because it is too important to ignore, but it’s such a big world out there that right now, there’s so much to do, and what’s interesting is, I believe that scooter adoption internationally is gonna be a lot easier than ride sharing adoption internationally was.Okay.Because ... the rest of the world is less car-centric than the US. The rest of the world is already used to different ways to get from point A to point B, whether it’s a bike or a rickshaw. I mean, right before I invested in Bird, I happened to be in Tel Aviv, and these people were scooting by me on e-bikes, and I was like, “Oh, this could probably cut down some traffic in Manhattan.” So I think in a weird way, it makes more sense, and it’s more intuitive to the rest of the world. So ... we’ll get to a lot of other markets a lot faster, and we’re already in parts...So you don’t have to do your ... Not quite the same.Bossy ...It’s a difference that ... yeah, look. There are, in any given cases, people who are unreasonable and will we mobilize 10,000 customers to speak out on behalf of the bill? Absolutely. Totally.Right.Totally we can do that.And the other issues along with scooters are obviously safety ...Yep.Helmets.Yep.Deaths. There was just a death in DC.Yep. Lime.With Lime, not Bird. Well, I’ve used all of the scooters in DC. There’s just two there, it seems like. It’s Lime and ...Lime and us and honestly I’m not sure if there’s anyone else or not. I didn’t notice it. I didn’t see Skip. They haven’t entered there. But as you have these issues and they come up, this is going to be something that’s going to be a continual regulatory ...Yeah.As people aren’t anticipating what could happen with these things.No, and it’s also why I think we need to be able to have pretty good relationships with the regulators, so I don’t think it’s a slash-and-burn strategy here.Right. There are other times where it’s just an existential ... Lemonade, for example. We-This is an insurance, explain Lemonade.This is an insurance startup. It’s grown incredibly fast, and it provides property and casualty insurance online, and effectively, if you have no offices, no brokers, no agents, no Super Bowl ads, and really good tech, you can offer people a much better product for much less.Mm-hmm.Which is what Lemonade does.Right.So it’s doing insanely well.Right.Because lots of people, and the same way that people had never really just used Taxi World instead of using UberX, people who just never bothered to get renters’ insurance, now are because they can get it for $5 or $10 a month, and they can get it on an app in three minutes.Right.Lemonade also, by the way, doesn’t investigate fraud. They just pay out the claims, so it just makes life a lot easier for everyone all around.So ... but you can’t sell insurance without a license, and it’s not one of these, “Maybe I can beg for forgiveness. I can interpret the statute this way.”Right, no.You can’t do it.Right.And you can’t really launch an insurance company in the US without being able to sell in New York.Right.Because it’s the financial capital of the world. Right.And in this case, the regulators in the state department of financial services, were just in a very kind of bureaucratic way saying, “You’ll launch when I say so, and if this is at the bottom of my desk, and I don’t get to it for nine months, that’s your problem. There’s nothing you can do about it because I’m the one in charge.”Which worked until Lemonade hired us, and we invested and took equity, and then all of a sudden, we shifted the decision-making from the agency to the governor’s office, made it a political issue for the governor. Eventually, I had to sort of call over there and say, “Look. Front page of tomorrow’s Wall Street Journal is gonna say one of two things: ‘Hot, great insurance startup leaves New York because of corruption and bureaucracy,’ or ‘Low-cost insurance launches in New York thanks to governor’. You guys pick.”Oh, do you really make calls like that, Bradley? Sometimes.Sometimes.We got our license-”’Cause I can run the Wall Street Journal!”You know.”I got it dialed in over there.”There’s a reason why sometimes a high-profile attack - it helps you hit other campaigns where you actually don’t have to attack because they just know that you can or you will, right? So that’s insurance.Yep.And then another local one. FanDuel.FanDuel. Right. Explain what they do.So FanDuel right now is a fantasy sports platform. People can pick lineups.Right.And bet based on skill, money, on that.Right. And betting has been a big issue.Always, because there’s a lot of money. It’s always politically controversial. It tends to be not liked by both the far left and the far right for different reasons but still not liked.So FanDuel and DraftKings both kind of just launched, and they grew into really big businesses really fast, didn’t really deal with any of the political ramifications of what they actually needed in terms of licenses or permits or laws or anything else, and then all of a sudden, the Times publishes this story in October of 2015 saying, effectively charging that there’s insider trading, DraftKings employees using proprietary information to win money on the FanDuel site.Right. Right. That actually turned out to not be true, but it just set off this shitstorm, right? Yes.All of a sudden, attorney generals from all over the U.S. are investigating, states left and right are popping legislation saying, “We’re gonna ban FanDuel. We’re gonna ban DraftKings,” and we had to go run campaigns in over 20 states to legalize the product.Luckily, fantasy sports is one of those things that regular people who do play it really care about it.Like it. Right.Yeah.And who like it.So these bros who love fantasy football, not only do they not know who their state rep is, they might not know there’s even such a thing as a state rep, right?Right.But when it was like, “Look, if you wanna keep playing this thing, you gotta send this email. You gotta tweet,” they did. So we were able to legalize it, but what’s interesting now is the Supreme Court in May overturned a local past vote with prohibited the states from conducting their own sports betting.So now, every state can decide for itself whether or not it wants to do sports betting.Right.Which means you’re gonna have this free-for-all battle royale in every state capital now for the next couple of years for who gets those licenses.And who gets the licenses, and also people who are against it because there’s a big constituency that’s against it.Yeah, you’re gonna have states like New York — actually, this is probably way too policy-esoteric, but ... the blue states that got screwed over in the Trump tax bill by the elimination of the SALT deduction are really gonna need revenue, so all of a sudden, things like sports betting or recreational cannabis are gonna be really appealing to them.Right, we’ll get to marijuana in a second.Because it’s a way to generate revenue without having to tax regular people, so it’s politically safer and easier, so that, I think will carry the day in those states.I think in red states where A, there’s a bigger kind of Christian-right presence politically and B, they didn’t get screwed over in the tax bill in the first place, it’s gonna go a lot slower. So like, Texas is still gonna be years away.Right.But New York, Illinois-And they’re willing to forgo this.Totally. Because the political pain there will be greater than the political benefit of the income that would bring.Right.It’s just a calculation, but that’s the calculation, whereas New York, Illinois, constituents don’t really care.Right.But they don’t wanna have services cut or pay more taxes, so whether it’s Cuomo in New York or it’s gonna be Pritzker in Illinois, they’re gonna do this. Right. So you moved over to cannabis too.Yes.’Cause that’s another. So betting cannabis. This is another-Yeah, totally local.Except that Jeff Sessions keeps, that little goblin keeps weighing in.Yeah, it’s a really fascinating issue. So we’re in a company called Eaze, which for those of you in California know it, it’s Uber for weed. It’s literally on-demand weed.Right.You scan your driver’s license.Call it, you bring it.And they bring it to you in five minutes.There’s marijuana everywhere in California, so there’s nowhere you can’t get it.Yeah, I’ve noticed that. So, but even when California legalized recreational ...And Colorado had before, and Oregon, is that right? Yep, and Washington state.Washington state.Alaska. But the decision to allow delivery is a local decision, a municipal decision, not a state decision.And explain how local works. You put in your driver’s license ... Yep, you put in your driver’s license, and you answer a couple of questions, and then assuming that they scan it and check it against the database, and if you’re approved, then they can deliver you cannabis.Right.And it’s drivers, not unlike-Right. And you go to a dispensary and get it.Any other product. Yeah. They get it, and they bring it to you.They don’t hold the inventory, right?No. They’re just moving it from point A to point B.Right. Right. Yeah.And you’re paying on a credit card, so they’re not walking around with lots of cash, either.Right. And ... the decision whether to allow that in any given jurisdiction, at least in California, is a municipal decision, so we had to run campaigns in LA, San Jose, all of these different markets to allow delivery in the first place, so it couldn’t be more local.What’s really interesting about this issue, or least for people like me is, you have this incredible juxtaposition where it’s everywhere in California, it’s legal on every different level, and yet federally, it’s still completely illegal, right? Cannabis is a Schedule 1 drug, which is like heroin or cocaine. I mean, from a VC standpoint, it makes investing in the sector, I would argue, a little tricky because ... we’re allowed to invest in whatever we want, but we don’t have that much institutional money ‘cause we’re a relatively small, early stage fund, but if you are a big venture fund, and you have a lot of pension money and endowment money, you’re not allowed to invest in cannabis because it’s still illegal federally, right? And the Indiana teachers’ retirement system doesn’t want you doing it, and they’ve given you $100 million or whatever it is. But what it means is, there’s less liquidity, less money from VCs to go into cannabis tech than other sectors, which means the ability to lose money while you’re scaling is a lot less than it is for say Bird, right? You can just put scooters everywhere, and it doesn’t really matter. Right.And people can negotiate much better terms because there’s fewer-What’s the challenge locally with these as you move in? ‘Cause the states, there’s more and more recreational use...The states are gonna keep going. I think you’ll see another half a dozen states in 2019.Which ones are coming? New Jersey, New York, Illinois, Connecticut ...Sounds like Democratic states.Ohio ... yeah, it’s the states that are gonna lose a ton of money in the SALT deduction that was removed from the federal tax bill, they’ve gotta make it up somewhere.Right.So-And they’re states that would.And the people and the voters are there.They’re the first pro-gay states, they’re the first...Yeah. I mean, the views on this thing have evolved so much that it basically polls 2-to-1 nationally now.Right.So, states have to decide now whether to allow it recreationally or medicinally, but I think, you know.And then ... the issue of delivery will be different everywhere, right?Right. Right.In some states, they’ll say, “You know what? We need to throw a bone to all the local mayors. We’ll give them the power to decide this, and they can wrench concessions or whatever we need out of the delivery companies.”Right.Other places, it’ll be included in the statewide legislation.Right.So it’s kinda like ... sports betting or eSports or a lot of these kinda new sectors, autonomous. It’s gonna take on a totally different patchwork regulatory system.And then there’s one more local issue I wanna talk about, which is like this was happening in San Francisco and homelessness, is that tech companies living there and whether the cities acquiesce to them too much. It’s like what Bezos is doing in the Amazon Headquarter fight, and stuff like that, and whether mayors are too - like there was a whole Ed Lee, who had died, was considered in the pocket of tech and stuff like that. Yep.And whether these very wealthy people should be getting these breaks or what they should do to contribute to the fabric of the city. And right now, there’s a fight in San Francisco over homelessness and there’s many sides, as to whether they should tax these businesses, which are big employers.Yep. In San Francisco, for example. That’s just a good example of it.Yeah. I mean, look. It’s a tough issue ‘cause in some ways, cities bend over backwards to accommodate tech because ...Anything.They want the job creation and they want - or by the way, you’re right, anyone.Right.Politically, nothing better than a car plant.Right, yeah.That’s a million times better than a startup.Right.Or even a big Facebook office or something like that.Right.Politicians will spend taxpayer money in different ways to be able to have the announcement that they just created 2,000 jobs.Right.Or whatever it is.Right.So, I mean, that’s been true throughout time. That’s still true. I think, to me, the real challenge is, tech often lives in isolation in these cities. They’re kinda walled off.Right.And as a result, they’re not part of the discussion, right? So ... take like Aaron Peskin, who’s a really well-known supervisor in San Francisco and leads a lot of the kind of anti-tech legislation.He does. He’s exhausting.But one of the things about-Aaron Peskin, you’re exhausting.Yeah, but for his politics, the people who vote in a board of supervisors primary are not tech employees, right? They’re people who’ve been in that district for 40 years.And they’re sick of their rents going up.They’re sick of their rents going up, they’re being priced out, so it’s good politics for him to lead those issues, and if tech wanted to A, stop the Aaron Peskins of the world, and B, be more integrated into the decision-making, so you’re not either the hero or the villain at all times, you gotta get more engaged, right?If you’re a big startup in San Francisco, you are crazy on primary day not to basically tell everyone, “No one comes in ‘til noon because I need you all to go vote.” Right.Right. You are crazy not to try to put your people on community boards. You have to be able to start integrating, so if you plan to be in this city, your ability to either protect yourself politically, advocate for yourself, or get fucked politically is totally based on how engaged in the system you are, and this sort of arrogant notion of, “Well, I’m saving the world, so therefore I don’t have to do anything else ... “Or I’m sitting up in my airy with my fantastic food ...Doesn’t work.Below, the streets are disgusting, and I’ve caused damage.It doesn’t work. I mean you had the column a couple weeks ago, where you talked about the Chief Ethics Officer for tech companies.Right. This week. Yep.This week, yep. And ... I would love to see that. You could even take it a step below and just say, “How about a VP for Common Sense?” Right? We have all these people living on the street, and we’re bringing in these massive, expensive, catered meals. It looks fucking awful. We’ve gotta do something about this problem.Right.And that might be that we’re gonna do a big Meals on Wheels thing, or we’re gonna-Well it’s only Benioff who’s done that.He’s been great. Yeah, he’s been terrific.And pissed off the others too, the switching.Yeah, I noticed the fighting. Yeah.Well, he changed his mind. It was interesting. I had so many discussions with others. He was against Proposition C, which was this homeless fundraising initiative, and in the emails, I have emails where he’s saying he’s against it, and then he changes his mind.Now he’s for it.And he’s for it, and what was great is they were, the people who were mad at him about it were like, “Well he was against it, and now he’s for it.” And I’m like, “Mm-hmm.” What made him change his mind? Oh, he’s saying it was ‘cause of “Ancient Aliens.” We have a joke. But no, he said he read some stuff, and he just decided there wasn’t a better option, that we needed to do something now.Fair enough.You know what I mean? Yeah.And what was great about him is he goes, “Well, I was against it ‘til I was for it. So what?” And then they were like, “Uh ... well, you can’t do that.” I’m like, “I think you kinda can.”And especially in politics and government, you cannot let the perfect be the enemy of the good.I think that he was... I think issue is, he went against London Breed, who is the new mayor there.Yeah. Yeah.And she wasn’t for it, which, you’re right. Why not take money from rich people? Which she doesn’t want ‘cause she doesn’t think it’s ... it’s a problematic legislation, but I think it’s trying to deal with an issue that is massive in San Francisco.So just summing up local, so people should be involved if you’re in tech, whatever, you’re in Austin or you’re in Santa Monica or-Look, if you were a total ... ironically, Salesforce is basically a B2B company that’s not that regulated and yet they are heavily engaged with the community.Yeah.If you’re working in an industry that just never gonna touch regulation at all, I guess do what you want, but the vast majority of companies are regulated either directly or indirectly, and the optics and the narrative that you have around your company has a huge impact on the regulations you then face, and you’ve gotta be mindful of all that.We’re here with Bradley Tusk. He has written a new book. He’s been in the swamp for so long, right?Yeah.You’re a swamp monster?I’m dripping wet.Dripping wet. His new book is called “The Fixer: My Adventure Saving Startups From Death by Politics” That’s very dramatic, Bradley.My editor came up with it. It’s a good one.Yeah, that’s good. It’s good. And you got like, so national politics. Right now, we’re heading into the midterm elections. Give me your predictions, please. I need everything-Despite this talk in the last week or so of a resurgent red wave, I still think the math means that that Democrats take the House. Maybe with less of a majority than they expected-They just need 23, so they get 24. Who cares? Something like that. Yeah. Right.24 will give them-The Senate’s not going to be there. It’s funny because like, if you take Beto for example. Really exciting candidate, my wife’s from Austin, her family lives there. I kept saying, “No, no, no, he can’t win, he can’t win. I understand politics. He can’t win.” And then eventually, because he’s like the most popular guy, like in Manhattan or in San Francisco too-Well, he’s gotten close. I’ll tell you he’s gotten ... He’s pretty good.But it’s always been like 8 points or something like, in reality, if you look at certain internals, those are hard races to win which means, given the map this year, the Senate Republicans in a normal year should have increased the majority by five or six seats. I think they may stay flat or increase it by say two or three seats. It’s actually not a bad outcome for the Democrats, considering-And the governors are picking up a lot on-The governors, you’re going to pick up a lot, and you have-That’s the worst. -in some ways, like in Florida...Losing Governors is more important, I think.I mean, look, having worked in the Senate and having been a deputy governor of a big state, it is far more important running the state. You have far more responsibility, far more power, far more everything. You actually can’t declare war, but short of that-California might.Texas seems to want to do that any time. There’s all these people in California who want to break free. It’s kind of funny. I was like, “We’re going to need a lot more guns. We’re going to need a lot more guns.”This is a somewhat depressing scenario, but you could see a world one day where we’re multiple countries and not one. You know where it’s some version of the EU, with some shared infrastructure. But ultimately you can say-“California: We’re going to take all our fantastic fruits and vegetables, and screw you.”If people-We want gay people to be happy.They’ll trade and start putting tariffs on it, but ultimately, let’s say that you are pro-life and you truly believe abortion is murder, I understand that you’re fighting hard for that position, right? I don’t agree with it, but I get it. I don’t really see why people need to have guns, but my wife’s a Texan and her family feels very differently about that so, you could say a world where people say “we just agree so strongly on so many threshold fundamental issues, we’re just going to make our own laws, kind of how California’s doing already, govern ourselves. We’ll defend each other if there’s an attack. We’ll trade with each other, we’ll share highways and things like that, but fundamentally, we’re our own deal.”That’s where we are now, Bradley. We’re in name only. But there’s not going to be three Californias and things like that. Not yet.Not yet. We’ll see. But I do think California’s going to operate like its own country soon. It already is.I think Newsom certainly has that vision in mind.He’s got a lot of ideas about employment, he’s got a lot of...You know what, there’s no point in being in government to maintain the status quo. Anybody can do nothing. If you’re going to take the time, and take all the arrows and slings involved-I’m good with, hey, he did gay marriage. He went out front way before anyone else and that’s leadership. It’s called leadership.You’ve got to do stuff, right.So let’s talk nationally. So where are we nationally with the big, you know if you were advising Facebook or Google. I think those are the ones in the crosshairs, those two. Well, the most, right.And Apple’s not really, Microsoft’s not really. But they’re getting pulled into it-They’re getting dragged in.And they’re furious about it. They’re like, “they’re like, having unprotected sex and we’re getting the clap, essentially.” They would use that metaphor. I’ve heard it. “We don’t want the clap! We’re not promiscuous like they are!”So if I were Facebook, I mean it seems to me when you watch the Zuckerberg hearings, what I found infuriating was, they both maintained, both him and the senators, just maintained this ridiculous fiction where they both clung to a version of reality that everyone knows isn’t true, right? So Zuckerberg says, “Oh, you can have all of your cat photos, and keep up with your eighth grade friends, and we’re still going to respect your privacy and protect your data and everything else.” That’s absolutely not true because definitionally, the reason someone would buy a share of stock in Facebook is in return for being able to get the cat photos, you are agreeing to provide data that could be monetized. That’s the whole underlying business model.Although they don’t explain that explicitly. But yes, go ahead.No but that’s what it is, right? But they sell everything. Like they would sell your shoes if they could.For sure. But they don’t admit that, which I actually think people are able to understand the truth a lot better. And the senators on the flip side were like, “Oh you should be able to get everything you want from Facebook and have nothing monetized!” Also impossible, that’s not capitalism, right? And I really think the American people are able to handle the truth and just say, “This is what it costs to go on Facebook, in terms of being monetized, in terms of privacy, here’s the risk, here’s the reward. You decide.” And I honestly think that if Facebook said, “This is who we are, we’ve invented something that we think’s pretty great, but it’s brand-new so there’s lots of unknown consequences.” And said to the government, “Let’s sit down together and just try to work through all this stuff. Because we have ideas, you have ideas.”Like they would with the mayor or-Yeah, and just do that, work with Congress, with the FTC. That’s what I would do.Here’s the problem. They act like they’re running it well and they’re not running it well. I think they just run it badly. The company.They have leaks everywhere. They’ve been lazy in management. All these companies, they’ve been sloppy.But they don’t even need to pretend that they have all the answers, right? It would be-No of course not. But they’ve resisted it completely, there’s no-I know but I don’t think anyone would think worse of them--well, because of the Communications Decency Act, the original sin, which is section 230 where they get broad immunity, so why would you clean up the ...This gets back to the other conversation around common sense.… oil spill when you’re immune to the oil spill?Because common sense, ultimately ... There’s a quote from Pericles, “Just because you don’t take an interest in politics doesn’t mean politics won’t take an interest in you.” And that’s what’s happening right now, so they are far better off even at this late stage saying, “There’s so much we don’t know and so much you don’t know, let’s sit down together and figure it out.” They’re far better off having a seat at the table than resisting, resisting, resisting until they lose.Well, they kind of did that, like some of the congressmen was like, “What do you want to do, Mark Zuckerberg?” I’m like, “Let’s not ask Mark today! Let’s find some experts to look at this business.”Yeah, but there should be a real process, right? And there should be-So what do you imagine’s gonna happen?I don’t think either side will do that. Because that would be way too logical so it’s not going to happen. So I think Facebook will keep off skating and keep acting like they’re doing everything right when-No they aren’t now, they are saying “I’m sorry,” it’s like the annual-Sometimes the polls say to do that.It’s the weekly “I’m sorry.”And I think for as long as the polls say that Facebook’s unpopular, the politicians are just gonna go after them, because that makes good politics.Right, which they do. Which those polls do.Yep. And then you’re going to have a divided Congress, most likely, and a crazy White House. And unless the FTC or some agency brings an action-Well they don’t have power. That’s one of the issues in this internet bill of rights is giving the FTC more regulatory power.Right. Maybe DOJ has some jurisdiction in different ways, but unless that happens, my guess is if you’re Facebook, you have two paths. You could just bottle shit up for as long as possible, deny reality, and just keep making as much money as you can. Or you can say, “At some point reality’s going to set in, we’re going to have to deal with this stuff. Why don’t we get ahead of it, try to deal with it now. And bring in the agencies, both parties, the advocates, the experts, the professors, all around one table? It’s going to be a brutal, painful, slow process. But at least we’re actually trying to do something.”Can enact some laws around privacy?Yeah, absolutely. You’re going to end up with it.Like a national privacy law versus the one in California, which is the most stringent.Right, and then ultimately California might end up driving a lot of it anyway because companies don’t want to have to live by two sets of standards within the US, right?So, if I were Facebook, I would be a lot more proactive about it, both because I think you would get to the better result, and I think also the optics and politics for you along the way-Do you think they’ve been smart?No, not really. I just think that they think, and politicians think, that most people are stupid. And I think people are a lot smarter than they get credit for.What about Google?Google’s interesting right, because it doesn’t have quite the same fallibility as Facebook, right? They’ve made so many of the mistakes, but they still have this fake news stuff, the bot stuff.They have issues. There’s two things, right, there’s the issues around things like fake news and privacy and bots-Their “conservative bias,” anti-Yeah ,and that’s all, again I would do the Facebook answer there and say, “Let’s work proactively with the government to try to figure out what to do about this.” Because these are new issues and we don’t know the answers, either. Antitrust is a different question. They very well-We’re getting to Amazon in a minute. But I want to give the fake news, because it has political elements, right?Yeah, for sure. But if you’re Google, I mean maybe they’re so smart that they know the exact answer and they’re just not telling us. But my guess is they have no fucking idea. And so as a result, why not just admit that and be part of a process to try to figure out the right solutions?So you’re advocating they get ahead of it, right?That’s what I would do.It seems to have gone too far, I think the Democrats are out for blood. Now.For now-For the Russia thing, for-Yeah. But there can be...They’ll get over it.Yeah, they’ll get over it. You can pay your pound of flesh, but still long term, it’s a lot bigger-And lastly, Amazon. Because that’s local and federal, and global.Well it’s funny because they’re the darling locally, at least until they tell which cities, all the other ones are not going to get HQ.Yeah I know, that’s what Scott Galloway said, there’s going to be 140 other cities that are pissed at them.Yeah exactly. But until that moment, they are the darling of cities, they have all kinds of local issues, like for example, can they start delivering with drones? Or whatever it is. And then on the federal level, they’ve got antitrust. I think one brilliant, of many brilliant things that Jeff Bezos did, is in buying the Washington Post. Whether he meant to do this or not, he made the enemy of my enemy your friend. So, people who would normally be very anti-Amazon because they are this insanely powerful giant company with massive market power, hate Trump, and the Washington Post is one of the two newspapers that’s sort of been most aggressive in exposing Trump. And because Bezos owns the Washington Post, I think he actually gets a huge amount of protection from that. Because he gets credit for that. He has a team of investigative journalists who can be helpful. If I were Zuckerberg, I would be looking to buy every newspaper I could right now.“Let me buy the New York Times.” It’s not for sale.It doesn’t matter now much it makes or loses. It’s not the point.He’s not that smart. Bezos is brilliant.I mean, if anyone understood that on the front end, it was probably him.And he doesn’t say much, either, that’s the ...That’s even smarter.You know what I mean, he stays away and he doesn’t engage and he doesn’t appear.Yeah. And he doesn’t have nearly as many political problems.I’m amazed he hasn’t been summoned to Congress. But he hasn’t.Not yet.Not yet. It’ll be interesting to see if he does. I don’t think they, Democrats are-If he does, I bet he will handle it reasonably well. Like everything he’s done-Of course because he’s an actual adult. Yeah, everything he’s done indicates that he will.So I want to finish up talking about some of these things. I love your headlines. My favorite is, “pick your enemies = win your battles. Strangle the baby in the crib.” I don’t even know what that means, but it sounds like a haiku.It’s actually a chapter about Anthony Weiner, keeping him out of the mayor’s race in 2009.But I like, it sounds like a haiku of politics that I love. But you were talking about the biggest disruption fight of them all. I want to finish on that really quickly. What, politics?So, in my work in politics and tech, I’ve reached three conclusions. One I’ve already mentioned here, which is: I believe all political outputs are driven by the inputs. So every decision a politician makes is solely based on the ability to keep their job and nothing else.Number two, what I learned with Uber and FanDuel and Bird, now, is, if you give people the ability to advocate politically on their phone, they will do so. The same people who would never vote in a primary, probably don’t know what primary day is, are far more likely...By the way, I’ve had them acting on behalf of for-profit companies! Gambling companies, in some cases. But nonetheless, they care about whatever it is-Hacktivism. Hashtag, right?Yeah, and they’re willing to do it. So that’s number two, and then number three is: blockchain, for everything we can tell right now, is dramatically safer than any other way to transmit data from point A to point B. It’s certainly safer than the way elections, I think about campaigns that I ran, like in ’09 … I mean, do you know a New York City campaign works, at the end of the day? At 9:00 at night, the polls close, and some poll worker calls into central headquarters in Queens and says, “Bloomberg 232, Ferrer 119,” and that’s it! That’s the vote! Right? Could be anything. So the system we have right now-Could be lying.-it’s disaster! So, if you take those three pieces-Ron Wyden talks about this a lot. Yeah, he’s right, so you take the three pieces. It leads to the fact that there may be a way to provide people the ability to vote in elections on their phones over the blockchain. So, what I’m trying to do right now is just gain some proof of concept. So, West Virginia was the first state to do it. They did it in their primary in May, they’re doing it again in their general election now. It’s for deployed military.The Republicans aren’t going to like this, because poor people have phones.What’s interesting is in this case, to his great credit, the Secretary of State of West Virginia is a Republican. He was in the military, all four of his kids were in the military. And he was offended by the notion of these people who are putting their lives on the line for our right to vote, their votes never count, right? If you mail it from Kandahar, it’s like a month later. So, we teamed up together. I paid for the costs for the state to administer the election, so we avoided all the RFP-type issues. And it’s expanded from two counties in the primary to 24 counties in the general. We’re now talking to lots of different states. Seems like Colorado is the most likely next candidate to do municipal elections next year. And my hope is over the next couple of years, is to prove this thing can work. I’m not an investor in any of the underlying companies because I want to not care who wins, right? So why is this important to you?Because it’s the only way to fix democracy. Take an assault weapons ban. You’re a Republican Congressman from Florida, turnout is 12 percent in your primary, your district is gerrymandered-Shitty turnout.Yeah. And your district is gerrymandered, so the primary’s the general election. Of that 12 percent, half are NRA members. You probably know intellectually that people toting an AK-47 around your district is not a good idea, but you can’t risk alienating 50 percent of your primary voters. Now, people can vote in that same election on their phone, turnout goes from 12 percent to 60 percent, the NRA’s vote share goes from 50 percent to 10 percent, the politics flip completely. And then it would make no sense to not be for an assault weapons ban. So I don’t think that we can solve any of these issues, because fundamentally, primary turnout is so low-It’s a big idea, Bradley, it is a big idea.Yeah, it’s going to take a long time but, you know-Years are go-Wouldn’t your kids expect to be able to vote in an election on their phone?They should! Everybody should, because poor people can, old people can, they don’t have to drag themselves down to a-Right. Disabled. We’ve got to get it to a place between now and when they’re all voting age, where we’ve proven that it’s completely safe.Right, it was interesting, I was on a program, on Meet the Press, 100 years ago, like five years ago, and I think David Gregory was still there. And I was talking about voting online. I kept saying, “we’ve got to vote on our phones. That’s where it’s got to go. There’s got to be some safe.” “Oh, we could be hacked.” I’m like, “No no, we’ll figure out a way to do it that, it’s so much safer than a box of ballots or a computer that you can like-”Of course it’s safer. The people who say that have never worked on a campaign.“-a local computer that you can bug with.” And I was like, “it’s gonna be on the phone. There’s going to be some very good way of doing this. It’s not hackable, that it’s not.” And blockchain of course didn’t exist then. And I said, “but it’s going to be this way” and, you know, one of the 100-year-old white men on the panel was like, “Well I like going down and putting an x on my paper, and putting my,” I said, “when is the last time you put an x on a paper, grampy?” You know what I mean, it was like crazy. It’s like, nobody votes like that. They vote in those machines in the little things. And so, it was sort of this romanticized version of voting, like, one man, one-Don’t you think they also think that maybe only people as erudite as them should be voting in the first place?Yes I do, oh, 100 percent. That was exactly right. They’ve never had a barrier to voting. And other people have. They’ve never had a barrier to anything. Anything, and so they don’t understand. Even my own kids I’m like, “Do you know other people struggle? I just don’t know if you understand that you live in a bubble of white guy.” And so in my kid’s case, total white guy, tall white guy with blue eyes! It just goes on and on and on for them, which is really, they just get more and more advantages as they go along. But what was interesting, so I was talking about this, I said, “We’re going to vote online someday. We’re just going to vote online.” So I was like, “I don’t care, all your romantic, we’re just going to vote online someday so poor people can vote, old people can vote, people who can’t get to the polls. Everyone will vote then, because it’s easy.” I said, “people call Ubers, they call, I said, Tinder. Tinder really works. And someone goes, “and really is good, you can match people so quickly and it’s how we should do everything every government service should be using these commercial technologies.” And one of the people on the show goes, “You’re comparing voting to Tinder?” Like that. And I go, “No. Tinder works.” Yeah, far more people use Tinder.Tinder’s useful and works and it makes sense!And effective.And effective, and you get what you want by the end of the night. So look, the trick I think is to let the genie out of the bottle. So if you think about our Uber conversation earlier, we knew that once we exposed people to markets, this new service that was so much better than taxi, they’d fight for it because they didn’t want to go back to taxi. I think the same thing here. If we show people, hey, look how much easier it is. And they feel like, hey I got to do this thing without having this whole pain in the ass process.Right I’m doing this with you, Bradley, I think it’s critical. I think it’s a critically important issue. I think, voting has to … You just need to vote. And everything, you’re right, about guns, about all kinds of things, about all kinds. And it’s not just progressive causes, it’s just we will not be the tyranny of four ranchers from Montana deciding our fate.Yeah, special interests on the left or the right. Whatever it is, you should want the mainstream participating.Exactly. Anyway, this is great talking to you, this is a great book. It’s called “The Fixer: My Adventures Saving Startups From Death By Politics,” it’s by Bradley Tusk, and he is a fixer, for sure. Thank you for coming on the show.Thanks for having me on.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}