{"id": "On the eve of the Saudi economic summit, we’re about to see just how damaged they are in Silicon Valley", "paragraph": "The Saudi economic summit that begins on Tuesday will be nothing like last year’s inaugural Saudi summit.The sheen has worn off of the Future Investment Initiative, which was visualized as a new kind of international finance conference that would take what has succeeded for decades in Davos as the World Economic Forum and bring it to the desert of Riyadh. But after the now-admitted killing of American resident and journalist Jamal Khashoggi earlier this month, the event has transformed from a star-studded gala into a scarlet letter in the eyes of Silicon Valley.The three-day conference has been close to decimated by cancellations from Western speakers as details emerged about Khashoggi’s gruesome death. And now the Saudis will have to stomach global scrutiny that will be critical of too many all-is-fine smiles from attendees or too few mea culpas from government officials.Here’s what to watch for as “Davos in the Desert” begins:Remarkably, on the eve of the conference, we still do not have a final tally of which Silicon Valley names are still planning to appear. That’s probably the point.“The detailed program will be released shortly,” read the conference’s website as of Tuesday morning in Saudi Arabia. Controversial investor and Facebook board member Peter Thiel is still listed as sitting on the conference’s advisory board — even as other Silicon Valley members like media mogul Arianna Huffington have pulled their endorsement.The biggest unanswered question, though, is whether Masayoshi Son, the leader of SoftBank, will snub the event. Son is the Silicon Valley name with the most substantial business ties to the Saudis — $45 billion through their joint investing effort, the Vision Fund — and SoftBank has said very little about the unfolding situation in its backer’s borders.SoftBank has been mum about its executives’ plans — a spokesperson didn’t reply on Monday when asked about Son’s plans. But the business world will be closely watching what he says, and more importantly, if he appears at all.* Update: Son is no longer speaking at the conference, per The Wall Street Journal.The high-profile names attending a conference, though, are only really meaningful if they tell us something about whether the Saudis will be really hurt in the pocketbook. Unwinding past deals is close to impossible. But future deals? There are early signs that the Saudis are losing the U.S. business they have tried so hard to cultivate — from a $400 million investment into the Hollywood talent agency Endeavor to $1 billion into Richard Branson’s Virgin Group.I wonder whether the Saudis will pretend if all is normal, or will instead recognize that their brand in the deal community has been seriously tarnished.It’s not only startups that take in mouthfuls of Saudi cash over the last few years — venture capital firms do, too.Everyone knows about how Saudi Arabia’s Public Investment Fund has backed companies like Uber. But Saudi funds are always trying to get access to top-tier funds. One that has been somewhat successful, for instance, is the King Abdullah University of Science and Technology, the $20 billion endowment that is an investor in a number of top funds, according to one person familiar with the arrangement.If you’re a Silicon Valley investor in October 2018, it’s hard to believe that you’d feel comfortable taking money from any Saudi-backed fund.“Not all money is the same. The people that come with it and who are behind it matter,” wrote venture capitalist Fred Wilson on his well-read blog this weekend. “That has always been the case and remains the case and we are reminded of it from time to time. Like right now.”The problem? In October 2020 or October 2022, when the Khashoggi scandal has faded into history, investors won’t be reminded of it. And the Saudi summits could get very popular again.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}