{"id": "Facebook followed Uber and Google and is ending forced arbitration for sexual harassment cases", "paragraph": "Facebook has joined other tech companies like Uber, Google and Microsoft in ending forced arbitration for employees who file sexual harassment claims. That means that employees can now take sexual harassment complaints to a court of law, and request a jury trial, instead of having to settle with the company in private, an approach that makes it easier for companies to hide systemic issues from the public. “Today, we are publishing our updated Workplace Relationships policy and amending our arbitration agreements to make arbitration a choice rather than a requirement in sexual harassment claims,” a company spokesperson said in an email to Recode. “Sexual harassment is something that we take very seriously and there is no place for it at Facebook.”Facebook’s move is a reaction to a rising number of tech employees who are upset that sexual harassment issues at big companies often get swept under the rug. Uber changed its policies in May following backlash after more than a dozen women sued the company for alleged sexual assault late last year. Google changed its policies on Thursday after thousands of employees walked out of work last week in protest. A recent New York Times report found that Google had covered for numerous high profile executives accused of sexual harassment, and even paid them generous severance packages as they walked out the door. The changes to these policies should, in theory, encourage more women to come forward with issues and hold companies more accountable since they can’t hide incidents from the public. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}