{"id": "Here’s what Amazon HQ2 employees will face in Long Island City when it comes to transportation, housing and ... sewageTransportationTax incentivesHousingCommercial spaceInfrastructure investment", "paragraph": "Amazon’s 14-month-long contest for a second headquarters is finally over. But for the two locations it ultimately chose — an area of Northern Virginia Amazon is calling “National Landing” and Long Island City, New York — the journey has just begun. The addition of Amazon’s HQ2 means that potentially 25,000 new employees will swarm each of those areas in the coming years. Long Island City, located in the biggest city in the U.S. — where overcrowding, aging infrastructure and a high cost of living present unique challenges — will surely be the trickier location of the two. Here’s a look at what Amazon and its employees will have to face in Long Island City. If you travel in NYC, you know that the subway delays have been awful. They’re somewhat less awful in Long Island City. Three of the major train lines in the area — the 7, G and E — were on time 85, 83 and 81 percent of the time, respectively, during weekdays in September, according to the MTA’s subway performance dashboard. That’s higher than the system-wide average of 80 percent on-time.The M train, however, was only punctual 76 percent of the time in September.The MTA is currently working on a new signal system for the 7 line that will allow at least two more trains per hour. It’s expected to be completed by the end of the year. New York City’s subway trouble, however, is not isolated to each subway line.“It’s a network that’s only as strong as its weakest link and it’s suffering right now tremendously,” according to Danny Pearlstein, policy and communications director for transit advocacy group Riders Alliance. “The question for the six million daily riders is, ‘Will the state come up with a plan to rescue the subway system?’”Performance of Long Island City’s major trains are highlighted in blue below:Much of Long Island City is located within Opportunity Zones, economically distressed areas where new investments could be eligible for preferential tax treatment, according to Economic Innovation Group, a nonpartisan public policy organization. These investments are currently trendy among the tech industry’s wealthiest.Those areas are highlighted on the map below in orange. New York Governor Andrew Cuomo is considering bypassing the normal process to rezone a 20-acre area along the Long Island City waterfront — which falls in Opportunity Zone territory — for Amazon use, according to Crain’s New York. Currently, the area is only zoned for low-rise manufacturing use.  Long Island City is the top New York City neighborhood for new residential development, so it has ample new housing for Amazon workers.About 3,000 units were completed in the first half of 2018, according to Localize.city, a New York City real estate platform that analyzed Department of Building data. Some 3,300 more are expected to be completed by 2020 — that represents about a fifth of all new units citywide.As a result of all this construction, rental prices have been in decline in the area. The addition of thousands more residents from Amazon, however, will likely stanch that fall.Below is a Localize map of all new LIC residential buildings from Jan. 1, 2008 to July 1, 2018. Lighter-colored buildings are still under construction. Long Island City has a much higher office-vacancy rate — 24 percent — than even the U.S. at large (12 percent), according to real estate services company Cushman & Wakefield. That means, should Amazon choose to lease existing office space, it would have a relatively easy time.That’s especially the case as several high-profile office tenants have left the area — including Citigroup. (Update: Citigroup now says Amazon plans to move into its tower at 1 Court Sq.) In general, LIC hasn’t historically been a major office market. High-end office space in LIC is also much cheaper than in Manhattan, at $48.20 a square foot compared with $84.17 in Midtown, according to Cushman. LIC’s infrastructure is already stretched thin — and that’s before adding an additional 25,000 Amazon employees. Luckily for — and perhaps because of — Amazon, the city recently committed to investing $180 million in the area. That includes $95 million earmarked for the area’s ailing sewer system and water mains. Here’s a map of Long Island City’s planned water and sewer improvements. The investments also include $60 million for a new school in the Court Square area, $15 million for parks and open-space improvements, and $10 million for street reconstruction to “provide safer connections for pedestrians and bicyclists.”That’s good, because Long Island City has more reports of blocked bike lanes than all of New York City, according to Localize. It also ranks first for the most parking complaints — more than 4,000 a year.The area also faces a shortage of essential amenities such as supermarkets and pharmacies, though perhaps a new Amazon Go store could fix that; Amazon’s first Amazon Go store sits on the ground floor of Amazon’s new Seattle headquarters.As far as other stores, 500,000 square feet of new retail space is expected by the early 2020s.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}