{"id": "Recode Daily: Uber is building tools to Uber-ize all kinds of work", "paragraph": "Uber has transformed the global taxi industry — now it’s aiming at Uber-izing side hustles. The ride-hail company has quietly been developing a new short-term staffing business, called Uber Works, to expand its “on-demand” model into additional types of temporary work, like waiters and security guards for events and corporate functions. The new venture has reportedly been in the works in Chicago for several months after an earlier trial in Los Angeles, but it is unclear how soon Uber Works could debut. Meanwhile, banks are competing to become the top underwriter for Uber’s 2019 IPO; the favorite is Morgan Stanley, whose top tech banker moonlights as an Uber driver. [Rob Price / Business Insider]With one prominent exception, some of the most powerful figures in business are distancing themselves from Saudi Arabia since the disappearance and apparent killing of dissident Saudi journalist Jamal Khashoggi. The noteworthy holdout: Masayoshi Son, chief executive of the SoftBank Group, which oversees the Vision Fund, a technology investment fund that sought $100 billion in investments and received the promise of $45 billion from the Saudi sovereign wealth fund. SoftBank has expressed doubts about the likelihood of a second Vision Fund; here’s a look at how the Japanese conglomerate is handling the growing crisis. [Kate Kelly, Landon Thomas Jr., Andrew Ross Sorkin and Erin Griffith / The New York Times]U.S. Treasury Secretary Steve Mnuchin withdrew from the Future Investment Initiative economic conference in Saudi Arabia amid bipartisan backlash over his plans to attend the event despite the disappearance of Khashoggi. Mnuchin was planning to speak at the conference during a weeklong, six-country swing through the Middle East, focused on combating terrorism financing. Several prominent chief executives, including JPMorgan Chase CEO Jamie Dimon, Uber CEO Dara Khosrowshahi and Ford Motor chairman Bill Ford, also canceled plans to attend the conference, along with ministers from Britain, France and the Netherlands. [Alan Rappeport and Eileen Sullivan / The New York Times]Apple still has a few new products up its sleeve for 2018: The company issued media invites for an October 30 event in Brooklyn. Apple-watchers are expecting new iPad Pro tablets with Face ID and potentially several updates to the Mac lineup, perhaps including the long-awaited successor to the MacBook Air laptop. The event’s enigmatic tagline: “There’s more in the making,” which some are interpreting as a signal that Apple may debut products aimed at creativity and expression. [Chris Welch / The Verge]One of Silicon Valley’s most secretive companies, data-mining giant Palantir Technologies, is considering an initial public offering that some banks have valued at as much as $41 billion — one of the largest in recent years. Palantir, which was co-founded by investor Peter Thiel, has talked with investment banks Credit Suisse Group AG and Morgan Stanley about its plans, and it could go public as soon as the second half of 2019. The discussions come amid a gusher of technology giants — including Uber, Lyft, Slack and Postmates — charging toward newly volatile public markets. [Rob Copeland / The Wall Street Journal]Fortune magazine released its second annual Future 50, which ranks established public companies with the best long-term growth outlook. U.S. companies in the Top 10 include Workday (No. 1), ServiceNow (No. 3), Vertex Pharmaceuticals (No. 7), Netflix (No. 8) and Salesforce (No. 10). The vast majority of this year’s forward-looking list are headquartered in two countries: 42 percent are in China (including Hong Kong) and 42 percent in the U.S. [Martin Reeves / Fortune]Trump’s latest China threat could crush the $8 billion Amazon competitor Wish. Here’s its plan to fight back.The days of Wish building its company on the back of artificially low shipping rates may be over. [Jason Del Rey]Marc Benioff voiced concerns on a San Francisco homelessness measure months before becoming its most prominent booster.The high-profile tech exec was critical of the initiative as late as this summer, according to July emails sent by him and seen by Recode. [Theodore Schleifer] Brandless wants to create the next great consumer packaged goods brand — but it hasn’t built customer loyalty yet.Third-party data puts its sales and customer retention below its peers. [Rani Molla]Silicon Valley’s Saudi money crisis illustrates a decline of “moral leadership” in America.Recode’s Kara Swisher and NYU’s Scott Galloway discuss the links between Jamal Khashoggi’s killers and the tech industry on this episode of Pivot. [Kara Swisher]Canada sold out of weed on the first day of legalization.The awkward etiquette of iPad tipping.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}