{"id": "Watch Marc Benioff try to explain what he’s going to do with Time magazine", "paragraph": "Billionaire tech CEOs are used to appearing on the covers of glossy magazines. They’re much less familiar with actually running and operating those magazines. So what in the heck is Salesforce CEO Marc Benioff going to do with Time, the nearly 100-year-old magazine he bought for $190 million cash back in September?“This is a more important time to have a positive global impact than ever,” Benioff said in an interview with Recode’s Kara Swisher this week. “It’s one of my core values. And I thought one of these media brands could be used in such a positive way.”Some believed that Benioff might end up buying Fortune, one of the other well-known magazines Meredith recently sold. “For a while we thought we might end up with another one of these brands, and all of a sudden it became clear to us: No, the brand [where] we can have the biggest impact is Time magazine,” he said. What’s still unclear is how Benioff will personally make that impact beyond signing the checks. Benioff says his role at the magazine won’t be operational, but he and Kara went back and forth on what his involvement will actually look like without settling on a firm answer. Here’s part of the exchange, which will appear on MSNBC Sunday:Swisher: “But what’s your role? What’s your role? You’re not answering my question.”Benioff: “I’m the inspiring visionary!” Swisher: “What does that mean? What are you going to do, walk around and say things?”Benioff: “Yeah, I’m going to walk around and try to inspire a vision for the future of the brand.”Swisher: “What does that mean? I don’t even understand what that means.”Benioff: “Well, that is why I’m a visionary leader, Kara, and you’re not.”There’s clearly a lot of tongue-in-cheek going on, but how exactly Benioff plans to run Time remains a mystery. One thing Benioff did commit to: Pumping more money into the magazine. “We’re going to invest very heavily,” he said. We’ll find out soon enough if Benioff can do for Time what fellow tech billionaire Jeff Bezos did for the Washington Post. You can watch the exchange below. The full interview will appear on the MSNBC/Recode show “Revolution: Salesforce Changing the World,” which airs Sunday, Nov. 18, at 10 pm ET.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}