{"id": "Twitter is about to tell us if it lost millions of users. Does that really mean its plan is working?", "paragraph": "When Twitter reports its third-quarter results early Thursday morning, don’t be surprised if it lost millions of users over the past three months — or that the company says that’s a good thing.In July, Twitter announced a decrease of one million monthly active users for the second quarter, and warned investors that things would be even worse in the third quarter. RBC Capital’s Mark Mahaney thinks Twitter lost five million users in Q3, which would bring the company’s total to 330 million, down from its peak of 336 million earlier this year.It’s a bad sign when any company loses users. It’s even worse when that company is an advertising company that relies on impressions and scale to grow its business.But in Twitter’s case, the company has framed this decline as a sign that it is getting healthier. Some of the user decline surely came because Twitter removed some bot and spam accounts — no doubt, a good thing to remove. But the company also said that its cleanup efforts are so extensive that they are taking resources away from other products and initiatives that would normally lead to more growth.“We are making active decisions to prioritize health initiatives over near-term product improvements that may drive more usage of Twitter as a daily utility,” CEO Jack Dorsey explained at the time. “We do believe, ultimately over time, that this will help our growth story.”It’s the ultimate “one step back, two steps forward” kind of approach, and in some ways it’s believable. If Twitter can clean up its service, and people feel safer interacting with others on the service as a result, it could lead to more users in the long run, and more advertisers who want to spend money to reach those users. The tough part about believing in this idea is that the company’s “highest priority” — creating “healthier” conversations on the service — is hard to measure, at least right now. That forces investors to decide whether Twitter’s user decline is just the temporary cost of cleaning up the service, or a sign of even deeper problems. It’s possible we won’t know for a while.Twitter hopes to quantify its health some day, but it’s unclear if or when that will actually happen. For now, the closest thing Twitter has is its daily user growth metric. If more people are using Twitter every day, perhaps it’s because Twitter isn’t the toxic wasteland it once was. Or perhaps that growth is the result of something else. Maybe we’ll find out on Thursday. Why does this matter? As an advertising business, the size of Twitter’s user base is arguably its most important metric that doesn’t start with a dollar sign. How many people can Twitter target with ads? And is that number of people growing? The answers to those two questions can give you a pretty good idea of how Twitter’s business is doing.But things are rarely that simple with Twitter, and the company’s user-growth story has been an ever-evolving tale. Twitter used to measure itself solely on monthly active users, the same basic metric used by Facebook. But that metric hasn’t been very kind to Twitter for a couple of reasons: Facebook’s user base is much bigger, and Twitter hasn’t grown nearly as fast — in fact, it’s shrinking.So Twitter has tried over the years to talk about user growth in other ways. There was a time it talked about its “logged out” audience — how many people see tweets, even if they don’t have an account. More recently, it started to talk about its daily user growth, though the company doesn’t actually say how many daily users it has.This latest narrative — Twitter is shrinking because it’s getting healthier! — seems the hardest to accept. And while Twitter’s stock was doing great a few months ago, it’s now down about 40 percent from early July.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}