{"id": "Recode Daily: Facebook battles renewed criticism from Washington, D.C.", "paragraph": "Facebook is battling renewed criticism from Washington, D.C. in the aftermath of a New York Times report that meticulously revealed Facebook’s cloddish response to the disinformation and hacking campaigns around the 2016 election. The toughest pummeling came from Democratic Sen. Richard Blumenthal, who said the story was a “chilling reminder that big tech can no longer be trusted.” Facebook’s board is throwing public support behind CEO Mark Zuckerberg and COO Sheryl Sandberg; meanwhile, the company’s top lawyer, General Counsel Colin Stretch, who announced back in July that he was leaving at the end of the year, has changed his mind and will stay until mid-2019 or longer, given that Facebook is still dealing with a number of legal and political crises. Facebook responded to the Times exposé, citing “a number of inaccuracies”; answering criticism, Zuckerberg said Facebook is working to address the problems highlighted in the Times report, and added that he has no plans to step down as Facebook board chairman. [Theodore Schleifer / Recode][Want to get the Recode Daily in your inbox? Subscribe here.]  Pennsylvania philanthropist David Magerman was the initial donor behind a high-profile campaign urging regulators to break up Facebook. A former hedge fund executive, Magerman has given more than $400,000 to the “Freedom from Facebook” campaign because he believes Facebook has too much power over how the world communicates. A New York Times report revealed that Definers Public Affairs, a Republican-oriented opposition-research company hired by Facebook, had tried to link the campaign to liberal financier George Soros. Facebook said yesterday that it had ended its relationship with the Washington, D.C.-based consulting firm. [David McCabe / Axios]Here’s how Facebook, Google and Amazon got away with not being regulated. In this excerpt from Tim Wu’s new book, “The Curse of Bigness: Antitrust in the New Gilded Age,” the author says that after the fast and chaotic late-90s and early 2000s, people assumed that bigness — the economics of scale — no longer really mattered in the new economy, and that there could be no such thing as a lasting monopoly on the internet. Basically, U.S. antitrust law failed to notice that the 1990s were over, giving the major tech players a pass for a decade and counting — even when confronting fairly obvious dangers and anticompetitive mergers. Some other thoughts for the weekend: Kara Swisher finds a metaphor for where Silicon Valley now finds itself in the California wildfires. And Wired convened a debate around the question: Has Silicon Valley lost its soul? [Tim Wu / Wired]The FCC voted to allow Elon Musk’s SpaceX to deploy more than 7,000 Starlink internet satellites designed to provide broadband communications, far more than the number of currently operational satellites in low-Earth orbit. SpaceX previously won permission for a separate set of 4,425 satellites, and said it plans to begin launching the satellites next year. The number of satellites orbiting Earth from all nations stood at 1,886 in August. Meanwhile, SpaceX successfully launched a used Falcon 9 rocket yesterday, the spaceflight company’s 18th mission of 2018, just one mission short of a new record. [Todd Shields / Bloomberg]Walmart posted higher third-quarter sales, continuing a string of solid growth as the world’s largest retailer taps into online shopping and a robust U.S. economy. Total quarterly revenue was $124.9 billion, an increase of 1.4 percent, and sales at U.S. stores rose 3.4 percent in the quarter ended Oct. 26, including a 43 percent jump in e-commerce sales. Walmart’s results followed a strong earnings report from Macy’s, suggesting that retailers are headed for a healthy holiday season. And the Commerce Department reported Thursday that American consumers picked up their spending in October after two consecutive months of declining retail sales. [Sarah Nassauer / The Wall Street Journal]Reporting on secretive technology companies sometimes means finding people who don’t want to be found. Jack Nicas, who covers Apple for the New York Times, relies on some old-school tech to cover high-tech, including screenshots, burner phones, call-recording apps — and ringing doorbells. [Jack Nicas / The New York Times]The ubiquity of smartphones — captured by photographers.The word of the year is “toxic.” (No, we’re not “gaslighting” you.)Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.One senator says the company \"actually encouraged anti-Semitism\" by hiring an opposition-research firm.A Verge affiliate site"}