{"id": "Here’s why tech billionaires are fighting over San Francisco’s Prop C ballot measure  ", "paragraph": "There’s been a lot of debate about Prop C lately: The San Francisco ballot measure on homelessness has sparked a rare public feud among some of tech’s biggest billionaires.The proposition seeks to address the growing problem of homelessness in the tech industry’s de facto capital. The stark contrast between the tech sector’s affluence and the poverty that surrounds it has become a mark of shame that has drawn international condemnation. With this ballot proposal, tech executives are weighing what corporate responsibility they must display as they are being publicly challenged — notably by Salesforce CEO Marc Benioff — to give back more to the community they’ve built their wealth in.Here is a rundown of what exactly the measure would do and why tech is divided on the issue:If passed, Prop C would raise corporate taxes by .5 percent on companies making more than $50 million in revenue, earmarked for housing and helping the homeless.It would bring in an estimated $250 to $350 million a year to help San Francisco’s growing homeless problem, nearly double what the city spends now on its homeless services. There are currently around 7,500 homeless people in San Francisco, according to the most recent estimate; the city says Prop C funds would house up to 5,000 and prevent the eviction of another 30,000. A lot of the debate over the bill is over the type of tax that would increase — gross receipts tax — and how it would disproportionately affect financial tech companies such as Square and Stripe, which are leading tech opposition on the measure. Square CEO Jack Dorsey said that Square in particular would pay twice as much in taxes as Salesforce, despite having an annual revenue that’s projected to be about four times less this year.Proponents of Prop C say that it’s a moral imperative to help the homeless, and that San Francisco, which has seen some of the nation’s strongest economic growth in the past two decades, can afford to pay the price.Opponents worry about the harm the tax could bring to the businesses. And some — including San Francisco’s mayor, London Breed, also say they worry about accountability of how the funding will be used.It’s worth taking a moment to dispel the myth floating around the tech community that the city spends $40,000 dollars per homeless person per year. In reality, that number is far, far lower — actually 10 times lower, around $4,000 a person — according to reporting from the San Francisco Chronicle. Whether or not the city is spending that $4,000 per person in the most efficient way possible is up for debate, although some have found it a bit odd that the city’s mayor is questioning the responsibility of local government to allocate funds.On the question of economic impact — Prop C would likely cause some job loss and reduction in GDP, but only by about .1 percent, according to the city’s analysis. But there’s an additional risk to the local economy if the tax increase compels tech companies to move out of the city altogether, the report found, and that risk is more difficult to measure. So far, Dorsey has said he’s committed to staying in San Francisco and finding a solution, but Twitter and other companies have considered leaving the city in the past over tax issues and rising costs to operate.Benioff has been the only tech executive so far to come out in strong support of the proposition, following the lead of advocacy organizations behind the measure. Even so, he’s been able to help the Yes on C campaign far outspend its opponents — in total, there have been $5.6 million in contributions for the proposition and $1.3 in contributions against it, with $5.1 million of Yes on C donations coming from Benioff and Salesforce.Here’s a list of the tech figures and companies who have donated No on C, and how much they’ve contributed to those campaigns, according to the latest public disclosures: There’s a similar divide on Prop C with California politicians: While San Francisco Mayor London Breed is against the bill, state Rep. Nancy Pelosi and Sen. Diane Feinstein are proponents of it.And then there’s an assortment of celebrities who have come out in support of Prop C, including country-pop singer Jewel, Chris Rock, Danny Glover and will.i.am.With less than two weeks until the final vote, we’ll see if tech CEOs dish out more last-minute cash or fiery tweets in support of their views on the issue. But one thing is for sure — the tech industry is now being called upon to help fix a colossal problem; one that, whether justified or not, people feel it’s in large part responsible for.Building more high-density housing, as Stripe CEO Patrick Collison and other YIMBY advocates have proposed, may help, but it’s unclear if that will happen and in what time frame. In the meantime, voters in San Francisco and beyond will be asking: If not Prop C, what should tech leaders be doing to keep the most vulnerable citizens off the city’s streets?Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}