{"id": "Amazon is dominant online, but local retail still has advantages Jeff Bezos can’t replicate", "paragraph": "The retail battle with Amazon is everywhere, but for me it is raging on 14th Street NW in Washington, D.C. It is here that I have found only three single pockets of resistance to the online retail giant, which is marching its way into everything and at everyone these days. And, even more so here since it seems that one of the much-hyped new headquarters of Amazon will also be near, just a few miles across the Potomac River in Crystal City.But, first, let me set it up: 14th Street NW is a major thoroughfare cutting through the Logan Circle-Shaw neighborhoods right near a small house I just bought recently due to my frequent visits. The area has undergone a major gentrification since I last lived in D.C. in the 1990s and now it is replete with new condos, trendy restaurants and bars. And, of course, hip stores, both chain and local, all to serve the scads of millennials who roam the sidewalks in search of whatever.Given I am much older and not often in the market for anything — my more frantic hunting and gathering was over way back when — it’s the first time in a long while that I have had to outfit another home.More to the point, it’s the first time I have had to do so in the digital era — or, more precisely, in the Age of Amazon. And while that sounds like a rather grand way to put it, what has become very clear to me is that the ability of anyone in retail to fend off the online — and increasingly offline — retail behemoth is moving toward nil.I say this as a personal consumer this time and not as someone with a lot of knowledge about the changing mechanics of retail and the growth of Amazon. That I do possess, having been a retail reporter for the Washington Post for many years pre-Amazon and later having covered its CEO and founder Jeff Bezos from his earliest days when he had a tiny startup in a sketchy neighborhood of Seattle.At that time, Jeff was very accessible and, dare I say, saucy in both his ambitions and energy. He only ran the “earth’s biggest bookstore” – a grandiose claim that irked many then, even if it would prove to be true soon enough. And not just for books, but in selling just about everything, first for other retailers and consumer goods makers and, more often now, sourced by the company itself.That is a story we all know by now, as Amazon has barreled ever forward like a giant Borg, a term I also use for Google, the Borg of Information, and Facebook, the Borg of Social Media.And, indeed, resistance is becoming futile to all of them, although perhaps most of all to Amazon. It’s not about the typical retail advantage of market power (there is plenty of retail around) or price (there are lower-priced options), but about a nearly flawless and almost unholy combination of many other factors the company has sharpened to a fine edge that is now slicing through everything.Including my will to resist, as it has turned out these days. This has been a sudden shift too, since my use of Amazon has been consistent for years, but not excessive. I am a Prime member, but I mostly order various commodity items like phone cords and weird things I don’t want to spend a lot of time finding analog like an unusual miso paste. But, mostly, I try my best to go to stores, especially local ones. I do it both to support the community and a vibrant street life and because I think of a really good retail experience as something more than a soul-sapping transactional thing.But my recent experience has blown me away since Amazon has now managed to create a series of something I can only describe as moats to lock me in more and more and also keep out other retail options. Among these moats: Convenience, data, speed, breadth and flat-out excellent customer service.Other retailers are not even close. For example, I ordered a bed frame for my 16-year-old son from CB2, after trudging to its store in Georgetown to take a look at it. That was worthwhile enough, since it is always good to see such an item. But it took a really long time to fill out the order form by the associate, after which I got the news that it would take two weeks to arrive and cost me $75 in cash for that privilege. And when it finally came? It turned out to be the wrong frame and had to go back on the truck, after which it took me several annoying tweets and many calls to get a refund. So what did I do that very day? I looked on Amazon’s Prime Now service and had a similar enough frame at my home in two hours at about half the price and with no extra shipping charge.The same thing happened over and over when I tried to shop in person, whether it was a shelf for clothes or an iron or a small table. And it was worse, especially if it was at a big-box store like Target, which was so hopelessly large and confusing that I gave up and left the cart right there and ordered it all on Amazon — a coffee machine, a toaster oven, a comforter, some sheets — from the parking lot. It was mostly at my house by nightfall, without one single error.My issue was only this: I never spoke to or interacted with anyone who was sentient in this whole experience, which is what made the difference at only three physical stores that got my business time and again. And more, with each pushing a different reason for making me want to give them my money.Here’s why:Creativity: One was a small shop called Home Rule, which sells all kinds of home goods. It’s a colorful place with its walls covered with all kinds of objects that reflect the impeccable taste and whimsy of the retailer. While many of the items there were certainly on Amazon, I would have spent a dog’s age not finding them and so many in one place. In the old days, this was called merchandising, but I consider it basic creativity. From the retro green alarm clock to the weird mini ladles to the odd magnetized flatware to a bright blue spatula to scrape out jars, it was a delight to shop there, something no algorithm will ever replace. It’s true that everything that can be digitized will be digitized, but you still cannot digitize creativity.Perfectly human customer service: Across the street from Home Rule is an old-style hardware store called Logan Hardware, which is in the Ace Hardware chain. Here’s what happens when you enter the also-jam-packed store: A real person with knowledge of the whole place asks you if they can help you. And if they don’t know, they find out immediately and then get you to a better person. This is simply key since every single thing in Logan Hardware is easy to find on Amazon and can be gotten with a click. In addition, there is a homey comfort with all this kind of service, from the key-maker in the back to the garden guy upstairs to the clerk who lets you know that they also have these weird local pretzels over there you might want to try because they are delicious. And they are delicious, which — again — a computer cannot tell you with any certainty.Unique and quirky and nowhere else: The last stand against Amazon is perhaps the hardest to pull off, but it happens daily at a large antique furniture store called Miss Pixie’s, just down the street from the other two. When I think about what is great about retail — delightful, overflowing, endlessly discoverable and impossible to copy — this is it. By going to auctions and constantly replenishing the stock of everything from glasses to trays to large cabinets to whatever — with a clear eye to this-is-it-and-it-is-cool — Miss Pixie’s cannot be breached by any robotic technique. It is where I missed buying a loveseat glider that reminded me of so many summer nights with my grandmother, because I hesitated and then it was gone forever. But it was also there that I found more worn Fiestaware plates to match those I had lost and a weathered-by-real-use wrought iron outdoor table and an out-of-date globe for my 13-year-old. “Look, Mom,” he said, spinning it around madly to point out all the old countries there that had shifted to new countries now. “So much has changed.”He has no idea.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}