{"id": "Is the Daily Beast the new Gawker?", "paragraph": "Noah Shachtman, the editor in chief of the Daily Beast, has three rules about covering the Trump administration.“Fuck access journalism, number one,” Shachtman said on the latest episode of Recode Media. “Number two, you better have some sources, right? And luckily number three is, in this administration ... Like, more than advancing any policy, and more than anything, is these guys want to stab each other in the back, these guys in the Trump administration.”Plus, he told guest host Steven Perlberg, he doesn’t expect political sources to trade intel to the Daily Beast anyway. The 10-year-old site has long prided itself on its scrappy, skeptical attitude. “They all know we’re a bunch of velociraptors around here,” Shachtman said. “We’re just gonna bite the hand off if you spoon-feed us. So we’re a dumb outlet to spoon-feed to. However, we’re an awesome outlet to leak to.”Calling the site a “high-end tabloid,” he said he admired the IAC-owned site’s ability to “take a side and throw a punch and call bullshit on the things that need to be called bullshit on.” But he’s also glad to be “owned by one of these giant globo-corps” for the inevitable legal threats that are thrown at the Daily Beast, like the Peter Thiel-engineered lawsuit that took down Gawker.“I think that we like to embrace the gonzo and that Gawker was an inheritor of that gonzo spirit that didn’t originate with Gawker, but that they carried that mantle for a little while,” Shachtman said. “We really like the gonzo. We really like the weird. We really like the fun and we don’t give that many fucks. We don’t give zero fucks, but we don’t give that many fucks.”You can listen to Recode Media wherever you get your podcasts — including Apple Podcasts, Spotify, Google Podcasts, Pocket Casts and Overcast.Below, we’ve shared a full transcript of Steven’s conversation with Noah.Steven Perlberg: This is Recode Media, from the Vox Media Podcast Network. I’m Steven Perlberg, in for Peter Kafka. I’m a media and politics reporter at BuzzFeed News, but I’m here at Vox Media Studios today in New York City. Today I’m really excited to be back in the studio. You might have heard my interview with Matt Taibbi a couple weeks back. This week, I’m here with Noah Shachtman, the editor in chief of the Daily Beast. Noah, welcome to Recode Media.Noah Shachtman: Hey.So, the Daily Beast just celebrated its 10-year anniversary. Mazel tov.Thank you.Our listeners probably know the Beast from its mix of reporting on everything from politics to national security, White House, pop culture. I wanted to start with ... You know my boss over at BuzzFeed News, Ben Smith, and I was telling him that I was coming to interview you. He brought up a point, that he feels like you guys are kind of like BuzzFeed News maybe circa 2012, where you’re scrappy, you take these big swings. You sort of have fewer resources than the competition. You know, you prize scoops big and small. You’re sort of hyper-aggressive. You’re fast. But with that kind of comes the risk of all that comes with being a smaller, scrappier outlet. So I’m curious, is that a fair way to talk about the Beast now? Like, how do you think of yourselves? In the media ecosystem, where do you fit in among the competitors?Yeah. I mean, I would agree with the “scrappy” part, and I would agree that we are like crackheads for scoops. I don’t know, necessarily, that I’d compare it exactly to BuzzFeed 2012. To me, we’re more of a mix of like the old-school New York tabloids ... I grew up in New York, and so I grew up reading the Daily News and the New York Post when they were at their height ... And mixing that with, in some ways, my experience working for Condé Nast magazines. It was kind of like the slick, glossy, global, smart outlook of those. You put those two together and give them a bizarre Frankenstein love child and you have the Daily Beast. Do you think of yourself as a tabloid? Is that something that you communicate to your reporters? Does that bring a different kind of sensibility to your reporting? Does it give you more leeway?Yeah. I think we consider ourselves a high-end tabloid, a global tabloid, for sure. And yeah, that means no boring headlines, right? That means the ability to take a side and throw a punch and call bullshit on the things that need to be called bullshit on. Which I think for the “broadsheets” of the world, can be more difficult.We’re now two years into the Trump administration. There’s a ton of hand-wringing over how to cover this story. You guys, I think, have made a name for yourself with some of the White House scoops you’ve had, national security scoops. What have you, as an editor in chief in this Trump era, what have you learned about journalism, about media, about covering Trump in this age? Has your worldview changed about journalism and how to cover the story, or not really?No, I think ... Well, I mean first of all, the basic journalistic principles apply for all time, no matter who’s in the White House, and no matter what the media environment is. I think with this president, it’s interesting. Just to take a step back, Bob Woodward used to say that the business of D.C. journalism was to uncover the secret state. Right? And that still applies. But in the Trump administration, you have something weird, which is that oftentimes the deepest secrets are mirrored on the president’s Twitter feed. So, it’s like what’s visible and what’s invisible are often kind of twinned, in a very interesting way that you wouldn’t see in the Obama administration, which was generally more secretive and buttoned-up. So, that’s one thing. Then the other thing is like ... Look, the minor details in this administration are so telling. You know, we did a story a while back about how Rex Tillerson found out that he was fired when he was on the toilet.And everyone remembers that detail.Yeah. But it’s also telling about the way that the Trump administration treats its own most senior members, right? Like it’s not just a tee-hee funny story ... Although it’s totally fucking funny.Right.It’s also a story about the power dynamics between Tillerson and the White House. It’s a story about how Trump treats these guys, who, months earlier, he was lauding as total geniuses.Not to make you sort of criticize the competition, but do you think that traditional media has been ill-equipped to handle the Trump moment? Because you see sort of this insurgency of ... Well, you see the traditional media outlets having this sort of renaissance. The Post and the Times are doing really well. But at the same time, it feels like sometimes there’s ... Like I was saying, there’s a ton of hand-wringing about what this moment means and how to cover it. And I’m curious, what is your diagnosis of how traditional media has handled the Trump moment?Yeah. I mean, I think you’re hinting at it. Look, the Post and the Times have been totally lights out. They’ve been incredible, no doubt about it. They are the heavyweight champs of the world, and they’ve really proven it in this cycle. I think some of the other legacy outlets have really stumbled on the job. Really, really stumbled on the job. Repeating uncritically the president’s lies — I just don’t think that that’s the job of journalism, is to serve as a mouthpiece for power. I think getting gamed and distracted a lot by the president’s nonsense … I think there’s been a lot of allowing the president of the United States to be the assignment editor, and that’s a giant mistake.Right. I mean, something like ... We’re recording this November 2nd, but something happened yesterday. Trump had this press conference, and CNN and Fox News go to it. I think CNN went to it for 15 minutes or so before they realized, like, “There’s no news here.” But that sort of thing. Right? Where all these news outlets just sort of, I don’t know, by habit, go live to Trump, and it’s like he’s there to talk about the caravan and distract, or things like that. You guys don’t really have to be in that camp.Yeah. Look. Luckily, we’re not anybody’s paper of record. Right? And so, we don’t feel obligated to cover those things. Or if we do, it’s to cover them critically. Here’s another example. The day before that, there was this break, in which the president floated this idea that he was gonna somehow single-handedly, with a wave of a hand, undo the 14th Amendment. Which is A) nuts, B) likely unconstitutional and C) nobody else in the White House was talking about this. There had been basically no prep work, or the prep work had been like, “Hey, Mr. President. I know you want to do this, but, uh, no.” Right, and then it comes out in this Axios clip, and then it’s sort of repeated uncritically by the rest of the pack.Yeah.And then it becomes, “Can he do this?” And then of course, then there’s the fact-checking.Right.Where people are like, “Actually, no!”And I understand how these editors in other places feel. I saw that clip and I was like, “Oh my God.”“What a scoop.””We gotta get an opinion piece. We gotta get this, we gotta get that.” And then we all took a deep breath ... My wife’s a meditation teacher, so ...That’s helpful in the Trump era. Yeah. And then we said, “Wait a minute. This is like total nonsense, and this is like him saying, ‘Yeah, sure,’ to a ridiculous idea that was floated.” And so we said, “You know what? The bigger story is not whatever the president’s bullshit proposal is. It’s the fact that a madman, a Nazi, murdered 11 people in a synagogue the weekend before. It’s the fact that a pro-Trump superfan had been mailing bombs around the country. That’s the story. The story is the upswing in domestic terrorism here, not whatever ridiculousness the president happens to pick out of his nose that moment.”I’m glad you brought up the Axios thing, because I wanted to talk about that. This is a term that gets thrown around a lot, sort of access journalism, right? Mm-hmm.Jonathan Swan, the reporter who broke that story, he was really ... I don’t know. He got ratio’d very hard on Twitter for sort of giddily responding to Trump. Yeah. You know what? Hold up. Can I step in there? Yeah, yeah.I think that’s actually wrong and dumb.Why?Jonathan Swan is a motherfucking monster of a reporter and any newsroom would be happy to have him.Totally.He is sourced, he is smart and he writes great. I think they captured a moment in which he was like, “Oh my God. I can’t believe this is happening.” Right.Right?This is like the print reporter who goes on television and he’s happy he got the scoop. And I don’t know, it comes out weird. Is that sort of …?Yeah. I mean, Jonathan is a little bit more media-friendly than that. But I think he was just like, “Oh my God. I can’t believe ...””Trump just confirmed this thing that I heard.”Yeah, exactly. And so, I thought that was really unfair to Jonathan.What do you think, though, of the sort of broader critique of that style of access journalism made popular by Mike Allen, maybe, at Politico? That it’s sort of wrong for the Trump moment, that it doesn’t make sense based on who you’re covering, and that that model just doesn’t really work anymore, and shouldn’t be a thing. You guys kind of have that outsider approach. Like, you don’t really have that same sort of model, but at the same time, you have sources in the White House and that’s how you break stories. Yeah.So how do you think about it as an editor?Yeah. So, look. Fuck access journalism, number one. Number two, you better have some sources, right? And luckily number three is, in this administration ... Like, more than advancing any policy, and more than anything, is these guys want to stab each other in the back, these guys in the Trump administration. And so basically you want to get them talking about, you know ...So, you don’t have to be spoon-fed anything to get stories. In fact, probably worse off.Yeah. And the other thing is, frankly, who’s gonna spoon-feed to the Daily Beast? Like, they all know we’re a bunch of velociraptors around here. We’re just gonna bite the hand off if you spoon-feed us.Right.So we’re a dumb outlet to spoon-feed to. However, we’re an awesome outlet to leak to. We’re an awesome outlet to dish to. And so, I think that’s just been our approach.You are opinionated on Twitter about Trump. You got yourself into a mini media controversy a few years ago.Mm-hmm.I think your tweet was written up in conservative media. I was just looking. Howard Kurtz of Fox News wrote a story about it.Yeah, which is hilarious.I want to read your tweet. You said, “Let’s get real. If you’re renting in a Trump building or playing a round of golf at a Trump resort, you are supporting racism and neo-fascism.” That was in 2015. That was a different moment. Trump was a different kind of phenomenon. Now he’s president. Mm-hmm.Do you either regret tweeting that, or if not, has that made it harder for your reporters? Does that make it harder to cover this administration, because they ... Or, not at all? Like, do sources give your reporters a hard time because they know, “Hey, your boss just called him a fascist on Twitter in 2015”?Yeah. I think there was a brief moment when the Trump campaign was not pleased about that. I’ll leave it to your listeners to decide whether that tweet was prescient or not. You know? And I don’t regret doing the tweet. Just to give you the backstory. It’s kind of fun. I was ...No, no. I want to take it out of context. I want to take one tweet completely out of context.Good. Good, I appreciate that.It’s very 2018.Yeah, yeah. So, look. I was in Miami on vacation, on Thanksgiving vacation, and I was sitting there holding my, uh ...Margarita.No, my son.Oh, okay. Different.Yeah. Yeah, this story took a very different turn. And I was just thinking about some of the divisive things that had been going on in the campaign, and it really ... You know, holding my little Jewish boy in my arms, rocking him to sleep, I just couldn’t believe that our country was taking this kind of turn. And so I fired that tweet off as I was rocking him to sleep. Because, you know, I’m an editor at a New York publication and that’s what we do.I don’t regret the tweet. What I do think is that if you’re gonna take swings, you might as well take, like, full ...Big swings.Full, big, considered swings. And also, the idea that Howard Kurtz, who got fired from the Daily Beast for any number of war crimes against journalism, is like, you critiquing me is a fucking joke.Right. I’m curious, though. I don’t know if this is something that you’re seeing at other outlets, where someone on the right, maybe some conservative media troll, digs up a tweet from 2013, in context or out of context, and then comes after a reporter. This happened to Kaitlan Collins... Look. All publishers and all editors, if you fall for this trick, it’s on you.So, yeah. I wanted to ask you about it, because it’s obviously ... She tweeted homophobic things in college. But at the same time, let’s say someone comes after your reporter who tweeted something slightly racist in 2011. It’s maybe out of context, maybe not, but it’s a bad tweet. What do you do? Do you respond? And do you punish that reporter? I mean, of course this is hypothetical, but this is something that all editors are now dealing with. No. Let’s take it out of the realm of hypothetical.Okay.Let’s put it in the realm of the real.Okay, so let’s say Kaitlan Collins works for you.Well, here. I’ll keep it ...You’re Jeff Zucker.I’ll make it totally concrete.Okay.So the Daily Beast had, for a long time, a columnist named Joy Reid, who also has a show on MSNBC. Joy Reid, you know, there was a bunch of blog posts that were dug up about her that were bad. They were definitely bad.Right, right.And she apologized for the first tranche of those, and we said, “Okay. These are from 10 years ago or whatever, 10-plus years ago. Judging someone on their bad blog posts when they were a talk radio host? No. We’re not gonna do that. We’re not gonna be fooled by the trick. No problem.” Okay. Then fast-forward, I don’t know, six months or something like that, and a second tranche came up.Right, and now she says she got hacked.Right. And now she says it wasn’t her. It’s the Shaggy defense. “It wasn’t me.”Sure.And so we interrogated that response, that claim that she was hacked. We put our best cybersecurity reporter on it, Kevin Poulsen, who himself is a former hacker. And within 24 hours, he was able to prove that that claim was nonsense. So then we cut ties with Joy Reid, not because of the bad blog posts but because she hadn’t owned up to it and apologized. Right. But the Joy Reid case, that was sort of its own thing, because it was obviously the cover-up. It was a ridiculous claim, that she had been hacked, and even though she sort of apologized for it, to this day still sort of ... MSNBC, I don’t think has been fully forced to reckon with the fact that she’s never exactly admitted that she wasn’t hacked. But let’s say you’re the president of CNN and it’s a reporter’s tweet. Do you respond ... When someone’s not saying they were hacked. I mean, they did it, right? But it’s a completely bad-faith attack. How do you deal with that? It’s something that I think a lot of editors think about these days.Yeah. They really shouldn’t be. I mean ...Yeah. Just don’t respond, don’t engage?Yeah, just don’t respond. Or just tell them, “Hey, look, we’re gonna stand by our reporter.” Without getting into the details ... As you can imagine, the ultra-right trolls try to pull this trick on our reporters all the time, and we just kind of laugh at them.Yeah. What is your stance about ... I mean, the Times, BuzzFeed, has a social media policy.Mm-hmm.You know, feels strongly about what its reporters can and can’t say on Twitter.Really?Oh, yeah.Like what?We have a social media policy. We can’t be like ... And this has burned people at BuzzFeed in the past. You know, it’s like if you tweet something super ... People have tweeted something partisan or ...Oh. Okay, here’s our general rule.Yeah, yeah.Our general rule is: A, you’re reporters, not cheerleaders. So don’t be an open partisan; B, don’t do something that ... I mean, obviously, don’t do anything that’s like hate speech or in any way is gonna offend a group. Because if it’s ethnicity or gender, or what have you ... Then C is don’t get your fellow reporters in trouble.Right.Don’t tweet something dumb that’s gonna jam up ...The beat reporter on whatever.Yeah, exactly. Yeah.Like, just don’t be an asshole.Right. Be a good colleague.Yeah, exactly. I think that leaves a lot of room for having fun and for voicing one’s personal opinions and for also being a good reporter. I just don’t see a lot of tension there. In fact, I can’t believe we’re talking about it this much.Yeah. Yeah. Well, I think it’s like the Times released their new social media policy. It was like, I can’t believe we’re doing this again, what reporters can and can’t say on Twitter. It’s like, we’re having this debate in 2018?I know. And it’s just like, look. The best example is like, who’s the best White House reporter at the Times right now? Maggie Haberman. Who’s got the most lit Twitter feed of anybody at the Times? Maggie Haberman.Right.So, obviously those two things are not in tension. In fact, I would argue that in the Trump era, they sometimes go hand in hand.I wanted to ask, since I’ve covered the media business at BuzzFeed and before, at the Wall Street Journal, one of the things that I always remember about the Beast is that it’s always emphasized to media reporters on the business side, is a lack of reliance on Facebook. That’s always been sort of a big thing. I’m curious now: A lot of publishers in the last few months have been struggling with Facebook changing its algorithm.Yup.And so it made me think, this is something that you guys have harped on for years, and maybe you were slightly ahead of the competitors. But I’m curious, have you seen like a big traffic dip, like some of your competitors, because of the Facebook algorithm tweak, or do you feel like you were, I don’t know, immune to some of the bad changes in the digital media business over the past few months?So, look. Overall, our traffic is way up over last year. So, while Facebook has gone down as a percentage of traffic ...What percentage of traffic does it make up for you guys now?Minimal. I mean, it’s pretty small. I actually don’t have the figure off the top of my head.Yeah, yeah.Because that’s how important it is. Yeah, look, we always viewed with skepticism the idea that you should surrender your content for free to any third party, but especially one run by an android wearing human skin, like Facebook. And so, you know, we just never played that game. Similarly, your friend Ben Smith and I have long had a difference of opinion about whether homepages are important. Right? And we’ve always felt like homepages were important. They’re a statement of values. They’re a statement of editorial priorities. And when done right, they can be fun. So we’ve always put a premium on our homepage, too. So it’s made us a little bit retro, but we think it’s served us well.Where do you — now that we’re taping this right before the midterms, but we’re about to gear up again — where are you devoting resources in the next, I don’t know, 18 months? I mean, do you guys feel like you’re ...We’re gonna pivot to video.Pivot to video? Great.Yeah. All video, all the time.All podcasts?Yup.I guess, yeah. Where do you see the business outlook going forward? What are your priorities, where to devote resources?Yeah. Look, we’re pretty happy with where we are. We think we’re headed in the right direction.How big is the newsroom now?How big is the newsroom? It’s like 40-ish is the newsroom, and an equivalent number on the business side, pretty much. I think I’m not supposed to talk a bunch about internals, because the Daily Beast is owned by IAC, which is a public company.Oh, I’m getting to that. Don’t worry.Yeah, okay. Cool. But what I’d note is that, I think the statistic I’m allowed to talk about is that revenue in the second quarter — because that’s the last one in which the earnings report mentioned the Daily Beast — was up like 66 percent. So I think we’re doing good journalistically, and we’re making moves on revenue, and so we’re pretty happy with where we are. I think what we’re not gonna do is, we’re not gonna try to — if this is your question, it may not be — but we’re not gonna try to radically expand and grow super big.Right.Or turn ourselves around and become something that we aren’t. I think we’re going to keep doing what we do. And what we find is that over time we just try to get people more into being like reading the Daily Beast every day. The more that happens, the better it is for us, and we think that we deliver a great daily experience, and so we’re trying to get more folks to do that.Right. So you’ve been at the Daily Beast since 2014, right?Correct.So you were sort of the No. 2 guy behind John Avlon, and he left, and so how long have you been running the show now?Since May.Since May. In my mind, it’s only been a decade of Daily Beast, but I kind of feel like you do have these three eras, like Tina Brown started it, so that era, John’s era, and now you’re in charge. What do you see as your sort of view and outlook and what kind of Daily Beast do you want to have, versus sort of prior eras? Is it a continuation, or is it something that, you have sort of a new target in mind?Yeah. Look, John and I were partners for sure from 2014 on, and so I think this thing we kind of helped work on together. I think that identity isn’t going to change a lot more. I do think you’ll see us branching out into different media formats. The Daily Beast has been definitely behind a little bit in terms of like stuff that’s not text-based, and so we’re experimenting with a bunch of ...So you are pivoting to video. Look, after all this.I know.That’s gonna be the headline.Yeah, exactly. That’s gonna be awesome, dude. Yeah, so we’re dipping our toe into a bunch of different areas. We’re having some real success in Hollywood too. We’ve sort of unexpectedly become like a little bit of a hit factory for Hollywood, and so we’ve got ...Yeah, so the McDonald’s [story] ...Yeah, but that’s not the only one. I’m not sure how ...You want to break news?I’m not sure how many of these I can talk about, but we’ve had like a bunch of stories in the last six months that have turned from articles and been optioned by Hollywood, pretty much overnight.Right, and this is something that a lot of newsrooms — Buzzfeed included — are thinking of, what are the new revenue streams that we can get? Can we sell a story to a Netflix? BuzzFeed has done this. Can we sell an idea to some sort of TV player? And so yeah, that’s an interesting revenue stream for publishers.Yeah, I don’t think it’s going to be humongous, but I think that’s interesting. Then look, we’re really big believers in this membership program of ours. We’re offering members of Beast Inside really exclusive, really top-end material. So like today, for example, we commissioned a poll with Ipsos right in advance of the midterms and members are the only ones that are going to get it.How do your reporters feel about, speaking as a reporter, about going behind the paywall versus not? Is that something that ... I know, I used to work at the Wall Street Journal, so I wanted as many people to read my things as possible, so but I get why the publisher wants people to pay for it.Yeah, so far there hasn’t been huge tension around it. So far it’s so clear that if you can get somebody to sign up because of a scoop it’s so valuable to the company that so far the reporters have been cool with it. I’m not sure if you can say, but how meaningful a part of your business is that now? Is that ...I mean, it’s just getting started, but we’ve got thousands and thousands of subscribers already.I wanted to ask also, so you mentioned IAC, it’s chaired by the well-known media mogul Barry Diller, how active is Barry in the business? How often do you talk to him and what is that like?Yeah, so we’ve got monthly meetings with him. We talk about a mix of business and editorial.Pivoting to video.Yeah, exactly. Pivoting to Myspace. And then [we] email back and forth, but it’s been pretty cool. There’s literally nobody smarter in the media business and nobody smarter about media, and I feel like I’m a corporate shill saying that, but it just in this case, happens to be true. I’ve gotten to see over the years that he really calls in no favors and pulls no punches and ...He’s not calling you up asking you to delete stories about his powerful friends?No. Dude, no.He’s giving you tips about his powerful friends?No, it’s not like that, but look, as you can imagine, Barry Diller has a lot of powerful friends and they voice their opinions about the Daily Beast, but it really hasn’t trickled down to us at all. It’s actually been a pleasure.One of the things, and correct me if I’m wrong here, but I think that you guys view covering campaigns a little differently. I’m not sure that ... do you put reporters on the trail and now that we’re day after the midterms gearing up for 2020 ...Shoot me.... how are you thinking about your plan for 2020? We’re thinking about ... all newsrooms are staffing up or allocating resources towards 2020 and as an editor, it’s just going to be the big story of the next two years. What’s your outlook on that?Yeah, we have traditionally shied away from the traditional campaign coverage of, “Candidate says X at rally Y.” I don’t know how much value that really brings to a reader. I think we’ll be really honestly doing more investigative work on these candidates. There’s so many candidates. There’s going to be so much dirt to dig on all these guys.There’s going to be a lot of great behind-the-scenes power struggles that are going to be really fun to report on, so my instinct is to go that way.Do you think, now that the attention is kind of swinging back to the Democratic Party, I don’t know, do you feel like as an editor you’re trying to ... I mean, do you think next year is going to be like the past two years where it’s all Trump all the time or do you think it’s going to be going back to some sort of ... I don’t know. I’m just curious how the media landscape changes when Trump might not be the story of the day, that it’s going to be some primary battle or something.Yeah.Or is he going to be narrating that in real time and he’s still going to be the story. Please predict what’s going to happen.Yeah, okay. Well, so I’ll predict this: I think next year may be the craziest year yet.Oh God.Yeah, I know.Don’t say that.I’m sorry. I’m really sorry but I think it’s true. I think that if the Democrats take control of either House, which we’ll see what happens.Yeah, when this airs I think it will probably ... I think there’s going to be a lot of pressure to really open up the investigations against the president and there’s so many avenues, so I think that’s going to be crazy. I think you’re going to have, there’s still a lot of road left on the federal law enforcement investigations into the Trump circle. That’s going to be crazy. Then you’re going to have approximately 942 candidates for president, and that’s going to be crazy,Like Michael Avenatti.Yeah, yeah. I think we might have drained that well.I’m curious, talking to folks beforehand about what I should ask you and somebody suggested that they feel like you guys have taken up the mantle of Gawker a little bit. Like now that there isn’t that player in the media ecosystem, there have been so many times where people are like, like, “Oh you know, what if Gawker were around to cover this story?” Do you feel like you try to fill some of that void of that sort of style? Because you guys, you’re willing to cover things that other outlets might find too insidery, but it’s like if you can get a scoop on it or if it’s an interesting story ...Look, I think that we like to embrace the gonzo and that Gawker was an inheritor of that gonzo spirit that didn’t originate with Gawker, but that they carried that mantle for a little while. We really like the gonzo. We really like the weird. We really like the fun and we don’t give that many fucks. We don’t give zero fucks, but we don’t give that many fucks.How do you feel about the ever-present legal threats that are hanging over ...?Yeah, they’re for real, man. They’re for real. You guys take big swings. You’ve made some mistakes. You correct them but you’ve made some big mistakes and a lot of newsrooms have, but how do you think about that? How do you view that?Yeah, look, the legal threats are definitely out there. Luckily we’re owned by one of these giant globo-corps and they have a really crack team of lawyers, and so we’ve really ... there’s been very little successful litigation against us. Yeah. All right, well that was pretty painless. We established that the Daily Beast is pivoting to video and diverting all of its 2020 resources towards covering Michael Avenatti’s campaign.Yes. Yeah, that is true.That about does it, so Noah, thank you so much for coming on the podcast.Are you fucking kidding me? Oh my God. Okay, great, amazing. How about I interview you for a little while?Go for it. You have any questions?Yeah, what the hell, Perlberg? You know? I’m all for it. Hit me with it. What have you got?You know, here’s my first question. What the fuck? Was that good? Was that a bad interview?No, no, it was great. Awesome. All right, well thank you, Noah, so much for coming on the podcast. Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}