{"id": "Recode Daily: Inside the race to hack-proof the Democratic Party", "paragraph": "The Democratic National Committee has undergone a massive cybersecurity overhaul since the 2016 U.S. election. Led by chief technology officer Raffi Krikorian, whose resume includes senior roles at Uber and Twitter, the DNC has been hiring tech talent from Silicon Valley and training staff to spot suspicious emails and signs of hackers targeting the party. Still, the DNC faces an enormous challenge in recovering from the damage inflicted by the hacking of emails, strategy documents and other internal records in 2016, which U.S. intelligence agencies have said was part of a Moscow-backed effort to help President Donald Trump win the White House. [Eric Geller / Politico][Want to get the Recode Daily in your inbox? Subscribe here.]  Meanwhile, Twitter is publicly releasing all known accounts and posts mostly related to Russian and Iranian disinformation campaigns on the site dating back to 2016, including tweets and images, to encourage independent analysis by outside researchers, academics and journalists. More than 10 million tweets, two million images and videos and over 4,600 accounts will be available for download on the platform’s “elections integrity” page. [Makena Kelly / The Verge]Jamal Khashoggi’s last column for the Washington Post calls for free expression and a free press in the Arab world — “a modern version of the old transnational media so citizens can be informed about global events.” Khashoggi, a Saudi dissident journalist, is believed to have been murdered in the Saudi consulate in Turkey two weeks ago, which has become a huge global story. “This column perfectly captures his commitment and passion for freedom in the Arab world,” his editor Karen Attiah writes. “A freedom he apparently gave his life for.” [Jamal Khashoggi / The Washington Post]Canada is now the second country in the world to legalize recreational cannabis nationally (Uruguay was first). As a result, Canada has become the frontrunner in the legal-weed industry, giving it a massive head start in a global pot market some peg at $150 billion. Medical marijuana has been legal in Canada since 2001, but it’s only been about four years since the first cannabis companies began to list on Canadian exchanges. In that short time, about 140 pot companies have gone public in Canada, with a combined market value of more than C$60 billion ($48 billion). Here’s a glimpse at how Canadians celebrated after the “bud drop” at the stroke of midnight on Oct. 17; here’s a look, in charts and maps, at the impact of marijuana on the country. [Natalie Wong, Kristine Owram and Doug Alexander / Bloomberg]Mark Zuckerberg and Sergey Brin are among the tech billionaires who have funded an award to make scientists into stars. The Breakthrough Prize carries a no-strings-attached $3 million award — more than double the amount of the Nobel Prize; part of the prize’s goal is to bring wider appreciation to the work of scientists. Among the winners announced yesterday are immigrants to the U.S. from China, Austria and Uruguay; a Harvard professor working on a Google Map of the 30 trillion cells in the human body; and a mathematician based in Grenoble, France, at work on clean energy technologies. [Reade Pickert / Bloomberg]Your next doctor’s appointment might be with an AI. A new wave of chatbots, designed to relieve your doctor of needless paperwork and office visits, are replacing physicians providing frontline medical advice. The tech — used by U.K. companies including Babylon Health, Ada, Your.MD and Dr. AI — is built on a grab bag of AI techniques: Language processing to allow users to describe their symptoms in a casual way, expert systems to mine huge medical databases, machine learning to string together correlations between symptom and condition. But are the robot doctors as good as the real thing? [Douglas Heaven / MIT Technology Review]The jackpot for tomorrow’s Mega Millions lottery has ballooned to $900 million; if someone wins on Friday, it will be the second-largest jackpot in U.S. lottery history. Mega Millions has existed in some form since 1996; here’s how lottery officials have tweaked the rules and odds of the game to make jackpots pay out less frequently, spurring their monster growth. Business Insider did the math to see if you should buy a ticket today. [Alex Horton / The Washington Post]ELON WATCH: ”Tomorrow brings a lemur” TRUMP WATCH: ”The assault on our country at our Southern Border, including the Criminal elements and DRUGS pouring in, is far more important to me, as President, than Trade or the USMCA” KANYE WATCH: [drawing]The media is responsible for President Trump and it still hasn’t learned from 2016, says Rolling Stone’s Matt Taibbi. On the latest Recode Media, Taibbi says the difference between the campaign and today is “we replaced one million hours of Trump with one million hours of ‘Trump is bad.’”High-tech anti-distraction blinkers for humans.Everything is happy at Bob Ross Inc.and: How China rips off the iPhone and reinvents AndroidSign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}