{"id": "Marc Benioff voiced concerns on a San Francisco homelessness measure months before becoming its most prominent booster", "paragraph": "Over the last few weeks, Salesforce co-CEO and chairman Marc Benioff has cast himself as the champion of a homelessness measure that would raise taxes on San Francisco tech giants, including his own company.It’s an appealing message of selflessness — the high-profile tech executive willing to forfeit some money in order to help raise $300 million to protect the city’s most vulnerable people. Salesforce is the city’s largest employer and Benioff has been one of the city’s most generous and prolific philanthropists.But privately, Benioff has at least at one point been more critical of the initiative, according to late July emails sent by him and seen by Recode. In the emails, he voiced concerns about the tax increase assessed on corporations and the $300 million that San Francisco says it already spends to combat homelessness. Benioff’s top government affairs aide, Jim Green, was also included in the emails, and Green later would participate in August conference calls centered around an alternative plan, according to a person with knowledge of the calls. Benioff did not personally participate on the calls, which came at a time when he has said he was trying to raise private money to solve the homelessness problem. People are, of course, allowed to change their mind. While Benioff never explicitly states in the emails that he would oppose the measure, he brings up only negative impressions when asked for his initial thoughts. But he wrote that he did not know how public he’d be with any opposition to it.In an interview Wednesday with Recode, Benioff said he reads 500 to 600 emails a day and could never recall a time when he straight-up opposed the measure. He did acknowledge that, after a vacation for much of June, he didn’t really know what Proposition C, as it’s now known, was until September.“I know I definitely hadn’t studied it or hadn’t done any deep work,” he said. “Because I do so many emails with so many people, I could be responding to things where I don’t even know what I’m responding to.”The emails matter because Benioff has cast himself as part of a new wave of tech philanthropists and as one of the city’s corporate leaders. And, as someone who has aggressively pushed other business leaders to be more financially charitable, he has left little room for any equivocating — painting a stark, personal portrait of the supporters and opponents of the measure, which is quickly gaining national attention. Benioff said earlier this week that city leaders could only be “for the homeless” or “for yourself.”San Francisco has been know for having one of the country’s worst homelessness problems. Proposition C would impose an additional tax on corporations with more than $50 million in revenue to support things like expanded mental health treatment.Benioff added that he continues to share those economic concerns that he expressed in July. “Who cannot have those concerns?” he said. “I have those concerns too. But I’m much more concerned about the homeless than I am about those questions.”Benioff, who helped raise $37 million for homeless families, has long been an outspoken advocate for the homeless; his local philanthropy is laudable.He has loudly voiced frustration with other tech billionaires for their lack of charity to the city they operate in and he has previously called for more government intervention only after feeling that the private sector was not doing enough.What also changed since July: A report from the City Controller’s office that Benioff said was the key driver of his decision. That report, released in late September, convinced Benioff that the economic impact of the tax increase would be smaller than he feared.“We didn’t make any decisions until we saw the Controller’s report,” Benioff said. “That’s what really swayed me.”Salesforce said in mid-July, prior to the email seen by Recode, that the company was “evaluating the ballot measure to carefully assess its merits in addressing this important issue.”During the month of September, Benioff said he was closely consulting with new San Francisco Mayor London Breed — along with his late-night conversations on Twitter with a local bookstore owner, Christin Evans. Breed declared her opposition to the measure this month, noting that the city should do a better job with its existing homelessness resources. Benioff said that he was in touch with Breed as recently as Wednesday, despite being on opposite sides of Proposition C.Benioff went public on Oct. 8.Whatever his position, the Salesforce CEO’s involvement has focused national attention on the homelessness issue, especially given that other prominent tech CEOs — such as Twitter’s Jack Dorsey — are publicly opposing it. Benioff told Recode he was “grateful” for the public bickering with the Twitter CEO.Marc: you’re distracting. This is about me supporting Mayor @LondonBreed for *the* reason she was elected. The Mayor doesn’t support Prop C, and we should listen to her. I support the Mayor, and I'm committed to helping her execute her plan.“Nobody cared about anything,” Benioff said, “until he commented.”Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.Sign up for our Recode Daily newsletter to get the top tech and business news stories delivered to your inbox.The city has seen some of the worst air quality in the world in the past few days.The company is under fire, again, this time for years of dirty tricks exposed by the New York Times.Plus: How Facebook, Google and Amazon got away with not being regulated; the FCC gives Elon Musk the green light to launch more than 7,000 internet satellites; the word of the year is ...Also: Zuckerberg gave Sandberg his personal vote of confidence following a damning New York Times story published Wednesday.A Verge affiliate site"}