{"id": "Bipartisan Senate bill would penalize illegal robocalls", "paragraph": "Sens. John ThuneJohn Randolph ThuneHillicon Valley: Russian-linked hackers may have impersonated US officials | Trump signs DHS cyber bill | Prosecutors inadvertently reveal charges against Assange | Accenture workers protest border enforcement work | App mines crypto for bail bonds Senators push bipartisan bill to crack down on robocalls McConnell, Flake clash over protecting Mueller probe MORE (R-S.D.) and Ed MarkeyEdward (Ed) John MarkeyHillicon Valley: Russian-linked hackers may have impersonated US officials | Trump signs DHS cyber bill | Prosecutors inadvertently reveal charges against Assange | Accenture workers protest border enforcement work | App mines crypto for bail bonds Senators push bipartisan bill to crack down on robocalls Warren, 2020 Dems target private immigration detention center operators MORE (D-Mass.) introduced legislation Friday that would levy a hefty fine on illegal robocalls and attempt to prevent them from reaching consumers in the first place. Thune, chairman of the Senate Commerce, Science and Transportation Committee, and Markey, a member of the committee, introduced the Telephone Robocall Abuse Criminal Enforcement and Deterrence (TRACED) Act Friday, which would allow the Federal Communications Commission (FCC) to levy civil penalties of up to $10,000 per call.“The TRACED Act targets robocall scams and other intentional violations of telemarketing laws so that when authorities do catch violators, they can be held accountable,” Thune said in a press release. “Existing civil penalty rules were designed to impose penalties on lawful telemarketers who make mistakes. This enforcement regime is totally inadequate for scam artists and we need do more to separate enforcement of carelessness and other mistakes from more sinister actors.”“As the scourge of spoofed calls and robocalls reaches epidemic levels, the bipartisan TRACED Act will provide every person with a phone much needed relief,” Markey added. “It’s a simple formula: call authentication, blocking, and enforcement, and this bill achieves all three. I thank Chairman Thune for his partnership on this effort, and look forward to seeing this legislation through to its passage.”Besides imposing fines, the bill would direct the FCC to help protect subscribers from receiving unwanted calls or texts, extend the window for FCC enforcement to three years after the robocall is placed, bring together several agencies and offices to report to Congress how to improve illegal robocall prevention and require providers of voice services to adopt call authentication technologies. The website YouMail, which monitors robocalls and provides a blocking service estimates that 5.1 billion robocalls were made in October alone, amounting to 2,000 per second. However, it is unclear how many of those were illegal.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}