{"id": "Trump: My primary focus for midterms has been on Senate", "paragraph": "President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE said Sunday that Republicans will likely \"do well\" in the House during the upcoming midterms, while noting that his \"primary focus\" in campaigning has been on the Senate.Speaking with reporters outside the White House before departing for Georgia, Trump said \"there are so many people in the House and that's a lot of stops.\" \"But I have done some House work also. But I think we’re going to do well in the House but as you know, my primary focus has been on the Senate and I think we are going to do really well in the Senate,\" he said in an exchange captured by CNN two days before the midterm elections. \"With so many people in Congress, with so many people in the House, it’s very hard to make those stops. But I’ve made a number,\" Trump added.President Donald Trump on the midterms: “I think we are going to do well in the House, I think we are going to do really well in the Senate ... the level of fervor, the level of fever is very strong on the Republican side” pic.twitter.com/WHrn1NNiYEPolling has suggested that Republicans are likely to maintain their majority in the Senate, where a number of Democrats are up for reelection in states Trump won in 2016. But Democrats are likely to flip the House and regain control of the lower chamber, polls have indicated.Trump added Sunday that \"the level of fervor, the level of fever is very strong on the Republican side.\"“There is something going on out there, and I think you know what I mean. … The level of fervor, the level of fever is very strong on the Republican side. So I can’t speak to the blue, but I can speak to the red. There’s a lot of energy out there,\" he said. View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}