{"id": "Lieberman: Trump should ‘stand back’ from the Florida recount", "paragraph": "Former Sen. Joe Lieberman (I) said Monday that President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE ought to stay out of the arguments over the vote recount taking place in Florida.\"In 2000 there was a lot of screaming by politicians in both parties...but not from President Clinton to his great credit, even though he deeply wanted Al GoreAlbert (Al) Arnold GoreIncoming Michigan Dem will not back Pelosi Florida has chance to redeem itself Meet the lawyer Democrats call when it's recount time MORE and me to get elected,\" Lieberman said on CNN, recalling disputes over the presidential recount in Florida. Lieberman ran as vice president on Gore's ticket in 2000.\"I think that was the right way [to handle it],\" Lieberman said. \"And I think that President Trump would be best to stand back.\"\"It's hard for him to do,\" he admitted. \"It's not his nature.\"\"But there's enough other people in Florida and elsewhere to be screaming at each other about this vote recount that the president of the united states ought to stay above.\"Trump has spoken out about the recounts taking place across Florida and Arizona. He suggested last week that \"election fraud\" had taken place in Florida and urged officials on Monday to go with the initial results from the midterm elections, where Republicans Ron DeSantisRonald Dion DeSantisDeSantis transition team zeroes in on possible chief of staff Trump congratulates Kemp, says Abrams will have 'terrific political future' Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority MORE and Rick Scott won their races.Trump argued that \"an honest vote count is no longer possible.\"DeSantis, a former congressman, is facing down Tallahassee Mayor Andrew Gillum (D) in the state's gubernatorial race, while Scott, the current governor, has battled Sen. Bill NelsonClarence (Bill) William NelsonDems seek to overhaul voting rules in Florida legal fight  Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Trump's take on midterms: ‘Epic' win in Senate, ‘better than other sitting Presidents’ in House MORE (D) for Nelson's Senate seat.The two counties still tallying votes, Broward and Palm Beach, have come under scrutiny and a judge ruled that both had been insufficiently transparent about their polling process.However, the court did not bring forth any evidence of voter fraud.The Florida Department of Law Enforcement also declined to investigate Broward, as Scott requested, saying that they had not received credible allegations of voter fraud.A Broward Circuit Judge also denied Scott's request that the FDLE impound ballots and voting machines in the county when not in use on Monday.Meanwhile, Nelson has called for Scott to recuse himself from \"any role\" in the recount process.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}