{"id": "Poll: Kemp, Abrams locked in tight Georgia governor's race", "paragraph": "Republican Brian Kemp and Democrat Stacey Abrams (D) are virtually tied in Georgia’s closely followed gubernatorial race, according to a new NBC News/Marist poll released Wednesday.Kemp, Georgia's secretary of state, leads Abrams, a former minority leader of the Georgia House of Representatives, by 49 percent to 47 percent.The margin shrinks to 46 percent to 45 percent when including Libertarian candidate Ted Metz, who gets 4 percent support among those polled. If no candidate gets over 50 percent of the vote on Nov. 6, the top two vote-getters will compete in a runoff on Dec. 4.The Cook Political Report rates the race as a “toss up.” An average of polls complied by RealClearPolitics, which does not include the NBC News/Marist poll, has Kemp up by 1.5 points.Kemp has tied himself closely to President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE, who has endorsed the Republican.Kemp distinguished himself in the Republican primary with ads that touted hardline policies on hot button issues.“I got a big truck just in case I need to round up criminal illegals and take them home myself. Yup, I just said that,” he says in one ad.Abrams has garnered the endorsements of progressive groups such as MoveOn.org Political Action and Our Revolution, though she is also wooing more moderate voters in Georgia.She’s also gathered endorsements from establishment candidates such as former Presidents Jimmy Carter and Barack ObamaBarack Hussein ObamaAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural Trump's take on midterms: ‘Epic' win in Senate, ‘better than other sitting Presidents’ in House NASA's carpool to Space Station is back on as Russian rocket Soyuz quickly returns to flight MORE, as well as former Vice President Joe BidenJoseph (Joe) Robinette BidenEntrepreneur touts big solutions, endorsements in discussing presidential bid Avenatti ‘still considering’ presidential run despite domestic violence arrest Election Countdown: Florida Senate race heads to hand recount | Dem flips Maine House seat | New 2020 trend - the 'friend-raiser' | Ad war intensifies in Mississippi runoff | Blue wave batters California GOP MORE.Kemp leads among white voters by a 35-point margin, rural voters by a 35-point margin, men by an 18-point margin and voters without a college degree by an 11-point margin, according to the NBC News/Marist poll.Abrams leads among African American voters by a 73-point margin, younger voters by a 13-point margin, women by a 14-point margin and voters with a college degree by a seven-point margin. Abrams also leads among independent voters by a 50-41 margin.Meanwhile in terms of President Trump, about 49 percent of likely voters approve the job he’s doing as president, while 45 percent disapprove.The race has been marked by allegations of voter suppression from Kemp's secretary of state office.Abrams has called on Kemp to step down after The Associated Press reported that more than 53,000 voter registration applications — 70 percent of them from black voters — are on hold after failing to meet the state’s “exact match” law.Kemp has strongly denied he or his office are looking to suppress the minority vote.The NBC News/Marist poll surveyed 554 likely voters from Oct. 14-18 and has a margin of error of +/- 4.8 percent.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}