{"id": "Trump to hold two rallies for Hyde-Smith day before Mississippi runoff", "paragraph": "President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE will hold two campaign rallies for Sen. Cindy Hyde-Smith (R-Miss.) the day before the runoff in Mississippi's tight Senate race. “Our campaign is working hard for a big election-day turnout, so the President’s visit the day before the runoff will be a good boost to make sure all conservatives know they have a very clear choice in this runoff election,” Hyde-Smith said in a statement Saturday.Very excited @realDonaldTrump is coming back to Mississippi to support our campaign with two great events now being planned here on Monday, November 26! #MAGA #TeamCindy #Cindy2018 #MSSENTicket Info Here >>> https://t.co/lVd9BFQyuA pic.twitter.com/nsBQxpbFgnThe race headed to a runoff after none of the candidates got a majority of the votes. Hyde-Smith will face off against Democrat Mike Espy, a former U.S. Agriculture secretary, in the Nov. 27 runoff.In the first round of voting, Hyde-Smith split the Republican vote with conservative firebrand and Trump supporter Chris McDaniel, who will not appear in the runoff. Hyde-Smith got about 42 percent of the vote, while McDaniel got about 17 percent. About 41 percent of Mississippi voters supported Espy.The dual rallies suggest Republicans are concerned the Senate seat in ruby-red Mississippi may be in jeopardy.Recent gaffes by Hyde-Smith have Democrats hoping they could pull off an upset in the Deep South reminiscent of last year’s Alabama Senate race in which Sen. Doug Jones (D) defeated a deeply flawed candidate in Roy MooreRoy Stewart MooreParties start gaming out 2020 battleground Victimhood culture and traditional justice are on a collision course Flake says he's rooting for Democrat running against Steve King MORE.Hyde-Smith first faced intense backlash after she claimed she’d be “on the front row” should a supporter she was campaigning with invite her to a “public hanging.\" \"In referencing the one who invited me, I used an exaggerated expression of regard, and any attempt to turn this into a negative connotation is ridiculous,” Hyde-Smith said.Mississippi had the highest number of lynchings from 1882-1968, according to the NAACP.Espy, who is running to be Mississippi’s first black senator since Reconstruction, ripped the comment as \"reprehensible\" and \"hurtful.\"Hyde-Smith also faced criticism after video emerged of her saying “maybe we want to make it just a little more difficult” for liberal students to go vote. Her campaign dismissed that comment as a joke. With the runoff already expected to be a low-turnout contest, the comments have energized Espy’s supporters, with Republicans hoping a presidential visit can do the same for their side. Trump won Mississippi by nearly 20 points in 2016 and remains popular there.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}