{"id": "Mellman: Can voters tell us whether they’ll turn out?", "paragraph": "It’s that point in the cycle when everyone lowers their voice, along with their head, and knowingly suggests, “It’s all about turnout.”Leaving aside the veracity of the statement itself, it certainly puts pressure on pollsters to correctly predict the likely electorate.Many employ straightforward questions to ascertain whether an individual is likely to turn out.But this is another example of poll questions that don’t mean what they say. These so-called turnout screens don’t work very well.Most pollsters ask some version of, “How likely are you to vote in the election in November? Are you almost certain to vote, will you probably vote, are the chances 50-50, or don’t you think you will vote?”You would think that almost everyone who says they are “certain” to vote will go ahead and cast a ballot, while those who say 50/50 or less won’t bother to turnout.Research by Todd Rogers and Masa Aida found that in the 2008 general election 13 percent of those who were “certain to vote” did not, while, in the New Jersey gubernatorial election, a 54 percent majority of those “certain to vote” failed to actually turnout.Forty-five percent to 67 percent of those who said “50/50” actually cast a ballot, while 29-55 percent of those who were unlikely to vote actually did.Not a great showing.In a study of the 2014 congressional elections, Pew put Gallup’s likely voter questions to the test. Among those who scored the highest on Gallup’s scale, 83 percent voted, but 17 percent apparently did not. Moreover, over 20 percent of actual voters scored at the bottom end of the scale and would have certainly been removed from the pool of “likely voters.” It should come as no surprise.We’re lucky in political polling: respondents’ voting intentions are often reflected in their ultimate vote choice.By contrast, in commercial market research, the correlation between intentions and behavior is only about 0.5. So, there’s no particular reason to expect voters to accurately predict their likelihood of turning out.If people can’t predict whether they’ll buy a car this month or what kind of cereal they’ll purchase, why should they be able to assign a likelihood to their turning out to vote?Pollsters have experimented with other formulations, like asking how enthusiastic respondents are about voting. It seems like a sensible surrogate.But when we explored the relationship between enthusiasm and turnout in one race, we found none.Among those who were “very” enthusiastic about voting for the top-of-the-ticket Democratic candidate, 88 percent voted; among those who were “somewhat” enthusiastic, 83 percent turned out; and among those “not too” enthusiastic, a slightly larger 85 percent turned out.Gallup also found that its measure of the electorate’s aggregate enthusiasm is also unrelated to actual midterm turnout.Indeed, on some occasions, Gallup has recorded higher levels of enthusiasm for midterms than for presidential elections, even though in modern times, midterm turnout has never equaled, let alone exceeded, the percentage voting in presidential years.As the mutual fund ads say, “past performance is no guarantee of future results,” but prior behavior is the best guide to the future we have, and far better than people’s own predictions.Someone who says they are certain to vote, but never has, is less likely to turn out than someone who says they probably won’t, but always does.Polls always produce answers to questions we pose. But we should never simply assume those answers comport with reality.Sometimes they do, like when we ask which candidate folks will vote for, right before the election.Sometimes they don’t, like when we ask whether someone will turn out or, as I discussed a couple of weeks ago, whether a particular piece of information makes them more or less likely to support a candidate.Knowing the difference between what respondents can and cannot accurately report is important.Mellman is president of The Mellman Group and has helped elect 30 U.S. senators, 12 governors and dozens of House members. Mellman served as pollster to Senate Democratic leaders for over 20 years and as president of the American Association of Political Consultants.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}