{"id": "The results are in: How the nation voted on criminal justice issues that impact our youth", "paragraph": "The 2018 midterm elections have come to an end, and, while the outcomes of some races remain unknown, it is safe to say that the outcome for young people across the country was overwhelmingly positive. While most of the country was glued to the results in competitive U.S. House and Senate races, it was the state and local elections that that will make a huge difference in the lives of young people.Starting with the top state executive, twenty states will welcome new governors in 2019. One of those new governors includes Tony Evers in Wisconsin. Gov.-elect Evers will be tasked with overseeing the closure of two juvenile prisons. Early in 2018, current Gov. Scott Walker announced a plan to overhaul Wisconsin’s juvenile corrections and treatment system, and in March, state lawmakers passed a bill that requires that two juvenile facilities, Lincoln Hills School for Boys and Copper Lake School for Girls, to close by January 2021. Both facilities have been subject to investigations and lawsuits over allegations of excessive use of force, abuse, and neglect. Evers campaigned on criminal justice reform, and his lieutenant governor-elect, Mandela Barnes, showed a strong commitment to juvenile justice reform during his time in the Wisconsin General Assembly. While it is not often the case that a new governor will see through the projects of the past administration, this shift is likely to greatly benefit youth in the justice system (and hopefully pave the way for Wisconsin to FINALLY join 46 other states in raising the age of criminal responsibility to 18).As state legislators gear up for the 2019 session, the Missouri General Assembly will welcome back Rep. Nick Schroer, champion of  “Raise the Age” legislation, which passed in May of this year and raises the age of criminal responsibility in Missouri. With his reelection, Schroer will be able to oversee the critical implementation of the new law.In years past, people often paid less attention to the elections for state attorneys general, district attorneys, and judges, but these are all critical elections when it comes to positive outcomes for our young people. Fortunately, voter enthusiasm this year seemed to stretch across the ballot, which is a great sign for youth justice.In Michigan, the state with the largest population of juveniles serving life without parole terms, attorney Dana Nessel won her election for state attorney general. Nessel will replace current Attorney General Bill Schuette, who resisted the release of juvenile lifers after the Supreme Court ruled in 2016 that the landmark ruling in Miller v. Alabama must be applied retroactively. Nessel stated in an interview leading up to the election that, in all but the most extreme cases, a person should receive the opportunity to be paroled.He might have been running unopposed, but St. Louis County elected its first black prosecutor, Wesley Bell, after he defeated the incumbent in the primary election in August. Bell campaigned on reforming the criminal justice system, including on focusing on rehabilitation over incarceration for juveniles. In Massachusetts, Rachael Rollins will become Suffolk County’s first black district attorney. Rollins also made criminal justice reform, including looking at alternatives to incarceration, a key part of her platform.Days before the election, a story broke in Harris County, Texas that three judges in the juvenile district courts were assigning a large number of cases to a handful of private lawyers, all of whom had donated to those judges’ campaigns. Furthermore, these judges were responsible for sending nearly 20 percent of all youth to state prisons run by the Texas Juvenile Justice Department, which has greatly downsized its population from other jurisdictions. All three judges lost their bids for reelection. Voters in Durham, N.C., another state that recently raised the age of criminal responsibility, also elected a slate of reform-minded judges; again important as a 16-year-old girl took her life in a Durham County jail last year.The midterm elections also saw numerous ballot initiatives in the states. Unfortunately, voters in six states voted in favor of a measure commonly referred to as Marsy’s Law, bringing the total number of Marsy’s Law states up to nine (it was rejected as a bill in New Hampshire earlier this year and failed as a state constitutional amendment in Iowa). Marsy’s Law guarantees crime victims more access to legal proceedings and provides them with more information on parole opportunities and releases from jails or prisons. While the law sounds good in theory, these measures can jeopardize the confidentiality of juvenile cases, which is a key difference between the juvenile and adult criminal justice systems. Some advocates also worry that it could lead prosecutors to taking a more punitive approach in juvenile cases, rather than looking at treatment and rehabilitation. In happier news, Florida voters overwhelmingly passed Amendment 4, which will restore the right to vote for more than a million formerly incarcerated Floridians. This is an exciting victory, particularly for a state that prosecutes more children in the adult criminal justice system than any other state.While the state and local elections were more consequential for our nation’s young people, there were some federal elections worth noting. Rep. Bruce WestermanBruce Eugene WestermanOvernight Energy: Trump to nominate Wheeler as EPA chief | House votes to remove protections for gray wolves | Lawmakers aim to pass disaster funds for California fires House votes to remove protections for gray wolves Congress should ban life without parole sentences for children  MORE (R-Ark.) won his race for re-election. Westerman introduced a bill this Congress that would end life without parole sentences for youth in the federal system. Unfortunately, the bill has not made much progress in the current Congress, but Westerman will now be able to re-introduce the bill at the start of the 116th Congress. Rep. Bobby ScottRobert (Bobby) Cortez ScottThe results are in: How the nation voted on criminal justice issues that impact our youth Dems want to hold officials’ feet to the fire on ObamaCare Healthy business vs healthy people — how will this administration address the two? MORE (D-Va.) was also re-elected and is now poised to become the chairman of the House Committee on Education and the Workforce. Scott has proven to be a tireless advocate for justice-involved youth and will now be in charge of setting the committee’s agenda.Finally, a record number of women will be heading to Congress in January. As we noted earlier this year, research shows that women introduce and pass more legislation than their male counterparts, they send more federal dollars home to their district, and they are more likely to reach across the aisle to get things done. Women also tend to prioritize issues connected to women and families, which gives juvenile justice advocates the chance to ensure that issues facing justice-involved youth and their families are getting the attention they deserve. The number of women in state and local elected positions will also be increasing. Three states, Maine, South Dakota, and Iowa, each elected their first woman governor. In Texas, 19 women won their elections to become judges in a single county.While the election is finally over, the work for juvenile justice advocates has only just begun. We must hold our elected officials accountable for the promises they made while campaigning, and we must continue to meet with and educate them so they understand the issues facing our young people. On Nov. 6, we voted for youth justice, but now we must ensure justice is achieved.Rachel Marshall is the federal policy counsel for the Campaign for Youth Justice, a national initiative focused entirely on ending the practice of prosecuting, sentencing and incarcerating youth under the age of 18 in the adult criminal justice system.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}