{"id": "Washington Post blasts Saudi 'fable' on Khashoggi's death", "paragraph": "The Washington Post editorial board on Saturday tore into Saudi Arabia's explanation for the death of dissident journalist Jamal Khashoggi, calling it a \"fable.\"The newspaper's latest editorial also slammed President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE for stating Friday that he found it credible that the journalist died after a fight broke out after he entered the Saudi consulate.\"That President Trump would pronounce this fable credible only underlines his shameful intent to assist in the attempt of the regime — and, in particular, the crown prince — to escape meaningful accountability,\" the newspaper's editorial board wrote, adding that the story of Khashoggi's death offered by Saudi officials was \"utterly devoid of credibility.\"\"As Mr. Trump surely knows, the new Saudi cover story is contradicted not just by evidence collected by Turkish authorities and by journalists but also by the reporting of the U.S. intelligence community,\" the Post's editors continued.\"All point to Mohammed bin Salman as the instigator of a premeditated, cold-blooded and brutal murder, followed by the dismemberment of Mr. Khashoggi’s body,\" they added, referring to the Saudi crown prince.Khashoggi, who served as an opinion contributor for the newspaper, was last seen entering the Saudi consulate in Istanbul on Oct. 2. The Saudi government had claimed that they didn't know where he was, before acknowledging Friday that he had died inside the consulate.Trump on Friday lauded Saudi Arabia's initial arrests of more than a dozen Saudi nationals as a \"good first step\" by the Kingdom in responding to the investigation.\"It's a big step. There's a lot of people involved,\" Trump told reporters, adding when pressed that he found the Saudi explanation for Khashoggi's death to be credible.Other Republicans, including Sen. Lindsey GrahamLindsey Olin GrahamOn The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report Cotton opposes Trump-backed criminal justice bill Lawmakers say California will eventually get emergency funding for fire relief MORE (R-S.C.), torched the Saudi government's official explanation, saying it was not credible.“To say that I am skeptical of the new Saudi narrative about Mr. [Jamal] Khashoggi is an understatement,” Graham wrote Friday in a string of tweets.“First we were told Mr. Khashoggi supposedly left the consulate and there was blanket denial of any Saudi involvement. Now, a fight breaks out and he’s killed in the consulate, all without knowledge of Crown Prince,” he added, referring to the Saudi government's evolving explanations for the incident.The disappearance and death of Khashoggi has sparked international uproar and ensnared the Trump administration, which has put a close relationship with Riyadh at the center of its foreign policy strategy.Finance ministers from the U.S. and several other countries have withdrawn from a planned conference in Riyadh later this month over the journalist's fate, though it is unclear what response the U.S. may have for his death.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}