{"id": "Swalwell on wildfires: Trump ‘owns a lot of the problem’ on forest management", "paragraph": "Rep. Eric SwalwellEric Michael SwalwellSwalwell defends Pelosi: We need her 'on the mound' McConnell pens editorial calling for bipartisanship after Dems take House Nearly six in ten want someone other than Trump elected president in 2020: poll MORE (D-Calif.) on Monday said President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE \"owns a lot of the problem\" on forest management, noting the federal government oversees more than half of the forests in California.Swalwell, who is rumored to be interested in a 2020 presidential bid, made the remark in response to Trump's tweets over the weekend, which blamed California state officials for the wildfires ravaging both sides of the state. The fires have killed 31 people so far, with nearly 230 people missing in Northern California.\"I’m sorry that so many families are going through this in California,\" Swalwell said on CNN's \"The Situation Room.\"\"They don’t deserve to be insulted by the president.\"\"The president should just remain quiet,\" Swalwell added. \"But ... a majority of the forests in California are under the president’s management. He’s been on the job for two years. If he’s blaming forest management, he owns a lot of the problem.\"“The President should just remain quiet,” California Rep. Eric Swalwell says about President Trump’s tweet saying the California fires are due to forest mismanagement. https://t.co/OdioTlSjal pic.twitter.com/ePyTYS1HZ2Trump over the weekend blamed the fires, which are the most destructive in the state's history, on \"gross mismanagement\" of the forests. Fire officials and lawmakers were quick to point out that nearly 60 percent of California's forests are under federal oversight.The areas most damaged by California's ongoing wildfires have been those managed by the federal government. Last year in the state, 742,050 acres of federal land managed by the U.S. Forest Service burned compared to around 505,956 acres of state-managed land.The Trump administration has also proposed slashing tens of millions of dollars from the federal agencies that oversee the California forests, McClatchy DC reported. California Gov. Jerry Brown's (D) office on Sunday said they are focused on the wildfires are not Trump's \"inane and uninformed tweets.\"Brown during a Sunday press conference called the wildfires ravaging the state \"the new abnormal,\" warning environmental disasters will only \"intensify\" over the next two decades. \"This is not the new normal,\" Brown said at the press conference. \"This is the new abnormal, and this new abnormal will continue, certainly in the next 10, 15, 20 years.\"View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}