{"id": "Overnight Defense: Saudi crown prince calls Khashoggi killing 'heinous crime' in first public remarks | Dems demand briefing on Trump leaving arms control treaty | Lawmakers want probe into Pentagon cloud computing contract", "paragraph": "Happy Wednesday and welcome to Overnight Defense. I'm Rebecca Kheel, and here's your nightly guide to the latest developments at the Pentagon, on Capitol Hill and beyond. CLICK HERE to subscribe to the newsletter. THE TOPLINE: Saudi Crown Prince Mohammed bin Salman gave his first public remarks Wednesday on the killing of journalist Jamal Khashoggi -- attempting to distance himself from an act many are skeptical he did know about.Speaking at the Future Investment Initiative business conference, Prince Mohammed called Khashoggi's killing a \"heinous crime\" and vowed to bring the perpetrators to justice.\"The crime was really painful to all Saudis, and I believe it is painful to every human in the world,\" Prince Mohammed said at an investment conference. \"It is a heinous crime that cannot be justified. Today, Saudi Arabia is carrying out all legal things to finalize the investigation to work with the, cooperate with the Turkish government and to present the perpetrators to the court and take their judgment.\"Timing: Recall that a day before, President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE dialed up his rhetoric against the kingdom and his administration announced its first punitive steps against the Saudis.On Tuesday, Trump called the Saudi response the Khashoggi's killing the \"worst cover-up ever.\" He also for the first time suggested Prince Mohammed could be involved in the mission to kill Khashoggi.\"He's running things and so if anybody were going to be, it would be him,\" Trump told the Wall Street Journal.Secretary of State Mike PompeoMichael (Mike) Richard PompeoOvernight Defense — Presented by Raytheon — Lawmakers struggle with how to punish Saudi Arabia | Trump regrets not visiting Arlington for Veterans Day | North Korea deports detained American Corker: 'A price needs to be paid' for Khashoggi's murder White House eyeing ways to remove Erdoğan foe Gülen from US: report MORE also announced Tuesday that visas will be revoked for those the United States has identified as suspects in the killing and said sanctions are also being considered.Saudi-Turkish relationship: People in Washington have been questioning how the crisis will affect the U.S.-Saudi relationship.Prince Mohammed didn't address that. But he did vow the issue won't break the Saudi-Turkish relationship.\"We know that many are trying to use this painful thing to drive a wedge between Saudi Arabia and Turkey,\" he said. \"I want to send them a message. They will not be able to do that as long as there is a king called King Salman bin Abdulaziz and a crown prince called Mohammed bin Salman in Saudi Arabia and a president in Turkey called Erdogan.\"Prince Mohammed and Turkish President Recep Tayyip Erdogan reportedly spoke by phone Wednesday, a day after Erdogan called the killing a \"savage\" premeditated murder directed by top Saudi officials.A laughing matter?: Prince Mohammed made his comments Wednesday on a panel alongside the prime minister of Lebanon and the crown prince of Bahrain.As the panel wrapped up, Prince Mohammed decided to make a joke about allegations he kidnapped Lebanese Prime Minister Saad Hariri last year.\"I just want to conclude with one thing: Prime Minister Saad is going to be here for two days, so please, no ideas that he is kidnapped,\" Prince Mohammed said at the end of the panel.After the line, Hariri and Prince Mohammed laughed and shook hands.In November 2017, Hariri was reportedly forcibly detained in Saudi Arabia as part of Prince Mohammed's efforts to pressure Lebanon on its relationship with Iran and Hezbollah.While in Saudi Arabia, Hariri tendered his resignation as prime minister via a televised message. Weeks later, he returned to Lebanon and withdrew his resignation.Critics say the bizarre episode with Hariri was early evidence of Prince Mohammed's strong-arm tactics that are even more apparent after Khashoggi's killing. DEMS DEMAND ARMS TREATY BRIEFING: The top Democrats on the House Armed Services and Foreign Affairs committee penned Wednesday a furious, four-page letter to Defense Secretary James MattisJames Norman MattisOvernight Defense — Presented by Raytheon — Lawmakers struggle with how to punish Saudi Arabia | Trump regrets not visiting Arlington for Veterans Day | North Korea deports detained American Ousted Bolton aide says it was 'an honor' to serve Trump administration Macron’s 'Euro-army' is an idea whose time has come MORE and Secretary of State Mike Pompeo demanding they personally brief lawmakers on Trump's decision to withdraw from the Intermediate-range Nuclear Forces (INF) Treaty.\"We write to express our grave concern that the Trump administration is notifying Russia that the United States intends to unilaterally withdraw from the Intermediate Range Nuclear Forces (INF) Treaty, without any notice to or consultation with Congress, even as our committees had requested a briefing on these issues,\" wrote Reps. Adam SmithDavid (Adam) Adam SmithPentagon official: Trump's Space Force could cost up to  billion Trump faces new hurdles on foreign policy Overnight Defense — Presented by Raytheon — Trump's Armistice Day trip marked by controversy | US ends aerial refueling to Saudi coalition in Yemen | Analysts identify undeclared North Korean missile bases MORE (D-Wash.) and Eliot EngelEliot Lance EngelOvernight Defense — Presented by Raytheon — Border deployment 'peaked' at 5,800 troops | Trump sanctions 17 Saudis over Khashoggi killing | Senators offer bill to press Trump on Saudis | Paul effort to block Bahrain arms sale fails Trump faces new hurdles on foreign policy Republicans jockey for top GOP spot on House Foreign Affairs Committee MORE (D-N.Y.), the ranking members of Armed Services and Foreign Affairs, respectively.\"If this action is taken, it would risk an arms race, would jeopardize the security of our allies in Europe and Asia, and would significantly undermine U.S. leadership on arms control,\" they added.The letter was co-signed by Rep. Gregory MeeksGregory Weldon MeeksOvernight Defense: Saudi crown prince calls Khashoggi killing 'heinous crime' in first public remarks | Dems demand briefing on Trump leaving arms control treaty | Lawmakers want probe into Pentagon cloud computing contract Dems demand Mattis, Pompeo brief on Trump's withdrawal from arms control treaty Trump Jr., Dem congressman spar over Ellison's association with Farrakhan MORE (D-N.Y.), the ranking member of the Foreign Affairs subcommittee on Europe, Eurasia and Emerging Threats.Concerns: The lawmakers ticked off a slew of concerns with Trump's decision to withdraw from the treaty that bans ground-launched nuclear and conventional missiles with intermediate ranges.For one, they said, it \"discards the results of the administration's own extensive review\" on how to respond to Russia's treaty violations.They also said it plays into Putin's hands, drives a wedge between NATO allies and is unsupported by any Pentagon determination on the need to test or deploy INF-banned missiles.Questions: Lawmakers won't get back in town for any potential briefing until the week of Nov. 13.In the meantime, the Democratic trio had a list of questions they want Pompeo and Mattis to answer in writing by Nov. 2.They asked for an assessment of the military threat to the United States and its European allies of deploying intermediate-range missiles without restriction, the status of the administration's December 2017 announcement on using an integrated approach to push Russia back into compliance and the status of consultations with allies.The lawmakers also raised concerns about the status of a separate treaty with Russia known as New START, which caps the number of nuclear warheads each country is allowed to deploy. The treaty is up for renewal in 2021. JEDI QUESTIONS: Two Republican lawmakers are asking the Pentagon's inspector general to investigate the bidding process for a multibillion-dollar Defense Department cloud computing contract, which critics claim is biased toward Amazon.Reps. Steve WomackStephen (Steve) Allen WomackCongressional panel scales back bipartisan budget reform proposal Hillicon Valley: Officials prepare for fake election hack claims | Apple chief calls for tougher data rules | Lawmakers want Pentagon to probe cloud computing contract | Facebook, Twitter find no proof of Chinese meddling Overnight Defense: Saudi crown prince calls Khashoggi killing 'heinous crime' in first public remarks | Dems demand briefing on Trump leaving arms control treaty | Lawmakers want probe into Pentagon cloud computing contract MORE (R-Ark.) and Tom ColeThomas (Tom) Jeffrey ColeDemocratic gains erasing House GOP in California House GOP returns to Washington after sobering midterm losses Race for Appropriations ranking member heats up MORE (R-Okla.) in a letter dated Monday expressed their concerns about the process behind the Joint Enterprise Defense Infrastructure (JEDI) cloud contract, which they fear might be \"tailored to one specific contractor.\"They noted that currently the JEDI contract specifies that the vendor who wins it must meet Impact Level 6 requirements to host secret and top-secret data. The lawmakers called the requirement \"unnecessary\" and noted it can \"only be met by one contractor.\"They didn't specify the contractor, but the only company bidding that meets the requirements is Amazon Web Services.The duo also expressed concerns about whether the contract bidding requirements violated Pentagon ethics rules.Background: The letter is the latest flashpoint over the lucrative $10 billion Pentagon cloud computing contract. Since the start of the bidding process, critics, including many bidding competitors to Amazon, have alleged that the process is biased towards the Seattle-based company.They say that Amazon lobbyists' connections to the Defense Department helped craft a contract tailor-made for the company and that other competitors, including Microsoft and IBM, have no realistic shot of winning.Amazon did not immediately respond for a request to comment on the letter, but in the past the company has dismissed accusations that it has any sort of inside track in the contracting process. ON TAP FOR TOMORROWThe Brookings Institution will host an expert panel to discuss \"U.S. policy and the war in Yemen\" at 10 a.m. https://brook.gs/2SejKAlThe Atlantic Council will host a panel including Norwegian Ministry of Defense policy director Svein Efjestad to discuss \"Security in Northern Europe: Deterrence, Defense and Dialogue\" at 3:30 p.m. https://bit.ly/2EjTEsUDefense Secretary James Mattis will participate in a White House commemoration of the 35th anniversary of the suicide bombing of the Marine Barracks in Beirut at 6 p.m. https://bit.ly/2PSK8yd ICYMI-- The Hill: Pentagon expands bug bounty program with contracts to three private security firms-- The Hill: Majority says Trump is too soft on Saudi Arabia: poll-- The Hill: Iran: Saudi Arabia 'wouldn't dare' kill Khashoggi without US protection-- The Hill: Kremlin: Trump's intention to develop new missile 'extremely dangerous'-- The Hill: NATO: More nukes in Europe not likely in response to Russian treaty breach-- The Hill: Opinion: Russia's threats go beyond elections-- The Hill: Opinion: America's allies: The fourth strategic offset-- The Washington Post: U.S. military scales back contacts with Afghans after 'insider' shootings-- Associated Press: Retired US general says war with China likely in 15 yearsView the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}