{"id": "Pavlich: Arizona doesn’t deserve Sinema", "paragraph": "We’re one week away from the 2018 midterm elections. In the months leading up to Nov. 6, we’ve seen predictions of a “blue wave,” “red wave,” and everything in between. But as voters head to the polls Tuesday, one thing is clear: Arizona doesn’t deserve Democratic Rep. Kysten Sinema as senator.On the surface, Sinema has presented herself to voters as a moderate Democrat willing to work with Republicans, and even President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE, on a number of issues.But Sinema’s history tells a different story.During the early years of the Bush administration and shortly after the United States was attacked on Sept. 11, 2001, Sinema said during a radio interview that she “didn’t care” if Americans went overseas to join the Taliban in Afghanistan.“I don’t care if you want to do that, go ahead,” Sinema said.At the time of the comments, American troops were dying fighting Taliban terrorists and are still fighting them today.Sinema’s anti-American attitude didn’t stop there.“Her biggest anti-war event was a February 15, 2003, protest in Patriot’s Square Park in Phoenix. Flyers, as first reported by CNN’s KFile, distributed by an anti-war group led by Sinema depicted a U.S. soldier as a menacing skeleton inflicting ‘U.S. terror’ in Iraq and the Middle East,” CNN recently reported. “In her activism for that event, Sinema was willing to work with all groups, including a local anarchist group that helped organize the rally.”Not only did she encourage Americans to fight against the U.S. on behalf of the Taliban, she depicted U.S. troops as terrorists.Sinema has been repeatedly asked about the comments and the flyers, but won’t say whether she regrets them. She’s also refused to address them in debates, despite Arizona having a heavy military population.In addition to Sinema’s abhorrent record of promoting the terrorist organization behind 9/11, it’s become clear she isn’t remotely a fan of the Arizona constituents she wants to represent.For years, Sinema built her political career in far left circles. During the annual Netroots Nation conference in 2010, Sinema classified Arizona as the “meth lab of democracy.”“The states are the laboratories of Democracy and then my state, Arizona, is very clearly the meth lab of democracy,” Sinema said. “I cannot take credit for that line, someone at the Daily Show wrote it but I’m happy to steal it and use it all the time.”In 2011, she gave a speech to a Democratic group in Texas and portrayed Arizona as the “crazy” state.“Over the past several years, people have watched what was happening in Arizona, and been like, ‘Damn, those people are crazy,’ ” Sinema said. “Arizona is the state of the five C’s. So, cattle, copper, cotton, citrus and climate. Those were the five things our state historically made its money off of. But I would add a sixth C … It’s called ‘crazy,’ because that’s what’s happening in my state, is pure craziness. Pure craziness.”Most recently, Project Veritas revealed Sinema warned against discussing gun control because Arizonans “will actually shoot you.” She was also exposed by staffers for faking her moderate platform.“There’s a lot of very conservative people in Arizona and so [Sinema] can’t alienate the conservative or moderate conservative voters by being super pro. She is pro-choice. She is very liberal, she’s progressive,” field organizer Lauren Fromm said.Sinema’s opponent, Republican Rep. Martha McSallyMartha Elizabeth McSallyArizona New Members 2019 House GOP returns to Washington after sobering midterm losses Overnight Defense — Presented by Raytheon — First lady's office pushes for ouster of national security aide | Trump taps retired general as ambassador to Saudis | Mattis to visit border troops | Record number of female veterans to serve in Congress MORE, has a very different record.“During her 26-year military career, she deployed six times to the Middle East and Afghanistan, flying 325 combat hours and earning a Bronze Star and six air medals. She broke barriers for women and girls everywhere — becoming not only the first woman in U.S. history to fly a fighter jet in combat— but the first woman to command a fighter squadron,” her campaign website states. “Martha was deployed to Saudi Arabia on 9/11 and was a part of the leadership team that planned and executed the initial air campaign in Afghanistan after the 9/11 attacks. She also oversaw combat search and rescue operations over Southern Iraq and Afghanistan.”McSally respects the constituents she is running to serve and is supported by Republicans from across the right side of the political spectrum. For decades, former Sen. John McCainJohn Sidney McCainCindy McCain takes aim at Trump: We need a strong leader, 'not a negative Nancy' McCain would have said ‘enough’ to acrimony in midterms, says Cindy McCain Trump nominates Jim Gilmore for ambassador post MORE (R-Ariz.) served as an inspiration to McSally. She is endorsed by Trump and former President George W. Bush.Arizona deserves better than Sinema on Election Day. McSally is the candidate who will best serve Arizona voters, and the United States of America, in Washington.Pavlich is the editor for Townhall.com and a Fox News contributor.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}