{"id": "On The Money: Trump threatens more tariffs if no 'great deal' with China  | Chamber warns against tax targeting tech companies | Dow bounces back | Consumer confidence rises in October", "paragraph": "Happy Tuesday and welcome back to On The Money, where we are now completely focusing on being creative. I'm Sylvan Lane, and here's your nightly guide to everything affecting your bills, bank account and bottom line.See something I missed? Let me know at slane@thehill.com or tweet me @SylvanLane. And if you like your newsletter, you can subscribe to it here: http://bit.ly/1NxxW2N.Write us with tips, suggestions and news: slane@thehill.com, vneedham@thehill.com, njagoda@thehill.com and nelis@thehill.com. Follow us on Twitter: @SylvanLane, @VickofTheHill, @NJagoda and @NivElis. THE BIG DEAL -- Trump warns of more tariffs if 'great deal' not reached with China: The Trump administration could implement another major round of tariffs against China if trade negotiations with the country aren't successful, the president said Monday night.President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE told Fox News's Laura Ingraham that another round of trade measures equaling $267 billion in value was \"ready to go\" if Chinese authorities do not bend to U.S. demands for significant changes to China's trade policies.\"I think that we will make a great deal with China, and it has to be great, because they've drained our country,\" Trump told Ingraham.\"[But] I have $267 billion waiting to go if we can't make a deal,\" he added.In the interview, the president expressed optimism that a deal would be reached with China in the near future, ending months of back-and-forth tariffs from the two nations. Here's more from The Hill's John Bowden. LEADING THE DAYConsumer confidence rises in October: Consumer confidence in the U.S. economy increased in October amid strong GDP growth and low joblessness, according to a key survey released Tuesday by business research group The Conference Board.The Conference Board's Consumer Confidence Index rose to 137.9 in October after a smaller increase to 135.3 in September, the group announced Tuesday. Consumers' forecasts for the current economy improved from 169.4 to 172.8, while expectations for the near future improved from 112.5 to 114.6 this month.\"Consumers' assessment of present-day conditions remains quite positive, primarily due to strong employment growth,\" said Lynn Franco, Senior Director of Economic Indicators at The Conference Board.\"Consumers do not foresee the economy losing steam anytime soon. Rather, they expect the strong pace of growth to carry over into early 2019.\"Why it matters: Consumer spending plays a critical role in U.S. GDP growth and often serves as a bellwether for the broader economy.Statistics released by the government on Friday showed the economy growing at a healthy 3.5 percent rate in the third quarter, down from an exceptional 4.2 percent in the second quarter.Third-quarter GDP growth was powered primarily by consumer spending and retail inventories, which typically reflect short-term confidence in the economy. But business investment and capital expansion fell over the past three months--two warning signs that the Trump boom could be past its prime. Chamber warns against taxes targeting tech companies: The U.S. Chamber of Commerce on Tuesday is raising concerns about digital services taxes, after the United Kingdom on Monday announced plans to move forward with such a tax on large technology companies.\"The American business community supports international dialogue on ways to modernize the international taxation system to adapt to changes in the global economy,\" Chamber President and CEO Tom Donohue wrote in a letter to Treasury Secretary Steven MnuchinSteven Terner MnuchinOvernight Defense — Presented by Raytheon — Border deployment 'peaked' at 5,800 troops | Trump sanctions 17 Saudis over Khashoggi killing | Senators offer bill to press Trump on Saudis | Paul effort to block Bahrain arms sale fails On The Money: Senior GOP senator warns Trump against shutdown | Treasury sanctions 17 Saudis over Khashoggi killing | HQ2 deal brings new scrutiny on Amazon | Senate confirms Bowman to Fed board The Hill's 12:30 Report — Sponsored by Delta Air Lines — Trump sanctions 17 Saudis over Khashoggi killing | Insurgents seek female challenger to Pelosi for Speakership | Broward County finishes machine recount MORE.\"However, unilateral European actions will erode trust and lessen the prospects for international agreement; indeed, we now see governments outside of Europe considering similar actions.\"Donohue outlined three main concerns the Chamber has with digital services taxes. The Hill's Naomi Jagoda tells you more about them here. MARKET CHECK: CNBC: Dow rallies more than 400 points in bounce as brutal October nears a close. GOOD TO KNOW ODDS AND ENDSView the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}