{"id": "France ready to back sanctions against those involved in Khashoggi killing", "paragraph": "France said Wednesday that it is prepared to support international sanctions against those found responsible for killing Saudi journalist Jamal Khashoggi, the Agence France-Presse (AFP) reported.French President Emmanuel Macron spoke by phone with Saudi King Salman, where Macron voiced his disapproval with Khashoggi's killing. Macron demanded a thorough investigation into the matter, the AFP reported.\"France will not hesitate to take international sanctions, together with its international partners, against the guilty,\" the Elysee Palace said in a statement.Macron also told the king that France's priority was \"defending freedom of expression, freedom of the press and of the public,\" according to the statement. He did not rule out \"punitive measures\" against Saudi Arabia if the kingdom is found responsible in Khashoggi's death.Macron announced last week that he was suspending political visits to Saudi Arabia amid the investigation into what happened to Khashoggi.The journalist's killing has been the subject of global outcry in the weeks since he first disappeared earlier this month. Khashoggi, a Washington Post columnist and outspoken critic of Saudi leadership, was last seen entering the Saudi consulate in Istanbul on Oct. 2.The Saudis have offered changing explanations for what happened to Khashoggi. They first claimed they had no knowledge of his whereabouts, but later said he died in a \"fight\" gone awry. The kingdom detained 18 people associated with the incident.Turkish and U.S. officials have balked at the latest Saudi claims, and voiced increasing certainty that Crown Prince Mohammed bin Salman was involved, at some level, in Khashoggi's killing.The Trump administration on Tuesday took its first steps to punish Saudi Arabia in Khashoggi's death, revoking visas for some Saudi officials allegedly responsible for the journalist's killing.Secretary of State Mike PompeoMichael (Mike) Richard PompeoOvernight Defense — Presented by Raytheon — Lawmakers struggle with how to punish Saudi Arabia | Trump regrets not visiting Arlington for Veterans Day | North Korea deports detained American Corker: 'A price needs to be paid' for Khashoggi's murder White House eyeing ways to remove Erdoğan foe Gülen from US: report MORE added that the U.S. is also weighing sanctions designed to target human-rights violators.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}