{"id": "Senate Judiciary Republicans say no evidence found to support accusations against Kavanaugh", "paragraph": "Republicans on the Senate Judiciary Committee late Saturday released a 414-page report in which the panel members say they found no supporting evidence for any of the allegations of sexual misconduct made against Supreme Court Justice Brett KavanaughBrett Michael KavanaughThe Hill's 12:30 Report — Sponsored by Delta Air Lines — White House to 'temporarily reinstate' Acosta's press pass after judge issues order | Graham to take over Judiciary panel | Hand recount for Florida Senate race Graham set to take over Judiciary Leverage the new US International Development Finance Corporation to compete with China MORE ahead of his confirmation.\"Committee investigators spoke with 45 individuals and took 25 written statements relating to the various allegations made in the course of the #SCOTUS confirmation process,\" the Senate Judiciary Committee tweeted Saturday.\"In neither the committee's investigation nor in the supplemental background investigation conducted by the FBI was there ANY evidence to substantiate or corroborate any of the allegations.\"Committee investigators spoke with 45 individuals and took 25 written statements relating to the various allegations made in the course of the #SCOTUS confirmation process.In neither the committee’s investigation nor in the supplemental background investigation conducted by the FBI was there ANY evidence to substantiate or corroborate any of the allegations.The committee investigators \"found no verifiable evidence that supported\" Christine Blasey Ford's allegation that Kavanaugh pinned her to a bed in the early 1980s and attempted to remove her clothes while covering her mouth with one hand.\"The witnesses that Dr. Ford identified as individuals who could corroborate her allegations failed to do so, and in fact, contradicted her,\" the report notes.It also states that committee investigators \"found no verifiable evidence\" to support Deborah Ramirez's claim that Kavanaugh exposed himself to her at a party when they were both at Yale.The report additionally dismisses allegations from Julie Swetnick, forwarded by lawyer Michael Avenatti.\"Indeed, the evidence appears to support the position that Julie Swetnick and Mr. Avenatti criminally conspired to make materially false statements to the Committee and obstruct the Committee’s investigation,\" the report writes.Avenatti and Swetnick have both been referred to the Department of Justice for potential criminal investigations into their behavior during Kavanaugh's confirmation process. Avenatti has been referred a second time.In addition, the report details that investigators were also unable to locate supporting evidence for the several anonymous accusations against Kavanaugh, noting that one of the accusers has been referred for a criminal investigation.Kavanaugh passionately denied all of the allegations against him and was ultimately confirmed after a brutal confirmation fight on Oct. 6 by a vote largely down party lines.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}