{"id": "Dem senators request classified briefing on Khashoggi", "paragraph": "Democratic senators are requesting a classified briefing about what the U.S. intelligence community knew about threats to slain journalist Jamal Khashoggi.Seven Democratic senators and independent Sen. Bernie SandersBernard (Bernie) SandersAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural Entrepreneur touts big solutions, endorsements in discussing presidential bid Warren, 2020 Dems target private immigration detention center operators MORE (Vt.) sent a letter on Tuesday to Director of National Intelligence Dan CoatsDaniel (Dan) Ray CoatsHillicon Valley: Official warns midterm influence could trigger sanctions | UK, Canada call on Zuckerberg to testify | Google exec resigns after harassment allegations | Gab CEO defends platform | T-Mobile, Sprint tailor merger pitch for Trump Dem slams intel chief over classified response on Trump's Chinese election meddling claims The Hill's Morning Report — Presented by PhRMA — Trump divides Republicans ahead of midterms MORE requesting the briefing. They also said they want to know if the intelligence community warned the U.S.-based journalist about threats to his life. \"Congress must understand the circumstances of Mr. Khashoggi’s disappearance. In order to fulfill our oversight obligation, we request a classified briefing regarding the implementation of the duty to warn determinations articulated in Intelligence Community Directive 191 ... and its specific application to the Jamal Khashoggi case,\" the senators wrote. The directive outlines when and how the intelligence community will warn individuals or groups about specific threats regarding death, serious bodily injury or kidnapping. Senators, in the letter to Coats, said the directive is a \"clear message\" that the government takes threats seriously. They noted that The Washington Post reported that the U.S. government had intercepted communications from Saudi officials discussing a plan to capture Khashoggi. \"Questions regarding whether Mr. Khashoggi was notified of known threats to his life have raised serious concerns. ... The Intelligence Community must clearly account for any known threats levied against Mr. Khashoggi and whether the Directive was triggered appropriately and followed accordingly,\" the senators added.Tuesday's letter was signed by Democratic Sens. Richard Blumenthal (Conn.), Dick DurbinRichard (Dick)  Joseph DurbinOvernight Health Care — Presented by The Partnership for Safe Medicines — GOP lawmaker pushes back on Trump drug pricing plan | Pfizer to raise prices on 41 drugs next year | Grassley opts for Finance gavel McConnell: Criminal justice bill unlikely this year  Trump’s backing may not be enough on criminal justice reform MORE (Ill.), Chris Van HollenChristopher (Chris) Van HollenCortez Masto named Dem Senate campaign chairwoman Election Countdown: Hyde-Smith's 'public hanging' joke shakes up Mississippi runoff | New lawsuits in Florida | Trump wants Florida election official fired | Mia Love sues to stop Utah vote count | Republican MacArthur loses NJ House race Cortez Masto poised to become DSCC chair MORE (Md.), Brian SchatzBrian Emanuel SchatzOn The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report Hillicon Valley: Facebook reeling after NYT report | Dems want DOJ probe | HQ2 brings new scrutiny on Amazon | Judge upholds Russian troll farm indictments | Cyber moonshot panel unveils recommendations Facebook reeling after damning NYT report MORE (Hawaii), Patrick LeahyPatrick Joseph LeahySenators introduce Trump-backed criminal justice bill Dem senators want hearing on funding for detained migrant children Dem senators request classified briefing on Khashoggi MORE (Vt.), Amy KlobucharAmy Jean KlobucharHillicon Valley: Facebook reeling after NYT report | Dems want DOJ probe | HQ2 brings new scrutiny on Amazon | Judge upholds Russian troll farm indictments | Cyber moonshot panel unveils recommendations Senators introduce Trump-backed criminal justice bill Dems press Justice Department to probe Facebook over political attacks MORE (Minn.) and Ed MarkeyEdward (Ed) John MarkeyHillicon Valley: Russian-linked hackers may have impersonated US officials | Trump signs DHS cyber bill | Prosecutors inadvertently reveal charges against Assange | Accenture workers protest border enforcement work | App mines crypto for bail bonds Senators push bipartisan bill to crack down on robocalls Warren, 2020 Dems target private immigration detention center operators MORE (Mass.), as well as Sanders. In addition to a classified briefing, senators are asking for information on how many times individuals have been warned of threats under Directive 191. They also want an updated intelligence assessment on Saudi Arabia. Khashoggi, a opinion contributor to The Washington Post, entered the Saudi Consulate in Istanbul on Oct. 2 to get paperwork needed for his marriage and is believed to have been murdered on the scene. The Saudi government initially said Khashoggi had left the consulate shortly after he arrived. They acknowledged on Oct. 19 that he was killed inside the consulate and that 18 Saudis had been arrested. The explanation from the Saudi government has been criticized by a number of senators in both parties, who have questioned the level of involvement by Saudi Crown Prince Mohammed bin Salman. The Saudis have said that the crown prince known as MBS was not aware of a plan to intercept Khashoggi, but some senators have questioned how that could be possible.Secretary of State Mike PompeoMichael (Mike) Richard PompeoOvernight Defense — Presented by Raytheon — Lawmakers struggle with how to punish Saudi Arabia | Trump regrets not visiting Arlington for Veterans Day | North Korea deports detained American Corker: 'A price needs to be paid' for Khashoggi's murder White House eyeing ways to remove Erdoğan foe Gülen from US: report MORE said last week that the U.S. is revoking visas for several Saudi officials in retaliation for the incident, and would be considering future sanctions against the country.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}