{"id": "Kanye West denies he designed 'Blexit' shirts: 'I've been used'", "paragraph": "Kanye West is denying that he designed the “Blexit” T-shirts urging black people to abandon the Democratic Party, with the vocal supporter of President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE saying he will distance himself from politics.In a pair of tweets on Tuesday, the rapper claims that he introduced conservative figure Candace Owens to the designer of the T-shirt, and that she erroneously used his name in conjunction with them.I introduced Candace to the person who made the logo and they didn’t want their name on it so she used mine. I never wanted any association with Blexit. I have nothing to do with it.My eyes are now wide open and now realize I’ve been used to spread messages I don’t believe in. I am distancing myself from politics and completely focusing on being creative !!!The T-shirts first appeared at Turning Point USA’s Young Black Leadership Summit on Saturday. Owens, the communications director for Turning Point USA, shared an image of the shirts and touted West’s involvement.\"Blexit is a renaissance and I am blessed to say that this logo, these colors, were created by my dear friend and fellow superhero Kanye West,” Owens said.The Hill has reached out to Turning Point USA for comment.In an set of tweets earlier Tuesday, West outlined some of his political beliefs, saying he supports prison reform, job creation, common-sense gun laws and “holding people who misuse their power accountable.”I support creating jobs and opportunities for people who need them the most, I support prison reform, I support common-sense gun laws that will make our world safer.I support those who risk their lives to serve and protect us and I support holding people who misuse their power accountable.I believe in love and compassion for people seeking asylum and parents who are fighting to protect their children from violence and war.I would like to thank my family, loved ones, and community for supporting my ACTUAL beliefs and my vision for a better world.West has made national headlines for his support of Trump.He recently visited the White House for a meeting with the president, in which he heaped praise on him and went on an extended monologue about mental health, prison reform and the 13th Amendment, among other topics.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}