{"id": "Rihanna endorses Gillum for Florida governor", "paragraph": "Pop star Rihanna emphatically endorsed Tallahassee Mayor Andrew Gillum (D) for Florida governor on Sunday.\"You have the opportunity to make history this election,\" she wrote on Instagram. \"The US has only had four black Governors in its entire history, and we can help make #AndrewGillum the next one and Florida’s first!\" \"If you’re tired of feeling like you don’t matter in the political process, know the most important thing you can do in supporting a candidate is finding someone who will take on critical issues such as: making minimum wage a livable wage, paying teachers what their worth, ensuring criminal justice reform, making healthcare a right, and repealing Stand Your Ground.\"Rihanna also urged voters to support Amendment 4 \"to restore voting rights to folks who have already paid their debt to society.\"FLORIDA: You have the opportunity to make history this election. Let’s #bringithome. Vote @andrewgillum. And VOTE YES on Amendment 4 to restore voting rights to folks who have already paid their debt to society. VOTE on November 6th! https://t.co/ApH5hN7anc pic.twitter.com/Kpxz9XleYZRihanna has been outspoken about the importance of Nov. 6's midterm election.In October, she told her supporters that \"you have 1 job today and that is to properly register to vote.\"Gillum is locked in a tight race against former Rep. Ron DeSantisRonald Dion DeSantisDeSantis transition team zeroes in on possible chief of staff Trump congratulates Kemp, says Abrams will have 'terrific political future' Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority MORE (R). The most recent polling shows the two candidates in a virtual tie.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}