{"id": "CNN's Smerconish: What do Saudis have over American presidents?", "paragraph": "CNN's Michael Smerconish on Saturday sharply criticized the Trump administration and previous U.S. presidencies for what he called \"fealty\" to the Saudi government.Smerconish delivered the commentary on CNN's \"Smerconish\" after the Saudi government acknowledged on Friday that Jamal Khashoggi, a U.S.-based Washington Post columnist, had died inside its consulate in Istanbul after weeks of claiming to not know his whereaboutsThe CNN host noted that America's complicated relationship with Saudi Arabia stretched across presidencies from both parties, while questioning why there seemed to be little daylight between Democrats and Republicans on past praise for the Saudi government.\"What the hell does the Saudi royal family hold over American presidents?\" Smerconish asked Saturday. \"It's as if we elect an American president, give him the Resolute Desk, and the book of secrets, and in the latter, he learns he must assume fealty to the kingdom. The next thing you know, regardless of party, they are holding hands with the king.\"\"I don't get why the Saudis hold such sway. Especially now. And not just over our politicians,\" he continued. \"When [Crown Prince] Mohammed bin Salman came to the U.S. in the spring, he was fawned over by titans of industry, from MIT to Silicon Valley.\"Smerconish went on to characterize the Saudi explanation of Khashoggi's death as not credible. Saudi officials said Friday that Khashoggi died after a fight broke out in the consulate between the journalist and more than a dozen Saudi personnel.\"[W]hy are these our partners?\" Smerconish asked Saturday, before criticizing U.S. support of Saudi forces against Iranian-backed Houthi rebels in Yemen.\"Why is it in the best interest of the United States to pick sides in a sectarian dispute that's been unresolved since the year 632?\"The CNN host's comments followed sharp criticism of the Saudi explanation from Republicans and Democrats on Capitol Hill, who questioned the evolving nature of the official story and other inconsistencies.\"First we were told Mr. Khashoggi supposedly left the consulate and there was blanket denial of any Saudi involvement. Now, a fight breaks out and he’s killed in the consulate, all without knowledge of Crown Prince,” Sen. Lindsey GrahamLindsey Olin GrahamOn The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report Cotton opposes Trump-backed criminal justice bill Lawmakers say California will eventually get emergency funding for fire relief MORE (R-S.C.) wrote Friday on Twitter.“It’s hard to find this latest ‘explanation’ as credible,” the senator added.President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE on Friday indicated that he believed the explanation, responding \"I do,\" when questioned about it by reporters and praising an initial announcement of the arrest of more than a dozen Saudi nationals.\"It's a big step. There's a lot of people involved,\" the president told reporters.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}