{"id": "Brennan on explosive devices sent to him, Dems: I hope this is 'a turning point' for Trump's rhetoric", "paragraph": "Former CIA Director John BrennanJohn Owen BrennanBrennan: 'I miss the days when American Presidents ... were respected for their honesty & integrity' CIA's ‘surveillance state’ is operating against us all Falsehood shames Clapper, Brennan and pledge to protect whistleblowers MORE said Wednesday that he hoped the explosive devices sent to him and prominent Democratic officials earlier that day would signal to President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE that his rhetoric may influence his supporters to \"take matters into their own hands.\"\"Unfortunately I think Donald Trump has not helped to encourage the type of civil discourse and public engagement, and his rhetoric too frequently, I think, fuels these feelings and sentiments that now are bleeding over into potentially acts of violence,\" Brennan said during a Q&A Wednesday evening at the University of Texas at Austin.\"I think one can make an argument that it has emboldened individuals to take matters into their own hands,\" Brennan added, stopping short of blaming Trump for the day's events.Former CIA Director John Brennan speaks out about suspicious package addressed to him, saying he wishes Trump would work to unite country: \"Unfortunately, I think Donald Trump too often has helped to incite some of these feelings of anger, if not violence\" https://t.co/sGzjisNza9 pic.twitter.com/BBstBQBXeFBrennan, who served as CIA director under former President Obama, was one of several intended recipients of suspicious packages mailed out on Wednesday. The package, which contained an explosive device, was addressed to Brennan at CNN's New York City offices. Brennan works as an NBC News contributor, though he has appeared on CNN.Secret Service agents intercepted similar packages addressed to Obama and Bill and Hillary ClintonHillary Diane Rodham ClintonTexas history curriculum to emphasize that slavery played 'central role' in Civil War Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Texas education board approves restoring Hillary Clinton in history curriculum MORE, and authorities fielded parcels addressed to Rep. Maxine WatersMaxine Moore WatersDem women rally behind Pelosi Pelosi, potential challenger Fudge hold 'candid' discussion Marcia Fudge under spotlight as Pelosi Speaker fight heats up MORE (D-Calif.) and former Attorney General Eric HolderEric Himpton HolderEric Holder endorses Pelosi for Speaker Poll: Biden and Sanders lead 2020 Dem field, followed by Beto O'Rourke Trump's shortlist for attorney general takes shape MORE. Police also responded to calls for an explosive device found Monday night at the home of billionaire philanthropist George Soros.None of the devices detonated before being intercepted by law enforcement.Trump condemned the attempted attacks and said a \"major federal investigation\" is under way.\"I just want to tell you that in these times, we have to unify,\" Trump said at a White House event. \"We have to come together and send one very clear, strong, unmistakable message that acts or threats of political violence of any kind have no place in the United States of America.\"Brennan feigned surprise that Trump had delivered such remarks, and when the event moderator read the president's comments, audience members audibly chuckled.\"Well, I'm tempted to say 'that was said by Donald who?'\"Former CIA Director John Brennan offers a quippy reaction upon hearing a statement from Donald Trump, in which the President calls for unity amid Wednesday's suspicious package deliveries.https://t.co/tN96Od9Wam pic.twitter.com/Dg6NzmfwyhThe former CIA director said he believes it was important for Trump to deliver a statement calling for unity. However, he lamented that Trump did not do so sooner and voiced a desire for the president to be more consistent in his efforts to bring Americans together.\"I’m hoping that this is going to make it clear to him that what he has done heretofore, as far as a lot of this rhetoric, really is counterproductive, it is un-American, it is what a president should not be doing,\" Brennan said.\"What he said today is what a president should be doing,\" he continued. \"But follow up on those words with actions, and with his future comments. I’m hoping maybe this is a turning point.\"Republicans and Democrats alike have widely condemned Wednesday's attempted attacks and pleaded for cooler heads to prevail in political discourse.However, both sides were quick to point fingers at the other for escalating the political climate to such hostile levels.Democratic leaders pointed to Trump's attacks on Democrats at campaign rallies and elsewhere, where he has labeled the Democratic Party an \"angry mob\" and derided news outlets as the \"enemy of the people.\"Republicans have pointed to comments from Democrats urging their supporters to confront politicians over Trump administration policies and seized on subsequent protests from liberal activists.Updated on Oct. 25 at 7:35 a.m.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}