{"id": "Trump: 'Oprah was a friend of mine until I ran for office'", "paragraph": "President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE said Sunday while campaigning in Georgia that he and Oprah Winfrey were friends until he ran for president.\"Oprah was a friend of mine until I ran for office. Once I ran for office she diverged,\" Trump said while campaigning for Brian Kemp, Georgia's secretary of state and Republican candidate for governor.Trump noted that Winfrey took to Georgia last week to campaign for Stacey Abrams, the Democratic candidate in the gubernatorial race. Polls have shown Abrams and Kemp locked in a close race ahead of this week's election.Trump on Sunday also said that Winfrey has \"been down to Mar-a-Lago\" and falsely claimed that he made an appearance on the Oprah Winfrey Show during the last week that it aired. Trump said Winfrey had her \"five most important people\" on that week and said he was one of them.“I was on her full show on the last week. I think they’re trying to burn the tape,\" he said.Multiple reporters noted Sunday on Twitter that Trump was lying about being on Winfrey's show in its last week, something he has previously claimed.Trump: “Oprah’s been down to Mar-a-Lago,” then claims he was on her last week of shows (he wasn’t), then insinuates they’re”trying to burn the tape.” (Which explains why the tape of the show he wasn’t on doesn’t exist!)This is the fourth time Trump has lied that he was on Oprah's show in its last week, but it's the first time he's claimed it was because he was super-important to Oprah. https://t.co/e8jiuzrDTAView the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}