{"id": "Trump confirms US will withdraw from key arms control treaty", "paragraph": "President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE confirmed the U.S. will pull out of the Intermediate-Range Nuclear Forces Treaty (INF), a nuclear deal signed between Washington and Moscow during the Cold War. “We’re going to terminate the agreement and we’re going to pull out,” Trump told reporters before a campaign rally in Nevada Saturday. “We’ll have to develop those weapons,” he added.The INF, which was signed between former President Reagan and Soviet Union President Mikhail Gorbachev in 1987, allows the U.S. to counter Chinese efforts to accumulate arms in the Pacific but prevents Washington from deploying new weapons in response. The New York Times reported Friday that the Pentagon has been developing nuclear weapons to counter Chinese weapons already deployed. China is not a signatory to the deal, and the Trump administration has accused Russia of violating the deal.Russia’s “decision to violate the INF Treaty and other commitments all clearly indicate that Russia has rebuffed repeated U.S. efforts to reduce the salience, role, and number of nuclear weapons,” the administration wrote in a nuclear strategy document earlier this year.The pact bans all land-based missiles with ranges of 310 to 3,420 miles and includes missiles carrying both nuclear and conventional warheads. The original ban between Moscow and Washington resulted in 2,692 missiles being destroyed.Former President Obama decided to stay in the deal. Trump did not offer a timetable for when the actual withdrawal would take place.This would not be the first nuclear deal Trump withdrew from. The president pulled out of the Obama-era nuclear deal with Iran, although that deal was an agreement and not a treaty and placed nuclear restrictions on Iran alone. The last president to withdraw from a major arms treaty was former President George W. Bush in 2002, when he pulled out of the nuclear Anti-Ballistic Missile Treaty. The news comes right ahead of national security adviser John Bolton’s trip to Moscow to meet with top Russian officials. The announcement follows a trend for the Trump administration in which the White House enacts tough policies against Moscow, including sanctions on Kremlin officials, while the president adopts rosy language toward Russian President Vladimir Putin as he defends himself against claims collusion with Russia during the election.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}