{"id": "Scalise: Investigations into Trump by House Democrats could backfire", "paragraph": "House Majority Whip Steve ScaliseStephen (Steve) Joseph ScaliseMcCarthy, other Republicans back Ratcliffe to be next attorney general Rep. Mike Johnson wins race for RSC chairman Election Countdown: Florida Senate race heads to hand recount | Dem flips Maine House seat | New 2020 trend - the 'friend-raiser' | Ad war intensifies in Mississippi runoff | Blue wave batters California GOP MORE (R-La.) said Monday that House Democrats could help President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE get reelected in 2020 if they continually investigate him.\"If they move so far to the left that they only want to harass the president and ultimately impeach the president, that is going to backfire on them,\" Scalise told The Washington Examiner. \"We saw this with the Kavanaugh hearings.\"Support for Supreme Court Justice Brett KavanaughBrett Michael KavanaughThe Hill's 12:30 Report — Sponsored by Delta Air Lines — White House to 'temporarily reinstate' Acosta's press pass after judge issues order | Graham to take over Judiciary panel | Hand recount for Florida Senate race Graham set to take over Judiciary Leverage the new US International Development Finance Corporation to compete with China MORE's confirmation and anger at Democrats' opposition were credited as helping Republicans pull off key wins in the Senate during the midterm elections last week.“The danger they’re going to have is that the far left wants them to move toward resistance and ultimately impeachment of the president regardless of the facts,\" Scalise told the Examiner. \"And that’s not where the country is.\"Last Wednesday, Trump expressed interest in working with Democrats but said he would adopt a \"warlike posture\" if they go after him.\"They can play that game, but we can play it better, because we have a thing called the United States Senate,\" Trump said. \"It'll go back and forth. And it'll probably be very good for me politically.\"Scalise told the Examiner that he worries the \"far left\" will stop Democrats from being able to work with the president.“I’m not sure the far left is going to allow the House to work with the president to get things done,” he said.“[House Minority Leader] Nancy PelosiNancy Patricia D'Alesandro PelosiDem women rally behind Pelosi How this year’s freshmen can save the Congress — and themselves Single-payer health care is better than ObamaCare  MORE is already very liberal but I think her conference has moved even further to the left from the last time she was speaker.\"View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}