{"id": "Trump heads to California to meet first responders amid deadly wildfires", "paragraph": "President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE is traveling to California on Saturday to meet with firefighters and first responders battling a series of deadly wildfires in the state, he announced.Trump tweeted that he was headed to the state with several California lawmakers, including House Majority Leader Kevin McCarthyKevin Owen McCarthyHillicon Valley: Russian-linked hackers may have impersonated US officials | Trump signs DHS cyber bill | Prosecutors inadvertently reveal charges against Assange | Accenture workers protest border enforcement work | App mines crypto for bail bonds McCarthy, other Republicans back Ratcliffe to be next attorney general Democrat Katie Porter unseats GOP's Mimi Walters MORE (R-Calif.).\"Look forward to being with our brave Firefighters, First Responders and @FEMA, along with the many brave People of California. We are with you all the way – God Bless you all!” the president tweeted.Heading to California with @GOPLeader Kevin McCarthy, @RepLaMalfa, and @KenCalvert. Look forward to being with our brave Firefighters, First Responders and @FEMA, along with the many brave People of California. We are with you all the way – God Bless you all!The White House announced the visit on Friday but provided few details at the time.California Gov. Jerry Brown (D) and his successor, Lt. Gov. Gavin Newsom (D), plan to join the president on Saturday for a tour of areas damaged by wildfires, the governor announced.The trip comes as the president continues to criticize California officials over the state's management of the fires, which have killed 71 people and left more than a thousand missing.“We will be talking about forest management. I’ve been saying that for a long time. It should have been a lot different situation, but the one thing is that everybody now knows that this is what we have to be doing, and there’s no question about it,\" Trump told reporters Saturday before leaving the White House.\"It should have been done many years ago. But I think everybody’s on the right side. It’s a big issue, it’s a big issue, a very expensive issue, but very, very inexpensive when you compare it to even one of these horrible fires. And we’ll save a lot of lives,” he added.Trump previously floated going as far as to cut off federal dollars to the state if it doesn’t adjust its response to the wildfires.“There is no reason for these massive, deadly and costly forest fires in California except that forest management is so poor,\" he tweeted last week.\"Billions of dollars are given each year, with so many lives lost, all because of gross mismanagement of the forests. Remedy now, or no more Fed payments!”There is no reason for these massive, deadly and costly forest fires in California except that forest management is so poor. Billions of dollars are given each year, with so many lives lost, all because of gross mismanagement of the forests. Remedy now, or no more Fed payments!The California Professional Firefighters (CPF) labor group later ripped Trump as “ill-informed” about the cause of the wildfires. “The president’s message attacking California and threatening to withhold aid to the victims of the cataclysmic fires is ill-informed, ill-timed and demeaning to those who are suffering as well as the men and women on the front lines,” said CPF President Brian K. Rice. The president has since moderated his tone, saying earlier this week he’d spoken with Brown to offer his support, which he reiterated in a tweet Friday night.Just spoke to Governor Jerry Brown to let him know that we are with him, and the people of California, all the way!Thank you @JerryBrownGov. Look forward to joining you and @GavinNewsom tomorrow in California. We are with you! https://t.co/UuXWAadmovView the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}