{"id": "The Memo: Dem hopes for 2020 grow in midterms afterglow", "paragraph": "Democrats are gaining confidence about winning back the White House in 2020 in the days following last week’s midterm elections. And they increasingly think a candidate from the party’s left flank could be the person to do it.On election night, the midterms were widely perceived to end in a split decision, with Republicans making gains in the Senate that offset Democratic victories in the House.But that narrative, which seemed to crystallize within hours of East Coast polls closing, failed to acknowledge more positive signs for Democrats that emerged later.First, in the later hours of election night, Rep. Jacky RosenJacklyn (Jacky) Sheryl RosenThe Hill's Morning Report — Presented by T-Mobile — House, Senate leaders named as Pelosi lobbies for support to be Speaker  Nevada New Members 2019 Election Countdown: Lawsuits fly in Florida recount fight | Nelson pushes to extend deadline | Judge says Georgia county violated Civil Rights Act | Biden, Sanders lead 2020 Dem field in poll | Bloomberg to decide on 2020 by February MORE (D) won a Senate seat back for her party by defeating incumbent Sen. Dean HellerDean Arthur HellerCortez Masto named Dem Senate campaign chairwoman Nevada New Members 2019 Election Countdown: Lawsuits fly in Florida recount fight | Nelson pushes to extend deadline | Judge says Georgia county violated Civil Rights Act | Biden, Sanders lead 2020 Dem field in poll | Bloomberg to decide on 2020 by February MORE (R) in Nevada.In the succeeding days, Rep. Kyrsten Sinema (D) has come from behind in early tallies and is now the favorite to win a Senate seat in Arizona — another pick-up for Democrats.Two marquee races in Florida, for governor and for Senate, are going to a recount, having initially looked like Republican wins.And Democratic gains in the House have ticked up toward the high end of expectations. Democrats have gained a net 32 seats already and they have a good chance of adding at least another four from the 10 contests that remain undecided.All of those events have put a more vibrant spring in Democrats’ step.“I see a much more viable pathway [in 2020] after analyzing not just the returns on election night but analyzing the last week,” Democratic strategist Julie Roginsky told The Hill.Roginsky added that she had been “quite depressed” on election night because, though the bottom-line results for Democrats were solid, the party had not appeared to receive the popular mandate for which its partisans had been hoping.Since then, she asserted, it has become evident that energizing the liberal base and nonhabitual voters, and providing an “antidote” to President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE, could pave the road to success in 2020.“Playing it safe, as Hillary ClintonHillary Diane Rodham ClintonTexas history curriculum to emphasize that slavery played 'central role' in Civil War Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Texas education board approves restoring Hillary Clinton in history curriculum MORE did in 2016, is not the antidote,” Roginsky said. “The antidote is to do what Barack ObamaBarack Hussein ObamaAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural Trump's take on midterms: ‘Epic' win in Senate, ‘better than other sitting Presidents’ in House NASA's carpool to Space Station is back on as Russian rocket Soyuz quickly returns to flight MORE did in 2008, which is to energize different communities where people don’t feel they are being listened to.”There was deep progressive disappointment on election night, when it appeared that three of the left’s favorite candidates had all come up short: Rep. Beto O’Rourke in the Senate race in Texas, as well as gubernatorial candidates Andrew Gillum in Florida and Stacey Abrams in Georgia.As time has passed, there is growing recognition that the trio nevertheless outperformed expectations, especially in the cases of O’Rourke and Abrams.Gillum has retracted his initial concession in the governor’s race, while Abrams never conceded — though both candidates face steep uphill climbs to win.More broadly, liberals contrast the strong showings from the progressive trio with the defeats of more centrist Democrats by wider margins. Sens. Claire McCaskillClaire Conner McCaskillMissouri New Members 2019 2020 politics make an immigration deal unlikely in lame-duck Mellman: The triumph of partisanship MORE (D-Mo.) and Joe DonnellyJoseph (Joe) Simon DonnellyTrump to nominate former coal lobbyist Andrew Wheeler as next EPA administrator Indiana New Members 2019 2020 politics make an immigration deal unlikely in lame-duck MORE (D-Ind.) lost their seats by about 6 points each.Other figures share the view that the midterm results show a popular appetite for candidates who will make a direct charge at Trump.Allan Lichtman, a history professor at American University and one of the few people to predict a Trump victory in 2016, insisted that Democrats would be taking precisely the wrong lesson from the midterms if they were to nominate a “safe, establishment, so-called ‘electable’ candidate” in 2020. Citing the examples of former Presidents Obama, Clinton and Carter, he said that “rather than looking into the heart of the Democratic establishment, they should look for a new, fresh charismatic candidate.”Results from exit polls also buoy Democratic spirits, showing even wider advantages than usual with female, young and college-educated voters.The results even give some Republicans cause for concern.Whit Ayres, a GOP strategist who has argued for years that his party needs to adapt to demographic changes, said that Republicans were becoming more dominant in rural areas but that Democrats were making substantial inroads into “the suburban areas that for many years have formed the backbone of Republican victories.\" Ayres added, “We saw in 2016, as we did in 2000, that it is possible to win the electoral college without winning the popular vote. But that strategy requires threading a very fine needle.”Still, some Democrats express notes of caution, especially when it comes to the apparent resilience of the Trump base.Democratic gains in the House, they note, were positive but hardly outside the historic norms. Democrats lost 63 House seats in Obama’s first midterm election, in 2010, and 54 seats during the first midterm contest of the Clinton presidency, in 1994.“Donald Trump is very much in charge,” said New York-based Democratic strategist Hank Sheinkopf. \"Despite having lost the House, he held onto big states in the Senate.”Looking ahead to 2020, Sheinkopf added, Democrats needed a presidential nominee “who appeals to more than the coasts. They need someone who can break off even a part of the Trump constituency.” Jerry Austin, a Democratic strategist in Ohio, lamented that his state is now “much more of a guaranteed red state than we are a purple state.”Still, Austin noted, incumbent Sen. Sherrod BrownSherrod Campbell BrownThe Hill's 12:30 Report — Sponsored by Delta Air Lines — White House to 'temporarily reinstate' Acosta's press pass after judge issues order | Graham to take over Judiciary panel | Hand recount for Florida Senate race Budowsky: Sherrod Brown should run in 2020 Sherrod Brown: If Stacey Abrams doesn't win, Republicans 'stole it' MORE (D-Ohio) prevailed comfortably in his reelection campaign.Nationally, Austin said, Democrats should not let the failure of candidates who were fighting on difficult territory take the gloss off the party’s overall performance.“So many people in the Democratic Party were lamenting O’Rourke’s loss, and results in Florida and Georgia,” he said. “But if you put those aside — which would have been big upsets — Democrats had a terrific day.” The Memo is a reported column by Niall Stanage, primarily focused on Donald Trump’s presidency.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}