{"id": "Timeline: Bomb threats jolt nation", "paragraph": "Authorities are investigating a spate of bomb threats that began earlier this week and reached a new level of urgency on Wednesday, when prominent Democrats like former President Obama, Hillary ClintonHillary Diane Rodham ClintonTexas history curriculum to emphasize that slavery played 'central role' in Civil War Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Texas education board approves restoring Hillary Clinton in history curriculum MORE and others, as well as CNN, were targeted in what appears to be a coordinated effort.Investigators have not yet identified any suspects or motives, and no deaths or injuries have been reported. The FBI said on Wednesday it is continuing to investigate the packages and warned the public there may be more that have not been found.Below is a timeline of the events that have raised new fears about the level of violence in a country already polarized.Monday evening: Explosive device discovered at George Soros’s houseAn employee working for Democratic philanthropist George Soros finds an explosive device in a mailbox at Soros's residence in Westchester County, N.Y.Authorities are alerted and a bomb squad detonates the device. Soros, a frequent political target of the right both in the U.S. and Europe, was not home when the explosive device was discovered.Tuesday night: Secret Service finds explosive in mail sent to ClintonsThe Secret Service intercepts a package containing an explosive device that was being sent to the residence of former President Bill ClintonWilliam (Bill) Jefferson ClintonElection Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority As Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural GOP chairman plans to subpoena Comey, Lynch to testify before next Congress MORE and former Secretary of State Hillary Clinton in Westchester County, N.Y. The Clintons were not “at risk of receiving (the package),” according to the Secret Service.Hillary Clinton, who as Donald Trump's former opponent in the 2016 presidential election has become been one of the right’s most common foils, has faced unfounded rumors such as the “Pizzagate” conspiracy. Crowds frequently chant “lock her up” at rallies.Early Wednesday morning: Authorities intercept explosive sent to ObamaThe Secret Service says it intercepted a package early Wednesday morning that was addressed to former President Obama’s home in Washington, D.C. The package was identified during routine screening procedures as a potential explosive device, the Secret Service says in a statement, adding that the device was “appropriately handled as such.” The agency also says that Obama and the Clintons \"did not receive the packages nor were they at risk of receiving them.”Wednesday, 10:10 a.m.: CNN evacuated after suspicious package found Employees in the Time Warner building in New York, which houses CNN’s offices, are forced to evacuate after an alarm sounds. CNN anchors Poppy Harlow and Jim Sciutto are forced to abandon their broadcast mid-air, and they later resume the broadcast from the street.The evacuation is caused by a suspicious package in the mailroom addressed to former CIA Director John BrennanJohn Owen BrennanBrennan: 'I miss the days when American Presidents ... were respected for their honesty & integrity' CIA's ‘surveillance state’ is operating against us all Falsehood shames Clapper, Brennan and pledge to protect whistleblowers MORE, a frequent critic of Trump, who does not work for CNN but serves as an NBC/MSNBC senior national intelligence analyst. Trump notably revoked Brennan’s security clearance in August, in an unprecedented move critics slammed as an attempt to silence dissent.CNN has also frequently drawn Trump’s ire, with the president ripping the cable network, as well as other outlets, as “fake news.”Wednesday, around 11 a.m.: White House, GOP condemn attempted attacksThe White House and prominent Republican leaders on Wednesday morning condemn the attempted attacks against Obama, the Clintons and CNN.Vice President Pence writes on Twitter that the “cowardly actions are despicable & have no place in this Country.” White House press secretary Sarah Huckabee Sanders in a statement condemns the attempted attacks, calling them “despicable” and saying that “anyone responsible will be held accountable to the fullest extent of the law.” In a tweet later during the day, Sanders clarifies that her condemnation “certainly includes threats made to CNN.”Senate Majority Leader Mitch McConnellAddison (Mitch) Mitchell McConnellAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural McConnell: Criminal justice bill unlikely this year  On The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report MORE (R-Ky.) and House Majority Leader Steve ScaliseStephen (Steve) Joseph ScaliseMcCarthy, other Republicans back Ratcliffe to be next attorney general Rep. Mike Johnson wins race for RSC chairman Election Countdown: Florida Senate race heads to hand recount | Dem flips Maine House seat | New 2020 trend - the 'friend-raiser' | Ad war intensifies in Mississippi runoff | Blue wave batters California GOP MORE (R-La.) are among the Republican leaders in Congress who condemn the incidents.Wednesday, 11:43 a.m.: Police probe suspicious package sent to office of Wasserman ShultzThe police department in Sunrise, Fla., announces it's investigating a suspicious package sent to the office of Rep. Debbie Wasserman SchultzDeborah (Debbie) Wasserman SchultzSingle fingerprint, misspellings pointed FBI to mail bombs suspect Piers Morgan: Trump can't ignore stickers on suspect's van, must cool down 'violently aggressive rhetoric' White van identified in connection with mail bombings suspect covered in pro-Trump stickers MORE (D-Fla.).It's later revealed that several of the packages had used her Sunrise office for the return address. This particular package is later determined to have been intended for former Attorney General Eric HolderEric Himpton HolderEric Holder endorses Pelosi for Speaker Poll: Biden and Sanders lead 2020 Dem field, followed by Beto O'Rourke Trump's shortlist for attorney general takes shape MORE. However, the Holder’s address was written erroneously, and was sent back to the return address.Holder, a possible 2020 contender, recently made headlines for saying about Republicans that “when they go low, we kick them.\"Wasserman Schultz gained notoriety during the 2016 presidential election during her tenure as the chairman of the Democratic National Committee (DNC). Critics allege she aided Hillary Clinton earn the nomination over rival Sen. Bernie SandersBernard (Bernie) SandersAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural Entrepreneur touts big solutions, endorsements in discussing presidential bid Warren, 2020 Dems target private immigration detention center operators MORE (I-Vt.).Wednesday, 11:50 a.m.: San Diego Union-Tribune staff briefly evacuatedThe San Diego Union-Tribune is briefly evacuated Wednesday after a suspicious stack of packages are found outside of the building that houses the newspaper. The building also houses an office for Sen. Kamala HarrisKamala Devi HarrisElection Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Booker to campaign for Dem in Mississippi Senate runoff On The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report MORE (D-Calif.). San Diego police later determine, however, that the packages are filled with everyday items and are not dangerous. The newspaper reports that police haven’t determined whether the incident was related to the explosive devices sent to Obama, the Clintons and CNN.Wednesday, 12:04 p.m.: Trump makes first public commentTrump breaks his silence on the events early Wednesday afternoon, saying “I agree wholeheartedly” in a message that retweets Vice President Pence. Pence wrote: “We condemn the attempted attacks against fmr Pres Obama, the Clintons, @CNN & others. These cowardly actions are despicable & have no place in this Country. Grateful for swift response of @SecretService, @FBI & local law enforcement. Those responsible will be brought to justice.”I agree wholeheartedly! https://t.co/ndzu0A30vUWednesday, 12:30 p.m.: Hillary Clinton calls it a “troubling time” in AmericaHillary Clinton on Wednesday responds to the explosive devices being sent to her and others, calling the incidents a sign of “deep divisions” in the United States.Speaking in Florida to campaign for Democratic gubernatorial candidate Andrew Gillum, she says that she is “fine” and thanks the Secret Service.Wednesday, 12:45 p.m.: New York officials hold press conference New York Governor Andrew Cuomo, New York City Mayor Bill de Blasio and New York Police Department commissioner James P. O'Neill hold a press conference to address the packages.All three encourage New Yorkers to go about their daily lives and say the city and its residents would not be perturbed by the packages.“Terrorism only works if you let it work. What they are trying to do is scare us and destabilize us and we will not let that happen…We will not let these terrorist thugs to change the way we live our lives. They fail unless we allow them to win, and we will not allow them to win,” Cuomo says.“This clearly is an act of terror attempting to undermine our free press and leaders of this country through acts of violence. I want to make very clear that the people of New York City will not be intimidated…We cannot be terrorized if you refuse to allow the terrorists to win,” de Blasio echoes.Cuomo reveals during the press conference that his Manhattan office has received a package containing an explosive device. Police later confirm that the package contained a thumb drive, not an explosive device, and it was unrelated to other packages containing the explosive devices.Wednesday, 1:40 p.m: Sources confirm police intercept suspicious package addressed to Maxine WatersMaxine Moore WatersDem women rally behind Pelosi Pelosi, potential challenger Fudge hold 'candid' discussion Marcia Fudge under spotlight as Pelosi Speaker fight heats up MOREReports emerge that police have intercepted a suspicious package sent to Rep. Maxine Waters (D-Calif.).Waters confirms the suspicious package in a statement Wednesday. She also thanks law enforcement and condemns \"any and all acts of violence and terror.\"Waters — like Obama, Hillary Clinton and CNN — has been a frequent target of President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE, who has repeatedly called her a “low IQ person.” She also sparked controversy earlier in the year by calling on Americans to confront Trump administration officials in public.Wednesday, 2:20 p.m.: Trump condemns bomb threatsPresident Trump and first lady Melania TrumpMelania TrumpMichelle Obama's stylist downplays controversy over Melania Trump jacket Trump offered Ricardel ambassadorship to Estonia after Melania forced her out of White House: report Michelle Obama: I never had a presidential staffer fired MORE address the packages ahead of a planned bill signing at the White House.“I just want to tell you that in these times, we have to unify. We have to come together and send one very clear, strong, unmistakable message that acts or threats of political violence of any kind have no place in the United States of America,” Trump says.\"We are extremely angry, upset, unhappy about what we witnessed this morning and we will get to the bottom of it,\" he added.Wednesday late afternoon: FBI confirms it's still investigatingThe FBI releases a statement detailing the information known so far and confirming that it has sent the packages to Quantico for analysis. The bureau appears to be going by the assumption that the various bomb threats are linked. It identifies the known targets of the packages so far as Soros, Clinton, Obama, Brennan and Holder, but acknowledges that there still might be more packages that haven't been found.“We have committed the full strength of the FBI’s resources and, together with our partners on our Joint Terrorism Task Forces, we will continue to work to identify and arrest whoever is responsible for sending these packages,” FBI Director Christopher Wray says in a statement.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}