{"id": "On The Money: Funding fight to dominate dramatic lame duck | Trump blames Dems for stock slide | Trump hits Comcast after antitrust complaint | Officials reportedly moving closer to imposing auto tariffs", "paragraph": "Happy Monday and welcome back to On The Money, where we'd like to say thanks to all of the veterans and military families who've served and sacrificed for our country. I'm Sylvan Lane, and here's your nightly guide to everything affecting your bills, bank account and bottom line.See something I missed? Let me know at slane@thehill.com or tweet me @SylvanLane. And if you like your newsletter, you can subscribe to it here: http://bit.ly/1NxxW2N.Write us with tips, suggestions and news: slane@thehill.com, vneedham@thehill.com, njagoda@thehill.com and nelis@thehill.com. Follow us on Twitter: @SylvanLane, @VickofTheHill, @NJagoda and @NivElis. THE BIG DEAL--Government funding battle anchors high-drama lame duck: Congress is returning to Washington this week for an end-of-the-year session that's expected to be filled with high-stakes legislative fights and plenty of drama.Lawmakers will be forced to juggle several crucial deadlines on must-pass pieces of legislation and unravel thorny policy fights, while also navigating political battles over leadership and a potential Cabinet shakeup.A battle to fund the federal government will play a central in the scramble to take care of unfinished business before 2019.Lawmakers have less than a month to prevent a partial government shutdown after Congress missed a Sept. 30 end-of-the-fiscal-year deadline to pass seven of the 12 individual appropriations bills. The Hill's Jordain Carney tells us about the biggest obstacles to funding the government here.What comes next: Both chambers are set to be in session for approximately four weeks once they reconvene on Tuesday. That gives lawmakers little room for error as they race to wrap up their work for this session of Congress. LEADING THE DAYTrump blames stock market slide on 'Presidential Harassment by the Dems'  President Trump on Monday blamed a sharp stock market downturn on the specter of Democratic investigations when they take control in the new Congress.\"The prospect of Presidential Harassment by the Dems is causing the Stock Market big headaches!\" Trump said Monday in a tweet published two hours after U.S. stocks opened with heavy losses.The Dow Jones Industrial Average had lost more than 400 points by the time of Trump's tweet, a 1.6-percent drop, while the Nasdaq composite sunk almost 3 percent. The S&P 500 fell 1.5 percent.All three indexes closed with major losses due in part by deep declines in Apple and Goldman Sachs stocks that triggered sell-offs across several sectors. The Dow finished Monday down more than 600 points, the tech-heavy Nasdaq lost 2.78 percent and the S&P closed down almost 2 percent.The background: U.S. stocks have dropped steadily since the start of October as traders fear an imminent economic slowdown, fading global growth and rising trade tensions. Analysts have said that the strong U.S. economy appears to be past its peak, while corporations report narrower profit margins.Even so, Trump has repeatedly blamed the downturn on the prospect of a Democratic majority in the House blocking his legislative agenda and probing his personal finances. Democrats in line to chair key House committees have pledged to obtain Trump's tax returns and banking records, seeking evidence of illegal activity. Bloomberg: Trump moves closer to auto tariffs: \"The White House is circulating a draft report by the U.S. Commerce Department over whether to impose tariffs on automobile imports to protect national security, three people familiar with the matter said,\" according to a report from Bloomberg.\"President Donald Trump is scheduled to meet with senior members of his trade team on Tuesday to discuss how to proceed on the potential tariffs, two of the people said. Speaking on condition of anonymity to discuss internal deliberations, they didn't give any insight into Commerce's conclusions.\" Trump hits Comcast over alleged antitrust violations:President Trump on Monday lashed out at Comcast after a group representing small cable providers asked the Department of Justice to investigate the company over antitrust concerns, The Hill's Brett Samuels and Harper Neidig report.\"American Cable Association has big problems with Comcast. They say that Comcast routinely violates Antitrust Laws,\" Trump said in a tweet, adding that the group believes Comcast's merger with NBC poses greater anticompetitive concerns than the recent AT&T-Time Warner merger.The ACA wrote to the Justice Department last week arguing that vertical mergers where pay-TV providers like Comcast and AT&T combine with companies that offer programming give the merged firms the \"incentive and ability to disadvantage rival distributors by raising the prices it charges these rivals for programming.\"The president's attack comes after a Fox Business article suggested the Justice Department could be following through with an investigation. Harper and Brett explain the controversy here. GOOD TO KNOW ODDS AND ENDSView the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}