{"id": "Age becomes talking point surrounding 2020 Democratic field", "paragraph": "It's a question some Democrats are pondering as the 2020 presidential election inches closer: Can their party represent change when three of its top candidates are not only familiar faces, but people in their retirement years? Sen. Elizabeth WarrenElizabeth Ann WarrenElection Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Entrepreneur touts big solutions, endorsements in discussing presidential bid Warren, 2020 Dems target private immigration detention center operators MORE (Mass.) will enter her 70s in June. Sen. Bernie SandersBernard (Bernie) SandersAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural Entrepreneur touts big solutions, endorsements in discussing presidential bid Warren, 2020 Dems target private immigration detention center operators MORE (I-Vt.) is 77. Former Vice President Joe BidenJoseph (Joe) Robinette BidenEntrepreneur touts big solutions, endorsements in discussing presidential bid Avenatti ‘still considering’ presidential run despite domestic violence arrest Election Countdown: Florida Senate race heads to hand recount | Dem flips Maine House seat | New 2020 trend - the 'friend-raiser' | Ad war intensifies in Mississippi runoff | Blue wave batters California GOP MORE will turn 76 later this month. Though the primaries are still a ways off, all three have emerged in early polls as favorites to be the 2020 Democratic nominee. Some strategists say that might be a problem.“Democrats would be better off with a young candidate,” said Democratic strategist Brad Bannon, who argued that an electorate that seems to want change might prefer someone from a younger generation. He put it as a generational battle, this time between baby boomers and millennials. “The desire for change is a function of a battle between an ascending generation, the millennials who want political power, and a descending generation, the baby boomers, who have the power but don't want to give it up,” he said.There are certainly a number of candidates ready to step up if Democratic voters are looking for a younger nominee. Sen. Kamala HarrisKamala Devi HarrisElection Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Booker to campaign for Dem in Mississippi Senate runoff On The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report MORE (Calif.), a freshman in the Senate, is 54. Sen. Cory BookerCory Anthony BookerElection Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Booker to campaign for Dem in Mississippi Senate runoff Warren, 2020 Dems target private immigration detention center operators MORE of New Jersey is 49, while Sen. Kirsten GillibrandKirsten Elizabeth GillibrandWarren, 2020 Dems target private immigration detention center operators Hillicon Valley: Facebook reeling after NYT report | Dems want DOJ probe | HQ2 brings new scrutiny on Amazon | Judge upholds Russian troll farm indictments | Cyber moonshot panel unveils recommendations On The Money: Senior GOP senator warns Trump against shutdown | Treasury sanctions 17 Saudis over Khashoggi killing | HQ2 deal brings new scrutiny on Amazon | Senate confirms Bowman to Fed board MORE is 51. Rep. Beto O’Rourke, who has sparkled as a challenger to GOP Sen. Ted CruzRafael (Ted) Edward CruzDemocratic strategist warns Beto should be ‘careful’ with social media presence Hillary advisers battle over whether she’ll run in 2020 O'Rourke writes blog post describing a literal run from near the capitol to near the White House MORE and become a liberal fundraising force, is 46. None of those candidates would qualify as millennials, but they are from a different generation than the trio at the top of the Democratic polls.Earlier this year, Biden — who allies suggest may consider running for one term only — acknowledged that age is a “legitimate” issue for presidential candidates.“I think it’s totally appropriate for people to look at me and say if I were to run for office again, ‘Well, God darn you’re old.’ Well, chronologically, I am old,” Biden said during a question and answer session at the Economic Club of Southwestern Michigan’s Speakers Series last month, according to CNN. “Every voter is entitled to know exactly what kind of shape you’re in. You owe it to them. It’s a legitimate question and so I think age is relevant.” But some Democrats say the 2020 election won't be so much about age at all, particularly when Democrats will be competing to take on the 72-year-old President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE. “To me, it's less about years of age and more about the age of your ideas and whether your ideas reflect what voters want to hear,” said Chris Kofinis, a Democratic strategist.Still, he said that could be a problem for some candidates.“The challenge with candidates like Sanders and Biden is that they've been around so long. Anytime a party is out of office it is attracted to a newer, bolder message.” Democratic strategist Maria Cardona said she doesn’t think the age of some would-be candidates is problematic for the party. Cardona pointed to 2016, when Sanders was “able to attract a massive following of young people,” and nearly beat Hillary ClintonHillary Diane Rodham ClintonTexas history curriculum to emphasize that slavery played 'central role' in Civil War Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Texas education board approves restoring Hillary Clinton in history curriculum MORE in the Democratic primary. Sanders was able to tap into a sentiment that Clinton represented the tired Washington establishment, and he positively electrified swaths of young voters. During that race, the Vermont senator lured millennials to the race by talking about issues such as free public college, single-payer health care and campaign finance reform. A survey conducted in early 2016 by pollster Frank Luntz showed that young voters selected Sanders when asked which politician they respected the most. Sanders even beat former President Obama, who at 57 is 20 years his junior, 31 percent to 18 percent, according to the poll.  “I think what’s important more than age is for the candidates to authentically speak to and make a connection with voters in every state and in every community and offer a platform of new ideas and real solutions for the problems the country is facing,” Cardona said. Kofinis said that whoever wins will need to run a nimble, 21st century campaign that doesn’t rely on a playbook from previous years. “It’s not going to be the age of the candidate but the age of their ideas and the age of their actual campaign,” he said. “If you didn’t understand how bad of an idea that was, you’ll probably be on a losing campaign,” the strategist said. Much of what happens in the 2020 race is dependent on what happens in Tuesday’s midterms, strategists said. If Democrats take over the House, strategists predict the party will look a lot younger and more diverse and age will be nothing but a number. “If and when we take over the House on Tuesday, there will be a whole new generation of Democrats in Congress as well as across state legislatures around the country,” Cardona said. “They will be more female, young, diverse, and beautifully reflective of the country we live in today.\" View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}