{"id": "Chinese intel officers charged with hacking US companies to steal sensitive aviation data", "paragraph": "The Justice Department on Tuesday unsealed charges against a group of Chinese intelligence officers, alleging that they hacked into a series of private companies’ computer systems in the U.S. and abroad as part of an effort to steal sensitive commercial aviation data.Zha Rong, Chai Meng and seven other co-conspirators worked to steal intellectual property and other sensitive data from over a dozen companies so that China could develop a turbofan engine \"without incurring substantial research and development expenses,\" according to the to the indictment.\"Members of the conspiracy targeted, among other things, data and information related to a turbofan engine used in commercial jetliners. At the time of the intrusions, a Chinese state-owned aerospace company was working to develop a comparable engine for use in commercial aircraft manufactured in China and elsewhere,\" it adds.The indictment says these nine individuals worked for a provincial foreign intelligence arm of the People’s Republic of China's security apparatus known as the Jiangsu Province Ministry of State Security (JSSD), both which deal with domestic counter-intelligence. The JSSD-linked group allegedly worked to steal the data over the course of five years starting in 2010.One of the charged hackers, Zhang Zhang-Gui, is also being charged in a separate hacking conspiracy along with Chinese national Li Xiao for allegedly leveraging the hacked computers \"for their own criminal ends,\" according to a Department of Justice (DOJ) press release.While the firms are not directly named in the indictment, a majority of the companies targeted pertained to the aerospace industry, while others were involved in technology, critical infrastructure and a gas turbine manufacturer. An Australian domain registrar company and a French-owned aerospace company were also targeted.The new round of charges come as the Trump administration is stepping up its public criticism of what it considers unacceptable behavior by China, which includes military, economic and cyber fronts.This comes after the DOJ announced charges against a Chinese intelligence officer named Yanjun Xu last month. Xu has been extradited to the U.S. to face economic espionage charges for working with a co-conspirator to target GE Aviation and other companies in and outside the U.S. since at least December 2013 in order to also steal sensitive data. U.S. officials say this is only the start of their efforts to crack down on Beijing's intellectual property theft.“For the third time since only September, the National Security Division, with its US Attorney partners, has brought charges against Chinese intelligence officers from the JSSD and those working at their direction and control for stealing American intellectual property,” John Demers, assistant attorney general for national security, said in a statement. “This is just the beginning. Together with our federal partners, we will redouble our efforts to safeguard America’s ingenuity and investment.”The charges unveiled on Tuesday are also likely to further strain the relationship between the U.S. and China, which is already embroiled in an ongoing trade battle. View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}