{"id": "Movie theater chain encourages employees to vote by opening late on election day", "paragraph": "Alamo Drafthouse Cinema, a Texas-based movie theater chain, announced Tuesday that it its theaters will open late on Nov. 6 in an effort to encourage voter participation in the midterm elections slated for that day.\"The most important midterm election anyone can remember is next Tuesday, November 6th, so we're making sure our venue staff has the opportunity to cast their ballot by skipping our usual first round of early matinees that day. We’ll fire the projectors up later on in the afternoon,\" the company said in a statement. Tim League, the Alamo Drafthouse founder and CEO, told Entertainment Weekly that the company is also offering to pay for any rideshare trips that staff members take on election day to polling locations.\"My mom instilled in me at a young age the importance of voting in every election, and I try to pay that forward with the staff at Alamo,” League said. The movie theater chain has locations across the United States, including nearly two dozen in Texas.Voters across Texas will get to vote in one of the country's most high-profile Senate races between incumbent Sen. Ted CruzRafael (Ted) Edward CruzDemocratic strategist warns Beto should be ‘careful’ with social media presence Hillary advisers battle over whether she’ll run in 2020 O'Rourke writes blog post describing a literal run from near the capitol to near the White House MORE (R) and Rep. Beto O'RourkeRobert (Beto) Francis O'RourkeEntrepreneur touts big solutions, endorsements in discussing presidential bid Dem pollster: Texas, Georgia diversifying because they are 'centers for opportunity'  Cruz brushes off question about campaign claim on O'Rourke paying for caravan MORE (D).Recent polling in the race has consistently shown Cruz with a lead, but one typically in the single digits.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}