{"id": "Voting rights groups sue to block Scott from participating in recount", "paragraph": "Voting rights groups are asking a federal district court to block Florida Gov. Rick Scott (R) from playing any role in recounting or certifying the result of the state’s contested Senate race. The suit was filed in the U.S. District Court for the Northern District of Florida Tallahassee Division on Monday. Common Cause and the League of Women Voters of Florida are arguing Scott has tried to intimidate election officials by repeatedly threatening law enforcement intervention in the vote-counting process. “Being tasked with certifying the results of an election in which one is running for office poses a risk of bias under the best of circumstances,” the groups said in their request for a temporary restraining order.\"But Defendant Scott’s efforts to use the authority of his office to advance his campaign and his political party have been extreme.”Scott has sued the Broward County and Palm Beach supervisors of elections, accusing the officials of being engaged in rampant fraud and trying to steal the election for his opponent incumbent Sen. Bill NelsonClarence (Bill) William NelsonDems seek to overhaul voting rules in Florida legal fight  Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Trump's take on midterms: ‘Epic' win in Senate, ‘better than other sitting Presidents’ in House MORE (D). On Monday a state judge ruled against Scott’s request to have the voting machines used in Broward County impounded, finding no evidence of voter fraud.As of the filing, Scott was ahead of his opponent Sen. Bill Nelson (D) by 13,000 votes or approximately .18 percentage points. Under the Florida law, a candidate is entitled to a manual recount if the margin of victory is less than .25 percentage points.The voting rights groups say Scott’s recent actions demonstrate an intent to use the power of his office to interfere with the vote-counting process and tilt the results of the election in his favor.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}