{"id": "Top Saudi businessman: Khashoggi probe will clear crown prince", "paragraph": "Saudi Arabian businessman Prince Alwaleed bin Talal on Sunday defended Saudi Crown Prince Mohammed bin Salman as he faces intense international scrutiny over what role he may have played in the murder of Washington Post journalist Jamal Khashoggi.\"Please let’s give some time for the investigation to finish,\" Alwaleed said on Fox News \"Sunday Morning Futures\"\"I ask Saudi Arabia now publicly, through your program, to have the investigation made public as soon as possible so whereby I believe the Saudi Crown Prince will be 100 percent vindicated and exonerated,\" he added.The billionaire businessman touted the crown prince's accomplishments since he was given expanded authority in Saudi Arabia, arguing that Mohammed has changed the country \"socially, economically, financially\" in a a \"very revolutionary manner.\"Prince Al-Waleed bin Talal: Saudi Arabia right now is witnessing a huge development and changes. #SundayFutures @MariaBartiromo pic.twitter.com/S4Mqma6h8yJamal Khashoggi, a Virginia resident and outspoken critic of Saudi leadership, was killed after entering the Saudi consulate in Istanbul on Oct. 2.The Saudis have offered changing explanations for what happened, first denying knowledge of Khashoggi's whereabouts and later claiming he was killed in a \"fight\" gone wrong. A top Saudi official indicated late last month that the killing was \"premeditated.\"U.S. lawmakers and Turkish President Recep Tayyip Erdoğan have been outspoken in their belief that the crown prince and other top Saudi leaders likely played a role in ordering Khashoggi's killing.The crown prince has denied any foreknowledge of the plot.Secretary of State Mike PompeoMichael (Mike) Richard PompeoOvernight Defense — Presented by Raytheon — Lawmakers struggle with how to punish Saudi Arabia | Trump regrets not visiting Arlington for Veterans Day | North Korea deports detained American Corker: 'A price needs to be paid' for Khashoggi's murder White House eyeing ways to remove Erdoğan foe Gülen from US: report MORE said Friday that the Trump administration still needs more time to gather facts in the incident before doling out additional punishment.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}