{"id": "With the NFIP underwater, expand private sector’s role", "paragraph": "With each passing year of devastating storms and as Hurricane Michael leaves a path of destruction, the financial woes of the National Flood Insurance Program (NFIP) deepen. But despite promising alternatives, until recently, U.S. policymakers have failed to act. However, Rep. Ed RoyceEdward (Ed) Randall RoyceOvernight Defense — Presented by Raytheon — Border deployment 'peaked' at 5,800 troops | Trump sanctions 17 Saudis over Khashoggi killing | Senators offer bill to press Trump on Saudis | Paul effort to block Bahrain arms sale fails Democratic gains erasing House GOP in California Historic class storms Capitol MORE’s (R-Calif.) recently introduced bill – The “Government Risk and Taxpayer Exposure Reduction Act of 2018” (GRATER Act or HR 5381) – provides a fresh approach that seeks to transfer federal risk to private capital and reinsurance markets.This legislation represents an important step in improving U.S. flood policy that will benefit both consumers and taxpayers. But to explain why this is so requires understanding the problems with the current program.For years, the NFIP has been on financial life-support, dependent on congressional bailouts to stay afloat. Despite lawmakers’ decision to forgive $16 billion in loans last year, the program’s debts still exceed $20 billion and it continues to lose $1.4 billion every year.On top of its financial challenges, the NFIP continually falls short of its primary mission of providing affordable flood protection to homeowners in vulnerable areas. As of mid-2017, fewer than 10 percent of households in North Carolina and South Carolina carried flood insurance, so when Hurricane Florence tore through the region last month, it destroyed thousands of uninsured homes. A recent study estimated that, across the country, between 60 and 99 percent of those affected by recent disasters did not have flood insurance.The program’s biggest flaw is that premiums are not actuarially sound, meaning they do not reflect covered risk. In many cases, the NFIP underprices policies, encouraging over-development in flood-prone areas. In other cases, property owners are charged too much, sometimes deterring them from purchasing coverage at all.The program also fails to provide strong enough incentives to mitigate the risks of flood damage and discourage further building in high-risk areas. As a result, the NFIP perpetuates a cycle of waste. For example, a $70,000 home in Mississippi filed 34 NFIP claims from 1978 to 2010, totaling $663,000 – nearly 10 times the value of the home. Overall, just 1 percent of NFIP’s covered properties -- so-called “repetitive loss properties” -- are responsible for 25 to 30 percent of claims.Despite its poor design, the NFIP oversees more than 5 million total policies nationwide, representing more than $1.28 trillion in coverage. The program accounts for about 84 percent of the flood insurance market in the United States; private carriers cover the other 16 percent.It might seem odd that the federal government plays so large a role in flood insurance. After all, insurance on your boat, car, and home is overwhelmingly provided on the private market, and consumers benefit from private-sector competition and innovation.So why doesn’t flood insurance work the same way?A growing number of experts are wondering the same thing and urging Congress to remove obstacles preventing full private sector participation in the flood insurance market. The GRATER Act will help.Consider, for example, the findings from a University of Pennsylvania study that showed private policies often offer better coverage than NFIP policies, and at a lower cost. In some places, the NFIP is charging more than 15 times the risk-based premium, creating opportunities for significant consumer savings from private sector competition.Analysis by Milliman found that “approximately 94% of homes in New Jersey and 96% of homes in New York could see cheaper premiums with private insurance than with the current NFIP premium structure, given similar coverage to the NFIP.” Even in high-risk areas, where flood insurance is mandatory for homes with federally-backed mortgages, the vast majority of homes in New Jersey and New York could expect lower premiums through private carriers. Congress should recognize that a larger role for private carriers is long overdue in the flood insurance market. The GRATER Act is the right approach. Higher rates in some very risky areas will discourage development that will ultimately put less property and fewer lives at risk; and lower rates from private competition will entice more homeowners to purchase flood protection, thereby reducing losses in the future and easing financial pressures on the NFIP.That is a win-win for consumers and taxpayers.Steve Pociask is president and CEO of the American Consumer Institute, a nonprofit educational and research organization. For more information about the Institute, visit www.TheAmericanConsumer.Org or follow us on Twitter @ConsumerPal.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}