{"id": "Clashes reported at conservative rally in Philadelphia", "paragraph": "Protesters and counterprotesters sparred Saturday at a rally in Philadelphia organized by conservative groups that drew far-left groups in opposition.Alleged “proud boy” covering his face gets head-butted as he is being led away from protest. Attacker has been detained. More riot police arriving at Independence Mall now. pic.twitter.com/BUk6LrUZTaScene getting ugly here, cops wading in pic.twitter.com/oJiwcjb9KzThe Facebook event page for the “We The People Rally” described the event as for the “silent majority” and said the event is for “all Patriots, Militia, 3%, constitution loving Americans, pro good cop, pro [Immigration and Customs Enforcement], pro law and order, pro life, pro American value, pro gun and anti illegal immigration ... Will you stand with us? ITS TIME TO SHOW PHILLY WHAT PATRIOTISM REALLY IS!!”While the event page said “Any violence, racism, or display of hate by any group or individual is extremely prohibited,” clashes were reported as groups like the far-right Proud Boys came head to head with counterprotesters, some of whom belonged to antifascist group Antifa.The Proud Boys is made up of self-described “western chauvinists” and are labeled as a hate group by the Southern Poverty Law Center.A Facebook event page for a counterprotest said, “The residents and allies of Philadelphia must stand in opposition to this escalation of the far-right’s push into the city’s culture and politics.”Reports said about 25 people came out for the scheduled rally, but that number was dwarfed by the number of counterprotesters. The event fizzled by around 2:15 p.m., with counterprotesters chanting \"Don't come back!\" as attendees left.However, it appears the clashes were held to a minimum and no significant injuries were reported. The Philadelphia Inquirer reported that at least one person had been arrested.The Philadelphia Police Department did not immediately respond to a request for comment from The Hill.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}