{"id": "Overnight Energy: DOJ investigating Interior chief | Airline vows to switch to electric by 2030 | Greens back Colorado gov candidate with six-figure buy", "paragraph": "DOJ INVESTIGATING ZINKE: The top government watchdog overseeing the Interior Department has referred an investigation into agency head Ryan ZinkeRyan Keith ZinkeLawmakers say California will eventually get emergency funding for fire relief Mulvaney positioning himself to be Commerce Secretary: report Overnight Energy: Trump to visit California wildfire victims | Head of Park Service climate program resigns | Dems rip Trump pick for energy panel MORE to the Department of Justice (DOJ) for potential prosecution.One of the ongoing probes by Interior's Office of Inspector General (OIG) into Zinke will now be looked into by agents at the DOJ, a source confirmed to The Hill.The Washington Post first reported the news Tuesday.CNN, citing two sources, reported later Tuesday that the DOJ inquiry is looking into whether Zinke used his office for personal gain.Zinke told CNN that he didn't know about the DOJ probe, and called the effort \"politically driven.\"\"They haven't talked to me,\" he told the news outlet.\"It will be the same thing as all the other investigations. I follow all rules, procedures, regulations and most importantly the law. This is another politically driven investigation that has no merit.\"Steve Ryan, Zinke's counsel, called the reports \"unsubstantiated.\"\"The Secretary has not been contacted or notified of any DOJ investigation or Inspector General referral. It is disappointing that unsubstantiated and anonymous sources have described an IG office referral to members of the media, as this violates DOJ and IG policy direction,\" he said in a statement to The Hill.He added: \"The Secretary has done nothing wrong.\"A spokesperson for Interior's OIG said they can't comment on ongoing investigations. A DOJ spokesman said it is the agency's policy not to confirm, deny or comment on potential probes.The agency currently has three open investigations into the secretary, including a real estate business deal Zinke entered into with the chairman of oil field services company Halliburton and another on a decision he made against approving a casino project in Connecticut after heavy lobbying from casino giant MGM.Why it matters: The Interior Department was in the spotlight earlier in the month after The Hill first reported that the Interior Department would be replacing its long-time deputy Inspector General with a Trump political appointee, Suzanne Tufts, who was previously confirmed to a job at Department of Housing and Urban Development (HUD). Interior later denied that the replacement was ever finalized. A HUD spokesman later apologized for the misinformation and said the employee had resigned. The timing is leaving many wondering how and when Interior knew about the investigationRead more here. Happy Tuesday! Welcome to Overnight Energy, The Hill's roundup of the latest energy and environment news.Please send tips and comments to Timothy Cama, tcama@thehill.com, and Miranda Green, mgreen@thehill.com. Follow us on Twitter: @Timothy_Cama, @mirandacgreen, @thehill.CLICK HERE to subscribe to our newsletter. AIRLINE VOWS TO SWITCH TO ELECTRIC PLANES ON SOME ROUTES BY 2030: A UK-based budget airline announced this week that it is \"moving fast\" toward developing a fleet of electric planes.EasyJet CEO Johan Lundgren said that the airline is partnering with US manufacturer Wright Electric to switch to electric aircraft for its short-haul routes of less than two hours.The airline is planning to develop the battery-powered planes, a landmark move in eco-friendly travel, by 2030.\"Electric flying is becoming a reality and we can now foresee a future that is not exclusively dependent on jet fuel,\" Lundgren said Monday while speaking at Amsterdam's Schiphol airport, according to CNN.Air travel is widely known to be a significant source of individuals' carbon emissions, and electric planes even on short flights could help diminish that impact.Read more here. SIERRA CLUB BACKS COLORADO DEM GUBERNATORIAL CANDIDATE WITH SIX-FIGURE CAMPAIGN: A major environmental group is spending six figures on a comprehensive campaign supporting Rep. Jared PolisJared Schutz PolisColorado New Members 2019 A red, white and blue wave Sinema’s Senate win cheered by LGBTQ groups  MORE (D) in his Colorado gubernatorial bid.The Sierra Club's Independent Expenditure Committee said its big push for Polis in the final week before Election Day includes phone banking, digital advertising and mailers.The mailers focus on Polis's support for renewable energy and protecting public lands, and argue that \"Colorado's public lands won't survive\" GOP candidate Walker Stapleton.The Colorado gubernatorial race is one of the most closely watched in the nation.Recent polling shows Polis comfortably ahead of Stapleton, including a YouGov poll released last week that had the Democrat with 54 percent of the vote, to the Republican's 42 percent.\"Jared Polis is the governor Colorado needs to protect our public land and public health while standing up to Donald TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE and his attacks on the environment,\" said Jim Alexee, director of the Colorado Sierra Club Chapter, pointing in part to Polis's commitment to 100 percent renewable electricity in Colorado by 2040.Read more here. OUTSIDE THE BELTWAY: Turkish ship to begin drilling for oil, gas in MediterraneanVenice under water as deadly storms hit ItalyBrazil's Bolsonaro backs ethanol industry, pledges partnership IN CASE YOU MISSED IT:Check out stories from Tuesday...-Airline vows to switch to electric planes on short-haul routes by 2030-DOJ investigating Interior chief Ryan Zinke-China relaxes decades old ban on sale of rhino, tiger parts-NC governor sets goal of cutting greenhouse gas emissions by 40 percent-Green group launches six-figure campaign backing Dem in Colorado governor's race-Wild animal population has plunged 60 percent since 1970: reportView the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}