{"id": "Cruz blames Waters, Booker for 'actively encouraging' political divide", "paragraph": "Sen. Ted CruzRafael (Ted) Edward CruzDemocratic strategist warns Beto should be ‘careful’ with social media presence Hillary advisers battle over whether she’ll run in 2020 O'Rourke writes blog post describing a literal run from near the capitol to near the White House MORE (R-Texas) on Wednesday blamed Democratic politicians for \"encouraging\" over-the-top political behavior and rhetoric, hours after authorities intercepted a series of suspicious packages sent to prominent Democrats and CNN earlier in the day.Cruz said on MSNBC's \"Meet the Press Daily\" that all sides should tone down their rhetoric and disagree in a civil manner. When asked if President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE could do more to aid that effort, Cruz shifted his focus to Democrats' rhetoric.\"I think the media always focuses on on the president,\" Cruz said. \"There are too many Democratic politicians that are actively encouraging this.\"The Texas senator then cited comments from Rep. Maxine WatersMaxine Moore WatersDem women rally behind Pelosi Pelosi, potential challenger Fudge hold 'candid' discussion Marcia Fudge under spotlight as Pelosi Speaker fight heats up MORE (D-Calif.), who in June urged supporters to confront Trump administration officials in public spaces.Cruz singled out Waters hours after Capitol Police intercepted a suspicious package at a congressional mail-sorting facility addressed to her.The Texas senator also highlighted remarks from Sen. Cory BookerCory Anthony BookerElection Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Booker to campaign for Dem in Mississippi Senate runoff Warren, 2020 Dems target private immigration detention center operators MORE (D-N.J.), who, in July, urged a nonprofit group in Washington, D.C., to \"get up in the face of some congresspeople\" rather than being passive about issues they care about.Booker's office has argued that right-wing outlets and conservative politicians have taken his remarks out of context.Cruz added that both major parties need to do a better job of discouraging hostilities before quickly pivoting his attention to another prominent Democrat, former presidential candidate, Hillary ClintonHillary Diane Rodham ClintonTexas history curriculum to emphasize that slavery played 'central role' in Civil War Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Texas education board approves restoring Hillary Clinton in history curriculum MORE.\"I thought it was unfortunate when Hillary Clinton said 'we can be civil after the Democrats win. That's wrong,\" Cruz said, referencing comments from Clinton earlier this month.WATCH: Sen. @TedCruz blames Maxine Waters, Cory Booker for political divide. #MTPDaily #MeetTheMidterms Sen. Ted Cruz (R-Texas) tells Chuck that' \"too many\" Democratic leaders are \"actively encouraging\" the political divide. pic.twitter.com/PT2ab4wYrlThe U.S. Secret Service said it intercepted a package earlier Wednesday addressed to Bill and Hillary Clinton's New York home.The package was similar to ones addressed to former President Barack ObamaBarack Hussein ObamaAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural Trump's take on midterms: ‘Epic' win in Senate, ‘better than other sitting Presidents’ in House NASA's carpool to Space Station is back on as Russian rocket Soyuz quickly returns to flight MORE, CNN's New York City offices, former Attorney General Eric HolderEric Himpton HolderEric Holder endorses Pelosi for Speaker Poll: Biden and Sanders lead 2020 Dem field, followed by Beto O'Rourke Trump's shortlist for attorney general takes shape MORE and billionaire Democratic donor George Soros.Cruz condemned the threats, asserting that citizens should be able to disagree on substance without resorting to violence. \"This has been a very divided time, a polarized time,\" he said. \"Violence is never okay, and it doesn't matter where on the political spectrum it comes. These bombs that were apparently sent to Soros and Obama and Clinton, is deeply troubling. On its face it appears to be a terrorist act. I hope the person is caught, is prosecuted and goes to jail for a long, long time.\"Numerous Republicans and Democrats have called for an easing of political hostilities after Wednesday's bomb threats, while simultaneously blaming the other side for inflaming tensions.Democratic leaders pointed to Trump's attacks of Democrats at campaign rallies and elsewhere, where he has labeled the Democratic Party an \"angry mob,\" and attacked news outlets as the \"enemy of the people.\"Republicans have, in recent months, seized on protests from liberal activists, some of whom have confronted lawmakers in public, as a sign of deteriorating political discourse.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}