{"id": "The Memo: Trump and Obama face off in midterms", "paragraph": "ATLANTA — President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE and former President Obama are in a full-blown proxy war centered on Tuesday’s midterm elections.The president and his predecessor have been rallying supporters in critical states in the final days of the campaign. They have also been offering dramatically different visions of what the United States is, and what it should be.Explosive racial issues are sharpening the tensions.At a Pensacola, Fla., rally on Saturday evening, Trump said that Andrew Gillum, the Democratic gubernatorial nominee in Florida, was “not equipped” for the job. Two days previously, he had called Georgia Democrat Stacey Abrams “not qualified” to be governor of her state.Both Abrams and Gillum are black, and Trump’s comments provoked allegations that he was making racially coded attacks. Abrams said on NBC’s “Meet The Press” Sunday that Trump’s claim about her was “vapid and shallow.”Meanwhile, the nation’s first back president is connecting present-day political quests with the struggles of the civil rights movement.On Friday, he held a rally with Abrams at Morehouse College, the historically black institution from which Martin Luther King Jr. graduated.Rep. John LewisJohn  LewisPelosi, potential challenger Fudge hold 'candid' discussion Incoming Michigan Dem will not back Pelosi Marcia Fudge under spotlight as Pelosi Speaker fight heats up MORE (D-Ga.), who marched alongside King in the 1960s, was also among the speakers.When Obama spoke, he stressed, “John Lewis didn’t sit back and say, ‘Man, I hope some day things get better.’ It happened because some people marched, some people mobilized, some people organized … And when they won the right to vote, people voted to make a better history.”Voting rights are one of the major issues in Abrams’s race against Republican Brian Kemp. As Georgia’s secretary of State, Kemp oversees elections in the Peach State, something which appears to critics as a clear conflict of interest.The suggestion of racial animus has marked the dynamics between Trump and Obama from the beginning.Trump’s journey from the world of real estate and television to politics was fueled in part by his promotion of the false \"birther\" theory that Obama was not born in the United States. Obama mocked Trump for this at the 2011 White House Correspondents’ Association dinner, where Trump was present.In the closing days of the midterms, the contrast in the audiences that are drawn to see the 44th and 45th presidents could hardly be more stark.The Pensacola crowd of several thousand for Trump on Saturday included only a handful of black attendees. The audience that packed a 6,000-capacity basketball arena at Morehouse for Obama the previous night was not quite so uniform but was overwhelmingly black.But there are other, broader issues at play in the Trump-Obama faceoff, too.In Atlanta, Obama aimed repeated volleys of criticism at Trump while avoiding mentioning him by name.There have been, Obama said, “incessant, non-stop attempts to divide us with rhetoric that is designed to make us angry and make us fearful … to pit us against one another.”Obama also made an apparent jab at Trump’s propensity for exaggeration and inaccuracy, saying he had never before seen “an approach in which folks at the highest levels of office … will just blatantly, repeatedly, baldly, shamelessly just make stuff up — just say things that they know are not true.”Trump in his own criticism sometimes stresses other Democrats more than Obama. His 2016 opponent Hillary ClintonHillary Diane Rodham ClintonTexas history curriculum to emphasize that slavery played 'central role' in Civil War Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Texas education board approves restoring Hillary Clinton in history curriculum MORE and House Minority Leader Nancy PelosiNancy Patricia D'Alesandro PelosiDem women rally behind Pelosi How this year’s freshmen can save the Congress — and themselves Single-payer health care is better than ObamaCare  MORE (D-Calif.) are more commonly among his targets.But there are exceptions, as at a rally in Indiana on Friday when he pointedly referred to “Barack H. Obama” and suggested that the Democrat’s crowds were smaller than his own.Trump also boasts of undoing the 44th president’s legacy in areas from business regulation to the nuclear deal with Iran.More broadly, Trump asserts that the United States grew timorous and apologetic under Obama's administration. He claims that he is restoring national pride and assertiveness.In Pensacola, he wove this argument into a call for voters to support the GOP in Tuesday’s elections.Even as he talked up his achievements, Trump insisted that progress was “very fragile” and could easily be reversed if the Democrats were to take over Congress.Trump has hit the campaign trail in earnest leading up to Tuesday. He is nearing the end of a stretch of 11 rallies that were scheduled in the six days leading up to Election Day.His tone is clearly aimed at energizing the base that carried him to victory in 2016 — a message that was underlined on Sunday when it was announced that conservative media figures Rush Limbaugh and Sean Hannity would join him at his final rally, set for Cape Girardeau, Mo., on Monday evening.Obama has campaigned in Michigan, Wisconsin and Florida in addition to his Friday rally in Atlanta.On Sunday, he was scheduled to appear in his home base of Chicago and in Indiana, where incumbent Sen. Joe DonnellyJoseph (Joe) Simon DonnellyTrump to nominate former coal lobbyist Andrew Wheeler as next EPA administrator Indiana New Members 2019 2020 politics make an immigration deal unlikely in lame-duck MORE (D) is facing a stiff challenge from Republican Mike Braun.Among the loyal supporters of both men, there is open disdain for the other person.In Pensacola, Paula St. Pierre, who described herself as a “military wife of 25 years,” said that she had felt “embarrassed” by Obama’s time in the White House.In Atlanta, Mandy Simmons, an airport worker, complained that Trump had made the United States a “laughing stock” internationally.Whether Trump or Obama will be more effective for their party is anyone’s guess.Obama enjoys significantly higher favorability ratings than Trump in most opinion polls. But even during his time as president, he struggled to translate his personal popularity into votes for Democratic candidates in midterm elections.Trump’s approval ratings have ticked up to some of the highest levels of his presidency — but he is coming off historic lows. Some Republicans also worry that Trump’s abrasive style will turn off voters in suburban districts that could determine control of the House.By Tuesday night, partisans of one side or the other will see reason to celebrate their president — whomever they consider that to be. The Memo is a reported column by Niall Stanage, primarily focused on Donald Trump’s presidency.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}