{"id": "My fellow Democrats should watch their language: Economic equality is not a rational societal goal", "paragraph": "There has been an uproar, and a justified one at that, about the rising inequality in the United States in recent decades. Whether you are reading Thomas Piketty’s Capital in the Twenty-First Century or following the speeches of Senator Bernie SandersBernard (Bernie) SandersAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural Entrepreneur touts big solutions, endorsements in discussing presidential bid Warren, 2020 Dems target private immigration detention center operators MORE and Congresswoman-elect Alexandria Ocasio-Cortez, this theme has emerged as one of the dominant themes of our time.As important as the theme is, there is a basic problem with the way it is addressed that requires explanation: economic inequality is different from political and civil inequality. The best explanation of the difference comes from John Rawls, the leading American political philosopher of the 20th Century.With political and civil inequality, as Rawls explained in A Theory of Justice (1971), we rightly can argue that there is no justification. We did deny the right to vote to women and African-Americans for long periods of our nation’s history, but today no major political party or candidate for office would even think of saying that women or African-Americans should not be permitted to vote.Now there are of course various ways that state governments can make it more difficult for individuals to exercise their right to vote, but no one is going to take the position that, say African-Americans – because they are African-Americans – should be denied the right to vote.Other political and civil rights are the same. All of them – right to religious freedom, right to free speech, right to assembly, and so on – are rights that every citizen has.But economic inequalities are different. The gap between rich and poor and indeed rich and middle-class Americans, has indeed grown in recent decades. The very rich, the top 1 percent, do indeed have too much wealth and income.Rawls argued that it would be irrational to have a modern industrial society in which there was no economic inequality.After all, if we create a society in which we have economic equality then we have a society where every adult has the same amount of money and resources as every other; moreover, the overall economic pie (namely gross domestic product) would be much smaller in a society where everyone was treated the same (which would be a version of communism) than a society in which there were different economic classes and an incentive structure.If we don't want economic equality because the standard of living for everyone will be too low, then how much inequality is justified?This is the puzzle.Rawls’s solution was to argue that economic inequalities must be arranged “so that they work to the greatest benefit of the least advantaged members of society.” Therefore, economic inequality in a society is justified if the inequality enables the poorest citizens to do better than every societal model which permitted economic inequalities. In short, if you are going have a division between rich and poor then the poor must have a better life and more opportunities for social mobility than any other possible society.The problem with how the concept of economic equality in American politics is discussed arises chiefly with Democrats, namely the party which gives considerable attention to addressing economic inequality. Many Democrats frequently do argue for equal opportunity, especially in education and the workplace. And the language of “equal opportunity” is on safe ground. But too often the overarching arguments are to eliminate economic inequality and promote economic equality. And this can lead voters to misunderstand what the Democrat in question is promoting.Moreover, frequently the media accentuates the problem by indicating or implying that a Democrat in question is calling for economic equality – rather than equality of opportunity – either with titles or subheadings to articles or claims within articles.The problem is not that Democrats argue for policies that would require societal economic equality. The problem is that they talk about economic equality as a goal, and this makes it harder for voters to understand what they are for and what they are against.The problem is when politicians – in speeches and campaigns designed to inspire – toss around the term equality with too much ease, when they call for a society that promotes equality. Citizens latch onto ideas like this and fail to appreciate the difference between political and civil equality and economic equality.We do not need voters to be inspired by distorted thoughts and values. It is this kind of thinking that promotes polarization and dysfunction. We have one party thinking it is the party of freedom (Republicans) and another thinking it is the party of equality (Democrats). This oversimplification of the Red vs Blue debate enlists new voters on either side and the hard issues never get discussed with clarity.Encouraging voters to want economic equality the same way they want, and should want, political and civil equality is a gross error.Democrats now in control of the House of Representatives who plan to push legislation in the name of economic equality should adjust their talking points. Dave Anderson is the editor of “Leveraging: A Political, Economic, and Societal Framework” (Springer, 2014). He is also the author of \"Youth04: Young Voters, the Internet, and Political Power\" (W.W. Norton & Company, 2004) and co-editor of \"The Civic Web: Online Politics and Democratic Values\" (Rowman and Littlefield, 2003). He has taught at George Washington University, the University of Cincinnati, and Johns Hopkins University. He was a candidate in the 2016 Democratic Primary in Maryland’s 8th Congressional District. Contact him at dmamaryland@gmail.com.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}