{"id": "Bloomberg spending $5M on ads to boost Dems ahead of midterms", "paragraph": "Michael Bloomberg, the former mayor of New York, is spending $5 million to air an ad in support of Democratic candidates ahead of this week's midterms, he announced Sunday. The ad, which features Bloomberg urging voters to support Democrats on Tuesday, will first air Sunday during CBS’s “60 Minutes\" and again Monday on the major broadcast networks as well as on CNN and MSNBC.Bloomberg, a possible 2020 presidential candidate, says in the video ad that he \"has never been a particularly partisan person\" but adds that voters need to send a message to Republicans \"that they have failed to lead.\"“I’ve never been a particularly partisan person. I’ve supported candidates from both sides. But at this moment, we must send a signal to Republicans in Washington that they have failed to lead, failed to find solutions and failed to bring us together. That’s why I’m voting Democratic,\" he says. The ad is funded by Independence USA PAC, a Bloomberg-funded super PAC. In the ad, Bloomberg also mentions the recent mass shooting at a Pittsburgh synagogue and says that \"at these moments of great national tragedy, we look to Washington to lead, to offer solutions, to bring us together and to appeal to all of us as Americans.”“We expect a plan. We expect to be called to a higher purpose, we expect to work together. I don’t hear that call coming from Washington these days. Do you? In fact, I hear the opposite,\" he adds as an image of President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE is shown. Bloomberg said in a statement about the ad that Trump and Republicans \"are fueling\" division in the United States.\"And that holds us back as a nation. I’m unwilling to sit by and accept it,\" he added. Bloomberg is considered a potential candidate for president in 2020. He told CNN last week that he would \"take a look\" at running after the midterms.“I am focusing on Nov. 6 and then I've said, you know, a few months later I'll take a look at it and see,” Bloomberg said. View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}