{"id": "US mulls asking for delay in Afghan elections to help jolt Taliban talks: report", "paragraph": "The Trump administration is considering asking the Afghan government to hold off on its upcoming presidential elections to allow Washington to attempt to end the 17-year war against the Taliban, The Wall Street Journal reported.People briefed on the discussions told the Journal that pressing for a delay to the elections, currently set for April, is one of several options U.S. officials are considering.U.S. special envoy Zalmay Khalilzad was reported to have raised the idea, but the move is seen as contradictory with D.C.’s long-promoted rhetoric of a free democracy in Afghanistan.Afghan President Ashraf Ghani, who will seek a second five-year term in the vote, has already opposed the idea.“Based on the free election, complete inclusive election, people will decide on their future leadership,” Ghani said last week.The Taliban so far has refused to negotiate with Ghani, who has offered to start talks with the terrorist group without preconditions.The United States asking Afghanistan to postpone elections would potentially cause a rift between the two countries. Kabul relies on Washington for financial and military support, giving the U.S. significant influence, but Afghan leaders would make the ultimate decision.The Trump administration hopes a suspension could finally bring about peace talks with the Taliban, which officials fear could be stalled by the political turmoil that often occurs around Afghan elections.President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE has long grumbled over America’s continued presence in Afghanistan, threatening to pull soldiers out before reluctantly announcing a new strategy in August 2017. The strategy increased U.S. troop levels by several thousand, to a force of roughly 14,000, but so far has not produced the results the administration wanted.The administration earlier this year began direct talks with the Taliban as Trump’s plan has floundered.The U.S. Special Inspector General for Afghanistan Reconstruction recently found that the Afghan government only controls about 55 percent of the country's districts. That percentage is the lowest recorded since agency began tracking it in 2015.Khalilzad has reportedly said that he probably has six to 12 months to come up with a new solution to end the war.He is set to meet next week with Taliban leaders in Doha, Qatar, and may also speak with members in Dubai, according to the Journal. View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}