{"id": "Trump set to have close ally Graham in powerful chairmanship", "paragraph": "Sen. Lindsey GrahamLindsey Olin GrahamOn The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report Cotton opposes Trump-backed criminal justice bill Lawmakers say California will eventually get emergency funding for fire relief MORE’s (R-S.C.) expected election as chairman of the Senate Judiciary Committee would put one of President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE’s closest allies in charge of a panel overseeing the confirmation of judges and special counsel Robert MuellerRobert Swan MuellerSasse: US should applaud choice of Mueller to lead Russia probe MORE’s probe.Republican sources say they expect Graham to be more of a partisan player than Sen. Chuck GrassleyCharles (Chuck) Ernest GrassleyOvernight Health Care — Presented by The Partnership for Safe Medicines — GOP lawmaker pushes back on Trump drug pricing plan | Pfizer to raise prices on 41 drugs next year | Grassley opts for Finance gavel McConnell: Criminal justice bill unlikely this year  On The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report MORE (R-Iowa), whose decision to step down as Judiciary Committee chairman to take the gavel of the Finance Committee paves the way for the South Carolina Republican to take over. He’s seen as a fighter who will take on Democrats: Witness his forceful denunciation of their tactics during the Brett KavanaughBrett Michael KavanaughThe Hill's 12:30 Report — Sponsored by Delta Air Lines — White House to 'temporarily reinstate' Acosta's press pass after judge issues order | Graham to take over Judiciary panel | Hand recount for Florida Senate race Graham set to take over Judiciary Leverage the new US International Development Finance Corporation to compete with China MORE Supreme Court hearings, which went viral online.Yet Graham also is seen as a ready dealmaker when it comes to passing legislation. “I think Graham will be bit more partisan but also somebody who the Democrats are more likely to cut a deal with,” said Brian Darling, a GOP strategist and former Senate aide.Graham has been outspoken in arguing that Trump won’t fire Mueller — a possibility that Democrats say can’t be ruled out — yet he is also a co-author of legislation protecting the special counsel that Senate Majority Leader Mitch McConnellAddison (Mitch) Mitchell McConnellAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural McConnell: Criminal justice bill unlikely this year  On The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report MORE (R-Ky.) doesn’t want to put on the floor. Graham is also a co-author of a bipartisan deal on criminal justice reform, which Trump supports but McConnell and conservatives such as Sen. Tom CottonThomas (Tom) Bryant CottonMcConnell: Criminal justice bill unlikely this year  Cotton opposes Trump-backed criminal justice bill Trump’s backing may not be enough on criminal justice reform MORE (R-Ark.) oppose. “He’s someone who will fight the partisan fights when it comes to the Mueller investigation and when it comes to using the committee to subpoena individuals and do oversight,” Darling said.“He’ll be very defensive of the president when it comes to those issues,” Darling added. “But on substantive legislative issues, he’s going to be much more likely to cut a deal with Democrats where the president can sign onto it.” Graham says his top priority will be to confirm conservative justices to the federal courts, which is also the top priority for McConnell.Though Graham must be formally elected as chairman of Judiciary by his fellow Republicans on the panel, GOP sources say his ascension is guaranteed. “If I am fortunate enough to be selected by my colleagues to serve as Chairman, I will push for the appointment and Senate confirmation of highly qualified conservative judges to the federal bench and aggressive oversight of the Department of Justice and FBI,” he said in a statement Friday. More specifically, Graham says he will scrutinize the FBI’s handling of the Russia investigation, something that Trump has called for in recent months. “The oversight function would be very much front and center,” he told reporters this week when asked whether as chairman he would look into the Russia investigation and how it was handled.   Graham publicly clashed with Trump during the 2016 Republican presidential primary, but has since become one of the president’s golfing partners and closest confidants in the Senate. He spoke with Trump about the Mueller investigation Wednesday and then met Thursday with Matthew Whitaker, who is overseeing the probe as acting attorney general. He told reporters after the meeting that Mueller isn’t in any danger of being fired, something that GOP leaders have said to fend off calls for Congress to pass legislation protecting the special counsel. Graham, who represents one of the most conservative states in the country, has had an up-and-down relationship with conservatives over the years. He was Sen. John McCainJohn Sidney McCainCindy McCain takes aim at Trump: We need a strong leader, 'not a negative Nancy' McCain would have said ‘enough’ to acrimony in midterms, says Cindy McCain Trump nominates Jim Gilmore for ambassador post MORE’s (R-Ariz.) best friend for many years on Capitol Hill and a key ally in his fight to pass comprehensive immigration reform, which was unpopular with conservatives. He even worked closely with former Sen. John KerryJohn Forbes KerryKerry: ‘People are going to die' due to Trump's withdrawal from Paris climate deal  Kerry tears into Trump for skipping visit to military cemetery: ‘Truculent child president’ Democrats huddle for 2020 ‘friend-raisers’ MORE (D-Mass.) in 2009 on cap-and-trade climate change legislation, another proposal conservatives opposed, although he later changed course and declared cap-and-trade legislation dead in 2010. On Thursday, he said he will look into campaign finance reform — one of McCain’s signature issues — if he takes over the Judiciary panel. “I would like to have a hearing about dark money, how foreign governments, even terrorist organizations, can create shell companies, corporations in America [and] actually influence an election,” he said.Graham said he doesn’t agree with the Supreme Court’s 2010 decision in Citizens United v. Federal Election Commission, which dramatically curbed Congress’s ability to restrict political spending by outside groups. “I don’t like the decision. I think we have ample authority as legislative bodies to control how campaigns are run,” he said. Graham won points with conservative activists during Kavanaugh’s confirmation hearing.“This is the most unethical sham since I’ve been in politics,” Graham yelled at his Democratic colleagues on the panel, pointing to Sen. Dianne FeinsteinDianne Emiel FeinsteinLawmakers say California will eventually get emergency funding for fire relief Top Dems: DOJ position on Whitaker appointment 'fatally flawed' Congress needs to wake up to nuclear security threat MORE’s (D-Calif.) decision to sit on sexual assault allegations against Kavanaugh for more than a month. It was sharp contrast with Grassley, who grew visibly frustrated with Democrats at times but never rebuked them as strongly as Graham.“The fact that somebody was on the committee very angrily pushing back on Democrats I think the conservatives really liked it,” said Darling. “The conservative movement has had a very interesting and difficult relationship with Lindsey Graham over the years. There have been times where he’s been a conservative, there have been times when he’s been more liberal.”Graham has long argued that presidents should be given broad deference in appointing judges to the federal courts. He voted for former President Obama’s two picks to the Supreme Court, Sonia Sotomayor and Elena Kagan. Several Senate colleagues see Graham’s increasingly close relationship with Trump — and his angry outburst in defense of Kavanaugh — as part of an effort to shore up his base ahead of his 2020 reelection. Graham was considered vulnerable to a Tea Party challenge in 2014 after prominently pushing comprehensive immigration reform the year before, but he won the primary with 56 percent of the vote against divided opposition. One Republican source said there’s a chance that Graham could follow up on the Kavanaugh debate by punishing Sen. Cory BookerCory Anthony BookerElection Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Booker to campaign for Dem in Mississippi Senate runoff Warren, 2020 Dems target private immigration detention center operators MORE (D-N.J.), a member of the panel, for making public “committee-confidential” documents during the nominee’s first round of hearings. “I think that he is probably considering kicking Booker off the committee because of the committee confidentiality they broke. I haven’t spoken to him but I know how outraged he was,” said a person who has been involved in the Senate’s judicial confirmation process for more than 20 years. The source noted that Sen. Patrick LeahyPatrick Joseph LeahySenators introduce Trump-backed criminal justice bill Dem senators want hearing on funding for detained migrant children Dem senators request classified briefing on Khashoggi MORE (D-Vt.) was pressured to resign from the Senate Intelligence Committee in 1987 after he leaked a draft report of the panel’s investigation into the Iran-Contra scandal.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}