{"id": "Florida sues CVS, Walgreens over sale of opioids ", "paragraph": "Florida is suing CVS and Walgreens for allegedly contributing to the state and national opioid crisis.Attorney General Pam Bondi announced Friday that the two drugstore giants were being added into an existing case against Purdue Pharma, which makes OxyContin, and several other manufacturers.The suit argues that CVS and Walgreens contributed to the opioid epidemic by overselling painkillers and not being diligent enough with stopping illegal sales, according to a statement on the Florida Attorney General's website.“We will continue to pursue those companies that played a role in creating the opioid crisis,” Bondi said. “Thousands of Floridians have suffered as a result of the actions of the defendants.”Bondi has been mentioned as a potential candidate to replace the departed Jeff SessionsJefferson (Jeff) Beauregard SessionsAttorneys want Supreme Court to determine legality of Whitaker as acting AG Hillicon Valley: Russian-linked hackers may have impersonated US officials | Trump signs DHS cyber bill | Prosecutors inadvertently reveal charges against Assange | Accenture workers protest border enforcement work | App mines crypto for bail bonds McCarthy, other Republicans back Ratcliffe to be next attorney general MORE as U.S. Attorney General.According to the lawsuit, Walgreens dispensed billions of opioid dosages in Florida pharmacies since 2006.CVS is alleged to have sold 700 million opioid dosages between 2006 and 2014.Fighting the opioid crisis has been a major focus on federal and state government officials for the last decade.Walgreens declined to comment for the story. CVS said the lawsuit is \"without merit.\"“We are committed to the highest standards of ethics and business practices, including complying with all federal and state laws governing the dispensing of controlled substance prescriptions, and CVS is dedicated to helping reduce prescription drug abuse and diversion,” they said. “We also have stringent policies, procedures and tools to help ensure that our pharmacists properly exercise their professional responsibility to evaluate controlled substance prescriptions before filling them.”View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}