{"id": "Election Countdown: One week from midterms, House battlefield expands", "paragraph": "This is Election Countdown, The Hill's newsletter from Lisa Hagen (@LA_Hagen) and Max Greenwood (@KMaxGreenwood) that brings you the biggest stories on the campaign trail. We'd love to hear from you, so feel free to reach out to Lisa at LHagen@thehill.com and Max at MGreenwood@thehill.com. with any questions, comments, criticisms or food recommendations (mostly the latter, please). Click here to sign up. We're 7 days until the 2018 midterm elections and 735 days until the 2020 elections. One week out from the midterm elections, Democrats and Republicans are fighting on the largest House battlefield in several cycles.Even with a week to go, it's still unclear exactly how many seats will flip in an unpredictable election cycle that's had a backdrop of political violence, intense polarization and racial animus.But we at least know what the battlefield looks like and it goes greatly beyond the key suburban seats Democrats have been targeting all cycle, though they will still be crucial for the party to get to the magic number of 23 seats.In the last week, the largest Democratic groups are investing in 64 media markets, while GOP group are spending in 58 markets. And since the beginning of the year, Democrats and their supporters have outspent Republicans by a margin of more than $125 million.The expanded battlefield encompasses much more conservative terrain where President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE had double-digit margins of victory. And that's been highlighted by the 11th hour spending by both parties' campaign committees and top House super PACs.The largest outside groups backing Democrats are sending mailers to redder districts held by Reps. John CarterJohn Rice CarterRepublican John Carter holds off challenge from Dem combat veteran in Texas Combat veteran after GOP opponent says campaign is a 'war': ‘You don’t know s--- about war’  Election Countdown: One week from midterms, House battlefield expands MORE (R-Texas), Lamar SmithLamar Seeligson SmithTexas New Members 2019 Pro-environment Democrats gain influence in Congress and states, but lose key GOP allies  Overnight Energy: Trump expects to weigh in on Zinke's future soon | EPA relaxes air permitting standard | House Science panel in for big changes | Update on midterm ballot measures MORE (R-Texas), Vern BuchananVernon Gale BuchananMORE (R-Fla.) and Jackie WalorskiJacqueline (Jackie) R.  WalorskiMany authors of GOP tax law will not be returning to Congress Election Countdown: One week from midterms, House battlefield expands Dems seek to expand House fight one week before midterms MORE (R-Ind.) and in the district formerly held by Republican Ron DeSantisRonald Dion DeSantisDeSantis transition team zeroes in on possible chief of staff Trump congratulates Kemp, says Abrams will have 'terrific political future' Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority MORE in Florida. Seats like these would only get swept up if there is a big wave, but the move reflects the confidence of Democrats.The National Republican Congressional Committee (NRCC) is now spending in the district held by Reps. Jaime Herrera BeutlerJaime Lynn Herrera BeutlerMidterm results shake up national map How Republicans who voted against ObamaCare repeal fared in midterms Election Day: An hour-by-hour viewer’s guide MORE (R-Wash.) and in South Carolina's 1st congressional district, where the GOP candidate is Katie Arrington, who defeated Rep. Mark SanfordMarshall (Mark) Clement SanfordSouth Carolina New Members 2019 Mark Sanford: 'I hope' Trump is a 'temporary blip on the radar screen' Dem Joe Cunningham turns Sanford open seat blue in South Carolina MORE (R) in the primary. The GOP has also gone back in with spending to boost Rep. Will HurdWilliam Ballard HurdElection Countdown: Florida Senate race heads to hand recount | Dem flips Maine House seat | New 2020 trend - the 'friend-raiser' | Ad war intensifies in Mississippi runoff | Blue wave batters California GOP Midterm results shake up national map Election Countdown: Lawsuits fly in Florida recount fight | Nelson pushes to extend deadline | Judge says Georgia county violated Civil Rights Act | Biden, Sanders lead 2020 Dem field in poll | Bloomberg to decide on 2020 by February MORE (R-Texas) and the top Republican super PACs recently spent on behalf of Reps. Scott TaylorScott William TaylorVirginia New Members 2019 Overnight Defense — Presented by Raytheon — First lady's office pushes for ouster of national security aide | Trump taps retired general as ambassador to Saudis | Mattis to visit border troops | Record number of female veterans to serve in Congress Record number of female veterans to serve in next Congress MORE (R-Va.) and Ted BuddTheodore (Ted) Paul BuddRepublican Ted Budd holds off challenger to win reelection in North Carolina Election Day: An hour-by-hour viewer’s guide Jockeying already stepping up in House leadership fights MORE (R-N.C.), who are both in districts once considered a reach for Democrats.Nate Silver of FiveThirtyEight breaks down why the battlefield has ballooned, touching on factors including the high number of GOP retirements, Democrats' steep cash advantage and Pennsylvania's new congressional map. Senate showdownTrump is slated to travel to eight states over the final week of the midterm elections. He plans to hold 11 campaign rallies in six days to boost Republicans in top Senate and House races. Some states include Florida, Montana, Indiana and Missouri--all home to marquee Senate races that'll determine which party controls the upper chamber. Sen. Jon TesterJonathan (Jon) TesterCortez Masto poised to become DSCC chair Mellman: The triumph of partisanship VA under pressure to deliver Trump reforms MORE (D-Mont.) said at the Rocky Boy's Indian Reservation that he doesn't think Sen. Elizabeth WarrenElizabeth Ann WarrenElection Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Entrepreneur touts big solutions, endorsements in discussing presidential bid Warren, 2020 Dems target private immigration detention center operators MORE's (D-Mass.) use of a DNA test to claim Native American heritage would \"pass the test.\" But Tester dismissed the controversy around the test as insignificant, insisting that there were more important issues to address. \"The real issue that revolves around Native American people is poverty and unless you're a gaming tribe, it's a problem and we've got to figure our solutions to get it fixed,\" Tester said, according to The Hill's Alexander Bolton. Florida Gov. Rick Scott walked away when asked by a reporter on Tuesday whether he would support Trump's proposal to end birthright citizenship for children of non-U.S. citizens, the Miami Herald's Alex Daugherty reports. In a statement obtained The Hill, Scott said that he would need to see the proposal before deciding whether to support it, but argued that America's current immigration is \"broken.\" An aide to Scott said that the governor had already begun walking away when the question was posed and did not hear the reporter ask it. Wave watchPresident Trump is doubling down on his hard-line immigration stance in the final days before the midterm elections, revisiting a tried-and-tested plan he hopes will fire up his core supporters and get them to the polls on Election Day, The Hill's Jordan Fabian reports. In an interview with Axios released Tuesday, Trump vowed to end citizenship for children of non-legal residents and undocumented immigrants born in the U.S., a change he proposed during the 2016 campaign, even though birthright citizenship is enshrined in the Constitution. House Majority PAC, a super PAC backing Democratic congressional candidates, is canceling an $800,000 ad buy in Virginia's 10th District – a sign that Democrats are feeling good about their chances of ousting incumbent Rep. Barbara ComstockBarbara Jean ComstockVirginia New Members 2019 Defeated Republicans mocked by Trump fire back at president GOP lawmaker defends Mia Love from Trump attacks: 'I was disgusted when I heard it' MORE (R-Va.) in November. Comstock is facing a tough challenge from Democrat Jennifer Wexton, who appears to have the momentum in the race. The Cook Political Report rates the contest as \"Lean Democrat.\" Rep. Steve StiversSteven (Steve) Ernst StiversDemocrat Katie Porter unseats GOP's Mimi Walters House GOP returns to Washington after sobering midterm losses  Conservative magazine posts recording of King using derogatory language against immigrants MORE (R-Ohio), National Republican Congressional Committee chairman, condemned recent remarks by Rep. Steve KingSteven (Steve) Arnold KingIowa governor: Steve King needs to decide if he wants to represent ‘the values of the 4th District’  Conservative magazine posts recording of King using derogatory language against immigrants How Steve King turned his back on states’ rights for Big Ag MORE (R-Iowa) backing white nationalist politicians. \"Congressman Steve King's recent comments, actions, and retweets are completely inappropriate. We must stand up against white supremacy and hate in all forms, and I strongly condemn this behavior,\" Stivers tweeted Tuesday. King came under fire for meeting with a far-right Austrian group and later defended the meeting by saying: \"If they were in America pushing the platform that they push, they would be Republicans.\" Stivers' comments came as polls show a tightening race for King. Former Trump White House chief strategist Stephen Bannon will campaign this weekend in Virginia for Rep. Dave Brat (R), who faces a tough reelection bid against Democratic challenger Abigail Spanberger. Survey says…Kansas Secretary of State Kris Kobach (R) and state Sen. Laura Kelly (D) are virtually tied in the state's closely watched gubernatorial race, according to a new Emerson College poll. Roughly 44 percent of respondents said they back Kobach, a hard-charging conservative who has allied himself closely with Trump, while 43 percent said they support Kelly. Eight percent reported backing independent Greg Orman, while another 4 percent said they were undecided. A new poll from NBC News and Marist shows Rep. Kyrsten Sinema (D-Ariz.) with a 6-point lead over her Republican opponent, Rep. Martha McSallyMartha Elizabeth McSallyArizona New Members 2019 House GOP returns to Washington after sobering midterm losses Overnight Defense — Presented by Raytheon — First lady's office pushes for ouster of national security aide | Trump taps retired general as ambassador to Saudis | Mattis to visit border troops | Record number of female veterans to serve in Congress MORE (R-Ariz.), in Arizona's Senate race. Sinema currently leads McSally 50-44 percent, according to the survey, while 6 percent of respondents said they are undecided or will vote for another candidate.   Democrat Ben McAdams is leading Republican Rep. Mia LoveLudmya (Mia) LoveMia Love pulls ahead in Utah race as judge dismisses her lawsuit Judge tosses Mia Love lawsuit to halt vote count Election Countdown: Florida Senate race heads to hand recount | Dem flips Maine House seat | New 2020 trend - the 'friend-raiser' | Ad war intensifies in Mississippi runoff | Blue wave batters California GOP MORE (Utah) by 6 points in the nationally watched race to represent Utah's 4th District, according to a new poll from KUTV 2News and Dixie Strategies. At the same time, that survey found far fewer respondents hold \"very unfavorable\" views of McAdams than Love – at 16 percent versus 32.2 percent. A new University of North Florida poll gives Democrat Andrew Gillum a 6-point lead over Republican Ron DeSantis in Florida's gubernatorial race. Also from UNF: Sen. Bill NelsonClarence (Bill) William NelsonDems seek to overhaul voting rules in Florida legal fight  Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Trump's take on midterms: ‘Epic' win in Senate, ‘better than other sitting Presidents’ in House MORE (D-Fla.) and Scott are neck and neck, with 7 percent of likely voters remaining undecided. Despite weathering a barrage of ferocious GOP attacks, Democrat Antonio Delgado holds a 5-point lead over Rep. John FasoJohn James FasoTax law failed to save GOP majority New York New Members 2019 McCarthy defeats Jordan for minority leader in 159-to-43 vote  MORE(R-N.Y.) in the race for New York's 19th District, according to a Monmouth University poll. The survey shows Delgado coming in at 49 percent, while Faso trails at 44 percent. That's a 1-point increase for Delgado and a 1-point decrease for Faso since the last time Monmouth conducted the survey in September. Rep. Greg GianforteGregory Richard GianforteMontana New Members 2019 Gianforte defeats Democrat for Montana's at-large congressional seat Sabato's Crystal Ball: Dems will pick up more than 30 House seats, GOP set to keep Senate MORE (R-Mont.) is tied with former Democratic state Rep. Kathlene Williams in Montana's at-large House race,according to a new poll from Gravis Marketing. Gianforte and Williams are in a dead heat, with both candidates at 48 percent. Trump still remains popular in a state he won by 20 points, with an approval rating of 58-38 percent. Trump recently stumped for Gianforte in Montana. The president raised eyebrows for joking that Gianforte assaulting a reporter helped the congressman win the 2017 special election. What we're watching forCampaign trail:--Oct. 31: Former Vice President Joe BidenJoseph (Joe) Robinette BidenEntrepreneur touts big solutions, endorsements in discussing presidential bid Avenatti ‘still considering’ presidential run despite domestic violence arrest Election Countdown: Florida Senate race heads to hand recount | Dem flips Maine House seat | New 2020 trend - the 'friend-raiser' | Ad war intensifies in Mississippi runoff | Blue wave batters California GOP MORE will be in Bridgeton, Mo. for Sen. Claire McCaskillClaire Conner McCaskillMissouri New Members 2019 2020 politics make an immigration deal unlikely in lame-duck Mellman: The triumph of partisanship MORE (D).--Nov. 1: Biden will be in Fargo, N.D. for Sen. Heidi HeitkampMary (Heidi) Kathryn HeitkampTrump to nominate former coal lobbyist Andrew Wheeler as next EPA administrator North Dakota New Members 2019 2020 politics make an immigration deal unlikely in lame-duck MORE (D).--Nov. 2: Former President Obama will campaign for Georgia Democratic gubernatorial nominee Stacey Abrams in Atlanta. He'll also be stumping for Democrat Andrew Gillum, who's running for Florida governor, in Miami. Trump rallies (All times in ET):--Oct. 31 in Fort Myers, Fla. at 7 p.m.--Nov. 1 in Columbia, Mo. at 7:30 p.m.--Nov. 2 in Huntington, W. Va. at 4 p.m.--Nov. 3 in Pensacola, Fla. at 7:30 p.m. Debates:--Oct. 30: Indiana Senate debate--Nov. 1: West Virginia Senate debate--Nov. 4: Georgia gubernatorial debate Coming to a TV near youIn a first for the House Democrats' campaign arm, the Democratic Congressional Campaign Committee released a multi-state, Spanish-language TV ad to boost turnout among Hispanic voters. The 500,000 ad buy will run through Election Day in eight media markets that'll cover major House districts in Nevada, Texas, New Mexico and Utah. The ad features a young woman alongside her mother explaining why they'll vote on Nov. 6. The translated script: \"My mom has worked very hard to give me a better future. I work in a hospital, I have a bachelor's degree and even though I want to get ahead I can't right now. We need a Congress that will fight for us. And for that reason we are going to vote for a change. We are going to vote Tuesday, November 6. Together.\" Meanwhile on the Republican side, the Congressional Leadership Fund is focusing its closing argument on immigration and the tax law. CLF is running contrast ads in the final week in districts held by GOP Reps. Andy Barr (Ky.), Brian FitzpatrickBrian K. Fitzpatrick3 ways House Dems can fight climate change when sweeping policy is off the table Midterm results shake up national map House Dems can take on climate change — if they don’t get distracted by Trump MORE (Pa.), Steve ChabotSteven (Steve) Joseph ChabotGaetz goes to bat with Trump on Jordan Republican Steve Chabot wins reelection in Ohio Election Countdown: One week from midterms, House battlefield expands MORE (Ohio) and Claudia Tenney (N.Y.) -- all districts Trump won with the exception of Fitzpatrick's. The ads tie the incumbents to Trump and his economic and immigration agenda, while continuing to link Democrats to House Minority Leader Nancy PelosiNancy Patricia D'Alesandro PelosiDem women rally behind Pelosi How this year’s freshmen can save the Congress — and themselves Single-payer health care is better than ObamaCare  MORE (D-Calif.). In a donor memo obtained by The Hill, CLF executive director Corry Bliss said Republicans need to sell that contrast in the more than 20 races he said remain too close to call. \"Winning the close races will come down to getting Republicans to vote and defining the choice.\" Race for the White HouseHillary ClintonHillary Diane Rodham ClintonTexas history curriculum to emphasize that slavery played 'central role' in Civil War Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Texas education board approves restoring Hillary Clinton in history curriculum MORE's team says she won't run for president despite speculation she'd mount a third White House bid. \"She's more likely to win Powerball,\" Philippe Reines, Clinton's longtime adviser, told The Hill's Amie Parnes on Monday. Former New York City Mayor Michael Bloomberg said he'll \"take a look\" at a 2020 run. The former independent re-registered as a Democrat earlier this month. But he insisted that his focus remains on the midterms, spending tens of millions on advertising to boost Democrats' efforts to take back the House. Sen. Bernie SandersBernard (Bernie) SandersAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural Entrepreneur touts big solutions, endorsements in discussing presidential bid Warren, 2020 Dems target private immigration detention center operators MORE (I-Vt.) declined to pledge to serve a full six-year term if reelected in November. Sanders is highly favored to win a third term and is seen as a potential White House hopeful in 2020. \"The simple truth is I have not made that decision. But I'm not going to sit here and tell you that I may not run. I may. But on the other hand, I may not,\" Sanders said at a Monday forum regarding a potential presidential bid. The Hill's Election Countdown was written by Lisa Hagen, Max Greenwood, Rachel Cohen and James Wellemeyer.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}