{"id": "Sotomayor: Kavanaugh now part of the Supreme Court ‘family’", "paragraph": "Justice Sonia Sotomayor says her colleagues have welcomed the Supreme Court's newest justice, Brett KavanaughBrett Michael KavanaughThe Hill's 12:30 Report — Sponsored by Delta Air Lines — White House to 'temporarily reinstate' Acosta's press pass after judge issues order | Graham to take over Judiciary panel | Hand recount for Florida Senate race Graham set to take over Judiciary Leverage the new US International Development Finance Corporation to compete with China MORE, into the court's “family” after his confirmation process captivated the nation and further exposed its partisan divides.\"When you're charged with working together for most of the remainder of your life, you have to create a relationship,\" Sotomayor told CNN’s \"Axe Files\" in an interview released Saturday.\"The nine of us are now a family and we're a family with each of us our own burdens and our own obligations to others, but this is our work family, and it's just as important as our personal family,\" she said.\"We've probably spent more time with each other than most justices spend — who have spouses — with their spouses.\"Kavanaugh’s confirmation process was thrown into tumult this fall after three women publicly accused him of sexual misconduct stemming from his time in high school and college in the early 1980s.Kavanaugh vehemently denied the charges, with President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE and GOP lawmakers vocally defending him. He was ultimately confirmed by the Senate in a 50-48 vote, with Sen. Joe ManchinJoseph (Joe) ManchinTrump to nominate former coal lobbyist Andrew Wheeler as next EPA administrator Schumer reelected as Senate Democratic Leader Mellman: The triumph of partisanship MORE (D-W.Va.) the only Democrat to support him.The confirmation process sparked protests on Capitol Hill, with anti-Kavanaugh demonstrators confronting lawmakers in the hallways of the Capitol. Both parties argued the bitter confirmation fight would energize their base heading into the midterm elections earlier this month.Sotomayor, who was appointed by former President Obama to the high court in 2009, told CNN she thinks the focus on Kavanaugh will now shift to the actions he takes on the court.\"It was Justice [Clarence] Thomas who tells me that when he first came to the Court, another justice approached him and said, 'I judge you by what you do here. Welcome.' And I repeated that story to Justice Kavanaugh when I first greeted him here,\" she said.Thomas was accused of sexual harassment during his Supreme Court confirmation in 1991 and was also narrowly confirmed by the Senate.During her interview, Sotomayor also pushed back on the idea that Kavanaugh’s confirmation tilted the court further to the right.Kavanaugh, who has strong conservative bona fides, replaced Anthony Kennedy, who was considered a centrist and the court’s swing vote.\"Conservative, liberal, those are political terms,\" she said. \"Do I suspect that I might be dissenting a bit more? Possibly, but I still have two relatively new colleagues, one very new colleague, Brett Kavanaugh and Neil Gorsuch. And we've agreed in quite a few cases, we've disagreed in a bunch, But you know, let's see.\"View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}