{"id": "City official shown on video shooting alleged shoplifter charged with murder", "paragraph": "A Florida city councilman has been charged with murder after a video emerged showing him shoot and kill a man he claims was shoplifting from the military surplus story he owns. ABC News reported that Lakeland City Commission member Michael Dunn was charged with murder on Friday in the death of 50-year-old Christobal Lopez, whom he shot and killed earlier this month when he reportedly attempted to take a hatchet from Dunn’s Vets Army Navy Surplus store.The shooting death, which took place on Oct. 3, was captured in surveillance footage released by local authorities earlier this month.Dunn, 47, claimed he shot the man in self-defense and cited Florida’s \"stand your ground\" law, saying he knew Lopez was in possession of a hatchet. But Brian Haas, the state attorney for Florida's 10th Judicial Circuit, said at a news conference on Friday that he “determined that this case and the actions of Mr. Dunn fall outside the protection of the stand your ground law,” according to ABC News. According to an affidavit seen by the news outlet, Dunn retrieved a handgun on the night of the incident after reportedly seeing Lopez take a hatchet from his store and put it in his waistband.The two reportedly got into an argument when Dunn confronted Lopez over the hatchet and blocked him from leaving the store.After Lopez told Dunn he would pay for the hatchet and approached the counter, he then “hastily” attempted “to leave the business with the hatchet in hand,” the affidavit reportedly states.Surveillance footage from the night shows Dunn grab Lopez’s shirt as he attempted to leave and shoot him twice after he loses grip on the man’s shirt. The affidavit also points out that Dunn did not attempt to \"render aid to the victim,\" after firing the two shots. \"At no time did the victim appear to have made any threatening movements towards the suspect,\" the affidavit continues. \"Further, witness testimony ... revealed that the victim did not make any verbal threats towards the suspect.\"The affidavit also included statements Dunn made to local police before he was read his Miranda Rights.\"The suspect stated he was in fear, but when he was asked what would have happened if he let go of the victim, the suspect replied, 'It might be fair to say, that if I just stepped back and let somebody come in and take what they want, that there would be no issue!\" the affidavit states. Dunn is reportedly being held in Polk County Jail. The date for his for his arraignment has not yet been set.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}