{"id": "Overnight Energy: Trump, California leaders clash over fires | Trump says oil prices should be 'much lower' | Zinke criticizes media coverage | Officials consider new truck pollution rule", "paragraph": "TRUMP VS. CALIFORNIA OVER WILDFIRES: President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE and California's political leaders are engaging in a war of words over the cause of wildfires that have devastated the state, killing at least 31 people.Gov. Jerry Brown (D) blamed climate change at a press conference Sunday, days after Trump pointed the finger at the state's forest management programs.\"Managing all the forests everywhere we can does not stop climate change, and those who deny that definitely are contributing to the tragedies that we are witnessing and will continue to witness,\" Brown said in remarks directed toward the president.Trump's argument, that extensive logging and a change in California's water practices could alleviate its fire problems, is regularly touted by Republicans who support logging industry groups out West. Those lawmakers include California GOP Reps. Kevin McCarthyKevin Owen McCarthyHillicon Valley: Russian-linked hackers may have impersonated US officials | Trump signs DHS cyber bill | Prosecutors inadvertently reveal charges against Assange | Accenture workers protest border enforcement work | App mines crypto for bail bonds McCarthy, other Republicans back Ratcliffe to be next attorney general Democrat Katie Porter unseats GOP's Mimi Walters MORE and Devin NunesDevin Gerald NunesHeads up, GOP: Elections have consequences Overnight Energy: Trump, California leaders clash over fires | Trump says oil prices should be 'much lower' | Zinke criticizes media coverage | Officials consider new truck pollution rule Trump, California battle over climate and cause of fires MORE, who have long fought for more water access in their districts in California's Central Valley.\"There is no reason for these massive, deadly and costly forest fires in California except that forest management is so poor,\" Trump tweeted late Friday, threatening to withhold federal funds even as firefighters in the state grappled with the blazes.\"Billions of dollars are given each year, with so many lives lost, all because of gross mismanagement of the forests. Remedy now, or no more Fed payments!\" Trump tweeted.California lawmakers and fire experts quickly denounced Trump's comments as partisan posturing.\"Lives have been lost. Entire towns have been burned to the ground. Cars abandoned on the side of the road. People are being forced to flee their homes. This is not a time for partisanship. This is a time for coordinating relief and response and lifting those in need up,\" California Gov.-elect Gavin Newsom (D) tweeted.Others pointed out that many of the fires scorching the state are not in fact burning in forests at all, but on hillsides near city centers and coastlines. Appropriations coming?: Despite Trump's threat to cut off federal funding to California over its forest management, Congress might appropriate some extra money to the wildfire effort.Congress is facing a Dec. 7 deadline to pass legislation to fund most of the government, and lawmakers could attach special disaster funding to that bill.A spokesman for Rep. Nita LoweyNita  Sue LoweyDem women rally behind Pelosi Lawmakers say California will eventually get emergency funding for fire relief On The Money: Amazon taps New York, Northern Virginia for new offices | What it means for the DC area | Dems target vulnerable commerce chief | Earmarks look to be making a comeback MORE (N.Y.), the top Democrat on the House Appropriations Committee and its likely chairman when the party takes over in January, said Democrats will insist on money for the wildfires and other recent natural disasters.\"Congress must build upon the down payment agreed in September by swiftly passing an emergency supplemental appropriations bill in the lame duck session that will assist the communities affected by Hurricane Florence, Hurricane Michael, Typhoon Yutu, and the wildfires burning throughout the West,\" the spokesman said.Blair Taylor, a spokesman for Senate Appropriations Committee Chairman Richard ShelbyRichard Craig ShelbyKellyanne Conway: Trump could shut down government for wall funding On The Money: Senior GOP senator warns Trump against shutdown | Treasury sanctions 17 Saudis over Khashoggi killing | HQ2 deal brings new scrutiny on Amazon | Senate confirms Bowman to Fed board Senior GOP senator warns Trump against partial shutdown MORE (R-Ala.), left the door open for disaster funding for the wildfires, saying the panel's priority is the Dec. 7 funding deadline.\"As we set about that work, we will keep a close eye on this and other areas with a disaster declaration and remain in close contact with those states and the administration regarding need,\" he said.Read more on the wildfires here. Happy Monday! Welcome to Overnight Energy, The Hill's roundup of the latest energy and environment news.Please send tips and comments to Timothy Cama, tcama@thehill.com, and Miranda Green, mgreen@thehill.com. Follow us on Twitter: @Timothy_Cama, @mirandacgreen, @thehill.CLICK HERE to subscribe to our newsletter. TRUMP SLAMS OPEC OVER OIL PRICES: Trump on Monday said he hopes Saudi Arabia and OPEC don't cut oil production hours after the Saudi energy minister indicated the country would reduce its output next month.\"Hopefully, Saudi Arabia and OPEC will not be cutting oil production. Oil prices should be much lower based on supply!\" Trump tweeted Monday afternoon.The president, who has no public events scheduled for Monday, commented on oil prices the same day Saudi Arabia said it would cut its oil output by 500,000 barrels per day in December.CNN reported that Saudi Energy Minister Khalid Al Falih said members of OPEC could further reduce supply next year to balance the market. The organization could reach a decision at its Dec. 6 meeting in Vienna.\"The consensus among all members is that we need to do whatever it takes to balance the market,\" Al Falih said, according to CNN. \"If that means trimming supply by a million [barrels per day], we will do it.\"Read more. ZINKE CALLS REPORTING ON HIS SCANDALS 'B.S.': Interior Secretary Ryan ZinkeRyan Keith ZinkeLawmakers say California will eventually get emergency funding for fire relief Mulvaney positioning himself to be Commerce Secretary: report Overnight Energy: Trump to visit California wildfire victims | Head of Park Service climate program resigns | Dems rip Trump pick for energy panel MORE took to a conservative talk show to slam reporting on his ethics scandals as \"B.S.\"Speaking Friday on \"Montana Talks,\" Zinke took particular issue with Politico's recent report that he is looking for jobs outside of the Trump administration. But he used that story to criticize mainstream media writ large for its reporting on allegations of coziness with officials in industries he regulates, among other issues.\"They're very angry, and truth doesn't matter to these people anymore,\" Zinke said of mainstream journalists, saying that President Trump \"nearly [got] assaulted\" by CNN's Jim Acosta.\"You know what, I do my job, I disregard the B.S.,\" Zinke said of the Politico story in a fiery interview in which he repeatedly blamed the left and liberals in the media for his scandals.\"You know, it comes from the same liberal reporters that have lost their ability to tell the truth,\" he continued. \"Here's one for you: I think I'm going to probably be the commander of Space Command,\" he joked.Read more. TRUMP OFFICIALS CONSIDER NEW TRUCK POLLUTION RULE: The Trump administration is planning to formally consider major new restrictions on a key pollutant produced by heavy-duty diesel trucks.The Environmental Protection Agency (EPA) is due to kick off the consideration process this week for a regulation that would further restrict allowable nitrogen oxides (NOx) emissions from big trucks, two sources familiar with the initiative said. Reuters first reported the plans Monday.The rule would be a rare move by the Trump administration to consider a stringent new regulation. In contrast, the EPA under President Trump has taken dozens of actions intended to roll back or eliminate regulations.Read more. ON TAP TUESDAY:Undersecretary of Energy Mark Menezes will speak at an Atlantic Council event on the landscape for United States liquefied natural gas (LNG).The House Rules Committee will meet to set rules for the House's debate of the Manage our Wolves Act, which would remove Endangered Species Act protections from the gray wolf. OUTSIDE THE BELTWAY:A former employee at Wisconsin's environmental agency says she was pressured to approve a golf course on sensitive wetlands, Wisconsin Public Radio reports.Utah state lawmakers want to commission a study to determine the value of federal lands in Utah, in order to send a bill to the federal government, the Deseret News reports.Protesters in the United Kingdom glued their hands to the building housing the government's energy agency, the Guardian reports. IN CASE YOU MISSED IT:Check out stories from Monday and the weekend ...- Trump, California battle over climate and cause of fires- Trump: Oil prices should be much lower- Zinke slams reporting on his scandals- Trump: 'Proper forest management' can stop 'devastation' in CaliforniaView the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}