{"id": "Lawmakers, forecasters: Election Day up for grabs", "paragraph": "Lawmakers, party leaders and election prognosticators cautioned Sunday that control of Congress is far from settled heading into Election Day on Tuesday, as Democrats and Republicans sought to make a final pitch to voters.Early voting numbers are skyrocketing around the country, with Republican votes slightly edging out Democratic ones as of Wednesday, according to NBC. But a pair of polls released Sunday morning showed Democrats with a 7- and 8-point lead on generic ballots. Changing projections, high voter enthusiasm, and not-too-distant memories of President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE defying polls that showed him trailing late in the 2016 presidential election have party officials and lawmakers urging supporters not to take anything for granted when they weigh how to vote this year.“No one should be surprised if [Democrats] only win 19 seats. And no one should be surprised if they win 51 seats,” Nate Silver, election forecaster and founder of FiveThirtyEight, said on ABC’s “This Week.”“Those are both extremely possible based on how accurate polls are in the real world,” he added.Generic congressional ballot polling has for months given Democrats a sizable edge, leading to predictions of a \"blue wave\" that the party would ride to control of the House. Democrats must flip 23 seats currently held by Republicans in order to secure a simple majority.But generic ballot surveys, including those released Sunday, are showing Republicans closing the margins on congressional balloting compared to last month. Improving numbers, coupled with favorable polls in individual Senate races, have burnished GOP hopes to retain a slim majority in the House and add to their majority in the Senate.But party leaders are warning voters that nothing is guaranteed in order to keep voter turnout high on election day.Calling the election \"tight,\" Republican National Committee Chairwoman Ronna Romney McDaniel on Sunday told ABC that \"Election Day voting is going to determine the balance of the House.\"A CBS News tracker poll released Sunday laid out three potential scenarios for this week's elections. The most likely scenario, the poll found, is that Democrats end up with 225 seats, slightly more than the 218 needed to secure the majority in the House.That poll has a 13-seat margin of error, however, leaving open the possibility that Republicans could retain a narrow majority if voter turnout breaks their way, said Anthony Salvanto, CBS News's elections & surveys director. The poll's second most likely scenario sees Republicans minimize their losses in suburban districts, and winning 220 seats to maintain a two-seat majority.“Democrat enthusiasm is definitely there,” McDaniel said on ABC. “We are seeing that in the early voting, in all of these key House and Senate races and Republicans have been matching.\"McDaniel pushed back on the notion that Republicans are resigned to losing control of the House, despite Trump acknowledging it \"could happen\" during a campaign rally late last week. She cited a strong jobs report released Friday and the state of the economy as strong closing argument for the party. Showing more confidence in the upper chamber, one top Senate Republican on Sunday pressed the party's advantage there, while Democrats weren't quite willing to concede defeat.“We're not only going to hold a majority, I think we're going to add to it,” Sen. Thom TillisThomas (Thom) Roland TillisExpert says Senate will be up for grabs in 2020 The Hill's 12:30 Report — Sponsored by Delta Air Lines — White House to 'temporarily reinstate' Acosta's press pass after judge issues order | Graham to take over Judiciary panel | Hand recount for Florida Senate race McConnell, Flake clash over protecting Mueller probe MORE (R-N.C.), the vice chairman of the National Republican Senatorial Committee, said of the upper chamber on \"Fox News Sunday.\"Tillis highlighted North Dakota, Indiana and Missouri as states where he’s optimistic the GOP can topple Democratic Senate incumbents.Those are three of 10 races where Democratic senators are running in states that Trump won in 2016. Democrats have 26 senators up for reelection total, compared to nine GOP senators.The GOP has hammered the economy as its closing argument in most races, warning that a Democratic victory could undo progress made in the last two years under a Republican Congress.Democratic National Committee Chairman Tom PerezThomas Edward PerezClinton’s top five vice presidential picks Government social programs: Triumph of hope over evidence Labor’s 'wasteful spending and mismanagement” at Workers’ Comp MORE sought to cast economic gains under the Trump administration as overblown during an appearance on CNN's \"State of the Union.\" Instead, he attempted to shift the focus to health care, which has emerged as the centerpiece of Democrats' closing argument to voters.\"We're focused like a laser on the issues that matter most to people: good jobs that pay a fair wage, health care, and making sure that we have checks and balances in Washington, because this America, in which we have a president who's constantly divisive, that's not the America that my children want,\" he said.Sen. Mark WarnerMark Robert WarnerFacebook reeling after damning NYT report On The Money: Trump, Senate leaders to huddle on border wall funding | Fed bank regulator walks tightrope on Dodd-Frank | Koch-backed groups blast incentives for corporations after Amazon deal Schumer told Warner to back off of Facebook: report MORE (D-Va.), who is not up for reelection this year, delivered a similar closing message on CBS's \"Face the Nation.\" The senator dismissed economic gains under Trump as a \"sugar high\" from the GOP tax-cut bill passed in December 2017.While he conceded the economy is in good shape, which has been the GOP's closing argument, Warner argued that voters are more concerned about electing lawmakers who will serve as a check on the president.\"We got a president in Donald Trump that is totally unchecked at this point,\" Warner said. \"And rule of law and frankly America's standing in the world is being undermined.\" Sen. Chris Van HollenChristopher (Chris) Van HollenCortez Masto named Dem Senate campaign chairwoman Election Countdown: Hyde-Smith's 'public hanging' joke shakes up Mississippi runoff | New lawsuits in Florida | Trump wants Florida election official fired | Mia Love sues to stop Utah vote count | Republican MacArthur loses NJ House race Cortez Masto poised to become DSCC chair MORE (D-Md.), conceded that his party faces \"the toughest political map\" in 60 years if it is to retake control of the Senate. He maintained that Democrats still hold a \"very narrow path\" to pick up the two seats needed to do so, citing opportunities to win races in Arizona, Nevada, Tennessee and Texas.\"We’re prepared for whatever result we have,\" Van Hollen said on ABC. \"But let me just say that the fact that we still have a narrow path to a majority is a sea change from where we were 18 months ago.\"As Trump departed the White House on Sunday afternoon for rallies for Georgia gubernatorial candidate Brian Kemp (R) and Tennessee Senate candidate Rep. Marsha BlackburnMarsha BlackburnTennessee New Members 2019 McConnell reelected as leader, Thune promoted to whip Rick Scott appears with GOP senators, ignores voter fraud question as recount continues  MORE (R), he almost exclusively touted his efforts to boost GOP Senate candidates.The president expressed optimism about Republicans' chances on Tuesday, comparing enthusiasm among voters to that of his 2016 victory. \"I think we’re going to do well in the House, but as you know, my primary focus has been on the Senate and I think we’re going to do really well in the Senate,\" Trump said.\"There is something going on out there,\" he added. \"The level of fervor, the level of fever is very strong on the Republican side.\" View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}