{"id": "Overnight Health Care — Presented by Purdue Pharma — Idaho's GOP governor backs Medicaid expansion | ObamaCare enrollment unlikely to increase next year | Pfizer chief expects return to 'business as normal' on drug prices", "paragraph": "Welcome to Tuesday's Overnight Health Care.ObamaCare open enrollment is two days away. The midterm elections are seven days away.Today, Idaho's GOP governor made a key endorsement over his state's Medicaid expansion ballot measure, and Pfizer's CEO said the company will resume letting the market set their drug prices. We'll start in Idaho: Idaho's GOP governor endorses Medicaid expansionIdaho's Republican Gov. Butch Otter on Tuesday endorsed a ballot initiative that would expand Medicaid eligibility to thousands of people.\"Proposition 2 is an Idaho-grown solution,\" Otter said in a newly released ad by Idahoans for Healthcare, a group pushing for Medicaid expansion. \"Vote yes on Proposition 2. It's the right thing for Idaho.\"Idaho is one of three red states where Medicaid expansion is on the ballot next week. If voters approve the measure, supporters say it would provide coverage for up to 62,000 Idahoans who now fall into a coverage gap, making too much to qualify for Medicaid, but not enough to qualify for subsidized health insurance through the state insurance exchange.Political implications: The three-term governor endorsing the measure just a week before the election could give it a boost across the finish line. Otter is also not running for re-election. Idaho Lt. Governor Brad Little (R), who is running for governor, said he doesn't think expansion is the right way to care for people in the coverage gap, but will implement the measure if it passes.Read more here. SPONSORED CONTENT - PURDUE PHARMA  We make prescription opioids. And we want to limit their use. For over 25 years, we've developed opioid medications for patients with chronic pain, and we are acutely aware of the public health risks they can create, even when taken as prescribed. As such, we believe the country needs a new approach to prescribing opioids. Learn more.  Speaking of Medicaid expansion, a new analysis says 2.5 million people could gain coverage if Democrats win in six key states.Nearly 2.5 million people could gain access to Medicaid coverage if Democrats win gubernatorial elections in six states next Tuesday and expand the program to cover more low-income adults, according to a new analysis released Tuesday. If Republicans lose competitive gubernatorial races in Florida, Georgia, Kansas, South Dakota, Maine and Wisconsin next Tuesday, it would present Democrats with the rare opportunity to expand Medicaid in those states to 2.4 million people, according to the analysis by Avalere health, a consulting firm in Washington.Why it matters: 18 states, including the six mentioned above, have resisted ObamaCare's Medicaid expansion. But the tides could turn if Democrats win some of these competitive races.Expansion has become a hot issue in states where it hasn't been done. Both Stacey Abrams and Andrew Gillum, who are running for governor in Georgia and Florida, respectively, have campaigned on bringing Medicaid expansion to their states if they win.Read more here. Pfizer CEO: 'Business as normal' on drug prices next year despite Trump pressureRemember in July when President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE touted Pfizer holding off on price hikes? Well, now Pfizer says it will be back to \"business as normal\" next year.Pfizer CEO Ian Readnoted on an earnings call Tuesday that the agreement to hold off on price increases would end at the end of the year, at which point the company will return to pricing based on the market. \"We price to the marketplace, we price competitively,\" Read said.In July, Pfizer announced that it was holding off on planned price increases following a conversation between Read and Trump.\"Pfizer is rolling back price hikes, so American patients don't pay more,\" Trump tweeted at the time. \"We applaud Pfizer for this decision and hope other companies do the same. Great news for the American people!\"Pfizer, though, affirmed on Tuesday that the price increases could return in January, given that the agreement only lasted until then.Political context: Trump has been touting his efforts to lower drug prices ahead of the elections. But he's not only relying on voluntary action. His administration moved to cut some Medicare drug costs last week as well by tying prices to lower costs in other countries.Read more here. Democrats urge Trump, attorneys general to drop ObamaCare lawsuitA week out from the midterms, Democrats are showing they haven't lost sight of health care as a major campaign issue, and keep pressing Republicans about pre-existing conditions.Led by Rep. Don Beyer (D-Va.), 45 House Democrats wrote to President Trump, as well as the 18 state attorneys general and two governors leading a lawsuit that seeks to overturn ObamaCare and its pre-existing condition protections.\"Until President Trump stops his efforts to undermine protections for pre-existing conditions, he is functionally lying to the American people,\" Beyer said.From the letter to Trump: According to Beyer and the Democrats, the words of support from Trump and congressional leaders \"do not match the actions of your administration. Your Department of Justice has not only refused to intervene in a lawsuit brought by state attorneys general that would nullify preexisting conditions protections if successful, but also argued in a brief that guaranteeing coverage to people with health conditions and charging them the same rates should be struck down.\"From the letter to state AGs: \"Given that national Republican leadership is claiming to defend pre-existing conditions protections, we expect you will immediately drop your lawsuit.\"State of play: A federal judge in Texas heard arguments in September, and promised he would rule quickly. But speculation is now that he will wait until after the elections, to blunt any political impact from his ruling if he chooses to side with the plaintiffs. ObamaCare enrollment unlikely to increase next yearEnrollment in ObamaCare plans is unlikely to increase next year as the Trump administration provides an escape hatch for people who say they have been priced out of coverage.The repeal of the penalty for not having insurance and the administration's expansion of cheaper, slimmed-down plans that don't meet ObamaCare's requirements could cause more people to leave the exchanges when the sign-up period starts Thursday, according to health experts. The administration will also fund fewer local groups this year that help people enroll.\"I think an increase in enrollment is probably unlikely, given both the policy changes that have been put in place and the operational changes like the cuts in funding,\" said Sabrina Corlette, a research professor at the Center on Health Insurance Reforms at Georgetown University's Health Policy Institute. \"But time will tell.\"Read more here. What we're readingDemocrats hype estimates of people with preexisting conditions (Washington Post)For the disabled, a doctor's visit can be literally an obstacle course -- and the laws can't help (Kaiser Health News)Pharma's 'come-to-Jesus moment': The industry braces for a Pelosi speakership and Democrats' drug pricing agenda (Stat)Pharma's support of Trump's drug pricing plan is fraying heading into midterms (CNBC) State by stateGov. Murphy says New Jersey leading fight for ObamaCare with new website to promote enrollment (NJ.com) Fact-checking Martha McSallyMartha Elizabeth McSallyArizona New Members 2019 House GOP returns to Washington after sobering midterm losses Overnight Defense — Presented by Raytheon — First lady's office pushes for ouster of national security aide | Trump taps retired general as ambassador to Saudis | Mattis to visit border troops | Record number of female veterans to serve in Congress MORE on pre-existing conditions in Arizona race (Politifact)Healthy Choices (Governing)Spending against dialysis ballot measure In California breaks record (California Healthline) From The Hill's opinion pageCall to end vaping: include e-cigarettes in Great American Smokeout View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}