{"id": "Calif. congresswoman-elect bumps into Pelosi at airport", "paragraph": "California congresswoman-elect Katie Hill (D) tweeted Saturday that she ran into House Minority Leader Nancy PelosiNancy Patricia D'Alesandro PelosiDem women rally behind Pelosi How this year’s freshmen can save the Congress — and themselves Single-payer health care is better than ObamaCare  MORE (D-Calif.) at the airport shortly after Hill became one of two incoming California freshmen to express support for Pelosi's bid for Speaker.In a tweet Saturday afternoon, Hill lamented her casual appearance upon meeting the House Democratic leader, which she said was the result of deplaning while \"totally exhausted\" at San Francisco International Airport.\"I just ran into @NancyPelosi while looking like this, totally exhausted, deplaning at SFO for my layover,\" Hill wrote. \"Sometimes you just have to laugh and trust the process — I respect the women who paved the way for me more every day.\"\"Leader Pelosi looked flawless, by the way,\" she added.I just ran into @NancyPelosi while looking like this, totally exhausted, deplaning at SFO for my layover. Sometimes you just have to laugh and trust the process — I respect the women who paved the way for me more every day. (Leader Pelosi looked flawless, by the way.) pic.twitter.com/tHPm4HdquqHill and fellow California Rep.-elect Mike Levin (D) wrote a letter in support of Pelosi's bid to succeed Speaker Paul RyanPaul  Davis RyanHow this year’s freshmen can save the Congress — and themselves Democrat Katie Porter unseats GOP's Mimi Walters Amazon fleeced New York, Virginia with HQ2 picks MORE (R-Wis.) on Thursday, touting Pelosi as \"bold, pragmatic and capable of swift results\" in a letter to colleagues.\"During this turbulent time in our nation's history, no one is better prepared to lead a diverse Democratic Caucus,\" the two wrote. \"We need her stability, vision and strength. Let's unite. Let's move forward. Let's make change happen, together.\"Hill unseated incumbent Rep. Steve KnightStephen (Steve) Thomas KnightCalif. congresswoman-elect bumps into Pelosi at airport Democratic gains erasing House GOP in California California New Members 2019 MORE (R-Calif.) last week in a major pickup for California Democrats as Knight conceded to the first-time candidate before Hill's victory had even officially been called.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}