{"id": "Hillicon Valley: Gab faces crackdown over hate speech | Chinese intel officers charged in US hacks | States step up on cyber ahead of midterms | Twitter highlights fake facts on midterm page | Chamber warns against tax on tech", "paragraph": "Welcome to Hillicon Valley, The Hill's newsletter detailing all you need to know about the tech and cyber news from Capitol Hill to Silicon Valley.Welcome! Follow the cyber team, Olivia Beavers (@olivia_beavers) and Jacqueline Thomsen (@jacq_thomsen), and the tech team, Harper Neidig (@hneidig) and Ali Breland (@alibreland). And CLICK HERE to subscribe to our newsletter. GAB HIGHLIGHTS TECH'S TROUBLE WITH HATE SPEECH: Gab, a social media haven for far right groups, is facing a crackdown after the alleged shooter who killed eleven people in a Pittsburgh synagogue used the platform to share his views.Robert Bowers, 46, had posted hateful messages, including that \"jews are the children of satan.\" In his final post before the shooting, Bowers wrote \"I can't sit by and watch my people get slaughtered. Screw your optics, I'm going in.\"Bowers was charged Monday with 29 felony counts, including 11 counts for using a firearm to commit murder.Gab has defended itself as \"the home of free speech online,\" and says it bears no responsibility for the shooting at Tree of Life Synagogue on Saturday.The company did not delete any of Bowers's previous racist or violent posts per its free speech policy, which does not moderate most content. That stance has led to neo-Nazis and white supremacists flocking to the site after being barred from other social media platforms and earned Gab criticism from anti-hate groups.The shooting in Pittsburgh is bringing new scrutiny on the platform and has already led a number of tech service providers to finally cut ties with Gab.GoDaddy, which hosted its domain, and PayPal, both ended service to the social media company on Monday.The company is looking for an alternative hosting platform to get back online but is currently down.The crackdown on Gab parallels the social media fallout after the Unite the Right rally, which brought white nationalists to Charlottesville, Va. in 2017.Read more here. WE PROMISED YOU MORE ON CHINA: The Justice Department on Tuesday unsealed charges against a group of Chinese intelligence officers, alleging that they hacked into a series of private companies' computer systems in the U.S. and abroad as part of an effort to steal sensitive commercial aviation data.Zha Rong, Chai Meng and seven other co-conspirators worked to steal intellectual property and other sensitive data from over a dozen companies so that China could develop a turbofan engine \"without incurring substantial research and development expenses,\" according to the indictment.\"Members of the conspiracy targeted, among other things, companies in the aerospace and other high-technology industries, and attempted to steal intellectual property and confidential business information, including information that was commercial in nature,\" reads the indictment that was filed last week but unsealed on Tuesday.Read more here. MAKE AMERICA HACKED AGAIN: The hacking group behind the costly cyberattack that shut down many of the city of Atlanta's computer systems earlier this year is primarily targeting U.S.-based organizations, according to a new report.Cybersecurity firm Symantec on Tuesday said the SamSam hacking group, which specializes in ransomware attacks, has gone after at least 67 different targets this year, mostly located in the U.S.\"Of the 67 organizations targeted during 2018, 56 were located in the U.S. A small number of attacks were logged in Portugal, France, Australia, Ireland, and Israel,\" according to a Symantec blog post, which called the group \"highly active.\"Researchers found that SamSam is going after a range of sectors -- but healthcare organizations appeared to be the most common target.\"SamSam targeted organizations in a wide range of sectors, but healthcare was by far the most affected sector, accounting for 24 percent of attacks in 2018,\" the blog post reads. Read more here. BETTER, BUT STILL NOT GREAT: States have stepped up their cybersecurity protections ahead of the Nov. 6 midterms, but are still lacking in some areas, according to a report released Tuesday by cyber experts.The Center for Strategic and International Studies (CSIS) found that 40 states have invested more than $75 million in improving election security since the 2016 elections.Seventeen states are running security tests and adopting upgrades to improve their cybersecurity ahead of next month's elections, according to the CSIS report.Still, the group's scorecard said the average grade for state election cybersecurity is a C-, and that states with toss-up Senate elections next month average an F for their security measures. Read about it here. MIDTERM MISINFO ON TWITTER: Twitter's new events page for the coming midterm elections are highlighting false information.The new tool aggregates tweets about politics and the midterm elections, organized in two tabs \"Top Commentary\" and \"Latest\" tweets on the matter.The events page shows many verified accounts tweeting accurate information, as well as unverified accounts. But in some cases the tool is elevating tweets peddling incorrect information.Conservative internet personality Bill Mitchell falsely claims in a tweet which made Twitter's tool that \"Democrats paid for the Honduran Caravan\" and incorrectly characterizes it as a \"marauding band of fighting age men.\"Read more here. THE THREAT OF FAST, CHEAP INTERNET: A Republican Federal Communications Commission Commissioner called publicly provided broadband a \"threat\" to the First Amendment, referring to the threat of censorship.\"I would be remiss if my address omitted a discussion of a lesser-known, but particularly ominous, threat to the First Amendment in the age of the Internet: state-owned and operated broadband networks,\" FCC Commissioner Mike O'Rielly said during a speech he gave last Wednesday, but that was not reported on until this week by Motherboard.O'Rielly claimed that \"municipalities such as Chattanooga, Tennessee, and Wilson, N.C., have been notorious for their use of speech codes in the terms of service of state-owned networks, prohibiting users from transmitting content that falls into amorphous categories like 'hateful' or 'threatening,'\" citing research by Professor Enrique Armijo of the Elon University School of Law. Read more here. FIGHTING FAKE COMMENTS: A trio of Democratic senators is pressing the Federal Communications Commission's (FCC) inspector general to investigate the millions of fake comments filed during the net neutrality debate.In a letter addressed to FCC Inspector General David Hunt, Sens. Richard Blumenthal (D-Conn.), Brian SchatzBrian Emanuel SchatzOn The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report Hillicon Valley: Facebook reeling after NYT report | Dems want DOJ probe | HQ2 brings new scrutiny on Amazon | Judge upholds Russian troll farm indictments | Cyber moonshot panel unveils recommendations Facebook reeling after damning NYT report MORE (D-Hawaii) and Ed MarkeyEdward (Ed) John MarkeyHillicon Valley: Russian-linked hackers may have impersonated US officials | Trump signs DHS cyber bill | Prosecutors inadvertently reveal charges against Assange | Accenture workers protest border enforcement work | App mines crypto for bail bonds Senators push bipartisan bill to crack down on robocalls Warren, 2020 Dems target private immigration detention center operators MORE (D-Mass.) urged him to investigate fraud in the FCC public comment process.The three lawmakers expressed \"concern that the Commission has failed to address fraudulent comments and has not cooperated with other investigations.\"\"Despite concerns that the rule-making process was subverted by fraudulent comments and manipulated by special interests, including possible Russian interference, the FCC has seemingly ignored the issue, failed to provide answers to Congress, and dismissed public concerns,\" the senators wrote.This is the latest action in a long running fight: The fight over fake comments has been a huge portion of the larger fight for net neutrality.Broadband companies who oppose net neutrality rules have complained that the fake comments undermine the legitimacy of the process.Net neutrality proponents have complained that disregarding the process obscures the voices of Americans who can't take meetings with FCC commissioners in the way powerful telecom lobbyists can.The FCC said in August that former chief information officer David Bray misled the agency and the public about the comments system being hacked, compounding the controversy.Read more here.  EVERYBODY'S WORKING FOR THE CYBER: DHS's top cybersecurity official Jeanette Manfra said Tuesday that she believes the U.S. needs something similar to a civil defense corps to address the labor gap in cybersecurity.Manfra, speaking at an event hosted by the Carnegie Endowment for Peace, said the concept of such a corps could help fill the open jobs in the field. New America proposed the concept in a report last week.She said the department could create an \"alumni-type network\" where it would offer to continue the training of former government staffers, or create a reserve like that for the National Guard.But Manfra hedged the possibility of any of her proposals becoming reality, saying they were just \"concepts\" and that talks in the department are in the \"early stages.\" BLAME IT ON CHINA AND/OR RUSSIA: About half of all cyberattacks are coming from Russia or China, according to a new report released Tuesday.Cybersecurity firm Carbon Black said that out of the 113 incidents researched by it and its partners, 47 were tied to those two nations. North Korea, Iran and Brazil were the source for a significant percentage of the other attacks.The report also found that about two-thirds of incident response professionals surveyed believe that cyberattacks will impact next month's midterm elections.\"More and more, state actors are using compromised infrastructures sold on the dark web as command and control outposts,\" one incident response professional said in the report. \"Since these infrastructures are the site of a variety of other commodity activities, investigators will often block those actions and assume the case is closed. Meanwhile, the state actors remain behind running more covert operations.\" TAXING THE TECH: The U.S. Chamber of Commerce on Tuesday is raising concerns about digital services taxes, after the United Kingdom on Monday announced plans to move forward with such a tax on large technology companies.\"The American business community supports international dialogue on ways to modernize the international taxation system to adapt to changes in the global economy,\" Chamber President and CEO Tom Donohue wrote in a letter to Treasury Secretary Steven MnuchinSteven Terner MnuchinOvernight Defense — Presented by Raytheon — Border deployment 'peaked' at 5,800 troops | Trump sanctions 17 Saudis over Khashoggi killing | Senators offer bill to press Trump on Saudis | Paul effort to block Bahrain arms sale fails On The Money: Senior GOP senator warns Trump against shutdown | Treasury sanctions 17 Saudis over Khashoggi killing | HQ2 deal brings new scrutiny on Amazon | Senate confirms Bowman to Fed board The Hill's 12:30 Report — Sponsored by Delta Air Lines — Trump sanctions 17 Saudis over Khashoggi killing | Insurgents seek female challenger to Pelosi for Speakership | Broward County finishes machine recount MORE. \"However, unilateral European actions will erode trust and lessen the prospects for international agreement; indeed, we now see governments outside of Europe considering similar actions.\"The U.K. announced plans on Monday for large internet companies to pay a tax starting in 2020 of 2 percent of revenues from users in the country. A number of other countries have also been looking at imposing a digital services tax, due to frustrations that internet companies are largely untaxed in their jurisdictions.Read more here. MY NAME IS CHUCK SCHUMER AND I'D LIKE TO BUY AN AD: Facebook's attempts to create transparency and stop the flow of misinformation in political ads on its platform are easy to manipulate, a new investigation shows.The company recently introduced a feature that shows who purchased an ad on its platform by showing \"paid for\" ahead of the name of the person or organization that bought the political ad on the advertisement. But purchasers can easily manipulate the information shown, a Vice News investigation found.The news outlet purchased 100 ads and attributed their payment to U.S. senators, which Facebook's systems reportedly approved without any pushback.Lawmaker's reaction: \"If Facebook is going to claim to verify who's paying for political ads, they need to actually do the work,\" Sen. Ron WydenRonald (Ron) Lee WydenHillicon Valley: Russian-linked hackers may have impersonated US officials | Trump signs DHS cyber bill | Prosecutors inadvertently reveal charges against Assange | Accenture workers protest border enforcement work | App mines crypto for bail bonds Dems demand answers from AT&T, Verizon and Sprint on internet throttling claims Warren, 2020 Dems target private immigration detention center operators MORE (D-Ore.) said in a statement to Vice News. \"Clearly it needs to do far more to combat fraudulent and false content, both in paid advertisements and viral posts.\"Read more here. ON TAP: Fifth Domain is hosting its CyberCon on Thursday. AN OP-ED TO CHEW ON: Protecting consumers from Big Tech's privacy predations A LIGHTER CLICK: What kind of hair tho. NOTABLE LINKS FROM AROUND THE WEB:Silicon Valley is creating new services that could change how people talk about their bodies (The Atlantic)Elon Musk: 'I'm now the Nothing of Tesla' (The Hill)Where trolls reigned free: A new history of Reddit. (The New York Times)A new study finds potentially manipulative ads in apps for preschoolers (The Washington Post)View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}