{"id": "Police officer punches pinned-down 14-year-old girl during arrest in video", "paragraph": "A police officer in Coral Springs, Fla., is being criticized after a video emerged showing him repeatedly punching a 14-year-old girl during an arrest.A video shared to Instagram earlier this week captures the police officer punching the teenage girl several times while she remains pinned to the ground with the help of another officer during an arrest.The Coral Springs Police Department told a local CBS affiliate its officers were initially called to the Coral Square Mall on Thursday following a complaint that teens were harassing patrons. Police told the local station they banned the group of teens from the mall at the request of its security team but they reportedly returned.Police allege after they arrested one of the teens, the girl in the video began to \"incite\" the others. \"Officers attempted to take her into custody, at which time she began to fight and resist arrest. Due to her stature and aggressive behavior, officers took her to the ground attempting to get her to release her fists,\" police said in a statement obtained by the station.But Jessica Dennis, the mother of the teenage girl, told the station she felt the officer’s actions were \"completely overboard.\"\"Her hands are pinned up, he's fish tailing her whole body with her shorts. It was just too much going on and she clearly wasn't aggressive,\" she said at a recent news conference, according to the station.An attorney representing Dennis’s family said in a statement to the local station that “to say that the police officer was justified to punch her continuously while he has his knee on her back and her hands under her belly, the video speaks for itself.\" Though the police department is not currently investigating the officer’s actions, that could change if Dennis moves to submit a formal complaint.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}