{"id": "Mattis: Khashoggi killing, support for Saudis in Yemen are 'separate' issues", "paragraph": "Defense Secretary James MattisJames Norman MattisOvernight Defense — Presented by Raytheon — Lawmakers struggle with how to punish Saudi Arabia | Trump regrets not visiting Arlington for Veterans Day | North Korea deports detained American Ousted Bolton aide says it was 'an honor' to serve Trump administration Macron’s 'Euro-army' is an idea whose time has come MORE said Tuesday that he considers U.S. support for Saudi Arabia in Yemen’s civil war to be a separate issue from the ongoing crisis over the killing of journalist Jamal Khashoggi.“The murder of Khashoggi is, I would separate it out from the Yemen situation,” Mattis said at the United States Institute of Peace. “That stands unique, by itself. The president said we want to get to the bottom of it. We will get to the bottom of it.”Mattis’ comment suggests cutting off U.S. support for the Saudi coalition in Yemen is not on the table for potential U.S. responses to Khashoggi’s death.Still, Mattis called for Yemen peace talks within the next 30 days, the first time a U.S. official has publicly issued such a timeline.“The longer term solution, and by longer term I mean 30 days from now, we want to see everybody around a peace table, based on a ceasefire, based on a pullback from the border and then based on ceasing dropping of bombs that will permit the [U.N.] special envoy Martin Griffiths — he’s very good, he knows what he’s doing — to get them together in Sweden and end this war,” Mattis said.Khashoggi, a Virginia resident and Washington Post columnist critical of the Saudi government, was killed Oct. 2 when he went into the Saudi consulate in Istanbul to get paperwork for his marriage to his Turkish fiancée.After first claiming that Khashoggi left the consulate alive, the Saudis admitted he was killed inside the consulate. The Saudis’ Oct. 19 explanation was that Khashoggi was unintentionally killed during a physical altercation that resulted from an unapproved operation to return him to Saudi Arabia.Last week, though, Saudi Arabia’s top prosecutor changed their story again, saying the killing was premeditated.Turkish officials have said that Khashoggi was tortured, killed and dismembered by a 15-person Saudi hit squad that included a forensic doctor wielding a bone saw.CIA Director Gina Haspel traveled to Turkey last week to review its evidence and has briefed Trump. The White House said Monday that Trump is weighing his response.On Tuesday, Mattis said that Turkey “has so far provided evidence for every allegation that they have made about what happened.”U.S. lawmakers have called for harsh penalties against the Saudis over the killing. Potential responses that have been floated include sanctions, halting arms sales and cutting off support for Saudi Arabia in Yemen.The Trump administration has made support for the Saudi-led campaign in Yemen’s civil war critical to its counter-Iran strategy. Iran supports the Houthi rebels the Saudi coalition is fighting against.Lawmakers were increasingly concerned about Saudi conduct in Yemen even before Khashoggi’s death, citing mounting civilian casualties blamed on the Saudis.In his comments Tuesday, Mattis said the United States has been training the Saudis “for months” on better targeting.“War … is basically one tragedy piled on another. Welcome to war,” Mattis said. “But our goal right now is to achieve a level of capability by those forces fighting against the Houthis that they are not killing innocent people.”View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}