{"id": "Incoming congresswoman questions whether she is allowed to still sell Girl Scout cookies ", "paragraph": "Rep.-elect Abigail Spanberger (D) questioned whether she will still be allowed to sell Girl Scout cookies as one of her daughter’s troop leaders after she becomes the representative for Virginia’s 7th Congressional District.USA Today reported Saturday that the House Ethics Committee has never publicly addressed whether the sale of Girl Scout cookies is a conflict of interest. “Can I go in the neighborhood and sell Girl Scout cookies or are people going to feel compelled because I’m now their representative in Congress? Do you know what I mean?” Spanberger asked. “I don’t know what I’m going to do.”An estimated 60 percent of female lawmakers who will serve in the next Congress are Girl Scout alumnae, the outlet noted.Spanberger, who has a history of government employment, said she was allowed to let her coworkers know that her daughter and her troop were selling cookies when the season came around.She is a former U.S. Postal Inspection Service law enforcement officer and undercover Central Intelligence Agency operative,.“If we’re doing booth sales, do I just put a baseball cap on and hope nobody recognizes me?” she asked.Congressional Management Foundation President Bradford Fitch told the outlet that he didn’t see an ethical violation with congress members helping their daughters sell to constituents.The organization advises incoming members during their orientation in Washington.“[Spanberger] doesn’t relinquish her responsibilities as a mom because she’s a member of Congress,” Fitch said. “It’s probably a great way to connect with constituents.”Rep. Debbie Wasserman SchultzDeborah (Debbie) Wasserman SchultzSingle fingerprint, misspellings pointed FBI to mail bombs suspect Piers Morgan: Trump can't ignore stickers on suspect's van, must cool down 'violently aggressive rhetoric' White van identified in connection with mail bombings suspect covered in pro-Trump stickers MORE (D-Fla.) was also a troop co-leader between 2006 and 2012, helping to pull a wagon of cookies door to door.“I certainly didn’t send out any solicitation – there was nothing like that – because that wouldn’t be ethical,” she said.Spanberger, a political newcomer, beat incumbent Rep. Dave Brat (R) during this month’s midterm elections.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}