{"id": "NRA president dropped from GOP rally in city hit by school shooting ", "paragraph": "The Indiana Republican Party has dropped National Rifle Association (NRA) President Oliver North from a rally Sunday in a city that suffered a school shooting last May.\"Oliver North will not be visiting Noblesville today, as it simply would have been the wrong place and wrong time,\" Indiana Republican Party Chairman Kyle Hupfer told The Hill in a statement.A student reportedly shot a classmate and teacher last May in Noblesville West Middle School, miles from the venue for the rally. The Hill was referred by an NRA spokesperson to North's office. The rally will continue without North and will feature Senate candidate Mike Braun (R), Gov. Eric Holcomb and other GOP candidates.Noblesville Mayor John Ditslear (R) had agreed with Hupfer, telling the Indiana Star that the community had not sufficiently healed from the shooting to have a \"pro-gun speech.\"Ditslear noted that he supports the Second Amendment and that he did not know of North's visit in advance. The Indiana Republicans originally said North's appearance was canceled because of a scheduling conflict, before Hupfer issued his statement to the paper, according to the Star.Previously, parents in the group Noblesville Stands Together had pushed back against North appearance, saying it would be in \"poor taste.\"“Honestly, this was insensitive and hurtful,” Nathan Lambert, whose child was at Noblesville West Middle School during the shooting, told the paper.“I’m a Republican and I’d like to know why my State Party thought this was a good idea.” So...@braun4indiana is bringing the President of the NRA to a town where a school shooting happened… Unbelievable… I’m a Republican, and I am disgusted. You’ve lost my vote, Mike. @SenDonnelly @tswarens @DavidMacAnally @SusanWBrooks pic.twitter.com/U2J5BMPO6GUpdated: 9:48 p.m.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}