{"id": "Trump prefers woman for UN post, interviewing 5 candidates", "paragraph": "President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE said he would prefer that the successor to U.S. Ambassador to the United Nations Nikki HaleyNimrata (Nikki) HaleyTrump privately asking aides if Pence is loyal: report Haley honored with 'Woman of Valor' award at Independent Women's Forum gala Ben Shapiro mocks David Hogg over ‘shark attack’ tweet MORE be a woman, and notes that he is still considering several people for the position.The president said to White House pool reporters Saturday afternoon he is interviewing three women and two men to succeed Haley, adding that he would prefer a female candidate take on the role.The comments follow previous remarks from the president asserting that Haley had made the U.N. ambassadorship more sought-after and \"glamorous\" than it had been previously, while not explaining what he meant by the remarks.“I think it’s become maybe a more glamorous position than it was two years ago,” Trump said upon the announcement of Haley's resignation, adding that many people were interested in the post. “Maybe, I wonder why, but it is. She’s made it a very glamorous position.”Haley has taken on a public role as the U.S.'s voice at the United Nations, including a fiery speech earlier this year rebuking U.N. member nations for \"bullying\" the state of Israel.The former South Carolina governor announced her resignation from Trump's foreign policy team earlier this month, while vowing to not stand as a candidate for any office in 2020 in statements that threw cold water on speculation about her future political ambitions.\"No, I am not running in 2020,\" Haley told reporters. “I look forward to supporting the president in the next election.\"Haley was viewed as a mainstream Republican figure in the Trump administration that now must seek to appoint her replacement ahead of the midterms next month and as the Senate still reels from the contentious confirmation of Supreme Court Justice Brett KavanaughBrett Michael KavanaughThe Hill's 12:30 Report — Sponsored by Delta Air Lines — White House to 'temporarily reinstate' Acosta's press pass after judge issues order | Graham to take over Judiciary panel | Hand recount for Florida Senate race Graham set to take over Judiciary Leverage the new US International Development Finance Corporation to compete with China MORE.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}