{"id": "Live coverage: Gillum faces DeSantis in second Florida debate", "paragraph": "DAVIE, Fla. - Democrat Andrew Gillum and Republican Ron DeSantisRonald Dion DeSantisDeSantis transition team zeroes in on possible chief of staff Trump congratulates Kemp, says Abrams will have 'terrific political future' Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority MORE will meet Wednesday night for their second debate in Florida's closely watched gubernatorial race. The two will face each other just days after they clashed in a CNN debate that underscored the intense political divisions at play in Florida.Gillum, the mayor of Tallahassee, and former Rep. DeSantis are locked in a statistical dead heat, according to most polls, with less than two weeks before the election.Follow along with The Hill's live coverage of the debate, due to start at 7 p.m.And that's a wrap8:01 p.m.The debate ends with closing statements after an entertaining hour of sharp barbs, frequent interruptions and a moderator trying to impose order.Thanks for following along.DeSantis says Gillum is \"most hostile\" candidate on gun rights7:58 p.m.DeSantis accused Gillum of being the \"most hostile\" candidate toward Second Amendment rights and suggested that he would engage in \"confiscation\" of firearms if he became governor.\"He will not protect your rights. I’ll stand with law abiding citizens, but public safety is No. 1,\" DeSantis said, responding to a question about how he planned to curb gun violence.Gillum said that he simply wanted to keep weapons out of the hands of dangerous people, adding that parents should be assured that they will pick up their children from school alive. \"When our parents drop our kids off at school, we should have an expectation that we’re able to pick them up alive,\" Gillum said.DeSantis accuses Gillum of seeing a surge of crime in Tallahassee7:52 p.m.DeSantis continues to attack Gillum of being mayor of a \"crime-ridden\" city. \"'Them are the facts,\" DeSantis says.The attack is one that DeSantis also used in the first debate, by saying Gillum could see a similar surge in crime in the state should he become governor.Gillum refutes this, saying \"We are the number one place to raise a family,\" in reference to Tallahassee.DeSantis and Gillum clash on voting rights restoration for felons7:49 p.m.DeSantis said that convicted felons who serve out their sentences should have to \"earn\" their voting rights back. \"I think it’s wrong to automatically restore rights to felons who committed very serious crimes,\" DeSantis said, adding that he wants people to be \"redeemed,\" but they would first have to prove that they have changed. Gillum said that reducing recidivism among convicted felons hinged on restoring their voting rights. \"If you paid your debt to society, you ought to be able to re-enter society,\" he said.Gillum gets sharp attack accusing DeSantis of association with racists7:49 p.m.One of the sharpest exchanges comes as Gillum continues to accuse DeSantis of association with racists though he notes he does not believe Gillum is racist himself.\"My grandmother used to say a hit dog will holler and it hollered through this room,\" he said as the audience clapped.He then says \"Neo-nazis\" are helping him in the campaign, referring to racist robocalls made recently to attack him, while saying DeSantis did not return money from a donor who referred to President Obama as the N-word.DeSantis lashes out about \"political correctness\"7:43 p.m.DeSantis lashed out at a question about his past remarks praising a conservative writer who made racist remarks, accusing the media of trying to \"smear\" him.\"How the hell am I supposed to know every statement that somebody makes?\" he shouted, referring to the conservative writer David Horowitz.\"I am not going to bow down to the altar of political correctness,\" he added. \"I’m not going to let the media smear me.\"Audience cheers for Gillum, boos DeSantis7:38 p.m.Though the audience has been asked to keep quiet, parts of it appear to be siding with Gillum, cheering and applauding loudly at some of his zingers while at times booing DeSantis.\"He has too many degrees not to get it,\" Gillum says at one point while driving an attack on DeSantis, eliciting laughter and clapping from the audience.The moderator pleads with the audience to keep neutral, to little avail so far.Immigration debate gets testy7:38 p.m.Gillum defended his past calls to abolish U.S. Immigration and Customs Enforcement (ICE) in its current form, saying the agency should be absorbed by the Justice Department.\"Immigration and Border Control has an important job to do and we ought to empower them to do that job,\" Gillum said, arguing that moving the agency into DOJ would allow it to more efficiently tackle cross-border human and drug trafficking.DeSantis said that Gillum's dislike for Trump had driven him to oppose any federal immigration enforcement efforts, and said that the Tallahassee mayor would support so-called sanctuary cities as governor.\"Why would you allow your dislike for the president to knowingly put communities at risk?\" DeSantis said.Gillum pitches higher wages for teachers, DeSantis says he's focused on \"results\"7:32 p.m.Gillum vowed to raise public school teachers' wages if he wins in November, calling to fund the state's public school systems over private charter schools. \"They deserve a wage that they can live on and when I’m governor, we’re going to fight for it,\" Gillum said. He accused DeSantis of taking $200,000 dollars in contributions from Education Secretary Betsy DeVosElizabeth (Betsy) Dee DeVosACLU slams DeVos's Title IX plan: Changes will make it 'less safe' for sex assault survivors Department of Education unveils new rules to protect those accused of sexual harassment Millions being spent on U.S. Marshals Service security detail for DeVos: report MORE, a staunch advocate for charter schools. \"Their agenda is simple,\" he said. \"It is to completely defund the public school system.\"DeSantis pointed out that he is a \"product of Florida public schools,\" but said he was more focused on \"results\" and that success in education is not \"synonymous with bureaucracies.\"Taxes becomes subject of pointed exchange7:26 p.m.Just like in the first debate, taxes becomes a point of contention with DeSantis accusing Gillum of wanting to raise taxes, including the income tax, and Gillum strongly denying it.\"My opponent has said I want to propose an income tax. I never proposed an income tax,\" he said.Instead, Gillum says his plan would tax the 3 percent of \"the wealthiest corporations in the state\" to fund education and apprenticeships.In a subsequent exchange, he then accuses DeSantis of having supported a major tax cut for wealthy people under the belief that it would \"magically\" trickle down to working class people.\"They've drilled a deep hole in the national debt,\" Gillum says while adding \"People haven't seen a raise in wages\" as a result of the tax cuts.Gillum, DeSantis spar over health care7:21 p.m. Gillum sought to make his case on a plan to expand Medicaid in Florida under the Affordable Care Act (ACA), saying that it would extend health care access to 800,000 of the neediest Floridians. \"This means something to me,\" Gillum said. \"I remember having to wait for the free dental clinic to come through my neighborhood so I could have my teeth cleaned.\"DeSantis also sought to defend his vote for the American Health Care Act (AHCA) last year – the GOP-led plan to repeal and replace large parts of ObamaCare – saying he was trying to lower insurance premiums. But he said that if Congress repeals the ACA's protections for patients with pre-existing conditions, he would sign a bill into law in Florida that would protect those with such conditions.\"I will happily sign a bill to help folks with pre-existing conditions here in Florida,\" he said.Moderator pleads with candidates to respect allotted time7:17 p.m.The moderator tries hard to get both DeSantis and Gillum to stick within their allotted times as the two candidates take sharp barbs at each other, including accusing each other of lying.At some point, DeSantis continues with his answer even as the moderator tried to interrupt him to tell him he's over his time.The moderator tries reasoning with DeSantis by telling him that nobody can hear him \"if both of us are speaking at the same time.\"Gillum addresses report about taking Hamilton ticket from undercover agent7:14 p.m.Gillum downplayed the revelation that an undercover FBI agent gave him a ticket to the musical \"Hamilton,\" saying that he should have \"asked more questions,\" but that there were bigger issues to focus on.\"I take responsibility for not having asked more questions,\" he said. \"But let me tell you, I’m running for governor. In the state of Florida we have many issues. And tickets to Hamilton ain’t one of them.\"DeSantis insisted that Gillum is under FBI investigation for suspected corruption, before hitting Gillum over the \"Hamilton\" ticket revelation. In fact, no evidence has emerged to suggest that Gillum is a target of an FBI probe.\"He wants you believe that he’s not under investigation,\" DeSantis said. \"Why would an undercover FBI agent posing as a contractor give you a ticket to Hamilton?\" Debate quickly turns bitter after question about political divisions7:08 p.m.The second Florida gubernatorial debate opened up with a question about whether divisive rhetoric has gone too far.And while both candidates offered briefed lamentations of widening political divisions, the discourse quickly turned bitter.Gillum condemned the \"collapsing of our political discourse,\" before taking a shot at DeSantis and President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE. \"My opponent has run this race very, very close the the Trump handbook,\" he said.Ready to roll7:55 p.m.The debate should get started any minute now after DeSantis and Gillum clashed in a heated CNN forum on Sunday.That debate included sharp attacks on everything from President Trump to taxes to climate change.With polls continuing to show a tight race, the two candidates are running short of time to make a direct appeal to voters.Stay tuned.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}