{"id": "Trump says Heller won lone Nevada Senate debate: 'He beat her very badly'", "paragraph": "President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE praised Republican Sen. Dean HellerDean Arthur HellerCortez Masto named Dem Senate campaign chairwoman Nevada New Members 2019 Election Countdown: Lawsuits fly in Florida recount fight | Nelson pushes to extend deadline | Judge says Georgia county violated Civil Rights Act | Biden, Sanders lead 2020 Dem field in poll | Bloomberg to decide on 2020 by February MORE (Nev.) at a rally in Nevada Saturday, saying that he \"beat [his opponent] very badly\" in their debate Friday.The president and Heller previously had a contentious relationship when Trump ran for president. But the two have reconciled and Trump praised Heller's work with him.\"Once he and I got on the same page, and now we are always on the same page, he has been as smart and tough and strong as anyone in Washington,\" he told the crowd.After Heller's presentation, Trump weighed in on Friday night's Senate debate.\"I may be a little bit partial, he really beat her very badly.\"Heller credited Trump for allowing his debate against Rep. Jacky RosenJacklyn (Jacky) Sheryl RosenThe Hill's Morning Report — Presented by T-Mobile — House, Senate leaders named as Pelosi lobbies for support to be Speaker  Nevada New Members 2019 Election Countdown: Lawsuits fly in Florida recount fight | Nelson pushes to extend deadline | Judge says Georgia county violated Civil Rights Act | Biden, Sanders lead 2020 Dem field in poll | Bloomberg to decide on 2020 by February MORE (D) to happen.\"The only reason I had that debate is because you embarrassed my opponent into having it,\" he said.Heller was referring to clashes that he and Rosen's camps have been having over debate scheduling and location.It remains unclear if another debate will be held.A RealClearPolitics polling index gives Heller less than a 2-point lead in the state, which has been a top target for Democrats.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}