{"id": "Mattis: No diplomatic solution on Russia arms treaty yet", "paragraph": "Defense Secretary James MattisJames Norman MattisOvernight Defense — Presented by Raytheon — Lawmakers struggle with how to punish Saudi Arabia | Trump regrets not visiting Arlington for Veterans Day | North Korea deports detained American Ousted Bolton aide says it was 'an honor' to serve Trump administration Macron’s 'Euro-army' is an idea whose time has come MORE said Tuesday that “diplomats are still trying” to find options on the way forward on a landmark arms control treaty that President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE has said he will withdraw the United States from.“We have done everything we can diplomatically. The diplomats are still trying, by the way, as we speak,” Mattis said at the United States Institute of Peace. “We are doing everything we can to try to find any option. And if any of you have any good ideas please send me an email. It seems like every nut in America has my email address, I’m sure you can find it and send it to me.”Trump announced earlier this month that he intends to withdraw from the 1987 Intermediate-range Nuclear Forces (INF) Treaty with Russia.The treaty, which has been credited with helping end the Cold War, bans nuclear and conventional ground-launch ballistic and cruise missiles with ranges between 300 and 3,400 miles.The United States has accused Russia of violating the treaty since 2014, first by testing a banned missile and then by deploying the missiles.Moscow denies the charge and says it is the United States that is violating the treaty with its missile defenses in Europe.On a trip to Moscow last week, national security adviser John Bolton reaffirmed Trump’s decision to withdraw and said the United States would file an official notice in “due course.”Under the terms of the treaty, the United States has to formally notify Russia, kicking off a six-month withdrawal process.Because Trump made his announcement without official action, some have raised the suggestion that he could be using a negotiating tactic to try to bring Russia back into compliance. Bolton, though, has insisted Trump’s announcement is not a negotiating ploy.Prior to Trump’s announcement, Mattis indicated he wanted to convince Russia to come back into compliance rather than have the United States withdraw.“Russia must return to compliance with the INF Treaty or the U.S. will need to respond to its cavalier disregard of the treaty’s specific limits,” Mattis said in early October. “The United States is reviewing options in our diplomacy and defense posture to do just that in concert with our allies, as always.”On Tuesday, Mattis declined to discuss the military options the United States has without the treaty in place, saying that is Trump’s decision.“I don’t want to go into too much detail, but there are options both symmetric and asymmetric,” Mattis said. “But I am not committing to anything right now. That’s a grave decision that the president will take counsel from all of us and it will be up to President Trump.”Mattis added that Trump “hates” nuclear weapons.“His views on nuclear weapons, I think, are pretty well known,” Mattis said. “He hates ‘em.”View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}