{"id": "Pelosi heckled by Miami Republicans, Proud Boys at campaign event", "paragraph": "House Minority Leader Nancy PelosiNancy Patricia D'Alesandro PelosiDem women rally behind Pelosi How this year’s freshmen can save the Congress — and themselves Single-payer health care is better than ObamaCare  MORE (D-Calif.) was confronted by protesters in Florida on Friday organized by a local Republican chapter and a local group of the \"Proud Boys,\" who shouted pro-Trump slogans and blasted the Democratic House leader as a \"communist.\"Video of the confrontation recorded by a member of the \"Proud Boys\" shows protesters holding signs and cursing at Pelosi as she entered a campaign event for Donna Shalala, the Democratic nominee in Florida's 27th District.\"Look at this piece of sh-t Pelosi,\" the cameraman is heard yelling in the video.“You don’t belong here you f--king communist f--k,” a voice is also heard saying on the video. “You and your f---ing Democrats.”Pelosi's office told The Hill in a statement that it was ironic to hear President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE accuse Democrats of being part of an angry \"mob\" after events such as the protest in Florida. The Proud Boys are considered a hate group by the Southern Poverty Law Center over anti-immigrant and racist views espoused by members.\"It is deeply sad but unsurprising that we now see that ugliness rearing its head,” her spokesman Drew Hammill told the Post. “It is stunning that Republicans have the gall to call courageous survivors of sexual assault a ‘mob’, at the same time they incite and condone violent actions like this. Republicans must condemn this vile and dangerous conduct, and stop the reckless and dangerous rhetoric that encourages it.”Florida's Democratic Party chairwoman Terrie Rizzo also reacted to the news, calling on the chairman of the Miami Dade County Republican Party to resign over the Miami GOP's protest with a \"known hate group.\"\"It is appalling that the Miami Dade GOP Chairman, Nelson Diaz, would campaign alongside a known hate group and welcome its members within his party. He should resign immediately and take anyone who espouses the Proud Boys' ideas out the door with him,\" Rizzo said in a press release.The confrontation came a day after Proud Boys founder Gavin McInnes said that several members of his group would turn themselves in to police for videotaped beatings outside of a Republican club in New York earlier this month.\"Some holier than thou keyboard warriors may not agree with our methods, but I'll remind them about Maxine WatersMaxine Moore WatersDem women rally behind Pelosi Pelosi, potential challenger Fudge hold 'candid' discussion Marcia Fudge under spotlight as Pelosi Speaker fight heats up MORE condoning violence, and the rest of her party not denouncing the masked leftist domestic terrorists aka antifa,\" the Miami chapter wrote on Facebook after the video of the confrontation with Pelosi was released.Trump reiterated his newest line of attacks on Democrats this week at campaign rallies and a video recorded in the White House, while praising Rep. Greg GianforteGregory Richard GianforteMontana New Members 2019 Gianforte defeats Democrat for Montana's at-large congressional seat Sabato's Crystal Ball: Dems will pick up more than 30 House seats, GOP set to keep Senate MORE's (R-Mont.) assault of a reporter last year at his rally Thursday night. View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}