{"id": "Overnight Energy: New York sues Exxon over climate risk disclosures | Trump officials approve new offshore drilling in Alaska | University says truck pollution study wasn't 'accurate'", "paragraph": "NEW YORK SUES EXXON OVER DOWNPLAYING CLIMATE CHANGE RISKS: New York's attorney general filed a lawsuit Wednesday accusing Exxon Mobil Corp. of fraudulently downplaying the risks of climate change to its shareholders.The attorney general's office argued in its suit that Exxon Mobil failed to accurately depict the likely financial risks associated with climate change, thereby deceiving investors.\"Investors put their money and their trust in Exxon -- which assured them of the long-term value of their shares, as the company claimed to be factoring the risk of increasing climate change regulation into its business decisions,\" New York Attorney General Barbara Underwood (D) said in a statement. \"Yet as our investigation found, Exxon often did no such thing.\"She added that Exxon Mobil instead \"built a facade to deceive investors into believing that the company was managing the risks of climate change regulation to its business when, in fact, it was intentionally and systematically underestimating or ignoring them, contrary to its public representations.\"The suit follows three years of investigation by the New York attorney general's office that looked into whether the company lied to investors and the public over the risks of climate change. It did not address how Exxon might have played a role in exacerbating the effects of climate change, but leaves the door open to additional lawsuits.Underwood also alleged that her office's investigation found that the fraud reached up to Exxon Mobil's highest levels and that the misrepresentation was known by former Chairman and CEO Rex TillersonRex Wayne TillersonWhite House ousts Sessions Trump downplays potential turnover: 'Everybody wants to work in this White House' Trump says Cabinet changes likely after midterms MORE -- who left the company to become President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE's first secretary of State. He left that post in March.An Exxon spokesman told The Hill that there \"is no evidence to support these allegations.\"Read more here. Happy Wednesday! Welcome to Overnight Energy, The Hill's roundup of the latest energy and environment news.Please send tips and comments to Timothy Cama, tcama@thehill.com, and Miranda Green, mgreen@thehill.com. Follow us on Twitter: @Timothy_Cama, @mirandacgreen, @thehill.CLICK HERE to subscribe to our newsletter. TRUMP OFFICIALS APPROVE HISTORIC OFFSHORE DRILLING PROJECT IN ALASKA: The Trump administration approved a company's plan Wednesday to drill for oil in the Arctic Ocean north of Alaska, the first time oil would be produced from federal waters in the Arctic.The approval from the Interior Department's Bureau of Ocean Energy Management (BOEM) is conditional, and Hilcorp Energy Co. would still have to get other federal permits and abide by standards like restricting drilling seasons.\"Working with Alaska Native stakeholders, the Department of Interior is following through on President Trump's promise of American energy dominance,\" Interior Secretary Ryan ZinkeRyan Keith ZinkeLawmakers say California will eventually get emergency funding for fire relief Mulvaney positioning himself to be Commerce Secretary: report Overnight Energy: Trump to visit California wildfire victims | Head of Park Service climate program resigns | Dems rip Trump pick for energy panel MORE said in a statement.\"American energy dominance is good for the economy, the environment, and our national security. Responsibly developing our resources, in Alaska especially, will allow us to use our energy diplomatically to aid our allies and check our adversaries. That makes America stronger and more influential around the globe.\"The Alaska Liberty project would not use a traditional mobile drilling rig like the ones common in the Gulf of Mexico and other offshore drilling areas.It would instead involve building a new nine-acre gravel artificial island about five miles off the coast to host the drilling. Four other oil and gas producing islands are nearby in waters that the state controls.David Wilkins, senior vice president of Hilcorp's Alaska operations, said the company is \"pleased\" with the administration's approval.\"The Record of Decision is the result of years of study and due diligence by multiple federal, state and local agencies and the project team. If granted final approvals, the Liberty Project will provide decades of responsible resource development and strengthen the energy future of Alaska and the United States,\" he said in a statement.The Center for Biological Diversity said the project is dangerous to the environment and the climate.Read more here. UNIVERSITY SAYS CONTROVERSIAL TRUCK STUDY CITED BY EPA WAS INACCURATE: The research the Environmental Protection Agency (EPA) cited in proposing to roll back a major truck pollution rule was \"not accurate,\" the university that conducted the study has concluded.Tennessee Tech University's conclusions, outlined in a letter Tuesday to the EPA, came after an academic review of the controversial research into the emissions of \"glider\" trucks.The heavy-duty trucks use new bodies and remanufactured, older engines that do not meet current EPA regulations. Environmentalists call them \"super-polluting\" trucks, citing research showing far higher emissions compared to new vehicles.Philip Oldham, Tennessee Tech's president, wrote last year that university research found that glider trucks \"performed equally as well and in some instances out-performed the [original manufacturer] engines,\" despite not being certified to current standards for pollutants like particulate matter and nitrogen oxides.The research was funded by Fitzgerald Glider Kits, one of the country's biggest glider makers.Then-EPA Administrator Scott PruittEdward (Scott) Scott PruittOvernight Energy: Trump to nominate Wheeler as EPA chief | House votes to remove protections for gray wolves | Lawmakers aim to pass disaster funds for California fires Trump to nominate former coal lobbyist Andrew Wheeler as next EPA administrator Time to stop letting fossil fuels run Washington MORE cited the research in a proposal to repeal an Obama-era regulation from 2016 that would have limited the number of glider trucks that each company can sell per year.That prompted Tennessee Tech's Faculty Senate to seek a full academic review of the research.\"The university has concluded its internal investigation and has found that certain conclusions reported in the June 2017 letter were not accurate,\" Trudy Harper, vice chairman of Tennessee Tech's board of trustees, wrote in the letter sent to the EPA, Fitzgerald and Rep. Diane BlackDiane Lynn BlackTennessee New Members 2019 Many authors of GOP tax law will not be returning to Congress Blackburn keeps Tennessee seat in GOP hands  MORE (R-Tenn.), who helped bring the research to the EPA's attention.Harper said the research methods Tennessee Tech used were not sufficient to support Oldham's \"equally as well\" conclusion and that the data gathered by researchers do not support the claim.She went on to say that the research \"was methodologically sound,\" but only for the stated purpose of establishing baseline pollution levels for Fitzgerald's trucks and for newly manufactured engines. Harper expressed \"regret\" for the incident.The EPA didn't immediately respond to a request for comment on the letter.Read more here. DOJ PUSHES TO DISMISS CHILDREN'S CLIMATE LAWSUIT: The Trump administration filed arguments to the Supreme Court Wednesday asking for a continued stay of a lawsuit challenging the government's role in worsening the planet's environment for children. In a brief filed to the court, the Department of Justice argued for keeping the lawsuit, known as the kids climate suit, out of court.\"Respondents' assertion of sweeping new fundamental rights to certain climate conditions has no basis in the Nation's history and tradition -- and no place in federal court. The government has repeatedly urged the district court to dismiss the suit on justiciability grounds or on the merits,\" the administration wrote.Chief Justice John Roberts initially halted the discovery and the trial last Friday after the Trump administration asked the Supreme Court to delay the case over concerns about its effect on the separation of powers.The landmark trial was set to begin in less than two weeks in federal court in Oregon.The case was initially filed by a group of 21 children and youths who claim that the government needs to do more to confront climate change.Read DOJ's brief here.Read more about the initial stay. OUTSIDE THE BELTWAY:-Crude oil tumbles as Saudi Arabia pledges to produce as much as it can-Puerto Rico bill would move island to 100 percent renewable energy-Tesla earnings should net profit of $312 million FROM THE HILL'S OPINION SECTION:Merrill Matthews, a resident scholar with the Institute for Policy Innovation in Dallas, argues that other states should follow California and allow residents to approve future gasoline and vehicle fee increases. IN CASE YOU MISSED IT:Check out Wednesday's stories ...-Trump administration approves Arctic offshore oil drilling project off Alaska's coast-New York AG sues Exxon Mobil, says company downplayed climate change risks-University: Truck pollution research cited by EPA was 'not accurate'-EU lawmakers vote to ban single-use plastics across EuropeView the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}