{"id": "Election Countdown: Florida braces for volatile recount | Counties race to finish machine recount | Trump ramps up attacks | Abrams files new lawsuit in Georgia | 2020 to be new headache for Schumer | Why California counts its ballots so slowly", "paragraph": "This is Election Countdown, The Hill's newsletter from Lisa Hagen (@LA_Hagen) and Max Greenwood (@KMaxGreenwood) that brings you the biggest stories on the campaign trail. We'd love to hear from you, so feel free to reach out to Lisa at LHagen@thehill.com and Max at MGreenwood@thehill.com. with any questions, comments, criticisms or food recommendations (mostly the latter, please). Click here to sign up. We're 722 days until the 2020 elections. But the midterm action isn't over yet... Is it 2000 again? Florida is in the midst of a recount in the hotly contested Senate and governor's races as well as in the state's agriculture commissioner race.And election officials are scrambling to meet the Thursday deadline to complete the machine recounts.The race for the Senate remains the most heated, with both Sen. Bill NelsonClarence (Bill) William NelsonDems seek to overhaul voting rules in Florida legal fight  Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Trump's take on midterms: ‘Epic' win in Senate, ‘better than other sitting Presidents’ in House MORE (D-Fla.) and Gov. Rick Scott filing a series of lawsuits and legal actions as county election officials scramble to tally ballots.On Sunday, Scott's campaign filed two motions in Broward and Palm Beach County courts, asking the Florida Department of Law Enforcement and county sheriffs to impound and secure voting machines, ballots and tabulating equipment while they're not in use. But Scott was handed a setback after a judge on Monday denied his request for an injunction.Meanwhile, a lawsuit filed by Nelson's campaign will be in the spotlight on Wednesday. A federal court in Tallahassee will hear the case regarding his request to count mail-in and provisional ballots that were invalidated due to signatures that don't match. Nelson's team argues that state law requiring a signature on a mail-in ballot to match the one on record is \"unconstitutional.\" The Florida Senate race has broken into all-out warfare, as Scott and his allies have raised the prospect of election fraud. The Florida Department of Law Enforcement and the Department of State have both said they have not received credible allegations of fraud or criminal activity.President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE appeared to cast doubt on the recount on Monday, arguing that the races should be called in favor of Scott and DeSantis because \"an honest vote count is no longer possible.\"Meanwhile, Nelson and Democrats have argued that a recount is necessary to ensure that all lawfully cast ballots are counted, and have accused Scott of trying to suppress votes that are unfavorable for him. Here's a look back at the past week: Scott appeared set for victory in the Senate race on election night on Tuesday. But as vote tallies continued to come in from Broward and Palm Beach throughout the rest of last week, Scott's lead shrunk considerably. He currently leads Nelson by roughly 12,500 votes -- a margin of about 0.15 points.Florida Secretary of State Ken Detzner, a Republican, also ordered recounts in Florida's closely watched gubernatorial race on Saturday. Democrat Andrew Gillum previously conceded that contest to Republican Ron Desantis. But he withdrew his concession over the weekend, saying that incoming vote counts painted a different outlook for the race. DeSantis currently leads Gillum by more than 33,000 votes, or 0.41 percentage point. Also today: Scott is also set to attend the new member orientation for Republican senators. And Jeb Bush is calling for the removal of Broward County Supervisor of Elections Brenda Snipes, whom he appointed as governor. Senate showdownRep. Kyrsten Sinema (D) continued to slightly expand her lead over Rep. Martha McSallyMartha Elizabeth McSallyArizona New Members 2019 House GOP returns to Washington after sobering midterm losses Overnight Defense — Presented by Raytheon — First lady's office pushes for ouster of national security aide | Trump taps retired general as ambassador to Saudis | Mattis to visit border troops | Record number of female veterans to serve in Congress MORE (R) in the nail-biter Arizona Senate race. Sinema's slim lead grew to 31,169 votes, after more ballots were released Sunday night, mainly from Maricopa County, the state's largest county.But the race still isn't over. There are still 211,000 uncounted ballots, and there will be another vote release tonight at 7 p.m. EST.Experts told The Hill that they expected Sinema to extend her lead over the weekend since the early votes being tabulated would likely skew Democratic. And observers believe that McSally will benefit from new votes released early this week since those are mail-in ballots dropped off on Election Day--likely favoring Republicans. Senate Minority Leader Charles SchumerCharles (Chuck) Ellis SchumerFacebook reeling after damning NYT report Schumer warns Trump to stay out of government funding negotiations Schumer predicts Nelson will 'continue being senator' if 'every vote counted' MORE (D-N.Y.) is in for a tough two years. He'll need to navigate a likely crowded 2020 presidential field where candidates are racing to hype up the liberal base. Meanwhile, Democrats will need to appeal to centrist voters in Colorado, Maine, Iowa, North Carolina and Alabama--if the party wants to take back the Senate majority in 2020. House watchDemocratic businessman Harley Rouda defeated longtime Rep. Dana RohrabacherDana   Tyrone RohrabacherDemocratic gains erasing House GOP in California California New Members 2019 McCarthy defeats Jordan for minority leader in 159-to-43 vote  MORE (R-Calif.), adding another seat to Democrats' house majority. It's a huge victory for Democrats who made Rohrabacher a top target since he represented one of the seven GOP-held California seats that Hillary ClintonHillary Diane Rodham ClintonTexas history curriculum to emphasize that slavery played 'central role' in Civil War Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Texas education board approves restoring Hillary Clinton in history curriculum MORE won in 2016.Rohrabacher, who served his Orange County district for more than 30 years, was one of the most pro-Russia members of Congress, drawing scrutiny from both parties. Here are the California races that have yet to be called:Calif.-10: Democrat Josh Harder jumped into the lead over Rep. Jeff DenhamJeffrey (Jeff) John DenhamDemocratic gains erasing House GOP in California California New Members 2019 Election Countdown: Hyde-Smith's 'public hanging' joke shakes up Mississippi runoff | New lawsuits in Florida | Trump wants Florida election official fired | Mia Love sues to stop Utah vote count | Republican MacArthur loses NJ House race MORE (R-Calif.), holding a 1.8-point edge.Calif.-39: Republican Young Kim holds a 1.4-point lead over Democrat Gil Cisneros. They're vying for the seat being vacated by retiring GOP Rep. Ed RoyceEdward (Ed) Randall RoyceOvernight Defense — Presented by Raytheon — Border deployment 'peaked' at 5,800 troops | Trump sanctions 17 Saudis over Khashoggi killing | Senators offer bill to press Trump on Saudis | Paul effort to block Bahrain arms sale fails Democratic gains erasing House GOP in California Historic class storms Capitol MORE.Calif.-45: Rep. Mimi WaltersMarian (Mimi) Elaine WaltersElection Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Warren congratulates former student and researcher on election to Congress Democrat Katie Porter unseats GOP's Mimi Walters MORE (R-Calif.) is clinging to a narrow 1-point lead over Democrat Katie Porter. And in case you were wondering why California is taking so long at counting its ballots, here's a fun feature from The Hill's Reid Wilson that explains the lengthy process. In a nutshell, several new laws passed in recent years have slowed down voting counting, with the goal of counting more ballots than on counting those ballots quickly. The Hill's Melanie Zanona gives a preview of the incoming Republican conference: Tuesday's blue wave in the House wiped out a number of moderate Republicans, leaving behind a more conservative congressional caucus.\"We're gonna have a lot of House members Grahamified,\" said an aide to a conservative lawmaker, referring to Sen. Lindsey GrahamLindsey Olin GrahamOn The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report Cotton opposes Trump-backed criminal justice bill Lawmakers say California will eventually get emergency funding for fire relief MORE (R-S.C.). \"He was decidedly anti-Trump, but then Democrats crossed the threshold of what was responsible and reasonable.\" Meanwhile, as Democrats are set to take over Congress next year, there's momentum building to act on campaign finance reform after candidates vowed it'd be a central issue if Democrats won the majority.Half of the new Democrats elected have refused to take corporate PAC money, according to End Citizens United (ECU), a group that advocates for campaign finance reform. Plus, more than 100 Democratic candidates signed a letter last month calling for sweeping reforms. Of those, at least 34 won their races, according to ECU.House Minority Leader Nancy PelosiNancy Patricia D'Alesandro PelosiDem women rally behind Pelosi How this year’s freshmen can save the Congress — and themselves Single-payer health care is better than ObamaCare  MORE (D-Calif.) has said the party would work to \"reduce the role of dark, special interest money\" as part of the new majority's priorities. State watchDemocrat Stacey Abrams's campaign has filed a lawsuit in the unsettled Georgia governor's race, as Republican Brian Kemp ramps up the pressure with calls for her to concede.Abrams filed a new lawsuit on Sunday that seeks to block Gwinnett and DeKalb counties from discarding some ballots. Her campaign wants those counties not to toss absentee ballots with small mistakes like writing the current date in the date of birth section. The team also wants the counties to process provisional ballots of voters who still have their old addresses listed in voter registration records but have moved. The lawsuit is also looking to extend the deadline to certify election results from Tuesday to Wednesday.Over the weekend, The Atlanta Journal-Constitution reported that Kemp's lead slightly shrunk to about 59,000 votes as new mail-in ballots and provisionals came in that largely favored Abrams. But Abrams still needs about 22,000 votes to trigger a runoff on Dec. 4.According to AP, Kemp holds a 58,875-vote lead, with 100 percent of precincts reporting. But the race has not yet been called by AP or major news outlets.The two campaigns are claiming different numbers of outstanding provisional ballots that are left to be counted. Abrams's team believes there are a number of ballots out there that could sway the race, stressing that they don't trust the secretary of State's office.\"The bottom line is this race is not over. It is still too close to call, and we do not have confidence in the secretary of state's office,\" Abrams campaign manager Lauren Groh-Wargo said on a Sunday press call.Meanwhile, Kemp, who has already declared victory, and his campaign have maintained in a statement that \"it is mathematically impossible for Abrams to force a runoff or win.\"\"Stacey Abrams' antics are a disgrace to democracy and completely ignore the will of the people,\" Kemp's campaign said in a statement over the weekend. \"Georgia voters have spoken. It's time for Abrams to listen and concede immediately.\" Race for the White HouseDemocratic state Sen. Richard Ojeda, who just lost a congressional bid in a deep-red West Virginia district, is mounting a longshot bid for president in 2020. The former Army paratrooper first burst onto the national scene when he led the teacher's strike in West Virginia last year.Ojeda released his first campaign ad overnight, and made a formal announcement Monday afternoon. He filed paperwork for a presidential bid with the Federal Election Commission. Ojeda, who voted for Trump in 2016, was defeated in Tuesday's election by Republican Carol Miller by 12 percentage points in a district Trump carried by nearly 50 percentage points.\"Families in Logan, West Virginia, were going through the same struggles as families in the Bronx, San Francisco and Houston,\" Ojeda wrote in an email to supporters Sunday night. \"This was not a West Virginia problem. This is an American problem and it has to change.\" Will Betomania continue into 2020? The Hill's Amie Parnes reports that Democrats are delighted by Rep. Beto O'RourkeRobert (Beto) Francis O'RourkeEntrepreneur touts big solutions, endorsements in discussing presidential bid Dem pollster: Texas, Georgia diversifying because they are 'centers for opportunity'  Cruz brushes off question about campaign claim on O'Rourke paying for caravan MORE's (D) narrow loss to Sen. Ted CruzRafael (Ted) Edward CruzDemocratic strategist warns Beto should be ‘careful’ with social media presence Hillary advisers battle over whether she’ll run in 2020 O'Rourke writes blog post describing a literal run from near the capitol to near the White House MORE (R) in deep-red Texas, causing chatter among Democrats who want to see him run for president in 2020.\"He now has name recognition, a widely successful fundraising operation, a young fresh face with a sprinkling of woke, a cool persona, a new perspective, he speaks Spanish and would be an exciting and upbeat candidate,\" said Democratic strategist Maria Cardona. Meanwhile, former Iowa Gov. Tom VilsackThomas James VilsackUSDA: Farm-to-school programs help schools serve healthier meals OVERNIGHT MONEY: House poised to pass debt-ceiling bill MORE (D) is seeking to pour cold water on Democrats potentially recruiting \"rock stars\" as 2020 presidential candidates. He said it'd be \"odd\" to nominate O'Rourke fresh off his Senate defeat.\"We're always looking for rock stars but I don't think the country is looking for rock stars,\" Vilsack, who served as Agriculture secretary in the Obama administration, told The New York Times.\"It's probably a good idea to win the first race you were interested in,\" Vilsack said of O'Rourke. \"Maybe he's the new Abe Lincoln, you lose a race and then run for president and win.\" Mississippi runoffSen. Cindy Hyde-Smith (R-Miss.) is facing backlash over joking about a \"public hanging\" at a recent campaign event. On Sunday, a local publisher posted a video at a Nov. 2 event where Hyde-Smith jokingly told a supporter she was campaigning with that if he invited her to \"a public hanging,\" she'd be \"on the front row.\"The criticism over Hyde-Smith's comment comes as the GOP senator is locked in a Senate runoff with Democratic opponent Mike Espy, who would be the first black U.S. senator from Mississippi since 1883. Neither candidate was able to clear the 50-percent threshold in the Nov. 6 \"jungle primary,\" forcing them into a Nov. 27 runoff to serve out the remainder of former Sen. Thad CochranWilliam (Thad) Thad CochranBooker to campaign for Dem in Mississippi Senate runoff Hyde-Smith dismisses comments about making voting harder for liberal students as a joke Election Countdown: Florida Senate race heads to hand recount | Dem flips Maine House seat | New 2020 trend - the 'friend-raiser' | Ad war intensifies in Mississippi runoff | Blue wave batters California GOP MORE's (R-Miss.) term which ends in 2020.His campaign called her comments \"reprehensible\" in a statement. \"They have no place in our political discourse, in Mississippi, or our country. We need leaders, not dividers, and her words show that she lacks the understanding and judgement to represent the people of our state.\"Hyde-Smith told the Jackson Free Press in a Sunday interview that the remarks were \"an exaggerated expression of regard.\"\"In a comment on Nov. 2, I referred to accepting an invitation to a speaking engagement,\" she said. \"In referencing the one who invited me, I used an exaggerated expression of regard, and any attempt to turn this into a negative connotation is ridiculous.\"View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}