{"id": "Congress must protect eye care patients from frightful prescriptions", "paragraph": "Halloween is supposed to be full of fright, but not when it comes to our vision. Millions of people are buying costumes and then purchasing colored contact lenses right off the shelf. While it can be fun dressing up and surprising your friends, very few people understand that many costume/colored contact lenses may not be safe to wear.For the 40 million-plus Americans that use prescription contact lenses, the danger from improper use of those lenses is on the rise due to risks associated with counterfeits, deceptive selling practices and low quality “telehealth.” The U.S. Centers for Disease Control and Prevention (CDC) recently reported that annually there are nearly 1 million emergency room and urgent doctor visits and about $175 million in added health care costs arising from keratitis, an eye infection linked to improper contact lens use. Illegal contact lens sales, counterfeits, and outdated forms of prescription verification such as robo-calls are part of the reason for these scary statistics. While Recent Federal Trade Commission rules were meant to combat these issues, there still remain too many practices placing contact lens wearers in harm’s way.Another factor contributing to the dangers facing eye care patients is the emergence of low quality/unproven telehealth. As the health care system rapidly evolves, telehealth can be an integral tool in promoting patient health and strengthening the doctor-patient relationship. With faster and clearer methods to communicate, more patients can immediately engage with their doctors and collaborate to improve overall health.But with these benefits comes a need for caution. Some ocular telehealth tools and vision screening apps give patients a false sense of security and can possibly delay essential, sight-saving treatment of more complex diseases. For example, a comprehensive eye exam can detect elevated intraocular pressure (IOP)-a potential risk factor for glaucoma-while a smartphone's interpretation of a refraction-only screening cannot measure IOP. In fact, there are over 270 diseases that can be detected by a comprehensive eye exam. In comparison, current vision screening apps can detect less than 10. While patients need ready access to care, telehealth tools should uphold and support the doctor-patient relationship and the medically-recognized standard of care that preserves patient health. Last month, The Hill newspaper sponsored a discussion about the future of telehealth and just these sorts of benefits and inherent risks. The event, entitled The Evolution of Telehealth: Patient Awareness and Education, featured lawmakers like Sen. Bill CassidyWilliam (Bill) Morgan CassidyDyslexia is more common than society realizes. Here’s what we can do to help children struggling in the shadows. Congress must protect eye care patients from frightful prescriptions Trump signs bills banning drug pricing 'gag clauses' MORE (R-La.) Reps. Doris MatsuiDoris Okada MatsuiPelosi allies push back on proposed Speaker nominee rule change Congress must protect eye care patients from frightful prescriptions The bipartisan PACT Act would ensure access to life-saving bone marrow transplants for Medicare beneficiaries MORE (D-Calif.) and Buddy CarterEarl (Buddy) Leroy CarterCongress must protect eye care patients from frightful prescriptions Trump signs bills banning drug pricing 'gag clauses' Overnight Health Care: Trump officials defend Medicaid work requirements | HHS chief dismisses 'Medicare for all' as 'too good to be true' | Aetna sells Medicare drug business MORE (R-Ga.) who highlighted congressional focus on the protection of patients and access to health care.Also participating were members of the medical and business communities. North America President of Johnson & Johnson Vision Care Peter Menziuso summed it up nicely: “Telemedicine can absolutely increase the ability for access to health care, it can lower health care costs, and in some cases it can even improve outcomes. But we must be sure that the patient’s health is never compromised, in the name of convenience or cost savings.”That’s why Congress should pass legislation to protect patients’ health as soon as possible.This legislation should allow fair, safe and open access to health care for patients while preserving the doctor-patient relationship. It also needs to fight against deceptive practices such as re-selling contact lenses without consideration for the patient’s prescription and set the highest standards in new technologies like telehealth. Congress must ensure that advances in telehealth uphold the medically-recognized standard of care and that these advances do not create a false sense of security or delay essential, sight-saving treatment of more complex diseases.The danger of using counterfeit and dangerous prescription contact lenses is one that can be easily avoided through legislation protecting patient safety and the patient-doctor relationship. Eye care doesn’t have to be scary, but we must urge Congress to pass legislation that ensures the safety of all Americans who use contact lenses.Dr. Jim DeVleming is an American Optometric Association Board Trustee and Member of the Health Care Alliance for Patient Safety.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}