{"id": "Overnight Defense — Presented by Raytheon — Trump's Armistice Day trip marked by controversy | US ends aerial refueling to Saudi coalition in Yemen | Analysts identify undeclared North Korean missile bases", "paragraph": "Happy Monday and welcome to Overnight Defense. I'm Rebecca Kheel, and here's your nightly guide to the latest developments at the Pentagon, on Capitol Hill and beyond. THE TOPLINE: It's been a relatively quiet Veterans Day in Washington after President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE's tumultuous weekend trip to Paris to mark the 100th anniversary of the end of the World War I.Trump ignited a firestorm Saturday when he decided not to go to an American cemetery in France as originally scheduled.The White House blamed rain preventing Marine One from taking him to Aisne-Marne American Cemetery and later added that Trump thought taking a motorcade to the cemetery in northern France would be disruptive.The decision to skip the cemetery visit was blasted by people ranging from former Obama administration officials to Winston Churchill's grandson.Other tensions: Aside from that dustup, the trip also laid bare tensions between Trump and U.S. allies.Almost immediately after landing in Paris on Friday evening, Trump tweeted a criticism of French President Emmanuel Macron responding to comments Macron made a day earlier.On Sunday, Trump arrived at the Armistice Day ceremony at the Arc de Triomphe separately from other world leaders who attended the event. The White House said Trump took a bus from the Élysée Palace instead of walking down the Champs-Élysées with the other leaders \"due to security protocols.\"Then, during the ceremony, Macron took what appeared to be a thinly veiled shot at Trump, saying that \"patriotism is the exact opposite of nationalism.\"\"Nationalism is a betrayal of patriotism,\" Macron said. \"By saying our interests first ... we erase what a nation holds dearest, what gives it life, what gives it grace, and what is essential: its moral values.\"What Trump did visit: Trump skipped the Saturday cemetery visit, but he did make his scheduled visit Sunday to the Suresnes American Cemetery outside of Paris.There, he paid tribute to American and French service members who died in World War I.\"The American and French patriots of World War I embody the timeless virtues of our two republics. Honor and courage. Strength and valor. Love and loyalty, grace and glory,\" Trump said.\"It is our duty to preserve the civilization they defended and to protect the peace they so nobly gave their lives to secure one century ago,\" he added.Who Trump spoke to: The other closely watched aspect of the Paris trip was how much interaction Trump had with Russian President Vladimir Putin, who was also in Paris for the Armistice Day commemorations.Leading up to the trip, Trump and the Kremlin had been contradicting each other on whether he and Putin would talk. Trump said nothing was scheduled, while the Kremlin said the two would speak briefly during a lunch Sunday.In a statement, the White House said Trump discussed \"key issues\" with Putin, Macron and German Chancellor Angela Merkel during the lunch with world leaders in Paris.\"The leaders discussed a variety of issues, including the INF (nuclear treaty), Syria, trade, the situation in Saudi Arabia, sanctions, Afghanistan, China, and North Korea,\" White House press secretary Sarah Huckabee Sanders said in a statement. \"They had very good and productive discussions during the two-hour lunch.\"Sanders's statement contradicts claims from Kremlin spokesman Dmitry Peskov, who told Russian news agency Interfax that Trump and Putin did not discuss the nuclear treaty. Trump has said he intends to withdraw from the Cold War-era agreement.While in Paris, Trump also spoke with Turkish President Recep Tayyip Erdoğan about the killing of U.S.-based journalist and Saudi critic Jamal Khashoggi. The conversation happened after Erdogan said publicly for the first time that Turkey has audio of Khashoggi's dying moments and has shared it with the Americans. SPONSORED CONTENT - RAYTHEONAn intuitive, fully open intelligence platform, Raytheon’s FoXTEN connects soldiers to multiple intelligence sources—facilitating better, faster tactical decision-making in the field. Learn more. US ENDS SAUDI REFUELING: The other big foreign policy story of the weekend was the Friday night announcement from Saudi Arabia and the United States that the U.S. military would no longer provide aerial refueling for aircraft from the Saudi-led coalition fighting in Yemen's civil war.The Saudis and the Trump administration framed the announcement as the Saudis' decision, saying they now have the ability to do aerial refueling on their own.\"We support the decision by the Kingdom of Saudi Arabia, after consultations with the U.S. government, to use the coalition's own military capabilities to conduct inflight refueling in support of its operations in Yemen,\" Defense Secretary James MattisJames Norman MattisOvernight Defense — Presented by Raytheon — Lawmakers struggle with how to punish Saudi Arabia | Trump regrets not visiting Arlington for Veterans Day | North Korea deports detained American Ousted Bolton aide says it was 'an honor' to serve Trump administration Macron’s 'Euro-army' is an idea whose time has come MORE said in a statement. \"The U.S. will also continue working with the coalition and Yemen to minimize civilian casualties and expand urgent humanitarian efforts throughout the country.\"But the announcement came after mounting pressure from U.S. lawmakers over concerns about U.S. complicity in a spiking civilian death toll largely blamed on Saudi airstrikes.For critics, good, but not enough: Those who have been most vocal about ending U.S. support for the Saudi campaign in Yemen said Friday's announcement was a long overdue, positive step.But they also said the United States must end all support to the coalition. The military provides other logistics and intelligence to the coalition, and the United States sells the Saudis billions of dollars in weapons.\"By finally ending refueling missions for Saudi bombers, the Trump administration is admitting our joint operation in Yemen has been a disaster,\" Sen. Chris MurphyChristopher (Chris) Scott MurphySenators return to Washington intent on action against Saudis Howard Dean: Democratic Party getting younger as GOP gets ‘older and whiter’ We need a bipartisan issue to unite us. Saudi Arabia is that issue MORE (D-Conn.) said in a statement. \"So why only cut off refueling support? Why are we still helping the Saudis with targeting? Why are we still selling them the bombs at a discount? Now that it's no longer a secret that the war in Yemen is a national security and humanitarian nightmare, we need to get all the way out. I will join several other colleagues to introduce a resolution in the coming weeks to do just that.\"\"Ending U.S. refueling of Saudi-led coalition aircraft is an encouraging step towards ending U.S. involvement in the Yemen civil conflict,\" Democratic Reps. Adam SmithDavid (Adam) Adam SmithPentagon official: Trump's Space Force could cost up to  billion Trump faces new hurdles on foreign policy Overnight Defense — Presented by Raytheon — Trump's Armistice Day trip marked by controversy | US ends aerial refueling to Saudi coalition in Yemen | Analysts identify undeclared North Korean missile bases MORE (Wash.), Ro KhannaRohit (Ro) KhannaSanders rolls out bill aimed at getting Walmart to raise wages HQ2 deal brings new scrutiny on Amazon Overnight Defense — Presented by Raytheon — Mattis defends border deployment during visit to troops | Bolton aide exits WH after clash with first lady | House blocks Yemen war resolution | Report warns of erosion in US military superiority MORE and Mark PocanMark William PocanThe Hill's Morning Report — Presented by T-Mobile — Democratic race for Speaker turns nasty McConnell pens editorial calling for bipartisanship after Dems take House Colorado's first black congressman-elect says midterms signal positive future  MORE (Wis.) said in a joint statement. \"The Yemeni people are facing the world's gravest humanitarian crisis. The U.S. should be squarely focused on alleviating this crisis and doing everything we can to encourage an end to the civil conflict that has exacerbated the dire humanitarian situation. Picking sides and supporting the Saudi-coalition is contrary to those goals. In addition to ending refueling efforts, the United States should pause sales of offensive weapons to Saudi Arabia.\"The trio added that Congress should pass their bill to end all military support to the coalition in the lame duck session.More than two-dozen former Obama administration officials said in an open statement Sunday that all support must end. While the Obama administration started support for the coalition, the former officials said that \"unfortunately, our approach did not succeed in limiting and ultimately ending the war\" and that Trump made the situation worse by \"removing restrictions we had put in place.\"\"The war in Yemen is a full-blown crisis,\" they wrote. \"We unsuccessfully tried conditional support to the coalition. This administration has demonstrated the folly of unconditional support. Now, we must cease support altogether.\" ONE WAY TO MARK VETERANS DAY?: A Republican lawmaker who was defeated in last week's midterm elections wrote an op-ed for the Wall Street Journal blaming the late Sen. John McCainJohn Sidney McCainCindy McCain takes aim at Trump: We need a strong leader, 'not a negative Nancy' McCain would have said ‘enough’ to acrimony in midterms, says Cindy McCain Trump nominates Jim Gilmore for ambassador post MORE (R-Ariz.) for the GOP losing its majority in the House.Rep. Jason LewisJason Mark LewisMinnesota New Members 2019 Overnight Health Care — Presented by The Partnership for Safe Medicines — Medicaid expansion gets extra boost from governors' races | Utah's expansion to begin April 1 | GOP lawmaker blames McCain for Dems winning House Overnight Defense — Presented by Raytheon — Trump's Armistice Day trip marked by controversy | US ends aerial refueling to Saudi coalition in Yemen | Analysts identify undeclared North Korean missile bases MORE (R-Minn.) said McCain is to blame because of his vote against the Republican effort to repeal ObamaCare.The op-ed was published Sunday, Nov. 11, the traditional day of Veterans Day (it was observed Monday this year because the date fell on Sunday).McCain was captured during the Vietnam War and held prisoner for five years, during which he was also tortured. He died in August after being diagnosed with brain cancer a little more than a year earlier. HIDDEN MISSILES: A Washington-based think tank said Monday it has identified 13 of an estimated 20 undeclared missile operating bases in North Korea.The bases, which researchers at the Center for Strategic and International Studies' Beyond Parallel identified using commercial satellite imagery, are scattered throughout North Korea and can be used for all classes of missiles, the report said.The first of the 13 bases Beyond Parallel released information on was Sakkanmol, a base for short-range ballistic missiles and one of the closest to the border between North and South Korea.\"North Korea's decommissioning of the Sohae satellite launch facility, while gaining much media attention, obscures the military threat to U.S. forces and South Korea from this and other undeclared ballistic missile bases,\" the report said.Surprising?: Despite Trump's declarations that North Korea is \"no longer a nuclear threat,\" North Korean leader Kim Jong Un never agreed to stop producing missiles.Indeed, in his 2018 New Year's address, he promised the exact opposite.\"The nuclear weapons research sector and the rocket industry should mass-produce nuclear warheads and ballistic missiles,\" Kim said.It's a statement some alluded to in their analysis Monday.\"It is NOT deception,\" tweeted MIT professor and nuclear proliferation expert Vipin Narang, reacting to the New York Times headline about the report. \"Kim literally ordered ballistic missiles to be mass produced on New Year's day 2018. He never offered to stop producing them, let alone give them up. Ever. He is doing exactly what he said he was going to do.\"Why it still matters: One of the sticking points in negotiations has been that the United States wants North Korea to provide a full accounting of its nuclear and missile program, including declaring all sites such as the ones identified in the report.The findings underscore the difficulty the United States faces in negotiating with North Korea as the bases would \"presumably have to be subject to declaration, verification and dismantlement in any final and fully verifiable denuclearization deal,\" the report said.Latest trouble: The report is just the latest example of difficulties the Trump administration has been having with North Korea.Over the weekend, The Hill's Ellen Mitchell took a look at some of the other recent setbacks, including Secretary of State Mike PompeoMichael (Mike) Richard PompeoOvernight Defense — Presented by Raytheon — Lawmakers struggle with how to punish Saudi Arabia | Trump regrets not visiting Arlington for Veterans Day | North Korea deports detained American Corker: 'A price needs to be paid' for Khashoggi's murder White House eyeing ways to remove Erdoğan foe Gülen from US: report MORE's canceled meeting and Pyongyang's threat to restart nuclear development if the United States doesn't lift sanctions.Catch up on that story here. ON TAP FOR TOMORROWMichael Griffin, under secretary of Defense for research and engineering, will speak about \"Reenergizing the Missile Defense Enterprise\" at 9:30 a.m. at the Center for Strategic and International Studies. https://bit.ly/2z8o24cThe Foundation for the Defense of Democracies will host \"The Battlefield of Today and Tomorrow: Cyber-Enabled Economic Warfare\" conference starting at 10 a.m. Speakers will include B. Edwin Wilson, deputy assistant secretary of Defense for cyber policy. Livestream at: https://bit.ly/2qKlWmE. Former director of national intelligence James ClapperJames Robert ClapperOvernight Defense — Presented by Raytheon — Trump's Armistice Day trip marked by controversy | US ends aerial refueling to Saudi coalition in Yemen | Analysts identify undeclared North Korean missile bases Pipe bomb suspect to be held without bail CIA's ‘surveillance state’ is operating against us all MORE will speak at 3 p.m. at the Carnegie Endowment for International Peace. https://bit.ly/2RRcJEy ICYMI-- The Hill: Divided Congress to clash over Space Force, nuclear arsenal-- The Hill: Republicans jockey for top GOP spot on House Foreign Affairs Committee-- The Hill: Pompeo reaffirms to Saudi crown prince US will hold Khashoggi's killers 'accountable'-- The Hill: US Army pays tribute to Stan Lee: 'Rest in peace, Soldier'-- The Hill: Opinion: Standing against tyrants remains our burden, a century after 'Great War'-- The New York Times: 'Tell Your Boss': Recording is seen to link Saudi crown prince more strongly to Khashoggi killing-- The New York Times: Taliban slaughter elite Afghan troops, and a 'safe' district is falling-- Reuters: South Korea-U.S. military drills violate agreements: North Korea mediaView the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}