{"id": "Dems wonder if Sherrod Brown could be their magic man", "paragraph": "Democrats say Sen. Sherrod BrownSherrod Campbell BrownThe Hill's 12:30 Report — Sponsored by Delta Air Lines — White House to 'temporarily reinstate' Acosta's press pass after judge issues order | Graham to take over Judiciary panel | Hand recount for Florida Senate race Budowsky: Sherrod Brown should run in 2020 Sherrod Brown: If Stacey Abrams doesn't win, Republicans 'stole it' MORE is a potential 2020 candidate who could thread the needle and unite a party divided by people debating whether it’s better to move to the left or the center to win back the White House.Brown is the kind of politician who can appeal to both sides in that debate, which has defined the 2020 conversation in Democratic circles so far.He’s a progressive who has embraced progressive social views on gay rights and abortion, who just won reelection in Ohio — which increasingly is seen as Trump territory.Brown might be best known for his liberal economic views, including support for a higher minimum wage and opposition to the Trump tax law. But on trade, he’s long espoused positions similar to Trump’s, which have been popular with his political base.He’s got the image of a somewhat rumpled local politician who fits in well with the industrial Midwest, perhaps the key geographic area in the next presidential race.If a Democratic candidate can take back Michigan, Pennsylvania and Wisconsin, the three states central to Trump’s victory in 2016, they’d win back the White House assuming they carry the other states won by Hillary ClintonHillary Diane Rodham ClintonTexas history curriculum to emphasize that slavery played 'central role' in Civil War Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Texas education board approves restoring Hillary Clinton in history curriculum MORE. “Those states will be critical,” said Sen. Jack ReedJohn (Jack) Francis ReedOvernight Defense — Presented by Raytheon — Border deployment 'peaked' at 5,800 troops | Trump sanctions 17 Saudis over Khashoggi killing | Senators offer bill to press Trump on Saudis | Paul effort to block Bahrain arms sale fails Senators introduce bill to respond to Khashoggi killing Study: US has spent nearly T on war since 9/11 MORE (D-R.I.), who said Brown’s win was a shot in the arm that should be credited to the candidate’s specific brand of politics.“Sherrod’s victory shows a Democrat, a progressive Democrat did very, very well,” he said. “But it’s a function of more than campaign platform. It’s also the person.” When it comes to taking on Trump, a candidate like Brown could be the solution, Democrats say. “In many respects he provides the perfect antidote to President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE,” said Democratic strategist Jim Manley, who got to know Brown when he served in the Senate for then-Majority Leader Harry ReidHarry Mason ReidNevada New Members 2019 Meet the lawyer Democrats call when it's recount time Cortez Masto poised to become DSCC chair MORE.“He’s a proud progressive but he doesn’t utilize the harsh rhetoric that some on the left use,” Manley said. “That’s the difference.”In an interview with The New York Times this week, Brown acknowledged that he is “thinking” about running for president. He told the newspaper that he and his wife, the journalist Connie Schultz, “have been overwhelmed by the number of people that have come forward and said ‘You’ve got to run. You have the right message. You come from the right state.’ ” Those who know Brown well say he was never interested in a White House bid.One source, however, said the senator was “slightly disappointed” he wasn’t selected by Hillary Clinton as her running mate in 2016.“He thought he could have added something to the ticket,” the source said. “I think he was right.” Brown could have a future as a vice presidential candidate again, though there would surely be fears in Democratic circles that it would risk losing a seat to Republicans in the closely divided Senate.  The incoming governor of Ohio, Mike DeWine, is a Republican.More recently, particularly after the controversies surrounding the Trump presidency, Brown began to give a White House run more thought, associates say. “His focus was always on winning re-election but he was definitely giving it a lot of thought at the same time and why not?” said one Democrat who discussed the topic with the senator. “I think he saw how Trump won and that’s his constituency. He gets them and they get him.”At a time when Democrats are struggling to rally around a unifying message for the party, Democrats keep pointing to Brown’s economic vision, one they say worked well in his reelection bid. Ben LaBolt, the Democratic strategist and longtime Obama spokesman who worked for Brown, said that message can easily be applied to a 2020 campaign.  “…He has a vision for how to make sure good paying jobs that allow you to support your family will be created not just on the coasts but throughout the country,” LaBolt said.To that point, Sen. Martin HeinrichMartin Trevor HeinrichHeinrich wins reelection to Senate in New Mexico Hillicon Valley: Official warns midterm influence could trigger sanctions | UK, Canada call on Zuckerberg to testify | Google exec resigns after harassment allegations | Gab CEO defends platform | T-Mobile, Sprint tailor merger pitch for Trump Dem slams intel chief over classified response on Trump's Chinese election meddling claims MORE (D-N.M.) said Brown is an attractive candidate because of “his strength in rural communities” and his ability to connect with working-class voters. “The dignity of work is really fundamental to the DNA of the Democratic Party and when we consistently communicate that, we have a much broader appeal than when we don’t,” Heinrich said. “That’s Sherrod to a T.” If he does choose to run, Brown could be a rival to former Vice President Joe BidenJoseph (Joe) Robinette BidenEntrepreneur touts big solutions, endorsements in discussing presidential bid Avenatti ‘still considering’ presidential run despite domestic violence arrest Election Countdown: Florida Senate race heads to hand recount | Dem flips Maine House seat | New 2020 trend - the 'friend-raiser' | Ad war intensifies in Mississippi runoff | Blue wave batters California GOP MORE is he also enters the race.“Sherrod and Joe share a very similar lane,” said David B. Cohen, the assistant director of the Bliss Institute of Applied Politics at the University of Akron, adding that it would probably weigh on his decision if Biden entered the race. Like Biden, Brown is “not someone who is a bullet-point politician,” Cohen said. “He doesn’t poll before he opens his mouth. He has a plain way of speak, he’s consistent and people respect him for that.” Brown would also likely face a number of colleagues if he chooses to run for the White House.Among the senators thought to be considering bids are fellow Democratic Sens. Elizabeth WarrenElizabeth Ann WarrenElection Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Entrepreneur touts big solutions, endorsements in discussing presidential bid Warren, 2020 Dems target private immigration detention center operators MORE (Mass.), Cory BookerCory Anthony BookerElection Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Booker to campaign for Dem in Mississippi Senate runoff Warren, 2020 Dems target private immigration detention center operators MORE (N.J), Kirsten GillibrandKirsten Elizabeth GillibrandWarren, 2020 Dems target private immigration detention center operators Hillicon Valley: Facebook reeling after NYT report | Dems want DOJ probe | HQ2 brings new scrutiny on Amazon | Judge upholds Russian troll farm indictments | Cyber moonshot panel unveils recommendations On The Money: Senior GOP senator warns Trump against shutdown | Treasury sanctions 17 Saudis over Khashoggi killing | HQ2 deal brings new scrutiny on Amazon | Senate confirms Bowman to Fed board MORE (N.Y.) and Kamala HarrisKamala Devi HarrisElection Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Booker to campaign for Dem in Mississippi Senate runoff On The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report MORE (Calif.), in addition to Sen. Bernie SandersBernard (Bernie) SandersAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural Entrepreneur touts big solutions, endorsements in discussing presidential bid Warren, 2020 Dems target private immigration detention center operators MORE (I-Vt.).  Asked this week if Brown would be a strong presidential candidate, Harris replied, “I love Sherrod. I think he’s fantastic.”“I think Sherrod will be good at whatever he chooses to do,” Harris said. She made sure to highlight that Brown invited her to campaign with him in Ohio. “We traveled up and down Ohio together and I’ve seen him in his state and he is well respected. He is a strong voice for labor and organized labor,” she added. “I think his voice is a very important voice in our caucus and in our country.”  View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}