{"id": "O'Rourke's rise raises hopes for Texas Dems down ballot", "paragraph": "DALLAS — The energy and enthusiasm behind Rep. Beto O’Rourke’s (D-Texas) Senate campaign is having a ripple effect down the ballot in deep-red Texas, giving Democrats a much-needed jolt in the battle to pick up seats in the House.While O’Rourke may end up losing to GOP Sen. Ted CruzRafael (Ted) Edward CruzDemocratic strategist warns Beto should be ‘careful’ with social media presence Hillary advisers battle over whether she’ll run in 2020 O'Rourke writes blog post describing a literal run from near the capitol to near the White House MORE, he could help Democrats in the House if his Senate bid significantly drives up turnout—particularly in three districts held by GOP Reps. Pete SessionsPeter Anderson SessionsTexas New Members 2019 Congress is going to make marijuana moves McCarthy defeats Jordan for minority leader in 159-to-43 vote  MORE, John CulbersonJohn Abney CulbersonTexas New Members 2019 Republicans must learn from the election mistake on immigration How will the 2018 midterms affect NASA space policy? MORE and Will HurdWilliam Ballard HurdElection Countdown: Florida Senate race heads to hand recount | Dem flips Maine House seat | New 2020 trend - the 'friend-raiser' | Ad war intensifies in Mississippi runoff | Blue wave batters California GOP Midterm results shake up national map Election Countdown: Lawsuits fly in Florida recount fight | Nelson pushes to extend deadline | Judge says Georgia county violated Civil Rights Act | Biden, Sanders lead 2020 Dem field in poll | Bloomberg to decide on 2020 by February MORE, who are all fighting for their political lives.Democrats haven’t won a statewide race in Texas since 1994, but O’Rourke, 46, has fueled liberal hopes of unseating Cruz, 47, through massive rallies, record-breaking fundraising and engagement with young voters - a phenomenon that some are calling \"Betomania.\" In doing so, O'Rourke is sparking a level of enthusiasm down the ballot that no other Democratic candidate including gubernatorial nominee Lupe Valdez has been able to generate in Texas.“He creates activity and interest that’s very hard to generate from down-ballot activity alone,” said Matt Angle, a veteran Democratic strategist in Texas and director of the Lone Star Project.The enthusiasm comes even as O'Rourke himself may end up unable to defeat the conservative firebrand. Though O'Rourke raised a record $38 million in the third fundraising quarter, recent polls have shown Cruz consistently building a lead in the statewide race.But an increased turnout could be enough to tip the races in smaller House districts, according to strategists.Mary Beth Rogers, who was campaign manager to the late Ann Richards, the last Democratic Texas governor, said O’Rourke will need to do about 5 to 6 points better than 2016 Democratic presidential nominee Hillary ClintonHillary Diane Rodham ClintonTexas history curriculum to emphasize that slavery played 'central role' in Civil War Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Texas education board approves restoring Hillary Clinton in history curriculum MORE did in some parts of the state in order to give a boost to some of the competitive House races.Other Democrats argue that some voters who traditionally vote straight-ticket Republican might be tempted to vote for O'Rourke – and in doing so could give a second look to other Democrats down the ballot.  Meanwhile, Democrats could choose straight-ticket voting, an option being pushed by the party that will be eliminated after the November election.The party is feeling especially good about their prospects in three districts that voted for Clinton in 2016 but also backed their Republican Congressmen.These House races also have another common thread: the Democrats running are all first-time candidates who have outraised their respective GOP challengers by at least $1 million in the past fundraising quarter.Democrats can still achieve the magic number of 23 seats for the House majority without flipping seats in Texas. But many view those districts as bellwethers that could serve as a barometer for the national political environment and prospects for a blue wave.Two of these seats, currently held by Culberson and Sessions, represent largely suburban districts including parts of big cities where demographics have greatly shifted over the years.Culberson’s Houston-area district has a growing Hispanic population, while Sessions’s north Dallas district has both a sizable Hispanic and African-American population.Culberson is running against Democratic attorney Lizzie Pannill Fletcher, while Colin Allred, a civil rights lawyer and former NFL player who worked in the Obama administration, is challenging Sessions, the chairman of the powerful House Rules Committee who didn’t even face a Democratic opponent in 2016.Recent New York Times/Siena polls show both races are in a dead heat, with the GOP incumbents holding slim leads that fall within the margin of error. Hurd also represents an expansive swing district, but unlike the other two races, he appears better positioned to hang on for a third term in a district that Democrats had occupied until 2014.The majority Hispanic district spans 800 miles along the U.S.-Mexico border from El Paso to San Antonio, a vast area that includes pockets of cities but also rural areas, making it more challenging for Democrats.Democrat Gina Ortiz Jones, a former Air Force intelligence officer, is still getting plenty of help from the national party, and she’d make history as the first Filipina-American elected to Congress should she win.But Jones is 15 points behind Hurd, according to a NYT/Siena poll earlier this month.Some Democrats even believe O’Rourke’s energy could help longer-shot races that President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE easily carried outside of Austin where Democrats have fielded strong challengers.GOP Rep. John CarterJohn Rice CarterRepublican John Carter holds off challenge from Dem combat veteran in Texas Combat veteran after GOP opponent says campaign is a 'war': ‘You don’t know s--- about war’  Election Countdown: One week from midterms, House battlefield expands MORE’s race against Democrat MJ Hegar garnered some national attention when Hegar’s ad about her military service went viral.Another one is the open-seat race for retiring GOP Rep. Lamar SmithLamar Seeligson SmithTexas New Members 2019 Pro-environment Democrats gain influence in Congress and states, but lose key GOP allies  Overnight Energy: Trump expects to weigh in on Zinke's future soon | EPA relaxes air permitting standard | House Science panel in for big changes | Update on midterm ballot measures MORE’s seat. Democrat Joseph Kopser, another military veteran, faces Republican Chip Roy, a former Cruz aide.But Republicans warned against expecting an O'Rourke-inspired blue wave. They expressed confidence about holding onto all three House seats because of the strong economy and conservative energy over the Supreme Court confirmation of Justice Brett KavanaughBrett Michael KavanaughThe Hill's 12:30 Report — Sponsored by Delta Air Lines — White House to 'temporarily reinstate' Acosta's press pass after judge issues order | Graham to take over Judiciary panel | Hand recount for Florida Senate race Graham set to take over Judiciary Leverage the new US International Development Finance Corporation to compete with China MORE – the same factors helping Cruz statewide.They also predict minority voters will not be as motivated to vote for Democrats because of low unemployment for Hispanics and African Americans in Texas.“They haven’t created the case for a wave here or nationally,” said George Seay, the former Texas chairman of Sen. Marco RubioMarco Antonio RubioHillary advisers battle over whether she’ll run in 2020 Rubio defends '3 point kick' analogy: 'You think everyone who follows politics knows what a field goal is?' Lawmakers to introduce bipartisan bill targeting China's treatment of Muslims MORE's (R-Fla.) presidential campaign.“There’s so much prosperity for so many demographic groups.”Plus, Republicans have their own star power on the campaign trail. Vice President Mike PenceMichael (Mike) Richard PenceTrump privately asking aides if Pence is loyal: report North Korea's Kim oversees new weapons test What is the end game with China? MORE and Donald Trump Jr.Donald (Don) John TrumpTrump Jr.'s India trip cost taxpayers nearly 0K: report Social media explodes over Avenatti arrest Mueller targets Stone in final push MORE have campaigned and fundraised for Sessions. And the president is holding a campaign rally in Houston on Monday for Cruz, which could also help elevate some House members.Ultimately, much could depend on how much O’Rourke can run up the score among Hispanic voters, who will be especially critical in the Sessions, Culberson and Hurd districts.An increase in Hispanic turnout, combined with other members such as college-educated women and moderate suburban voters frustrated by the president, could easily tip the scales to Democrats, observers said.“They’ll need him to be successful in the Hispanic community and suburban areas with college-educated white women,” said Brandon Rottinghaus, political science professor at the University of Houston. “Democrats can perform better than expected if they can get those folks out.”Such a coalition could spell doom for Republicans, even if it's not enough statewide to help O'Rourke prevail over Cruz.“If O’Rourke can get Democrats to polls to also pull the lever for the rest of the party, that helps Democratic candidates for Congress,” said Brendan Steinhauser, a GOP strategist who managed Sen. John CornynJohn CornynTrump’s backing may not be enough on criminal justice reform Congress should ban life without parole sentences for children  Senate GOP discussing Mueller vote MORE’s (R-Texas) 2014 race.“How much? I don’t know. Clearly with that kind of money and enthusiasm, it’s something we’re all thinking about and prepared for.”View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}