{"id": "Trump on false Kavanaugh accusation: 'How about the other ones?'", "paragraph": "President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE on Sunday appeared to suggest additional women who accused Supreme Court Justice Brett KavanaughBrett Michael KavanaughThe Hill's 12:30 Report — Sponsored by Delta Air Lines — White House to 'temporarily reinstate' Acosta's press pass after judge issues order | Graham to take over Judiciary panel | Hand recount for Florida Senate race Graham set to take over Judiciary Leverage the new US International Development Finance Corporation to compete with China MORE of sexual misconduct were lying after one woman admitted she fabricated a claim against the judge.\"A woman who accused then-Judge Kavanaugh of horrible, horrible crimes admitted that she never met Judge Kavanaugh, or Brett Kavanaugh or a Kavanaugh period. Never met him, never saw him and the act never happened, and it was a lie,\" Trump told supporters during a campaign rally in Georgia.The crowd burst into chants of \"lock her up\" as Trump stepped away from the podium and clapped.Though the president did not name the woman he was referring to, he appeared to be alluding to Judy Munro-Leighton. Senate Judiciary Committee Chairman Chuck GrassleyCharles (Chuck) Ernest GrassleyOvernight Health Care — Presented by The Partnership for Safe Medicines — GOP lawmaker pushes back on Trump drug pricing plan | Pfizer to raise prices on 41 drugs next year | Grassley opts for Finance gavel McConnell: Criminal justice bill unlikely this year  On The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report MORE (R-Iowa) said in a letter Friday to the FBI and Department of Justice that Munro-Leighton admitted to the committee on Nov. 1 that she previously lied about an allegation that Kavanaugh and a friend raped her in the backseat of a car. Investigators began looking into Munro-Leighton's allegations at the beginning of October, after she sent an email to the committee claiming she was the woman who sent an anonymous letter to Sen. Kamala HarrisKamala Devi HarrisElection Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Booker to campaign for Dem in Mississippi Senate runoff On The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report MORE (D-Calif.) in late September alleging Kavanaugh raped her.\"Under questioning by Committee investigators, Ms. Munro-Leighton admitted, contrary to her prior claims, that she had not been sexually assaulted by Judge Kavanaugh,\" Grassley wrote, asking for an investigation into her claims.On Sunday, Trump seized on the referral of Munro-Leighton's claim while conflating it with other claims that lawmakers have said were credible.\"I think this was number four,\" Trump said. \"And by the way, what about the other ones? How about the other ones, folks? Oh you’ll see others now.\"He blasted Democrats for their \"disrespectful\" treatment of Kavanaugh, and urged his supporters to recall the bitter confirmation fight ahead of Election Day on Tuesday.\"He could’ve lost a judgeship on a story that was made up,\" he said. \"And the way the Democrats treated him and us, you’ve got to get to the polls on Tuesday and you’ve got to vote.\"Munro-Leighton was one of four women to make sexual misconduct allegations against Kavanaugh. Grassley also referred accuser Julie Swetnick and her attorney, Michael Avenatti for investigation.No such referral has been made for Christine Blasey Ford or Deborah Ramirez.Ford testified before the Senate Judiciary Committee in September that Kavanaugh pinned her down and groped her during a party when the two were in high school. Ramirez alleged that Kavanaugh exposed himself to her during a party when the two were in college.The FBI conducted a supplementary background check into Ford's and Ramirez's allegations. Republican lawmakers said that the report did not turn up evidence of their claims.Kavanaugh denied all of the claims against him, and was confirmed, 50-48, by the Senate following a bitter confirmation process.Republicans have argued that their base will be drawn to the ballot box out of frustration with how Kavanaugh was treated during his confirmation process.Democrats, meanwhile, have maintained that their supporters will turn out in part out of anger that the judge was confirmed despite the sexual misconduct allegations.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}