{"id": "Kellyanne Conway refers to Hillary Clinton as 'queen of abortion' ", "paragraph": "White House counselor Kellyanne ConwayKellyanne Elizabeth ConwayKellyanne Conway changes Twitter bio amid media coverage of her husband's Trump criticism Conway’s husband: I’d rather move to Australia than vote for Trump Kellyanne Conway: Trump could shut down government for wall funding MORE attacked former Democratic presidential candidate Hillary ClintonHillary Diane Rodham ClintonTexas history curriculum to emphasize that slavery played 'central role' in Civil War Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Texas education board approves restoring Hillary Clinton in history curriculum MORE on Sunday, calling her “the queen of abortion.”Conway appeared on Fox News's “Fox & Friends” and said Democrats are not pushing the issue of abortion during this election cycle because “they tried that for so long.”“They tried it with the queen of abortion in 2016 and it backfired for them because so many women said, ‘Excuse me, you have to talk to me on all the issues,’” Conway said.“I think women in the suburbs, for all the talk about not liking tone, they know the difference between what offends them and what affects them,” she continued.Conway said female voters are affected by the economy, “law and order and respecting our military and veterans for the first time in years.”Yep, this happened: Kellyanne Conway calls Hillary Clinton \"The Queen of Abortion,\" which, as far as I know, outranks \"Commander of Cheese.\" pic.twitter.com/POHL2Es1W1A majority of Americans support Roe v. Wade, the  landmark Supreme Court decision that legalized abortion nationwide, according to a survey from Quinnipiac University Poll in June.The poll found that 63 percent of respondents agree with the court decision, compared with 31 percent who don't.A majority of Republicans — 58 percent — disagree with the court case but a majority of every other group by party, gender, education, age and racial group agrees with it, according to the poll.While access to abortion will remain a hot-button issue during Tuesday’s midterm elections, an analysis from BuzzFeed News last week found that the public opinion on abortion is not a binary issue.“I don’t think any polls out there accurately portray the way the U.S. population thinks about abortion,” Janine Beekman, an associate research scientist for the consulting and research firm Ipsos, told BuzzFeed News. “Abortion, more so than almost any other issue, is incredibly difficult to poll on.”Researchers told the outlet that there is a knowledge gap surrounding the issue of abortion and reproductive rights and it is unclear how that affects voting behavior.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}