{"id": "Press: Trumpism takes a thumping", "paragraph": "Like beauty, defeat, it seems, is in the eyes of the beholder. In 2006, Republicans lost 31 seats in the House of Representatives and George W. Bush called it a “thumping.” In 2010, Democrats lost 64 seats, and Barack ObamaBarack Hussein ObamaAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural Trump's take on midterms: ‘Epic' win in Senate, ‘better than other sitting Presidents’ in House NASA's carpool to Space Station is back on as Russian rocket Soyuz quickly returns to flight MORE called it a “shellacking.” In 2018, Republicans lost what looks like 37 seats, and Donald Trump called it a “near total victory.”Who’s he kidding? The man is delusional. By any measure, the results of the Nov. 6 midterm elections are a triumph for Democrats and a huge setback for Donald Trump and Trumpism. No spin, just the facts. Despite having to run in heavily GOP-gerrymandered districts, Democrats regained control of the House by winning as many as 37 seats. In addition, Democrats flipped at least seven governorships, won back control of seven state legislative chambers and flipped more than 370 state legislative seats.Even in the Senate, it looks like Republicans will end up with at most 52 seats (even though Trump crowed about winning 55). Given the disastrous map Democrats faced to begin with, that in itself is a small miracle. Plus, Democrats made up for losing North Dakota, Missouri, and Indiana by winning Nevada and, as looks more and more likely, Arizona — with Florida and Mississippi still to be decided, by recount or runoff. Overall, 13 million more people voted for Democrats than Republicans in Senate races.Democrats won one other all-important contest, too: fundraising. We’re used to Republican candidates raising more money than Democrats. Not this time. Democrats thumped Republicans in most House and Senate races — nowhere more than in Texas, where Beto O’Rourke hauled in a presidential eye-popping total of $70.2 million in small donations. Republicans feel so outgunned that Senate Leader Mitch McConnellAddison (Mitch) Mitchell McConnellAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural McConnell: Criminal justice bill unlikely this year  On The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report MORE (R-Ky.) complained to GOP donors this week: “The heart of the problem is Act Blue” — which funneled more than $700 million in small donations to Democratic House and Senate candidates.As important as the Democrats’ success in congressional races were the pickups for governor: not only the number of governor’s races won, but where.In addition to the existing blue walls on the East Coast and West Coast, Democratic governors in Illinois, Michigan, Wisconsin and Kansas means there’s now also a blue wall across the heartland. Democrats also achieved a trifecta — control of the governor and both house of the state legislature — in six more states: Nevada, New Mexico, Colorado, Illinois, New York and Maine. Which will give Democrats a huge advantage in the 2020 presidential election and reapportionment in 2021.But for Democrats the biggest winners of all were women. In the new Congress, the ranks of Democratic women will grow to more than 100, while the number of Republican will shrink to about 13. Even more significant are who those women represent: the first two Muslim women in Congress; the first two Native American women; the first two Latinas to represent Texas; the first African-American women to represent Connecticut and Massachusetts; new female members from the red states of Kansas, Iowa, Florida, Texas, Georgia and Oklahoma. Congress will never look, or be, the same.Add it all up and, no matter what President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE claims, Democrats can rightfully call results of the 2018 midterms a “Blue Wave.” From top to bottom, this election was, by his own admission, a referendum on Trump. For the first time, voters had a chance to express whether they like what they’ve seen so far from Trump. They gave him a big thumbs down.Press is host of “The Bill Press Show” on Free Speech TV and author of “From the Left: A Life in the Crossfire.”View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}