{"id": "Axl Rose: Guns N' Roses has told Trump not to play our music at his rallies", "paragraph": "Guns N' Roses frontman Axl Rose tore into President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE on Sunday night for playing the band's music at his political rallies after they formally requested him not to. Rose took to Twitter to vent his frustrations about his music being played at Trump-associated events. \"Unfortunately the Trump campaign is using loopholes in the various venues’ blanket performance licenses which were not intended for such craven political purposes, without the songwriters’ consent,\" Rose wrote. \"Can u say 'shitbags?!' ”Unfortunately the Trump campaign is using loopholes in the various venues’ blanket performance licenses which were not intended for such craven political purposes, without the songwriters’ consent.Can u say “shitbags?!”Rose said that he thought it was \"ironic\" that Trump supporters were listening to \"anti Trump music\" at his campaign rallies. \"But I don’t imagine a lot of ‘em really get that or care,\" he added.Personally I kinda liked the irony of Trump supporters listening to a bunch of anti Trump music at his rallies but I don’t imagine a lot of ‘em really get that or care.Several musicians have instructed Trump not to use their songs during his rallies, including Aerosmith's Steven Tyler, Twisted Sister, Elton John and members of Prince's estate. Pharrell Williams reportedly sent Trump a cease and desist warning after his song, \"Happy,\" was played at a rally just hours after the Pittsburgh synagogue shooting. The rock icon, who is currently also the lead singer of AC/DC, has been a frequent critic of the president on social media. He continued to call out the Trump administration, the majority of the Republicans in Congress and their donors, saying they are doing the nation a “disservice.”“We have an individual in the WH that will say [and] do anything [without] regard for truth, ethics, morals or empathy of any kind, who says what’s real is fake [and] what’s fake is real.”We have an individual in the WH that will say n’ do anything w/no regard for truth, ethics, morals or empathy of any kind, who says what’s real is fake n’ what’s fake is real.Trump will “stop at nothing” to have power and feeds off the “anger [and] resentment he sows 24/7 while constantly whining how whatever doesn’t go his way is unfair,” Rose wrote.Who will stop at nothing 4 power feeding off the anger n’ resentment he sows 24/7 while constantly whining how whatever doesn’t go his way is unfair.He calls for Americans to “wake up [and] put and end [to] this nonsense now.”Rose urged voters last week to elect Democrats in the midterm elections.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}