{"id": "Trump rally chants 'lock her up' after explosive device sent to Clinton", "paragraph": "President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE's supporters chanted “lock her up” ahead of his arrival at a rally in Mosinee, Wis., on Wednesday evening, just hours after the Secret Service said it found \"potential explosive devices\" in mail sent to former Secretary of State Hillary ClintonHillary Diane Rodham ClintonTexas history curriculum to emphasize that slavery played 'central role' in Civil War Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Texas education board approves restoring Hillary Clinton in history curriculum MORE at her home in Chappaqua, New York.Video of the rally showed the crowd chanting the phrase as Sen. Leah Vukmir (R) delivered remarks shortly before Trump’s scheduled appearance.Tonight: Trump crowd chants \"lock her up\" after bomb mailed to Hillary Clinton pic.twitter.com/X4ZiqONhH3The chant, which has become a regular feature of Trump's rallies since his presidential campaign, came hours after authorities discovered potential explosive devices had been sent to Clinton’s New York residence, in addition to other Democrats including former President Obama, Rep. Maxine WatersMaxine Moore WatersDem women rally behind Pelosi Pelosi, potential challenger Fudge hold 'candid' discussion Marcia Fudge under spotlight as Pelosi Speaker fight heats up MORE (Calif.) and former Attorney General Eric HolderEric Himpton HolderEric Holder endorses Pelosi for Speaker Poll: Biden and Sanders lead 2020 Dem field, followed by Beto O'Rourke Trump's shortlist for attorney general takes shape MORE.Each of those targeted by the suspicious packages have been criticized repeatedly by Trump, who condemned the attempted attacks as “abhorrent” during remarks from the White House East Room on Wednesday afternoon.“We are extremely angry, upset, unhappy about what we witnessed this morning and we will get to the bottom of it,” he said.White House press secretary Sarah Huckabee Sanders also said the president and administration officials are monitoring the developments.\"Our condemnation of these [despicable] acts certainly includes threats made to CNN as well as current or former public servants. These cowardly acts are unacceptable and wont be tolerated,\" she tweeted.Clinton and other bipartisan lawmakers called for officials to dial back their rhetoric in response to the attempted attacks.Trump was stumping for Wisconsin Gov. Scott Walker (R) in his reelection bid against state schools superintendent Tony Evers (D), and Leah Vukmir, who is challenging Wisconsin Sen. Tammy BaldwinTammy Suzanne BaldwinSchumer reelected as Senate Democratic Leader Number of LGBT lawmakers in Congress hits double digits Senate GOP readies for leadership reshuffle  MORE (D).Walker is battling Evers in a tight race, which RealClearPolitics has dubbed a \"toss-up.\" A RealClearPolitics average of polling gives Evers a 3.6 percentage point edge in the race. Baldwin has a double-digit lead over Vukmir, according to a recent Marquette Law School survey of likely voters.--Updated on Oct. 25 at 7:33 a.m.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}