{"id": "Senate Finance chair: Trump's new tax cut 'highly unlikely' this year", "paragraph": "Senate Finance Committee Chairman Orrin HatchOrrin Grant HatchGinsburg attends Medal of Freedom ceremony amid recovery from fall Utah New Members 2019 Congress braces for high-drama lame duck MORE (R-Utah) said Wednesday that it's \"highly unlikely\" the Senate would vote by the end of the year on a new tax cut proposal teased by President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE. \"I think it can but it would take a real monumental effort to get it through, no question. But it's always taken a monumental effort, and a lot depends on the political climate and, as you know, I've seen miracles happen before,\" Hatch said, when asked if the floated tax proposal could pass. Pressed if thought there could be a vote during the lame-duck session, Hatch added: \"You can't count out the Congress. …[But] it would be highly unlikely.\" Trump said earlier this week that he would push for a vote on a second round of tax cuts after the midterm elections that will include a 10-percent reduction for middle-class Americans.\"We're doing it now for middle-income people. This is not for business, this is for [the] middle,\" Trump told reporters at the White House, adding that \"we'll do the vote after the election.\"As chairman of the Senate Finance panel, Hatch, who is retiring after this Congress, would be responsible for guiding an tax bill through the chamber this year. He said he has not spoken to Majority Leader Mitch McConnellAddison (Mitch) Mitchell McConnellAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural McConnell: Criminal justice bill unlikely this year  On The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report MORE (R-Ky.), who would be responsible for scheduling floor time, about a potential vote. Trump's second tax cut proposal, following a reform bill he signed in December, appeared to catch both Congress and even his own aides off guard when he initially suggested it would come up before the November election. Congress is currently out of session until Nov. 13. When they return to Washington, they still need to resolve funding for parts of the government — including a looming fight over Trump's U.S.-Mexico border well. House Ways and Means Committee Chairman Kevin BradyKevin Patrick BradyGOP lawmaker pushes back on Trump drug pricing proposal  Tax law failed to save GOP majority Overnight Health Care — Presented by The Partnership for Safe Medicines —  Juul halts retail sales for most flavored e-cigs | CDC confirms 90 cases of rare polio-like illness | Physicians push back on Trump plans to redefine gender  MORE (R-Texas) said Tuesday that the House would work with Trump on a new round of tax cuts if Republicans keep control of both chambers in the midterms next month.Neither Brady nor Trump discussed how to finance the tax cuts. The nonpartisan Congressional Budget Office projected that the 2017 GOP law would add $1.9 trillion to the deficit over a decade.Hatch, speaking with reporters in the Dirksen Senate Office Building,  declined to comment on the specifics of the potential proposal, saying he has a \"general knowledge\" but needed to \"get into more details\" before talking about it. He declined to specifically say if he had spoken with Trump about the proposal, noting that they \"talk all the time.\" Asked if there is currently a tax cut proposal on the table, Hatch added, \"I think there will be.\"\"It will come right to me,\" he told reporters, \"so I'll be doing my best not to mess it up.\" View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}