{"id": "Biden: American values being 'shredded' under Trump", "paragraph": "Former Vice President Joe BidenJoseph (Joe) Robinette BidenEntrepreneur touts big solutions, endorsements in discussing presidential bid Avenatti ‘still considering’ presidential run despite domestic violence arrest Election Countdown: Florida Senate race heads to hand recount | Dem flips Maine House seat | New 2020 trend - the 'friend-raiser' | Ad war intensifies in Mississippi runoff | Blue wave batters California GOP MORE ripped President Trump in Las Vegas on Saturday, saying that American values “are being shredded by a president who’s all about himself.”Biden made a speech to a local union right before Trump took the stage for a campaign rally in Elko, Nev., to boost Sen. Dean HellerDean Arthur HellerCortez Masto named Dem Senate campaign chairwoman Nevada New Members 2019 Election Countdown: Lawsuits fly in Florida recount fight | Nelson pushes to extend deadline | Judge says Georgia county violated Civil Rights Act | Biden, Sanders lead 2020 Dem field in poll | Bloomberg to decide on 2020 by February MORE (R-Nev.) and Republican gubernatorial candidate Adam Laxalt. Biden said the U.S. was founded “on an idea, the American idea, basic fundamental decency, and it’s being shredded.” “But my God, think of what’s going on now,” he said, adding that those values “are being shredded by a president who’s all about himself. It’s all about Donald.”Biden also took a shot at the Republican Party at large, saying that their dedication to political success superseded their love of country.“Because of gerrymandering and unlimited spending” the GOP is “in fact choosing party over their country,” he said. Biden and Trump have long feuded with each other, with Biden saying in October 2016 “I'd like to take himself behind the gym if I were in high school.”Trump has long mocked the comment and slammed the former vice president Saturday, joking about his past unsuccessful presidential runs and calling him “Sleepy Joe Biden” and “Creepy Joe.” Biden is known to be considering a presidential run against Trump in 2020. Should he run, Biden would likely join a crowded field of Democrats seeking to prove their anti-Trump bona fides to a political base that that is largely animated by opposition to the president.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}