{"id": "Overnight Defense: Pentagon expects to send more troops to border | Mattis says Khashoggi, Yemen 'separate' issues | Defense firms predict only hundreds of jobs from Saudi arms deal", "paragraph": "Happy Tuesday and welcome to Overnight Defense. I'm Ellen Mitchell, and here's your nightly guide to the latest developments at the Pentagon, on Capitol Hill and beyond. CLICK HERE to subscribe to the newsletter. THE TOPLINE: The Pentagon on Tuesday said the 5,200 troops to be sent to the border beginning this week is a number that is expected to rise.\"What I can confirm is there will be additional force over and above the 5,239, the magnitude of that difference I don't have an answer for you,\" U.S. Northern Command and North American Aerospace Defense Command head Gen. Terrence O'Shaughnessy told reporters at the Pentagon.O'Shaughnessy added that the final number of troops is \"undetermined,\" and will change as the Pentagon \"refine the requests\" from the Department of Homeland Security and Customs and Border Patrol (CBP).The cost of the deployment \"is unknown at this time.\"What we already knew: O'Shaughnessy announced Monday that the U.S. military will send more than 5,200 active duty troops to the border in Texas, Arizona and California as part of Operation Faithful Patriot. He noted then it was the \"just the start of this operation.\"What the forces will include: A little more than 1,000 troops are already in place in Texas. But O'Shaughnessy said Tuesday \"that number is literally, as we speak, changing because you have additional forces that are moving in today to Texas.\"An eventual 1,800 troops from seven different bases will reach Texas \"in days,\" 870 of which will be part of the headquarters there that will be in charge of command and control, he said.   Thousands of additional reserve forces are on hand to be sent to the border.Why they're being sent: President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE last week ordered the Pentagon to move forward on the troop deployment in response to a shrinking caravan of Central Americans that he has portrayed as a threat to national security.In a Monday tweet Trump called the caravan an \"invasion\" full of \"Many Gang Members and some very bad people,\" and has also claimed Middle East terrorists are among the group.O'Shaughnessy would only say that Operation Faithful Patriot is meant to \"secure the border.\"When pressed by reporters, O'Shaughnessy said the Pentagon has viewed the caravan as \"different than what we've seen in the past.\"He said it was \"clearly an organization at a higher level than we have seen before,\" but would not provide additional details.Will the military come into contact with the migrants?: Under the Posse Comitatus Act federal troops are mostly prohibited from engaging in domestic law enforcement activities.O'Shaughnessy stressed that the troops will support CBP agents already at the border as part of Operation Secure Line.\"CBP personnel are absolutely the primary and principle members that will be handling specifically the migrants,\" he said.He acknowledged, however, that \"there could be incidental interaction between our military members and migrants and other personnel that may be in that area.\"To address this \"we are making sure our soldiers, our Marines are going to be fully trained on how to do that interaction - they are going to understand the rules for that interaction.\"And Mexico deploys its own forces: Mexico has deployed hundreds of police, helicopters and boats to its southern border with Guatemala on Monday in an attempt to stop the approaching immigrant caravan from entering illegally.\"Members of this group are much more violent and aggressive\" than the earlier immigrants who are now crossing southern Mexico, the head of Mexico's migration agency, Gerardo Elías García, told The Wall Street Journal.The news comes one day after violent clashes at the border between immigrants and Mexican police, in which one Honduran man reportedly died.The Mexican ambassador to the U.S., Gerónimo Gutiérrez, said last week that Mexico would enforce its borders to the best of its ability, with as little violence as possible. DEFENSE COMPANIES PREDICT JUST HUNDREDS OF NEW JOBS FROM SAUDI DEAL: President Trump's $110 billion arms deal package with Saudi Arabia - a sale he has said in recent weeks would create 500,000 new defense jobs - is estimated to produce only hundreds of new positions at best at the five major U.S. defense firms, Reuters reported on Tuesday.Internal Lockheed Martin documents seen by the news service predict that the deal would create fewer than 1,000 positions at the defense giant, which could potentially deliver about $28 billion of equipment as part of the larger sale.Instead, defense companies are predicting there will be a more significant growth in Saudi Arabian jobs with only small adds to the U.S. workforce.Less than 1,000 at Lockheed, Raytheon: Lockheed, for example, predicts the sale could create almost 10,000 new jobs in Saudi Arabia. Its 18,000 existing U.S. workers would only be sustained, but that hinges on all promised deals following through.Raytheon, meanwhile, could sustain about 10,000 U.S. jobs, with only a small percentage of new jobs created if the Saudi order was completed.Should the full deal go through, only 20,000 to 40,000 current U.S. workers could be involved in producing the Saudi equipment, and only 500 new jobs could be created, according to documents seen by Reuters.The five biggest U.S. defense companies, which make nearly every item in the Saudi package, now sustain roughly 383,000 workers, according to Reuters.Trump's claims: Trump in recent weeks has made declarations that the $110 billion Saudi package -- announced in May 2017 – would create hundreds of thousands of new positions, a figure that has been met with doubts.When he first announced the deal, Trump said the sales would potentially create \"tens of thousands of new jobs in the United States,\" a claim backed by the State Department.But earlier this month, that number began to jump, to 450,000, then 500,000, then 600,000. It hit 1 million jobs last week.\"I don't want to lose a million jobs. I don't want to lose a $110 billion in terms of investment. But it's really $450 billion if you include other than military. So that's very important,\" Trump told reporters Oct. 22.There is no publicly available data to back up Trump's claims, and so far Saudi Arabia has only signed solid agreements for $14.5 billion in sales. MATTIS SAYS KHASHOGGI, YEMEN 'SEPARATE' ISSUES: Defense Secretary James MattisJames Norman MattisOvernight Defense — Presented by Raytheon — Lawmakers struggle with how to punish Saudi Arabia | Trump regrets not visiting Arlington for Veterans Day | North Korea deports detained American Ousted Bolton aide says it was 'an honor' to serve Trump administration Macron’s 'Euro-army' is an idea whose time has come MORE said Tuesday that he considers U.S. support for Saudi Arabia in Yemen’s civil war to be a separate issue from the ongoing crisis over the killing of journalist Jamal Khashoggi.“The murder of Khashoggi is, I would separate it out from the Yemen situation,” Mattis said at the United States Institute of Peace. “That stands unique, by itself. The president said we want to get to the bottom of it. We will get to the bottom of it.”What it means: Mattis’ comment suggests cutting off U.S. support for the Saudi coalition in Yemen is not on the table for potential U.S. responses to Khashoggi’s death.Still, Mattis called for Yemen peace talks within the next 30 days, the first time a U.S. official has publicly issued such a timeline.  ON TAP FOR TOMORROWFormer NSA and CIA Director Gen. Michael Hayden and former Director of National Intelligence James ClapperJames Robert ClapperOvernight Defense — Presented by Raytheon — Trump's Armistice Day trip marked by controversy | US ends aerial refueling to Saudi coalition in Yemen | Analysts identify undeclared North Korean missile bases Pipe bomb suspect to be held without bail CIA's ‘surveillance state’ is operating against us all MORE will speak on \"Democracy Under Stress: Challenges to Our Constitutional Norms,\" at 11 a.m. at George Mason University in Virginia.  ICYMI-- The Hill: Pence on migrant caravan: 'This is nothing short of an assault on our country'-- The Hill: State Department spokesperson Heather Nauert under consideration to replace Haley at UN: report -- The Hill: Khashoggi's fiancée says Trump 'should not pave the way for a cover-up'-- The Hill: FBI has investigated possible harassment of diplomatic personnel in US: report -- The Hill: Opinion: A conversation starter for Putin's 2019 White House visit-- The Hill: Opinion: China steps up preparation for war -- with whom?-- Defense News: Ro KhannaRohit (Ro) KhannaSanders rolls out bill aimed at getting Walmart to raise wages HQ2 deal brings new scrutiny on Amazon Overnight Defense — Presented by Raytheon — Mattis defends border deployment during visit to troops | Bolton aide exits WH after clash with first lady | House blocks Yemen war resolution | Report warns of erosion in US military superiority MORE and progressive Democrats hope 'Blue Wave' shakes up American defense policy-- Reuters: Iranian spy service suspected of assassination plot in Denmark: security chiefView the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}