{"id": "Poll: Cruz leads O'Rourke by 10 points in Texas Senate race", "paragraph": "Sen. Ted CruzRafael (Ted) Edward CruzDemocratic strategist warns Beto should be ‘careful’ with social media presence Hillary advisers battle over whether she’ll run in 2020 O'Rourke writes blog post describing a literal run from near the capitol to near the White House MORE (R) holds a 10-point lead over his Senate challenger Rep. Beto O'RourkeRobert (Beto) Francis O'RourkeEntrepreneur touts big solutions, endorsements in discussing presidential bid Dem pollster: Texas, Georgia diversifying because they are 'centers for opportunity'  Cruz brushes off question about campaign claim on O'Rourke paying for caravan MORE (D) with just a week left until Election Day, according to a poll released Tuesday.Cruz leads O'Rourke 52 percent to 42 percent among likely voters in the poll conducted by conservative-leaning Dixie Strategies and CBS 11.The 10-point margin shows Cruz with an expanded lead from a September poll by the same organizations, which found the incumbent leading by 4 points.In the poll released Tuesday, Cruz leads by 21 points among men, 59 percent to 38 percent. Among women polled, 49 percent preferred Cruz, while 44 percent backed O'Rourke.The incumbent GOP senator holds a sizable 66 percent to 31 percent lead over O'Rourke among white voters surveyed.Meanwhile, O'Rourke has an advantage among black voters, with 69 percent backing him compared to 31 percent backing Cruz. O'Rourke also leads Cruz among Hispanic voters, 53 percent to 41 percent, according to the poll.And in the Texas gubernatorial race, the survey showed incumbent Gov. Greg Abbott (R) with a healthy 59 percent to 33 percent lead over his Democratic opponent Lupe Valdez.The Dixie/CBS poll surveyed 588 likely voters from Oct. 25-26 and has a margin of error of 4.04 percentage points.While the Texas Senate race has attracted national attention thanks in part to O'Rourke's viral speeches and impressive fundraising totals, a slew of recent polls have shown Cruz with a comfortable lead in the race.The RealClearPolitics polling index shows Cruz with a 7-point lead in the race.The national GOP has mobilized to aid Cruz in what has been a reliably Republican state, with President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE hosting a campaign rally for the senator last week in Houston.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}