{"id": "Election Countdown: Bomb threats raise new fears about political violence | Texas race becomes ground zero in health care fight | Florida tests Trump's influence | Racial animus moves to forefront in midterm battle | Trump to rally in Wisconsin tonight", "paragraph": "This is Election Countdown, The Hill's newsletter from Lisa Hagen (@LA_Hagen) and Max Greenwood (@KMaxGreenwood) that brings you the biggest stories on the campaign trail. We'd love to hear from you, so feel free to reach out to Lisa at LHagen@thehill.com and Max at MGreenwood@thehill.com. with any questions, comments, criticisms or food recommendations (mostly the latter, please). Click here to sign up. We're 13 days until the 2018 midterm elections and 741 days until the 2020 elections. Explosive devices targeting Democratic politicians and newsrooms have underscored a recurring theme in the 2018 midterms: political polarization is at an all-time high.Less than two weeks before the election, the Secret Service found two \"potential explosive devices\" mailed to Hillary ClintonHillary Diane Rodham ClintonTexas history curriculum to emphasize that slavery played 'central role' in Civil War Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Texas education board approves restoring Hillary Clinton in history curriculum MORE at her New York home and former President Barack ObamaBarack Hussein ObamaAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural Trump's take on midterms: ‘Epic' win in Senate, ‘better than other sitting Presidents’ in House NASA's carpool to Space Station is back on as Russian rocket Soyuz quickly returns to flight MORE's Washington, D.C. residence. Meanwhile, CNN's newsroom in the Time-Warner building in Manhattan was evacuated after reports of a suspicious package.Suspicious packages were addressed to other Democrats including Rep. Maxine WatersMaxine Moore WatersDem women rally behind Pelosi Pelosi, potential challenger Fudge hold 'candid' discussion Marcia Fudge under spotlight as Pelosi Speaker fight heats up MORE (Calif.) and former Attorney General Eric HolderEric Himpton HolderEric Holder endorses Pelosi for Speaker Poll: Biden and Sanders lead 2020 Dem field, followed by Beto O'Rourke Trump's shortlist for attorney general takes shape MORE, as well as billionaire philanthropist and Democratic donor George Soros. The Florida office of Rep. Debbie Wasserman SchultzDeborah (Debbie) Wasserman SchultzSingle fingerprint, misspellings pointed FBI to mail bombs suspect Piers Morgan: Trump can't ignore stickers on suspect's van, must cool down 'violently aggressive rhetoric' White van identified in connection with mail bombings suspect covered in pro-Trump stickers MORE (D) was also evacuated because a package sent to Holder used her return address.The White House and Republican leaders condemned the threats and called for an end to political violence. Speaking at a White House event, Trump, who has previously criticized all of the people targeted this week, denounced the threats \"abhorrent\" and \"egregious\" and called for unity.Democratic leaders, though, slammed Trump's words as \"hollow.\" \"Time and time again, the President has condoned physical violence and divided Americans with his words and his actions,\" Senate Minority Leader Charles SchumerCharles (Chuck) Ellis SchumerFacebook reeling after damning NYT report Schumer warns Trump to stay out of government funding negotiations Schumer predicts Nelson will 'continue being senator' if 'every vote counted' MORE (N.Y.) and House Minority Leader Nancy PelosiNancy Patricia D'Alesandro PelosiDem women rally behind Pelosi How this year’s freshmen can save the Congress — and themselves Single-payer health care is better than ObamaCare  MORE (Calif.) said in a joint statement. Some worry calls for unity may be too late. The attempted bomb attacks come in the final stretch of a midterm year mired by heated rhetoric and finger-pointing by both parties at their opponents.Democrats largely blame Trump for the polarization in politics and rhetoric that stems from his attacks against political opponents. Meanwhile, Republicans -- and Trump himself -- have cautioned voters ahead of the midterms about a liberal \"mob,\" specifically citing the protests that emerged after the contentious Supreme Court confirmation of Brett KavanaughBrett Michael KavanaughThe Hill's 12:30 Report — Sponsored by Delta Air Lines — White House to 'temporarily reinstate' Acosta's press pass after judge issues order | Graham to take over Judiciary panel | Hand recount for Florida Senate race Graham set to take over Judiciary Leverage the new US International Development Finance Corporation to compete with China MORE.It's unclear what effect the bomb threats will have on the midterms. But it's unlikely to change the attitudes of the GOP or Democratic bases, who appear more motivated than ever to mobilize for their party's candidates. Read more from The Hill's Morgan Chalfant about those threats raising new fears.  Wave watchThe race for Rep. Pete SessionsPeter Anderson SessionsTexas New Members 2019 Congress is going to make marijuana moves McCarthy defeats Jordan for minority leader in 159-to-43 vote  MORE's (R-Texas) suburban swing district has become ground zero for the battle over health care and pre-existing conditions, The Hill's Lisa Hagen reports from north Dallas. Sessions's Democratic opponent Colin Allred has sharpened his attacks on pre-existing conditions and the GOP congressman's numerous votes to repeal ObamaCare. It's a strategy being employed across other swing districts and states as Democrats fight for the House majority. For his part, Sessions is highlighting a non-binding resolution he proposed last month that would give access to affordable health care for those with pre-existing conditions.In an interview with The Hill, Allred called that resolution a \"political stunt,\" arguing that voters will see it that way. Meanwhile, Sessions lashed out at Allred and Democrats' for their \"shameless attacks\" regarding pre-existing conditions. The GOP congressman went further by arguing that Democrats will hurt economic progress by implementing \"Medicare for All.\" Race has moved to the forefront in a number of campaigns in this year's midterm elections that rivals that of past cycles, The Hill's Reid Wilson reports. There've been more blatant overtures of racial animus and strategists on both sides of the aisle link that to Trump. One example in California: GOP Rep. Duncan HunterDuncan Duane HunterProposed House GOP rules would force indicted lawmakers to step down from leader roles: report Overnight Defense: What the midterms mean for defense panels | Pompeo cancels North Korea meeting | Trump eyes Kim summit in early 2019 | Pentagon drops name for border mission GOP Rep. Duncan Hunter wins reelection despite criminal charges MORE accused his Democratic challenger Ammar Campa-Najjar, who is of Mexican and Palestinian descent, of \"working to infiltrate\" Congress. And in Florida's governor race, Republican Ron DeSantisRonald Dion DeSantisDeSantis transition team zeroes in on possible chief of staff Trump congratulates Kemp, says Abrams will have 'terrific political future' Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority MORE said after the August primaries that Democrat Andrew Gillum, who's black, would \"monkey\" up the state's economy. Senate showdownTrump's political influence is being tested in Florida, a perennial swing state that narrowly went for the president in 2016. Key races in the Sunshine State will serve as an early referendum on the president's standing, specifically in the nationally watched Senate and governor's races. The Hill's Max Greenwood dives into Florida's political landscape from Orlando. Trump claimed Wednesday in a tweet that GOP candidates would \"totally protect people with pre-existing conditions,\" trying to provide some cover for Republicans who voted to repeal ObamaCare. Republicans have been trying to show that they support protections for those with pre-existing conditions as they weather repeated attacks from Democrats on ObamaCare repeal. It's become a prominent issue in this cycle's top Senate races, where Republicans are looking to protect their slim 51-49 majority.  Survey says…SHOCK POLL out of South Dakota: Rep. Kristi NoemKristi Lynn NoemSouth Dakota New Members 2019 The Hill's Morning Report — Split decision: Dems take House, GOP retains Senate majority Republican Noem wins South Dakota governor race MORE (R-S.D.) and Democratic challenger Billie Sutton are tied just two weeks before the state's gubernatorial election, according to the Mason-Dixon Polling & Strategy poll commissioned by the Argus Leader and KELO TV. Both candidates each won support from 45 percent of likely voters, with 9 percent still undecided. Sen. Dean HellerDean Arthur HellerCortez Masto named Dem Senate campaign chairwoman Nevada New Members 2019 Election Countdown: Lawsuits fly in Florida recount fight | Nelson pushes to extend deadline | Judge says Georgia county violated Civil Rights Act | Biden, Sanders lead 2020 Dem field in poll | Bloomberg to decide on 2020 by February MORE (R-Nev.) continues to widen his lead against Rep. Jacky RosenJacklyn (Jacky) Sheryl RosenThe Hill's Morning Report — Presented by T-Mobile — House, Senate leaders named as Pelosi lobbies for support to be Speaker  Nevada New Members 2019 Election Countdown: Lawsuits fly in Florida recount fight | Nelson pushes to extend deadline | Judge says Georgia county violated Civil Rights Act | Biden, Sanders lead 2020 Dem field in poll | Bloomberg to decide on 2020 by February MORE (D-Nev.) in the only Senate race where a GOP senator is running for reelection in a state won by Hillary Clinton in 2016. Heller leads Rosen by 6 points, 47 to 41 percent, in a new Ipsos poll on Wednesday. An Ipsos poll released Wednesday gives Sen. Ted CruzRafael (Ted) Edward CruzDemocratic strategist warns Beto should be ‘careful’ with social media presence Hillary advisers battle over whether she’ll run in 2020 O'Rourke writes blog post describing a literal run from near the capitol to near the White House MORE (R-Texas) a 5-point lead over Rep. Beto O'RourkeRobert (Beto) Francis O'RourkeEntrepreneur touts big solutions, endorsements in discussing presidential bid Dem pollster: Texas, Georgia diversifying because they are 'centers for opportunity'  Cruz brushes off question about campaign claim on O'Rourke paying for caravan MORE (D-Texas). This result comes even as 52 percent of Texans say they are motivated to support a candidate who would oppose Trump. Trump threw his support behind Cruz at a rally with this week, calling him \"beautiful Cruz\" in a change of tone. Sen. Bill NelsonClarence (Bill) William NelsonDems seek to overhaul voting rules in Florida legal fight  Election Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Trump's take on midterms: ‘Epic' win in Senate, ‘better than other sitting Presidents’ in House MORE (D-Fla.) leads Florida Gov. Rick Scott (R) by 4 points, according to a new Gravis Marketing poll. Six percent of likely voters remain undecided about their choice. Sen. Bob MenendezRobert (Bob) MenendezPro-Israel organizations should finally seek payback against Iran deal Dems Trump lowers refugee goal to 30,000, he must meet it Blame Senate, not FBI, for Kavanaugh travesty MORE (D-N.J.) holds a 5-point lead over GOP challenger Bob Hugin in New Jersey's Senate race, a Rutgers University Eagleton Institute of Politics poll released Wednesday finds. Menendez, who was embroiled in a corruption case, has been seeing low enthusiasm. The trial ended in a hung jury and federal prosecutors later dropped the charges. Only 29 percent of Menendez supporters said they were \"very enthusiastic\" about voting for him. A new Monmouth University poll gives Rep. Dana RohrabacherDana   Tyrone RohrabacherDemocratic gains erasing House GOP in California California New Members 2019 McCarthy defeats Jordan for minority leader in 159-to-43 vote  MORE (D-Calif.) a 2-point lead over Democratic challenger Harley Rouda. This year's election has proven to be the toughest for the 15-term congressman. In July, Rohrabacher trailed his opponent by two points. However, with increasing approval of Trump and immigration a top concern in California's 48th district, the race seems to have slightly tipped in Rohrabacher's favor.  Paper chaseThe Republican National Committee announced it will spend an additional $25 million, for a total of $275 million, on the 2018 midterm elections. That new spending includes: $10 million on digital get-out-the-vote efforts, $3 million on a texting program, and $3.5 million transferred to both the Republicans' House and Senate committees. Priorities USA Action, the largest Democratic super PAC, launched a $2 million national TV ad buy linking Republicans to Senate Majority Leader Mitch McConnellAddison (Mitch) Mitchell McConnellAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural McConnell: Criminal justice bill unlikely this year  On The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report MORE's (Ky.) recent comments where he said entitlements were driving the national debt.  What we're watching forCampaign trail:--Oct. 26: Former President Obama will campaign in Wisconsin for gubernatorial candidate Tony Evers, Sen. Tammy BaldwinTammy Suzanne BaldwinSchumer reelected as Senate Democratic Leader Number of LGBT lawmakers in Congress hits double digits Senate GOP readies for leadership reshuffle  MORE (D-Wis.) and other Democrats running down ballot. He'll also hold a rally in Detroit. Meanwhile, Sen. Bernie SandersBernard (Bernie) SandersAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural Entrepreneur touts big solutions, endorsements in discussing presidential bid Warren, 2020 Dems target private immigration detention center operators MORE (I-Vt.) will continue to hold rallies around the country, with his next stop in California. He'll hold a rally with Democrat Mike Levin, who's running for retiring GOP Rep. Darrell IssaDarrell Edward IssaDemocratic gains erasing House GOP in California California New Members 2019 Dem Mike Levin wins Issa's open House seat in southern California MORE's seat in California's 49th district.--Oct. 27: Sanders will then travel up north for another California rally with Rep. Barbara LeeBarbara Jean LeeDem women rally behind Pelosi This week: Congress starts lame-duck with leadership fight Rep. Linda Sanchez’s husband indicted on corruption charges MORE (D-Calif.) in Berkeley. Lee doesn't face a competitive reelection race.Trump rallies:--Oct. 24 in Mosinee, Wis.--Oct. 26 in Charlotte, N.C.--Oct. 27 in Murphysboro, Ill.Debates: (All ET)--Oct. 24: Florida gubernatorial debate at 7 p.m.; New Jersey Senate debate at 8 p.m.--Oct. 26: North Dakota Senate debate at 8 p.m.  Odds and endsA debate on Tuesday between Georgia gubernatorial candidates Stacey Abrams (D), Brian Kemp (R) and Libertarian Ted Metz, was marked by hot-button issues, personal attacks and allegations of voter suppression. Read the five debate takeaways from The Hill's Rebecca Kheel and Emily Birnbaum. The Hill's Reid Wilson reports breaks down the reason for Trump's visit to a rural town in Wisconsin, pointing to Republicans' concerns about turnout when it comes to Gov. Scott Walker's reelection race. In an op-ed for The Hill, former Rep. Steve IsraelSteven (Steve) J. IsraelElection Countdown: Hyde-Smith's 'public hanging' joke shakes up Mississippi runoff | New lawsuits in Florida | Trump wants Florida election official fired | Mia Love sues to stop Utah vote count | Republican MacArthur loses NJ House race The most important runoff election is one you probably never heard of The Hill's Morning Report — Trump heads to Paris as attorney general controversy intensifies  MORE (N.Y.), who previously served as chairman of the House Democrats' campaign arm, explored how Dems can counter fear that he believes has been stoked by Republicans, specifically pointing to rhetoric over the migrant caravan.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}