{"id": "The Trump Doctrine: A triumphant incoherence ", "paragraph": "President Donald Trump has brought policy making by chaos to be the new normal. Repeatedly, we learn this president's seat-of-the-pants decisions are founded upon contrivance, and they often appear poised to injure our interests and our ideals simultaneously. Most alarmingly, these injuries concern the basic expectations of national security and international justice.New satellite images confirm that North Korea is still moving ahead with its ballistic missile program.  It appears that Trump's earlier reassurances about \"peace\" with North Korea were not merely silly, but deliberate falsifications as well. Naturally, there are corollary consequences for America's allies in South Korea and Japan, some of them potentially existential.Credo quia absurdum,  said the Romans. \"I believe because it is absurd.\"Systematically, this president avoids knowledge-based judgments. He blamed California \"mismanagement\" for recent unprecedented wildfires. He also recently declared his intention to unilaterally abrogate this country's stabilizing legal obligations under the INF treaty - which will impair our codified promises at both international and domestic legal levels. He withdrew the United States from the July 2015 Iran deal (the JCPOA), an agreement that the UN's IAEA reaffirmed has been respected by Tehran.There are further examples of President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE undermining America's most primary legal and moral obligations. All reflect his core assumption that attitude, not preparation is what counts.Not surprisingly, Jared and Ivanka have not yet been able to fashion a brilliantly coherent plan to save the Middle East.Trump's strange war against his own intelligence agencies and legal institutions is unhidden.Donald Trump is no scholar. To be sure, no one expected anything else. But he is especially weak on matters of law and justice. International law is not irrelevant to the United States, but remains an integral part of the law of this country. Among other places, it says so in the Constitution, that document Trump's supporters are so fond of citing in reverential tones.Article 6 states \"...all treaties made, or which shall be made, under the authority of the United States, shall be the supreme law of the land.\"The United States is a party to the 1951 Refugee Convention, which contains (at Article 33) the basic principle of non-refoulement:  \"No Contracting State shall expel or return (\"refouler\") a refugee in any manner whatsoever to the frontiers of territories where his life or freedom would be threatened on account of his race, religion, nationality membership of a particular social group or political opinion.\" Under President Trump's fitfully-released executive orders, impermissible expulsions and returns have become \"official\" policies of the United States. For the moment, \"ground-zero\" for such presidential manipulations has been \"the caravan\" and its eagerly awaited \"invasion.\"Mr. Trump is not the real \"pathology.\" Rather, his law and government-violating presidency is merely the most visible symptom of a much more widespread and deeply systemic disorder: This is a starkly anti-intellectual American society that frowns upon even a scintilla of serious independent thought.Significantly, though generally unknown to Americans, the due process clauses of the Constitution protect all \"persons,\" and not just \"citizens.\" Jurisprudentially, this authoritative scope of competence - one drawn from the Natural Law or Higher Law bases of the American Republic - is \"beyond legal question.\"Ultimately, in both life and in law, truth is exculpatory.This is not by any means a normal and law-abiding American presidency. But, we must now ask: Is this a dress rehearsal for a still-widening chaos?Alarmingly, Donald Trump plainly cherishes chaos in both national and international politics, a deeply troubling affection that is impossible to reconcile with even the most rudimentary legal expectations of U.S. government or law.Inevitably, Mr. Trump's supporters, who still number in the tens of millions, yearn openly for the tangible warmth of \"belonging,\" of being part of a shrill and shrieking crowd, and of enjoying the numbingly false pleasures bestowed by simplistic explanations. Complexity, after all, is always difficult and daunting for those who would reject intellect in virtually any form.\"I love the poorly educated,\" offered candidate Trump during the 2016 campaign.The Founding Fathers of the United States did not generally believe in democracy – that’s why they created a republic. Most agreed with Alexander Hamilton's trenchant observation that \"the people are a great beast.\" Thomas Jefferson, arguably the most democratic of the founders, tied any hopes for a decent democratic ethos to a suitably challenging system of education, but even he still described \"the people\" in distinctly unflattering terms.Were he alive today, bearing witness to the stark declensions of the Trump White House, the third president of the United States would likely blame a pervasively anti-intellectual and unphilosophical ethos in the underlying American electorate.To fully understand how Mr. Trump can repeatedly get away with debilitating policy errors, apparent illegalities and outright falsehoods, we must look no further than the fractious and truth-averse American society.Louis René Beres, Ph.D. Princeton, is emeritus professor of international law at Purdue University. He is the author of 12 books and several hundred articles dealing with nuclear strategy and nuclear war. His newest book is “Surviving Amid Chaos: Israel’s Nuclear Strategy” (Rowman & Littlefield, 2016; 2nd ed. 2018)View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}