{"id": "Failed Israeli operation in Gaza sparks new violence", "paragraph": "A failed Israeli operation in Gaza has sparked a new explosion of violence, with Israeli forces killing three Palestinians and launching more than 30 airstrikes into the strip as Hamas-affiliated militants launch hundreds of rockets into Israel.The outbreak is one of the most significant escalations in violence since 2014, according to The Associated Press.At least seven Israelis were wounded by the rockets from Gaza, including one 19-year-old Israeli soldier who is in critical condition, according to the country's national rescue service. Israeli forces have not provided details about the operation that led to the increased violence, reporting only that seven Palestinians, including a Hamas commander, and a senior Israeli officer were killed Sunday night during the botched operation in Gaza. They were apparently targeting a commander of Hamas's military wing, BBC reported.Gaza militants said the rockets are retaliation for Israel's “aggressive crime,\" The Washington Post reported.One of the Israeli airstrikes on Monday destroyed Hamas's television station, al-Aqsa Television, according to multiple reports.\"The station broadcasts harsh incitement against Israel and its citizens, showing methods on how to carry out attacks against civilians and soldiers,\" the Israel Defense Forces spokesperson said in a statement, according to Haaretz.United Nations Middle East envoy Nickolay Mladenov on Monday tweeted that the U.N. is \"working closely with #Egypt & all concerned to ensure that #Gaza steps back from the brink.\"\"The escalation in the past 24hrs is EXTREMELY dangerous & reckless,\" he added. \"Rockets must STOP, restraint must b shown by all! No effort must be spared to reverse the spiral of violence.\"The U.N. in July warned that an outbreak of violence between Hamas and Israel was \"almost a certainty,\" citing the humanitarian crisis in the Gaza strip caused in part by the Israeli blockade.The previous outbreak in violence came in March, when Palestinians began protesting at the border between Gaza and Israel against the conditions brought on by the Israeli blockade. Thousands of Palestinians have been wounded and more than 200 killed over the course of the protests, which are still ongoing, the BBC reported. View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}