{"id": "Virginia attorney general announces investigation into possible clergy sex abuse", "paragraph": "Virginia Attorney General Mark Herring announced Wednesday that he is conducting an investigation into sex abuse by Catholic clergy and any cover-ups that have taken place of that abuse in his state.“Like so many Americans, I read the grand jury report on clergy abuse in the Catholic dioceses in Pennsylvania, and I felt sick,\" Herring said in the announcement of the investigation. \"It made me sick to see the extent of the damage done, the efforts to cover it up, and the complicity and enabling that went on by powerful people who should have known better and should have done more to protect vulnerable children.“We shouldn’t assume the behavior and the problems are limited just to Pennsylvania or to one diocese,\" Herring added, referencing the report from a Pennsylvania grand jury of extensive allegations of the sexual abuse of minors by Catholic clergy.\"If there has been abuse or cover-up in Virginia like there was in Pennsylvania, I want to know about it, I want to root it out, and I want to help survivors get justice and get on a path to healing,” he said.As a part of the investigation, Herring launched the Virginia Clergy Abuse Hotline and www.VirginiaClergyHotline.com.The announcement comes one day after the attorney general for the District of Columbia made public that it is opening an investigation into sexual abuse by the Catholic clergy in the area's archdiocese.Virginia is the 13th state to launch a similar investigation, according to The Washington Post.Washington, D.C., Cardinal Donald Wuerl resigned earlier this month over his role in covering up multiple sexual abuse scandals in Pennsylvania and D.C.Herring told the Post that he is a churchgoer and framed the effort as a way to help the church act as a positive force. \"Few people in our lives are more trusted and, therefore, more powerful than our faith leaders, especially as we’re growing up,\" he said. \"We look to them for strength in difficult times, spiritual growth and maturity, understanding. I know this is true in my own life.\"Sadly we have learned that trust and power can be abused and exploited, even in communities of faith, even against children,” he said.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}