{"id": "McConnell and wife confronted by customers at restaurant", "paragraph": "Senate Majority Leader Mitch McConnellAddison (Mitch) Mitchell McConnellAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural McConnell: Criminal justice bill unlikely this year  On The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report MORE (R-Ky.) was reportedly confronted by a small group of diners at a restaurant in Louisville, Ky., on Friday night. In footage obtained by TMZ, at least one diner at the Havana Rumba restaurant can be seen berating the Kentucky Republican for his politics. At the beginning of the clip, the diner can be seen yelling at the Republican and arguing with his wife, Transportation Secretary Elaine ChaoElaine Lan ChaoTrump, first lady attend special Supreme Court ceremony for Kavanaugh 5 ways Democrats can turn the House win into future success Overnight Energy: Groups want Senate to probe Interior watchdog controversy | Puerto Rico eyes plan for 100 percent clean energy | Dems say Congress already rejected part of EPA car emissions plan MORE.“Oh yeah, why don’t you get out of here? Why don’t you leave our entire country,” the diner can be seen telling the couple as others at the restaurant shooed the diner and told him to leave the senator alone.“They’re going to come for Social Security,” the diner continued before appearing to be approached by restaurant staff.The woman who recorded the incident told TMZ the diner also slammed his fists on the couple’s table and threw out his food.According to TMZ, McConnell was confronted by four men in total during the incident.\"The leader and Secretary Chao enjoyed their meal in Louisville last night and they appreciate those who spoke up against incivility,\" a spokesperson for McConnell told CNN affiliate WLKY. \"They hope other patrons weren't too inconvenienced by left-wing tantrums. As the leader often says, the Senate will not be intimidated by the antics of far-left protesters.\"The restaurant told WLKY \"we deeply regret the incident that took place at our restaurant this weekend.\"\"We strongly believe everyone should feel welcome and safe in our restaurants,\" the restaurant said. In recent months, videos have emerged of protesters directly confronting conservatives figures across the country.Earlier this year, protesters publicly confronted the Environmental Protection Agency's former administrator Scott PruittEdward (Scott) Scott PruittOvernight Energy: Trump to nominate Wheeler as EPA chief | House votes to remove protections for gray wolves | Lawmakers aim to pass disaster funds for California fires Trump to nominate former coal lobbyist Andrew Wheeler as next EPA administrator Time to stop letting fossil fuels run Washington MORE before his resignation, White House press secretary Sarah Huckabee Sanders, and Homeland Security Secretary Kirstjen NielsenKirstjen Michele NielsenTrump signs bill cementing cybersecurity agency at DHS Mulvaney positioning himself to be Commerce Secretary: report Dem senator expresses concerns over potential Nielsen ouster MORE, among others.-Updated Oct. 21 at 6:20 a.m.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}