{"id": "Conway's husband pens op-ed calling Trump's birthright proposal 'unconstitutional'", "paragraph": "George Conway, the husband of White House counselor Kellyanne ConwayKellyanne Elizabeth ConwayKellyanne Conway changes Twitter bio amid media coverage of her husband's Trump criticism Conway’s husband: I’d rather move to Australia than vote for Trump Kellyanne Conway: Trump could shut down government for wall funding MORE, co-wrote an op-ed on Tuesday rejecting President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE's assertion that he could do away with birthright citizenship through an executive order.\"Such a move would be unconstitutional and would certainly be challenged. And the challengers would undoubtedly win,\" Conway wrote in The Washington Post with attorney Neal Katyal.Conway, a self-described conservative, and Katyal, a self-described liberal, argued that the authors of the Constitution's 14th Amendment were \"simple and clear\" in drafting a provision that meant anyone born in the United States is a citizen of the country.The two lawyers further cited a 1898 Supreme Court Case, United States v. Wong Kim Ark, in which the court ruled that \"all children here born of resident aliens\" were granted citizenship by birth, except in cases of foreign occupiers and foreign diplomats.\"Neither of those narrow exceptions supports what proposes to do by executive order,” Conway and Katyal wrote. “He is threatening, with the stroke of a pen, to declare certain people who are born in the United States ineligible for citizenship — despite the plain words of the 14th Amendment.\"A key difference, critics have noted, is that in the 1898 case, both parents had established permanent residence in the U.S.In an interview with Axios released Tuesday, Trump vowed to end citizenship for children of nonlegal residents born in the U.S., a change he proposed during the 2016 campaign, even though birthright citizenship is enshrined under the 14th Amendment.Trump did not say when he would sign such an order, but it is the latest example of the president deploying hard-line rhetoric to gin up discussion about immigration in the closing stretch of the midterms.Speaker Paul RyanPaul  Davis RyanHow this year’s freshmen can save the Congress — and themselves Democrat Katie Porter unseats GOP's Mimi Walters Amazon fleeced New York, Virginia with HQ2 picks MORE (R-Wis.), Sen. Jeff FlakeJeffrey (Jeff) Lane FlakeVeteran political reporter says New Hampshire voters have 'hunger' to moderate political turbulence McConnell, Flake clash over protecting Mueller probe McCain would have said ‘enough’ to acrimony in midterms, says Cindy McCain MORE (R-Ariz.) and Sen. Chuck GrassleyCharles (Chuck) Ernest GrassleyOvernight Health Care — Presented by The Partnership for Safe Medicines — GOP lawmaker pushes back on Trump drug pricing plan | Pfizer to raise prices on 41 drugs next year | Grassley opts for Finance gavel McConnell: Criminal justice bill unlikely this year  On The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report MORE (R-Iowa) were among the lawmakers who promptly refuted Trump's claim that he could unilaterally make such a sweeping change.\"Well, you obviously cannot do that. You cannot end birthright citizenship with an executive order,\" Ryan told Lexington, Ky., radio station WVLK on Tuesday.Conway and Katyal wrote that the unconstitutionality of Trump's proposal serves as a reminder that the Constitution can be a unifying document in politically divisive times.\"The fact that the two of us, one a conservative and the other a liberal, agree on this much despite our sharp policy differences underscores something it is critically important to remember,\" they wrote. \"Our Constitution is a bipartisan document, designed to endure for ages. Its words have meaning that cannot be wished away.\"Conway has repeatedly drawn attention on social media during Trump's tenure, frequently sharing news articles and opinions on Twitter that are critical of his wife's boss.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}