{"id": "Sunday shows preview: New members preview agendas after Democratic House takeover", "paragraph": "New members of Congress are set to hit the Sunday news show circuit this week amid substantial Democratic gains in the House that have slowly increased as more elections are called across the country.Several newly-elected Democratic members of Congress including Reps.-elect Donna Shalala (D-Fla.), Abigail Spanberger (D-Va.), and Lauren Underwood (D-Ill.) will make appearances on CBS, CNN, and ABC, where the freshmen lawmakers will speak about their planned agendas in the House.The incoming Democrats will also likely be quizzed on their support for members of House leadership, as Democrats seem headed for a battle over the speaker's gavel as well as other potential races for top leadership slots.A coalition of Democrats allied against House Minority Leader Nancy PelosiNancy Patricia D'Alesandro PelosiDem women rally behind Pelosi How this year’s freshmen can save the Congress — and themselves Single-payer health care is better than ObamaCare  MORE's (D-Calif.) bid for the top House role are looking to raise a female challenger to Pelosi, though no official candidate has been announced.Another incoming lawmaker set to appear on both CNN and CBS is Rep.-elect Dan Crenshaw (R-Texas). Crenshaw made headlines after he appeared on \"Saturday Night Live\" last week to accept an apology from cast member Pete Davidson over a joke about Crenshaw's appearance that some said made light of Crenshaw's injury sustained during military service.On \"Fox News Sunday,\" host Chris Wallace will air the entirety of his interview with President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE after it was revealed Friday that Trump told the news outlet that climate change may play a small role in the devastating wildfires in California.Another highlight of the Sunday shows will be the future of special counsel Robert MuellerRobert Swan MuellerSasse: US should applaud choice of Mueller to lead Russia probe MORE's probe into Russian interference in the election.Outgoing Sen. Jeff FlakeJeffrey (Jeff) Lane FlakeVeteran political reporter says New Hampshire voters have 'hunger' to moderate political turbulence McConnell, Flake clash over protecting Mueller probe McCain would have said ‘enough’ to acrimony in midterms, says Cindy McCain MORE (R-Ariz.), who has pledged to block any judicial nominees as long as Senate Majority Leader Mitch McConnellAddison (Mitch) Mitchell McConnellAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural McConnell: Criminal justice bill unlikely this year  On The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report MORE does not hold a vote to protect Mueller, will be on CNN's \"State of the Union.\"Similarly, incoming Senate Judiciary Committee Chairman Sen. Lindsey GrahamLindsey Olin GrahamOn The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report Cotton opposes Trump-backed criminal justice bill Lawmakers say California will eventually get emergency funding for fire relief MORE (R-S.C.), a former Trump critic and now an ally, will be on NBC's \"Meet the Press.\"Here's the full lineup:ABC's \"This Week\" - Reps.-elect Deb Haaland (D-N.M.), Chrissy Houlahan (D-Pa.), Donna Shalala (D-Fla.), Abigail Spanberger (D-Va.), and Lauren Underwood (D-Ill.), Sen. Roy BluntRoy Dean BluntThe Hill's Morning Report — Presented by T-Mobile — House, Senate leaders named as Pelosi lobbies for support to be Speaker  McConnell: Congress aiming for deal on sexual harassment bill this year The Hill's 12:30 Report — Sponsored by Delta Air Lines — Leadership elections in Congress | Freshman lawmakers arrive | Trump argues he can restrict reporter access MORE (R-Mo.), Rep. Adam SchiffAdam Bennett SchiffHeads up, GOP: Elections have consequences Top Dems: DOJ position on Whitaker appointment 'fatally flawed' House Dems launching probe into Whitaker's role in company government deemed a 'scam' MORE (D-Calif.).NBC's \"Meet the Press\" - Sens. Sherrod BrownSherrod Campbell BrownThe Hill's 12:30 Report — Sponsored by Delta Air Lines — White House to 'temporarily reinstate' Acosta's press pass after judge issues order | Graham to take over Judiciary panel | Hand recount for Florida Senate race Budowsky: Sherrod Brown should run in 2020 Sherrod Brown: If Stacey Abrams doesn't win, Republicans 'stole it' MORE (D-Ohio), Lindsey Graham (R-S.C.), Thom TillisThomas (Thom) Roland TillisExpert says Senate will be up for grabs in 2020 The Hill's 12:30 Report — Sponsored by Delta Air Lines — White House to 'temporarily reinstate' Acosta's press pass after judge issues order | Graham to take over Judiciary panel | Hand recount for Florida Senate race McConnell, Flake clash over protecting Mueller probe MORE (R-N.C.), and Jeanne ShaheenCynthia (Jeanne) Jeanne ShaheenThe Hill's 12:30 Report — Sponsored by Delta Air Lines — White House to 'temporarily reinstate' Acosta's press pass after judge issues order | Graham to take over Judiciary panel | Hand recount for Florida Senate race Overnight Defense — Presented by Raytheon — Border deployment 'peaked' at 5,800 troops | Trump sanctions 17 Saudis over Khashoggi killing | Senators offer bill to press Trump on Saudis | Paul effort to block Bahrain arms sale fails Senators introduce bill to respond to Khashoggi killing MORE (D-N.H.).CBS' \"Face the Nation\" - Haaland and Houlahan, Reps.-elect Dan Crenshaw (R-Texas) and Joe Neguse (D-Colo.), Sens. Joni ErnstJoni Kay ErnstExpert says Senate will be up for grabs in 2020 Senators introduce Trump-backed criminal justice bill The Hill's Morning Report — Presented by T-Mobile — House, Senate leaders named as Pelosi lobbies for support to be Speaker  MORE (R-Iowa) and Rand PaulRandal (Rand) Howard PaulOvernight Defense — Presented by Raytheon — Lawmakers struggle with how to punish Saudi Arabia | Trump regrets not visiting Arlington for Veterans Day | North Korea deports detained American Hillicon Valley: Facebook reeling after NYT report | Dems want DOJ probe | HQ2 brings new scrutiny on Amazon | Judge upholds Russian troll farm indictments | Cyber moonshot panel unveils recommendations Overnight Defense — Presented by Raytheon — Border deployment 'peaked' at 5,800 troops | Trump sanctions 17 Saudis over Khashoggi killing | Senators offer bill to press Trump on Saudis | Paul effort to block Bahrain arms sale fails MORE (R-Ky.), Rep. Elijah CummingsElijah Eugene CummingsPelosi, potential challenger Fudge hold 'candid' discussion Heads up, GOP: Elections have consequences House Dems launching probe into Whitaker's role in company government deemed a 'scam' MORE (D-Md.).CNN's \"State of the Union\" - Haaland, Houlahan, Crenshaw, as well as Sen. Jeff Flake, (R-Ariz.).Fox's \"Fox News Sunday\" - Interview with President Trump.View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}