{"id": "Sanders: Trump setting 'terrible example' for our children", "paragraph": "Sen. Bernie SandersBernard (Bernie) SandersAs Democrats gear up to challenge Trump in 2020, the key political divide will be metropolitan versus rural Entrepreneur touts big solutions, endorsements in discussing presidential bid Warren, 2020 Dems target private immigration detention center operators MORE (I-Vt.) accused President TrumpDonald John TrumpMia Love pulls ahead in Utah race as judge dismisses her lawsuit Trump administration denies exploring extradition of Erdoğan foe for Turkey Trump congratulates Kemp, says Abrams will have 'terrific political future' MORE of setting a \"terrible example\" for children at a rally in South Carolina on Saturday.“I've got four kids, 7 grandchildren, we try to raise our kids to be honest and treat other people with respect and compassion and what kind of terrible example— regardless of your political views, whether you are conservative or progressive, you want your kids to be honest and decent,” Sanders said at the rally in Columbia.“What kind of terrible example is this person in the White House giving to our children?\" the senator continued in reference to Trump.The Vermont senator also blasted the president as an “embarrassment” and a “pathological liar.”“There is no politician in history who doesn't stretch the truth in order to make his or her point, that's politics, but we've never had a president who lies all the time and it's quite possible he doesn't even know the difference between a truth and a lie,” Sanders said.Sanders’s remarks came during a rally that was billed to support “Medicare for All,” according to The State. His visit to South Carolina was the latest in a string of visits made by potential Democratic presidential contenders, including California Sen. Kamala HarrisKamala Devi HarrisElection Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Booker to campaign for Dem in Mississippi Senate runoff On The Money: Why the tax law failed to save the GOP majority | Grassley opts for Finance gavel, setting Graham up for Judiciary | Trump says China eager for trade deal | Facebook reeling after damning NYT report MORE (D) and New Jersey Sen. Cory BookerCory Anthony BookerElection Countdown: Abrams ends fight in Georgia governor's race | Latest on Florida recount | Booker, Harris head to campaign in Mississippi Senate runoff | Why the tax law failed to save the GOP majority Booker to campaign for Dem in Mississippi Senate runoff Warren, 2020 Dems target private immigration detention center operators MORE (D), ahead of the state’s Democratic primary in 2020.Though Sanders has not yet announced intentions for another presidential bid in 2020, the Vermont independent has visited a number of states in recent months leading up to midterm elections in November to stump for congressional candidates.Sanders was also set to campaign for J.D. Scholten, who is running against Rep. Steve KingSteven (Steve) Arnold KingIowa governor: Steve King needs to decide if he wants to represent ‘the values of the 4th District’  Conservative magazine posts recording of King using derogatory language against immigrants How Steve King turned his back on states’ rights for Big Ag MORE (R-Iowa).View the discussion thread.The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 faxThe contents of this site are ©2018 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}