{"id": "\n\n\n\nCrunchyroll\n\n\n\n\nBig Apple, Big Plans for Crunchyroll and VRV at Anime NYC!\nRelated Article", "paragraph": " New York, we are back and excited to end the year with Anime NYC November 16-18 at the Jacob K. Javits Center!We’ve got a lot going on at the Crunchyroll booth, so much we needed to get a little bigger just to fit it all! Grab your friends and check out all of the cool stuff at booth # 721. CR Games is excited to show off demos of the DanMachi: Memoria Freese x Attack on Titan collaboration and more.Grab your best squad if you think you have a shot at the gold. We have a Golden Kamuy Treasure Hunt to get some sweet buttons as well as take photos with some cosplayers (care of ACParadise). Find the 4 prisoners and return to the booth to claim your prize. Premium Members (for Crunchyroll and VRV) don’t forget to stop by and get your Premium Member badge, a bag of your choice, and a mystery pin (while supplies last).The Bananya Pop Up Shop is here for all of your Bananya needs! Get your own Bananya or Bananya gear in case you want to take a little of the Bananya pool experience home with you.Looking for a chance to try out VRV? Come hang with us in our lounge at booth #203. You can try out the app, or just chill and watch some shows with us. We’re even bringing a little preview of the VRV Gallery for ya’, if you’re feeling artsy. Looking to throw down against your friends? We’ve got a bunch of fun games like cornhole, Giant Jenga, and Connect 4 so you can show who’s on top. Don’t worry, we got your free swag. Grab some VRV pins after you give your legs a rest for a bit. Walking the hall can get tiring.We’ve partnered with Anime NYC to bring some sweet rewards to our VRV and Crunchyroll Premium Members. Check them out here. You’ll need your Premium Member Badge to unlock all of these perks so make sure to grab one!We’re very excited to bring a special collaboration with ANiUTa and Anisong World Matsuri to our premium users! Crunchyroll and VRV Premium members will have a chance to win an exclusive opportunity to take a photo with two of the biggest musical guests traveling the world on the Anisong World Matsuri tour: Hironobu Kageyama and Hiroshi Kitadani, or TRUE and nano.You could win a photo op with them by picking up random raffle tickets that will be waiting for you when you go to pick up your premium rewards at either the Crunchyroll booth or Premium Reward area near Anime NYC registration. This is extremely limited with only a limited quantity of tickets available. Arrive early for your chance to win. May the odds be in your favor!And don’t forget to check out our panel!Crunchyroll Industry Panel - Saturday, 5:00pm - 5:45pm at Panel Room 2\nRead More »\n"}