{"id": "Airstrike kills at least 19 civilians at Yemen vegetable market, official says", "paragraph": "WorldWorldWorldWorldWorldWorldWorldBusinessWorldWorldWorldWorldWorldWorldWorldBusinessworld news\n            Airstrike kills at least 19 civilians at Yemen vegetable market, official saysShare this articleAt least 19 civilians were killed and 10 others injured on Wednesday in an airstrike at a vegetable market in Yemen, a local health minister told NBC News.The airstrike hit a market in the city of Yemen's Hodeidah province, Sana'a-based heath minister Taha Mutawakil said. Eight of the injured were in critical condition and at a local hospital, he said.The minister added that the bodies were so badly damaged that it was not yet possible if those killed were men, women or children.A Saudi-led coalition that intervened in Yemen's civil war in 2015 has conducted frequent airstrikes targeting the Iran-aligned Houthi group and has often hit civilians, although it denies doing so intentionally, according to Reuters.News of the airstrike comes as Saudi Arabia is facing international condemnation for the killing of writer Jamal Khashoggi at a consulate in Istanbul. When the kingdom finally acknowledged Khashoggi's death— 17 days after he disappeared after entering the consulate to obtain documents for his upcoming marriage — Saudi Arabia claimed the writer died following a \"quarrel and fighting by hand.\"That explanation, and repeated claims that Saudi Arabia's crown prince was unaware of the operation, even though some of his lieutenants were involved, has drawn international skepticism.On Tuesday, the Saudi government said a 15-member squad was sent to take Khashoggi, a legal resident of the U.S., to a safe house in Turkey for up to two days to try to convince him to return to his homeland.Turkey's President Recep Tayyip Erdogan has said his country has \"strong signs that this murder did not stem from a momentary incident, but it is rather a planned operation.\"NewsResidents in Yemen told Reuters violent clashes erupted in the southern outskirts of Hodeidah, a port city that pro-government forces have been trying to capture from the Houthis since the renewal of an offensive in September.A spokesman for the Saudi-led coalition, Colonel Turki al-Malki, told Reuters the alliance is investigating the incident.\"We take this report very seriously and it will be fully investigated, as all reports of this nature are, using an internationally approved, independent process. Whilst this is ongoing, it would be inappropriate to comment further,\" he said.The coalition sometimes admits \"errors\" and has in the past pledged to hold accountable anyone who caused civilian deaths, according to Reuters.The coalition entered Yemen's conflict after the Houthis ousted the internationally recognized government of President Abd-Rabbu Mansour Hadi.The war has killed more than 10,000 people, displaced more than 2 million and driven the country, already the poorest on the Arabian Peninsula, to the verge of widespread famine.On Tuesday, theUnited Nations humanitarian chief Mark Lowcock said, \"There is now a clear and present danger of an imminent and great big famine engulfing Yemen: much bigger than anything any professional in this field has seen during their working lives.\"The U.N. said that revised assessments showed that the number of people facing pre-famine conditions could soon reach reach 14 million, three million more than the estimate last month.Share this articleworld news\n            world news\n            world news\n            USA\n            Hungary\n            Cuisine\n            "}