{"id": "\n\n\n\nCrunchyroll\n\n\n\n\nViz Media Announces My Hero Academia: Smash!! Spinoff and More\nRelated Article", "paragraph": "Viz Media announced three new manga licenses and a novel at this weekend's Anime NYC, including Hirofumi Neda's My Hero Academia: Smash!! four-panel manga. That one's due out in summer 2019 along with Tomohito Oda's Komi Can't Communicate and Paru Itagaki's Beastars.  Viz also licensed Rokuro Inui's Automatic Eve novel and will release it under the Haikasoru imprint in June 2019. Here's more on each from Viz's press release: MY HERO ACADEMIA: SMASH!! The superpowered society of MY HERO ACADEMIA takes a hilarious turn in this reimagining of the best-selling series! Join Midoriya, All Might and all the aspiring heroes of U.A. High, plus memorable villains, in an irreverent take on the main events of the series, complete with funny gags, ridiculous jokes and zany humor!  KOMI CAN’T COMMUNICATE Socially anxious high school student Shoko Komi’s greatest dream is to make some friends, but everyone at school mistakes her crippling social anxiety for cool reserve! With the whole student body keeping their distance and Komi unable to utter a single word, friendship might be forever beyond her reach.  BEASTARS At a high school where the students are literally divided into predators and prey, it’s personal relationships that maintain the fragile peace. Who among them is a Beastar—an academic and social role model destined to become a leader in a society naturally rife with mistrust?  AUTOMATIC EVE (Novel)A mighty shogunate ruling the land from Tempu Castle. An imperial line of strict female succession. Caught between these two immense powers, the sprawling city of Tempu is home to many wonders—not least a superhuman technological achievement in the form of a beautiful automaton known as Eve. When a secret that threatens to shake the imperial line intersects with the mystery of Eve’s creation, events are set in motion that soon race toward a shocking conclusion. A new, astonishingly inventive science fantasy masterpiece of historic proportions.  -------Joseph Luster is the Games and Web editor at Otaku USA Magazine. You can read his webcomic, BIG DUMB FIGHTING IDIOTS at subhumanzoids. Follow him on Twitter @Moldilox. \nRead More »\n"}