{"id": "", "paragraph": "Can HN explain me why and how to overcome that?Conversely, when you have free time, are you filling your free time with stimulus that take away the boredom? (e.g. browsing the web, video games, substances) If so, that's why the creativity and desire to learn are then disappearing.When you have free time, try not allowing yourself to succumb to stimulus, and allow yourself to be bored. Then see if the desire to be creative returns.\nreply\n\nI've been struggling with it since my fascination of  computers turned into a career, a catch-22 of sorts, where your livelihood forces you to sit in front of a computer screen, constantly teaching and reinforcing your neural reward pathways in a way that using technology is pleasurable, should you want to actually enjoy doing your job.Mindfulness and meditation is the only way I can break the association but it gets mentally fatiguing having to constantly break the cycle, then reinforcing it at work, then breaking it again at home every few days.Anyone experience this phenomenon/have a good solution that works for them, short of abandoning tech and becoming a monk?\nreply\n\n\nreply\n\nAlthough if you overdo it then things like browsing social media don't so much stave off boredom but merely become a way of spending time bored.\nreply\n\n\nreply\n\nWhat has helped is pacing t work, take more breaks. Chatting to colleagues socially for 10 minutes a couple of times a day for example is a break from coding that seems culturally acceptable (but sitting in your car might be seen as slacking)The save same energy for personal projects.Also your personal projects should be super fun. I almost gave up on one because I wanted to use a similar stack to work - typescript, web pack, npm, browserify, mocha, plugins for browserify to work with type script, npm configs, typescript configs to name a few. Glad i didnt have to set all that shit up at work!Then I thought fuck it I'll use Elm. The generated code might be less efficient but I need to enjoy the project.With Elm I was producing in 60 seconds and had a basic app up in a few hours.Now I need discipline to STOP working on this project because its very enjoyable.I'm not saying use Elm. But use and do things that are actually fun and connect you with why you enjoy this stuff. Let someone pay you to do grunt work.Pun intended.\nreply\n\nDespite the fact that I do Java full-time, I despise the language, so I do all my personal projects in Chicken Scheme.   It may not create the fastest programs ever (at least if you use the cool dynamic parts of Lisp like I try to do), but I have a lot of fun doing it, and as a result I end up getting much farther in the project.  To me, a program that exists and works is inherently faster than the program I never finished writing.\nreply\n\nBuilding up your habit is a long process, and it can’t be rushed. Don’t start off too big (i.e. start off spending 8 hours on a project in one day). I mean you can, but if it feels like a drag then you’re biting off more than you can chew. Prioritize on sustainability and consistency; otherwise you’ll unconsciously tell yourself that it’s too hard and set yourself up for failure.EDIT 1: I realize the post is more about having feeling inspired/creative vs wanting to learn, so my thoughts may not be answering OP’s original question.EDIT 2: I think a better way to frame the question is how to bring creative ideas to reality. If that’s the primary goal, building up the habit of trying to apply our ideas is IMO really important. Otherwise, ideas will just remain ideas.\nreply\n\nThe part I found most interesting was:> \"It is as though somehow, the brain retains a memory of the habit context, and this pattern can be triggered if the right habit cues come back,\" Graybiel said. \"This situation is familiar to anyone who is trying to lose weight or to control a well-engrained habit. Just the sight of a piece of chocolate cake can reset all those good intentions.\"> Graybiel speculates the beginning and ending spike patterns reflect the nature of a routine behavior: Once we start, we run on autopilot -- until we stop.\"So this could explain a few things.  One is that when you're in the mode of getting things done at work, it's easy to ride this wave into inspiration for learning.  But when you're at home after work it's easy to ride that wave into distraction.So a potential fix might be to trigger your brain with a stimulus to get back into inspiration mode.  For instance, make a simple note of cool things you learned this week, month, or year, and reflect on it for a few minutes.  This might kickstart you into action for learning.1. http://news.mit.edu/2005/habit\nreply\n\nBut when you start, you realize the camera was delivered to the wrong address and you spend 2 hours on the phone getting it to arrive.When it does you realize that you can’t just use the python code but have to download some C++ patch and that the version is incompatible with your new Ubuntu LTS.Fine, you use virtual box to use an older Ubuntu but now you have to roll back to Python 2.6 which breaks your conv net.Or maybe you want to write a novel hoping to win major awards and be chatted up by journalists.But after 2 pages of a pretty exciting coder’s life you aren’t even sure how to describe his mom and you’re wondering if you should start the scene at night and you’re unhappy with the corny language.It’s the gap between the ideal done form you see and the boring work to get there.\nreply\n\nBetter situation is relative to the situation you find yourself in. So it changes with every situation you find yourself in.\nreply\n\nJohn Cleese has a talk on this [1], that open mode is for creativity and blocked out time for just that, and closed mode is for shipping and staying focused.If you stay too long in the closed mode, you desire the open mode but there may not be enough on your current project to fulfill that.The solution is side projects, compartmentalizing your time, or finding something creative in your current project for more open mode time if possible with time/budget.However, you can't force creativity in the closed mode though so if you aren't given enough room to be creative and play then it won't fulfill the open mode time needed. Modern day project management is heavy on closed mode and rarely allows open mode play, that is a big problem with today's project management and time/budget constraints, it is why games/movies are shipped late, why software sucks today, why work is drab with little control and more, when you force creativity it isn't.[1] https://genius.com/John-cleese-lecture-on-creativity-annotat...\nreply\n\nSo, if all the physicists in your office play tennis, except that one guy who collects butterflies as his hobby, that one guy will have more novel ideas than possibly all the others combined. Everyone else will think more or less alike. He's the one who will be going \"But what if black holes are kind of like cocoons?\" -- which may make him a laughing stock, but probably no one else is making that comparison and it may be fertile ground for new and exciting discoveries.So it's possible that being busy is when your mind is getting sufficient diverse inputs to spark new ideas and maybe you recognize they are half-baked and you need more info about X to have any hope of fleshing it out. So you wish you could delve into it.Starting an idea file and jotting stuff down when busy, then following up later might help.Alternately, it's a general truism that people have kind of an internal quota.Maybe they have an internal need to read 4 hours a day. If their job involves reading 4 hours a day, they are happy and won't read much after work. If their job involves reading two hours a day, they are going to read in bed two hours a night. If their job involves reading five hours a day sometimes, they are going to start going stir crazy that last hour and want to do anything but read.So it can be a case of \"I want to do anything else, just not this. I can't stand another minute of this -- and it's going to last all week, dagnabbit.\"\nreply\n\nI have hundreds of tabs open in my phone’s browser.  Stuff that sounds really interesting and that I’m going to read Any Day Now™.But when Hacker News and CNN ‘run out’, do I read the open tabs?Nope.  I just continuously click Refresh.\nreply\n\nI think some part of it is the Paradox of Choice.  Given 2 options, we can easily choose between them.  Given 200 options, we want to choose the perfect option... and so we spend so much time evaluating the options that we choose none of them.And well, hell, we’ve already discovered 200 options, but given the wide range of digital media available to us, there must be more options.  And maybe the “perfect” option is in that set.  And so we seek even more options - browser tabs, bookmarks, items in our Netflix queue...\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\nMaybe \"busy\" means that you have lots to do, but it all bores you. Or maybe it means that your mind is fully engaged, and new ideas just naturally spin off.I've had about five distinct careers. And at each transition, I went through a period of resisting what I was supposed to be doing. And doing something else, which seemed more interesting. And then that new thing turned into a career. Not every time, of course. There were some dead ends, and I crashed and burned a couple times. But hey, I'm still alive, as Logen says.\nreply\n\n\nreply\n\n\nreply\n\nI came across a piece of writing about Perry's theory years ago and thought \"Gee, that's deep, the guy must be a philosopher\" - and he is. The idea is to have such an impressive To Do[0] list that even when you do the things lower down on it - \"procrastinate\" - they're still not a bad use of your time, and maybe better than the urgent, important things at the top.[0] I just can't write 'Todo', as seems universal in English, because 'todo' = 'everything' in Spanish.\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n1) in an environment of oppression, manipulation or negligence, where a perpetrator, manipulator, or guardian/parent realizes that a victim will come to realize the cause or shirked responsibility surrounding their injustice, the manipulator has an advantage to change your mind or subject before you realize what happened, before you can formalize a pattern or solution or worse attribution. Those who got manipulated survived less or prospered less so had less offspring. The fact that we exist means our ancestors were then probably those who had slight predispositions to not allow \"business therapy\" change your train of thought.2) this is HN, so plenty of us were terminally bored in high school, where we created the habit of postponing exams and task till the very last minute (a sort of handicap move?), at which point we had little time left and started finally doing the task or study. we grew up associating a lack of time with starting to study? perhaps it's also what gives us a good idea of estimating workloads of unperformed tasks?\nreply\n\nAssuming that you are:- equally likely to have the desire to learn/create something new during any given time period- busy for the majority of your time (e.g. you are employed in a time-consuming job)Then you are more likely to find that you want to learn something new while you are busy (since whenever you randomly find something you want to learn, you are more likely to be busy than not).If you swap the second assumption to \"idle for the majority of your time (e.g. you are unemployed, or employed at a more relaxing job)\", then you are probably more likely to make the opposite observation.\nreply\n\nMore practically, maybe a counterpoint, maybe not: My wife's constant scrolling of her social media feed drives me crazy. What a waste of a time, I insist. Yet moments ago she shows me the below. Does it qualify as learning something new, a diversion worthwhile? It's a lifesaving technique I didn't know; arguably an investment of a few minutes that's more valuable to me than the weeks/months/years I might spend to craft a piece of fiction that likely would be unread.tl;dr: utility has limits in making life choices.https://youtu.be/VUsnmGXJ70E\nreply\n\nLearning is always more fun and easy. You can read a tutorial and make progress. Even a rigorous online course is still easier than real life problems because the direction you go in is on rails. You don’t have to do that hard part of deciding what to do and why to do it; the instructor did that already.I often see people divert their attention to busy work that’s easy to make progress on instead of the real and immediate problems. Examples would be fixing all the warnings in a large project, optimizing things that are already fast enough.The real stars of engineering resist these tempting short term buzzes somehow .\nreply\n\nA friend of mine used to search (and share!) some really strange things on Wikipedia like stuff about Rome and Julius Caesar in middle of programming session. I think it just a way to avoid boredom when you've been doing something for some time.As for the cure I think there is nothing wrong with small breaks. It's the big distractions which cause problems. For that a lot of things can help you keep track like an accountability partner, list of tasks broken down into small tasks, a simple spreadsheet where you mark your work times and break times, etc.\nreply\n\n\nreply\n\nOne side effect of doing this is what i call my ideas are marinating. Something which may sound way awesome at a moment may lose all its appeal in a month's time. So it's good to let your ideas sit for a while anyway.\nreply\n\n\nreply\n\nAlso \"busy\" is a relative term. Many people call themselves busy, and whether they really are busy (or productive) is a different story.\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\nThe answer is simple: that's just how humans are. You can do this and that, in all areas of life to be less dissatisfied. Just don't believe for one second that it'll lead to some ultimate state of lasting satisfaction.\nreply\n\nWhen I'm not busy, I can play a game or read a book, and those are way more entertaining than a new project, even a relatively interesting one.\nreply\n\n\nreply\n\nBut also, partly it happen because you don't really think about those ideas into detail while you don't have time - while simultaneously your brain have tons of inputs from projects you need to work on. So  it is easier for them to look cool. When you have time, your brain considers reality of it more.Plus, what you can't have is always more attractive then what you can have.\nreply\n\n"}