{"id": "", "paragraph": "Across all my friends I have seen the results of tai chi (several types), yoga (several types), traditional chinese bone setting, acupuncture, many types of massage, alexander technique, qi gong routines, weigh training, osteopathy, surgery and lots more. I think there's a lot of evidence people should try to avoid surgery.Two people I respect who had tried everything else rave about \"Pain Free\" by Pete Egoscue.The reason for my comment is that in my experience, back pain is treatable much more often than people think. But no one thing seems to work for everybody. And the level of talent and expertise of the instructor/healer is usually more important than the label someone gives to their modality.So if you are in pain, keep investigating! Keep trying different things! And don't fall in to the \"x didn't work.\" fallacy. A different practitioner might do the job even if they say they are doing the same treatment.And if something works, it will work fairly quickly and shouldn't need ongoing expensive treatment by the same person indefinitely. This stuff is usually solvable.\n\nEgoscue's book was the only thing that described what I was going through. He describes how issues in one part of the body can have a knock-on effect on the rest of it. The exercises really helped relieve the pain for me.After a couple of years the pain started to go away. I had taken a month off work to travel. When I came back I started making a conscious effort to worry less and stress less. I think there's a mind-body connection with these things that is not well understood.I would also suggest this website for solid information: https://www.painscience.com/\n\n* daily inversion (Teeter Gravity Boots on a pull-up bar—I actually pull down on the door frame while inverted for extra decompression)* daily yoga (at home, from YouTube videos)* using a standing desk most of the time* Rolfing about once every eight weeks (type of massage focused on aligning fascia. It's pricey and a little pseudoscience-y but actually works really well)* occasional targeted sports massage (if I'm crying, I know it's good)If there's one thing of all those that's made the most difference, it's inversion. I feel so tall now. Seriously, invest in an inversion table or inversion boots if it's safe for you to do this exercise.My posture is still not where I want it to be, but it's much better than it used to be. I still get tight in the neck (likely due to poor sleep posture). I had chronic pain in my left foot (likely plantar fasciitis) that disappears but comes back about once every two weeks. Both have gotten much better with some targeted yoga exercises, but it's a journey.I'm slowly going through the book 8 Steps to a Pain-Free Back by Esther Gokhale (https://www.amazon.com/Steps-Pain-Free-Back-Solutions-Should...). The author studied posture in industrial vs. non-industrial societies, and she concluded that most pain is not inevitable. We have just forgotten about the importance of posture in industrialized societies. The book gives you eight sessions to practice primal posture for sleeping, standing, and sitting. I'm thinking about investing $400 in the Gokhale Method in-person course.I now prioritize flexibility over strength. 20-40 minutes of yoga per day is a large commitment, but it's worth it. I'm still basically as strong as I was when I did CrossFit, even though my \"exercise\" is limited to yoga, basic bodyweight exercises like pull-ups and inverted sit-ups, and long, meditative walks.Finally, I make some lifestyle choices around posture. For example, always getting an aisle seat for flights longer than 3 hours, so I can easily get up to stretch and walk around. Choosing a more-supportive chair at a restaurant over a slouchy booth. Not reading in bed often.If you have back pain, maybe something here will be worth trying to you. Keep at it!\n\nBut the root of it is that I’m not active. I used to ride my bike, run, and lift weights and I weighed 40 pounds less than I do now. But I’ve found some personal projects to work on that I’m so passionate about I’ve wanted to stay inside on evenings and weekends to make progress. Really, I just struggle with a day job that perpetuates our capitalist system, and try to make up for it by doing good open source work when I’m at home.But I wish it was more common to work fewer hours in tech. I’m happy to be paid proportionally but I want a job where it’s okay to work 20 hours a week at a high tech pay rate.I think if I did that, I might get out more. Or maybe I need to find a lower paying job that lets me work on my passions during the day. Then in the evenings I could go play basketball or do night hikes or something.Has anyone pulled either of these off? More specifically has anyone pulled this off in the SF Bay Area?\n\nAnd it's not only posture—if you just browse through topics on general health on Wikipedia (i.e. not acute diseases), you'll notice they're pretty much all linked to exercise. E.g. anti-inflammatory function is linked to muscle work. And of course, you see articles every week saying brain health is dependent on exercise.Instead of a chiropractor, you might want to consult a physical therapist who can recommend daily exercise and regime for the back. E.g. Nordic walking with sticks, which puts load on upper back and shoulder muscles.I don't know how others live with just walks to and from work, but for myself I highly doubt that even a couple hours of exercise could offset being propped at the desk for the rest of the day.For the work hours, you could look into contract work (freelancing), where you could choose your hours and set the rate instead of being locked into the terms of your job. But of course, other considerations also apply.\n\n\n\n\n\n\n\nThe reality is, you require negligible amounts of time to maintain a reasonable level of phsyical fitness.How many pushups can you do in a set?  Probably so few that it requires less than one minute of time.  So why aren't you doing as many pushups as you possibly can every morning before you shower?  Well, simply because you don't want to, and are being lazy.Incorporating a simple stretching and pushup routine to your daily life, once before showering, will have a significant positive impact on your wellness without costing much time.You can add a pull-up bar to a doorway and adopt a policy of always having to do as many pull-ups as you can whenever you walk past it.  I'm assuming you can't do more than one right now, so it takes almost zero time.\n\nYep, it’s much easier to forse yourself to do a pull up then going down on the floor for a push up in my experience too.\n\n\n\nIf I did this policy, by a frequently used door, would I end up overtrained, or would I become so strong in my arms that I could do 30-40 or so when rested? And if so, would my arms become enormous?I'm asking because I'm somewhat interested in this policy, but....since I already do strength training and can do pullups, I'm not sure where it would lead.(I guess I could modify it to only do pullups on workout days, 3x per week, but do them everytime I passed on those days)\n\nFirst, overtraining is so hard for someone just doing normal workouts. Second, progression just doesn't work that way. I've been working for a few months towards doing 500 pull-ups in a single workout. I'm at 160 now, and I still can't do 30-40 dead hang pull-ups in one set. Finally, to become enormous  you need to eat.\n\n\n\n\n\n\n\n\n\nConsidering we're talking about people who aren't doing any exercise at all for \"lack of time\", it's somewhat absurd to be muddying the waters talking about the opposite end of the spectrum; overtraining.The point is to just get off your ass and do some trivial calisthenics every day before you bathe.  In the early stages you're only going to be able to do a handful, maybe not even one pull-up without a chair to assist you, you're not going to \"overtrain\" doing as many as you possibly can in this condition: we're talking about doing very little.  It's emphasized because the amount you can do is proportional to how much time it requires, it's practically zero.In fact, the probable major result is a change in diet because of the brutal feedback attempting to lift your own weight repeatedly every morning can have.\n\n\n\n\n\nhttps://news.ycombinator.com/item?id=18310733It's about precisely that! A physical room as the interface to a dynamic networked system for executing intuitive, easily-composed programs...\n\n\n\n\n\nI'm sure you can find this in SF tech. During your interview process, just make it clear that you value being able to exercise during the day.It doesn't have to be crazy stuff, even just walking on a treadmill, running, or stretching. It's more important to build the habit of doing anything than doing something crazy.There is strong evidence that exercise improves learning and memory (personally I feel it improves focus as well) so in my opinion, you don't \"lose\" this time as you are more effective the rest of the day [0][0] http://www.kurzweilai.net/how-exercise-improves-memory\n\nCaveat: the proposed mechanism might not work if exercising in an area with significantly polluted air (indoor environments can get really bad if the HVAC isn't designed and maintained properly) [1].[1] https://www.ncbi.nlm.nih.gov/pubmed/21708224\n\n\n\nThe big secret (if there is one), is you have to make taking care of your body as much of a priority as your mind or anything else you do. Taking care of your body is also a long term endeavor, which so many people have a hard time seeing. Taking care of your body will likely allow you to contribute to OSS longer into your life than not.\n\n\n\n\n\n\n\n\n\n\n\nDr. Sarno's theory is that the mind can use pain as a way to shift attention away from psychological problems. The subconscious does that by reducing blood flow in the target tissue, which causes pain. Now I don't understand how accepting this as the cause of the pain can make it stop, but that's what happened to me and reportedly for many of Dr. Sarno's patients.About Dr. Sarno:https://en.wikipedia.org/wiki/John_E._Sarno\n\n\n\nI've also read this book, and while I didn't have the immediate benefits of the parent commenter, it did help me to take ownership of my situation, and to work through the pain.For me the key was activity and building up the endurance/tone of the lower lumbar. This hurt a lot in my existing state, but once I cut the vicious cycle of inactivity leading to reduced muscle tone causing more pain, I was able to turn it around and reduce my pain and dysfunction almost entirely.\n\n\n\n\n\n\n\n\n\nThe more modern advice to maintain a neutral spine and let one's gaze rest somewhere below horizontal has made squatting a pain-free experience for me.http://www.fitnessandpower.com/training/bodybuilding-misc/sq...\n\nWhen I moved into a larger space, the default was to get a normal western style bed.  I did this but my back and neck would randomly hurt like never before.  It appeared to clearly be correlated with the switch to sleeping on a deformable surface.So I got rid of the mattress and resumed sleeping on the floor.  Now, ~20 years later, I still sleep on the floor and never have neck/back pain.  Except for when I stay in hotels, where floors are exceptionally dirty, in those situations I often wake up with a stiff neck and/or back after sleeping on the bed.It's worth noting that other cultures don't use the squishy mattresses either, I'm not off the map breaking new ground here.If you suffer from back problems, I think it's reasonable to try adapting to sleeping on the floor.  If it's too low-brow for you, you can spend money on japanese-style tatami mats - you can even get stylish bed frames for them.\n\nI found my muscles kind of sore though after every night, I guess they get squashed a lot more than with a normal bed. I think a thin/hard mattress would probably be a good middle ground.\n\nI have extreme problems with sleeping on my side without a matress, even on just a camping foam mat for a few days. I regularly have the problem with camping trips which last longer then 4 nights, when both sides are just no longer an option\n\n\n\nWhat's the actual problem when you're camping?  Where's the discomfort?\n\nDid anyone try to go back after sleeping on an extremely soft mattress after 30 years here? How long did it take for you to adjust? I do even bring my own pillow into the hotel after spending a few sleepless nights, so i might be an extremely bad example of a creature of habit, but on the ground, it was actually painful and not just a matter of it being unfamiliar.\n\nI'm desensitized in those spots, presumably it'd fade if you persisted.If the pain was more on the interior, like your spine or something, I'd be more concerned.  (which is where my pains develop when sleeping on a bed, where I refuse to ignore them)\n\n>I'm desensitized in those spots, presumably it'd fade if you persisted.Yes, i assume so. Then again, i would be interested if anyone changed habit in that stage of life without enduring that kind of back pain? I dont have any motivation to make myself sleep without a pillow after all.\n\nI'm going to try this. I had a tatami for a while, but maybe not long enough to give it a real try. I had a lot of stress at the time which I think added to back/neck pain.\n\nIt just has to support my head at the right height, as set by my shoulder size when sleeping on my side.  If it's too small or squishy then my head will droop too low and cause neck strain.When camping I'll just use my backpack with a hoody thrown across it to soften the zippers etc.  All that matters to me is the resting head height...  I don't think the composition is important.\n\nA pain in the small of my back went away after I started sleeping on a hard floor with a thin mattress-pad underneath. The discomfort was brutal the first week though.I still love using my big squishy pillow tho, because I like sleeping on my side.I know that sleeping without a pillow has to be good for me... 2 million years of homo-noid evolution without pillows is all the facts I need.However, the most I'm able to go without a pillow is 2 nights. I have such terrible sleep, that I give in and use a pillow the 3rd night.Without a pillow I find I can't sleep on my side (which I love doing), and if I'm sleeping on my stomach then there's too much pressure on whichever face-cheek faces down, causing mild bruising.I'd love to learn to stop using pillows though.\n\nWhat makes you think early humans slept on flat surfaces with no neck support? Is this something you've studied, or are you making things up?Here's what gorilla nests look like:https://www.berggorilla.org/en/gorillas/general/everyday-lif...I'm sure early humans were at least as capable at making beds, and could make something that functioned as a pillow, or at least gave some neck support, if that was comfortable.(To be clear, I know absolutely nothing about how early humans slept. I just suspect that you don't either.)\n\nCongrats on getting past the acclimation period, it seems obviously better for your back.How has it affected your personal life?  The last woman I dated was deeply offended by my disinterest in sharing her bed and insistence on sleeping on the floor after our first few overnights.  This aspect of the practice seems the most problematic, it's had me consider moving to Japan.\n\nThe mattress-pad I use is 4mm of sponge. I use it to help with air-flow under my body. I think I'm eventually going to wean myself off it and sleep on a sheet on a wooden floor (or perhaps a tatami mat type thing).It helps a lot that I don't have a \"steady\" love-life. I keep a bed in a guest-bedroom for the dalliances though. Nobody else I've met in real life so far agrees with the concept of sleeping without a mattress. Pity (for them).\n\nEvolution is a game of trade-offs and compromises, you know.\n\n[0] https://www.amazon.com/Crooked-Outwitting-Industry-Getting-R...[1] https://informfitness.com/podcast/50-outwitting-back-pain-ca...[2] https://www.youtube.com/watch?v=1Z-FyeG7pqY\n\nBut for anyone reading this comment, there are two things I want to share, from hard-won experience:1) Back pain and posture are incredibly complex and counter-intuitive, and come from a complex interplay of biomechanics, perception, and emotion. Anyone who says \"just sit up straighter\" or \"just strengthen your core\" or \"use a  standing desk\" or \"stretch more\" or \"it's a muscle imbalance, go to the gym\" or \"do yoga\" doesn't know anything. Even if you think one of these helped you, it depends on the individual and they can do even more harm than good depending on the person. I think there's even more popular quackery in posture and back pain than there is in nutrition, and that's saying a lot. Even most doctors don't have the slightest clue -- which should be self-evident, given how many people have back pain and how it's not getting fixed.2) The best place to start is \"The New Rules of Posture: How to Sit, Stand, and Move in the Modern World\" by Mary Bond. [1] It's the only book I've come across that takes the right holistic approach, but still maintains respect for \"hard\" science, explains the theory (medically, not according to any \"school\") but also gives you guided exercises. Start there, and then once you've gained a decent understanding of your body, you'll be in a place where you can figure out what more specific techniques you need, if you do (e.g. whether Alexander technique or psychotherapy).[1] https://www.amazon.com/gp/product/1594771243\n\nhttps://www.amazon.com/Somatics-Reawakening-Control-Movement...\n\nSo I call Somatics \"Advanced Feldenkrais\".\n\nHaving back pain that won't go away isn't normal.\n\n\n\n\n\n\n\nA lot of pain I’ve experienced over the years has been caused by an imbalance in flexibility between muscle pairs. Lately I’ve been having issue with the pectoral minor vs. one of the rotator muscles that’s been making overhead pressing a very pinchy experience. Releasing the pec minor with a lacrosse ball has done wonders for improving the comfort (and power) of my overhead press.My only beef with this process is that figuring out which pair is imbalanced is really hard, and I could never do this on my own. It is not intuitive or logical that a pain I'm feeling in my shoulder can be fixed by focusing on my chest.\n\nIt's just I hear so often that the problem with someone's posture is a weak <insert whatever muscle here> contrasted with a normal <opposing muscle> and that the solution is just to go to the gym to strengthen that muscle so they'll be balanced, which will fix the posture... and that's virtually never the case.\n\n\n\n\n\nFor example, how many viruses all basically make flu-or-cold-like symptoms? Have you read about the array of symptoms that a person with MS might - or might not -experience?Back pain is more like that first category, though. Lots and lots of things can cause it, so it really does depend on the individual. Hard science means we can do some investigations, know what is the more normal causes of such pains, and start treatment from there.\n\nIf you're interested, find and read Feldenkrais' books.One of the fascinating discoveries he made was that our internal proprioceptive perceptions are often muted and/or distorted, and that this is a pathological condition, in the sense that improving the fidelity of our proprioceptive perception improves physical, mental and emotional health.The man himself led an interesting life.  He was an engineer and physicist and one of the first westerners to earn a black belt in Judo.https://en.wikipedia.org/wiki/Mosh%C3%A9_Feldenkrais\n\nYou probably know the \"move one arm around in a circle and it looks an inch shorter\". This has been used by scammers to demonstrate their ability as physicians, \"see I can manipulate your body so effectively your limbs are different lengths\" ...\n\nI'm not a rube, thanks.Now, you may have heard of \"evidence-based\" medicine?Or the joke, \"If alternative medicine works it's just called medicine.\"?The length difference I experienced was one aspect of a whole-body pervasive change that also affected and improved my mental and emotional functioning as well as relieving specific physical symptoms.If the effect is real and lasting, which it was and is, then in what possible sense can the practitioner be called a \"scammer\"?After all, I got the goods.As I mentioned, this system grew from the mind of a guy who was a physicist and Judo black belt.  Those are two categories of people who have nothing to prove, eh?  Physicists and Judo black belts do not need \"hocus pocus\" to impress people, eh?The method has a solid foundation and definite repeatable results.  You'd be wise not to sniff at it.\n\nAnd now it also sounds like they highlighted their expertise in unrelated fields, another common conman trick.\n\n\n\n\n\n\n\nAlso I do play soccer 3 times a week for my whole life and am a pretty fast runner so I don’t think my gluteus or hip flexors are weak.\n\nI'm certain I'm building muscles there. The focus seems to be stretching of hardly-ever-stretched muscles, but there are all kinds of postures that are basically body-weight exercises.\n\nFor lower back I’ve found practicing Salabhasana, Dhanurasana, or Urdva Dhanurasana have helped.\n\n\n\n\n\n\n\n\n\n\n\nI think you meant to write - ‘weakened’\n\nNot nit-picking spelling, rather trying to help aboid confusion for any non-native English speakers here.\n\nNot nit-picking... ;)\n\nof course there is a distinction between a mistake (e.g. my fat-fingered typo) and an error (e.g. parent's substitution of the wrong word)\n\nI saw a series of videos years ago (which I can't find online and don't recall the name of) where author claimed focusing on fixed distance close objects so much is messing up our vision.The exercises included a few things, \"palming\" and some other stuff (which I tried once or twice and never stuck with) but one in exercise in particular I do it frequently, at least several times a week, especially after a hard session in front of the screen.The gist of the exercise is (and again, can't find video) is to go somewhere where you can see very far with an open horizon (the ocean, on building roof, something like this, the best thing you can find but less than ideal works as well). You then relax your eyes and sort of gaze off into the distance with hands lifted up next to ears, maybe 6 or 8 inches off each ear. Then you kind of flick your fingers around  where you can barely catch a glimpse of the movement out of the corner of each eye while continuing a relaxed gaze out in the distance. Do that for a couple of minutes, rest and repeat several times. It really works for me and immediately when done the ability to perceive depth seems much enhanced and I can \"see\" better, or that's how it feels. I didn't do any quantitative trials, nor do I know of any, there might be some. But FWIW.\n\n\n\nWhen bending over, whether it's to pick something up from the ground or to wash your hands in the sink, bend from the hips while keeping your back arched.  Do not roll your spine forwards.  If you lack the flexibility to reach your aim, make up the difference by bending your knees.  Your flexibility should improve with time.It was through hacker news that I found an article similar to the following:https://www.npr.org/sections/health-shots/2018/02/26/5877352...Scrupulously correct form when rowing and weight lifting plus special stretching exercises devised by a chiropractor did not help me.  Changing how I bend when shaving or picking things up from the ground did.  If you have back problems, pay attention to how you bend.\n\nhttps://www.google.com/amp/s/www.vox.com/platform/amp/scienc...Some people call it quackery. I dismissed it when I heard about it. Some people swear by it and the connection to psychology and mental health should not be dismissed. Correlation, causation, mentally healthier people are probably more active... etc etc. still. A novel addition to your list of “add this to the mix” when troubleshooting.\n\n\n\n\n\nhttps://www.amazon.com/Mindbody-Prescription-Healing-Body-Pa...\n\n\n\n\n\nHis theory is that in order to avoid dealing with various mental and emotional issues, we unconsciously stress parts or our body until it causes pain. We unconsciously exacerbate this physical pain to literally distract ourselves from emotional pain.Once this is pointed out to you then you may notice the process, making it conscious, which then allows you to consciously stop whatever you are doing that results in pain.\n\nI had issues with that, so the book taught me to allow myself to be angry, deciding at one point that there was enough anger and being free from it.That’s far from forgiveness which needs to be earned by the wrongdoers. Not gifted by the victim after reading a book.\n\n\n\nCould be the best 3 hours you ever invest in anything your whole life.\n\nThat's what I do, i'm quite muscular, but I do work on my shoulders with 4kg weights, no more. But my rep lasts a good 20 seconds (or more, the slower, the better). PER rep. I can tell you you'll feel it very quickly, you certainly don't need a ton to get a serious workout!And and I'd like to concur, 15 years ago I had massive back/neck pain, and doing the weights on a regular basis completely cured that. Same 3 exercises.\n\nI had crippling back pain [literally, it put me to the floor, unable even to crawl] in the lower back that seems to have been guarded against with weekly Shotokan karate sessions - my hypothesis is that my sacroiliac joint was \"tight\" and that the emphasis on low stances and hip-rotation has loosened/strengthened it sufficiently to avoid damage. I did manage to damage my hamstring setting off to run though, now I warm up before I warm up!\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat DLs do as a side effect is teach people how to pick up things properly. Most people are too tight in the their ankles, hips, and rest of their posterior chain so they are picking things up incorrectly all day long. This sets them up for injury. Learning to DL properly is a great way to teach how to properly pick thing up, and I agree it will likely help with most people's back pain. But, doing anything improperly can cause injury.\n\n\n\n\n\n\n\nBuy Starting Strength by Mark Rippetoe and read it front to back. Then watch his videos/DVDs. Then execute the movements per the book and video them.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nhttp://feldenkraisinstitute.com/images/uploads/Smithsonian_F...\n\n\n\nI used to have this constant, nagging lower back pain when I used to sit at a desk working an office job. It wasn't the sort of back pain where you've pulled a muscle after a botched deadlift or you just twisted the wrong way picking up a sock off the floor, but it was the sort of pain where it just felt like there was a warm knot in your lower back that was not-quite-painful but incredibly uncomfortable. Hard to explain. It was hard to sit still and I had to change sitting positions after every 5-10 minutes which made it difficult to actually focus on work. I strengthened my core and tried various stretches but it never went away.This went on for years until I started working from home. I figured, instead of trying to find the perfect way to sit, why sit at all? Maybe humans weren't built to sit for long periods of time but I sure don't have problems lying down! I got myself a laptop stand, started working while lying down, and I've never had lower back issues since.I wouldn't mind having JP's set up in Grandma's Boy either actually (https://www.youtube.com/watch?v=bHLR3faI7lU). Monitors at eye level to eliminate neck strain, seat all the way reclined to relieve lower back pressure, and keyboard at just the right height. Perfect.\n\n\n\nLong term stress causes all sorts of fun on your body (and your mind for that matter). I don't recommend it.\n\n\n\nTried various doctors, physios, osteos, acupuncture, tonnes of massage, cupping.Finally saw some progress this year - one osteo noticed my lower back and sacrum was misaligned and adjusted it and magically the chronic pain at the lower region improved and started to shift.  I also began Pilates which I believe helps to reduce the pain and improve your posture and strength - massively recommend it.Still get pains and joint issues with the upper area now, and actually semi-sprained my lower last week but have rested and used ice baths which has helped.Advice: try as many pros as possible, they all give you differing advice.  A doctor said I had myo-fascia syndrome, after a rushed 5 min consultation - a physio later laughed at this.  Do Pilates - it is designed for the spine and back posture, I found it to help and quite enjoyed it and found it relaxing.  And movement and exercise is an absolute must - swimming helps.Don't train hard martial arts.  I'm struggling to fix my back and progress in BJJ.\n\n\n\n\n\nI've been careful not to push too hard, as I do not want to trade one debilitating injury for another (knees, shins, etc). Highly recommended but surely not for everyone, just those so inclined (I have a lot of excess energy to burn!). A nice side effect is that the exertion is also a mood improver!Don't underestimate vigorous activity (with sensible limits).\n\n- The first class is reminiscent of guided meditation where one technique (afaik) is that your brain focuses on the extraneous input while the body relaxes, thus breaking the feedback loop of unconscious stress to muscle tenseness. This sort of meditation works wonders for muscle relaxation, you can't achieve that degree just by deciding to relax or with stretches.- I'd guess that the movements of each joint and muscle, among other things, improve blood flow and relieve tenseness, which makes them perform better afterwards.The focus on knowing the workings of your muscles is a big part of meditation for me—I've learned that normally I have a lot of tenseness that I can't shed by volition, and learned to look for this tenseness when my posture is bad. This sounds rather similar to what is said about the subject method in other comments.However, I'm not sure if this translates to muscle memory: I doubt that a bunch of sessions and occasional conscious alterations to the posture are enough to train the muscles to work a certain way. The article doesn't go into long-term effects, and notably in the last example the author didn't apply the lessons on her own for some reason, without getting back in the class (though it might've just been too early to develop the self-control).\n\nThree doctors have examined me and concluded that my feet are different lengths which cause my back pain, but I can't afford any customized insoles at the moment.In my lower back, right on the right of my spine I get occasional stabby pain which prevents a lot of movement. It usually stays away for over half a year and then it acts up for a few weeks but now it's been worse. When I get the initial stab it means that for the next few days it can come at the smallest motion that my back doesn't agree with and then after a few days everything seems fine.Except for the last two months my left back of my thigh is also \"stuck\". The muscles seem to be fine, it feels more like a pinched nerve. Going to a professional masseuse doesn't help because they can't hit the spots that hurt, it feels more like its in my nerves. My left thigh hurts even when I'm coughing.The doctors I've seen say that I don't have a slipped disc by visual examination but I haven't been scanned. What could and should I do?\n\n\n\n\n\n\n\nShortly after physical therapy ended, I had some infected teeth removed, and a round of antibiotics.The back pain, a minor neck stiffness that they had just attributed to stress, and repeating strain/tension headaches my neurologist was treating with low dosage muscle relaxers all went away in the days following the extraction, never to return. I was on some pain meds for the first few days after the extraction, so i can't know how quickly the symptoms went away, just that they did.I told all of them in follow up appointments, They didn't know why, only offered suggestions about what it could have been, most relating to the neck and nerves and tension that could maybe possibly influence the rest of my spine/hip.\n\n\n\n\n\n\n\n\n\n\n\n[1] https://en.wikipedia.org/wiki/Feldenkrais_Method\n\n\n\nI think a common cause of back pain is sitting long hours in chairs because of work. Any type of exercise should benefit here.\n\n\n\n\n\n\n\n\n\nIts probably fair to say there is some overlap.\n\n\n\nThe Feldenkrais exercises have almost an algebraic quality (or perhaps I should say combinatorial) in the elaborate way they use symmetry. For example: do something on side A, then do it on side B, then vary it by X on side A, then vary it by Y on side B, then Y on A, then X on B, then do those at the same time, then switch and do X on A and Y on B at the same time. As you go through these permutations you can feel your brain noticing symmetries and contrasts that it wasn't aware of before. Sometimes you become aware that a simple movement is possible which your body had no idea it could do. For example, that you can move your arm behind your shoulder in a way that you would have sworn was impossible, or at least painful, and yet it's totally easy. The method seems to work by rewiring your mental model of your own body, mostly by expanding your awareness of what it can easily do. This is related to pain relief.One of the strangest effects is that it works better the less you do. A common line the trainers use is \"however much you're doing, do half as much\". This is probably because the method works by getting the brain to notice finer and finer contrasts. But it's surprisingly difficult to do less, because in most aspects of life we're so habituated to thinking more is better.\n\n\n\nThe meditation I do focusses more on the mind and the subtle system, where as this focuses more on the mind and physical body. Both require you to be silently aware and train your mind.\n\n\n\n\n\nI've had a lot of non-professional experience with personal back pain and with fixing the back pain of others.  This is what I've found but your mileage will almost certainly vary because back problems are usually very particular.  That said this might help suffers with a similar cause.In my experience there are two kinds of back problems.  These are a) chronic, very bad problems and b) run of the mill everyone's everyday back and neck problems.  I've had both and I've treated a lot of the latter.  * Do not follow any of the techniques discussed in this post without first consulting a qualified professional. *These are two very different situations.  Let's start with the every day stuff because that's by far what most people experience.This involves a lot of neck and arm pain (and lower arm repetitive strain injury) caused (mostly) by computer mousing.  It also includes the cliched lower back pain that lasts for a few days and then generally \"goes away\".These kinds of pains can almost always be fixed within 5 to 10 minutes (yes I know this sounds insane if you've had it for a few years or more) with the right kind of massage (not too hard but not too light) in the right places.For neck pain the massage points are almost always vertically on the shoulders about half way between the neck and the shoulder and horizontally between the spine the shoulder blade about 2/3rds of the way down shoulder blade.  DO NOT MASSAGE THE NECK AT ALL.  Even though that's where the pain seems to be.  It's a referred pain.For shoulder/arm pain the massage points almost always start in shoulder blade (a few different usual suspects) and then follow that down to just below the elbow and then, if it's really bad -- just above the wrist or in the hand itself).Garden variety lower back pain can very often be alleviated with massage points on the pelvic girdle.  These are tricky to find but very effective.  Five minutes of the right pressure in the right place can make almost all the pain \"go away\".So can you go to a massage therapist and get these effective treatments?  My sense of it is, very rarely.  Usually their touch is too light to elicit the full therapeutic response.  Yes you'll feel a bit better but it won't feel fully recovered in a handful of sessions.  You'll have to shop around the get the real deal.  My guess is that most therapists are unwilling to cause the required amount of pain in their massage technique, though that is just speculation on my part.So, moving on to the second category, real bad chronic damage.  In my personal experience it's likely that discs or cartilage was damaged.  Massage will not fix injuries like this.  Furthermore that kind of tissue has a poor blood supply so it takes a long time to heal properly.  In my case it was three years.  And definitely not 5-10 minutes as described above.In this kind of situation, one of the most important things to know is that the further damage you do today will not be felt until tomorrow.  So suppose you fall off your bike and cause this kind of serious damage and after 3 months you feel great so you jump on your bike and ride to work.  It's all good until the next day when you start to feel spasms return to your back.  Why didn't they tell you about this?  I don't know but in my case they never did.The only strategy here is to resign yourself to a long recovery, try to keep limber in the unaffected joints and re-engage the damaged area very carefully and slowly.  Too slow is not good, too fast is not good.  Knowing the difference is almost impossible.  If anyone knows a fool proof way to manage this situation, this side of a team of specialists, I'm all ears.\n\n\n\nhttps://news.ycombinator.com/newsguidelines.html\n\nhttp://www.health.gov.au/internet/main/publishing.nsf/conten...\n\nAnd yet you wouldn't know it from their comment.\n\nThe last thing we need here is people reflexively stomping on the heterodox with one-liners. It has a shallow, nasty effect on conversation, and HN threads are for good conversation.\n\nhttps://www.bmj.com/content/337/BMJ.a884\n\n"}