{"id": "", "paragraph": "\n\n(And not the A4 size common in the UK and elsewhere. http://betweenborders.com/wordsmithing/a4-vs-us-letter/)I remember the frustration as kid getting a book of designs from the US and having none of them work quite right.\n\n\"Not quite right\" means even more fun. We used a non-standard paper format, the resulting planes were a little bit different than shown and this made them unique.\n\nSounds like when I attempt a 1000 piece puzzle. It doesn't always have to match the box!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe US does not use Imperial.  It uses US Customary.This differs from Imperial in many ways especially for volume measure.  And of course Imperial is not a standard.\n\n\n\n\n\nI've been searching the internet for a website that ranks paper planes both difficulty AND purpose. You just saved me a lot of time. On behalf of the girls in my club: thank you!\n\nThe world record paper airplane flight is just a straight up rectangle haha.\n\nHaha, that makes sense though since it optimizes for maximum surface area resisting descent.\n\nhttps://classicreload.com/win3x-greatest-paper-airplanes.htm...Do you plan on doing something like that with your website?\n\nI remember playing this with my dad and having it installed for a birthday party. Fun times.\n\n\n\n\n\n\n\n\n\n\n\nI applaud you for not recommending this site in the first take. But it seems like you should have more support, adblockers being the first line of defense.Thank you for teaching, by the way. I feel teachers need the same thanks that we so commonly give soldiers and first responders.  You are truly on the front line, and we all appreciate you.\n\nMaybe, but in general that boat sailed in 1989: https://en.wikipedia.org/wiki/Channel_One_News\n\n\n\n\n\nChances of being prosecuted for use are roughly zero.Lawful educational use is highly restricted in the UK, but there are few prosecutions. For example if you show TV broadcasts you have to have both music licenses (as well as the TV license) to cover you for when they play music on the show (or in the adverts!).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nI hope this HN bump has been good for Fold N Fly![1] http://www.jakeo.com/portfolio.php[2] http://www.jakeo.com/about.php\n\nlooks like they are hiring.\n\n\n\n\n\n\n\n\n\n[1] https://www.amazon.com/Kids-Shenanigans-Approve-Whoopie-Cush...[2] https://www.instructables.com/id/Paper-Airplane-The-Nakamura...\n\n\n\n\n\n\n\nhttps://www.jpl.nasa.gov/edu/teach/activity/ring-wing-glider...\n\nHaha. Way back in my 2nd year at university (1985!), these were all the rage. Myself and a couple of friends made a giant version out of 6 university calendars. It had a diameter of about 40-50cm. We launched it one day (when the lecturer was facing the board) from the back of a math lecture. The slope of the lecture hall was a gentle 20 degrees, slowly tapering off towards the front. Initially it cleared people's heads with a few cm to spare, then about halfway it was clearing the backs of chairs - fortunately there were quite a few rows from the middle to the front with no one in them - until it finally found the back of some poor guy's head sitting in the 1st or 2nd row. The ring clunked him square and he ended up wearing it. We all exploded in laughter. It wasn't aimed at him mind - he was just in the wrong spot at the wrong time. I still smile when I think of that (does that make me a bad person?).EDIT: got the year wrong (memory is fading...)\n\n\n\nThe other was a plane made with a drinking straw and two paper rings. It always flew really far also!https://sciencebob.com/the-incredible-hoop-glider/\n\n\n\n\n\nYou might already be aware, but when toggling some of the tag filters, mixed in with the normal square images, I get several empty squares that don't link to anything.Anyway, happy folding!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAlso is missing the most important thing. A video of the plane flying.\n\n\n\nTime to pick up a few more.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAlmost the last kid, when it was Sam's turn to \"fly\", he stepped up to the line, crumpled up his design very tightly into little ball, and hurled the paper mass as far as he could.Strangely, I can't remember what happened or who won! But his genius observation of the rules stuck with me.The plane I designed is not among these designs, but a totally square design that I had learned earlier from an origami book. This is the closest one: https://www.foldnfly.com/17.html#The-Square-Plane\n\nThere were some remarkable paper airplanes, making amazing flights, all sorts of research and time went into developing the ideal model.One guy comes up representing his team and he gets out a piece of rolling paper and a lighter.  Tears the tiniest portion off the rolling paper, sets it alight, and then follows it with his finger through the air as it took forever to land on the ground.I believe the incident led to a rule change for later years.\n\nSounds interesting, but I'm confused. So is he walking in front of it, and the flame is pulled toward his finger? Did it travel the farthest that way?\n\nHis finger never touched the plane after it took \"flight\" just pointed to it from the side so that everyone could follow the \"flight path.\"Some classmates were upset, I was just impressed.\n\n\n\n\n\n\n\nThe up draft from the flame wasn't utilized to power the flight, the fire was only used transform the original rolling paper into a \"plane\" by mass reduction through combustion.\n\n\n\nThe burnt ash wafted for well over 60 seconds.\n\nWhen thrown you had to keep the wings folded down unlike a traditional plane. Basically I made a dart. You didn't have to be good at throwing either, guaranteed to work in any weather condition since it didn't rely much on aerodynamics.Unlike regular origami planes, the harder you threw it the further it went. So I always had the biggest guy in class throw it.Suprisingly I never came across the design in any origimai books/sites I've found either, even years later. Its probably out there somewhere but I still remember how to make it.\n\n\n\nhttps://imgur.com/a/KvsowhCI tested it out a few times. It actually sucks. I can't help but see all the flaws this plane has many years later. It only flies up to ~50 to 100feet max indoors which is kinda of awful (world record indoors is 226feet). Once it hits peak pivotal height it just nosedives straight to the ground. Most top tier plane designs have a gliding mechanism on the apex point, mine doesn't.It doesn't really work exactly at a 45* arc either. Its closer to something less optimal at maybe ~35 to 40* for longer distance to prevent nosediving.I always thought this plane was really good. I remember when I had my first airplane competition at elementary school, everyone had shitty airplane designs. This plane went from one end to the classroom to another (25 feet), slamming hard into the wall. Classmates were shocked it performed so well, and it was definitely a headturner as it didn't look like a plane.I think I may have overestimated how good this plane is. Its not really, its mechanically a poor design. It must have just been my imagination b/c I didn't know any better at the time (dunning kruger effect). And had validation in small size competitions. Plus I was shorter back then and things seemed bigger\n\n\n\nI never tried out the rubberband trick but I definitely will next time. Seems like an easy way to make a quick projectileWhenever I visit my nieces/ nephews, this is one of my cheap parlor tricks / fun toys I make.\n\n45 degrees is a theoretical optimum for ballistic flight in a vacuum. From what I recall from school, air drag makes the actual optimum on Earth closer to 35 degrees.\n\n\n\n\n\nIronically, my sister won that one with my design and won a 30-min flight in a \"real\" glider. That was probably ten years ago and I'm still sour.\n\n\n\n\n\n\n\nSo even the wadded-up ball can be improved upon.And no, I don't know why the teachers ever left us alone in the classroom.\n\n\n\nWindtunnel to test: https://www.instructables.com/id/Paper-aeroplane-wind-tunnel...Project form: https://www.sciencebuddies.org/science-fair-projects/project...Another page with slightly different features: https://www.origamiway.com/paper-airplanes.shtml\n\nI thought this was a fantastic eggcorn[1], until I realized that it is the actualy origin of the word 'pastime'. So, it sort of is, but isn't at the same time.[1]https://en.wikipedia.org/wiki/Eggcorn\n\n\n\n\n\nVirtually all of the instructions on the site begin with folding the paper in half in some way.  However, this one breaks that rule:https://www.foldnfly.com/15.html#Spin-Plane\n\"1. Fold the paper in half about two inches before the edge.\"But it doesn't have to!  It could just as well have started with a center fold and then folding the corners to the center to measure, then folding that over to measure again.  The measurement folds don't have to even be full folds -- you could just fold only at the very edges to lock in the measurement.  Also, this plane ultimately has a center fold in it, so it could easily have begun with one.\n\n\n\n\n\n\n\n\n\nSimilarly, you often don't want to fold right to a crease, as it can cause bunching. It's often a better idea to leave a mm or so of extra space for inward folds. Doesn't make the design less pure or anything though.\n\nThe Greatest Paper Airplanes[1], a virtual interactive encyclopedia for Windows 3.1Of course, you can use it in the browser these days[1].It goes through basics and history of flight, basics of paper folding, and gives you dozens of interactive, animated, step-by-step designs.Loved it as a kid, and was thrilled to see it preserved online.[1]https://classicreload.com/win3x-greatest-paper-airplanes.htm...\n\n\n\n- With the paper in landscape orientation, fold the top corners to meet in the middle.- Fold the top corner [just created] down to the point where those two corners meet.- Fold the two new obtuse corners on the top to meet in the middle. Tape into place.- Fold in half left-to-right, so that the taped corners are on the outside of the fold.- Fold the edges back down to the centerline.- Unfold, and smooth out to give it the profile of an upside-down flattened W. The flatter, the better it will glide, but if it's too flat it will spin.Launch by holding the back, as it has no vertical surface to grip on the bottom.\n\n\n\n\n\n\n\nhttps://imgur.com/gallery/b2Q8XIt flies really really well inside.\n\nThus began the hottest aerodynamics contest in my academic life, we experimented with so many designs, tried all kinds of crazy modifications.The interesting thing was, our classroom window was an entire story higher than the cabin roof -- the usual \"paper plane contest hack\" of rolling a paper ball and chucking it  as hard as you can was not very good compared to a functional aerodynamic design with some lift.The \"contest\" ended when a week later someone reported our antics and the school was aghast to find 40-odd paper planes  roosting on the portacabin roof and our entire class was given some stern warnings but luckily noone sold me out as the instigator.\n\nThe record flight is shown at the beginning, with more info on the plane at 13:55, but the whole thing is a fun watch.\n\nI was flying some \"Basic Dart\" and \"Square\" planes (those are the only two designs I know by heart) with my kids the other day and I was thinking, \"I bet there are a bunch of great designs online somewhere...\"  And here we are!\n\n\n\nI didn't have the right tools or expertise to build most of his planes (most notably rubber cement), but I do wonder how these planes stack up against currently popular paper airplane models.He talks a lot about his invention (and patenting) of the Kline-Fogleman airfoil, which creates a vortex that influences the laminar flow and increases stall resistance.\n\nMaking the various models was a lot of fun, although I don't think I ever obtained the specific weight of paper they mention in the book.  That's still on my bucket list.\n\n\n\n\n\n\n\nThis approach works well for real planes since 99.999% of them use standard NACA airfoils that are well documented in the public domain.\n\n\n\nMaking it bigger doesn't \"just work\"... same for the inverse.\n\n\n\n\n\n\n\n\n\n\n\nhttp://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.648...\n\n\n\nFor example I grew up with this one as the \"basic\" / default:https://www.origamiway.com/plane-nakamura-lock.shtmlNotice how it has a high air time and distance. I used to launch them them from my 8th story apartment in the city. On a right day, some would take off and would be carried by the wind to where I lose sight of them.\n\n\n\n\n\n\n\nPop-up books are works of art, but they rely on a vocabulary of a few dozen mechanisms, each of which operates in relation to an opening fold between two pieces of paper or card. Birmingham is a great, systematic expositor of the analytical prerequisites for the wildly creative stuff you might come across in a bookshop these days (there's a boom in spectacular pop-up books, see http://www.bestpopupbooks.com/)I should add: pop-up books are still assembled by hand (in the Far East), not by robot; so if they seem inexpensive, there's a bit of a story there which might not flatter the book trade. A microcosm of globalization.\n\nThrow planes around the world: https://paperplanes.world\n\nI'd have them write down the instructions to make their airplanes. Then I'd follow their instructions in the strictest, most literal sense possible, resulting in some lopsided airplanes.It was a great beginning lesson in algorithms.\n\nOver the last two years I made a lot of paper aeroplanes for my nephew, after that I started to build my own glider planes and now we're into RC planes.If you want to get a bit more of a hobby I highly recommend Flitetest community, they made awesome things, and is a great resource to get kids into the hobby.https://www.flitetest.com/RC-Plane from cardboard pizza box https://www.flitetest.com/articles/flying-wing-made-from-a-c...Flite test Steam\nhttps://www.ftstem.com/\n\n\n\n\n\n\n\n\n\n\n\nhttps://www.worldcat.org/title/great-international-paper-air...It has designs from this competition:https://www.youtube.com/watch?v=U8gWE8wHhkEThere is also a second book:http://www.worldcat.org/search?q=The+Paper+airplane+book+the...\n\n\n\n\n\n\n\n\n\n\n\n\n\nhttps://www.instructables.com/id/How-to-make-an-aerobatic-pa...\n\nOn a windy day in the vortices behind trees at my elementary school bus stop, I had such a square glide for what felt like at least half a minute (unreliable narrator obviously) after launching to maybe 3-4 meters. That lucky random walk wouldn't have worked without the low sink rate of a good square.\n\n\n\nWhen you add a crease to the paper airplane, (say, folding a square corner in on itself at the nose or the tail), it weighs down that part of the plane. So if your plane is pointing up too much, you add a crease in the nose and it flies more level.But why should adding a crease increase the weight of one section of a plane? You're not adding any more paper.\n\n\n\n\n\n\n\n\n\n\n\nhttps://youtu.be/BV6EP9bBbac\n\nhttp://articles.latimes.com/1990-03-16/news/vw-465_1_paper-a...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou can find instructions by searching: \"paperang paper airplane\".There is a TED talk about it: https://www.youtube.com/watch?v=VS7zcI_5Mp0\n\n\n\n\n\nhttps://archive.org/details/PAPERAIR\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nI'm sure there are many newer books and designs these days, but that was the one I knew and loved.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}