{"id": "", "paragraph": "My platform started a few months ago and we are helping companies find devs in a few days. If you are looking for a developer, please check our service and we will help you find a developer! \nI am also looking for a feedback since our service is a new venture. What do you think?If you have any questions, let me know! \nemail: z.wantula@grenadehub.comThe idea is great and I myself have seen too many people in DACH regions overpaying for local developers because they don’t have trust to “unreliable remote eastern European freelancers”.It would be awesome if you provide some case studies on how you helped some big names (apart from saying that Google trusts your guys).\n\nWe have a database of over 1000 Software Houses. On average, one Software House employs about 35 programmers and they are ready to be outsourced to our clients.From our conversations with them, it appears that on the \"bench\" (programmers without a project) is from 5, up to 20% of programmers. Which gives us the  1 to 7 thousand programmers who can be available to our clients at any given moment.When it comes to statistics, as I wrote, we are quite young. Nevertheless, we have served 32 inquiries in the last month and we are getting 5-10 new inquiries per week. On average, we had about 5 candidates per query.The record holder, the query for node.js dev, within 15 days collected 40 offers.Here is the link for this query):- https://portal.grenadehub.com/portal/#/projectSurvey/8efd94a...Those were candidates with over 90% scoring, that we found for this inquiry (not interested info means that client picked a different candidate:1) https://portal.grenadehub.com/portal/#/projectSurvey/ef7a2cb...2) https://portal.grenadehub.com/portal/#/projectSurvey/ef7a2cb...3) https://portal.grenadehub.com/portal/#/projectSurvey/ef7a2cb...4) https://portal.grenadehub.com/portal/#/projectSurvey/ef7a2cb...5) https://portal.grenadehub.com/portal/#/projectSurvey/ef7a2cb...6) https://portal.grenadehub.com/portal/#/projectSurvey/ef7a2cb...\n\nThe site design looks great, friendly. Hello from Czechia. :)\n\n\n\nits pace\n\n\n\n"}