{"id": "Carbon Removal Technologies", "paragraph": "Climate change presents an existential threat to humanity. We are already seeing the effects and they are showing up faster and stronger than anticipated. A report by United Nations' scientific panel on climate change released this month expects the atmosphere-on our current trajectory-to warm up by 1.5 degrees Celsius by 2040. Even the effects of a 0.5 degrees increase will have far-reaching consequences. This research indicates that we are already past the tipping point; even if we significantly reduced emissions, climate change would continue (Source IPCC summary C3 section). We believe there's still time to make a change if we look both to renewal energy and CO2 removal.\"Phase 1\" of climate change is reversible by reducing emissions, but we are no longer in \"Phase 1.\" We're now in \"Phase 2\" and stopping climate change requires both emission reduction and removing CO2 from the atmosphere. \"Phase 2\" is occurring faster and hotter than we thought. If we don't act soon, we'll end up in \"Phase 3\" and be too late for both of these strategies to work.It's time to invest and avidly pursue a new wave of technological solutions to this problem - including those that are risky, unproven, even unlikely to work. It's time to take big swings at this. As a start in this direction, we are going to present four categories focused on removing CO2 that we think deserve more research and attention - which YC would be excited to fund. These ideas press on the limit of what's possible, and we're not sure which side of that line they're on. We know there are a lot of ideas out there, and we want to take an expansive approach to this challenge. That's why we're open to funding companies as well as non-profit research.The frontier technology ideas presented in this RFS straddle the border between very difficult to science fiction. While these approaches are not our Plan A, we think it's time to get Plan B ready. They may seem like moonshots now but our goal is to try to come up with technically feasible solutions at realistic costs. If we can do that, we then need to have a global conversation about the tradeoffs.Adopting renewable energy and reducing future emissions are both important strategies, but we need to do more to reverse the harm we've already done. Each year, we spend hundreds of millions of dollars to reduce CO2 emissions. It's a collective action problem the world has been unable to solve. We can't seem to get around the idea that emitting carbon provides great individual benefit today even though it comes at a great cost to us in the future.We have conviction that it's a worthwhile endeavor to remove CO2 from the air and transform it into something else useful or figure out how to store it safely, long-term. The biggest issue is the scale of the task-we are currently emitting about 40 Gt of CO2 per year. While we are slowly moving away from the carbon economy and will eventually greatly reduce our emissions, we need some ideas for a short-term bridge. We look forward to supporting the most impactful ones. This is a big, ambitious, problem area, and we're looking forward to meeting the founders, scientists, philanthropists, and many others who are taking it on head first.Some of the most popular carbon reduction technologies are:The idea behind BECCS is to capture carbon with trees; burn trees for energy; capture carbon at the smokestack; and bury carbon underground.The deployment of BECCS is controversial, among other things, because of the large land area required.The idea behind Direct Air Capture is to take CO2 from the air and pump it through a plant that transforms it into valuable resource.For instance, one of the companies in the space, Carbon Engineering plans to use CO2 as an input to make synthetic fuels that can substitute for diesel, gasoline, or jet fuel. Other companies plan on creating carbon nanotubes which are useful for batteries.The current issues with DAC are costs ($94/ton of CO2), and a scalable path to large scale CO2 removal.The idea of biochar is to burn organic waste in oxygen-free chambers - and then bury it or use it for agriculture.One researcher contends that burning and burying 10 percent of the world's biomass waste would sequester nearly 5 Gton of CO2  annually. The logistics of actually converting 10 percent or more of the world's organic waste into biochar and burying the result are, at this point at least, incredibly daunting.The idea of SRM is to reflect a small amount of inbound sunlight back out into space. Multiple approaches have been proposed: Space-Based Options (satellites in space), Stratosphere-Based Options (injection of sulfate aerosols into the stratosphere), Cloud-Based Options (making them more reflective), and Surface-Based Options (whitening roofs or reflective crops). SRM is hugely controversial presenting environmental risks, possibility of weaponization, and create regional winners because of unequal deployment.Ideas & content: Gabriel Lopez, Zack Abbott, Greg Rau, Leonid Kozhukh, and Sam Altman; Design: Max Marele; Illustrations & implementation: Vlad Omer; Coffee getter: Radu Spineanu; Feedback & content edits: Maddie Hall, Adriaan Kroon, Camille Ricketts, Drew Reid, Ryan Flynn, Akwasi Apori"}