{"id": "", "paragraph": "Aside from Gmail, there are a lot of SWA these days that load tons of javascript and use loading splash screens (a lot of SASS) apps. I reference Gmail because of all the webapps I expected to never be slow, Gmail was supposed to be one of them. That being said, I'm thankful that I can even use the Basic HTML option at all and I wish more websites allowed this option.\n\n\n\nWorse, I have multiple accounts – and it always defaults to the 'wrong' one, which means I have to go through the splash screen all over again.I'm moving to Fastmail as soon as I have time to switch things over.\n\nIf you're using chrome and logged into your google account on chrome, I think you're already logged in.I don't know how you'd do this if you didn't want your chrome account to be your \"default\" account.  I personal use firefox.\n\n\n\n\n\n\n\nGmail is unusable in my 2012 MacBook Pro. I wonder how Gmail works on low-end Chromebooks.\n\n\n\nWeird how the web allows seemingly simple task to become so performance intensive for the computer. Reading email and performing similar tasks is nothing new to the computer world (thunderbird, outlook, evolution have worked well and fast for years).It seems that somehow, throwing more developper at a given problem (such as email interfaces) seems to only make products slower.\n\nRequiring 16gb or more for email is excessive.\n\n\n\n\n\n\n\n[1] http://paulgraham.com/ambitious.htmlYour comment reminded me of the essay hence posting it here.Gmail app is still pretty fast. When they launched the new one, I was hoping to find a function where you can run a fast version (just like html for slow connections in old gmail, which was super quick even for slow connections) but could not find it anywhere. You can switch back to old gmail, that is faster (less slow) if you like, or if you like the smart compose, you can just kill the apps GMail loads by default - Calendar, Hangouts, keep, Tasks, and much more. Then it may become faster.\n\n\n\nDirect link:https://mail.google.com/mail/u/0/h/\n\n\n\n\n\n\n\nThat mail loading icon just halts at times, it seems random ish.\n\nI remember when gmail was introduced (invite only) and it was blazingly fast and so appealing. Years ago, on browsers that haven't had their JS optimized even 1/10th as well as modern ones.Wirth's law.\n\n\n\nThe classic Gmail is still available and you can still use it though...I switched to fastmail, but I honestly miss Gmail's interface whenever I for some reason log in again.Nor can I really confirm that slow loading speed. I keep hearing about it on hn, but it always finishes within 1 seconds on my end... And is even quicker on refreshes or navigating/edit: chrome network monitor said 5.6s. it was useable after ~1s though. firefox takes ages, however\n\nI too use Proton Mail, but I still have to use my Gmail and Google account for various things I don't have control over.\n\n\n\n\n\n\n\nThis is on a fairly decent MacBook pro with 150mb down, living near one of the largest data centers in the world.\n\n\n\n\n\n\n\n\n\n\n\n\n\n>  I've personally switched to protonmailSo what's the point of this post then?\n\n\n\n\n\n\n\n"}