{"id": "", "paragraph": "The idea is that you should write your (first version of the) abstract using only four sentences:Sentence 1: State the problemSentence 2: State the consequences of the problemSentence 3: State your solutionSentence 4: State the consequences of the solutionThis makes a very to-the-point abstract. Sometimes these work right away and sometimes they have to be refined through multiple iterations. If they need further iterations, the four-sentence abstract is a great starting point.Examples:Most hamburgers are larger than what can be held with one hand. This makes them hard to eat. We present a new type of hamburger, called the Hand Burger, that is small enough to hold in one hand. Experimental results show that the Hand Burger increases eating speed by up to 150%.The node_modules directory of Node JS applications often contain multiple copies of the exact same file. This increases the size of the node_modules directory and decreases application startup speed. We have developed a caching scheme for Node JS modules that maintains a single copy of each unique file. This mechanism reduces the size of the node_modules directory by 75% for the most commonly used Node JS applications and increases startup speed by 25% on average.Horse-drawn carriages have a hard time moving on land because of vegetation. This makes travel slow, or outright impossible. We present a novel concept that we call roads. Our measurements show that roads decrease travel time from years to days to reach the 20 most popular destinations throughout the Roman Empire.\n\n\n\nBy providing real examples you also help the reader build up a mental index in case they ever have to deal with a similar problem.\n\n\n\nThat depends on the goal of your writing.  Technical writer like to think they are above such things, but often the goal is less to convey information and more to keep eyeballs on an article.  Sometimes you want to give the customer what they need as efficiently as possible.  Other times the goal is to hold their attention as long as possible.  You have to adjust you writing to both the audience and the desires of your publication medium.\n\n\n\n(Jokes aside, this is a great post, thank you for sharing)\n\n*  Konrad P Kording, Brett Mensh, \"Ten simple rules for structuring papers\", https://www.biorxiv.org/content/early/2017/05/23/088278* Ian T Baldwin, \"The Baldwin Formula for scientific writing: writing papers and reviews\", https://www.ice.mpg.de/ext/fileadmin/extranet/dept_itb/The_B...* O’Connor Timothy R. and Holmquist Gerald P., “Algorithm for writing a scientific manuscript,”, https://iubmb.onlinelibrary.wiley.com/doi/full/10.1002/bmb.2...\n\n\n\n\n\n\n\n[1] http://blizzard.cs.uwaterloo.ca/keshav/home/Papers/data/07/p...\n\nI failed to save it and i haven't been able to dig it up again, but I liked the idea.  The paper was written in the style it described, as well.\n\n> The five-paragraph essay is a format of essay having five paragraphs: one introductory paragraph, three body paragraphs with support and development, and one concluding paragraph. Because of this structure, it is also known as a hamburger essay, one three one, or a three-tier essay.The digraph presented in the OP really is a great approach, IMHO:## Introduction## Related Work, System Model, Problem Statement## Your Solution## Analysis## Simulation, Experimentation## Conclusion... \"Elements of the scientific method\" https://en.wikipedia.org/wiki/Scientific_method#Elements_of_...\n\nedit: AH!  it was linked upthread on bioarxiv.\n\nhttp://www.treesmapsandtheorems.com/pdfs/TM&Th-samplepages.p...\n\n[0] https://www.microsoft.com/en-us/research/academic-program/wr...\n\n[0]: https://intra.ece.ucr.edu/~rlake/Whitesides_writing_res_pape...EDIT: reading @adtac's reference, it also recommends \"Writing Technical Articles\"[1] as an additional reference (the URL in the paper is not copy-pasteable because of a unicode tilde)[1]: http://www.cs.columbia.edu/~hgs/etc/writing-style.html\n\n\n\nhttps://storage.googleapis.com/pub-tools-public-publication-...\n\n[0] https://cs.stanford.edu/people/widom/paper-writing.html [2006]\n\n\n\n\n\nThought I should point that out in a paper that serves as a guideline on how to write papers well :-/\n\n\n\n"}