{"id": "", "paragraph": "- $40K: 2010-2013, \"DevOps\" at small startup. No ownership/shares.- $45-72K: 2014-Current, Programmer (various job titles) working for state's education departmentEven management here only make $90K capping out around $115K~. But cost of living is low.These threads never have people posting their boring salaries from low cost of living areas, I'm trying to buck that trend.\n\nI hope this also shows that the best way to make money is by frequent job hopping.My salary is about average for the area.1995 - 2000 wanted to get out of the small town where I’m from and my best opportunity was based on an internship I had the year before as a computer operator. Soon they had a programming project and I was the only programmer they had. I was also in graduate school at the time  - starting $10/hr - ending salaried at $35K.2000 - 2007 Software Engineer mostly doing C/C++ — starting $52K ending $70K. The bonuses steadily were cut and the raises were abysmal2008-2012 Software Engineer at a small company that went out of business. Mostly doing C# with a little C++. Starting $77K, Ending $84K2012-2015 Senior Software (in reality a mid level .Net developer) - starting 90K, ending 93K2015-2016 Full Stack Developer - mostly .Net with some Angular. Starting $115K - Ending $115K2016-present “Architect” at a small company - starting 63hr (contract - I took it for the learning opportunity and there was a position that I was eyeing) - present $135K.Next on my agenda is to be an overpriced “implementation consultant”/“Digital transformation consultant”, etc. after my youngest graduates in 3 years.\n\nYep, reading that guy's salary history almost made me want to go jump off the roof, but I figure he lives in CA and probably went to an \"upper-echelon\" college.  Here's mine, from somebody who went to a college that didn't make the US News top 100:\n\nHis compensation is actually less than I anticipated, given that he is in the bay area...\n\nThe other interpretation would be that the absurd salaries that we hear of are the outliers and most very good engineers flatten out at around 200K USD\n\n:(\n\nhttps://www.bestplaces.net/cost_of_living/city/pennsylvania/...I started my career at $30,000 in Colorado Springs.https://www.bestplaces.net/cost_of_living/city/colorado/colo...\n\nIf I made an extra 20K to 30K right now, it wouldn’t change my life significantly. I could reach a few long term goals quicker but I’m really in no rush.\n\n\n\n\n\nI wouldn't necessarily call that underpaid. Being underpaid is when you have to choose between the present and the future. If you can both have good and sustainable living conditions, job security and pension with a decent margin you aren't generally underpaid as such. The exception being if your relative wage affects things worth caring about, like being valued by the people around you.\n\n\n\nYou can call both of those being underpaid, but I would still argue that they are different. Most people need to be comfortable, while most people don't need to capture all the value they can. Staying at a company that pays you less can be perfectly reasonable.The problem is of course that the market doesn't really guarantee being comfortable. A lot of people are being underpaid for being comfortable long term. But as I said leaving money on the table can be a problem in itself. If you do 90% of what produces value, but only get 50% of the value that isn't generally a good thing.The danger of considering leaving money on the table as being underpaid is not seeing the value of things. Many people are saving money for some future event, not realizing what they are giving up, instead of integrating that thing into the present.If you want to work on e.g. open source you don't save hundreds of thousands of dollars for the future. You get enough money that you can do it now. Whether that is having low living costs, extra vacation days, flexibility or room to risk changing jobs to open source companies. Otherwise chances are you just end up with a slightly bigger house.\n\nDB/Ops Engineering1999: $60K base. Fresh out of masters program, large F50 DC gov tech firm (#1)2001: $100K + $5K bonus. After building a successful practice area (still #1)Independent Consulting, Security Ops & DB Architecture2002-3: $150/hr, ~$200K/year. Small, rapid-growth Boston healthcare company (#2)System/Security Architecture2004-7: $150K base, $50K-$80K bonus. (full-time salaried at #2)2008-12: $180K base, $10K bonus. Mid-sized DC gov tech firm (#3)2012-14: $200K base, $20-40K bonus. Mid-sized DC gov tech firm (remote #4)Security Architecture/Product Security2015: $150K base, $20K bonus. Startup (NYC, remote #5)2016 - 2018: $200K base, $20K bonus, $100K options. Large tech (SF, remote #6)I know half a dozen co-workers (senior engineers or technical directors) whose net annual comp is also in the $300K range. It's not common, but if you're pulling <$100K with 6+ years experience in software or security engineering, you're getting screwed. (Throw away account, but happy to respond in thread; edited for formatting)\n\n\n\n\n\n\n\nSo I look at it as plateauing, but rather I freely acknowledge I hit the lottery early from being in the right large city, at the right time, and happened to pick up and enjoy a skill that was in high demand (see Patrick McKenzie for the definitive wisdom on this, and negotiation). Sure, I worked my ass off, benefited from a great university, but mostly was just a smart guy who got lucky and motivated. In some other universe, who knows how things would have turned. But I have zero desire for the 60 hour work weeks of a corporate tech life on the \"leadership\" track, nor the soul-crushing grind of a daily 90-minute commute. When my oldest child took his first steps, I heard every detail. Over the phone, sitting in my corner office alone at like 8:00 on a week night. No thanks. Today, I own my own home on a beautiful, large private piece of land outside a medium sized city. My commute is from my bedroom to my upstairs office, except for a week or so every two months when I fly to HQ. I see my kids soccer and basketball games and I manage no one. I'm an \"individual contributor\" whose paid handsomely and get to work with some of the brightest engineers of my life and travel to awesome places to meet up with old friends. And yes, I do present occasionally, but I don't /have/ to to have my way paid. It's a good life, and this is exactly where I want to be.\n\nI was only glancing and saw the base pay..  Yes I agree contractor vs FTE has a lot of compensation differential beyond base pay.Looks like you have a sweet setup right now. Congrats\n\n\n\n\n\n\nreply\n\nMy salary's pretty much followed the same progression that other's have posted for outside of the high-cost-of-living hubs.\n\n* 2000-2005 USMC* 2005-2008 various (Unable to decide what I wanted to do when I grew up)* 2008-2010 A.A.S. Computer Information Systems* 2010-2015 Backend Developer, 21k => 50k* 2015-2016 DevOps/System Admin, State of Delaware 60k => 68k* 2016-2017 Backend .Net Developer, small company 70k => 85k* 2017-Pres Backend .Net Developer, major bank 100kI live in Delaware - in the sticks - and commute to Wilmington, DE.I probably make under market, but I'm limited on my relocation options and don't have a 4 year degree - so I'm happy with my current position.\n\nSalaries are great, but my best job is still my most underpaid: USMCS/F\n\nMy hard-headedness and willingness to sit in front of the problem longer than most civilian team members has given me a ladder to climb and respect without the degree.It's been hard but worth it. I miss the brotherhood but I feel life as software engineers in today's age, we have an opportunity to make just as much (and debatably more) impact although maybe not as directly as when we were in the streets overseas.\n\nI had a good work ethic before and the Marines definitely put the rest of it into me.Other things it gave me was leave work on time (otherwise you are staying for awhile), leave work behind (enjoy \"outside\" of the job) and be thankful you aren't in a fucking desert.\n\nI almost went back in in 2007... but, basically, had to choose between that path and my current fiance (of 11 years).I've always had a good aptitude for computers - 95 on asvab and I was a Radio Repairman.Got out in 2005 and got my education thanks to the GI Bill.I do miss it - the best decision I made in my life - but am also happy where I'm at.Chris\n\nI haven't had time since I retired to give back to our veterans. I was wondering if anybody knew resources, or do I need to start something?\n\nAll figures W2 gross pay and 40 hour / week jobs\n(No on call, paid OT or I didn't play!)\n\nStarted professional software dev in 2010 after freelancing for $45, raise/promotion to low $50's before getting a new job for $72, raise/promotion to high $70's before getting a new job for $98, promotion to $115 + 10% discretionary/performance bonus. All web development to start, last promotion put me in architecture/pseudo-management roles that includes more backend systems and integrations. Tech roles at my current job top out in the low to mid $130's + 10%, non-Exec management seems to be in the $125-185 range but obviously that info is pretty hard to get reliably. If you don't have any desires to be in management or architecture roles and you just want to be in your IDE coding all day, you can get to $90-100k reliably, and in this area that's enough to max out your 401k, a Roth IRA, and save.I'd love to move to a city and get companies on my resume that people have heard of outside of a 30 mile radius, but SF/NYC are nonstarters as they'd be a 50%+ effective pay cut, and even the less mainstream ones like Chicago, Boston, Dallas, San Diego would be 30% or more.\n\n\n\n\n\n2007: $35k (First job out of school. I didn't know to negotiate better. Also my favorite job I've had)\n2008: $60k\n2012-2015: $80-$115k\n2016-2017: $117.5k\n2018: $100k + quarterly bonus based on company profitsIt's not crazy FAANG level income but the cost of living out here is low enough that I'm pretty sure I make out decently well in comparison.\n\n2006-2016: $25k-$45kyr, $40-$120 per hour. The first half I ran a very small agency that maxed out at 4 people and I wrote all the code, the latter half I was a PHP freelancer. Most expensive WordPress consultant in my city!2016: $52k. Agency web dev. I've never hated a job more. Mostly wrote hacky jQuery and supported an awful laravel app the boss was enamored with.2017: $65k. Front End Engineer. worked on converting a legacy SaaS product into Angular SPA. My boss begged me to ask for a raise (the recruiter screwed everybody), and then I got laid off two weeks later with like 25 other people. Loved that job, sad to lose it.2018(current): $87k + bonuses. Senior Front End Developer. My job is to hack .net with javascript. I think the salary trend is moving nicely. I'm suddenly the richest person among all my friends and the third-highest earner in my extended family. (My family isn't even in the rust belt, they're from a much wealthier region in the country.)\n\n2004-2006  $30k->54k, company went out of business, career path was help desk to infrastructure engineering2006-2011 $40k->50k, 45 Days PTO, public sector, little room for advancement, rewarding work, great time off, education2011-2018 $65k->95k + 12% bonus, 20 PTO days, infrastructure engineering, private sector. 80% remote.2018 $145k, bonus up to 20%, IT Consultant, 20 PTO days, private sector.  100% remote, 30% travel.Never had any job offer stock options.\n\nCurrently working for 40 USD / hour for 32 hours a week, so that means around 65.000 USD per year. This year I started fully working remotely and decided to start a bit at the low end, earnings-wise. When working previously as a freelancer in The Netherlands my last rate was around 80 USD / hour.I intend to raise my rate to at least 50 USD per hour in 2019 and perhaps working 5 days a week, which would mean earning around 100.000 USD per year.\n\n\n\nBut...and this more than makes up for it...my hours are capped at 35 a week. (I usually work between 30-35).And I love it. The tradeoff has been completely worth it for me.\n\n\n\n\n\n\n\nThese are the \"average\" salaries across the industry in different metro areas:https://www.matrixres.com/salary-surveysAs far as $200K being high adjusted for COLA, in the burbs where I live. $330K gets you a house - brand new build in a top rated school system with five bedrooms, 3.5 baths, 3000 square feet with a yard,  two car garage, and a separate nice size office. What does that get you in SV?Anyone making at least $110K can buy that house with an FHA loan with 3.5% down.What a company is going to pay is based on the supply and demand.\n\n\n\nDo you think there are only parks, “diversity of culture”, and good schools on the west coast? If someone is  living in a top rated school zone where the top 20% of earners live, do you really think that the school system wouldn’t be good?\n\nNobody actually plans on retiring in SF. When I'm done working here for 10 or 15 years I'll have enough to move and own a mansion in whatever town you live in and retire. After 2 years of working I already have $170k in savings.\n\n\n\nI'm going to give up 15 years of my life -- the time that most people spend getting married, having 2.5 kids, etc. to live in SV -- when I could spend those fifteen years living in the burbs in a big house with the white picket fence in almost any other major city in the US?Especially if you are a two parent household, the general MO is that the second smaller income can go straight to savings. It's quite easy for a dual income earning household to make 200K if one is software developer and the other just makes an average income for a college grad of $60K-$70K,\n\nIt's also worth noting that cities aren't fungible.\n\n\n\n\n\nThe point is more that it seems like people in the bubble think that a developer living in a major metro area outside of SV making in the low six figures is somehow living in squalor barely making ins meet when they can live where they want in most cities and save - especially if they are a part of a two income household.\n\n\n\nAnd my student loans only got up to ~$25k. The average student loan debt per student at graduation was $37k as of a couple of years ago. Mine will be paid off within a couple of years, at least. She still has a long way to go.I honestly don't know how most people outside of software development or other high paying jobs make ends meet, nowadays.We're doing alright and we bought a house earlier this year, but we're still having to juggle money around during the month to make sure everything gets paid.And yet we're in the top 10% for household income in the country, supposedly (I'm not bragging; pretty much every individual developer on Hacker News that lives in SV should be in the top 5%). It really, really doesn't feel like it.\n\nFirst of all I'm not \"giving it up\" and I have no desire for your lifestyle. It honestly sounds horrible.Enjoy your life.\n\n\n\n\n\n\n\n\n\nPart of a free market is realizing that, if others are earning more money for the same work, there is a good chance that you are undercharging your employer for your services.\n\nMost companies I've known charge what they would consider \"base rate\" + some kind of Cost of Living multiplier. See Buffer's example: https://buffer.com/salary/staff-engineer-web/average\n\nYour claim was that> HN is full of West Coast FAANG SV employees who are outliers.There are two ways to interpret this claim. Way 1 is to assume that you are talking about West Coast 'FAANG' employees being outliers in the sense their nominal salaries are outliers. Way 2 is to assume you claim that West Coast employees are outliers in the purchasing power sense.If I assume way 1, then your claim that 'it's easy for people to feel their salaries are low' doesn't make sense, because salaries would be compared in real terms. Moreover, the SV employees wouldn't really be outliers. They'd be perfectly average.If I assume the latter, which is that the salaries are outliers in real terms, then what I said stands: if someone else is making more money for the same job, you're probably being underpaid.\n\n\n\n\n\nAlso, I'd be a little careful about out-sourcing and rural-sourcing. I've found that many high-quality remote workers charge Bay Area rates regardless of where they live. If they're not, well, that may signal a lack of quality. You can get a bit of a discount, or find a more specialized person than you might otherwise.To those of you in low-cost-of-living areas: Consider raising your rates to signal your quality. You're worth it.\n\n\n\n\n\nIt only takes one of two steps above the average “full stack developer” to be the one eyed king.\n\n1) What you actually get2) What you actually get + what you pay in taxes3) What you actually get + what you pay in taxes + what your employer pays in taxesUsually we talk about #2 when discussing salaries. So if somebody says they make 1000€/month, it generally means that they get 871€ every month in the bank, and their employer actually needs to pay 1338€ ever month in salary + taxes.Can anyone shed some light on whether this is the same everywhere? Like if somebody in Silicon Valley says they make $200k/year, is that their \"#2\" number?Edit:Adding my own #2 history as well (software dev in Estonia), in case anybody is interested:2015 - junior at employer A - 12 000€2015 - mid-level at employer A - 21 204€2016 - mid-level at employer B - 26 400€2017 - senior at employer B - 30 000€2017 - senior at employer C - 48 000€2018 - senior at employer D - 58 500€In my experience, it's very hard to get better salary without changing jobs all the time, so if you know of a company with good perks, it's better to change your job a bunch of times before ending up there (so you can start there with a relatively good salary) - at least, that's what I ended up doing.\n\nI.e. their paycheck will show $16,666 per month at the top line, a bunch of state, federal, maybe local taxes, disability and social security (also basically taxes), etc. and then roughly $10,500 at the bottom line depending on your situation.\\Edit: sometimes people include stock in their pay. This can be perfectly reasonable (guaranteed grants in a publicly traded company) or complete BS (pretending your startup will sell for 1B+ even though you might as well just buy lottery tickets)\n\n\n\n\n\n\n\n\n\nEDIT: Though, come to think of it, that number doesn't include some employer paid payroll taxes. But it's simple enough to multiply by 1.N\n\n\n\nJob titles aren't standardised and can be pretty meaningless between organisations.\n\n(If that's \"Senior\", then what of someone that does have ten years of experience? \"Decrepit Software Engineer\"?  Maybe a series of promotions named after increasingly elaborate tombs? Grave Marker, Marble Headstone, Vault, Mausoleum, Master of the Crypt. Who wouldn't want to be introduced as \"Software Engineer and Master of the Crypt\"? Apropos of the current day. Or maybe progressive tiers of Undead. \"Jerf, Lich Lord of Software Engineering\". That could work. Or maybe you want to go up the Vampire tier... \"Jerf, Vampire Patriarch of Software Engineering\".)\n\nNow 20 years later, I'm introduced as the \"Lead AWS Architect\" because I have about a year of experience with AWS and three certs....\n\n\n\nExperience and output matter. I can't imagine interviewing someone and asking about the current job title.Has this person managed people? Lead teams? Done good work?  Great. Title doesn't really matter for that.\n\n\n\n\n\n\n\nIn those 7 years, I've built up and shipped quite a few products, so I definitely feel like I can say I have more than 2 years of useful experience. But don't feel too offended, I don't really consider myself to be senior - it's just a title that my employers offer me. I definitely know I still have a long way to go before I'm a good developer.\n\n\n\nStill not saying you can't do that at 18, but you probably needed to quit high school and start consulting for teams at 14 to get the experience in by then!\n\nJust being a devils advocate here: I was 14 leading the school programming club and I thought I solved really difficult issue setting up gentoo. Senior at 14?\n\n\n\n\n\n\n\nWhat do you want to convey when you write >Senior< Software engineer on your resume? IMO that you have a lot of experience in the field.Most of the people say they were promoted so their business can sell them as senior. That's BS. I would not like to work with those businesses. Keep calling yourselves seniors.ps. I dealt with the same stigma, and I would feel ashamed when I joined a team where all the devs were 35+ with 10+ YOE and I would call myself the same title as they did. (I was 21 in this example, with 5 years of professional experience). Am I too humble?\n\nSo here's where I have my issue. Why can't someone acquire those qualities quickly? Why should your belief be factored in when gauging someone's expertise? I say, let's just look at their abilities and then decide. You may be surprised at how quickly some people pick up certain skills!> Most of the people say they were promoted so their business can sell them as senior. That's BS. I would not like to work with those businesses. Keep calling yourselves seniors.Here I agree with you. Random titles for the sake of duping people make no sense either and are potentially harmful.> ps. I dealt with the same stigma, and I would feel ashamed when I joined a team where all the devs were 35+ with 10+ YOE and I would call myself the same title as they did. (I was 21 in this example, with 5 years of professional experience). Am I too humble?I would say yes. If you are able to perform the same tasks as them, with the same/better level of finesse, then the only differentiator is age. Why shouldn't you have the same pay packet/title/respect? I believe age is generally positively correlated with experience (i.e. more age = more experience), but I feel it is not really correlated with insight (more age != better insight). Thus, sometimes, younger people can have better ideas and inputs than their older colleagues and deserve the 'senior' title as much as someone that's been working 30+ years, in my opinion.\n\nUsually a project that will give you decent insights takes some time to build. Usually at least 6 months and then several months to see what you did wrong. So if you did this cycle once, you are not aware of how you screwed it up and if other methods would yield better results. If you did it twice you already have the basis to compare methods. Senior ideally tried several approaches and there is simply no time for this in 2 years imo.> I would say yes...Thanks. Looking at this thread I changed my perspective. 1. it's context based, you can be senior after 3 months if your other senior left and you have couple of new people that you need to onboard 2. titles mean absolutely nothing when hiring 3. If I am doing the same work as others I deserve the same title (age made me uncomfortable)So yeah, initially I got offended because I called myself senior later than I could and it seemed unfair.\n\nI agree that a lot of vital expertise comes from mistaken attempts and the need to change strategies.\n\nI have in mind one of the most skilled and mature engineer I have ever collaborated with who has less than two years professional experience. I also worked with many 10y experienced folks who qualify as senior for this, but were pretty sloppy otherwise.\n\n\n\nIn 2 years of experience how many serious products can you take from start to finish? In my opinion, a senior developer is a person who did this multiple times.It's almost like calling yourself lead developer of 1 man team...\n\nTitles merely offer a bracket of salary that a resource can have, once they reach the peak they either have to go up a rank or leave to get more pay.\n\n\n\n\n\nExcept the responsibility of leading other people, on a resume this title would imply you gained that experience while in fact you didn't.\n\n\n\nNote that I didn't say manage other people. I'm talking about helping get the better of the team, showing a junior member how things can be done better, etc. Like a team captain, not a coach.\n\n\n\nStartup in logistics 2018 6 months: 48k euros.Previous: DBA in Portland Oregon in 2013 to 2017 - 60k to 70k then as an EDW dev 78k USD.\n\nThe saddest part is that your salary didn't increase much in 5 years? Going from $60k to $70k to 53k euros over 5 years is pretty much tracking inflation. Over 5 years, my salary increased by more than double your entire salary.You should ask for a raise from time to time or get a better paying job. Especially since DBA/data scientist along with computer security developer/engineer were some of the hottest fields in tech the past 10 years.Some people can spend a month reading \"SQL in 21 days\" and get a higher salary than you in many places.\n\n> Some people can spend a month reading \"SQL in 21 days\" and get a higher salary than you in many places.Can you show me a job listing you think one could apply for after reading a book on SQL?\n\n\n\nThen I moved to Germany to try my hand at a startup to gain more experience.The pay could be better but that’s not my entire goal: loving what I do is important and having a good work life balance is too.\n\n\n\n\n\n\n\n\n\n\n\n\n\nEchter wordt er gedurende het jaar vaak over de bonus tegen het toptarief ingehouden als voorzorgsmaatregel dat je in ieder geval geen extra belasting moet betalen aan het eind van het jaar.Geen wezenlijk verschil dus.\n\nDaarnaast kun je van die 4% extra ook pensioen inleggen (bruto), vakantie kopen etc..Naast dit alles nog winstdeling, die is indd 49% belast en erg veriabel.\n\n\n\n1) What you get in the bank -> Net salary2) What you get in the bank + what you pay in taxes -> Gross salary\n\n\n\n\n\n( It was a clever mind hack by the Keating Labor government to have super not be a subset of your base salary, but rather as an on-top-of entitlement for employees—or from the employer's perspective, an additional wages cost just like payroll tax. Had it gone the other way, people would be more sensitive to their earned money being locked away. )\n\nEven though that doesn't financially penalise me, it still feels a bit mean. From the company's point of view though, I'm sure they'd view it as far more mean if the government suddenly told them they're obliged to pay everyone more.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPoint is, cost of living isn't just about groceries on the farmers' market.\n\nAlso the parent was stating \"for example\" which implies there are other factors.\n\nFor Estonia above, the cost of most everything else than local produce is comparable to the Western Europe or the States. Clothing, petrol, consumer electronics, foreign vacations are not any cheaper.\n\nRent varies 3x between my house to the apartments next door. (Also varies 2-3x within the apartment complex.) I could buy a new Macbook Pro each month, or move next door -- comes out about the same cost.Cost of Living is weird.\n\n\n\n\n\nAnd I had the same experience: it's almost impossible to have salaries jump without changing jobs (and from a business perspective the reasons for that are quite obvious)\n\n\n\n\n\nI'm a non-IIT Masters graduate with 3.5 years of experience and I work at the India center of a non-FAANG US-based company, and I make more than @sures made with 10 YoE (leaving aside stock options as well).Salaries are higher in cities like Bangalore and Pune, but even there the salary ranges are very varied, so it's difficult to get a representative sample. Funnily, if you check on Glassdoor (for what it's worth), you'll find companies (both Indian and US/UK-based) where Director of Engineering in India as much as I make with <4 years of experience.Also, Indian companies are notorious for asking previous salary details/payslips etc before making offers. As such, if you start off at the lower end of the spectrum, you spend a lifetime playing catch up. Usual hikes between job switches is about 1.4-1.6x, so the 2x jump @sures got in 2015 is also not that common (Well negotiated @sures!) :)\n\nThese days it happens in many companies that a very senior folk with 10+ years experience makes something like 2000000 INR (28000 USD) but a fresh college undergraduate is made an offer that is 3000000 INR (41000 INR). It sounds contradictory and pisses the senior folks off but that's the reality of the Indian IT market today.\n\n\n\n\n\nBut my 3000000 rupees example is not unusual. You can see madmax108's comment in https://news.ycombinator.com/item?id=18343962 where he was earning more than 3500000 without being from IIT in just 3.5 years of experience. Not a fresher exactly but when I had 9 years of experience I was earning less than that!Also see https://news.ycombinator.com/item?id=18343659 where someone says fresher salaries of 60000 USD (4400000 INR). So I don't think my example is unusual.\n\n\n\nI have remained in Principal Engineer role and do not want to climb the ladder further because I don't think I can take the meeting load of management role.What do you think about your role? Do you enjoy being Dev Manager more than Principal Engineer? Does it provide faster growth (designation and money wise)?\n\nIt may not provide faster growth designation wise but I'm hoping money wise its a good choice as what I'm now paid is the entry level salary in management in most of the companies I worked for previously.\n\n\n\nHealthcare is usually way cheaper and you can hire maid+cook. All I can say is that money shouldn't be primary driver for your decision unless you are doubling your savings. Also there is huge risk of rupee depreciation which is robbing us of any real wage growth.\n\n\n\n\n\n\n\ncan u share any way to connect with you?\n\nMay I ask what it was?Incidentally, I'm at exactly the same experience as you and I'll just say I make a lot less.\n\n[0] https://capitalmind.in/wp-content/uploads/2016/02/Adj-for-In...[1]https://s.tradingview.com/widgetembed/?frameElementId=tradin...\n\nhttps://tradingeconomics.com/india/gdp : the country is 5x more productive than it was in 2002! By comparison the US has only doubled: https://www.statista.com/statistics/188105/annual-gdp-of-the...\n\n\n\nLast I calculated someone earning 200k INR in 2007 has to be earning nearly 800 k INR by 2017, just to ensure that their earnings are not eroded by inflation. And this is going by government official figures. On ground figures are even worse.Now when you double that salary it comes to 1600k. And is where another caveat kicks in. I know people who make around that with similar experience as sures. So, he is successful for sure but also in the top 95% percentile of the Indian IT salary figures.\n\n\n\nSalaries can start VERY low.  Shockingly so, at least to me. And they ramp up quickly.  The unfortunate side-effect is frequent job-hopping - it's easier to get a big raise by moving (not that dissimilar to the US, just orders of magnitude more impactful).\n\n\n\n2007 - 0 YOE - 2 lakhs INR (3000 USD) - Software Engineer - UK Company2013 - 6 YOE - 11.5 lakhs INR (16500 USD) - Technical Consultant - Australia based company2014 - 7 YOE - 14.5 lakhs INR (21000 USD) - Senior Engineer - Mid Size American Software company2018 - 11 YOE - 30 lakhs (43000 USD) - Staff Engineer - Mid Size American companyCollege - Tier 3 college, I actually dint even have a job after graduating, not even Infy/Wipro/TCS etc. It was mix of circumstances and some hustling that I landed my first job.What I am working on? Plain old ERP systems.How many hours I work each week? 3-10 hrs max per week with projects taking maybe some more time. I manage people well and ensure that they are able to do their jobs effectively lessening the burden on me.For people looking for advice on how to get these kinds of salary - I have a colleague who left the UK company along with me at same salary. Currently he is drawing 20 lakhs (29000 USD) after the same amount of years. One of the reasons is that he went to work for Tech Mahindra.And even though I referred to him at couple of companies like JP Morgan his interview skills weren't great.And, he has changed only 1 company since 2013, while this is my 3rd job.Lastly, different technologies not only mean different salaries but also that your competence might differ. Hence the difference in salaries.\n\n\n\nI honestly couldn't tell if sures was an American, British or Indian through his writing. The use of punctuation, general cadence and adherence to the standards of written communication popular in America mean I have more immediate faith in him as a candidate (however unjustified that may be).On the other hand (8sigma and tata2020) I can tell in a flash that you are from southern Asia, and your writing immediately evokes long online pages of poorly qualified Indian programmers seeking work or personal experiences of dealing with poorly-qualified programmers from India.I'm not, in any way, a stickler for grammar or spelling. However, for reasons I am not sure of, a number of common conventions have emerged from Indians that differ dramatically from American/British usage in casual writing: Not placing a space after punctuation, using \"From\" rather than \"for\", \"needful\", etc.I suspect you could do very well for yourself if you made a few small adjustments in your writing.\n\n\n\nThe only thing I have done is learn tech and non-tech stuff. I do it everyday. It is easy for me because I like technology. Computers have been my hobby for a long time. I read a lot of books in all kinds of domains. And I read a lot more for my special domain of interest (distributed systems). So I think this naturally makes me equipped for most kinds of interviews. I do not like solving or reading about puzzles that do not have a relation with real world projects, so I am naturally bad at such kind of interviews.I am myself not a fan of CTCI. But I think CLRS is a good start. Sorry I don't have better advice than this. Someone else in this awesome forum could be of better help to you.\n\n\n\n\n\n2016 - 1.5 YOE - 700000 INR - Software Engineer - Startup2017 - 2.5 YOE - 1200000 INR - Software Engineer - Another Startup2018 - 4   YOE - 1300000 INR - Software Engineer - Same as above\n\n\nreply\n\n2004: 2,75,000 INR , Software engineer2005: 4,00,000 INR, Senior software engineer2009: 12,00,000 INR, Senior software engineer2010: 14,00,000 INR, Senior software engineer2011: 17,00,000 INR, Tech lead2013: 22,00,000 INR, Senior software engineer (another company)2015: 30,00,000 INR, Senior software engineer (another company)2018: 40,00,000 INR, Senior software engineer\n\n(I mean that's  a 40-fold increase - well done, but if the India IT industry is seeing that sort of inflation it must be a weird ride.)\n\nIt depends, the IT out sourcing companies like Infosys and TCS wont pay such huge salaries, the American product based companies will be happy to pay them for the right candidate.\n\n\n\ncan u share any way to connect with you?\n\nLinkedIn, Amazon, Walmart Labs, Flipkart, Google, Microsoft, Directi, InMobi, Intuit.Some of the company names like Flipkart and Directi is based on very old information (>5 years) I have. I don't know if they still pay as well as they used to.Any one of these skill sets: Big data application development, big data analytics, big data security, machine learning, cloud development. I worked in distributed computing myself.Sorry I don't have a convenient way to offer you to connect with me while protecting my privacy. If you or anyone can create an online medium somewhere where we can talk anonymously, I can join that. I can answer your questions here too.\n\nI can answer your questions here.\n\nDo you have a Masters degree? If yes, may I ask from which university?\n\nI don't have a Masters degree.I cannot share which university to keep my privacy. But I am not from IIT, NIT, or any top state college. Basically I am not from any Tier 1 university or college. My university must be Tier 2 or Tier 3.\n\n\n\nI have no secret. I am decent at my work. Like to keep learning new tech and non-tech stuff. So I think the interviews go well and I get the good paying jobs. Not the algorithm puzzles type of interviews. I suck at those too.\n\nDo you mind giving us a fair idea of how much they make? The highest amount in your experience range?\n\nIn contract based employees in specialized skills the numbers for my experience level goes even higher like in the 12000000 to 16000000 rupees range.It gets me also thinking that I should take risk in life and choose contract based employment. But the work pressure is higher. There is also pressure of renewing contracts. So it is not an easy decision.\n\n\n\nSimple algorithm problems are things that have some connection with my work like vector clocks, detecting duplicates, traversing trees, graph search algorithms. Another type of simple algorithm problems are things that use CS fundamentals only and no ingenious tricks like manipulating trees, matrices and likewise. I can manage these problems in an interview room.But if it is more complex than this like banker's algorithm, manipulating segment trees, finding convex hull, printing numbers on screen in some weird fashion or like that I will get stressed in the interview room. I suck at these.The best interviews for me are those that are related to domain expertise. Like problems involving maintaining integrity of data in a distributed database, implementing partial ordering of events, designing data consistency policies.\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe days off per year in my current job is just like any other company in India. Apart from 104 weekends and 10 government holidays, there are 20 vacation leaves for planned vacations and 12 casual leaves for ad-hoc personal time off. So total of 32 leaves. This has varied from job to job but the number of leaves has always remained between 28 and 34 in these jobs.\n\nThat's a pretty important data point! There are exceptions but I'd say very, very few people doing 200k+ in SV are working less than 40 hours per week, much less ever working 10 hours per week.\n\n\n\n\n\n\n\nEdit: Here's an edited version for easy readability:\n\n\n\n\n\n\n\n\n\n9500000 is 9,500,000\n\n\n\n2001: BigCo $76,000/year + $20,000 signing bonus (first job out of school)2007: Freelancing between $100-$200/hr depending on project2012: Startup #1 $180,000/year + $75,000 signing bonus + a bit of stock that's never been worth anything (but I exercised upon leaving and paid a lot of taxes on, so I'm net negative ~$300k)2015: Startup #2 $240,000/year + lots of stock that's never been worth anythingSome thoughts on equity and BigCos vs. Startups:Before going to Startup #1 I rejected offer of ~$2MM RSUs at BigCo #2 (since split, now worth ~$15MM) and offer of ~$2MM RSU at BigCo #3 (now worth ~$10MM) in order to join what looked like a sure thing. Got another offer from BigCo #2 a few years later for ~$1MM RSUs (now worth $4MM).My peers that went to BigCos have done far, far better than me financially. All are above $500k/year in total comp, and quite a few above $1MM/year due to FAANG stocks going up so much.Startup compensation math just doesn't work when you're competing against the BigCos these days. Liquidity horizons are ~10 years for the few successes that work out, the equity portions are meager (esp after dilution). Even ignoring the risk of no liquidity event, you still come out behind what the big companies are paying these days.I'll probably never join a startup again, but if I do, all salary assumptions assume an equity value of zero.\n\n\n\nThese were L6 offers at the time. Gets much more ridiculous the higher you go (over $1MM/year comp)I'm not a super specialist or anything, just a solid developer (mostly front end, some back end)\n\n\n\n\n\nThe startups are a crapshoot, they can be a great stepping stone, but assume the equity is worth zero. The right 'big company' is going to be more lucrative in most cases by a lot.\n\nI don't know anyone that thinks they'll break even vs. FAANG, and that's even when counting stock options as cash (which 99% of people will rightly tell you to ignore).\n\nI always knew startups would pay a less, but I always thought it wasn't that much less. Turns out I vastly over-estimated the chances of liquidity in startups, and vastly under-estimated just how much the BigCos are willing to pay as you climb up the ladder.Was a very eye opening experience when I started having frank conversations w/ peers at those BigCos\n\nIf a startup has a decent exit, it's usually that founders get a life changing amount of money and then employees get car changing amount of money. Even if my 50,000 shares sell at $10/piece... It's definitely not any better than what I would've received at Google/FB. And I'd be nearly guaranteed to get those shares at Big N and liquidate them vs low single digit chance at a startup. The expected value when it comes to stock compensation at startups, in my rough estimate, is maybe 10% of that of what you'd see at a Big N.\n\nThe Netherlands, 26yo male:45k ($50k) as a technical trainee. It's €3200 ($3600) pre-tax a month and €2350 ($2670) after tax with %12,5 end of year bonus.First job here, and this is already above modal for my country. I'm very happy with it, especially seeing I don't have a formal IT education I just thought myself through hobbies and messing around. Some salaries here are insane!Of course my cost of living is lower but rent/mortgage has gone up _a lot_ in my country since the ECB started printing money. €1500 a month in or around Amsterdam for 2 people isn't weird anymore and there are practically no houses <€250k\n\n\n\nMany people in my country, and NW Europe in general, opt for pay in another currency: time.Dutch people work _on average_ 350 hours less per year than their US counterparts; or about 7 weeks worth when working 40 hours a week.It's not unheard of in my company to have between 30 and 50 paid days off per year on top of the national holidays. These days are negotiated during salary discussions and a trade off between pay and time.https://data.oecd.org/emp/hours-worked.htmGermany, Denmark, Norway, Switzerland, Sweden etc... We all basically opt for more time off than more pay.And this is possible in part due to the high taxes; we have no medical bills, no education bills, pension is taken care of, etc..I for one, would gladly opt for a 4 day work week with 60k pay a year in stead of a 5 day workweek with 90k pay.\n\nGranted, that doesn't continue after you stop working for them, but we do have federal government provided money and medical coverage after retirement age. I think people have a caricature of what the US system is because as Americans we have a culture of complaining about our government, which I usually wholeheartedly participate in :)The bottom line is, in my opinion, if you like your particular culture, you will be happier where you are because it won't be replicated quite the same anywhere else. But the overall standard of living for software engineers in the United States is extremely high. Even when people are complaining about housing prices, they aren't much higher than in Europe, and you get a really nice living space for it that is usually much larger with nicer amenities. And in many places in the US, including where I live, the prices are cheaper and I get a nice big house with land and a beautiful view.\n\nSoftware Engineers definitely get paid more in the US than in the EU. But some of the difference can be explained by it. Although I don't think software engineers in either country have much to complain about.That being said, these perks that I listed go for everyone in the country, not just the top % of all working people. In one form or another this is paid for by people who can, like software engineers.p.s. 4 weeks is the legal minimum amount of vacation days here. Most people have double that.\n\nNevertheless 350/40 = 8.75, but it is still far from covering the wage disparity.I for one, would gladly report an extra hour each day for a 50-500% boost in my salary.\n\nThe more vacation / paid days off per year definitely doesn't cover the (entire) wage disparity. But it helps. I don't know many Americans that get every 2nd Friday off (36hours workweek) while it is commonplace in NL, as well as simply taking August off by default.I'm not saying salaries in the US aren't higher. They are! But I just hope my explanation covers some of the \"mind boggling\" part of how European salaries are lower.\n\n\n\nThe only justification for this policy is something called \"cost of labor\" — in other words: \"We've agreed with other tech companies that nobody's going to raise salaries locally.\"\n\nThis can be done, people are doing it.\n\n\n\nhttps://elsajohansson.wordpress.com/2017/09/13/what-does-a-w...https://m.signalvnoise.com/how-we-pay-people-at-basecamp-f1d...\n\nOf course $208,000 is nothing to scoff at, and money is hardly the most important thing when it comes to life. Just interesting to see that a reasonably large Bay-area company would pay such a high-level engineer barely more than new grads can get.\n\nIn other countries like the UK, a principal architect is probably not getting half that.I would guess from a quick google that an architect in the UK is on around £50k to £70k. Which is $63k to $90k.I'm a senior software engineer with around 10years experience. I'm on £38k ($48k) plus a very small bonus, maybe £2 to £3k if I'm lucky.Last job was a mid-level engineer on £28k. I've seen junior developers as low as £20k and senior engineers on as low as £35k.\n\nI have no affiliation with this company but here's a recent example, quoted at 95k so you could presumably push higher:https://www.ninedots.io/job/lead-react-engineer/\n\nNot everyone is ready, able or willing to start a new life somewhere.And an important detail to remember is that Europeans usually work a lot less than Americans. Due to progressive taxes people tend to choose for more time off rather than more pay.\n\nYep, anecdotal but time is just so much more valuable in my 20s than the extra (taxed) money. The sweet spot atleast for me is a 3 day work week. Pays enough and it has a decent balance.I could never trade this situation for a US dev job even for 3-4x the salary.\n\nAnd time is incredibly valuable, if only because for most of us enjoying time is the whole damn point of working. I find playing with my kid or traveling or working on side projects much more fulfilling than my day job (which is fine, but ultimately just a job)\n\nI agree that the salaries are lower, but also tax is a fair bit less in the UK than some EU countries. When I did the math on paying UK taxes vs registering in France for French taxes, the take home would only have been ~50% of net salary on the French system.\n\nHowever Ireland was where I got a visa, and now that I'm here it's not bad.\n\n\n\nTBF sticker shock isn't just for salaries. When I started looking at private health insurance in Ireland I kept double-checking to make sure they weren't quoting weekly rates or similar; I couldn't believe how cheap it was. Similarly, the cost of living is much more than it used to be, but SV dwarfs Dublin (and most other places) for COL.Also, I just hated coming in to work on Monday morning and being greeted with annoyance that I hadn't read my boss' email from Sunday night. I wasn't too keen on the look of disbelief when I asked for two whole weeks off, either.Funny enough being a European citizen working in California seems like the best of both worlds. You'd get very high pay but still have a fallback in the event of illness, injury, unemployment, etc. And, of course, some of us have partners who don't work in tech and the salary disparities there are much smaller (or in some cases, favour Europe - at least the northern bits)\n\nInterestingly, Dublin ranked 19th in the Economist's 2018 Worldwide cost of living report, whereas London came 30th.\n\n\n\nI could probably double my salary again moving to the US but I don't want to stay in a place that doesn't have a solid route to citizenship. The TN visas being temporary, non-dual intent and not allowing my spouse to work. Maybe my company will transfer me on an L1.Also, there was as story on the BBC today about a firm that can't hire software engineers even offering 100k in compensation (which is pretty good for the UK). I rarely see postings for positions that pay this much. London salaries seem to cap out at around 60k which is peanuts considering how expensive the city is.https://www.bbc.com/news/uk-wales-45891002\n\nAlso, quality of life matters and should be factored in.\n\n\n\nOnce an engineer start working on the continent, I would imagine that it would be hard to go back to Britain solely for monetary reasons.\n\n\n\nI have many friends with the same years of experience as myself, and similar tech stacks. They're working for smaller organisations across the south of England and on roughly £28-30k with few/no perks past the standard UK pension payments.I think a lot of people are underpaid in the UK (including the parent poster), in particular those at smaller companies and smaller consulting agencies. However I imagine it's less of an issue in London.\n\nOn QoL, I have a 2 bedroom flat in a nice area within a 15 min walk of tech employers. This is equivalent to owning prime real-estate in San Fransisco.\n\nIn London a senior engineer will get at least £60k (depending on what 'senior' means and how many currently hot languages you list on your CV). I know people in obscure parts of the country, with next to no tech scene, who aren't far off that.The real money in the UK is in contracting though, or go to the dark side and work in finance.\n\nAlso, it doesn't really matter to me since I'm a US Citizen with no cheap Visa route.\n\n\n\n\n\n\n\n\n\n\n\nPrinciple architect on £150-200k is entirely usual in the smoker.\n\nYou can get lead roles for 100k+ at least in London without having to go to finance.I've seen most mid level roles in London go for between 50-60k.Outside of the capital is very different.\n\n\n\n\n\n\n\nSource: I'm a junior engineer being paid in the mid 30s, most of the seniors I know make well north of £60-70k.\n\n\n\nIt's definitely possible to buy a condo or detached house in Oakland for the 400k-700k that would likely be affordable on that salary. The condo, probably a one-bedroom might be a decade or less old, the house much more likely to be older, and probably not insanely distant from BART. This means reasonable access to SF, but annoying to get further south to the peninsula.\n\nCurious what you mean by that - too high or too low?  What do folks actually put down?Anecdotally, I've seen both - I have friends that put down ~40-50% down, have heard of foreign buyers paying all-cash on multiple homes, but also have heard of people really stretching with 5% or 10% down mortgages to afford a home.\n\n50% down is wonderful! But it's likely most engineers would be unable to manage that. The same is true of all-cash.5% or 10% down is workable, and finding loans compatible with that will not be difficult if you are willing to work lenders familiar with local market conditions. PMI will generally be required, but it isn't likely to be nearly as expensive as people might expect (think 0.5%-1% of total loan amount). Further, odds are against our hypothetical engineer being able to work up a 20% downpayment on a property they want in a short enough timeframe that it does not appreciate out of reach. Finally, the people resting their dreams of homeownership on a major property price crash in the Bay to afford a 20% downpayment should not be emulated, as they are banking on an unlikely event and assuming they will be correctly positioned to take advantage.In short, high recurring cashflow can reasonably be used to make up for a comparatively low amount of liquid cash, and this is often preferable to the other options people might choose to pursue.Knowing what people put down with any certainty is not something I am able to do. I can just say that the old wisdom is sufficiently dated that it should be ignored by prospective homebuyers in the Bay.\n\n\n\nI agree with your point though, no matter how bad it makes me feel :(\n\nDon't feel bad though, these high salaries typically happen at large companies in extremely expensive areas. So, the money isn't as much as it seems, and you likely will feel like a small cog in a giant-money-making corporation. In other words, chasing the money is often not worth it.\n\n\n\n\n\n\n\n\n\nThis could be a title for guy who decides whether to use React or Vue, webpack or whatever.\n\n"}