{"id": "", "paragraph": "This honestly is spot on the way I think about it - I can sleep early, but who benefits from my day to day learning as an adult? My employer maybe? Me in some minor long term ways?Or I can stay up and do things I enjoy, wake myself up with an alarm every day and consume enough caffeine to bridge the gap. This way, I get more enjoyment out of my life in a very direct and measurable way.If 5-6 hours of sleep a night is enough to get paid, I'm not going to make a sacrifice that will cost me personally.\n\n\"Routinely sleeping less than six or seven hours a night demolishes your immune system, more than doubling your risk of cancer. Insufficient sleep is a key lifestyle factor determining whether or not you will develop Alzheimer’s disease. Inadequate sleep—even moderate reductions for just one week—disrupts blood sugar levels so profoundly that you would be classified as pre-diabetic. Short sleeping increases the likelihood of your coronary arteries becoming blocked and brittle, setting you on a path toward cardiovascular disease, stroke, and congestive heart failure. Fitting Charlotte Brontë’s prophetic wisdom that “a ruffled mind makes a restless pillow,” sleep disruption further contributes to all major psychiatric conditions, including depression, anxiety, and suicidality.\"\n\nThe book isn't so much about \"why we sleep\" but rather \"why you should sleep more\" – 350 pages of Walker telling you about study after study after study after study comparing well-slept to underslept people, and all of the afflictions the latter suffer from, often without even noticing it (and the consequences for industry and society).While I found his contrived writing style annoying at times, the content is the kind of eye-opening that makes you want to buy a dozen copies just to give to your family and friends.\n\nI think sleep deprivation can become addictive. Some people don't seem to get, or gets used to, the despair and come to enjoy the single minded numbness to the point where it is actually uncomfortable for them to sleep well and come out of 'survival mode'.\n\nYou can even kind-of emergency manage depression with timed sleep deprivation if there are huge reasons (e.g. pregnancy) you should be off your meds.\n\n(In no way am I recommending this though)\n\nBut then, the elevated mood begets more sleep deprivation and soon you're euphoric, reckless and finally manic as hell.In a way, bipolar mania is like being addicted to yourself.\n\nThat said, I think it is a very important book, and now I’ve hopefully resolved my sleep issue (with thanks to some of the comments on https://news.ycombinator.com/item?id=16671944 - primarily the advice about having a regular “sleep schedule”) I look forward to finishing it!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDon't be disingenuous.\n\nSounds like shaming to me.\n\n\n\n\n\n\n\n\n\n\n\nIn any case, I guess what I'm saying is you seem to have researched the topic and your spending an extra minute or two giving a few more details will probably save a bunch of other folks ten times that, in aggregate.\n\n\n\nOne thing I've really changed my thinking on in the past few years is my attitude towards work situations demanding late nights. I wouldn't smoke a cigarette for work, so why was I making excuses for late nights?I've got an Ouraring, and track my sleep constantly -- but still have trouble getting a consistent 8.5 hours. But I'm getting better.What habits did you change?\n\n^ See above for relaxation techniques. It's just a ripoff from yoga.• Read book before bed, not computer/phone.• Walk• Keep room COMPLETELY dark and quiet• Don't eat heavy a few hours before bed• Walk, bike, or workout\n\n\n\n\n\n\n\nAre there any other watches/devices which measure deep sleep?\n\n\n\n\n\n\n\nIs there really research that shows people need more than 8 on average, or is that a conclusion you've come to about your individual situation?\n\nI think it also varies for a person. My rule of thumb is, I don't want to make a habit of having my alarm clock be what wakes me up. For me, that means that sometimes I'm up and moving less than 7 hours after my head hits the pillow, and sometimes I'm still sawing logs 9 hours later.Stress seems to be a factor. Which, ironically enough, means that the more I sleep, the less I need to sleep.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThink of it in terms of open source projects, where the projects that you might be interested have only a few people working on them - but in the context of issues that affect folk completely outside of tech who don't have disposable income like those you'd see on HN or similar.I seriously recommend that you check out a local \"open data civics\" group, or something similar in your area. You'll find that they're generally filled with junior programmers - but what they need are senior level programmers who can take charge of problems that junior programmers otherwise can't take charge of.  Be that person.FWIW, personally everything that I learn is entirely aimed towards helping the general public (at a distance), at the expense of my own salary. The work has been very rewarding. That said, it would be great if others would take the plunge that I have.\n\nFeel free to email me at the address in my desc. Thanks-a-lot!\n\n\n\nIs there something about software development that makes people feel the need to practice it every waking minute of their lives?I mean, sometimes I do it when there's an itch I really need scratched, but most of the time I'd rather do something else. Basically anything else. Is it so wrong to want to socialize a bit or put on one of the pile of TV shows and anime I'd like to check out?Doing that sort of volunteer work is great, but I just can't, I need to turn it off at some point.\n\nSome things you could do:\n\nSleep is very important for your physical and mental health, and it affects people around you, too.Even those two extra hours you can add are really important. You probably could say \"yeah, I'll just drink coffee in the morning,\" well, NOTHING is a replacement for sleep and coffee has some repercussions in your sleep too (depending on quantity and when you drink it).So if you are sleep deprived and adding coffee to the mix, you're doing it wrong. Inform yourself, read books about it, ask doctors, don't make decisions based on what people say on the internet (myself included) and you will notice a big difference almost right away.I stopped drinking coffee (because I have terrible reflux) and started sleeping more. I wake up in a better mood; I noticed that I'm more productive at work because I'm less stressed, plus my family noticed the change too.\n\n\n\n\n\nConversely I can take 6.5 hours of sleep and do exercise, or sleep for 8 hours and not have time to exercise.Self-help books are noticeably silent on which is better.\n\n\n\nI feel better now.\n\n\n\n\n\nI think most of the people on hn (or at least most well-paid tech workers... do those still make the majority here?) can work less fairly easily, if that working less comes with the massive performance boost that goes with sleeping properly.  I'm sure it's way different for retail and other hourly-type workers.If I sleep more and if I sleep better?  I am just way more effective.  When I'm being effective and getting things done, people are pretty slack about me showing up late and/or leaving early, even at the FANG companies.I mean, I don't know anyone who put \"I worked X  hours a day\" in their promo packet; nobody cares.   no, the idea behind the promo packet is that you show what you accomplished, and how those accomplishments effected the company.My experience is that the boss gets on me about working more only when I'm not producing enough;  usually the solution isn't to work more, but instead to figure out why I'm not performing up to expectations and fix that.\n\n\n\n\n\nThat is, one day you sleep more and don't exercise and the next day you sleep less and exercise.\n\n* Acquire a shorter commute by moving somewhere closer to work, shifting your working hours to avoid rush hour, or working from home.* Bike to work, to combine commuting and exercise time.* Hire help with daily chores like lawn work, house cleaning, laundry, and cooking.* Eat lunch at your desk\n\nI realized that when I used to stay up later I wasn’t very productive, and just wasted a lot of time.\n\n\n\nMany of us (maybe not you specifically) just do things without really thinking about them. Watching TV, playing video games, etc... we do out of boredom or habit. Not because we really want to do them. I think PG has written about cutting out the bullshit that doesn't matter [1]. Those are the things I talk about being stupid. Does looking at FB for an hour before bed matter? How about some phone game? Or binging a whole Netflix series in one night?I get so much more done through the early parts of the day, I end up with more time to spend with my wife doing things we want to do.[1] http://www.paulgraham.com/vb.html\n\nIf you want to get work done and you work best in the morning with no distractions, get up early and go to sleep early.If you work best at night, stay up late and maximise your time in those productive hours.If you are comfortable with your day job and want to maximise life enjoyment it's pretty much the same thing, except you're picking the time best suited for what makes you happy. No surprise that active people like to get up and excercise early, lots of daylight and that fresh morning air is invigorating. It's also no surprise that people who like to game or veg out tend to do it at night when they are slowing down from the day.It is a concious choice though, and I feel many just accidentally fall into a pattern and forget they usually have the agency to choose.\n\nI agree, and I used to be one of those who stayed up later. I found though with myself and some others I personally know that making the move to an early wake up was still better.It's silly, but when you get a mental discipline win as the first thing you do in the morning (getting up) it builds on itself. The next step is, \"I'm up, so of course I'm going to the gym\". From there, \"I got up early to hit the gym, of course I'm skipping that donut\". And so on. Like I said, it's silly in some way, but it also builds this discipline. For me personally, it completely got rid of my procrastination habit.\n\n\n\n\n\n\n\n\n\n\n\n\n\nIf that is the case I think the key is realizing that you are cheating yourself. When you aren't sleep deprived you should be able to do most of your required work mid-morning and take it easy in the afternoon. Then when you get home you won't be exhausted and can do whatever you want and still go to bed at ease.\n\n\n\n\n\n\n\nI could get hit by a bus and die tomorrow and I'd be damn glad I took that extra time for myself each and every day.\n\nIronically, when I am sleep deprived I am more accident prone and more likely to get hit by a bus.But what's almost certain, if I sleep less than 7 hours for more than 1 week, I will catch a cold. My immune system doesn't work as well without sufficient sleep.\n\n\n\n\n\n\n\nhttps://ask.metafilter.com/297591/Origin-of-the-term-Enginee...You see it in popular commentary sometimes- the ideas of engineers, often specifically software engineers, claiming unique knowledge by deriving from first principles, in fields they are but laymen in.\n\n\n\n\n\n\n\n\n\n\n\nUm, don't make-up stupid reasons to do things and justify it with math while ignoring the advice coming from experts in human biology.The GP's same line of reasoning could be used to justify doing cocaine every night. Think of all the extra time you are getting!\n\n\n\n\n\n\n\n\n\nHaving enough sleep lifts up my mood, I am naturally joyful, with easy and reliable access to my memory, and relaxed. All day long.For me, I know that having fewer pleasurable activities in well-rested mode beats the grinding experience of more stuff in grumpy mode.Being 90-100% present and able to enjoy fewer things is better than being 30-60% present, and in partial agony, with more things.So I prioritize sleep which forces me to do less unnecessary stuff.\n\n\n\nI'm fine living until 65 if it was a full, happy, productive life.  I don't need to live forever, nor do I want to.\n\nIt’s like working smarter vs. working harder.\n\nI see no reason to think it has significant impact on emotional enjoyment though as you're suggesting - these studies impact learning primarily which wouldn't seem to be deeply involved there. In fact, studies exist showing positive impacts for depression patients.\n\nPlease, sleep is essential for emotional stability. I know you rely a lot on self-study, many of us on HN do, but schedule half an hour to talk with your doctor or with a psychologist, psychiatrist or sleep-specialist, and let them convince you rather than letting me do it.Sleep is absurdly important in all aspects of life, memory integration, resting, repairing the body, emotional regulation.Not to mention, you are way, way less prone to diseases like cancer, alzheimers, fatigue, depression...And there are other aspects of sleeping that are interesting and enjoyable too, time slept is not time lost, you dream while sleeping, you know? If you really want to optimize time lived, then you should go for 8 hours of sleep and learn about lucid dreaming, for instance.> In fact, studies exist showing positive impacts for depression patients.Not sleeping does indeed have a positive impact patients with depression (and anxiety). I can tell you this because I am one of those people. Out of personal experience, yes absolutely, poor sleep for one day makes you feel better. Why? Because you're so incredibly fucking tired that you literally can't even bother to be anxious.It is horrifying.Please for gods sake have some respect for yourself and for your body.\n\n\n\nIf I sacrifice some of those 8 hours, I feel grumpy, moody, occasionally a bit depressed, but overall get to do more small day-to-day things of value that give me a genuine sense of fulfillment on top of that.\n\nHave you considered that your life is boring and that you're actually participating in a rat race and sleep is allowing you to identify that?\n\nI don't need sleep to identify that ;)\n\n\n\n\n\nWhen you're young your body can take almost everything. I know that when I was 20-22 I would sleep maximum 6 hours per day because I felt the way you describe.Now if I don't take at least 7.5 hours per night (with as few interruptions as possible), my life goes to hell, I feel drained, tired and lost, with depression looming.\n\n\n\n\n\n\n\n\n\n\n\n\n\nOther than that though I find it far more enjoyable to do something other than blindly consume knowledge for no purpose, I'd much rather engage in social activities or play games - even making numbers go up is more satisfying to me than memorizing factoids of limited practical use to me.\n\n\n\nI think that for most people who don't get enough sleep it's not because they are busy squeezing every bit of joy out of life. It's because they're using their phone in bed, watching TV, etc.\n\n\n\n\n\n\n\n\n\n\n\nhttps://smile.amazon.com/gp/chpf/homepage/ref=smi_se_scyc_sr...\n\n\n\nBy \"awful\" I mean that I just think slower. It's like playing a game with lag, not fun. I wonder if/how many people who claim they can sleep 6 hours a day and feel fine have just gotten so used to the lag that they don't notice it anymore.Only thing I'm afraid of is children...\n\nIn my adolescence/college studies, I thought fast, and slept little. I could stay up all night with friends then go to class the next morning. I spent the first 5/6 years of my career being a top performer on 4 hours every weekday, and catching up on 8-10 hours of sleep over each weekend night.Then, 3 things happened almost at the same time:1) I got a much tougher job that challenged me like I never had before (FAANG)2) I turned 303) I lost the ability to sleep in on the weekends. I wake up at 8am now every day regardless of what time I go to bed.Until #3, I got by with coffee and still using weekends for recovery - way more coffee. #3 ruined it.I still got by - and was even successful.Then,#4) I got promoted.Now the challenges are out of this world, and I can't sustain my lifestyle any more. I'm struggling to adjust to going to bed early because my brain and all my instincts are still in the mode of \"Nighttime is for creativity and fun! We can sleep when we're dead!\"But it's starting to affect my work, which in turn is stressing me out, because I really love my job and I want to excel at it. The effects are just as you describe - lag. I'm slow. I'm not as smart as I used to be.So...gradually...i'm learning to force myself to sleep. I welcome tips. :S\n\nLiking a job doesn't really cut it. It's a great start, but no matter how much you like something, it will get to you if you have to do it every day 10 hours a day. That and sleep.\n\nIt is better to start with a healthy amount of sleep and figure out ways to optimize your other time, rather than thinking about what you want to do and using your sleep time as an adjustable lever. The truth is that if you feel like there is nothing else in your life besides work while you're getting a healthy amount of sleep, you need to make other life changes (if you have the option). Limiting your sleep will just ruin your mental and physical health.[1] https://www.washingtonpost.com/news/wonk/wp/2017/02/22/the-a...\n\n\n\nAdmittedly, my week is a little boring this way and I still haven't worked up to doing it consistently, but it's been much more effective than anything else.\n\n\n\n\n\nMaybe not having to be in early might remove some morning anxiety and make it easier for you to sleep in?\n\nSince most things that end up being successful for me over the long term are due to optimizing for long term outcomes, framing the problem that way helps me stay focused on getting proper sleep.\n\n\n\n\n\n\n\n\n\n\n\nWe have so much to learn about the body and sleep.\n\nI think: diphenhydramine or melatonin might be a safer bet for some people. Never take it more than a few days in a row.\n\nExactly.Literally any sleep substance taken regularly can be addictive, either physically or psychologically. Even melatonin, which is what your body produces will get less and less effective.As an aside, melatonin is often sold at dosages insanely higher than recommended. Studied have shown that less than a mg, even low as 0.1mg is the optimal dose for many people, but you can easily find 1, 3, 10mg dosages, which is insane. I was in hong kong, the lowest dosage I could find on shelves was 3mg - way too much.\n\n\n\nDisclaimer: I'm a doctor.It may be different where you are from, but patients are usually the ones who want a script for something and not to be told to put away their devices, stay away from coffee and alcohol, etc.Also, there's a difference between addiction and becoming dependent on taking a substance, which seems to be a common misunderstanding in this thread.\n\nThe more I hear about healthcare from the inside, the more I realize it's a game of \"work on the worst problem, ignore the rest\".  There's limited time in patient visits, and patients have limited motivation, so you really have to prioritize what to fix.  If you tell the patient to fix all the things, the will fix none of them.Worse, patient education is hard work.  Patients don't listen, ignore advice, stop lifestyle changes as soon as it gets hard.  So you focus on one or two of the worst offenders; you convince them cigs are going to put them in an early grave and they should cut back to half a pack a day.  Maybe drop the soda to two liters a day.  The rest of their problems you have to ignore until later.  That's often when meds come into play because they can help bridge the gap while you work on their lifestyle issues.Oh, and all of that happens in 15 minute visits every other month.There are certainly bad doctors out there over-prescribing all sorts of things, but from what I've seen, it's more a matter of prioritizing what to spend your precious 15 minutes on and going from there.  Doctors and other medical professionals are in an impossible situation most of the time.Edit: for clarity, this is an American healthcare perspective.\n\n\n\n\n\n\n\nI'm guessing you're American since you're assuming everywhere has the same crisis you do. From what I've read here (on Hacker News), you have plenty of systemic problems. I doubt blaming doctors is going to be the most useful course of action. But then, I don't really know. Perhaps all doctors in your country deliberately do things that are against patients' best-interests, and would continue to do so if patients actually wanted the best thing for them. Do your doctors really not suggest good diet and exercise as treatments for type 2 diabetes? I'd be very surprised if they don't.Edit for clarification.\n\n\n\nIt's far more important to look at the diet overall than to agonise over the occasional pasta meal.\n\n\n\nMelatonin definitely knocked me out, but I woke up groggy feeling like I hadn't slept at all\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAlso, it's my understanding that when most people talk about exercising for better sleep they are specifically talking about low intensity steady state cardio exercise.\n\n\n\n\n\n\n\nYou describe almost exactly what I face in training and I've seen substantial improvements in conditioning by adding rowing to my workouts. I actually do 45 minutes at around 19 strokes per minute at a 500m split of (average) 1:45. More recently I've moved to doing 1000 strokes per workout. That's at about 275-325 watts per stroke. I use an adjustable water rower with heart rate around 150-170 average. I get around 15-16km per workout.The action is essentially resistive aerobic training, not unlike squatting as I mentioned. I can't say it'll work for you but I can say it's helped me find a form of aerobic exercise that maintains strength and conditioning.Your height will give you a mechanical advantage but a water rower will give a non-linear resistive load so you can adjust it to give you the desired heart rate/wattage to sustain difficult training throughout the workout period.Rowers are considered to be the absolute top of the pyramid amongst athletes in terms of balancing power/vo2 max/aerobic capacity etc etc.\n\n\n\nLifting heavy is the other part. Everyones biomechanics are different, so you need to adjust to fit your own, but being tall is not something unique. There are plenty of tall athletes who put on lots of lean muscle.\n\n\n\n\n\n\n\nIf you don't have a competition coming up (or if you are just training for health), then a mix between aerobic and anaerobic-alactic (strength, explosiveness) is much better.Check my website [1] for the training methods that I usually recommend. For a non-athlete or someone in off-season I would stick to cardiac output, threshold training 1x per week and strength training.You will see much better results and you will sleep better if you change your training approach. Hope that helps :)[0] See Arthur Lydiard's work[1] https://fit4bjj.com/Sidenote: I would recommend actually reading the tabata study. You can see that they also plateau'd after a few weeks (but the study duration was not long enough to see the long-term effects).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSimple examples..Back: pullups. Too easy? Use one arm.Chest: pushups. Too easy? Vary your arms position, or just use one arm.Legs: squats. Too easy? Use one leg.Abs: sit ups. Too easy? Hold something heavy against your chest. Too easy? Hold something heavier.It's not rocket science :) Motivation is the only ingredient you need for all the exercise you can tolerate.\n\n\n\n\n\nThey're a little low and only support <250lbs, but otherwise they are perfectly fine for the average home workout.\n\nYou can also do inverted rows under a table by holding on to an edge (not comfortable, but works).You could invest into a dumbbell and/or resistance bands and do row variations. Or a TRX for inverted rows.Or go to a park or anywhere else where you can hang onto to do your pullups.\n\nFault! This is adding weight. Better luck next time. :)\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhen I work out at night I usually feel energized afterwards and tend to stay up later.\n\n\n\nThanks!\n\n\n\n\n\n\n\n\n\nDo what works for you, but do remember that your life is just another anecdote. Stop telling others how to live their lives.I stay up way too late all the time. My sleep is irregular. I rarely get as much sleep as I would if I went to bed at 10pm every night. And yet I'm extremely healthy, I pop out of bed every morning, and I'm always in a good mood. I don't get colds, I don't have memory problems... I don't have any of the horrible effects you all are sure I must have because your book says I must.\n\nBut I agree with you, if you get less sleep than generally recommended and you feel fine, then there is little point in sleeping more.\n\nObviously, many detrimental effects of sleep deprivation only kick in after many years. And then there are the outliers. Just because you can cross the street blindfolded with headphones on without checking traffic doesn't mean it can generally be considered safe.\n\n\"Studies have shown\" is the classic hint that \"this person has no clue that they're talking about\".Show me specific reproduced experimental studies with proper controls, talk about effect size, and then there would be no argument. Such proof has failed to arise for countless health trends in the past, no matter how intuitive they may have been.\n\nand in 2010: https://news.ycombinator.com/item?id=1207945\n\n\n\nSo I'd need 2 x 4.5h blocks to get close to how I'd feel with 1 x 8h stretch. Even then, only close. Couldn't quite get it to feel the same and definitely not better.TBH I think most of the 'off' feeling about it is in how it broke my normal perception of days and time passing. I spent a lot more time having to consider where I was, temporally, and how it lined up to anyone I needed to interact with.\n\nI'm able to be very productive on this schedule but obviously not everyone is able to follow a schedule like this.\n\n\n\nOther times I'll go to sleep right after dinner, awaken around 11 PM, do stuff until 2, and then sleep until 7.I always feel well rested on days like either of those.\n\n\n\nI feel that I need to do it, as it's very difficult for me to go to sleep before midnight and if I don't get the mid-morning sleep I will be ineffective in the morning. At first I felt bad about doing it (going back to sleep when everyone else is working) but I usually work until about 9 pm at night as well as on the weekends for about 3 or 4 hours on Saturday and Sunday so I feel I am working a normal amount, just at really odd times. And I feel much more productive, particularly in the afternoon which I used to reserve for low-brain activity work.It replaces a much shorter catnap I used to take in the mid-afternoon, which I have been doing for some years. I no longer need to do that.\n\nI have high mental clarity currently. I had high mental clarity when I went to sleep. I did have issues sleeping, but this is nothing new on a ketogenic and fasting state.From the vast research I've done, sleeping may be more important on a high-insulin-fluctuating diet. However, when the body and brain are fat adapted (less insulin), there is a constant fuel source. The brain operates very efficiently on ketones. Also, important to note that when fasting and doing keto, you must supplement electrolytes.There is a lot more to all of this and the notion behind the importance of sleep. Anecdotally, diet proves to be more important for me. Do your own research.related:\nhttps://www.alzheimers.net/diabetes-of-the-brain/\n\nDoing this has helped my sleep so much and my productivity has gone through the roof.I don't do ketogenic though, I believe a good source of carbs in our diet is fine. I tend to get mine from sweet potatoes. I stay well away from refined sugars though.\n\nI actually do a high-glycemic (talking baked sugary madness) load/refeed around intense workouts every once and awhile; also keeps me sane.\n\nCould you link to some of your peer-reviewed articles in moderate-to-high impact journals? I'd be really interested in hearing about that vast body of research.\n\nhttps://news.ycombinator.com/newsguidelines.html\n\n\n\nhttps://news.ycombinator.com/newsguidelines.html\n\n\n\n\n\nI would encourage nearly anyone to try it. It's an amino acid found in the highest concentrations in green tea. If you've ever had a couple cups of green tea and noticed you feel relaxed and focused, you might want to try an L-Theanine supplement.\n\n\n\n\n\nThis isn’t so bad because I’m at work at 06:00 anyway. But it’s no fun if I sleep earlier.I recently went to doc and said as much. Got prescription for 25 temazepam to take as needed in the AM to get me back to sleep.I don’t use them much, but knowing they’re there helps a lot.My other tactics are: jog after work and a few sets on the heavy dumbbells. No food or drink for two hours prior to retiring.Plus, I keep a bottle of liquid melatonin (sub lingual) and a phased release melatonin tablet (swallowed) by my bed. I’ll otfen have a dose of the liquid melatonin plus a tablet as I lay down and read a book in bed. The liquid acts rapidly, tablet less so.I find this combination of food restriction, plus excercise, plus melatonin, plus reading novels, gives me waaaaaay better sleep than reading HN all night ;)\n\n\n\n\n\n\n\nhttp://super-memory.com/articles/sleep.htm\n\nSpeak for yourself.In sleep about 9h a day.\n\nSleep clinic would be the most precise but personally I think it induces its own bias as we sleep best in our own beds. Hopefully we sleep in our own beds most of the time.So what consumer choices are there?Apple Watch is what I read in this thread but any other fitness trackers/phones with reasonable accuracy ?I am very doubtful of just a phone app accuracy without some on body sensors.\n\n\n\nSometimes you might wake from 7.5 hours of sleep groggy and with a headache and sometimes you might feel fresh after 6 hours.If good sleep is one of the most important things in prolonging and improving your quality of life then it would make sense to take advantage of modern technology to track it.What's the point of investing extra $100 for retirement if you do not live to enjoy it?Besides, I live in a country where retirement is far from certain.I would at least like to know the optimal time for waking up.\n\n\n\nAlso waking up without an alarm clock can sometimes lead to oversleeping which is not optimal either.Ever wake up groggy and with a headache on a Sunday morning after 10 hours of sleep?\n\nPretty comprehensive recent review https://www.wareable.com/health-and-wellbeing/oura-ring-2018...\n\nAll fitness bands brands (Huawei, xiaomi, Fitbit) today track your sleep. You can give it a try and decide by yourself.\n\nStill not certain whether it works or not. Sometimes it tells me I’ve slept with a 90% quality but I still wake up feeling a little bit tired..\n\n\n\n\n\nEdit: http://super-memory.com/articles/sleep.htm this seems to be the same article.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}