{"id": "", "paragraph": "After the n-th frustrating experience we decided to do something about it. We're trying to collect as much (anonymous) data as possible about bad experiences involving fellow developers and unprofessional recruiters and one day publish all the curated data for free, to create a sort of Yelp for recruiters.You can help us by filling out the form at https://dontrecruit.meAfter all you wouldn't waste time at a crappy restaurant, why waste time with a crappy recruiter?Let me know if you have any questions/feedback. I'll try to read (and answer) each and every comment.1) Specifically seeking out bad reviews is likely to attract angry rants. Yelp has their share of bitter people lashing out because they can, and anonymous content tends to encourage it. How do you intend to combat that behavior?2) People grow and improve. I don't want to be judged for my work or my behavior from my early days in the field. How are you going to be sure this isn't unfairly capturing the worst moments of someone's career just because they are new at it and haven't learned any better yet?\nreply\n\nOr are currently in a bad company which forces/encourages this kind of behavior. I wouldn't mind recruiting company reviews though. Because there would be a few on my blacklist.\nreply\n\n\nreply\n\n\nreply\n\nRegarding point 1) there are ways to fight unjustified negative reviews (e.g. \"I didn't get a job, this agency sucks!\"), similarly to how they do on websites like Yelp. This is more of a community guided effort (unless we start actively moderating reviews, which is an option).For now we're focusing more on building a sort of index of \"horror stories\" involving recruiters but before releasing the data we'll make a big effort not to publish biased content or blatant lies.For point 2) We absolutely agree and we are still discussing how to release the data so that \"nobody gets hurt\", at least individually. You can keep in touch with us by adding your email address to the form (even if you don't want to share any story, although it would be much appreciated). Feel free to use a temporary email address or an alias.\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\nHence why I said we should make this more clear, as in: we're not going to publish the names of the individual recruiters.\nreply\n\n\nreply\n\n\"I'll need your resume in Word Format.\"\"I can give you a PDF\"\"Give me the original in Word Format.\"\"There is no original in Word Format, I wrote my resume in LaTeX.  Besides, why do you need to be able to edit my resume?\"And... ghosted.\nreply\n\nI don't do QA courses. I do TDD development. And I never mentioned Udemy.com to them either.They put words in my mouth.\nreply\n\n\nreply\n\n\nreply\n\nI no longer deal with recruiters if I can help it, but if I find myself using them again I'd consider offering to add their logo onto my CV myself to avoid them butchering it.\nreply\n\nI can't speak for tech recruiting companies, but at the company I work for removing the header is a method of anonymizing the resume to prevent unconscious gender/race/etc... bias based on someone's name, city, ZIP Code, etc...\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\nSince they're all but certainly going to ghost you anyway, why not just\"Sure, here's the original. This is using features that aren't in the ancient Debian distribution of TeXlive; you'll want to follow the excellent instructions at https://github.com/posquit0/Awesome-CV to get XeLaTeX configured correctly (or it'll bomb out with the most inscrutable of errors).I'm having a couple of locale issues with attaching files through pine at the moment, so I've pasted the source below. I trust it will not be difficult to copy-paste to a new file.Thanks!\"\nreply\n\n\nreply\n\nIn fact, that would be a great catalyst to weed out 99% of recruiters who aren't willing to make any sort of effort.I'm not joking. I might just apply this one...\nreply\n\n\nreply\n\n\nreply\n\nExternal recruiters are generally expensive and bad. By using them, you reduce the quality of your reputation. They charge 25% or more of the first year salary per placement.If you are big enough to afford it -- that is, you're making more than four hires a year -- use an actual employee as your recruiter. Make sure that they are familiar with your company's actual culture and business practices, and can speak authoritatively about HR policies. Pay them a regular salary and benefits, so that they have no incentive to lie. Pay bonuses based on the performance of the employees they hire after those employees have been working for you for a year, so that they have an incentive to get high-quality people in.The recruiter is the first face of your company. That experience should be considerate, consistent, responsive, and above all positive. An unsuccessful candidate should leave the experience thinking that your company would still be a pretty good place to work in the future, and maybe they should recommend a friend who would be a better fit.\nreply\n\nWhen I get 8 contacts over 2 weeks for the exact same position, that lets me know there are huge red flags ahead.  Or, and this is more fun, you're contacting me for a position I already interviewed with and turned down.Are you in a death spiral and need bodies ASAP?  Does your comp suck?  Does your office suck?  Does your location suck?  Are you too picky in your interview process?  Maybe a mix of all of these?\nreply\n\n\nreply\n\nThe biggest problem I have with them is their incentives are misaligned with what you want. A recruiter doesn't make their money by getting you the best offer. They make their money by helping sign a lot of people. Which is why they always ask the salary question. So they can build a rolodex sorted by salary ranges and then experience levels. In fact, there is probably algorithms for prioritising the placement of the most qualified people asking for the least amount of money.I would almost be worried about new comers in tech who maybe haven't dealt with recruiters before as recruiters are VERY good at extracting personal information. In any other field what they are doing would be illegal. In fact in information security you would call it social engineering. But people in recruiting just call it their job.It's even worse when you consider that this is a part of the process when people might be more vulnerable or desperate. Perhaps ironically the old work-from-home-fake-job-offer-scammery-roo is also used by identity thieves, doxers, and fraudsters for the same purpose and really: Is there much difference between that and recruiting? Both of them sell a lie to extract profit from the person they target and the means they do so is extremely similar.\nreply\n\nLooking at the list of reasons why a recruiter might be \"bad\" some of the blame is on recruiting company structure, but another major source of blame is on employers.They sign contracts with recruiting firms, give little to no oversight, and provide a limited set of information about the role/responsibilities/comp/etc. At the same time, a lot of employers are really bad when it comes to retention. This combination leads to recruiters/recruiting companies that get away with bad behavior and still make a lot of money since it's purely a numbers game and they find that subset of engineers willing to tolerate their behavior. And companies pay them large fees for each transaction.Protip: If you want to get rid of a lot of recruiter contacts, deactivate your LinkedIn. And make sure your public commits on  Github don't include your real e-mail.\nreply\n\nNormally you might be in contact with 10-20 recruiters for a few months and end up working only for one company for the next few years so the impact recruiters have is a superset of the employer's.Maybe recruiters could stop selling the company to death and openly admit what is wrong with the current state of things (e.g. poor Joel score). People appreciate honesty and I would definitely work for a company that admits their problems but is willing to fix them.Also getting rid of recruiters altogether is not a viable option.\nreply\n\nBest ones are \"looking for a $TECH ninja/pirate/spaceman\", yada yada, they have a ping-pong table, lunch etc.No mention of salary range. Not one. Like I'm doing this purely because I enjoy it (I do, but that's beside the point)!Why the heck would I apply for a job that doesn't pay?\nreply\n\n\nreply\n\nI'm fed up getting messages on LinkedIn along the lines of:Hi LeBowen\nYou are exactly what TheWorldsBestCompany are looking for, is it OK for us to have a phone call to discuss?Of course when you try to obtain any information about the position, you're met with vague details about it, but they have this other position you might be interested in.\nreply\n\nThe initial email needs to hook me somehow, and show that you've at least put some amount of effort into personalizing your pitch to me, specifically (you know, show that you've actually read my profile and explain why'd I'd be a great fit for your client).\nreply\n\n\nreply\n\nIf you're job hunting it pays to approach potential employers directly. It also makes a much better impression.\nreply\n\nAt this point in my career, I've probably interviewed at 200-300 companies. I think I can count the number of times I've received a positive response for a position I applied to directly with one hand.All my interviews have been from recruiters (whether it be third-party or in-house) reaching out to me, or friends referring me.Maybe my resume just sucks?\nreply\n\nI’m no special snowflake I’m just your bog standard enterprise developer/architect and honestly I just started taking my career seriously in the last ten years. Five of the mentioned 7 jobs were in the last 10 years.\nreply\n\n\nreply\n\nI’ve worked with local recruiters almost exclusively over the past 20 years. If I send you a resume directly, I have no way of knowing whether you looked at, how much of  your job req is fluff, what the necessary and nice to have skills are etc.When I work through a recruiter, they’ve already been debriefed by other candidates who interviewed for the same position and they  can tell me what the interviewer prioritizes.I’ve also worked with recruiters from the other end as a hiring manager (actually Dev lead), I would call the recruiter back and give feedback.\nreply\n\n\nreply\n\n\nreply\n\nI'm a DBA, but I also get recruiters always telling me how I am perfect for a Sr. full stack engineer.\nreply\n\n\nreply\n\n\"This is unacceptable, developers can write code and could exfiltrate data\".\"Umm... someone needs to be doing database updates, backups, restores, etc.  Who do you suggest do that?\"  (bear in mind there's only 3 tech people on our team, and only 6 people total involved in the company's business).\"Typically a DBA or a manager would do that work.  It would need to be someone who couldn't write any code to exfiltrate data\".We just sat on the call for another minute or so.  I asked him to detail out the process by which someone who should be incapable of 'exfiltrating code' should also be the person who has access to manage the structure of a production database.  We got nothing back except a checklist of stuff that we'd 'failed' with no remediation suggestions.So... apparently some large companies do not consider DBAs as \"developers\" for certain checklists.\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\nIn the UK we have a list of \"spammy recruiters\" who consistently disrespect \"unsubscribe\" requests and send useless/unrelated emails see: https://github.com/drcongo/spammy-recruiters\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\nI could write a whole book of these stories (as I'm sure many others reading this post could as well) but I'll recount one of my favorites.I had interviewed with Abbott Diabetes Care in Alameda, CA, and gotten a job offer, but went with a different opportunity.  Fine.Recruiters would still blow up my inbox and phone with that role for months to come.  And being employed, I was getting really short with them.  Like, say \"not interested\" in half a second, hang up in a second, super-rude short.  The trouble was it took 3 minutes squeezing the details about the job out of the person before I could get there.One recruiter with a very thick accent was being exceptionally coy with the details after he cold-called me.  The role was in \"California\", and then once pressed he said, \"Alameda, California\".  Alameda's not all that big, and it's a bedroom community more so than most Bay Area cities, with the exception of a couple business parks next to the airport, where Abbott is.I asked, \"is this with Abbott?\"  \"No, no, no..\"\n\"Ok, who is it with?  What's the company's name?\"It's with.. (shuffling of papers).. \"uh-BOT\".\"That's Abbott.. Dumb ass.\" <click>40+ years old and I'd never called anyone dumbass on the phone before.\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n> Don't worry, we'll keep this bit of information privateSo the rest isn't?And then... there's lots of mention of 'we' in this thread and on the form, but no mention of who 'we' are.This is harder to trust than a recruiter that at least states who they are.\nreply\n\nFunniest thing is that I misspelled my online-handle when I registered at hacker news ...\nreply\n\nInstead of feeling lucky to have a skill highly sought after, and to live in an economy that can afford to not only pay good money, but that will even send people out to throw that money after you, you still find reason to complain.Set aside, I am aware, that there are crappy jobs, companies and people around, that want to scam and screw you.But overall, that situation is quite a luxury, ... complaining about that is even beyond the proverbial first world problems.\nreply\n\n\nreply\n\n\nreply\n\nI suppose the downside is that to some degree they are competing with each other for talented people, so the trust relationship with YC isn't completely transitive.\nreply\n\nIf something like that got some traction, and you were able to secure some endorsements from big tech players, these irritants would become less of an issue, and recruiters would be more effective in their efforts instead of wasting time with people who don't want to be bothered.\nreply\n\nShe asked him directly \"would you be willing to take less because you're not working?\"\nreply\n\n\nreply\n\n\"EuroStaff did xyz on dd.mm.yyyy\"\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n- Don't stick your CV on a job board, there's no expiry and recuiters will call up wondering if you're still unemployed three years later.- Never answer \"how much are you currently on?\". You should always say \"I'm looking for $X\" - feel free to give a range, but keep the ball in your court. Check glassdoor/linkedin to make sure you're not blagging for an unreasonable figure.\nreply\n\n(IANAL.) Know your locale's regulations here. For example, in California, it is not legal for an employer to ask about prior salary[1]:> (b) An employer shall not, orally or in writing, personally or through an agent, seek salary history information, including compensation and benefits, about an applicant for employment.> (c) An employer, upon reasonable request, shall provide the pay scale for a position to an applicant applying for employment.(CA LAB §432.3[2].)(The advice in the comment I'm replying to is good, too. This isn't meant to contradict it.)[1]: https://www.sfgate.com/business/networth/article/New-law-ban...[2]: http://leginfo.legislature.ca.gov/faces/codes_displayText.xh....\nreply\n\n\nreply\n\nIt seemed weird and I really didn't want to waste my references not having even just a verbal confirmation that they were interested in hiring me. I really thought they were asking in good faith.It turns out that you should NEVER disclose your references with a recruiter before an offer is on the table, in writing. This is a very common technique and it usually means they are no longer interested in hiring you but they would gladly use your references as potential candidates or future leads to get more business.Very shady ;)TL;DR: do a lot of Googling of the kind \"how to tell if a recruiter is bad\".\nreply\n\n\nreply\n\nNow outside recruiters...I've had some outright demand my salary information so that they can sell me for the right price. Just be clever enough not to disclose that.It's entirely a business interaction and not a friendship. They want something out of you, and you may want something out of them.It helps if you can honestly say you want $X and that you're already interviewing with other companies under that expectation.If you don't need to, don't needlessly sign up for interviews and tests with positions that don't particularly interest you for any reason.I've also been bait-and-switched before. There's not too much you can do about that. But if they pull that, you know to end the discussion there.It's not supposed to be a zero-sum relationship, but sadly many will sell you to the lowest bidder if that means a commission.All that said, don't shut off completely if you don't want to. I engage casually from time-to-time. I'll give them a 15 minute call sometimes if my curiosity gets the better of me.And all of that said, it's much better speaking directly with the people you'll be working with or for.\nreply\n\n\"They refused to talk about compensation\"Working outside of the USA, these two are kind of weird. When I am hiring someone, I want to know their current salary to know that I won't offer them a low salary + benefits package.I have ranges depending on positions, and if after evaluating someone she falls into the \"mid level\" category, I want to make sure that their expectations are in line with the level... otherwise I just cannot hire them.So, people want to talk about compensation but they don't want to have a conversation (which is 2 ways). Or how does it work in the USA?\nreply\n\n\nreply\n\n1. Initial convo, things seem interesting, no salary details from recruiter, lots of questions about how much I make2. They ask me to sign an NDA, a bunch of other paperwork, and spend a bunch of time in meetings doing dumb whiteboard questions3. \"You're amazing! Can we hire you for 50k below market? It's totally worth it, we have a $200 xbox that you can stare at while you work 60 hour weeks trying to fix our abortion of a product!\"So, unfortunately, my rules have become:+ Salary range upfront. If you can't give me a number, I can't give you the time of day.+ No NDAs or other BS unless you give me the $600 for my lawyer to go over it. Protip, my lawyer is going to reject it.+ You get one day of whiteboarding/whatever. I don't do follow up visits. I don't do \"projects\" or \"homework\". I'm not implementing the twitter api for you. Sorry, spent too many days doing projects for free.\nreply\n\nSituation A: If I currently make $70,000 and you are looking to pay $40,000-$50,000 we're both wasting our time by keeping quiet.Situation B: If I currently make $70,000 and you are looking to pay $70,000-$100,000 and I reveal my salary first, you can offer $70,000 and I might have left $30,000 on the table.Situation C: If I currently make $70,000, you are looking to pay $70,000-$100,000, you reveal your range first and I say my requirements are $100,000, you have left $30,000 on the table.And why would I feel I was leaving money on the table? Maybe I've seen posts on HN saying \"many\" mid-career Google employees earn $450,000.The traditional HN advice to refuse to name a salary first comes from people who prioritise avoiding Situation B, even if it means increasing the risk of Situation A.\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\nThey're borderline spam and follow the came basic format:Hey atfateshands!I've got a great FTE opportunity in your area. The company is really great and offers a ton of great perks.insert another paragraph about how awesome the company is and how many \"best places to work\" awards it has won in the last few yearsThen it lays out the req's and experience:insert laundry list of technologies they want you to have. Usually stuff that's not all relevant to what you do. I'm a front-end dev and get all kinds of these for Java, .Net, Azure or other tech stacks I'm not at all involved inThen the kicker:\"If you're not a good fit for this, please forward this on to anybody in your network who you think would be interested.\"When I was looking for a gig about a year ago, I got sucked into many of these thinking they were legit. Now I just scan and delete them.\nreply\n\n\nreply\n\n\nreply\n\nPhone calls (or any form of live communication, really) are extremely efficient in comparison to email.Email is pretty much the worst form of communication for most people. A conversation that would take 15 minutes on the phone might take weeks (if not months) to conclude over email, and because of that latency things frequently get forgotten or lost.You might say: \"Hey, if I don't respond to your email that means I'm not interested\" or \"This clearly isn't a priority for me, that's why it takes so long to respond\" but on the other side you'll semi-frequently encounter people who actually are really interested but take a few follow-up emails to respond for whatever reason (busy, OOO, just forgot, etc).Email is just very forgettable for most people, even for things that they might actually be interested in. You might be an exception. I'm a pretty strict Inbox Zero person, so I feel your pain. Still, you choose the tactic that works most effectively for the vast majority of people, and that's live communication of some kind.\nreply\n\nSince I think having coffee with him is a total waste of my time, how do I even begin to think about a pre-call for the coffee?\nreply\n\nSaying no is hard but we all need to learn to do it.  If you're not interested, just say so.\nreply\n\n\nreply\n\nIf they are good, they'll lay out everything they want to cover and be upfront. Sometimes, this works well and I'll bite and accept the service or we will know right away it won't work.The worst is when the person thinks they want to build a relationship first and hang out and talk about other things and then they'll tell me what they want to do. I simply won't give someone I just met some business just because (or if) I like them.\nreply\n\n\nreply\n\nI agree about the business hours, almost none of us have our own offices anymore, so the business hour phone call should only be about making an appointment outside business hours when you can actually talk.\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\nSource: At a former job, I was work buddies with a guy from the in-house recruiting department, and he'd tell me stories about just how different his job there was from his previous job at one of those firms.\nreply\n\nThese recruiters sure they're not sitting on a local maxima?\nreply\n\nYou aren't going to encounter them nearly as often, though, precisely because they aren't just spamming indiscriminately. Also because there are fewer of them recruiting for fewer positions. The hiring company needs to be willing to pay for that level of service.\nreply\n\nIf you reply by phone it means you actually want a job.\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n\nreply\n\n"}