{"id": "", "paragraph": "Long story short, four months later, I am the only user of my service. I hired a brand strategist who looked at the market, with who I forged a marketing plan, and with who I set goals. Needless to say, none of them were met.What does/can this mean? Should I accept that what I built will only be used by myself, or is this a phase each product/service goes through? If only there were one extra paid user, I would have enough motivation to continue, but with zero conversion the motivation starts to fade.I think it is irrelevant to re-post a link to the project, but feel free to ask/look it up if you think it's relevant.Can you turn it around? Sure, it's definitely a possibility. But all your effort so far is not the way to do it. You need to do things completely differently, because whatever tactics you have used so far haven't even gotten you a single user.You would have to invest more money and time into it, and it might get more users. You need help, and brand strategist isn't what you need. You need a sales strategy. You need to find customers and sales. You have to call people up and demonstrate it in person, you can't rely on Facebook or Google ads to make a difference.But bluntly, this isn't such a hot idea like Dropbox or Airbnb that is going to get viral. Even Airbnb needed a lot of hustle to get it off the ground, and you need to figure out your target audience and get sales the old-fashioned way. If you're able to get good sales, then it could possibly be the service that you want it to be, eventually.\n\nIf your product isn't selling, maybe you're not doing something right (likely!), or maybe it's just not a good product. I think you can figure out which of the 2 your product is by putting some real effort into discovering why nobody is interested in giving you money for it.The \"why\" may be your sources of traffic, it may be your messaging, it may be that your product doesn't actually solve a problem, or it may be any number of small things that build up and turn into a gigantic roadblock that nobody can pass without their hand being held.I didn't start seeing \"good\" traffic until I started spending money to experiment with Google Adwords. Through that experimentation, I discovered that the traffic sources I was relying on so much were in reality total garbage. They were users from PH, HN and Reddit; \"tire-kickers\" as a lot of us call them. They just want to try out the hot new thing, then rinse (i.e. churn) and repeat with the new hotness. They aren't prepared, or willing, to open their wallet.The Adwords traffic was actually converting, so I quit focusing on the bad traffic channels and starting adjusting my ads, finding better keywords, and talking to the \"good\" traffic (yeah, they actually talk back!). Since I was getting quality traffic now (albeit, low numbers), that helped me find the next roadblock, which was my, at the time, terrible onboarding flow.The root problem wasn't that my product was bad, it was that I was sending bad traffic to my product and I didn't want to change that. The second problem was that onboarding sucked. I'm still not where I ultimately want to be with Keygen, but now I'm working on other problems (hint: scaling) because the root problems I was having have been fixed.Stop guessing, and figure out the why.\n\nAt $1/click, and then maybe 1%-5% conversion for a paying user, and even if this is a generous 100$ annual subscription .. its just terrible.Does this really work long term ?(disclosure : i worked in a big B2C that spent 8 digit sums on incoming traffic so obviously it works..)\n\n\n\n\n\nCoddling people, especially in business, is very counterproductive. People could waste years of their lives following bad paths because of bad advice like yours.Not a single person has decided that the product is worth paying money for. If the purpose of the effort was to get some people to pay money for this, and the outcome is 0, how could you honestly say this isn't a failure?\n\nHe doesn't.His product is atrocious.They're just being nice and he should've thrown in the towel twenty-nine years ago. His income is literally less than $100 a year. (I believe he's on SSI disability now, which is how he gets by.)\n\nI think we need more data to state definitively.\n\n\n\n\n\n\n\nOP, I suggest you read Traction by Gabriel Weinberg, and The Four Steps to the Epiphany by Steve Blank, and consider if you've successfully identified who your customers are, and a valid channel for reaching them. Further ask if you've correctly identified a problem that those customers will pay to have solved, and whether or not your product actually solves that problem.  How do you do that?  Talk to customers.  All of this stuff is in the Steve Blank book.Also consider reading The Mom Test[1] by Rob Fitzpatrick.[1]: https://www.amazon.com/s/?ie=UTF8&keywords=the+mom+test&inde...\n\n\n\nI'm aware but getting on the front page of HN is still good marketing.\n\n\n\n\n\n\n\n\n\nLink to Show HN: https://news.ycombinator.com/item?id=17254737Ask for credit card data while signing up for the trail period. People that are possible customers don't really mind entering their CC. I did a test with my project Simple Analytics when number one on HN and free people did signup like 50 an hour. Than I cancelled those and paid people came in. Guess how many of those 50 did convert? Zero.So ask for credit card info first, give a trail for x days and charge monthly automatically.Your design is awesome ;-)\n\nIt looks like you wrote this project mainly for yourself, and are just trying to market it for additional revenue.  So it's hard to call it a failure altogether because it seems it's provided the necessary value to you.  But I can't imagine something like this being commercially viable.\n\nI'm pretty bad at this but you get the general idea.\n\nI don't think this was a good naming choice to begin with.\n\nAlso please consider making this a B2B enterprise product. To do that the main thing you need to do is hide the price or put insanely high prices. like $999 per year per license and above. If you are hiding prices, put a button to contact the sales team, which could be your phone number to start with.Also put some white papers and add a lengthy demo with your own voice with an actual project, like Wordpress being protected and ask them to contact your sales if they need to enable the protection in their software as well. The demo could be put behind a sales form to collect contact details.And hide your technology details. They don't need to know how you do it. Just give instructions on how to put enable your validation. Since you don't have a free tier it's very easy for you to validate your project's success. Just reach out to X potential customers (it's very easy for you to figure out potential customers too) and ask them to try your product. Give a 6 months money back. Ip.s. A great sales article I found on HN this week: https://stripe.com/atlas/guides/ama-steli-efti\n\nJust hide the details and put some jargons (AI/ML to detect behaviour etc :) and give an enterprise look and feel.\n\n\n\n\n\n\"Besides, we strongly recommend to let our JavaScript file blend in with the rest of your application's JavaScript. Webpack, compress and uglify the best you can, to make the code responsible for validation as difficult as possible to find and break.\"\n\n\n\n\n\nThat's not insanely high - that's pretty common for B2B SaaS apps.The most I've been quoted for SaaS was more like $100K per user per year...\n\nAll in all, it's not unusual to pay 10k, 30k or even 100k USD a year for a core technology like that. For example, self-hosted JIRA costs 8.3k USD per year (if you want updates) for 100+ users, and you usually have several services just from Atlassian in this price range.\n\n\n\n\n\n\n\n\n\n\n\nDon't forget that, for many successful SaaS:-Landing page to trial conversion is in 5-10% range, and-Trial to paying customer is 3-10%!Also don't forget the statistical variance.Source: https://medium.com/point-nine-news/monitoring-an-early-stage...\n\n\n\nJust look at famous VC blogs :)You could also look at Saastr blog, it's really interesting.\n\n1. Users don't want the product you are offering2. Users don't know about the product you are offeringYour first job should be to distinguish which issue you have. You can probably Duckduckgo some basic benchmarks to figure out what the conversion is if you are talking to the right people.For instance, if you are advertising in first class lounges to pay off student loans, that is just a waste. You have to look at your where you are placing the ads, or how you are reaching customers first.If you know that is right, then you should talk to a few customers to see if you are offering the right thing.The second is fixable, the first might be. It is only a failure if the first point (can you iterate the product to something people actually want in a reasonable time at a reasonable cost) is not fixable.\n\nSome other notes:- Name makes sense after you think about it, but is hard to read at first glance.- Your FAQ's answer on removing the validation code didn't inspire confidence. Give me an out of the box solution to obfuscating the tracking code.\n\nThe comment on \"go for enterprise\" is a great one IMO.  A big company wouldn't mind spending $thousands plus $250/mo to \"make sure they aren't stealing our IP\" even if that's an extremely low-probability event.\n\nI have been working on y own startups since 2013. My first startup failed. \nThe second one, it was really hard to find how to get users, but after a few months discover a hack which drove a lot of traffic. 2 years later, I sold it.Now I am working on a crypto company which we started with a game for the World Cup which was pretty good in terms of users. But now, launched NFL and we are fighting again.It is not easy at all build stuff and then get users. It takes time and work to find the best alternatives to get them.\nActually, Show HN, I was never able to get a lot of upvotes. So congrats on that and keep the hard work!\n\n\n\n\n\nI’d also consider what would drive agencies and freelancers  to do this, and market accordingly. This is one of those where many (i.e. those who’ve never experienced an infringement) would regard as an unnecessary cost.Set up saved searches on twitter for “my work got ripped off!” type posts and reach out with “that sucks, I’m sorry that happened - I have a product that might help next time”. Optimise SEO for terms like “website was copied” and “how can a freelancer enforce IP right?”. Those who have just been stung will buy this in a heartbeat, and a free tier would capture a large and vocal market. Most B2B purchases come from distress.Finally, consider reworking your copy. It’s too much steak, not enough sizzle (you talk a lot about features and the tech, but not enough about how much better (trouble free, worry-free, easy, relax, no stress, get paid, boost revenue through easy licensing) it’ll make their lives).Also,“In a very bad scenario where our service is slow, the worst thing that happens is a user being able to use the web app for a couple of seconds before it is denied access.”What? I think I know what you mean, but that reads like “if our servers are down, you will be too”.Finally finally, consider a positive sell too - “license your work with ease, monitor subscriptions”, rather than the purely negative (protect yourself against infringers!) you have currently.\n\n\n\nAnd don’t hire more consultants, just commit yourself to learning what you need to learn.\n\nI'm in a similar situation myself and in the process of figuring out why. I would recommend reading the book \"Traction\" by Gabriel Weinberg.I think it is relevant for you to share your project - there could be many different factors why traffic isn't converting. Trial users from a Show HN are great but I've multiple websites that had traffic but 0 converted. This tells me that the traffic audience may not be my target customers.I'm doing things that don't scale now .. so actually going out to acquire users manually. What I've found is that the value proposition might actually be a better fit for folks outside of the HN community.\n\nWhat exactly do you mean with \"going out to acquire users manually\"?Project: https://qeys.io\n\nFigure out who my target customer is, where do they work, where do they hang out (online/offline) and figure out ways to go and interact with them (phone/coffee/conferences/etc).\n\nI would also suggest offering the product completely for free, and then charging over a certain number of keys. Maybe for 100-1000 installs you charge $5/month, then $25/month for 1000-10000, $50/month for 10000-100000, etc. You could also go with the $5/month gets you 0-1000 keys model, and then scale from there. That option will cash in more on the (large number) of people launching failed apps that get under 1000 users.\n\n1. $10 for GET request and ten license-domain pairs. For one project. $50 for ten projects and 100 licenses per project. Too pricey for small amount.2. Nothing stops user from simply removing qeys.js from a page.3. Functions in your js file are called \"v\" for validation, \"iv\" for invalid license error and \"vv\" for setting validation cookie. They can conflict with other similarly name functions from other parts of your customers's JS.4. You set validation cookies on the client side. You literally have a code to bypass your system in your system.5. User interface may be much better. There's too much hassle in setting up multiple keys. I need to switch between pages to do it.Conclusion: your software isn't good, your prices are high. Something like that can be accomplished in one day with a couple PHP scripts tied to MySQL database with lifetime control over it. Everybody who needs it most likely are able to implement it themselves. You need to put more effort in it and polish it more to make it really attractive for others. It's a nice job for \"Intro to Webdev\" course project, but not for actual product someone will pay for. I don't want to offend you, but that's what I actually think as a guy with some teaching experience.Shameless plug: I can develop similar (or better) webapps and now looking for projects. You can hire me. You may find me in Telegram with the same username I use on HN.\n\n\n\n\n\nWhat immediately came to mind for me was design templates. You are supposed to buy one for $20 and only use it for one site. I will say I have bought those templates for clients, but on small personal projects, I will just load their demo page and save it to my computer and voila. I have their design template. And I'm sure I've used one more than once after it enters my template library. Plus, those designers probably don't have a way to protect themselves. So in this case, I would go to themeforest or something similar. Look up 50 or so designers. Message them and see if you can get a phone call or if they would be willing to talk over email. Figure out what it's worth to them and go from there.\n\n\n\nAlso, your domain name is terrible.\n\nWhy?What marketing did you do?\nDid you do enough?\nDid you target the right people?\nWas your marketing message relevant?\nWhat did the people you where marketing too think of it?\nDid you test it was working?\nDid you market in multiple channels?\nDid you sell the benefits of your product or its features?\nDid you ask your customers what they thought?You have said very little about how you tried to fix the problem, did you even try?You didn't bother to post a link to your project and I can't be bothered finding it. Did you do the work for your customers or did you leave them guessing like me?~Edit~\nSome one else posted your link for you, and the link to the hacker news post, its filled with feedback, which I can see hasn't been tried. You are not doing your work. Their feedback might not make sense to you, but your not selling to you, and your not selling to them because your not addressing their concerns. Do the work for the customer.\n\n\n\nI looked it up, and it seems pretty cool and well made.\nKudos on keeping releasing new products.Maybe people want a slightly different version of the product ?I for example just never use such things in my professional/personal life.\nMaybe your target crowd isn't on HN ?\nMaybe submit towards a more subject related news site ?\n\nNow, I'm going to assume that without your solution or something like it, such code isn't protected. (Assume, correctly, that I don't know anything about server-side Javascript.)The first question is: what is the competition? Is there a way of doing this that doesn't require your solution? If so, how are you convincing users to migrate to your way of doing it.Secondly, suppose there is no competition. In that case, people who write server-side JS code do not expect to be able to do that kind of licensing, even before they have written any line of code. They deploy their server-side JS code in scenarios in which licensing that code isn't the bread and butter of their business; they lock in their bread and butter in some other way and take it for granted that people can easily reverse-engineer their server side JS code, and muck around with it, steal snippets and whatever.In this scenario is where you are in trouble because you face the prospect of convincing the people who are doing server-side-JavaScript development world to do that kind of node-locked deployment model. Only if they are seriously on-board with developing and deploying something like that do they then become potential customers for your licensing scheme. By the time they get serious, they might even roll their own.You might be better off developing a superior licensing alternative for for some toolchain whose users already do that kind of licensing, stealing those users from whatever they are using now. And then work the JavaScript story into that: \"hey, existing users: if you want to branch into JavaScript work, under your existing licensing model, we have you covered\".Lastly consider that if node-license-locked server side JS development suddenly became immensely fashionable, how likely would it be for numerous solutions to appear, many of them FOSS?\n\n\n\nThat is, the perception of your target audiences is either that they do not need the product or that it adds a layer of complexity they are not comfortable with (trust, potential source of other kind of support issues).I suggest trying to find other audiences/use cases for this technology.Sometimes it is the timing of the solution.  If I remember well, in the pre-dotcom burst, Google was pitching Yahoo how efficient their algorithms for optimizing ad pricing with the idea of licensing technology, but at the time that optimization was a non-issue for Yahoo because they were essentially selling ads at any price they wanted.\n\nYou are also missing some plug-and-play features.Make it effortless for a client to pick your product.\nAlso make it easier for him to reason about it. If I'm interested to your product, I should be able to defend against my co-worker who believe we can built it our selves.Add integration/plugin/component/package built for popular web frameworks and CMSs and put their logos there.Yes, your JS snippet works everywhere, but you need something more elegant. Your marketer is going to approach a dumb manager that believes his developers are only trained to use Wordpress plugins.Use something like user-voice to collect user feedbacks. Don't make assumptions.\n\nWith web applications usually I'm either developing them for the client so it is their code or I'm licensing them as a SaaS app from my server so I don't really need anything like this.This doesn't feel like a good product market fit, I'd keep using it and work on targeting WordPress developers.WordPress isn't the greatest ecosystem but there is money to be made there.\n\n\n\nI think you need a product that you can license to enterprise customers because they have plenty of money and often don't have a clue whether your product really is worth all the money or not.\n\n\n\nI don't know what problem you are solving.\n\n\n\nBut if that is the case, use it as an opportunity to tweak and reiterate your idea until you get a paying customer.  Until then, you are working on assumptions on what the market wants.\n\n\n\nI'm using this product from last 1 year for my software. You can definitely make a sell if you try to sell your software to internet marketers. You can find them on platforms like jvzoo.com\n\n\n\nAnd/or add a killer-feature everybody would quickly realize they can't live without and spread the word.\n\nFor example, the following tag line could be much more concise.. \"The instant solution to worrying less about your work being copied by the clients you developed them for.\"\n\n\n\n\n\n\n\n\n\nHave posted to ProductHunt?   There are a ton of things you can try to get some eyes in front of your project.\n\n\n\nI've had a couple of market successes, mostly in the B2B2C/LeadGen space and every time it has been built with a primary customer who is basically getting the product at reduced cost with the caveat that I understand the business impact I'm making with my software to be able to derive true value. They have the benefit of the product growing up around their needs before their competitors get their hands on it.You built a solution to a problem without an anchor customer using it from prototype stage on up.  This is really risky, in that you don't have a solid insight into the intrinsic business value of your product.It seems too that you didn't take distribution into account and assumed that word of mouth would carry your cost of acquisition.  For me the formula would be something roughly like:Estimated LifeTimeValue (LTV) over 1 year * .3 == Avail Cost Per Aquisition in Marketing / Bizdev / TradeBooth / Etc.(this formula will create an initial deficit, but most products are fighting against media buys of entrenched companies so you have to expect this)So if you make $300/yr per customer, you might expect to spend $120 in marketing expenses to acquire a single customer.  If you have a 10% signup rate for a free trial, with a 15% stick rate from that  (For every 100 people you buy targeted media on, you might expect 1.5 paying customers)... that means if you're spending $1/CPC on google, you would be spending $75 per new customer (beating your $150 budget).  Organic reach and word of mouth might help this formula reduce in cost, but what you're wanting to build is a sustainable machine that can be driven by marketing expense, not by gimmicky front-page listings on HN  You optimize on those metrics as your marketing continues to spend more and you have more data to work with.Obviously, the above example is hyper-simplistic, but you have an advantage of not needing to hire devs.  Now take the time to figure out the digital marketing piece or find a partner who knows it and can help you with it in exchange for equity if you're trying to bootstrap this.You'd have to play with your pricing structure to make that work, as you increase your price, Cost Per Aquisition possibly goes up but you hopefully can find a balance that works in your market.  This is why most people for their first product need investors to pony up spends to discover this, but in my experience, you can hit very low cost-per-acquisition numbers if you're careful, just not at scale.  (Last part is important)Feel free to shoot me a PM if you have any questions or want any advice, you're getting a LOT of great input from people here but this is my $.02 :)\n\n\n\n\n\n\n\n\n\n\n\n"}