{"id": "\n‘Bad Blood’ wins the FT and McKinsey Business Book of 2018\n", "paragraph": "\nGet a fresh start.\nAndrew Hill\nReport a mispronounced word\nBad Blood, John Carreyrou’s riveting account of the rise and scandalous fall of Theranos, the blood-testing company, has been named Financial Times and McKinsey Business Book of the Year.Mr Carreyrou received the £30,000 prize at a ceremony at the National Gallery, London, after Bad Blood emerged as the clear winner over five other shortlisted titles in a judging session on Monday morning.The book recounts the inside story of the collapse of Theranos and the disgrace of its once-feted founder Elizabeth Holmes, after the group’s supposedly revolutionary blood-testing system turned out to be dangerously flawed. Since the book’s publication, Ms Holmes and Ramesh “Sunny” Balwani, former chief operating officer at Theranos, have been charged with perpetrating a multimillion dollar fraud on investors, doctors and patients. In September, the company announced that it would dissolve and return any remaining cash to creditors.The book award judges heaped praise on Mr Carreyrou’s book, which is published by Picador in the UK and Knopf in the US. They said that it raised questions not only about the culture at one start-up — at its high point valued at more than $9bn — but in the whole of Silicon Valley. The book offers insights about the cult of founder-leaders and weaknesses in regulation and corporate governance. Theranos’s board once counted among its members former US secretaries of state Henry Kissinger and George Shultz, and Jim Mattis, current US defence secretary. The group also attracted high-profile investors, including moguls Larry Ellison and Rupert Murdoch.Accepting the award, Mr Carreyrou said that readers should learn from the Theranos scandal that the “move fast and break things” approach to technology innovation did not work well in areas such as healthcare or self-driving vehicles: “I hope that people read this book and keep in mind that this Silicon Valley playbook doesn’t apply very well to regulated industries and especially doesn’t [apply] when lives are at stake.”Lionel Barber, FT editor and chair of the judging panel, called Bad Blood “a brilliant piece of enterprise journalism” that “reads at times like a thriller”. Kevin Sneader, global managing partner of McKinsey, the consulting firm that supports the prize, presented the award to Mr Carreyrou, a reporter for The Wall Street Journal. Mr Sneader said the book taught lessons about “the proper trade-offs between fostering innovation and conducting due diligence”.The award dinner was addressed by Charlotte Hogg, chief executive of Visa Europe. At the same ceremony, Andrew Leon Hanna collected the £15,000 Bracken Bower Prize for the best proposal for a business book by an author aged under 35. His book, Twenty-Five Million Sparks, will explore how entrepreneurs and entrepreneurial ideas emerge from refugee camps and communities.The Business Book of the Year Award was launched in 2005 and goes to the book that provides the “most compelling and enjoyable insight into modern business issues, including management, finance and economics”. In 2017, it was won by Amy Goldstein for Janesville, about the impact of factory closure on a US community.The other shortlisted titles, each of which receives £10,000, were: Capitalism in America by Alan Greenspan and Adrian Wooldridge; Annie Lowrey’s Give People Money; James Crabtree’s The Billionaire Raj; Mariana Mazzucato’s The Value of Everything; and Jeremy Heimans and Henry Timms’ New Power.More information, reviews and podcasts at www.ft.com/bookaward.\n\t\t\t\t\t\tGet alerts on Business books when a new story is published\n\t\t\t\t\tThe winner of the £30,000 prize will go to the book that is judged to have provided the most compelling and enjoyable insight into modern business issues, with £10,000 awarded to each runner-up. Read the rules of the 2018 award and see our FAQs. The 2018 prize will be awarded in a ceremony in London on November 12. - Please direct any queries to bookaward@ft.com- Enter your book here- To enter your book, please wait until the week of the 9th April, 2018International Edition"}