{"id": "Look Who’s Back: Obama Crashes the Midterms\t\t\t\t\t\t\tLook Who’s Back: Obama Crashes the Midterms\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAbrams Campaign Considers Drastic Legal Measure to Force Another Vote\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBroward County Missed Recount Deadline by Two Minutes\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFlorida Dems Gave Out Altered Form to Fix Absentee Ballots Past Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Election’s Lesson for Democrats: Don’t Nominate Hillary Clinton\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tMichael Avenatti Bites the Dust\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tUrban Cowboys\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Blue Wall\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLosing the Suburbs\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tToward a Bigger Coalition\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFlorida Judge Gives Voters Additional Time to Correct Rejected Ballots\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHillary Clinton: If Stacey Abrams ‘Had a Fair Election, She Would Have Already Won’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAnyone but Nancy Pelosi for Speaker\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe GOP’s Orange County Problem\t\t\t\t\t\t\t\nFormer President Selfie Stick is back in action, firing up Democrats before the midterms with his signature rallying cries:I, I, I, I! Me, me, me! My, my, my!According to a tally by The American Mirror’s Kyle Olson, Barack Obama’s campaign speech Monday for Nevada Senate Democratic candidate Jacky Rosen referred to himself 92 times in 38 minutes — or an average self-allusion every 24.7 seconds.When he wasn’t “I”-ing, the former narcissist-in-chief was lying.“Unlike some, I actually try to state facts,” Obama snarked passive-aggressively in a swipe at President Donald Trump. “I don’t believe in just making stuff up. I think you should actually say to people what’s true.”Sit down, Mister “If you like your plan, you can keep your plan.”Thanks to you, my husband, children, and I lost not one, not two, not three but four private individual-market health plans killed directly by Obamacare. Reminder: When the health-insurance cancellation-notice tsunami hit in 2013, liberal Mother Jones magazine sneered that the phenomenon was “phony.” But after 4 million American families received cancellation letters at the end of 2013, Obama’s health-care prevarication was finally deemed the “Lie of the Year” by left-leaning PolitiFact.\nAnd five years after promising Americans they could “keep their doctor” along with their health plan “no matter what,” Obama belatedly ’fessed up that “the average person” would be forced “to have to make some choices, and they might end up having to switch doctors.”Facts, schmacts.Moving on, Obama tried to galvanize voters this week by trashing Trump’s jobs boom: “When you hear all this talk about economic miracles right now, remember who started it.”Hold up, Mister “Jobs are not coming back.” I remember you taunting Trump for needing a “magic wand” to achieve what you claimed was an unachievable manufacturing industry renaissance — for which you are now claiming unadulterated credit!I remember you, Mister Multitrillion-Dollar-Stimulus, promising the sun, moon, and stars with the “most sweeping economic recovery package in our history” that was supposed to lift two million people out of poverty.I recall sky-high unemployment rates for black Americans, nearly double the national rate, and 90 million-plus able-bodied citizens of all colors simply giving up looking for work while wasted billions went to fund crony green-energy boondoggles, bridges to nowhere, renovations to Joe Biden’s favorite Amtrak train station in Delaware, General Services Administration junkets in Las Vegas and Hawaii, ghost congressional districts and stimulus-propaganda road signs planted nationwide and stamped with the shovel-ready logo.Speaking of which, I won’t forget you smirking while you admitted at one of your phony Jobs and Competitiveness Council meetings that “shovel-ready was not as, uh, shovel-ready as we expected.” Yukkity-yuk-yuk.Nor will it go down the memory hole how the Obama administration’s wreckovery lies were enabled by slavering “journalists” like New York Times columnist David Brooks. He giggled on Jim Lehrer’s PBS show that Obama had told him off the record that the shovel-ready promise was a crock, yet he sat on the truth until his Times colleague Peter Baker reported the admission more than a year later.Wait, we’re not done yet. Astonishingly, Obama is now on the campaign trail comparing the Trump White House to a “tin-pot dictatorship” and calling for a return to “decency” and “lawfulness.”Yes, this is the same man who sicced the IRS on tea-party conservatives, evangelicals, and pro-life citizens, amnestied millions of illegal immigrants through executive fiat, appointed dozens of unaccountable and unvetted policy czars, used his Justice Department to spy on journalists, deceived the country over the Benghazi massacre and the Iran deal, demonized his political opponents, and mastered the very social-justice agitation techniques now wielded by left-wing mobs targeting Republicans in every corner of the public square.Thanks, Obama, for reminding America of your miserable legacy of deceit, division, persecution, and redistribution as voters head to the polls. You wanna make the 2018 midterms all about you? It’s on.COPYRIGHT 2018 CREATORS.COMNR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}