{"id": "Elizabeth Warren Highlights the Dangers of Identity Politics\t\t\t\t\t\t\tElizabeth Warren Highlights the Dangers of Identity Politics\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 17\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHow D.C. Is ‘Getting Guns Off the Street’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tOn Criminal Justice, Trump Embraces the Left’s Racism Rhetoric\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBetsy DeVos Strikes a Blow for the Constitution\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump Appointee Judge Rules for CNN. Good.\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tJudge Orders White House to Return Acosta’s Press Pass\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 16\t\t\t\t\t\t\t\nShe was mocked as “Fauxcahontas” long before President Trump began referring to her as “Pocahontas,” and frankly, Senator Elizabeth Warren invited the ridicule. She is a poster child for the pitfalls of basing identity on race and reminds us of the many furies such self-definition unleashes.What people choose to call themselves shouldn’t matter to outsiders. If I want to call myself a post-Jerseyite dog lover, no one will care, unless there is affirmative action for former Jersey residents who can’t skip dog videos on Twitter.What made Elizabeth Warren infuriating is that she was gaming the system. There is a clear career advantage at leading law schools, as in other institutions, to being a member of a minority group. Warren apparently secured a position at the University of Pennsylvania Law School without the minority credential. But while at Penn, she dusted off some “family lore” and began to list herself as “Native American.” Who knows if this helped get her a slot at Harvard Law? As columnist Jeff Jacoby has reported, Harvard highlighted Warren as a Native American when it was accused of lacking a diverse faculty, and the Fordham Law Review bestowed on the blond-haired, blue-eyed Warren the title “Harvard Law’s first woman of color.” Seriously.This charade reveals the bankruptcy of the practice — well-intentioned at first — of granting benefits based upon race. With DNA testing now routine, nearly anyone can rummage around in the genetic attic and come up with an ancestor, especially a distant one, who is of a different ethnic group. In fact, as Warren has been reminded 1,000 times in the past few days, most “white” Americans have roughly the same non-European genetic markers as she. Why Warren thought this excursion “even unto the 10th generation” would bolster her claim is anyone’s guess.Even if Warren’s interpretation of the genetic test is correct — i.e., it proves that she has some tiny genetic contribution from Native Americans — it doesn’t make her disadvantaged, does it? She didn’t suffer discrimination or prejudice based upon her Native American identity. Neither did her great-grandparents.\nWarren is hardly the first race impostor in academia. Ward Churchill had the University of Colorado buying his Native American cock-and-bull story for decades, until a particularly vicious article calling the Americans who died on 9/11 “little Eichmanns” gained notoriety. Rachel Dolezal was an officer of the NAACP and taught Africana Studies.But the problem with race preferences is broader than the inevitable frauds it encourages. What the Left did not anticipate when it valorized identity politics for its favored groups was that eventually, some in the majority would begin to engage in the same kind of self-definition. When it seems that so many major institutions — universities, the news and entertainment media, big corporations — grant special status to some groups based on identity and not on disadvantage, the majority will be tempted to seize the same flag.Also, the very idea of race as a place holder for disadvantage, and particularly for historic wrongs, is problematic. In 2004, two black Harvard professors, Henry Louis Gates Jr. and Lani Guinier, noted that among Harvard’s black graduates, the majority and perhaps as many as two-thirds were not the descendants of American slaves, but instead were West Indian or African immigrants, the children of immigrants, or the products of mixed-race couples.Data from the Department of Education show that 59 percent of black college students are the children of college graduates. This is less than among whites (75 percent) but still raises the question: Are the black children of college graduates really in need of preferences? If the aim of affirmative action is to secure a certain percentage of minority students, race preferences are a success. But if the goal is to help the descendants of those who were enslaved and abused, they are much less so.There are many other pitfalls to racial preferences (lower graduation rates and higher student debt among blacks among them), but their most pernicious effect is to enhance, rather than minimize, the importance we attach to ethnic identity.A 2017 poll found that 55 percent of white Americans believe that they face discrimination, and some in the alt-right are chugging milk to demonstrate the supposed superiority of white people. Sometimes, people can only see how toxic race identity is when the race they fear adopts it.COPYRIGHT 2018 CREATORS.COMNR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}