{"id": "College Assignment Asks Students to Compare Trump and Nazi Policies\t\t\t\t\t\t\tCollege Assignment Asks Students to Compare Trump and Nazi Policies\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 17\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHow D.C. Is ‘Getting Guns Off the Street’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tOn Criminal Justice, Trump Embraces the Left’s Racism Rhetoric\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBetsy DeVos Strikes a Blow for the Constitution\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump Appointee Judge Rules for CNN. Good.\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tJudge Orders White House to Return Acosta’s Press Pass\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 16\t\t\t\t\t\t\t\nA University of Arizona student reports that her class was asked to compare President Donald Trump administration and the Nazis’ policies as part of an extra-credit assignment for a course on the Holocaust.“Now that you have studied the Vichy Anti-Jewish Laws, the German Ordinances, and pre-Vichy laws imposed on the Jews (French, immigrant, and refugee) and the repercussions that they had for Jews in France, examine and analyze more current anti-immigrant laws in the United States,” states the extra-credit assignment, a copy of which was obtained by Campus Reform.One Jewish American student, L’wren Tikva, told Campus Reform that she was offended by the assignment, saying that it was “insensitive” and that it felt “extremely one-sided and [like] full-on indoctrination.”“As a Jewish American who has ties to those who survived the Holocaust it’s pretty trivializing comparing Trump’s policies to the Holocaust,” Tikva reportedly wrote to her professor. “Almost all of these policies are in no way comparable and the President is in his legal authority to implement these policies.”Apparently, the professor responded and stated that she was also a relative of Holocaust survivors, that “her intent was not to compare Trump to Hitler,” and that she was “not [at] all comparing what eventually transpired in Vichy, France to what is happening now in the U.S.A.”\n“I am certainly not cheapening the Holocaust by looking at the laws emphasized in pre-war France and examining the focus and rhetoric of certain immigration laws in the recent past and current moment in the States,” the professor continued.Here’s the thing, though: That is exactly what she’s doing. She can try to defend herself and say that she wasn’t trying to compare what the Nazis did to what Trump is doing, but simply reading the assignment is enough to show that that was clearly her intent. She wasn’t simply asking students to examine Trump’s policies, she was asking them to examine Trump’s policies through the lens of what happened in Nazi Germany, which clearly insinuates that she is looking for students to draw some similarities between the two.Personally, I am someone who has vehemently disagreed with both Trump’s rhetoric and his policies when it comes to immigration. As a libertarian, I’d advocate for more immigration, not less. Recently, I’ve criticized the way he’s discussed the migrant caravan, and accused him of using it as a way to stoke fear ahead of the midterm elections.Despite all of this, I’d have to agree with Tikva’s view of this assignment. Clearly, the intent behind it was for students to draw parallels between Nazi Germany and the modern-day United States, and to even insinuate such a comparison is vehemently offensive to everyone who suffered at the hands of the Nazis. It’s one thing to criticize Trump’s policies and rhetoric, as I have certainly done, it’s entirely another to compare them with the mass murder of millions upon millions of Jews — and I can’t wrap my head around why that’s apparently so difficult for some people to understand.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}