{"id": "Believe in Creed II\t\t\t\t\t\t\tBelieve in Creed II ", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTERF Wars\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\t‘The Process of Living’\t\t\t\t\t\t\t\nThe structure of a boxing picture is as predictable as the seasons: Our hero loses something (a bout, a loved one, his confidence), gets a pep talk and a montage of unorthodox training, then regains his mojo and steps back into the ring as redemption awaits. Million Dollar Baby, one of the few boxing movies to break out of the box, is not coincidentally among the greatest movies this century.Creed II sticks to the formula like dogma and doesn’t even seem all that interested in the details of how to win (or train for) a fight. There’s nothing like the tactical surprise of a southpaw fighting right-handed here, nor any workout scenes as exhilarating as the many great ones in the earlier movies. Nevertheless, a surprise-free movie can be a satisfying one, if the grace notes are played with care. They are in Creed II.The sequel to 2015’s Creed, a spinoff from the six Rocky Balboa films, finds the late Apollo Creed’s son Adonis “Donny” Creed (a superb Michael B. Jordan) on the verge of capturing the heavyweight championship while he tries to work up the nerve to propose to his girlfriend Bianca (Tessa Thompson). Meanwhile, in Ukraine, Viktor Drago (Florian Munteanu) angrily trains for a chance to fight Creed for the title. In the 1985 Cold War proxy Rocky IV, Viktor’s father Ivan (Dolph Lundgren) killed Adonis’s father Apollo before being defeated by Rocky.Yes, Sylvester Stallone is back and gives another warm, finely tuned performance. Stallone has played the character in at least one Rocky film each decade going back to the Ford administration, and this 42-year, eight-film run is without parallel in movie history. How he has made the Philly fighter endure is a subject for another day, but Stallone deserves more respect than he has gotten as both a writer and an actor. (He co-wrote this entry with Juel Taylor, from a story by himself, Sascha Penn, and Cheo Hodari Coker.)The fight scenes are the least interesting ones in the movie, but thanks to sensitive, low-key direction by 30-year-old Steven Caple Jr. in only his second feature, everything else works nicely. Caple stages some sweet scenes between Adonis and Bianca, a singer who is deaf without her hearing aids, as the couple frets about how their baby daughter will turn out. (Rocky suggests naming her “Kate.” Donny replies, “You know she’s going to be black, right?”) Family bonds are more important than boxing achievements in the film, and properly so.\nCaple doesn’t overdo the echoes with earlier Rocky films, but they’re there: Bianca spends one bout nervously watching in a woolen beret that recalls Adrian’s headgear in the original film. There’s also a toned-down reprise of bits of Bill Conti’s unforgettable musical score. (If anything, the movie could have used more of this to pump up the excitement during the so-so climax.) Aware that Rocky IV veered toward jingoism and kitsch, Caple arranges for the conflict with Drago’s side to be mean and gritty instead. “Break him,” Ivan advises his son during a fight. The Dragos don’t just want to win, they want to maim Adonis. “This is why they look down on us,” Ivan tells Viktor. Post–Cold War, the resentment of America’s preeminence continues in different form. But as Rocky points out, boxers who have nothing to lose are dangerous, and Creed has much more to lose than Viktor, who when he’s not in the ring is but a manual laborer in a chilly country.Creed II doesn’t have the jubilance or the vitality that Creed had, but its unhurried style is consonant with the mood of Rocky Balboa, the 2006 film that at the time appeared to be the final chapter in the saga. At this point, there is no urgent need to continue with the series; Jordan doesn’t require the exposure, being one of the hottest young stars in Hollywood. A death scene for Rocky would seem to be the natural close, but Stallone is evidently reluctant to kill off his defining character, who appeared to be on his last legs in the two previous movies only to rebound this time. Maybe that’s just as well; Mickey, Adrian, and Apollo may be dead, but Rocky’s defining quality was always his endurance. All he wanted to do was go the distance. Forty-two years later, I’d say he has.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}