{"id": "A Small Step For Budget Reform\t\t\t\t\t\t\tA Small Step For Budget Reform\t\t\t\t\t", "paragraph": "National ReviewPretty much everyone now acknowledges that the federal budget process is broken. And in the budget bill signed in February, Congress itself acknowledged this and created a special, bicameral committee to consider changes to the budget process.The committee, known as the Joint Select Committee on Budget and Appropriations Process Reform, consists of eight senators and eight members of the House, equally divided between the two parties. It is required to report out some recommendations for budget reform by the end of this month, and members began a public markup of those recommendations earlier this week.The rules under which the committee is required to work mean that it was never likely to produce dramatic reforms. In order to be included in the bill the committee presents to the larger Congress, a recommendation has to garner at least five Republican and five Democratic votes, and that means very few ideas will make it.Still, budget reformers have had some hope that, by at least compelling some bipartisan discussion of key problems with the budget process, the committee could be the start of some meaningful improvements to come. It could well be that, but it is certainly looking like a slow start for now. The only recommendation in the bill put forward by the co-chairs of the committee is that Congress move to biennial budgeting in place of the annual budget process required by law today.NR's afternoon roundup of the day's best commentary & must-read analysis.Two-year budgeting is not a significant budget reform. For one thing, Congress already does it pretty routinely. The budget resolution passed earlier this year, as well as those in 2013 and 2015, included a two-year appropriations framework. It’s not crazy for Congress to formalize what it already does informally, but neither does it make sense to call that a transformative idea. And there are certainly some real drawbacks to such budgeting, which often just ends up yielding more and bigger supplemental spending packages beyond the normal appropriations bills.The special committee’s markup process, which began this week and will continue on Tuesday, has so far resulted in three amendments being added to the committee’s reform proposals: One would tinker slightly with the membership structure of the Senate Budget Committee; another clarifies that Congress can still pursue a reconciliation process each year even if it adopts biennial budgeting; and a third creates the option of a special “bipartisan budget resolution” in the Senate. These, too, are very modest ideas.This modesty is understandable, especially given the structural constraints of this committee. But we should hope that this process shakes loose some greater will for a bigger transformation of the budget and appropriations process. Budgeting is central to what Congress does, and the dysfunction of the budget process is now central to the broader dysfunction of the Congress. In past eras of dysfunction, fundamental budget reform has been essential to reinvigorating Congress and reasserting its authority.A bolder reform agenda geared to making Congress stronger could try to make the budget process more like legislative work (divided into small, discrete, concrete steps that call for bargaining over particulars) and less like executive work (consolidated into a single, large decision that calls for unity around abstractions). That would mean rethinking elements of the committee system, the work of “scorekeepers” (like the Congressional Budget Office), and even the distinction between authorizing and appropriating that now too often separates policy priorities from budgeting.Those kinds of ideas aren’t going to come from this special committee. But hopefully its work could help to build the will required to think bigger.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}