{"id": "Trump and the Decline of the Suburban Republican\t\t\t\t\t\t\tTrump and the Decline of the Suburban Republican\t\t\t\t\t", "paragraph": "National ReviewJane Coaston suggests that “never Trump Republicans” swung the election to the Democrats, contrary to the claims of many people on the anti-Trump left and pro-Trump right that they are a tiny group without any sway over voters. Her article is a useful corrective to those claims. It is certainly true that there are a significant number of voters who oppose tax increases, dislike the idea of single-payer health care, have usually voted for Republicans, etc., but have serious objections to the president. It’s not just a subset of pundits who meet that description.But there are differences, too, between the anti-Trump conservative pundits and the anti-Trump center-right (or formerly center-right?) voter. The never-Trump pundits are split, and I don’t think it is too much of an oversimplification to divide them into left and right segments.The leftier never-Trumpers tend to favor legal abortion and gun control, to have opposed the confirmation of Justice Kavanaugh (at least by the end of that debate), to have been moved by Trump’s presidency to reconsider many of their past conservative views, and to have proselytized in favor of Democratic candidates for Congress in the last election. Think of Max Boot as an example of the kind of commentator I’m talking about. The more conservative never-Trumpers, on the other hand, are pro-life, are at least skeptical of gun control, strongly favored Kavanaugh’s confirmation, and mostly argued against voting for Democrats this year. Think of, say, NR’s own David French (who is quoted in Coaston’s article).The leftier kind of never Trumper is not an especially novel phenomenon: Well before Trump, Republicans were losing the support of upper-middle-class socially liberal voters. (Their movement out of the conservative coalition seems to have accelerated under Trump, though.) What was new in 2016 was the phenomenon of the ideologically very conservative Republican who had not previously had much reason to be uncomfortable in the party but refused to countenance the presidential nominee.The Frenches of the world—if my colleague will permit me the license—want to make it clear that it is possible to be strongly conservative while disagreeing with Trump on some issues and judging much of his conduct harshly. To the extent that the “never Trump” label has become associated more with the Boots, however, it undermines that case: They make it look like opposition to Trump is part and parcel of a general desire for the Republican party to be more moderate. And the ranks of the most conservative never-Trumpers have been diminishing anyway, as the course of the administration has put to rest the doubts of 2016 about Trump’s reliability as an ally of conservatives on most issues.The defecting Republicans in this election seem, as far as I can tell, to be closer in profile to Boot than to French. Which means, among other things, that while Trump’s personality and character are playing a role in reshaping the Republican party, its problems with the kind of voters who turned against it this fall are not limited to them.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}