{"id": "Prosperity, in the Present\t\t\t\t\t\t\tProsperity, in the Present\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Case for the Wage Subsidy\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tMaking Acosta a Federal Case\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCongress Finds Bipartisanship in Farm Welfare\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAgainst the ‘Coercive Elimination of Dissent’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump’s Not Populist Enough\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tRick Scott’s Lead Increases after Recount\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPelosi Vows She’ll Be Speaker Despite New Potential Challenger\t\t\t\t\t\t\t\nFrom where I’m standing, it looks like Michael Tomasky has a terrible sense of timing.Writing in the New York Times, Tomasky argues that Democrats are in dire need of those two magical commodities — “spin,” as the headline puts it, and “narrative” — to best the Republicans on the economic debate.Where I am standing is in the parking lot of a Chick-fil-A in Midland, Texas, where I have stopped to take a photo of the big sign out front, which doesn’t say anything about specials on chicken sandwiches: It says “$13 an hour,” which is the starting wage at many fast-food establishments here. They have a tough time filling those jobs, because working in the oil business, even in a semi-skilled capacity, pays a heck of a lot more than that: One company right now is offering new drivers with Class-A commercial drivers’ licenses $20,000 bonuses. Other companies will take anybody with a clean driving record and train him to get a CDL.I’ll have a great deal more to say about this in an upcoming piece for the magazine, but the one undeniable lesson of the labor market here is: Demand matters. A growing economy needs labor, and when firms really have to compete for every worker, as they do here, wages go up.Tomasky, with an eye toward Tuesday’s elections, writes that Democrats ought to use the improved political position they are expected to have post-election to “bury supply-side economics.” He describes that school of thought as the belief that “cutting taxes, especially on the rich, and decreasing regulation will unleash so much innovation and economic activity that tax revenues will actually increase and the entire economy will benefit.” If that were all there were to the Right’s economic thinking, then, indeed, that would be an idea worth burying, and the myth of self-financing tax cuts has done a great deal of damage to Republicans’ credibility on fiscal questions. But that is not all there is to free-market economic thinking, or to the economic thinking of elected Republicans such as Paul Ryan, Ben Sasse, or Justin Amash.\nIn any case, it is a tough time to be putting forward an indictment of Republican economic policies — even in the New York Times, which on another page reports the achievement of “new heights for the job market.” Say what? “Employers keep creating jobs at a healthy clip, 250,000 of them in October, a boom that was apparent in every major sector and that continued unabated even as the American economy inched closer to full employment.” Those 250,000 new jobs outperformed economists’ forecasts. We tend to overestimate the influence of politics on near-term economic developments, but we can at least say that Republican governance — the president, the Senate, the House, the majority of state governments — has coincided with a period of welcome growth and prosperity. As a purely political question, running against the Republicans on the economy is, just at the moment, probably a losing proposition.There are a few things that need to be untangled here.Taxes and regulation are not a unitary issue, and “regulation” is a term so vague and nebulous as to be effectively useless. There are good regulations and bad ones, effective regulations and ineffective ones, and — this is the tricky part — regulations that fall on the right side of the cost-benefit analysis and those that fall on the wrong side. Nobody wants to poison the drinking water, and, with the exception of a few loopy environmentalists, nobody wants to see drivers paying $30 a gallon for gasoline. The proper business of regulation is mitigating the effects of certain kinds of externalities (including risk) in a minimally disruptive way.You know what was heavily regulated in the run-up to the subprime-mortgage meltdown a few years ago? Mortgage lending. Banking in general is a pretty heavily regulated business, but the regulations we had in place (and have in place) are not especially effective at doing what we want them to do. Discussions of “regulation” and “deregulation” as abstractions are not particularly useful. Presumably, intelligent Democrats acting in good faith would oppose ineffective regulations, too, it’s just that the Democratic party is not dominated by intelligent people acting in good faith — some are one, some are the other, but very few are both.The tax debate suffers from a similar problem of oversimplification. We tinker with taxes all the time, and some of that tinkering matters a great deal: The recent structural changes to the corporate tax code are beneficial and important, probably more so than is generally appreciated. But while we love to monkey with rates, the general tax scene doesn’t change all that much: In 1957, when notional tax rates were dramatically higher than what they are today, the federal government collected 17.2 percent of GDP in taxes. In 2015, the federal government collected 17.7 percent of GDP in taxes — a little higher, but not all that much.What is radically different is how much money was spent and — even more important — what that money was spent on: In 1957, we spent 9.8 percent of GDP on the military, nearly three times what we’ve typically spent in recent years — and we had a balanced budget. The overwhelming majority of our spending now is transfers and other social spending — defense accounts for less than 20 percent of outlays — and we run a substantial deficit.There are Republicans who would like to see higher defense spending and more tax cuts, which would be irresponsible: There is no time like the present — especially the prosperous present — to get the deficit under control. But, contra Tomasky, it isn’t Republican priorities that are swelling the deficit: Those tax cuts certainly will contribute to future deficits, but they will account for about $2.7 trillion in new debt over a decade during which the national debt is forecast to increase by $16 trillion. You don’t get $16 trillion in new debt from a $2.7 trillion tax cut, even if you think tax cuts in the current fiscal environment are a bad policy. Deficit-enabled entitlement spending (like all deficit-enabled spending, and deficit-enabled tax cuts) may support demand in the present, but it does so by borrowing from the future: Just because we are not paying the bills today doesn’t mean that they aren’t going to have to be paid one of these days. The idea that the federal government is going to manage that with such finesse as to somehow make that tradeoff a winning proposition, or even a painless one, strikes me as implausible.If you want to keep that social spending where it is, then, in the long term, you will need to approximately double federal tax collections. If you want to keep taxes where they are or cut them, you will need to cut entitlement spending.Moaning about “inequality” in the abstract may be pretty good politics, but the concrete alternative to entitlement reform — doubling federal taxes — is conspicuously absent from the Democrats’ economic rhetoric. Democrats and Republicans both eventually must face the fact — or they will be compelled to face the fact — that the math is the math, that their choice is between unpopular entitlement reform and unpopular tax increases, and that, as Herb Stein famously put it, “If something can’t go on forever, it will stop.” Unfortunately for Tomasky et al., you can’t moralize your way out of that predicament. Unfortunately for the Republicans, we are not likely to grow our way out of hard choices, either.And, of course, we citizens ought to grow up a little bit and take a less credulous and superstitious view of the relationship between the president and the economy. It’s not that policy choices don’t matter — lifting our absurd ban on crude oil exports has meant a lot here in Midland — but there are many forces that shape the economic scene at any given moment, many of them having not a thing to do with the views of the American president or the actions of the government over which he presides. It wasn’t an act of Congress that put oil in the ground in the Permian Basin — and it wasn’t politicians who figured out how to get it out. Years of investments, experimentation, and plain hard grunt work went into that, and very little of that work happened in Washington.I agree that the Democrats need a new story on the economy. Republicans, too. And maybe both of them should, if only for the novelty, try one that is true.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}