{"id": "What We Really Believe\t\t\t\t\t\t\tWhat We Really Believe\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 17\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHow D.C. Is ‘Getting Guns Off the Street’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tOn Criminal Justice, Trump Embraces the Left’s Racism Rhetoric\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBetsy DeVos Strikes a Blow for the Constitution\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump Appointee Judge Rules for CNN. Good.\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tJudge Orders White House to Return Acosta’s Press Pass\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 16\t\t\t\t\t\t\t\nFresh from the people-lie-to-survey-takers department, another gem: One in four Americans believes that their house is haunted. Not that ghosts are real, mind you. Not even that haunted houses exist. No, 25 percent of our fellow citizens report that their actual current residence is home to a poltergeist.It’s really quite amazing that the nation’s social scientists haven’t died of despair.The fact is that belief, like all of the other abstractions with which we describe the workings of the human mind, is ultimately unmeasurable. We hardly know ourselves what we really think, a fact that has given rise to truisms (“no atheists in foxholes”; “a conservative is a liberal who’s been mugged”) of startling durability. Ask a survey designer to name his biggest fear, and he’s as likely as not to mention acquiescence bias or extreme responding, phenomena whereby respondents “yea-say” every question with which they’re presented or choose only the lowest and highest options (say, ones and fives) when asked to assign a numerical score to an assertion. That some woebegone data-collector spent a month asking 1,067 Americans about invisible spirits is almost too sad to bear, but his findings nevertheless reveal an important truth: Human beings are, by and large, exaggerators, fabulists, and liars. Is it entertaining to tell the man on the telephone that your house is haunted? Absolutely. Do a quarter of Americans really believe as much, in any meaningful sense of the word? Not on your life.Moving through this world, one quickly discovers the limits of human certainty. Like many of my fellow binge-watchers, I’ve been busy in recent days with the second season of Making a Murderer, Netflix’s appalling, addictive chronicle of the trials and convictions of Wisconsin’s Steven Avery. That Avery is either a vicious and unrepentant criminal or a beleaguered innocent whose persecution at the hands of the state ranks among the gravest injustices in American legal history is, of course, the source of much of the show’s drama. But it could also be, if we still thought in such terms, an opportunity for humility. Watching the series, it is impossible to shake the notion that Avery may well be guilty of the 2005 murder of photographer Teresa Halbach, the young woman whose burned remains were discovered only feet from his door. But it isn’t easy, either, to dismiss the possibility that Manitowoc County police officers planted evidence, or that Ken Kratz, the prosecutor in charge of the case, behaved abominably. (Kratz’s statement to the jury that “reasonable doubt is for innocent people” may be the most despicable thing ever uttered on television.)Perhaps each of these propositions is true. Perhaps none of them are. It isn’t possible to know. Yet following the 2015 release of the program’s first season, a WhiteHouse.gov petition calling for the pardoning of both Avery and Brendan Dassey, his alleged accomplice, garnered more than 125,000 signatures, and many of the men involved in Avery’s prosecution have reported receiving death threats. What did those who signed (or who threatened, wickedly) really believe? More importantly, what did it cost them to believe it?That the answer to both questions is clearly “nothing” is not merely a sociological fact or a quirk of the Internet age. It may be the key to understanding contemporary American politics.\nWe live, after all, in an age of extremes. Our opponents, we tell ourselves, are not just wrong but depraved, not just mistaken but traitors, conspirators, Nazis. One would think that so regularly encountering the fact of our own ignorance would make us modest (if nothing else, globalization and the existence of the Web should have taught us just how little we know), but something like the opposite has proven true. Instead of embracing subtlety and acknowledging that hugely complicated policy questions are indeed hugely complicated, we have stamped our feet and insisted that every answer is simple and that only a fool or a villain would dissent.How’s that working out for us?As a reasonably well-informed political observer, I believe that the migrant “caravan” making its way toward the nation’s border represents a threat to our security, that the President’s rhetoric is not to blame for the acts of madmen, and that Brett Kavanaugh was innocent of the charges against him. (Quick question: How many members of the Free Avery coalition are willing to extend the same benefit of the doubt to Justice Kavanaugh?) I believe, too, that Steven Avery was probably framed and that the police and prosecutors who built the case against him are most likely corrupt.I believe these things, but what do I really know? Very little, I’m willing to admit. There are simply too many variables, too many unknowns. What I can’t have is certainty. So perhaps I — we — should calm down a bit.In the meantime, we might do well to remember, especially in emotionally charged circumstances, the norms and principles that have served us for centuries. Our country has immigration laws and a border precisely because it is not always reasonable to admit every foreigner who seems sympathetic. We have freedom of thought and speech precisely because some words rankle. The presumption of innocence is inconvenient if one has been victimized, but we extend it precisely because of the vagaries of the criminal-justice system. The masses may have their dogmatism and their outrage. I will take a politics that runs on incrementalism and compromise. More importantly still, I will take a culture of law built on the greatest civil document ever devised by man.In his outstanding piece here this past Thursday, David French advised young evangelicals to “hold your faith tightly and your politics loosely.” Wise words those, and worth heeding no matter your age — even if your only faith is in this nation. Would such an agreement, widely adopted, deliver us to humility, or out of our current cycle of hatred, anger, and false certitude?Absolutely it would — I’m sure of it.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}