{"id": "Rahm Emanuel on the Elections\t\t\t\t\t\t\tRahm Emanuel on the Elections\t\t\t\t\t", "paragraph": "National ReviewThe Chicago mayor’s criticism of the Democratic National Committee for having ignored state races until late in the game is probably the part of this article that will get the most attention.The oddest part of it, though, is his attempt to claim that there’s something unusual about a party losing ground while presiding over a good economy:Nowhere is it written that the president’s party is guaranteed to lose big in a midterm election. In fact, when the economy is good, the party controlling the White House has a huge advantage. Democrats picked up five congressional seats in 1998, when President Bill Clinton was in office and the middle class was thriving. . . .But we know the flip side as well. When the American people think the economy’s headed in the wrong direction, they’re liable to punish the president’s allies across the country. That’s what happened in 1982, 1994, and 2006. And that’s why it’s so remarkable that Republicans are struggling one week out from this year’s midterm. . . .We’re on the verge of watching the American people repudiate a sitting president despite a nominally strong economy. That’s exceedingly rare.It is? Real GDP growth was 4 percent in 1994, 2.9 percent in 2006, and 2.5 percent in 2014 — all respectable numbers for the time periods in question, but all years when the party in power had bad elections. In all three cases the unemployment rate was falling.The fact is that midterms usually go badly for the party in power, and 1998 is one of only two exceptions since the 1930s. Emanuel’s claims to the contrary read to me like a clumsy way to play the expectations game with the election results.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}