{"id": "The Ridiculous Kyrsten Sinema\t\t\t\t\t\t\tThe Ridiculous Kyrsten Sinema\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAbrams Campaign Considers Drastic Legal Measure to Force Another Vote\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBroward County Missed Recount Deadline by Two Minutes\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFlorida Dems Gave Out Altered Form to Fix Absentee Ballots Past Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Election’s Lesson for Democrats: Don’t Nominate Hillary Clinton\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tMichael Avenatti Bites the Dust\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tUrban Cowboys\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Blue Wall\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLosing the Suburbs\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tToward a Bigger Coalition\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFlorida Judge Gives Voters Additional Time to Correct Rejected Ballots\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHillary Clinton: If Stacey Abrams ‘Had a Fair Election, She Would Have Already Won’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAnyone but Nancy Pelosi for Speaker\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe GOP’s Orange County Problem\t\t\t\t\t\t\t\n‘It was Rousseau,” writes Frank M. Turner in European Intellectual History from Rousseau to Nietzsche, “who made the hatred of one’s own culture the stance of the cultivated person.” The Rousseau of Arizona is the alternately contemptuous and clownish Kyrsten Sinema, who is trying to persuade Arizonans to overlook her well-documented contempt for the state and tap her to be one of its two U.S. senators.Sinema, a bisexual former social worker and criminal-defense lawyer who toiled for Ralph Nader’s radical Green party in 2000 and acknowledged being a “bomb thrower” when first elected to the Arizona state legislature in 2004, has also called herself a “Prada socialist.” Today she plays a cautious congresswoman, seemingly intent on following the path of Kirsten Gillibrand, a New Yorker who logged a centrist record in the House while representing a somewhat conservative district but shifted hard left when she was appointed to the Senate. Sinema has a résumé so extreme that even CNN pointed out that her positions “frequently brought her into contact with the left-wing fringe.” Among that fringe, despising ordinary Americans is a hilarious bonding ritual. Even mocking one’s own state is seen as a way of scoring points with the right-minded.In a 2010 speech to a gathering called Netroots Nation, sometimes dubbed “Nutroots Nation” for the fever it inspires in cranks, extremists, and eccentrics, Sinema cheerfully quoted a Daily Show quip and called Arizona the “meth lab of democracy.” (Isn’t that supposed to be New Mexico? Has any Daily Show writer ever set foot in either state?) “I’m happy to steal it and use it all the time,” she said then.The majority of Arizona men tend to vote conservative, but Sinema derided such folks as “Neanderthals.” As for the state’s stay-at-home moms, Sinema launched a bizarre attack on them: “These women who act like staying at home, leeching off their husbands or boyfriends, and just cashing the checks is some sort of feminism because they’re choosing to live that life. That’s bullsh**. I mean, what the f*** are we really talking about here?” she said in 2006. Stay-at-home mothers might respond that what they are talking about is the significant work that goes into making a household and a family operate, and that such labor is hardly “leeching.”Sinema has attempted to cast her notorious anti-war speech in a pink tutu for the activist group Local to Global Justice in 2003 as merely an honorable anti-war statement. Yet the flyer this group — which she co-founded — distributed to promote the rally she organized and of which she was listed as the point of contact depicted U.S. soldiers as ghoulish skeletons. It noted, “You can help us push back U.S. terror in Iraq and the Middle East.” PolitiFact, in one of its more embarrassing instances of carrying water for Democrats, said none of this indicated Sinema’s disrespect for U.S. troops, citing the congresswoman’s claim that she did not “approve or design the flyers.” No, she merely led the group that distributed them.It’s not like Sinema’s truthfulness hasn’t been called into question on other occasions. Central to her biography is her tall tale about having been “homeless” with her family in Florida for nearly three years. She wasn’t homeless. She lived in a cinderblock building that had once been a gas station, then a country store. She has claimed the dwelling had no running water or electricity. Really? When she told the Washington Post “we had a toilet,” the Post noted drily, “How that toilet was flushed with no running water, she wouldn’t say.” When asked how the family prepared food, Sinema hesitated, said the Post. “You know, you could make fires,” she added. Sure, Kyrsten. When the New York Times pointed out that Sinema’s parents had told a judge at the time they were paying monthly bills for gas, electricity, and phone service, making it unlikely that they had had no access to these things, Sinema replied, “Oh gosh, I don’t have an answer for that.” In the Washington Post, her step-aunt said of Sinema’s hard-luck story: “I realize this tugs at people’s heartstrings and that was what she was going for, but, you know, it’s not the truth.”\nWhat is the truth is that Sinema has a long history of nauseating ideology. She called Presidents Reagan and George H. W. Bush “the real Saddam and Osama lovers” in a 2003 op-ed, and when an interviewer asked how she’d react if he joined the Taliban, her response was: “Fine. I don’t care if you want to do that; go ahead.” Joining the Taliban isn’t actually fine. It would be treasonous. When Martha McSally, the Harvard-trained retired Air Force colonel and fighter pilot who is the Republican candidate for Senate in Arizona, said so, Sinema whined that it was a “smear.” As for Sinema’s supposedly principled opposition to war, it isn’t so principled as all that. She has called for U.S. military intervention in Somalia, Sudan, and Rwanda.Sinema’s admiration for Arizonans and for U.S. troops might appear questionable, but she does have a soft spot for witches. She warmly invited sisters of the coven to her Code Pink protest in 2003 and wrote, of another anti-war rally in Miami, that she spent it “singing and spiraling in the pagan’s circle only 5 rows back from the police line.” Save it for Stevie Nicks tribute night down at the local pagan pub. Raised Mormon, Sinema no longer counts herself a member of the LDS church and has said, “I am not a member of any faith community.” Why sell yourself short, Kyrsten? Nicks-Wicca is a kind of faith. All that singing and spiraling! Whether it’s becoming of a U.S. senator to have such a silly record is another question. Sinema seems like a twisted Daily Show parody of the values represented by Arizona’s recently departed senator, John McCain. It would be a disgrace to his memory if a far-left dingbat witchy-poo anti-war protester came to serve his state in the United States Senate.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}