{"id": "Jennifer Wexton’s Deceitful Ad\t\t\t\t\t\t\tJennifer Wexton’s Deceitful Ad\t\t\t\t\t", "paragraph": "National ReviewEvery once in a while in covering politics, you come across a political attack so brazenly dishonest that you almost have to salute at the audacity of it. Jennifer Wexton, a Democratic state senator in Virginia running against Republican representative Barbara Comstock, has an ad in heavy rotation that deserves some sort of prize for going above and beyond the call of duty in trying to fool voters.The ad tries to tie Comstock to President Trump on health care. Potentially its most damaging hit portrays Comstock as an opponent of protections for people with pre-existing conditions. Here’s how the ad handles the issue: It says that Trump is against such protections, says that Comstock usually votes with Trump, and concludes that she’s therefore against the protections too. Never mind that Comstock voted against the House version of the Republican health-care bill last year, saying among other things that it contained inadequate protections for people with pre-existing conditions.It’s well within bounds to attack Comstock for voting “with Trump” too often — although the statistic used to make that case is fairly meaningless — and even to label her “Barbara Trumpstock.” (Nothing says you hate Trump like using a juvenile nickname, I guess.) But you’d think, if you wanted to nail Comstock for agreeing with Trump and being out of step with her district, you’d pick an issue on which she, you know, agreed with Trump and was out of step with her district. Instead the ad pretends that she takes the opposite position from the one she does, in order to further its narrative. (“Barbara Trumpstock agrees,” the ad claims, after laying out Trump’s positions.)Wexton is lying on this issue, and based on my recent TV viewing, she’s lying multiple times an hour.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}