{"id": "How Immigration Changes Britain\t\t\t\t\t\t\tHow Immigration Changes Britain\t\t\t\t\t", "paragraph": "National ReviewAlmost nothing is discussed as badly in America or Europe as the subject of immigration. And one reason is that it remains almost impossible to have any sensible or rational public discussion of its consequences. Or rather it is eminently possible to have a discussion about the upsides (“diversity,” talent, etc.) but almost impossible to have any rational discussion about its downsides.When I wrote The Strange Death of Europe, I wanted to highlight the sheer scale of change that immigration brings. Some people might be happy with it, others unhappy: but to pretend that the change doesn’t occur, or won’t occur, or isn’t very interesting so please move along has always seemed an error to me. For instance, as I noted then, an internal document from the Ministry of Defence that leaked a few years back said that Britain would no longer be able to engage militarily in a range of foreign countries because of “domestic” factors. It takes a moment to absorb this. We’re used to wondering about how immigration changes domestic politics. But foreign policy as well?All of this is to say that the latest news from the U.K. is both thoroughly predictable and deeply disturbing. Readers of National Review will be familiar with the case of Asia Bibi. She is the Christian woman from Pakistan who has been in prison on death row for the last eight years. Her “crime” is that a neighbor accused her of “blasphemy.” As Mairead McArdle wrote:In 2009, Bibi found herself in a quarrel when she went to get water for herself and other farm workers and two Muslim women objected to drinking from a container used by a Christian. A mob later came after Bibi, accusing her of insulting the prophet, and she was beaten up in her home. She was subsequently arrested, tried, and sentenced to death.Her case has had ramifications throughout Pakistani society in the years since. For instance, it provoked the statement by the brave governor of Punjab, Salman Taseer, which led to his own murder by one of his own bodyguards. In the days since her release from jail, there have been mass protests in Pakistan where thousands of enraged fanatics have called, literally, for Asia Bibi’s head. The case has amply demonstrated the type of country that Pakistan is these days. But who would have guessed that her case would also throw so much light on the type of country Britain now is?There are clearly international efforts underway to get Bibi out of Pakistan. If anybody in the world deserves asylum it is her. And any civilized country should be queuing up to give asylum to her and her family. Among those reported to have done so is the Netherlands.But today there are reports that the British government has said that it will not offer asylum to Asia Bibi. The reason being “security concerns” — that weasel term now used by all officialdom whenever it needs one last reason to avoid doing the right thing. According to this report, the government is concerned that if the U.K. offered asylum to Bibi it could cause “unrest among certain sections of the community.” And which sections would that be? Would it be Anglicans or atheists who would be furious that an impoverished and severely traumatized woman should be given shelter in their country? Of course not. The “community” that the British government will be scared of is the community that comes from the same country that has tortured Asia Bibi for the last eight years.The government is right to expect a backlash. There have been cases before of this “community” expressing its views. From the book-burnings and protests over The Satanic Verses affair in 1989 to the mass protest against cartoonists, which was the “community’s” response to the Charlie Hebdo massacre in 2015, the Pakistani Muslim community in the U.K. has never been shy of expressing its views. Occasionally you even get a case like that at Easter 2016, when a Muslim from Bradford drove up to Glasgow to kill another Muslim (a shopkeeper called Asad Shah) because Mr. Shah came from a minority Muslim group that his killer deemed heretical. Which you might say is another example of “diversity.”In any case, if it is true that the British government has declined to offer Asia Bibi asylum for this reason, then it should lead to a huge national and international outcry. Among other things, it suggests that the British government has got its priorities exactly the wrong way around. For it is not Asia Bibi who should not be in Britain. It is anyone from the “communities” who would not accept Asia Bibi being in Britain who should not be in the country. Though I wouldn’t expect any British politician to express that simple truth any time soon.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}