{"id": "How Progressive Elite Control of Education Embitters Americans\t\t\t\t\t\t\tHow Progressive Elite Control of Education Embitters Americans\t\t\t\t\t", "paragraph": "National ReviewLet me share two seemingly disconnected items. The first comes from the New York Times. Yesterday it profiled five Harvard College freshmen as they discussed how they gained admission into one of the nation’s most selective universities. It was striking how keenly aware they were of the admissions committee’s quirks and biases. It was as if they knew the stew the committee was trying to create, and their challenge was to market themselves as the right kind of ingredient.There was the Asian-American student who joined the Air Force ROTC in part because she didn’t want to be seen as the “typical Asian.” There was another Asian composer from London who says she wouldn’t have “ticked the Asian box” if she had been a STEM student. Another student, a white man, believes he gained admission in part because he was from the Midwest and his family was low-income.If you’ve ever served on an elite university’s admissions committee, you can see that the students are keenly aware of the game. They highlight their quirks, downplay their privileges, and exaggerate the adversity they had to overcome. (I’ll never forget the young woman who described herself as “formerly homeless” when her wealthy family had merely decided to travel the country in an RV for a year.) Heavily ideological institutions have decided how they want to socially engineer the American elite, and ambitious young Americans must bend to their will.The second item is a bit strange. This spring we moved from our beloved home in Columbia, Tenn., to Franklin, a Nashville suburb. We were going through boxes as we packed and came across some schoolbooks from my wife’s early elementary-school education. It looked like they were written in a foreign language. You could decipher the words with some difficulty, but they clearly weren’t written in English.“That’s ITA,” my wife said. “It stands for initial teaching alphabet.” It looks like this:It turns out that for a time, some American schools initially taught reading through a 45-character alphabet invented by a British man named James Pitman. After learning reading through ITA, students would transition into standard English. It was never that popular. It’s now virtually extinct — just another education-reform idea that’s relegated to the dustbin of history.Modern America is characterized by an intense grassroots distrust of American elites — with red America especially disdainful of progressive elite institutions. Much ink has been spilled explaining the reasons for this distrust, and I don’t intend for a single short piece to encompass the whole of the argument, but I do think we underestimate the extent to which prolonged exposure to a flawed and biased elite-ordered and elite-controlled education system is profoundly dispiriting and embittering for millions of Americans.Public education has been marked by diminished local control, top-down reform driven by ideological and educational fads, and failed experiment after failed experiment. For example, the intense opposition to the Common Core in the recent past was driven in part by the too-fresh memory of other grand ideas and technocratic national movements.\nAs for higher education, its gatekeepers are often explicit ideological radicals. At their worst, they attempt to micromanage a freshman class’s racial and socioeconomic background (and sometimes its political composition) based on theories about privilege that are utterly at odds with the lived experience of the American families at their mercy.Let’s put it this way: Especially in elite higher education, highly privileged (mainly white) administrators are quite often rejecting less privileged (mainly white and Asian) applicants in part because even that lesser privilege is too much. They deny students’ dreams in the fixed belief that their particular brand of mixing by race, class, and quirk is best for their institutions and best for their students.Of course, education by its very nature will be considerably elitist — involving the transmission of knowledge from the better-educated to those who know less — but it becomes particularly difficult to swallow that elitism when it is so often distant, ideologically hostile, and (in so many areas) clearly unsuccessful.And that frustration is magnified when you understand that the broken dreams and manifest failures impact the people most precious to all parents — their own children. Time and again, you see the frustration. These people, parents say, are messing with my kids.Yes, there are countless good schools in the United States — and parents will pay immense housing premiums to attend those schools — but all too many parents have felt helpless in the face of decisions that directly affect their children and that sometimes seem arbitrary, misguided, or even heartless. In secondary education, “local control” isn’t just a political slogan, it’s an act of civic reform and shared civic responsibility that can decrease that sense of alienation and helplessness.In higher education, true racial nondiscrimination and actual intellectual diversity can decrease the sense that kids are mere ingredients in someone else’s diversity stew. Of course higher-education admissions decisions have to be made on some basis, but must it always be true that the deciders will come from largely from a highly specific, highly privileged slice of progressive American life? Must it always be true that these admissions decisions are so highly dependent on factors that are completely out of the applicants’ control?As with any system of immense size and complexity, there is no easy fix, and even the best-laid plans would require perhaps decades of implementation before a culture is changed. You can’t diversify a college administration overnight. Conservative academics will not come springing from the woodwork even if hiring committees remove their ideological blinders. But it’s still important to identify the cost of the status quo. And that cost is clear — embittered Americans who can often rightly feel as if their presumed “betters” never gave their children a truly fair chance to succeed.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}