{"id": "Why Does College Cost so Much?\t\t\t\t\t\t\tWhy Does College Cost so Much?\t\t\t\t\t", "paragraph": "National ReviewProgressives complain that going to college costs too much, and then almost always say that the solution is in some new governmental action. (Of course, more governmental action is their solution to every problem, real or imagined.)Recently, readers of The Atlantic were treated to such an article by Amanda Ripley. She sought to explain why the cost of college has been rising so quickly for the last several decades. She managed to completely miss the elephant in the room, namely federal higher-ed subsidies.In today’s Martin Center commentary, economics professor Richard Vedder corrects her errors.NR's afternoon roundup of the day's best commentary & must-read analysis.He writes:She fails to even fleetingly mention one thing unique to American higher education that has been an enormous factor in driving up costs: the federal student financial assistance programs. The money from those programs has provided universities an opportunity to raise fees aggressively, using the proceeds to fund a very costly and unproductive academic arms race, including ultra-posh buildings, climbing walls and lazy rivers, and college sports programs that are out of control both financially and morally.That omission is not surprising. Progressives can never bring themselves to admit that any of their “compassionate” programs like minimum-wage laws, rent control, or educational subsidies have adverse effects.Vedder also points out (based on his long experience in higher ed) that most college leaders have no interest in cost control. They would much rather compete on prestige and luxurious amenities than on price.His conclusion “sticks the landing,” as they’d say in gymnastics: “Government has been the problem, not the solution. In the era before big government came to dominate higher education, fees grew less rapidly than people’s income, enrollments rose, and America became acknowledged as the world’s leading center for learning at the highest levels. We can return to high quality, affordable higher education, but only if we’re willing to end federal subsidies. It’s time for liberals to understand that.”NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}