{"id": "Planned Parenthood’s New President Appears on CBS and Doesn’t Mention Abortion Once\t\t\t\t\t\t\tPlanned Parenthood’s New President Appears on CBS and Doesn’t Mention Abortion Once\t\t\t\t\t", "paragraph": "National ReviewIt’s her first official day on the job as the incoming president of Planned Parenthood, and the way Leana Wen spent her morning is a clue that she intends to continue the public-relations campaign convincing Americans that her group has nothing to do with abortion.Bright and early, Wen appeared on CBS This Morning, greeted by a panel of interviewers who were all but interrupting one another in their haste to toss softball questions her way.The segment began as one might expect, with CBS laying out statistics uncritically claiming that Planned Parenthood provides irreplaceable health care for millions of American women every year. Totally unmentioned, of course, was the fact that Planned Parenthood is also far and away the nation’s largest abortion provider, performing 321,384 abortions last fiscal year alone, according to the group’s own annual report. That’s more than one-third of the annual abortions performed every year in the U.S.Here’s a sample of the questions Wen received during the segment: “You’re the first doctor to lead this organization in more than a century. What do you plan to bring to the organization from your background?” “Why did your family use Planned Parenthood?” “It has now become such a politicized and such a controversial job. Did you have any trepidation about taking it?” “Were you encouraged after the elections?”Unsurprisingly, Wen had little trouble dispensing with these queries, and they offered her a nice platform on which to present fluffy PR sound bites. Though she was asked explicitly about abortion-related state-level amendments and about the possibility of a Supreme Court case overturning Roe v. Wade, Wen did not say the word “abortion” a single time during the entire interview. Instead, she relied on the favored euphemisms of the pro-choice movement: reproductive rights, access to health care, and that standard Planned Parenthood slogan, “Women’s health care is health care.”CBS made sure to display a picture of Wen with her own young child, as the new Planned Parenthood president said, “Being a parent has clarified my values, and what I want to do is shape the future for my son, Eli. It’s a future where all people are treated the same, that all people have a right to health care, and it’s a society where we trust women.” The natural follow-up question “Trust women to do what?” was left unasked.NR's afternoon roundup of the day's best commentary & must-read analysis.The most interesting exchange occurred when one of the talking heads asked Wen for her thoughts on last week’s elections.“Less than 24 hours after the elections, we saw the Trump administration come out with new rules that would prevent employers, or, actually that would allow employers to deny women birth control coverage,” she replied. She was referring, of course, to the Health and Human Services Department’s Obamacare mandate, which required all employers, regardless of religious beliefs, to subsidize employees’ contraception and abortifacients.Not one minute later, however, Wen answered another question with the following bromide: “I respect each person’s beliefs for themselves. My problem is if they want to impose their own beliefs on other people.” Apparently Wen’s distaste for imposing beliefs on others does not extend to the federal government’s efforts to compel Catholic nuns to subsidize abortion-inducing drugs.This interview was everything Planned Parenthood’s public-relations team could hope for. In fact, it’s tough to imagine how a Planned Parenthood marketing video would’ve differed at all from this segment. Not only was Wen permitted to portray herself as a compassionate mother and physician, who only involves herself in politics when it’s necessary to protect “women’s rights,” but she also got away with avoiding abortion entirely.It’s the perfect encapsulation of why Planned Parenthood’s marketing has been so successful and why so many Americans are blissfully unaware that the group performs hundreds of thousands of abortions every year, all while passing itself off as indispensable health care. In reality, Planned Parenthood does very little outside the realm of sexual health. Aside from abortion, its most common offerings are STD tests and birth control.Consider how those 321,384 abortion procedures dwarfed adoption referrals (3,889) and prenatal services (7,762) last year. That means Planned Parenthood performed 83 abortions for every one adoption referral, and its prenatal services have dropped every year since 2009, from over 40,000 that year to just under 8,000.Last year, its facilities provided only 235,000 well-woman exams and 32,000 “family practice services,” and the group shuttered dozens of its clinics. Its locations are outnumbered 20 to one nationwide by federally qualified health-care centers that provide a host of health-care services without providing abortion.Despite Wen’s multiple claims that Planned Parenthood is about health care, not politics, the group’s political-action arm donates millions of dollars to left-wing, pro-choice politicians. During this year’s midterms alone, the group spent more than $30 million to mobilize voters for Democratic candidates.Wen’s interview this morning shows that Planned Parenthood intends to carry on deceiving the public, this time aided by a president who is both an immigrant and a doctor, better enabling her to pretend that her group focuses on everything under the sun but abortion. As long as media outlets such as CBS remain willing and eager to run cover, Planned Parenthood will continue to get away with it.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}