{"id": "ABC News Makes a Serious Mistake\t\t\t\t\t\t\tABC News Makes a Serious Mistake\t\t\t\t\t", "paragraph": "National ReviewToday, across Twitter, I began to see a number of people condemning the Trump administration (and Betsy DeVos, specifically) for imposing a new definition of sexual assault on campus so strict that it would force women to prove that they were so harassed that they’d been chased off campus and couldn’t return. Soon enough, I found the source of their concern. A terribly mistaken article from ABC News. In describing the Department of Education’s proposed Title IX rule changes to sexual-assault adjudication standards (I wrote about them today on the home page), ABC says this:One of the biggest changes to the rule would be a new definition of sexual harassment. Under Obama, it was defined it as “unwelcome conduct of a sexual nature.” The new rule would define sexual harassment as unwanted sexual conduct that is “so severe, pervasive and objectively offensive that it denies a recipient’s education program or activity.”That definition would be significantly more difficult to prove because the victim would have to prove the misconduct prevents them from returning to school.No. The latter statement is completely wrong. The “new” rule is based on an almost 20-year-old Supreme Court case, Davis v. Monroe County Board of Education, and is a restatement of standard sexual-harassment law. My friend Ken White explains:Basically, the \"so severe or pervasive\" is standard harassment law language.  it does not require literally preventing the person from returning.  It requires proof that the harassment is so frequent or bad that it alters the nature of employment/schooling.— WhatCouldGoWrongHat (@Popehat) November 16, 2018The proposed rule defines sexual harassment as sexual assault, quid pro quo harassment, and as “unwelcome conduct on the basis of sex that is so severe, pervasive, and objectively offensive that it effectively denies a person equal access to the recipient’s education program or activity.” Note that the standard does not require you to prove that you lack “access” to the educational program. You merely have to prove that you lack equal access — that your access to the program or activity is fundamentally tainted by harassment.A rule that required women to prove that misconduct “prevents them from returning to school” would be outrageous and would permit a host of dreadful actions that oppressed women but not enough to chase them from campus. Thankfully that’s not the law.But that’s not the only problem with ABC’s story. It also describes the motivation for the changes like this:A small group of mens’ rights groups have pushed for the changes, contending that schools have gone too far and provided little due process to the accused. That criticism has resonated with several White House supporters, including President Donald Trump’s son, Donald Trump Jr., who has said he’s more worried about his sons than to his daughters in the #MeToo era.That statement drastically understates the scale of the problem and the identity of those seeking change. Courts have faced waves of litigation, and judges from coast-to-coast and across the ideological spectrum have issued dozens of adverse rulings against universities. Coalitions of law professors from places like Harvard and Penn have expressed concerns about the lack of due process on campus. The Atlantic‘s Emily Yoffe has written an invaluable series of articles outlining the serious problems with campus sexual assault adjudications. This was no fringe movement. It was constitutionally necessary.ABC should revise its inaccurate report. It’s causing unnecessary concern about an already-contentious topic.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}