{"id": "Bob Stefanowski for Connecticut Governor\t\t\t\t\t\t\tBob Stefanowski for Connecticut Governor\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAbrams Campaign Considers Drastic Legal Measure to Force Another Vote\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBroward County Missed Recount Deadline by Two Minutes\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFlorida Dems Gave Out Altered Form to Fix Absentee Ballots Past Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Election’s Lesson for Democrats: Don’t Nominate Hillary Clinton\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tMichael Avenatti Bites the Dust\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tUrban Cowboys\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Blue Wall\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLosing the Suburbs\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tToward a Bigger Coalition\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFlorida Judge Gives Voters Additional Time to Correct Rejected Ballots\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHillary Clinton: If Stacey Abrams ‘Had a Fair Election, She Would Have Already Won’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAnyone but Nancy Pelosi for Speaker\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe GOP’s Orange County Problem\t\t\t\t\t\t\t\nRepublican businessman Bob Stefanowski is closing in on a historic victory in the Constitution State. While the contest remains neck-and-neck and within the proverbial margin of error, a new Hearst/Sacred Heart University poll shows his campaign is now leading that of his liberal Democrat foe, Ned Lamont, despite being outspent and getting uniformly negative media coverage. Stefanowski has cut into the gender gap while increasing support among unaffiliated voters. Whether the “Mo” is big or little, it’s Stefanowski who has it. We hope it carries him through Election Day.For the last decade Connecticut has shown signs that it is more purple than blue, with voters — tormented by relentless tax hikes, massive debt, and de facto union-boss and special-interest control of the legislature — electing more Republicans over the past four cycles. Today, the GOP stands even, 18–18, in the state senate and within five seats of controlling the state house. It’s possible that Republicans will capture both chambers and, given the chance by voters, begin clearing out Connecticut’s stable.On Election Day, we encourage Connecticut voters of all partisan stripes to do two things. One is to send a clear message that the liberal program and agenda have failed, miserably. The other is push to reimplement the conservative fiscal policies and approach towards businesses that once had Connecticut ranking atop the nation for jobs, opportunity, and prosperity.Against the backdrop of an utterly failed state economy, there are a five reasons why Stefanowski might prevail. The first is that he has run a legitimate “outsider” campaign, appealing to voters exasperated by Hartford’s tainted political establishment. Having never before sought public office, Stefanowski petitioned himself onto the GOP August primary ballot, having forgone the more traditional route to nomination via the state party convention, and prevailed over a field of five competitors.The second is his personal qualities. To describe him as low-key is an understatement, but he has an authentic regular-guy charm. The Democratic attacks on him as a mean businessman seem to have flopped. A recent spot with Stefanowski’s wife and daughters has proven effective in reinforcing a simple and key reason why people vote for a candidate: He’s likeable.\nThe third is a simple and effective message. Connecticut ranks last or near-last in all state-by-state fiscal analyses, its residents bear the nation’s highest per capita debt load, and it has yet to recover from the Great Recession. Against that, the former top GE official has tagged himself as “Bob the Rebuilder,” which captures his corporate career of overhauling failing businesses (the reference is to the popular kids’ TV show Bob the Builder). Compared with Lamont, who promises more taxes and a revival of dreaded highway tolls and who is easily packaged as what would be the third term of the detested, retiring Democrat, Dannell Malloy, Stefanowski seems a man suited for the present crisis.The fourth is that Stefanowski is running as an unabashed fiscal conservative, relentlessly talking job growth and tax cuts (income, corporate, estate, gift) while brandishing a plan, co-authored with the economist Art Laffer, to save Connecticut.Related is the fifth point: His partner on the Republican ticket is Joe Markley, one of the nation’s most thoughtful and principled conservative legislators — National Review holds him in high regard. The lieutenant-governor candidate has cachet that inspires foot-soldiers and motivates the ranks of a viable get-out-the-vote operation.What should make Republicans nervous is the last gubernatorial race. Malloy’s 2014 reelection, on the heels of an abysmal first term, was a rematch with 2010 foe Tom Foley, an uninspiring candidate. Malloy’s slim victory can be traced to registered Republicans: Records indicate some 194,000 sat home on Election Day. Foley lost by 28,000 votes.That cannot happen in 2018. Connecticut deserves to be saved and can be. Voters need to elect Bob Stefanowski and begin the rebuilding process. And while they’re at it, they should elect a GOP-led legislature to implement the promised conservative policies that will put an end to the sad, true claim: “Connecticut: We’re No. 1 at Being No. 50.”NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}