{"id": "The 14th Amendment Does Not Mandate Birthright Citizenship\t\t\t\t\t\t\tThe 14th Amendment Does Not Mandate Birthright Citizenship\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 17\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHow D.C. Is ‘Getting Guns Off the Street’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tOn Criminal Justice, Trump Embraces the Left’s Racism Rhetoric\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump Appointee Judge Rules for CNN. Good.\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tJudge Orders White House to Return Acosta’s Press Pass\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 16\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Case for the Wage Subsidy\t\t\t\t\t\t\t\nShortly after the Constitution went into effect, the first Congress enacted a naturalization law. Lawmakers superseded this statute just five years later. Both provisions derived from the Constitution’s grant to the legislature (in Article I, Section 8) of the power “to establish an uniform Rule of Naturalization.” That grant, along with these naturalization statutes of 1790 and 1795, edifies us about the Framers’ conception of citizenship, and of the status of aliens and their children.Status questions about the children of aliens have moved to the fore in recent months. Central Americans, enticed by laws that perversely incentivize illegal immigration, have sought entry en masse at our southern border. This week, with an oncoming “caravan” of migrants galvanizing President Trump’s base on the eve of the midterm elections, these questions have stoked a heated debate — with all the shopworn smears of racism and bad faith that are now staples of American public discourse.In campaign mode, the president floated the idea of issuing an executive order that would purport to deny “birthright citizenship,” i.e., to end the policy of granting American citizenship to children born in the United States to alien parents who are not legally present here. I highlight “purport” and “policy” because the president’s opponents counter that these newborn children of illegal aliens are granted citizenship by the Constitution, specifically, by the 14th Amendment. Therefore, the argument goes, this grant of citizenship is not a mere policy but a command of the highest law of the land; it may not be reversed by an executive order, or even by a law of Congress, the branch empowered to set the terms of citizenship.That is a lot of weight to put on an amendment that had nothing to do with regulating aliens — an amendment ratified in 1868, a time when there was no federal-law concept of illegal aliens.State ResponsibilityRarely noticed in our era of the Beltway Behemoth is how sparse the Constitution is on the matter of central-government power over aliens. The naturalization clause is the beginning and the end of it. Congress was given the power to prescribe what aliens needed to do to become Americans. But there is not a word in the Constitution about law enforcement, nothing about which aliens would be allowed into the country, or on what conditions they would be permitted to stay.\nWhy is that? Because such matters were understood to be state responsibilities. The Constitution prescribes a federalist arrangement in which the states retain sovereignty. The states had control over their internal affairs. From the founding through most of the 19th century, that was understood to include deciding which non-Americans would be permitted in their territories.America was vast, unsettled, and expanding ever westward. People were needed to fill it. And in the 1800s, aliens came to do just that, first in dribs and drabs and then, beginning in the 1840s, in droves. But, as University of Massachusetts immigration scholar Vincent J. Cannato recounted in a comprehensive 2012 National Affairs essay, it was not until 1891 — at the dawn of the progressive era, after years of urging by the federal courts and some statutory fits and starts — that Congress finally asserted federal control over immigration regulation and enforcement. Indeed, Ellis Island opened in 1892, essentially as a station charged with carrying out the 1891 Immigration Act.This is a rich transitional history. I’ve described it only briefly here to make the point that the 14th Amendment was utterly unrelated to the challenge and complexities of immigration-law enforcement.14th Amendment: Taking Aim at the Vestiges of SlaveryAgain, the 14th Amendment was enacted in 1868, nearly a quarter-century before the federal government seized control of immigration regulation from the states. The driving objective of the Amendment was to shore up deficiencies of the 13th Amendment. Though it had formally abolished slavery upon its 1865 adoption, the 13th Amendment failed to prevent the states from denying black former slaves the privileges and immunities of citizenship.As University of Texas Law School professor Lino Graglia has explained, Congress attempted to address this shameful situation by enacting the Civil Rights Act of 1866. President Andrew Johnson’s veto of the measure was overridden, but it heightened uncertainty about Congress’s authority to act. The purpose of the 14th Amendment was to remove all doubt.That is the main point: The 14th Amendment was meant to ensure that the necessary relief for former slaves could not be undone by subsequent Congresses or court decisions. As we shall come to, the Supreme Court later resorted to the 14th Amendment in order to address an injustice done to an adult child of immigrants under the noxious Chinese Exclusion Act. The Court, however, was wrong to do so — certainly, to the extent that its ruling can be read (and has been read) to usurp Congress’s constitutional power to prescribe citizenship qualifications for children born in the United States of aliens who are not legally here. The 14th Amendment was about black people enslaved in America for generations. It was not about aliens transiting America illegally.In debating birthright citizenship, and assuming based on the Supreme Court’s ruling, that the 14th Amendment was intended to speak to the issue, we have focused on the first sentence of the amendment:All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the state wherein they reside. Patently, this had nothing to do with illegal aliens or their children. To repeat: There was no federal concept of “illegal alien” at the time. There would, moreover, have been no reason to amend the Constitution for the purpose of dictating the status of the children of aliens. Congress had that covered: Its Article I power to prescribe terms of citizenship for aliens had never been in dispute; as noted at the start of this essay, Congress had been exercising that power since shortly after the Constitution went into effect.The status of children of aliens was not a national issue. Unlike slavery, over which the nation nearly dissolved, it was not a subject of such nationwide concern that it could drive the Constitution’s arduous amendment process. The rest of the 14th Amendment’s first clause makes crystal clear that the amendment had nothing to do with aliens trying to settle in the country; its objective was to prohibit several of the outrages that black people, in America for over two centuries, had been made to suffer:No state shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any state deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.Let’s return to the first sentence. The word jurisdiction is, of course, critical to the amendment’s proviso that only persons “subject to the jurisdiction” of the United States become citizens if born here. Jurisdiction is a variegated term. Contrary to the insistence of birthright-citizenship proponents, it does not always and simply mean anyone who is subject to our laws (which would encompass virtually everyone who steps foot on our territory).As Professor Graglia elaborates, the principal authors of the Civil Rights Act of 1866 and the 14th Amendment — Senators Lyman Trumbull of Illinois and Jacob Howard of Ohio — elucidated the meaning of jurisdiction in those provisions. The point was to stress “complete” jurisdiction, as in “not owing allegiance to anybody else.”Why? Because Congress’s objective was to deal with a unique historical problem — the status of black people who had been in America for generations, bore allegiance to its sovereign power and the burdens of its laws, but were being denied citizenship and its attributes. This, indeed, was exactly how the Supreme Court saw the matter 18 years later when, in Elk v. Wilkins (1884), it denied birthright citizenship to the American-born adult child of members of an Indian tribe — observing that the point of the 14th Amendment was to settle the question of citizenship for black former slaves, and adopting the reasoning of Trumbull and Howard that 14th Amendment “jurisdiction” meant complete jurisdiction. The amendment was designed to bring blacks formally into the American fold without purporting to affect the status of others who were regarded as non-Americans because they actually were non-Americans — foreign diplomats and their families, Indian tribes, and aliens who had not been naturalized.To be sure, Senator Trumbull at one point conceded that the American-born children of Chinese and other legal resident aliens could be granted citizenship. As Professor Graglia observes, this was inconsistent with the trajectory of the argument, apparently driven by the political consideration that such an effect would be trivial and not worth pausing over. For our purposes, the point is that even this tangent assumed the legal immigration status of the parents.Congress’s First Naturalization LawsThat brings us back to the first naturalization acts. These congressional laws make manifest that the Framers adhered to two relevant principles: The citizenship status of newborn and minor children was derivative of the citizenship of their parents; and American citizenship for the minor children of aliens was dependent on the aliens’ having become Americans — i.e., having gone through the naturalization process, and having demonstrated good character and loyalty to the Constitution. This understanding still held at the time that the 14th Amendment was adopted — there was no need to discuss it because it was utterly uncontroversial.The first naturalization law, enacted on March 26, 1790, provided that an alien (in those days, a foreign-born “free white person”) could become a citizen after living in the U.S. for just two years, as long as he proved to the satisfaction of a court that he was of good character and then took an oath to support the Constitution. Once that was done, any of his children under 21 at the time automatically became U.S. citizens.The second naturalization law, enacted on January 29, 1795, was more elaborate, prescribing one naturalization standard for aliens who were already in the U.S. (two years’ residency), and a prospective standard (five years’ residency). For both categories, besides the required demonstration of good character and the oath of loyalty, there was added a formal renunciation of “all allegiance and fidelity to any foreign prince, potentate, state, or sovereignty whatever.” Upon completing that naturalization process, again, citizenship was deemed automatic for the minor children of the naturalized citizen.Congress tweaked the law again three years later, creating an alien registry and lengthening to 14 years the time an alien was required to reside in the United States before applying for citizenship. But the assumptions about children of aliens did not change: They derived citizenship from their parents.Wong Kim ArkThe 14th Amendment undertook neither to disturb prior law on this subject, nor wrest Congress’s Article I power to decide the status of children born to aliens while present in this country. To the extent the Supreme Court’s 1898 Wong Kim Ark decision suggested otherwise, it was wrong. And to the extent it claimed that citizenship in United States was to be determined in accordance with the duties of fealty owed by the subjects of the British Crown — from whom the free people of this nation, refusing to be subjects, had broken away — its ruling was wayward.To give the Court its due, it was operating in a different environment: By 1898, the federal government had assumed control of immigration regulation, and there was a federal concept of illegal alien — foreigners who were present or sought entry in contravention of Congress’s laws. And the Court may well have been offended by the unabashed racism of the aforementioned Chinese Exclusion Act of 1882. It was under this Act that 21-year-old Wong Kim Ark was denied re-entry into the United States, after a trip to China, despite having grown up in the U.S. — born to a married couple of Chinese immigrants who were lawful permanent residents at the time.All that said, though, it was for Congress by targeted legislation, not for the Court by resort to an amendment related to the status of black former slaves, to decide the status of children born in the United States to non-American parents. And even if we agree, arguendo, that the Court was right when it came to a child born in the U.S. of alien parents who were lawful settlers in our country, this would not redound to the benefit of a child born here of aliens whose presence violates our laws — who have never sought legal status or naturalization, who have never taken an oath of loyalty to our Constitution, and who have never renounced ties to foreign sovereigns. In its reliance on British common law, the Wong Kim Ark Court itself said the Crown took on as subjects the children of “aliens in amity” — i.e., aliens whose presence in the realm was not hostile or an affront to the Crown’s laws.Not Exceptions, Examples of the RuleLet’s put aside the American-born children of non-citizen members of Indian tribes, for they were granted citizenship by an act of Congress in 1924. And that, as we’ve seen, was only after Elk v. Wilkins, in which the Supreme Court reasoned that the 14th Amendment did not make them U.S. citizens because they were not “subject to the jurisdiction” of the United States in the sense of “complete,” “direct and immediate allegiance.”The defenders of birthright citizenship have the equation backwards. Relying on Wong Kim Ark, they claim that all children born of aliens on U.S. soil, regardless of the aliens’ status, are citizens unless they fall into two well-established exceptions: the children of foreign diplomats, and the children of a foreign invading force.To the contrary, these categories are not exceptions to an otherwise obvious claim to birthright citizenship. They are the patent operation of venerable rules: The citizenship of the child derives from the citizenship of the parent; and American citizenship hinges on the parents’ being subject to the jurisdiction of the United States, in the sense of lawfully aspiring to citizenship, demonstrating loyalty to the United States and our Constitution, and obeying the laws.Looked at that way, the newborn children of illegal aliens are more analogous to the children of a foreign invading force than to Wong Kim Ark. The former are children of parents who lack immigration status and whose presence defies our laws; the latter was the child of lawful-permanent-resident aliens (the category of aliens now considered “U.S. persons” under our law, nearly indistinguishable from citizens).The 14th Amendment did not extend citizenship to the newborn children of illegal aliens. Our law has never done this, though we have been operating for decades as if it had. That includes operating for decades under Congress’s Immigration and Nationality Act of 1952 and its progeny, through which the 14th Amendment was codified, presumably edified by Congress’s understanding of Wong Kim Ark. (See Section 1401(a) of the immigration laws.)Whether we continue in this vein is for the Article I branch to decide. I do not believe President Trump may reverse by executive order a practice that has ensued for decades pursuant, at least ostensibly, to statutes enacted by the branch of government constitutionally empowered to prescribe qualifications for citizenship. (My friend Hans von Spakovsky makes a strong argument that the president does have this power.) But as for Congress itself, neither the 14th Amendment nor the Supreme Court’s jurisprudence prevent it from adopting a sensible policy that does not create perverse incentives to immigrate illegally and violate our laws.That policy is simply this: Children born in the United States should be deemed Americans only if their parents are U.S. persons — that is, either U.S. citizens or lawful-permanent-resident aliens.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}