{"id": "The Worst of the Worst\t\t\t\t\t\t\tThe Worst of the Worst\t\t\t\t\t", "paragraph": "National ReviewI looked up Luis Bracamonte, who is featured in the Trump ad that Robert mentioned. His case doesn’t implicate Democrats in particular the way the video says. But he is the worst of the worst, a vicious and unrepentant killer. He’s also a horrifying example of the utter failure of our system the last couple of decades. The New York Times set it out at the time of his killing spree:The suspect led the authorities on a manhunt through two counties. After he was booked into the Sacramento County jail, federal immigration authorities used his fingerprints to identify the man, who gave his name as Marcelo Marquez: They said he was Luis Enrique Monroy Bracamonte, a Mexican who lived without papers in this country for more than a decade after he was deported in 1997 and again in 2001 because of drug- and weapon-related arrests….Emerging details of the suspect’s history — he gave his second last name in court in Sacramento on Tuesday as Bracamontes, not Bracamonte — show that he crossed the southwest border at least twice in a wave of illegal immigration more than a decade ago, then used several aliases and stayed out of trouble just enough to elude detection as the Obama administration ramped up deportations in recent years and expanded systems to identify foreigners who committed crimes….Immigration and Customs Enforcement officials said Mr. Monroy Bracamontes was deported for the first time in 1997 after he was convicted in Arizona of narcotics dealing. He was arrested again in Arizona in May 2001 on drug and weapons charges, but those were dismissed, and that month he was deported for a second time….Sometime after his second deportation, Mr. Monroy Bracamontes returned to the United States and moved with his wife from Arizona to Utah, where officials said he lived at least until last year. To judge from Utah court records for Marcelo Marquez, he was an exceptionally bad driver, with 10 misdemeanor violations from 2003 to 2009.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}