{"id": "Kat Timpf Chased Out of Brooklyn Bar\t\t\t\t\t\t\tKat Timpf Chased Out of Brooklyn Bar\t\t\t\t\t", "paragraph": "National ReviewFox News personality and National Review contributor Kat Timpf was forced to leave a bar in Brooklyn over the weekend after a woman she had never met became enraged upon learning she worked in conservative media.Timpf, who has twice previously been harassed while socializing in New York City, first described the incident in a Friday night tweet and later expanded on her initial description of the confrontation during a Monday interview with National Review.I was just ran out of an establishment because of where I work. Chewed out, abused. But I guess that’s the norm now.— Kat Timpf (@KatTimpf) November 11, 2018After arriving at the bar, Timpf became separated from her friends and found herself in conversation with a man she didn’t know, who inquired about her occupation. Timpf explained that she worked at Fox News and the conversation proceeded unremarkably. A while later, Timpf was confronted by a woman, who, after hearing she worked at Fox News, became enraged and began shouting at her in a threatening manner.“This girl started going nuts on me, screaming at me to get out of the bar. I found her very threatening,” Timpf said of the woman, whom she had never met before. She said she tried to move to another section of the large bar but the young woman followed her while continuing to scream.The woman, who was visibly intoxicated at the time, was surrounded by a large group of men and women who all stood by and laughed as she harassed Timpf and followed her around the bar. After realizing no one in the group would defend her in what might become a violent situation, Timpf was forced to flee the bar.NR's afternoon roundup of the day's best commentary & must-read analysis.“It was super uncomfortable and I didn’t want things to get physical,” she said.It’s not the first instance of politically motivated harassment Timpf has dealt with while out in Brooklyn. Last year, an unidentified man dumped a bottle of water on her head while she was preparing to speak at a local campaign event, and she was again harassed while eating at a Manhattan restaurant several months ago.“This is the third time this has happened to me, so I’m just over it,” she said, adding that she has no plans to limit her public exposure despite the hostility.“There have been times where I’m hesitant to go out with my glasses because it makes me more recognizable. But I have to live my life, I can’t let this ruin it,” she said.While high-profile conservatives like Tucker Carlson and Senator Ted Cruz of Texas have encountered a surge in premeditated public harassment of late, Timpf said she is perplexed as to why she would be targeted, considering she doesn’t fall neatly into any political identity.“I’m not on the left or right so I don’t really understand this,” she said, adding that the individuals who target her never take issue with any of her expressed opinions, but rather are reacting to her professional affiliations.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}