{"id": "Betsy DeVos Strikes a Blow for the Constitution\t\t\t\t\t\t\tBetsy DeVos Strikes a Blow for the Constitution\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Case for the Wage Subsidy\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tMaking Acosta a Federal Case\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAgainst the ‘Coercive Elimination of Dissent’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump’s Not Populist Enough\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tRick Scott’s Lead Increases after Recount\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPelosi Vows She’ll Be Speaker Despite New Potential Challenger\t\t\t\t\t\t\t\nThe Department of Education has issued its long-awaited proposed regulations reforming sexual-assault adjudications on college campus. Not only will these rules restore basic due process and fairness to college tribunals, but they also — given how basic the changes are — highlight just how ridiculous university kangaroo courts have become.First and perhaps most important, the rules will not only require colleges to permit cross-examination of witnesses (including the accuser), but will also prohibit universities from relying on the statements of any witness who refuses to submit to cross-examination.Cross-examination is so fundamental to adversary proceedings that it’s is simply incredible that some universities have been prosecuting and expelling students without permitting the accused’s representative to question his accuser. Prohibiting cross-examination irrevocably stacks the deck against the accused. The Supreme Court has rightly called cross-examination “the greatest legal engine ever invented for discovery of the truth.”But you don’t have to trust SCOTUS; the importance of cross-examination is among the most ancient of legal principles. Consider Proverbs 18:17: “In a lawsuit the first to speak seems right, until someone comes forward to cross-examine.”Interestingly, however, the proposed rules prohibit the accused himself from cross-examining the accuser — instead requiring that questioning come from an “advisor.” While some complain this limits the rights of the accused, as a practical matter advisers (attorneys, for example) are far better equipped to cross-examine witnesses than are undergraduates or young graduate students.In addition to mandating cross-examination, the proposed rules grant both parties “equal opportunity to inspect and review evidence obtained as part of the investigation that is directly related to the allegations raised in a formal complaint.”\nI know what you’re thinking. “Wait. Not only did some schools deny cross-examination, but they also denied the accused access to the relevant evidence in his case, including exculpatory evidence?” Yes, they did deny access to evidence. It wasn’t uncommon for accused students to walk into hearings with only a cursory understanding of the charges against them and partial access to evidence, and then have to respond — on the fly — without access to any legal help.Yes, the kangaroo courts could be that bad.But that’s not all. While the proposed rules permit schools to retain the “preponderance of the evidence” standard (as opposed to higher standards such as “clear and convincing evidence”), they do not permit university procedures to disfavor students. Universities are “required to apply the same standard of evidence for complaints against students as they do for complaints against employees, including faculty.” This provision inhibits powerful campus constituencies from negotiating more favorable deals on due process.The rules also dispense with the single investigator/adjudicator model that allowed universities to place a single person in the position of investigator, prosecutor, and adjudicator. There were no safeguards against bias. Again, this requirement is so basic that it’s simply stunning that it has to be articulated.In a crucial change, the proposed rules protect the First Amendment by significantly tightening the definition of some forms of sexual misconduct. As Reason’s Robby Soave explains, “Under the previous system, administrators were obliged to investigate any unwanted conduct of a sexual nature, which is a fairly wide swath of behavior. Some officials even interpreted this to include mundane speech that happened to involve gender or sex.”The new proposed rules, by contrast, apply controlling language from the Supreme Court to define sexual harassment as sexual assault, quid pro quo harassment, and “unwelcome conduct on the basis of sex that is so severe, pervasive, and objectively offensive that it effectively denies a person equal access to the recipient’s education program or activity.”Through this change, the DOE finally conforms its harassment definition to the language of Davis v. Monroe County Board of Education, a case that defined the standard for peer-on-peer hostile-environment sexual harassment. The Davis standard serves the purpose of protecting students from true harassment and protecting students from arbitrary, truly subjective claims of offense.The new regulations aren’t perfect, of course. I still have the pipe dream of reserving adjudication of crimes and other unlawful acts to actual criminal and civil courts. But that was never likely to happen. Also, the proposed rules permit both the accuser and the accused to appeal adverse decisions. Permitting the accuser to appeal creates a form of double jeopardy that would not be permitted in criminal cases, but this is more of a nitpick. After all, the accuser (plaintiff) can appeal in civil-court cases, so it’s difficult to argue that permitting such appeals presents constitutional problems.What is stunning, however, is the reaction of some on the legal left to the proposed changes. The ACLU said this:It promotes an unfair process, inappropriately favoring the accused and letting schools ignore their responsibility under Title IX to respond promptly and fairly to complaints of sexual violence.— ACLU (@ACLU) November 16, 2018And this:We will continue to support survivors.— ACLU (@ACLU) November 16, 2018When I read those tweets, there was a disturbance in the legal Force, as if the voices of generations of ACLU civil libertarians cried out in anguish and were suddenly silenced by wokeness. The old-school ACLU knew there was no contradiction between defending due process and “supporting survivors.” Indeed, it was through healthy processes that we not only determined whether a person had been victimized, but also prevented the accused from becoming a “survivor” of a profound injustice.I hate to use arguments that sound remotely like “arc of history” determinism, but the college procedures DeVos is abolishing were so manifestly unfair and prone to grotesque abuse that they were not sustainable. Courts by the dozens — and judges from across the ideological spectrum — were ruling against universities, sometimes with the strongest of words. If the Department of Education didn’t make systematic changes, courts were going to force its hand — case by agonizing case.In short, Betsy DeVos did what she had to do. And she did it well. Today is a good day for due process. It’s a good day for the First Amendment. And it’s a good day for college students across the land.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}