{"id": "Musician Convicted for Trafficking Marijuana in Mississippi\t\t\t\t\t\t\tMusician Convicted for Trafficking Marijuana in Mississippi\t\t\t\t\t", "paragraph": "National ReviewPatrick Beadle, a Jamaican-born musician living in Oregon, has been sentenced to eight years in prison for drug trafficking in Mississippi, where he was arrested with just under three pounds of marijuana, which he says was for personal use.Some of the reactions to this case have been strange: “How can that be? He bought the weed legally in Oregon.”Well: Buy marijuana legally in Oregon, drive to Mississippi, get arrested, go to jail.Comparable case: Buy a semiautomatic rifle in Texas, drive to California, get arrested, go to jail.The states have different laws, as it turns out.Beadle may not have been entirely legal in Oregon, either. Unless I am misreading the regulations, he had almost three times the maximum allowed amount for personal use.NR's afternoon roundup of the day's best commentary & must-read analysis.Marijuana should be legal across all 50 states. But it isn’t.The states are not administrative subdivisions of the federal government; they are polities in their own right, with their own laws — which, like those of the federal government, often are misguided.The trafficking charge seems unnecessarily harsh; it seems to have been based on the amount of marijuana and on the fact that police say it was concealed in the car. The defense pointed out that there were no scales or other paraphernalia associated with drug distribution, no large sum of cash, etc. The trafficking charge carries a ten- to 40-year sentence; the judge imposed the relatively light eight-year sentence but could not reduce the charge to mere possession, because Beadle was convicted under the more serious trafficking statute. It may be that the prosecution overdid things in this case, but the jury didn’t see it that way.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}