{"id": "The European Fine Art Fair: The Sublime and the Silly\t\t\t\t\t\t\tThe European Fine Art Fair: The Sublime and the Silly\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBelieve in Creed II \n\n\n\t\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Lessons of the Asia Bibi Case\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAgainst the ‘Coercive Elimination of Dissent’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\nThe European Fine Art Fair, or TEFAF, is the American version of the epic art fair occurring each spring in Maastrict in Belgium. At the Armory in New York, it’s in its third year. After two long visits last weekend, I thought the fair wasn’t a case of the good, the bad, and the ugly, but, rather, the sublime, the clunkers, and the bewildering.TEFAF as a brand offers authenticity, transparency, and a match of the best art, distinguished dealers, and the richest, savviest buyers. Objects are rigorously vetted by curators, so there are no fakes. Duds? Well, that’s another story. First, the high points.Wildenstein & Co. is among the most revered art dealers in the world, and it did not disappoint. Its impeccably designed booth showed many star works but none so dazzling as Charles Le Brun’s Dream of St. Joseph, from the early 1650s. This picture has everything we want in a high-end art fair. In his time, Le Brun was France’s best painter of religious, historical, and mythological subjects, so we have a great name. There’s the gold standard of provenance in Anne of Austria, the widow of Louis XIII and mother of the Sun King, Louis XIV. She commissioned the picture for the Carmelite convent oratory where she prayed. We have rarity. Of the six paintings she commissioned for the space, this is the only one that survived the spoliation of church art during the French Revolution. It’s gorgeous, with lovely, subtle colors and a lilting composition. If you’re an ardent Catholic, it’s dogmatically precise. I liked its combination of wall power and soothing presence. Some Baroque angels have all the delicacy of a space shuttle on reentry, but this one glides with nary a rattle. It’s a dream scene, after all. And the picture is new to the market. At $5 million, to say something utterly irreligious, it’s a steal.Thomas Colville, another old-fashioned dealer and connoisseur, offered Theodore Rousseau’s Soleil Couchant sur les sables de Sainte-Jean-de-Paris, from the mid 1860s. It’s a fresh-to-the-market painting in pristine condition by an artist just at the edge of the Impressionism revolution. He painted scenes that were mundane — no spectacular, awe-inspiring views — and moody at the same time. Colville’s is what I call a hot landscape, with lots of pink and yellow enlivening rock, scrub, moss, and gnarly trees. Rousseau painted an earlier, bigger version on a used canvas. He’d done a landscape on it already and simply painted over it. The underpaint started to bleed through the new paint, so he did a fresh version, which is for sale for $325,000.I like dealer booths that focus on a single artist because they become a small retrospective. Bernard Goldberg, a distinguished American art dealer, focused on the enigmatic, easily spotted, never boring Charles Burchfield. His display aptly shows how important dealers are in advancing connoisseurship. With about 15 good Burchfields, I could see his evolution as an artist. Dealers, in fact, often do a better job at connoisseurship than curators and certainly better than academics. Moonlight in a Flower Garden from 1961 is a late, big watercolor and a quivering, evocative fantasy. It’s $1,350,000, which first struck me as expensive, but it’s a fine picture that has made it into all the best Burchfield shows.\nRonald Phillips was also focused. His booth celebrated the designer Thomas Chippendale, whose 300th birthday is this year. An impressive mahogany armchair from 1765, at $335,000, deserved its place of pride. It’s a masterpiece of English rococo, with a touch of whimsy. It’s regal enough to command that you sit like an aristocrat. It was part of a set commissioned by William Plumber for his Gilston Park home and now split among the Met, the Victoria & Albert, and private collections. Its brother and sister chairs have done well in finding their way to distinguished homes, which makes this chair more appealing in the marketplace.S. J. Shrubsole, another distinguished dealer, carries the banner for the best antique English silver. Many silver dealers, among them S. J. Phillips, Shrubsole’s London counterpart, have largely abandoned old silver for the more lucrative jewelry market, and this is sad. Great English silver from the 18th and 19th centuries is, to me, sculpture, with moments of technical brilliance and dynamic allure. Today, it’s very much a niche market, though I think every cultivated home should have something like a pair of magnificent, massive silver Ambassadorial baskets by Thomas Heming, the royal goldsmith during the early years of George III’s reign. Made in 1763, they belonged to the second earl of Buckinghamshire while he was British envoy to Russia, hence the royal coat of arms. The royal goldsmith’s wares are rarely cutting-edge but, rather, elegant and conservative. The two baskets are elaborately pierced in rococo style but a bit subdued, having no asymmetrical dips and swirls. This would have made it seem too French, which, to English eyes, meant effete and silly. They’re $250,000 for the pair. Two gilt replicas are in the Royal Collection.There were many other high points, but I had to look for them. Now, the duds. The two opening booths when visitors entered the hall belonged to Richard Green and Agnew, two great London dealers. Richard Green played it safe, with big Impressionist names such as Renoir and Pissarro at their second-rate best. It’s hard for the great Impressionist Alfred Sisley to bore, but Le Loing au dessous du Pont de Moret, from 1892, is the blandest Sisley I’ve ever seen. It’s too expensive at $5.25 million because it’s so unremarkable, aside from its brand, big size, and, I admit, beautiful condition.Agnew’s tiny Pissarro of a Paris street scene from 1897 isn’t exactly early dementia, but it’s a cautious thing and didn’t deserve its front-of-the-shop placement next to an equally dull picture by Cézanne. It’s been in the same private collection since 1950, and it’s pristine, but it’s not important at all, in Pissarro’s career or in the genre of French cityscapes. It’s $3.4 million.I look to both dealers to give great quality with great names, as Wildenstein, Colville, and others did. I think the dealers would say, “It’s the customer’s fault,” and they wouldn’t be entirely wrong. Every great dealer has stories about rich collectors who enter the gallery, adviser at tow, saying, “I have 15 minutes . . . the car’s outside with the motor running,” meaning, “show me your biggest names because I don’t have time to think too deeply.” I’m sure this happens more often than ever now, but the great dealers are much more than car salesmen. They’re as passionate about art as the best collectors, know their art, and most have a near-religious calling.Too many dealers instead used big names as a prop, and I think today’s collectors are, as a whole, more adventurous. They’ve certainly never been richer, which makes the discriminating ones more inclined to take leaps of faith on artists such as Magnasco, Mengs, Simeon Solomon, or L. S. Lowry, not marquee names but represented with stellar work by dealers who are solid but not known powerhouses. I saw an itsy-bitsy painting of a Spanish cleric by the 14-year-old Pablo Picasso. The object was presented like a movie star at Jaime Eguiguren’s booth. It’s juvenilia. I didn’t ask the price. I didn’t want to know. I’d seen enough overpriced, mediocre grown-up Picasso at that point. And too many dealers were selling antique jewelry, which, to me, belonged not at TEFAF but in a jewelry store.And then the Italians. There were lots of Italian dealers who, I think, were exploring the American market. I thought the Madonna and Child, presented by Frascione Arte and attributed to the Master of the Scandicci Lamentation, from around 1510, was beautiful. We don’t know the artist’s name, but it’s Florentine classicism with shades of Raphael, Ghirlandaio, and Filippino Lippi, plus a distinctive, eccentric edge. It belonged to Pope Urban VIII and a succession of Barberini cardinals before landing around 1900 in a British collection. It’s a mystery, in perfect condition, and, at $900,000, fairly priced. It’s a quirky thing and risky, too. Art historians are still developing a settled take on the artist.Decidedly carnal is a pair of Italian ladies I kept visiting, trying to puzzle them out, and deciding finally that the aesthetic was, well, different. Not bad. Just different. The Italian dealer Alberto di Castro’s Female Nudes, from around 1880, by an unknown Roman painter did grow on me. At first, I thought it was tacky gaudy gangster chic — the fair had a good helping of it — but it’s beautifully painted and made me think of Anna Magnani, known as “La Lupa,” the she-wolf, but in this picture definitely on steroids. I can’t pin a style on it: Decadent Romanticism meets proto-neo-realism, maybe. One figure is big, bold, and brassy, the other nude frozen still, a bit bony, and shielding her eyes, a contrast that suggests a narrative, indeed demands one. It makes a statement, was the anti-safe-and-boring Impressionist brand, and, at $80,000, was the least expensive thing I saw. “They both need a lotta love,” was all I could think. I hope they find a good home. NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}