{"id": "‘Semblance of Truth,’ the Church’s Standard of Evidence in Sex-Abuse Cases\t\t\t\t\t\t\t‘Semblance of Truth,’ the Church’s Standard of Evidence in Sex-Abuse Cases\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBelieve in Creed II \n\n\n\t\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Lessons of the Asia Bibi Case\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAgainst the ‘Coercive Elimination of Dissent’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\nMost people who allege that they were sexually abused by Catholic priests are telling the truth. The record that has accrued over decades of investigation by the Church itself is clear on that point, though only if you accept an evidentiary standard that’s too low for most cases to result in conviction or make it to trial at all in a criminal or even civil court. So what does William McSwain hope to accomplish?McSwain, the U.S. attorney for the Eastern District of Pennsylvania, last month asked the U.S. bishops to preserve their files on sex-abuse complaints. On the same day, October 9, he sent to each of Pennsylvania’s eight dioceses a subpoena for any records that might shed light on alleged sexual abuse by clergy or on efforts by diocesan officials to cover it up.He seeks records dating back only to 2001, even though the great bulk of cases for which the Church is still under the spotlight relate to sexual misconduct that is alleged to have occurred well before then, mostly in the 1960s through the 1980s. Moreover, for federal prosecution of the sexual abuse of anyone under 18, no statute of limitations applies during the victim’s lifetime. Why then did McSwain not subpoena relevant records from the 20th century as well?No doubt he realizes better than most of us do that earlier cases would be hard to prosecute. The likelihood of discovering evidence to corroborate a victim’s testimony diminishes with time.Frederick Thieman, a veteran of the board that reviews abuse cases for the Diocese of Pittsburgh, is a former U.S. attorney for the Western District of Pennsylvania. “I doubt a lot of cases would have made it into the courtroom,” he told a reporter for the newspaper of the Pittsburgh diocese in September, referring to the grand-jury report (July 2018) on sexual abuse in six of Pennsylvania’s Catholic dioceses. “Certainly not a criminal court. Quite likely not even a civil court.”The standard of evidence in a criminal case would be “proof beyond a reasonable doubt.” In a civil case, the claimant would have to show a “preponderance of evidence” against the accused. On diocesan review boards, however, members are satisfied with “semblance of truth,” which the U.S. Conference of Catholic Bishops defines as meaning that an allegation “is not manifestly false or frivolous.” It’s a lower standard than what prosecutors would need to meet in a court of law. Thieman elaborated on his experience with the review board in Pittsburgh:The priests had dedicated a lifetime to ministry and almost always denied the accusations. . . . We struggled to make sure we believed that there was credibility to the allegation. In the vast majority of cases we did find that there was credibility. . . .The cases were extremely difficult in the sense that there were oftentimes complicated factual situations. Cases were often many years old and people’s memories were understandably not as precise as they might have been.\nThe effort was made to get to the truth and not be a court of law. So the standards for evidence that we applied were relatively loose. . . . Evidence [hearsay, for example, and hearsay on hearsay] that would not have been permitted or may not have been permitted in a court of law was permitted into the review.“It was personally embarrassing for a lot of these victims” to testify, Thieman added. Their accounts were “sad, sometimes tragic, and very troubling.”From 1987 to 1995, Patrick J. Schiltz, now a federal judge, represented Catholic dioceses and non-Catholic churches in more than 500 lawsuits involving accusations of sexual abuse by clergy. Writing in Commonweal in 2003, Schiltz corroborated some of Thieman’s observations:I have spent hundreds of hours talking with victims of clergy sexual abuse — some who were suing my clients, some who were helping my clients to rid themselves of abusive pastors, and some who just wanted to help me to advise my clients better. Listening to victims describe their pain can be unbearable. I cannot imagine how much worse it must be to experience that pain. I take a back seat to no one in my loathing of clergy sexual abuse.Fewer than ten of those cases in which he served as a defense attorney for the accused were based on false accusations, Schiltz has estimated. That’s less than 2 percent and consistent with the findings of the first John Jay report (2004), commissioned by the U.S. Conference of Catholic Bishops.Often accusations that are credible even in the opinion of legal experts such as Schiltz and Thieman are not actionable, however, for three reasons:• The statute of limitations has kicked in. (It often does, as victims tend to be slow to come forward.)• Or the evidence that the victim can produce doesn’t suffice — in his capacity as a layman concerned for the Church, a lawyer might find an accusation credible and damning but still conclude that he would be unable to prosecute the case successfully in court.• Finally, many cases don’t meet the legal definition of sexual abuse, sometimes because the victim has attained (if only barely) the age of consent. In many cases the offense would be more accurately described as sexual misconduct — e.g., inappropriate touching or seductive sexual advances — for which we would want a bishop to discipline or sideline priests even though they broke no civil or criminal law.We should bear these complications in mind when distributing our indignation among accusers and accused. In the case of allegations against men who are not Catholic priests, we may be quick to chastise an accuser who comes forward without corroborating evidence. The nature of sexual offenses, though, is such that often the only evidence that anyone could ever produce is the victim’s testimony, as I came to appreciate better in the course of researching the Church scandals.Today, Catholic bishops and laypeople as well as the general public are more inclined than they were decades ago to believe someone who says he was sexually abused by a priest. Our wrath at the priests themselves needs no explanation. Our wrath at the bishops? It’s not always fair. Many did appear less concerned to prevent abuse than to hide it. But others may have only been exercising what they considered a healthy and necessary skepticism — too much skepticism, we now think, but most of us were more skeptical about such accusations back then.Schiltz criticized media for distorting the Church scandals in two respects. That was 15 years ago, but his objections still apply today. First, he noted, casual consumers of the news were prone to assume that a spike in reporting on sexual abuse in the Church meant that the problem was raging at the moment — reporters and editors failed to convey adequately the historical nature of their revelations. Then, in reporting that a bishop neglected to contact law enforcement or remove accused priests from ministry, the press left the impression that he was derelict, although in most cases he had sought and followed expert advice, which often consisted of reassurances that an offending priest would not repeat if he was put on the disabled list and sent away for psychological treatment for a few weeks. That counsel was later discredited but at the time was consistent with what were considered best practices. “In most cases in which a bishop decided to permit a priest accused of abuse to remain in ministry, the bishop was relying on the advice of a psychologist,” Schiltz explained.That psychologist told the bishop either that the priest likely did not commit abuse or that, although the priest did commit abuse, his problem was now under control.On countless occasions, psychologists gave bishops terrible advice about abusive priests — and, of course, this bad advice led to terrible consequences for victims and the broader church. . . .Suppose you have a cough. You go to your doctor, and the doctor tells you that you have nothing to worry about. Later, you learn that you have throat cancer, and you should have been receiving chemotherapy all along. In this situation, we would be angry with the doctor, not with you. After all, the doctor is the expert, and you can hardly be blamed for relying on what the expert told you.Bishops, too, often consulted experts — sometimes the most respected and experienced experts in the nation. Bishops, too, were often told that they had nothing to worry about. Bishops, too, relied on that advice to their detriment. Yet the media have consistently blamed bishops for following bad advice, rather than the experts for giving the bad advice.Against that background, the outrage over Pope Francis’s handling of the scandals in their various eruptions during his pontificate strikes me as exaggerated, based either on too little information about the historical picture or on willful blindness to the changed and changing attitudes of Catholics, churchmen and laypeople alike, toward accusations of sexual abuse by priests. Jorge Mario Bergoglio was ordained in 1969 and, as many of his critics are quick to note, appears to live in that era still, at least much of the time. As archbishop of Buenos Aires, he declined to meet with survivors and missed a Vatican deadline for drawing up plans to prevent further abuse, dragging his feet on the issue when the rest of the Church had begun moving forward.Francis’s handling of the scandals in Chile the past few years illustrates the problem of elderly bishops and cardinals who are stuck in, or reflexively revert to, what was the common wisdom when they were assuming positions of authority in the Church in the second half of the 20th century. In 2015, Francis appointed Juan de la Cruz Barros Madrid bishop of Osorno, Chile. Barros was a close associate of Fernando Karadima, a notorious priest whom the Vatican had sent into retirement in 2011 after concluding from an internal investigation that he had sexually abused minors. Barros was a protégé of Karadima’s and widely regarded as his ally.Members of Chile’s legislature, most of them from the Socialist party, signed a petition against Barros’s appointment, and protesters descended on his ordination ceremony, embarrassing the Church. Later that year in Rome, Francis told Jaime Coiro, a spokesman for the Chilean bishops’ conference, that the Church in Chile had “lost its head” and that politicians had judged Barros “with no proof whatsoever.”“Think with the head,” Francis said to Coiro. “Don’t be led around by the nose by these leftists.”That was three years ago. Francis sounded the same note when asked about Barros last January in northern Chile. “The day someone brings me proof against Bishop Barros, then I will talk,” he snapped. “But there is not one single piece of evidence. It is all slander. Is that clear?”On the plane back to Rome, Francis attempted an apology to abuse victims but ended up implying that their testimony didn’t qualify as evidence. “Someone who accuses insistently without evidence, this is calumny,” he said, reiterating his belief in Barros’s innocence.For Francis’s critics, the offense underlying his appointment of Barros was the conduct of Karadima, the priest whom the bishop was accused of having protected. In 2010, Karadima had been tried in a Chilean court of law. It dismissed his case after seven months, concluding that the evidence against him was insufficient. The Vatican found evidence sufficient for defrocking him, however, after conducting its own investigation the following year. Although Francis never gainsaid the investigation’s finding, his subsequent behavior in the Barros matter demonstrates the degree to which his instinct is closer to that of civil authorities today and of bishops and Vatican officials generations ago — to insist on higher standards of evidence than most people, the Church’s friends as well as its critics, now consider appropriate in such cases.The sustained uproar over the Barros appointment led eventually to another investigation by the Vatican. Its report was never published, but in media accounts it was characterized as implicating pretty much Chile’s entire episcopate. In April of this year, Francis publicly apologized for being so slow to believe the victims. Soon afterward all the Chilean bishops submitted their resignations.Our hunger for justice may lead us to cheer the news that the scandals here in the United States are now being investigated by the feds in the office of William McSwain, the U.S. attorney in Philadelphia, and by state attorneys general from coast to coast, but their effectiveness is limited — we want it to be. We want the justice system to observe high evidentiary standards, statutes of limitations, and the strictest definitions of the criminality that can be prosecuted.We want our courts of law to follow the principle that it is better that ten guilty men escape than that one innocent man suffer. But that’s no guidance for the Church, which must face an innocent man who already suffers and whose number is multiplied by thousands. Can the Church honor their grievances without risking the defamation of an innocent priest? No. Should the Church take that risk? Many would say that it’s morally obligated to do so.What the American justice system can deliver to the Church at this point is primarily a message: that the wider world takes the sex-abuse scandals with utmost seriousness, although the Church got that message quite some time ago. The institution of procedures stipulated in the Dallas charter (2002) means that any new complaint filed with a diocese now goes straight to law enforcement, which almost always reports back that it can’t pursue the case, either because a statute of limitations has gone into effect or because not enough evidence could be found to prove or disprove the accusation. The case then goes to the diocesan review board, whose deliberations are informed by lawyers, private investigators, and other experts. Its final recommendation to the bishop may — of necessity, if corroborating evidence is scant — be based largely on its assessment of the accuser’s credibility.You would not be wrong to worry that it could be unfair to the accused, but then watch a few minutes of this panel discussion among four survivors of clerical sex abuse in Pennsylvania. What is the Church supposed to tell them? Pictures or it didn’t happen?A longtime friend who’s well informed on the Church scandals — I reached out to him for his insight while writing this piece — just told me that he was abused by a member of a religious order many years ago, shortly after his 18th birthday. The older man had been grooming him for months. My friend was blessed, and cursed, with a kind of holy innocence. It prevented him from recognizing the danger before it was too late. For years afterward, he wondered what was wrong with him that he had let himself walk into such a situation. Then stories similar to his began to show up in the news, and finally he put the concept of sexual abuse to his own experience. Eventually he reported it to Church authorities, asking for no compensation, only the hope that his coming forward would make the wrong he suffered a little less likely to be repeated on others. He later served on a review board.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}