{"id": "The Legacy of Fake Hate Crimes\t\t\t\t\t\t\tThe Legacy of Fake Hate Crimes\t\t\t\t\t", "paragraph": "National ReviewIt is a symptom of the times in which we live that, reading about the spate of attempted bombings targeting prominent Democrats and their media allies, my first thought was of a church organist.You may remember the case: After the 2016 presidential election, there were many reports of hate crimes, the general idea being that these were the work of Trump enthusiasts and those inspired by Trump’s electoral victory. The words “HEIL TRUMP” were painted on an Episcopal church in Bean Blossom, Ind. Tongues were clucked, tuts were tutted, and the culprit turned out to be the church’s liberal staff organist, David Stang. “Stang stated that he wanted to mobilize a movement after being disappointed in and fearful of the outcome of the national election,” said Theodore Adams, a local prosecutor.Raising awareness — it is a dangerous business.Fake hate crimes have become so common on college campuses and among young progressives that every time I read about a racist note being sent to a lefty student or somebody getting assaulted over Brexit politics on the mean streets of Ann Arbor, I assume it’s a hoax. And, as it turns out, that’s often been the case in the past several years. And it’s always about raising awareness — dishonesty in the service of truth. After a fake anti-Muslim hate crime at Indiana State University, Assistant Professor Azhar Hussain was arrested and charged with obstruction of justice and harassment. According to the local police chief: “It is our belief Hussain was trying to gain sympathy by becoming a victim of anti-Muslim threats which he had created himself.”NR's afternoon roundup of the day's best commentary & must-read analysis.Jonah has been all over “lying for justice” for years. And it’s important that we confront — and remember — those lies. People trying to derail Brett Kavanaugh’s nomination to the Supreme Court claimed he was a serial gang rapist, a pure fabrication and an obvious one. When David French began to question the story, he was ridiculed and dismissed by Bill Weir of CNN, Matthew Dowd of ABC News, Josh Moon of the Alabama Political Reporter, and others, none of whom is looking too smart in retrospect. Our environmentalist friends defend to this day Stephen Schneider’s insistence that scientists must “decide what the right balance is between being effective and being honest” when working to “capture the public’s imagination” and recruit them to the cause of combatting climate change. (Schneider and others insist the quote was “taken out of context.” See for yourself whether that is convincing.)Lena Dunham fabricated a story about being raped by a campus Republican at Oberlin in order to make a political and cultural point; Rolling Stone published a fabricated story about a rape at the University of Virginia, one concocted to touch the same cultural buttons. This sort of thing appeals to progressives because their strategy is not to debate but to discredit. Dianne Feinstein is not going to win a debate with Brett Kavanaugh on constitutional interpretation — the Left had far better chances trying to smear him as a habitual gang rapist.I have no idea who is behind these pipe bombs. I assume it’s somebody who hates Democrats and CNN for the same reason seeing hoof prints makes me think there’s a horse around, rather than a zebra. But there are zebras in the world.The legacy of all these fake hate crimes and sexual assaults is that it is no longer unfair or unreasonable to consider the possibility of a hoax when reading about incidents such as these. “Lying for justice” has corroded and debased our public discourse, and that’s done more damage than these pipe bombs did, whoever sent them.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}