{"id": "Princeton Warns Students against Halloween Costumes That ‘Make Fun of a Group of People’\t\t\t\t\t\t\tPrinceton Warns Students against Halloween Costumes That ‘Make Fun of a Group of People’\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBelieve in Creed II \n\n\n\t\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTERF Wars\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\t‘The Process of Living’\t\t\t\t\t\t\t\nPrinceton University’s Undergraduate Student Government has issued a Halloween-costume guide warning students against costumes that make fun of groups of people.The guide, a copy of which was obtained by Campus Reform, provides students with a series of questions to ask themselves about their costumes before attending the school’s Halloween celebration, called “Princetoween.”“As Princetoween approaches, here are some tips and reminders to create a fun, safe and inclusive experience for all students,” the guide states.The questions on the list are:“Is my costume making fun of a group of people?”“Does my costume have the potential to create an unsafe or hostile environment?”“Does my costume reduce cultural differences to jokes and stereotypes?”“Are you altering your skin color, facial/body features to make it darker or indicative of a particular race, ethnicity, or cultural group?”“Is your costume ‘funny’ because you’re dressing up as someone from a particular race, gender, ethnicity or culture?”\nNow, to be fair, a lot of these suggestions are quite obviously good ones. For example: Owing to its horrific history, blackface is absolutely never okay, and it is absolutely crucial that students avoid it. It’s also important to be respectful of other cultures when choosing a costume, so I certainly don’t have any issue with those suggestions whatsoever.Where I do have an issue, however, is with that first question: “Is my costume making fun of a group of people?” Honestly, I would answer that question in one way only: “So what if it is?” I mean honestly, who cares if someone uses a little bit of humor to poke fun at a group of people, as long as it’s not doing something offensive like making fun of a race or culture? A few years ago, I went out for Halloween dressed as a Hot Topic manager, and I absolutely was doing so in order to make fun of Hot Topic managers. It was probably one of my favorite Halloween costumes ever, and I have absolutely no regrets about doing it regardless of what this guide states. It was funny, and I don’t want to see our culture reach a point where the complete obsession with sensitivity makes it impossible to do things that are funny.We all need a little laughter in our lives, and Halloween is a great time of year for people to be creative and use their senses of humor to create funny, clever costumes. It’s entirely possible that some of these funny, clever ideas may fall into the category of making fun of a group of people, but that shouldn’t really matter. We should all be emotionally strong enough to be able to take a joke, especially when it’s all in good fun.Thankfully, it doesn’t seem as though any students would actually be punished for violating these guidelines. According to Campus Reform, the USG released the same guide last year and told the publication at the time that “the guidelines themselves would not be a basis for disciplinary action.”NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}