{"id": "How D.C. Is ‘Getting Guns Off the Street’\t\t\t\t\t\t\tHow D.C. Is ‘Getting Guns Off the Street’\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 17\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tOn Criminal Justice, Trump Embraces the Left’s Racism Rhetoric\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump Appointee Judge Rules for CNN. Good.\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tJudge Orders White House to Return Acosta’s Press Pass\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 16\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Case for the Wage Subsidy\t\t\t\t\t\t\t\nFrom the looks of things, it would seem that the D.C. police department has declared an occupation of some of the city’s neighborhoods. In the name of getting guns off the street, the department has taken to stopping and frisking pedestrians, and searching cars as well. Per NPR, in “2016, D.C. police confiscated more than five times as many illegal guns per capita as did the New York City Police Department, and nearly twice that of the Los Angeles Police, according to police data.”The numbers grab your attention, which is what the department hopes for. But as James Trainum, a retired D.C. homicide detective who works with the Constitution Project on policing reform, tells National Review: “Any time there’s a spike, there needs to be a question: Why?”It recalls the way Philadelphia seized five times as many assets as Los Angeles, despite having less than one-sixth its population. Philadelphia’s program ended with a settlement wherein the city acknowledged wrongdoing and agreed to pay $3 million to its victims.WAMU and American University’s Investigative Reporting Workshop went through D.C.’s numbers and revealed some shocking trends. Forty percent of these gun-possession cases were dismissed, revealing clearly that in the rush for volume, quality policing and the rule of law (not to mention the Fourth Amendment) are being abandoned. And in the process, the relationship between the citizenry and law enforcement is breaking down even further.Assistant police chief Robert Contee has defended the aggressive search policy, saying that a cost in community trust is still superior to a cost in lives — but the impact of community–police relations can’t really be waved away so easily. Trainum is disappointed by this response, saying, “To me the whole thing is very disturbing. If you get 40 percent of your cases dismissed, you should want to correct that.” If this doesn’t receive pushback from higher ups, “You’re violating civil rights [and] encouraging officers to cut corners.”\nTrainum points out that “if 40 percent of the forest is rotten, and you don’t realize it, it’s going to damage the rest of the trees.” The problem starts here, at the point of arrests and roundups. After all, these are the ways in which communities encounter the police most vividly, and if entire neighborhoods become fearful of cops, it makes it difficult to tackle actual violent crimes.“One of the biggest complaints from homicide detectives is: ‘We can’t solve cases because people don’t talk to us,’” Trainum says. “If the uniformed officers are out there cheating and getting pats on the back for getting guns off the street, [residents] are not going to trust police.” This, in turn, means that murders and other violent crimes go unsolved.The numbers game isn’t limited to uniformed officers. Trainum points out that, to most detectives, the “closure rate is more important than the conviction rate,” but this is a much less useful metric for measuring law enforcement. “D.C. has a very, very high homicide closure rate that’s outside the norm, so why aren’t other departments flocking to D.C. to learn [about] it?” Colorfully, he answers the question: “It’s because they know the numbers are bullsh**.”The numbers game compromises the rule of law in the District, and it inhibits proper policing by breaking down trust between citizenry and law enforcement. How can this gulf be bridged? And how might police move away from the current numbers-based approach?\nTrainum believes that fixing the problem needs to start at the training stage for police officers: “We really don’t have a lot of training in what our job really is, and the ethics involved.” Better instruction in constitutional safeguards against search and seizure, and a culture that recognizes police are enforcers of the law and not simply enforcers would be a start. But the practice of prioritizing arrests over good cases needs to be reformed. Trainum proposes adopting some best practices from other fields; he cites the Sentinel event-review system in medicine, which evaluates the surrounding factors after a patient death to determine what went wrong. A tracking system for police behavior, which would quantify the false positives both in searches from dogs and from personnel, and effective “quality assurance” for policing, while tedious and maybe not as marketable as other policing programs, is the only way to show what is actually working.If the police department starts admitting its mistakes and making an effort to correct them, that will go a long way towards healing the rift between community and police, Trainum argues, based on his experience on the force. But if it digs in its heels, the situation will only get worse. Violence is a real problem, and there is a need for law enforcement, but a police department that seems to have lost the mandate of those it claims to protect won’t be able to accomplish any of this. Constitutional policing is in the interests of cops and community alike, but whether it will come about remains to be seen.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}