{"id": "Dean Heller Consolidates Lead against Democratic Challenger in Nevada Senate Race\t\t\t\t\t\t\tDean Heller Consolidates Lead against Democratic Challenger in Nevada Senate Race\t\t\t\t\t", "paragraph": "National ReviewRepublican senator Dean Heller continues to pull away from his Democratic opponent in the Nevada Senate race, according to new polling out today from Reuters/Ipsos/UVA Center for Politics. The survey, conducted online from October 12 to 18, showed Heller ahead of congresswoman Jacky Rosen 47-41 percent, with 4 percent of likely voters undecided.The results line up with a mid-October Emerson poll, which put Heller ahead by seven points. Every poll of the race this month has given him a lead of at least two points. The last time Rosen led a poll was in late September, when a CNN survey put her up 47-43 percent.The Reuters/Ipsos/UVA poll also found that immigration is the most important determining issue for a plurality of likely voters in Nevada (21 percent), followed by 16 percent who say health care is most important in determining their vote, and 12 percent who say the economy is most important.NR's afternoon roundup of the day's best commentary & must-read analysis.Forty-three percent of likely voters said Heller is better on immigration, compared to 33 percent who said the same of Rosen. On health care, Rosen had the edge among likely voters, 39-35 percent, but on the economy, the Republican led her again, 41-33 percent.Heller is the only Republican incumbent defending a Senate seat in a state that Hillary Clinton won in the 2016 presidential race — although she did so by just 2.4 points. Rosen, meanwhile, has been in Congress for only one term, elected to represent Nevada’s third congressional district in 2016 by a mere 1.2 percent margin.Six weeks ago, polling gave observers good reason to believe that Rosen was well within striking distance of Heller, making the Nevada seat perhaps the biggest pickup opportunity in the Senate for Democrats. Over the last month, that possibility has started to look far from certain, and in fact much less likely.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}