{"id": "‘Correcting the ADL’s False Anti-Semitism Statistic’\t\t\t\t\t\t\t‘Correcting the ADL’s False Anti-Semitism Statistic’\t\t\t\t\t", "paragraph": "National ReviewDavid Bernstein has a well-done piece over at Tablet on the Anti-Defamation League’s claim that anti-Semitic hate incidents rose 57 percent between 2016 and 2017. Some key bits:Most important, the study does not actually claim to count “anti-Semitic incidents,” as such but rather the reporting of these events. First, it purports to count those incidents that have been reported to the ADL by the media, law enforcement, and the public. The ADL acknowledges that some of the increase in documented incidents is not an actual increase, but results from “more people . . . reporting incidents to ADL than ever before.”Second, the report does not count only actual anti-Semitic incidents, but any incident that results “in Jews perceiving themselves as being victimized due to their Jewish identity.” As a result of this methodological tic, the ADL’s tally includes 163 bomb threats made to Jewish Community Centers and other Jewish institutions in early 2017, even though the two perpetrators were not motivated by anti-Semitism.. . .Finally, it’s worth noting, that despite showing a 57 percent increase in incidents overall, from 1,267 to 1,986, the ADL study shows a 47 percent decrease in physical assaults, from 37 to 19. This is obviously inconsistent with the meme that 2017 saw a surge in violent anti-Semitism. Physical assaults are also the most objective sort of incident to document, which adds to concerns about the robustness of the rest of the data.I’d add that, while the FBI’s data aren’t comprehensive either — not all incidents are reported to the police, and not all police departments report their data to the FBI — it’s worth keeping an eye on them, as (judging by when they were released last year) they should be updated with 2017 numbers soon. Between 2015 and 2016, anti-Semitic incidents rose from 664 to 684, or 3 percent. Hate incidents in general, about a tenth of which are anti-Semitic, rose about 5 percent.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}