{"id": "Broward County Probably Didn’t Undercount the Florida Senate Race\t\t\t\t\t\t\tBroward County Probably Didn’t Undercount the Florida Senate Race\t\t\t\t\t", "paragraph": "National ReviewThe Florida Senate race is extremely close. As the formal recount begins, the final preliminary vote tally due at noon Saturday had Republican candidate Governor Rick Scott ahead of Democratic senator Bill Nelson by 12,562 out of over 8 million votes cast. In recent days, much attention has focused on Democrat stronghold Broward County, where late counting of early and vote-by-mail ballots has narrowed the statewide margin considerably.One curiosity that has received particular attention is that Broward County has recorded far fewer valid votes for the Senate race than governor and other statewide positions. At last count, Broward has reported 24,992 (or 3.5 percent) fewer votes for Senate than governor. This makes it a stark outlier compared to Florida’s other counties, where the comparable vote differences have been minimal.The question of these “missing” votes is crucial in the recount, especially because of Broward County’s partisan lean. One hypothesis, advanced by Senator Nelson’s lawyer, is that these missing votes are the result of a machine reading error, and thus these votes will likely be added during the recount. Extrapolating from Broward’s current vote shares, this would narrow the count considerably, but still likely leave Governor Scott in front unless other changes fall in Senator Nelson’s favor.An alternate hypothesis is that Broward County’s complicated ballot design led people to fail to notice, and thus vote in, the Senate race. This argument points out that Broward’s ballot tucked the Senate race into the bottom left corner, while the Governor’s race was prominently placed at the top-center of the page. Whatever the cause, without these additional votes to potentially narrow the margin, Governor Scott appears highly likely to win.One piece of evidence for this second hypothesis is that the relative rate of missing Senate votes is highest (at about 10 percent) in the part of Broward County that falls into Florida’s 24th congressional district, where the existing representative ran unopposed and thus no congressional vote appeared on the ballot. This link is plausible because Broward’s ballot placed the congressional-district vote in the same bottom-left corner of the ballot as the Senate race; the absence of the former may have made it easier to miss the latter. However, as only a small fraction of Broward County falls into this district, it only accounts for a small fraction of the missing votes.This does however suggest an additional prediction regarding the missing votes. If people failed to vote for Senate because they missed that portion of the ballot, they should have also left the congressional-district vote blank. This can be checked by comparing the rates of missing votes for Senate and Congress across each of Broward’s 577 precincts for which votes are tabulated. This is complicated by the fact that there is a separate reason people may not vote for Congress: The party they wish to vote for may not field a candidate in their district (indeed, in the precincts that fall into Florida’s 20th congressional district, the missing Congress vote rate is very tightly related to Ron DeSantis’s vote share in the governor’s race). Naturally, people who fail to vote for Congress for this reason would not be expected to fail to see the Senate race.NR's afternoon roundup of the day's best commentary & must-read analysis.After accounting for these factors using a statistical procedure known as multiple regression, there is a very strong correlation between the proportion of missing votes for Senate and congressional district, suggesting the vast majority of missing Senate votes also involve a missing vote for Congress. This correlation is particularly clear for precincts with a standard two-party congressional race.This evidence is consistent with the hypothesis that people may have missed these races due to their location on the ballot. By contrast, while not impossible, it is hard to see how this pattern fits with a theory of machine error. Given this, it seems that rather than being temporarily missing, perhaps these votes never were.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}