{"id": "The Trump Administration Gives States More Leeway on Obamacare\t\t\t\t\t\t\tThe Trump Administration Gives States More Leeway on Obamacare\t\t\t\t\t", "paragraph": "National ReviewConservatives have long wanted to give the states a longer leash to set their own health-care policies — and while the effort to repeal and replace Obamacare stumbled, the Trump administration recently put out a new “guidance” document expanding the scope of the waivers available to states that want to experiment. These “1332 waivers” give states funding and let them out of some of the law’s rules.Under the Obama administration’s interpretation of this provision, to qualify for a waiver, a state essentially had to show that its reforms would provide the same type of coverage as Obamacare, to the same number of people, and at the same or lesser cost. Under Trump’s interpretation, coverage has to be available that’s at least as comprehensive and affordable as traditional Obamacare plans are, but states may also use the waivers to facilitate other, non-Obamacare-compliant options.Generally, what this means is that states can expand cheaper and less comprehensive forms of insurance. The big advantages are that (A) states get to decide what they want for themselves and (B) in states that go this route, people will have the freedom to buy more affordable plans that better fit their own needs.Yes, there are some potential downsides. When designing their proposals, states must be aware of the risk that they will bifurcate their health-care markets, with healthy people buying cheap plans while the sick are relegated to traditional plans (whose premiums could then rise). They must also be aware that skimpier plans may fail to cover catastrophic expenses in some cases, and that it would be politically suicidal to pursue options that would significantly erode protections for those with preexisting conditions. But these are tradeoffs that the states themselves can evaluate, and that might still play a role in the administration’s decision to grant or refuse to grant a waiver.It’s also worth asking if the executive branch has the legal authority to grant such broad waivers. This is a thorny question involving many eternal debates in statutory interpretation: Do we care only about the literal meaning of the words in the text, or does the intent of the drafters (whether implied in the law’s structure or stated elsewhere) matter too? If the language is a bit ambiguous, does the executive branch get to interpret it however it wants, or should courts step in and enforce the more likely meaning?Here’s the key language from the statute laying out the “guardrails”:The Secretary may grant a request for a waiver . . . only if the Secretary determines that the State plan—(A) will provide coverage that is at least as comprehensive as the coverage defined in section 1302(b) and offered through Exchanges established under this title as certified by Office of the Actuary of the Centers for Medicare & Medicaid Services based on sufficient data from the State and from comparable States about their experience with programs created by this Act and the provisions of this Act that would be waived;(B) will provide coverage and cost sharing protections against excessive out-of-pocket spending that are at least as affordable as the provisions of this title would provide;(C) will provide coverage to at least a comparable number of its residents as the provisions of this title would provide; and(D) will not increase the Federal deficit.Here’s how the administration justifies its new interpretation:(C) requires that a state’s plan under a waiver will provide coverage\n“to at least a comparable number of its residents” as would occur without the waiver. By contrast, [(A) and (B)] merely state that the state’s plan will provide coverage that is as comprehensive and affordable as would occur without a waiver, but do not specify to whom such coverage must be provided. . . . [Under this guidance,] a state plan will comply with the comprehensiveness and affordability guardrails, consistent with the statute, if it makes coverage that is both comprehensive and affordable available to a comparable number of otherwise qualified residents as would have had such coverage available absent the waiver. . . .The coverage guardrail requires that coverage be provided to at least a comparable\nnumber of residents as would occur absent the waiver. However, the text . . . is silent as to the type of coverage that is required. . . . As long as a comparable number of residents are projected to be covered as would have been covered absent the waiver, the coverage guardrail will be met.In other words, to “provide” coverage is merely to make it available in parts (A) and (B), and refers to the number of people who actually get coverage only in (C), where it says this explicitly. And the “coverage” referred to must be both comprehensive and affordable to meet guardrails (A) and (B), which state these requirements explicitly, but not to count toward the total number of those covered in (C).NR's afternoon roundup of the day's best commentary & must-read analysis.The alternative reading is spelled out by Katie Keith at the Health Affairs blog:The statute is clear that coverage provided under a state waiver must meet all four guardrails: comprehensiveness, affordability, number of people covered, and deficit neutrality. The new guidance ignores the fact that these guardrails are conjunctive: the Secretaries can only approve a state waiver if it will provide coverage that is as comprehensive and as affordable and as available as coverage provided under the ACA (and it does not increase the federal deficit).Instead of taking this natural reading of the statute, the new guidance essentially considers the guardrails separately, leading the Departments to conclude that waivers could be approved even if only some coverage under the waiver is as comprehensive, as affordable, and as available as coverage provided under the ACA.The Departments justify this conclusion by noting that the phrase “to at least a comparable number of its residents” appears in the coverage guardrail but not the comprehensiveness and affordability guardrails. They take this to mean that the comprehensiveness and affordability guardrails need not apply to all coverage approved under the waiver. So long as some of the coverage under a state’s waiver proposal satisfies these two guardrails and is available to consumers, the proposal meets those criteria.This interpretation appears to disregard the plain text of Section 1332 and undermine the purpose of this provision, which Congress adopted to enable states to innovate above an established floor of consumer protections. Section 1332, which was introduced by Sen. Ron Wyden (D-OR), was not intended to permit states to dismantle the ACA’s protections and expand access to coverage options that undermine the ACA marketplaces and are not nearly as protective of consumers as ACA products.She does seem to be right that Wyden didn’t intend this result: He’s really ticked off, for one thing. Also, in a 2015 letter he summarized guardrail (A) as “ensur[ing] that individuals get insurance coverage” at least as comprehensive as ACA plans (my emphasis).Further, this interpretation isn’t limited to Wyden. Some conservatives who want broad waivers have criticized the law for making them too narrow — e.g., “Under Obamacare, these waivers technically allow states to pursue different insurance-regulation regimes, but they are very limited in scope because a state has to show that it would achieve exactly the same thing the federal Obamacare rules would achieve, which means states can’t really do anything all that different.” And when folks went after Obama’s 2015 guidance, it was typically for the way it interpreted the deficit-neutrality requirement, not the other guardrails that Trump is now changing.Still, I’m not convinced that the administration’s reading is wrong, exactly, on a simple grammatical level. The interpretation is conjunctive in that it requires state plans to meet all four guardrails simultaneously; it just allows different types of coverage to meet different guardrails, based on a literal reading of each guardrail by itself. Whether the courts will buy into this in the event of a challenge, I have no idea.One last thing worth noting: The administration will prefer waiver applications that would expand private, as opposed to public, insurance options. I’m not sure this is the best idea; federalism means letting blue states be blue states too.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}