{"id": "UNC’s Chancellor Is Between a Rock and a Hard Place\t\t\t\t\t\t\tUNC’s Chancellor Is Between a Rock and a Hard Place\t\t\t\t\t", "paragraph": "National ReviewBack in August, a mob of activists broke the law when they pulled down the “Silent Sam” statue on UNC’s Chapel Hill campus, and we still don’t really know to what extent the administration aided them by telling law enforcement to stand down while the mob wrought its destruction. The “progressives” savored their big victory over a piece of metal, but quite a few people in the state have sided with the rule of law.In today’s Martin Center article, Jay Schalin looks at the state of the battle over Silent Sam.For one thing, the people guilty of property destruction have so far gotten off very easy. Schalin writes, “A total of 24 people have been arrested in conjunction with the August 20 riot and subsequent protests. So far, they have escaped punishment—and they are not likely to receive much if the recent past is any indication. Maya Little, a doctoral student in history at UNC-Chapel Hill, who was arrested earlier this year for pouring a mixture of ink and blood on the statue (and on a police officer’s body camera), was found guilty of a misdemeanor charge for defacing the statue—but was not given any punishment by the Orange County court. Another controversy erupted during her student court hearing when she received nothing more than a letter of warning and 18 hours of community service as punishment. Little and other protesters marched out of court, claiming that one of the jurors was biased against her.”While that’s not Chancellor Carol Folt’s problem, she does have to respond to the UNC Board of Governors, which has given her until early December to set forth a plan for restoring the statue. As Schalin explains, Folt is in a tough position: “If Silent Sam is sent packing or banished to some dusty, out-of-the-way alcove, it will appear to many that she is handing the keys to the campus to those who reject the rule of law. On the other hand, if she returns Sam to his former home on McCorkle Place or some other equally prominent spot, the mob will likely try to pull him down again. So what are she and the Trustees supposed to do?”This certainly isn’t the sort of dilemma Carol Folt expected to face at UNC when she left Dartmouth to become chancellor here in 2013.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}