{"id": "Why We Should Tinker with the House\t\t\t\t\t\t\tWhy We Should Tinker with the House\t\t\t\t\t", "paragraph": "National ReviewIt’s rare that I find myself agreeing with the editorial board of the New York Times, but they’re right about the wisdom of expanding the House of Representatives and moving towards multimember districts that elect representatives through a more proportional voting system. I made the case for a more proportional system in 2014, and though I appreciate that there are risks involved in pursuing such a reform, it would offer one profound benefit: Whereas our current system ensures that liberals in Arkansas and conservatives in New England go entirely (or almost entirely) unrepresented in Congress, a more proportional system would change that. This would better reflect America’s political diversity and it might even foster a more constructive politics, as (per the Times) “members of the different parties would need to work together on behalf of their district’s voters.”If this all sounds too pie-in-the-sky, consider the more modest case for simply expanding the House to 593 members, another quite good idea taken up by the Times. Though I wouldn’t go as far as the political analyst Lee Drutman, who calls for a House with 1,600 members, a more modest expansion would have a number of salutary effects: Most obviously, it would modestly shrink the average number of constituents represented by a given member; it would reduce the sting of losing seats after the next congressional reapportionment (which is why the House kept growing until it reached its current size in 1912, and before Congress rather arbitrarily capped its size at the current level in 1929); it would be a boon for states like Montana and South Dakota, which currently have only one at-large member despite having populations that are well above average for a single district; and it would allow for an infusion of talent into the lower House.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}