{"id": "Blue Wave Would Wash Far-Left Committee Chairmen onto Capitol Hill\t\t\t\t\t\t\tBlue Wave Would Wash Far-Left Committee Chairmen onto Capitol Hill\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAbrams Campaign Considers Drastic Legal Measure to Force Another Vote\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBroward County Missed Recount Deadline by Two Minutes\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFlorida Dems Gave Out Altered Form to Fix Absentee Ballots Past Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Election’s Lesson for Democrats: Don’t Nominate Hillary Clinton\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tMichael Avenatti Bites the Dust\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tUrban Cowboys\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Blue Wall\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLosing the Suburbs\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tToward a Bigger Coalition\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFlorida Judge Gives Voters Additional Time to Correct Rejected Ballots\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHillary Clinton: If Stacey Abrams ‘Had a Fair Election, She Would Have Already Won’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAnyone but Nancy Pelosi for Speaker\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe GOP’s Orange County Problem\t\t\t\t\t\t\t\nRepublicans, independents, and thinking Democrats who wonder why they should go vote GOP on November 6 should visualize this: Senate Judiciary Committee chairman Dianne Feinstein and House Financial Services Committee chairman Maxine Waters.If Democrats capture either or both chambers, key congressional panels would fall to far-left lawmakers. The macro effect is staggering. Among ten top Senate committees, the average lifetime American Conservative Union rating for today’s GOP chairmen is 85.3. Assuming that current ranking Democrats became chairmen, their average ACU rating would tumble to 7.1. In the House, across 10 top committees, the equivalent ACU averages would plunge from 88.6 to 5.0. Translation: Loud Democrat demands for higher taxes, bloated spending, spools of bright-red tape, and ferocious digging beneath every rock in the Trump administration.Come January, seniority and political jockeying might shuffle the leadership deck. But for now, imagine that today’s ranking members led these committees. (For more details, see my spreadsheet here.)• The Senate Judiciary Committee chairmanship would shift from Charles Grassley (R., Iowa), with an 83.8 ACU rating, to Feinstein, a California Democrat. ACU: 8.8. This would promote Supreme Court Justice Brett Kavanaugh’s chief character assassin. Feinstein tried and failed to whack Kavanaugh with last-minute, unsubstantiated sexual-abuse charges.Despite his confirmation, Feinstein is not finished. She said Wednesday: “I’d be in favor of opening up the allegations, absolutely.” Feinstein would activate the anti-Kavanaugh machine anew.Meanwhile, with two Supreme Court justices, 29 circuit court judges, and 53 district court jurists added to the federal bench, judicial confirmations are one of President Trump’s and the GOP Senate’s most encouraging achievements. This progress would grind to dust under Feinstein’s gavel.\n• The Health, Education, Labor, and Pensions Committee mantle would shift from Tennessee Republican Lamar Alexander (ACU: 72.1) to Washington Democrat Patty Murray (ACU: 2.4). After 9/11, she said about al-Qaeda founder Osama bin Laden: “He’s been out in these countries for decades, building schools, building roads, building infrastructure, building day-care facilities, building health-care facilities, and the people are extremely grateful. He’s made their lives better. We have not done that.”• The Senate Budget Committee’s leadership would move from Republican Mike Enzi of Wyoming (90.9) to Vermont Socialist Bernie Sanders (6.7).“Senator Sanders has sponsored legislation that would, on average, increase federal spending by $1.01 trillion per year and reduce it by about $6.7 billion per year,” wrote the National Taxpayers Union Foundation’s Demian Brady. From 2009 through 2015, NTU calculates, Sanders’ net proposed outlays are “more than 17 times higher than what the average Democratic Senator proposed in the same time.”As for the House:• The Judiciary Committee’s chairmanship would devolve from Virginia Republican Bob Goodlatte (93.8) to New York Democrat Jerrold Nadler (2.7). House Democrats are obsessed with impeaching President Trump. Why? He defeated Hillary Clinton. How dare he?Judiciary would be Mission Control for impeachment. How fair and impartial would Nadler be? Hint: He boycotted Trump’s oath of office.“I cannot in good conscience participate in this honored and revered democratic tradition of the peaceful transfer of power,” Nadler said. “I refuse to treat Jan. 20, 2017, as business as usual. For these reasons, I have no interest in participating in the inauguration ceremony of Donald J. Trump.”• GOP Intelligence Committee chairman Devin Nunes of California (85.1) would yield to California Democrat Adam Schiff (4.8). Schiff told CNN: “I’m proud to be one of the bad hombres,” whom President Trump has denounced. Schiff likely would torpedo today’s probe of Hillary Clinton’s and the Democrats’ apparent collusion with Russians to excavate dirt on candidate Trump. Likewise, Schiff probably would ignore Hillary’s approval of the Uranium One deal, which let Moscow purchase 20 percent of U.S. uranium supplies, evidently in exchange for $145 million in donations to the Clinton Foundation.• The Financial Services Committee’s chairmanship would be a jump to the left. Texas Republican Jeb Hensarling (97.1) would cede to California Democrat Maxine Waters (4.3). She notoriously told radical leftists how to confront top Trump supporters: “You create a crowd. And you push back on them.”In May 2008, she told oil executives, “This liberal would be about socializing . . . would be about, basically, taking over, and the government running all of your companies.” She also once observed: “I have to march because my mother could not have an abortion.”This scenario is spookier than Halloween. Election Day arrives one week after that. Voters should run scared to the polls and stop this horror show from happening.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}