{"id": "Mississippi Resident Deserves Opportunity To Rehabilitate\t\t\t\t\t\t\tMississippi Resident Deserves Opportunity To Rehabilitate\t\t\t\t\t", "paragraph": "National ReviewIn the previous 50 years, the state of Mississippi has validated Lord Tennyson’s belief that “men may rise on stepping-stones of their dead selves to higher things.” Now the state has asked the U.S. Supreme Court for 20 more days to provide the court with a defense of the proposition that a state court was sufficiently serious in ruling that Joey Chandler is so depraved that he could never undergo a regeneration comparable to what Mississippi has managed. In 2003, Chandler, then 17 and seeking money to support his pregnant girlfriend, tried selling marijuana. When his supply was stolen from his car, he believed the thief was his cousin Emmitt, 19. Chandler fatally shot Emmitt and fled the scene, but later that night he surrendered to authorities. Convicted of murder, Chandler was sentenced to life imprisonment without possibility of parole. Parents who have raised sons understand that civilization’s primary task is to civilize adolescent males, a task that is difficult for many reasons, some of which neuroscience explains. The part of the brain that stimulates anger and aggression is larger in males than in females (for evolutionary, meaning adaptive, reasons). And the part that restrains anger is smaller in males. The Supreme Court has noted that adolescent brain anatomy can cause “transient rashness, proclivity for risk, and inability to assess consequences,” thereby diminishing “moral culpability” and, more important, enhancing “the prospect that, as the years go by,” offenders’ “deficiencies will be reformed.” Hence “a lifetime in prison is a disproportionate sentence for all but the rarest of children, those whose crimes reflect ‘irreparable corruption.'” There is spirited disagreement among thoughtful people concerning whether such disproportion constitutes a violation of the Constitution’s Eighth Amendment proscription of “cruel and unusual punishments.” There is disagreement concerning whether the Eighth Amendment as originally understood by those who wrote and ratified it was intended to forbid only certain methods of punishment, or to assign to courts the task of enunciating standards of proportionality in sentencing. There is disagreement about what the modern court has done in incrementally circumscribing states’ discretion in punishing juveniles: It has held that the Eighth Amendment forbids capital punishment for children under 18. And that it forbids life imprisonment without parole for juveniles convicted of non-homicide offenses. And that it forbids — this is the issue in Chandler’s case — mandatory life imprisonment without possibility of parole for juvenile homicide offenders unless they have demonstrated “such irretrievable depravity that rehabilitation is impossible.” Never mind that it is difficult to imagine how a sentencing court could determine that a juvenile has manifested such depravity. Clearly, however, the Mississippi court that heard Chandler’s argument for resentencing in light of Supreme Court rulings about sentencing juveniles did not seriously attempt this difficult task. \nWhile incarcerated, Chandler has not been a discipline problem. He has earned a GED and completed college-level coursework in Bible studies. He has earned certificates in construction trade skills and made substantial progress toward a certificate in automotive repair. Nevertheless, the resentencing court’s almost flippant reasons for reaffirming Chandler’s sentence to die in prison included the following: “Nothing in the record” suggested that Chandler “suffered from a lack of maturity” when he shot his cousin. (Science demonstrates a physiological basis of varying maturities of male adolescents.) The 17-year-old Chandler was “very mature” because he planned his crime. (His prompt surrender suggests more bewilderment than planning.) He was mature because he came from a nuclear family. (How does a family’s attribute prove the existence of a different attribute in a family member?) He was mature because 17-year-olds are allowed to get driver’s and pilot’s licenses, and abortions, and because he fathered a child, and because in World War II a 17-year-old won a Medal of Honor. Really. And the court simply ignored the evidence of Chandler’s efforts at rehabilitation. Fifty years ago, many Americans thought Mississippi itself exemplified irretrievable depravity. Today the state has more — not more relative to population, more — African Americans in elective offices than any other state. Culturally and economically, Mississippi is a vibrant participant in the American mainstream. The state’s self-rehabilitation was not impossible. In 2053, the 50th anniversary of Joey Chandler’s crime, he will be 67, if he lives that long. Today, the Supreme Court should hear Chandler’s case in order to provide standards requiring sentencing courts to be serious when making an extraordinarily serious judgment about someone’s “irretrievable depravity.” George Will’s email address is georgewill@washpost.com. © 2018, Washington Post Writers Group NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}