{"id": "Basta La Vista, Baby\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\tBasta!It Would Take a Heart of Stone Not To LaughEveryone Needs to Lighten UpIn Defense of Bill KristolVarious & Sundry", "paragraph": "National ReviewDear Reader (And especially Martha McSally’s dog),As I often note, I increasingly tend to see the political scene as a scripted reality show in which the writers don’t flesh out the dialogue so much as move characters into weird, wacky, confrontational, or embarrassing positions. It’s a lot like The Truman Show, except most of the cast isn’t fully in on it. Sometimes I imagine some writers’ room in the sky where a bunch of exhausted hacks with coffee breath struggle amidst the pizza boxes and broken pencils to figure out how to ratchet up the intensity from scene to scene or season to season. “Let’s have them just leave Reince on the tarmac!” “How about we put Jared in charge of Middle East Peace!” “Let’s have some fun with George and Kellyanne, I think there’s huge sitcom material there.”“If only Roger Stone were still alive.”“He is.”“Whoa. Call his agent. We gotta have him on. A little goes a long way with that guy, but he could steal the show like Christopher Walken in Pulp Fiction talking about that watch he kept up his own a**, except instead of the watch we can use Stone’s whole head.”The writer who came up with the whole “Anthony Weiner texting junk pics” got a lot of grief for a storyline that was a bit too on the nose, as it were, given Weiner’s name. But it was a ratings killer, and it set up much of the story arc for the next couple of seasons.The trick is often in the little details that make this seem like a fully realized alternative reality, like the grittiness of Mos Eisley in the first Star Wars, or, more apt, the fake movie trailers at the beginning of Tropic Thunder.Or, for example, the Trumpy Bear commercials.Personally, I think this latest subplot with Jim Acosta and Donald Trump has been really boring. It would have been much cooler if President Trump owned the libs by pressing a button that opened a trap door beneath Acosta, and for added drama maybe he tried to grab hold of the microphone-carrying intern to prevent his fall. All we hear is a thud and then lions roaring. Or maybe Acosta falls alone but is only injured and just complains a lot like Will Ferrell when Dr. Evil sent him to his doom.If I had to bet, the writers will have CNN credential Stormy Daniels next season, so she can ask weird sex questions — I mean weird questions about sex, not normal questions about weird sex. (BTW, “What’s the difference between erotic and kinky? Erotic is when you use a feather; kinky is when you use the whole chicken.”)There are other times, when I like to imagine it’s less like a mashup of the writers’ rooms at the Sid Caesar Show, Desperate Housewives, and WWE, and more like we’re living in the world of the Gamesters of Triskilion, in which disembodied heads gamble with our puny lives for fun and profit.“10,000 Quatloos they claim Acosta assaulted the intern!”“20,000 Quatloos Corey Lewandowski pretends to be outraged by the manhandling of young women for partisan reasons.”“No bet.”“Okay, understandable.”I don’t want to beat a dead horse — unless it’s a zombie horse, in which case that might be necessary. But I cannot make up my mind about whether or not the Michael Avenatti storyline is one of the comedic subplots or part of the main dramatic narrative.I have no idea what to make of the news that he was arrested for domestic abuse. His denials might be legit. The testimonials from his ex-wives seem credible to me. But I’m also skeptical that the LAPD would arrest a celebrity porn lawyer on completely bogus charges. And while I would love for Avenatti to be telling the truth when he accused Jacob Wohl of setting him up, I’m skeptical about that too. I mean, Wohl’s not as dumb as he looks, but that’s setting the bar very low. When it comes to organizing conspiracies, Wohl seems as useful as a white crayon.I’m very conflicted about Avenatti because on the one hand I would very much like him to just go away. He started out as kind of interesting, but he’s turned into a really grating character. It’s like someone took the staggering self-regard of James Comey and wrapped it around a part-time Viagra-commercial actor who does all of his shopping at Duty Free boutiques at Middle Eastern airports. And that catchphrase — Basta! — is so unbelievably grating that he’s sort of turned into the Poochie or Urkel of this storyline, only with the oily sheen of a made-for-Cinemax movie about a creepy porn lawyer.On the other hand, there’s part of me that really wants him to be innocent of these charges for the simple reason that when he tried to destroy Brett Kavanaugh he used the “Believe All Women” mantra as way to hide his impressively dishonest and unethical behavior from the press and the public. It would be wonderful to watch the smoke come out of his android brain-processor as he dealt with the feminist version of the “no true Scotsman” fallacy: “All women are telling the truth but this woman is a liar . . . zzzztt spork, sizzle.”Before you get all sanctimonious about me making light of domestic abuse or sexual assault, let me say “pull my finger.” No seriously, I take domestic abuse and sexual assault very seriously, and if Avenatti is proven guilty he should face the full weight of the law. But, more broadly speaking, what choice does one have but to laugh at the endless spray of crazy that streams out of every iPhone and TV screen like water out of a giant clown’s fake flower on a daily basis?This is why I respectfully disagree with Bill Kristol here:NR's afternoon roundup of the day's best commentary & must-read analysis.Republicans chortling about Avenatti might recall he never showed any strength in 2020 polls of Democrats. Trump won the GOP nomination in 2016 and for now has the support of most Republicans. I’m not sure we Republicans have much of a moral high ground from which to chortle.— Bill Kristol (@BillKristol) November 15, 2018This is all technically correct, I suppose. But it misses the point. Just because some Republicans may be hypocrites for chortling at Avenatti doesn’t mean he’s not chortle-worthy. Nor does it mean that the most important thing about Avenatti’s continual self-beclowning is Republican hypocrisy. That hypocrisy is grating, of course. But let’s not lend aid and comfort to one jackass in a misplaced desire to condemn someone else’s jackassery.The single most exhausting feature of the Trump era is the soul-crushing humorlessness of so many Trump critics and Trump defenders. For many Trump critics, particularly but not entirely on the left, everything is a crisis of existential proportions. For Trump defenders, any criticism of Trump is a direct attack on his supporters.I usually understand where it comes from, I think. Trump does represent a serious stress test not just for conservatism and “democratic norms” but also for many of the assumptions that liberals held dear about the arc of history. Few things are scarier than being knocked off the horse of your teleology. It’s a bummer when you think you have a rendezvous with destiny, and you end up waiting for Godot.For Trump defenders, it requires incredible effort to keep yourself convinced that he’s the man you want him to be rather than the man he actually is. Orwell was right when he said, “To see what is in front of one’s nose needs a constant struggle.” But the opposite is often true as well. It is incandescently obvious that Donald Trump is not the world’s best negotiator or an honest person, among other glaring truths. But for people either emotionally or professionally invested in Trump, any admission that the Trumpian eminence front is a put-on is a threat of one kind or another. Maintaining the fiction that the emperor’s new clothes are glorious and resplendent takes a lot of effort, too. (For instance, imagine the energy it takes even to attempt to argue that Trump’s accidental “covfefe” tweet was a “genius move that is a very powerful demonstration of his ability to persuade”).I’m convinced that one of the things that causes Trump disciples to get so angry at conservative Trump critics is that we make it so much harder to sustain the fiction. Of course, Trump makes it much harder than we do, but Trump gets a pass because he is the object of the adulation, while we’re supposed to be in the pews yelling, “Amen.”The order of the day is to maintain message discipline with Pence-like dedication. That would be hard enough without us snickering and jeering from the cheap seats. This explains the wildly veering claims about “Never Trumpers” (a label I reject, but that doesn’t matter to them). We’re at once utterly irrelevant and incredibly dangerous saboteurs, fake conservatives and ridiculously doctrinaire ideologues, who’d rather prattle about “muh principles” than rack up so many wins we’ll beg Trump to stop all the winning. We’re the ignorable pests they cannot ignore.Again, Bill Kristol is a friend of mine and I like and respect him a great deal. When people claim he’s not a conservative because he’s not a reflexive cheerleader for the president, I have to cover my ears for fear my eyes will roll out of my head. But that doesn’t mean I always agree with Bill on how he’s responded to the Trump era (something I can say about 92 percent of my fellow conservatives, in both the pro- and anti-Trump camps). But my disagreements don’t fill me with rage or drive me to grab a partisan Billy club so that I can chase him out of the Right. The effort to claim he’s not a conservative — solely because he’s a Trump opponent — is precisely the sort of thing I wrote about in last week’s “News”letter:Indeed, more and more, liking Donald Trump is coming to define whether you’re on the team, and if you don’t like him — by which I mean, if you don’t celebrate his whole catalog the way the Bobs celebrated Michael Bolton’s — you’re part of the problem. Heck you’re not even a conservative.Consider the fact that no president in American history succeeded in bending conservatism to his personality more than Ronald Reagan. And yet Reagan had plenty of critics on the right. Richard Viguerie lambasted Reagan. Howard Phillips called him a “useful idiot for Soviet propaganda.” Joel Skousen, the executive editor of Conservative Digest, said in 1983, ”Mr. Reagan is now seen as untrustworthy by many conservatives who believe he has betrayed his own principles in an effort to appease his critics.”George Will, William F. Buckley, and numerous writers at National Review were personally fond of, or close to, Reagan, and usually supported him. But when the situation required it, they could be quite blistering in their criticisms. And yet, no one — or no one serious — claimed that Will and Buckley weren’t conservatives.What changed? Well, lots of things. But one of them has been the populist takeover of the conservative movement. (I have an essay on this in the latest issue of NR.) Populist movements can vary in ideological content but they all share the same psychological passions. Independent thought, naysaying, and insufficient ardor are seen as a kind of disloyalty. Better and earlier than most, Matt Continetti recognized the crisis of the conservative intellectual this takeover represents.I know I’m repeating myself, but it is just remarkable how the definition of a conservative for many people is primarily measured by support for Trump and/or hatred of Trump’s critics. My disagreements with Bill are entirely tactical and tonal, but I am at a loss to understand how any of my disagreements make him any less of a conservative today than he was five or 15 years ago. Bill Kristol is a conservative. About the people who say he isn’t one just because he won’t say the un-obvious, I’m not so sure.Canine Update: Because all of our go-to house- and pet-sitters are selfishly going home to be with their families on Thanksgiving, we’re probably going to have to bring the beasts to my mom’s for the holiday. It’s not ideal for a number of logistical reasons, among them the fact that Grandma has three extremely aristocratic cats. We can’t put them in a kennel because Zoë does not deal well with kennels. When she came out of one last time, something bad happened and she turned extremely hostile to other dogs. It took months to train that out of her. Pippa doesn’t deal with strange dogs very well either. Recall that when Zoë got into a scrap with some Corgis in apparently terrifying glow-in-the-dark collars, she ran more than a half-mile home to our house (crossing any number of streets). This brings me to a squabble I got into yesterday. A fight over at the D.C. bureau of the Daily Beast spilled out onto Twitter. Asawin Suebsaeng‏ argued that cats are superior to dogs because they are more convenient pets.The daily beast dc office just erupted into a heated argument about a) If cats are a health hazard to the owner and, b) if dogs are superior to cats.Righteous Team Cat: me, @JuliaArciga Decadent Dog Partisan: @woodruffbets @ErinBanco— Asawin Suebsaeng (@swin24) November 15, 2018I responded:Typical millennial self-centeredness: Cats are better than dogs because they're more convenient. Just live down to your standards and get yourself a pet rock. That way you can go to your avocado toast parties without any worries at all. https://t.co/PgBTBqj2Jn— Jonah Goldberg (@JonahNRO) November 15, 2018A large number of people took me way too literally (I like Suebsaeng), but that happens on Twitter. But they should take me seriously on this point: I have two dogs and two cats. I love three of them (I’m merely fond of my wife’s cat). Cats can be affectionate. It’s far more debatable whether they are “loyal” in any meaningful sense. And cats are definitely more convenient. But convenience is not everything. Anyone who’s read this “news”letter or followed me on Twitter knows I invest a lot of time, money, and energy in my dogs. And that’s not for everybody, so by all means get yourself a cat until you’re ready for the major leagues of pet ownership. But dogs give back far more than cats do. I could get all poetic about this, but science is on my side. Dogs love us. They evolved to love us. They picked a side. As I wrote 17 years ago:The dog is the only animal that volunteers for duty. If we want other animals — horses, oxen, mules, falcons, bears, or parrots — to come to our aid, we must either force them or bribe them. You might even call horses our slaves: Their spirit must actually be broken before they will agree to do anything for us. And, if the comparison of the jovial dog to the jovial Briton is a fair one, then the conclusion is unavoidable that cats share many attributes with our friends the French: They are coquettish when called, unavailable when needed, and always self-interested. If Lassie had been a cat, the barn would have burned down and Timmy would have starved to death at the bottom of the old well.Anyway, my wing-gals are doing great. They continue to love the weather and express that love with zoomies and smiles and even a little soulful contemplation. The other day, Pippa lost her ball on the trail (it happens). So we had to resort to some old school stick throwing, to get the ya-yas out of her. She was particularly fond of one stick, which is now in the back of our car. But she’s found others, too.They’re good dogs, and dogs are good.Now for the sundry.I’ll be on Special Report tonight.I’ll be speaking at the Miami Book Fair tomorrow.Oh, and next week we’re going to try something fun. By now you’ve heard of NRPlus, and if you haven’t signed up yet, you should. As an added bonus for NRPlussers, we’re going to let you decide what next week’s G-File should be about. I will take requests and try to accommodate as many of the suggested topics as possible while not descending into a pure Ask Me Anything listicle. We’ll announce details on the Corner next week.Last week’s G-File2020 will be crazyRemembering Stan LeeAnd now, the weird stuff.Spy pupRalph Bakshi vs. LOTRWhere you can eat with your dog in NYCPolitics and porn: A historyThe Crenshaw MomentNo jury would convictOn the other hand…\nHmmm. . .Cats and artMovie hackingThe first synthesizerLEGO Helm’s DeepJust don’t step on itHow to get a role in Bill and Ted 3Nature is weirdJapan’s understanding of American history, circa 1861NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}