{"id": "Prince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBelieve in Creed II \n\n\n\t\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTERF Wars\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\t‘The Process of Living’\t\t\t\t\t\t\t\nAt age 70, Prince Charles of Wales has quite the résumé — and his achievements are hardly ones that merely linger in the shadows of his being the longest-serving prince of Wales and an heir to the British throne. He turned 70 on November 14, and he has no intentions of slowing down; his philanthropy is his full-time job.In his 70 years, he has founded 18 charities, most notably the Prince’s Trust, started in 1976 to aid disadvantaged youth by providing them with free work training and access to scholarships. He’s also a patron of the arts, having founded The Prince’s Foundation for Children and the Arts in 2002 in an effort to expose more children to the arts. His most impassioned commitment within the arts has been inculcating an appreciation for them among young people.Prince Charles has spent his life attempting to revive tradition by bestowing the next generation with a lighted torch that the winds of change have threatened to extinguish. In 2000, he employed a “Welsh harpist” after the position had been unoccupied for nearly 130 years, since the reign of Queen Victoria, because he wanted to allow a young musician the opportunity to work and present the instrument in its highest esteem, in an effort to inspire its continuity in the arts.Prince Charles’s most popular cause, however, is arguably more consequential, although it’s also related to his fixation with preserving national heritage in order to allow for its inheritance by the following generation. He has been a stalwart defender of classical architecture and the conservation of London’s traditional built environment, which was dwarfed in the post–World War Two skyscraper building boom.In 1988, he was famously featured in a documentary titled “HRH Prince of Wales: A Vision of Britain,” in which he lambasts the “monstrous concrete maze” that London had become, warning that the skyscraper boom would cause “not just one carbuncle on the face of a much-loved friend, but a positive rash of them that will disfigure precious views and disinherit future generations of Londoners.”He has managed over the years to integrate his erudition and social class into apoplectic litanies on the topic of London’s changing scenery, maintaining his debonair demeanor without mincing words (often to the viewer’s delight — it’s a rarity for such criticisms to be carried out with a modicum of grace while also being blistering, but anyone who has read his remarks cannot doubt his passion). In response to having viewed a redevelopment scheme of Paternoster Square in 1987, he said:You have to give this much to the Luftwaffe . . . When it knocked down our buildings, it didn’t replace them with anything more offensive than rubble. Surely here, if anywhere, is the time and place to sacrifice some profit, if need be, for generosity of vision, for elegance, for dignity; for buildings which would raise our spirits and our faith in commercial enterprise . . . On such a site [Paternoster Square], market forces, I would suggest, are not enough . . . I would like to see architects working with artists and craftsmen, showing that pleasure and delight are indeed returning to architecture after their long exile.He has faced much criticism from modern architects and those who view him as a curmudgeonly old man wistful for the London he once knew. The designer of the Gherkin — a commercial skyscraper in London that looks like a cross between a futuristic Fabergé egg and a drone missile — responded to Prince Charles’s concern that architects were indulging in a “free for all [that] will leave London and our cities with a pockmarked skyline” by saying that “London is not a museum. It has to be renewed for the next generation, especially as it attempts to become the world’s leading city. We can’t leave it as it is in medieval times.”While buildings have been erected that gained appropriate nicknames such as the “Cheesegrater” or “The Pringle” or “Can of Ham,” garnering the prince’s warning that the city’s heritage will be lost to the next generation of dwellers, he has led a victorious and productive fight. His agitation against an opera house designed by famous modernist architect Zaha Hadid, for example, contributed to the plan’s abandonment in favor of a design that reflected local identity and character.\nIn 1993, he founded Poundbury, an urban village incorporating classical architectural design that he intended as a model for other developments, 35 percent of which is affordable public housing. In 2018, he began the fight to save the World Heritage status of the 900-year-old Tower of London, which was at risk of losing its UNESCO status due to the surrounding skyscrapers that obscured it from view, tarnishing the vista.Many of the criticisms are to be expected, such as those from within the architectural profession, from individuals who are likely threatened by the fact that the prince’s authority and watchful eye could deprive them of business. But Londoners have begun to heed his warnings, too, as the changing skyline has come to be nearly indistinguishable from Dubai or Manhattan.Most of Prince Charles’s 70 years of life have been spent protecting and reviving the things that will outlive us all, honoring material beauty that’s conducive to the spirituality that keeps and maintains a national memory beyond our time on earth. Cheers to 70 — may he have many more.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}