{"id": "It’s Going to Get Worse\t\t\t\t\t\t\tIt’s Going to Get Worse\t\t\t\t\t", "paragraph": "National ReviewIn the aftermath of the attempted bombings of George Soros, Barack Obama, Hillary Clinton, and John Brennan, I’m going to be pessimistic on an already-dark day. We’ve seen this movie before. We know what’s going to happen next, and none of it is good. Everything about our polarization is about to get worse.First — on the left — even before the evidence is in, the conventional wisdom will harden that the attacks were Donald Trump’s fault (or at least that his rhetoric played a role), and that any concerns about Democratic mobs or Democratic violence represent a frivolous and bad-faith diversion from the imperative of opposing the real enemy. As Andy McCarthy notes, mainstream news organizations are already pointedly stating that the targets of the attack are also targets of Trump’s rhetoric. Here’s CNN’s Jeff Zucker:Statement from CNN Worldwide President Jeff Zucker: pic.twitter.com/OXyIT6oSLT— CNN Communications (@CNNPR) October 24, 2018Yes, words matter, but it’s worth repeating that we don’t have any evidence at all that Trump’s words matter to the bomber. Yet for some, regardless of the evidence emerges in the next several days, Trump’s responsibility will remain an unfalsifiable belief — much in the same way that the New York Times editorial board just last year blamed Sarah Palin for inciting the terrible mass shooting in Tuscon that grievously injured Gabbie Giffords — long after claims of Palin’s alleged incitement had been thoroughly debunked.Second — on the right — if it turns out that the bomber is in fact a MAGA-hat wearing Trump fanatic, look for an avalanche of “what-abouts.” What about Steve Scalise? What about the ricin threat against Susan Collins? What about the man arrested for threatening Republican senators over Kavanaugh? There’s value in these what-abouts if a person argues that violence is the exclusive province of one side of the debate. They’re poisonous if they’re used to avoid looking at your own movement in the mirror.In political movements, the most effective policing is often self-policing, and yet that is now seen as a sign of weakness. In fact, the imperative to immediately fight back (and the hatred that drives one to feel that imperative the instant you see even your fellow citizens under threat) has already led a number of people on the right to recklessly and without any evidence either insinuate or claim outright that leftists are behind the bombs. For example, Candace Owens tweeted (and then deleted), “I’m going to go ahead and state that there is a 0% chance that these “suspicious packages” were sent out by conservatives. The only thing ‘suspicious’ about these packages, is their timing. Caravans, fake bomb threats — these leftists are going ALL OUT for midterms.”And there’s this nonsense from Dinesh D’Souza:NR's afternoon roundup of the day's best commentary & must-read analysis.I hear the FBI squeezed lemon juice on the suspicious packages and a very faint lettering revealed a single word: DEMOCRATS— Dinesh D'Souza (@DineshDSouza) October 24, 2018While there will always be some small number of cranks and extremists who want to commit acts of violence regardless of the tone of political discourse, vicious and angry rhetoric can have a malignant effect on troubled souls, granting them a level of moral permission to act beyond the law. Few things grant that permission more thoroughly than the belief that the other side wants you dead. We live in a political culture that magnifies the other side’s violence even as it minimizes our own team’s misconduct as marginal and rare. Can we not see where that leads?We are still blessed with relative political peace. But we shouldn’t fool ourselves. That can change. The late Sixties and early Seventies saw a surge of political violence on a scale that would shock the conscience of Americans today. We do not want to walk down that road. That level of violence, amplified through social media, could very well break our nation. So it’s imperative that we restrain our rhetoric, wait for evidence, and then have the moral courage to follow that evidence wherever it takes us — even to the darkest places in our own political movements.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}