{"id": "In Virginia, a GOP House Candidate Raises the Tone\t\t\t\t\t\t\tIn Virginia, a GOP House Candidate Raises the Tone\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 17\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHow D.C. Is ‘Getting Guns Off the Street’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tOn Criminal Justice, Trump Embraces the Left’s Racism Rhetoric\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBetsy DeVos Strikes a Blow for the Constitution\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump Appointee Judge Rules for CNN. Good.\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tJudge Orders White House to Return Acosta’s Press Pass\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 16\t\t\t\t\t\t\t\n‘I think I was the first candidate ever to win a convention with zero dollars,” Denver Riggleman tells me, reflecting on his surprise candidacy in Virginia’s fifth congressional district. On finding out, he says, “the first emotion was happiness: I won! The second emotion was terror: I won.” As he sees it, he’s a “regular guy” running for office, and that definitely has its appeal.A distiller and intelligence consultant, Riggleman felt driven to run because he “felt powerless” in the face of cronyism and the often contradictory regulations that make it difficult for a small business to get off the ground. Riggleman very briefly ran for governor in the Commonwealth’s 2017 campaign, as a libertarian outsider with a knack for free-market populism. (He called that campaign the “Whiskey Rebellion.”) But he withdrew early on and focused on the family business. He’s new to politics but not to policy, having served in combat in the military, worked in intelligence at the Pentagon for years, and experienced government from the other side, as a small-business owner.The fifth congressional district in Virginia is massive. It spans from the D.C. suburbs all the way to the North Carolina border and contains two sizable cities, Charlottesville and Danville. As the home of the University of Virginia, Charlottesville is definitely an important and historic part of the district, but economically and culturally it’s become an outlier. Danville is much more reflective of the district as a whole. In recent years it has started to see its prospects improve, after a downturn in the 1980s and 1990s, as it has attracted investment and worked to build out human capital. Danville’s vice mayor, J. Lee Vogler, explained to me that the city’s move to institute community policing and outreach for at-risk kids has gone a long way toward the recovery.For a day in Danville, I shadowed Riggleman at events and picked his brain on his policy priorities, state politics, and what motivated him to step onto this path.Virginia has been more or less a blue-leaning state for the past decade, and that has only been buttressed by 2017’s elections. Yet the state’s GOP has responded to this with a combination of identity politics and culture-war populism, epitomized by the Minnesotan Corey Stewart’s carpetbagging candidacy grounded in feigned “southern heritage.” It’s a strategy that’s emboldened many conservatives to skip the senator section of the ballot, or to vote for Kaine as a way to show their opposition. This summer, political strategist Tucker Martin told National Review that Virginia “Republicans need to branch out and create their own brand” if they are to remain competitive in the changing state. Denver Riggleman’s campaign might just be the model for this new brand.Riggleman doesn’t think very highly of angry, rebel-without-a-cause politics. He’s doubly disgusted by the white-supremacist rallies in Charlottesville, as a native of the city and as a veteran of Operation Allied Force, where the U.S. intervened to protect Kosovars from an attempted genocide. As he explained to me, “the loudest seem to think they have a stake in something that doesn’t exist anymore.” He and his wife are Virginia natives, and indeed Mrs. Riggleman’s line goes back to the days of Robert Ely in the 18th century. (Riggleman quips, “I’m sort of a mountain dwarf from Appalachia and I don’t know why she’d want to mix her DNA with mine.”) But perhaps this contrast isn’t so surprising. Last year saw Roy Moore acting like a caricature of a gun enthusiast (waving a gun at the crowd, for instance) and social conservative — and it later became clear that he was a fraud. Corey Stewart, as a midwesterner playing at southerner, feels the need to overcompensate, which an actual Virginian does not. As a result, he does not realize that this approach is frankly out of touch for Virginia voters.\nFocusing on economic growth, deregulation, and constitutional limits, Denver Riggleman sees his approach as catering to the real needs of his constituents. He believes that a better business climate would go a long way toward helping the district succeed, and that cronyism has gone a long way toward creating barriers to entry for would-be business owners. It helps that Riggleman is quite friendly and charming in person. He’s able to express his case for free markets in a language that anyone can understand, drawing on his business experience and connecting it to his audience. In doing so, he avoids the trap of many libertarian-minded candidates, who know policy extremely well but struggle to express it.For his would-be constituents, much of this is practical policy. The fifth district is heavily agricultural, and a farmer told Riggleman, “If we lose H-2A” [temporary agricultural visas] or get any more regulations, we’re screwed.” Riggleman’s support for guest-worker programs puts him at odds with some other populists in the country, but it reflects the needs of the district. Farmers and agricultural businesses complain that the Americans they hire tend to quit within weeks, whereas the migrant workers complete the season before heading home.The Stewart strategy might have some short-term successes, but it is morally ugly, expecting the worst of Virginians and playing to it. This would be undesirable even if it were successful — but it’s not even that. Riggleman’s approach, on the other hand, is resonating. It has found an eager audience among young Republicans. “The thing that stood out to me at the committee was the number of young people there for Denver,” William Pace, mayor of Chatham, tells me. The president dominates the news cycle right now, but where is the next generation of Republicans heading?I drove around the district, striking up conversations to get a feel for how constituents saw this election and their region. Lawn signs say only so much, after all. At Crema & Vine, a local restaurant with some of the best coffee I’ve ever had, the owner Steve DelGiorno told me, “I like Denver.” He’s met Riggleman and likes his focus on economic reform and development. “I moved back to Danville after 30 years. My wife and I are pretty bullish on it.” The recovery, he adds, has “got legs.” The restaurant itself reflects the economic upturn the city has seen recently. It’s housed in a building that had been an auto garage that went out of business in the wake of the recession, and it’s in a neighborhood that was home to 19th-century industrialists. (The first woman to serve in the British Parliament, Lady Astor, was a Danville native.)Can a positive, policy-focused campaign be successful in today’s political environment? I’d like to think that it can. Riggleman put it best; he says, “If I lose, trusting the intelligence of the voter, I can still sleep at night.”NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}