{"id": "March Madness Extends Throughout the Year\t\t\t\t\t\t\tMarch Madness Extends Throughout the Year\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tWe Have a Winner\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Uses and Abuses of Bullpenning\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tClashes of Titans\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tA Conservative’s Guide to the 2018–19 NBA Season\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBaseball’s Crime against Humility\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tKaepernick to Receive Medal from Harvard\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tNike Stock Rebounds from Post-Kaepernick-Campaign Dip\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tNFL Won’t Fine National Anthem Kneelers This Season\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCollege Football: ’Tis the Season\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWho Wrote the Op-Ed?\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tNike Shares Fall Following Announcement of Kaepernick Ad Campaign\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tColin Kaepernick’s Controversial Nike Campaign\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBaseball and Its Worriers\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPresident Trump: The Fairest ‘Authoritarian Dictator’ of Them All\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThere Go the Spurs\t\t\t\t\t\t\t\nUntil last week, it seemed that the Division 1 college-basketball industry could produce nothing more risible than its pieties about cherishing the amateurism of the “student-athletes” who generate, but get mere crumbs of, the industry’s billions. Last week, however, a New York jury, which perhaps had a sense of humor, embraced this novel argument by the federal government: Basketball factories such as Kansas, Louisville, and North Carolina State are actually victims of the operatives — representatives of shoe companies, and actual or aspiring agents — who use unsavory methods to direct “blue chip” recruits to the schools’ lucrative basketball programs.The three men convicted of fraud and conspiracy in the first of at least three similar trials face imprisonment because of this supposed crime: The three schools mentioned above gave athletic scholarships to five elite recruits whose families had received — presumably, but perhaps not really, unbeknownst to the schools — through the three men (one of them a former consultant for Adidas shoe company) payments, one of $90,000, to purchase their help in directing their sons to those schools, which receive much larger payments to advertise, by wearing, Adidas gear. (Nike and Under Armour also compete in the auction for schools’ allegiances.)Might the federal government’s finite law enforcement resources serve more deserving victims? And why is it a federal crime to evade the NCAA’s lackadaisical enforcement of its nonsensical rules by paying families? About schools maintaining (to borrow a phrase from politics) “plausible deniability” about the meat market in tall teenagers, Washington Post columnist Sally Jenkins notes: “Defense attorneys presented text messages between [former Adidas consultant T. J.] Gassnola and Kansas coach Bill Self that showed the coach was well aware of Adidas’s efforts to steer recruits to him, if not the method. Gassnola assured Self that Adidas was ‘here to help’ in getting players for the school, which was finalizing a twelve-year, $191 million sponsorship deal with the sneaker company.” Not bad compensation for Kansas-the-victim.An NBA program announced last month might somewhat diminish college basketball’s stench, which the NBA made worse with its 2005 rule that teams could not sign players younger than 19. This created the “one and done” charade of players sort of attending, say, Kentucky for one season, then turning pro. Elite 18-year-olds will now be able to receive $125,000 for a season in the NBA’s developmental G League, draining some talent from the pipeline sustaining the cartel of college-basketball powerhouses.Perhaps schools should give candor a try, paying their basketball and football players as value-adding employees who create almost all of the $8 billion that college sports generate. Undergraduate music majors are not forbidden to earn money with their talents while in school. Kentucky head coach John Calipari’s salary is $8 million, Duke’s Mike Krzyzewski’s is $9 million, and 44 other head coaches earn more than $2 million, so perhaps something could trickle down to the “student-athletes” who now receive only tuition, room, board, and small cost-of-living stipends. Taylor Branch, writing in The Atlantic in 2011, noted that the NCAA minted the phrase “student-athlete” to deflect the threat of injured athletes making workers’ compensation claims.In a California trial (a ruling is pending), some former athletes challenged the NCAA’s strict price controls on labor as antitrust violations that prevent competitive bidding. Amazingly, the NCAA manages to say with a straight face: “Maintaining amateurism is crucial to preserving an academic environment in which acquiring a quality education is the first priority.” To which journalist Patrick Hruby, writing in the Washington Post, responds: “A 2015 survey found that athletes in the Pac-12 conference spent an average of 50 hours per week on their sports and were often ‘too exhausted to study effectively.’” And: “A University of Georgia assistant men’s basketball coach taught a course, mostly for his players, with a final exam that began by asking: ‘How many goals are there on a basketball court?’”\nThe lesson of this tawdry story is that if you graft a multibillion-dollar entertainment industry onto academic institutions, the discordance will leave the latter soiled and the former indulging in shady practices that serve the pretense that the industry is somehow something other than it is. The sentencing of the three men convicted last week is set for March 5, two weeks before the NCAA basketball tournament, which CBS and Time Warner pay nearly $1 billion a year to televise. It is called March Madness. Actually, the madness is a twelve-month-a-year, every year business.© 2018, Washington Post Writers GroupNR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}