{"id": "Meet Nuclear Escalation with Nuclear Deterrence\t\t\t\t\t\t\tMeet Nuclear Escalation with Nuclear Deterrence\t\t\t\t\t", "paragraph": "National ReviewOver at Foreign Affairs, Elbridge Colby of the Center for a New American Security offers a new nuclear strategy for the U.S. that reflects the changing balance of global power. In keeping with their revisionist designs, Colby warns, Russia and China have both “developed military forces ideally suited to fight and defeat the United States in a future war,” and “modern, mobile nuclear capabilities are a key part of their strategies.” As much as we might want a world in which all major powers swear off the use of nuclear weapons, Russian and Chinese planners are increasingly convinced that there can be such a thing as a limited and controlled nuclear war, and so they are preparing to achieve a nuclear advantage in regional conflicts.And that is why, according to Colby, we need to develop “palatable options for the limited and effective use of nuclear weapons” — to demonstrate to potential rivals that we won’t just fold in the face of the threat of nuclear escalation. To that end, he calls on the U.S. to “develop or adapt a modest number of nuclear weapons and delivery systems that could damage key Russian or Chinese conventional targets, especially those needed for an invasion of the Baltics or Taiwan: entrenched ground forces, maneuver troops, naval flotillas, and invasion fleets. The new weapons would need lower yields than most of those in the current arsenal, which have been optimized to destroy hardened silos sheltering enemy missiles, not to stop conventional forces.” Recognizing that critics might claim his call for improving America’s ability to fight and win a limited nuclear war represents a return to Cold War thinking, Colby reminds us that “Cold War thinking enabled the United States and its allies to deter major aggression for 45 years, even though their conventional forces in Europe were consistently out­numbered.” Not such a bad precedent considering the dangers we face in the decades to come.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}