{"id": "About That ‘Blue Wave’\t\t\t\t\t\t\tAbout That ‘Blue Wave’\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAbrams Campaign Considers Drastic Legal Measure to Force Another Vote\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBroward County Missed Recount Deadline by Two Minutes\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFlorida Dems Gave Out Altered Form to Fix Absentee Ballots Past Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Election’s Lesson for Democrats: Don’t Nominate Hillary Clinton\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tMichael Avenatti Bites the Dust\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tUrban Cowboys\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Blue Wall\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLosing the Suburbs\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tToward a Bigger Coalition\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFlorida Judge Gives Voters Additional Time to Correct Rejected Ballots\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHillary Clinton: If Stacey Abrams ‘Had a Fair Election, She Would Have Already Won’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAnyone but Nancy Pelosi for Speaker\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe GOP’s Orange County Problem\t\t\t\t\t\t\t\nAs we enter the last two weeks of the midterm-election campaigns, the Democratic claims of a blue wave have given way to stark resignation that President Trump will add from two to five senators to the existing slender Republican majority, and that the House of Representatives will be a squeaker. This is the same trajectory that afflicted the Democratic promises of “scorched earth” and total obstruction nearly two years ago, and the following year of incessant repetitions that impeachment was imminent, and that collusion with Russia and the Trump campaign probable.The same happened to the fatuous conjuration that we had a “constitutional crisis” because the president was clearly mentally incompetent in the terms of the 25th Amendment. Only the Democrats’ hammerlock on the traditional national political media and its uniform hostility to Trump has allowed the Democrats to remain in contention for a partially successful result in November. The justified exhilaration of breaking the nonwhite barrier in electing an African-American president in 2008 was tarnished by the failure of President Obama’s high-tax, highly regulated economic policy, preaching resignation to sluggish economic growth; and by the failure of his pacifistic, semi-isolationist foreign policy. And apart from that evanescent post-electoral exhilaration, the Democrats have had no policy since the bloom came off the Clinton rose in the Lewinsky affair, except to proclaim from the rooftops that they are neither George W. Bush nor Donald Trump.I will not descend to the guilt by association that the Democrats have been wallowing in these many years: Obama implied that anyone who didn’t like his Iran nuclear giveaway wanted to go to war, and that any reservation about political correctness was a smokescreen for racism, homophobia, misogyny, miscellaneous bigotry, and what Kafka called “nameless crimes.” It is not fair to say that the Democrats as a party foment violence and incivility as a tactic. However, it is a reasonable observation that almost all those who incite and commit acts of political incivility prefer the Democrats to the Republicans and are generally engaged in attacking and harassing Republicans and not Democrats. From the lunatic who almost killed Republican congressman Scalise to the obnoxious idiots who heckled Henry Kissinger at New York University last week (41 years after he retired from government) and tried to disrupt the Kavanaugh hearings, to spontaneous pests who beset White House press secretary Sarah Huckabee Sanders, Homeland Security secretary Kirstjen Nielsen, and Senate majority leader Mitch McConnell as they attempted to eat their dinners in restaurants in the past couple of months, all the forces of incivility are anti-Republican. As Democrats are never bothered in this way (other than one outburst of intra-Democratic shouting at a Nancy Pelosi constituents’ meeting some months ago), it may safely be inferred that the partisans of the Democrats are the authors of all these infantile outrages. Hillary Clinton said as much last week when she unctuously assured viewers that the way to “restore civility” is to elect Democratic congressional majorities.Mrs. Clinton has been so thoroughly exposed as an epochal dirty trickster over the Steele dossier and Donna Brazile’s accusations of seizing the Democratic party’s funds, she no longer has any appreciable influence over public opinion, but she probably spoke the truth when she effectively said that if the country gives the Congress back to the Democrats for the first time since 2010, these appalling demonstrations and disruptions of public meetings will cease. The ineffable Congresswoman Maxine Waters, who has not seen a race riot she didn’t like since the Watts summer festivals of violence in Los Angeles 50 years ago, has been almost self-muzzled after her calls for violence were so frequent and explicit that they embarrassed her party. Senator Cory Booker (D., N.J.), on the heels of his puerile invocation of the Hollywood version of the insurgent slave Spartacus, called upon his fellow Democrats to “get in the faces of Republicans.” The thought of the senator himself doing so, motor-mouthed public self-analysand as he is, must cause any normally social person profound disconcertion. Months of silence from the Democrats followed the Antifa ninja-vandals and arsonists’ antics preventing the appearance of invited conservative speakers at Berkeley and disrupting a licensed pro-Trump parade in Portland, Ore., last year. Even the Charlottesville claim that Antifa and the Black Lives Matter enthusiasts who killed eight policemen in Dallas and Baton Rouge were clearly preferable to their Nazi and Klansmen opponents in the disgraceful riots of August 2017 was nonsense; all these groups are despicable.Whatever the polls or the anti-Trump media say, the country knows that unless the local candidate is a person of outstanding merit, and there are many in the Democratic party, a vote for the Democrats is an affirmation of sociopathic conduct, unlimited illegal immigration, failed public policy, the resumption of a flat-lined economy, and a diffident and ineffectual pacifism in the world, where allies lapse and vacuums are filled by terrorists; and China steps confidently toward the headship of the world’s nations. The animus against Trump is strong and tenacious, and not entirely difficult to understand; his style is that of the traditional Ugly American, the braggart and the rich bombast; but it is not the style of a yob or even an Archie Bunker. He is evidently an educated man and without a trace of racial or religious or gender bias. And, as I have astonished many by pointing out, he achieved more before he was inaugurated president than any previous holders of his great office except Washington, Jefferson, Madison, Grant, and Eisenhower. Each of these except Madison was a world historic figure before being nominated, and Madison is, with Moses, Hammurabi, Justinian, and Napoleon, among the world’s greatest law-givers.Those repelled by Trump will not soften until he has retired as president, as with those who hated Franklin D. Roosevelt for spurious ideological or mythic reasons (such as that he gave Eastern Europe to Stalin); or those who disparaged Reagan as “an amiable dunce,” in the words of Clark Clifford, the ageless and elegant Washington fixer and an unsuccessful defense secretary. It would be at least premature, and perhaps wildly optimistic, to compare Trump to FDR and Reagan, the two greatest presidents since Lincoln, but as the voters proceed to the polls in two weeks, they will have to reflect on the indisputable fact of President Trump’s successes. He took a sluggish economy where GDP growth per capita had declined from 4.5 percent under President Reagan to 1 percent under President Obama, under whom federal debt increased by 233 percent in eight years. He has focused attention on the unutterable scandal of the steady influx of millions of illiterate peasants, including many violent criminals, across the southern border, and is the enemy of the permissiveness of “sanctuary” and the prohibition of constitutionally mandated census-takers to ask respondents’ citizenship. Trump has made himself the sole possible agent of enforcement of nuclear nonproliferation by his actions to prevent North Korea and Iran from becoming nuclear military powers, a status that his predecessors effectively conceded to them.Obama said 2 percent economic growth is the “new normal,” as poverty, food-stamp use, and violence increased. Trump has created a full-employment economy and generated the first increases in purchasing power and job security in this millennium for the lower third of Roosevelt’s “forgotten man at the bottom of the economic pyramid.” I don’t believe that most pollsters have adjusted their techniques to allow for a higher voting turnout from what used to be the white working class, or to allow for the reluctance of many Trump voters to identify themselves. On the day, the people will endorse the administration. This president is too jangling and confrontational to sweep the country as an elegant and mellifluous chief, serenely exuding confidence and magnanimity, as Roosevelt and Reagan, and to a limited degree, Kennedy and Nixon, could. But after what he has achieved in the past 19 months, the country will not desert this president, as Lincoln said, “in the middle of the stream.”NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}