{"id": "Senator Booker’s Terrible Tax Proposal\t\t\t\t\t\t\tSenator Booker’s Terrible Tax Proposal\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Case for the Wage Subsidy\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tMaking Acosta a Federal Case\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCongress Finds Bipartisanship in Farm Welfare\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAgainst the ‘Coercive Elimination of Dissent’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump’s Not Populist Enough\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tRick Scott’s Lead Increases after Recount\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPelosi Vows She’ll Be Speaker Despite New Potential Challenger\t\t\t\t\t\t\t\nSenator Cory Booker (D., N.J.) has a problem: a reputation for moderation that may hinder his chances in the Democratic presidential primaries. He is making frantic efforts to explode that old reputation. One day he rails against Jeff Sessions, with whom he used to co-sponsor legislation, as an enemy of civil rights. Another he insists, contrary to evidence, that he is breaking Senate rules to fight Brett Kavanaugh’s confirmation.And now he’s proposing a sweeping program of wealth redistribution, one that would raise estate taxes to their highest level in decades in order to put the money in accounts for children from households that make up to five times the poverty level. (The higher the household income, the lower the yearly deposit.) Booker is touting this idea as a way of boosting saving — but on a national level, it can only reduce saving, since it diminishes the incentive to save.If you’re rich, the estate tax is a reason to invest in economically unproductive estate planning or to spend the money rather than hand it on. Booker’s 65 percent rate — a significantly higher rate, by the way, than any advanced country levies — would be a much stronger reason to do either than today’s 40 percent rate. (The effective rate would be even higher than 65 percent because of other changes Booker proposes.) Because that rate would apply only to the very largest estates — for married couples, it would kick in at $100 million — it would affect the behavior of a small slice of the population, it is true; but it is the slice that does a disproportionate amount of the country’s saving. A lower rate of national saving will in the long run mean a smaller economy, with lower wages, than we would otherwise have had.The estate tax is also widely disliked, much to the dismay of progressives. A 2017 poll found that 65 percent of the public wants to abolish the estate tax — and 76 percent wants to abolish it if it’s labeled the “death tax.” But then Booker isn’t playing to most Americans right now, just to left-wingers who hold disproportionate sway in the Democratic party. If only there were a way to redistribute their political influence.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}