{"id": "Rosenstein Defends the Mueller Probe\t\t\t\t\t\t\tRosenstein Defends the Mueller Probe\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 17\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHow D.C. Is ‘Getting Guns Off the Street’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tOn Criminal Justice, Trump Embraces the Left’s Racism Rhetoric\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump Appointee Judge Rules for CNN. Good.\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tJudge Orders White House to Return Acosta’s Press Pass\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 16\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Case for the Wage Subsidy\t\t\t\t\t\t\t\nWell, did you think Rod Rosenstein was going to say, “You got me. The Mueller probe was inappropriate and politicized?”No, you didn’t. And the deputy attorney general did not disappoint. In an interview with the Wall Street Journal on Wednesday, Rosenstein defended the investigation as “appropriate and independent.”The Journal’s Sadie Gurman observes that this assessment contrasts sharply with President Trump’s description of the investigation as “rigged” and a “witch hunt.” In an obvious sense, this is not much of a point. Not only did Rosenstein appoint Robert Mueller in May 2017; the special counsel answers to Rosenstein in the Justice Department’s chain of command. If the probe is a rigged witch hunt, then Rosenstein is the ultimate culprit. Who would expect him to cop to such a thing even if it were true?Still, there is also a sense in which Rosenstein’s defense of the investigation resonates. For all of the president’s Twitter tantrums about how the investigation is supposedly “rigged,” Mueller has never alleged that the Trump campaign was complicit in Russia’s election meddling.This is not for lack of thoroughness on the prosecutor’s part. Mueller has brought two sweeping indictments against Russian operatives. Rosenstein made these charges a point of emphasis in the interview. It is noteworthy, then, that these narrative “speaking indictments” appear to preclude the possibility of a conspiratorial relationship between the Kremlin and the Trump campaign. They indicate that Russia was conducting influence operations before Trump entered the campaign, that it orchestrated some against Trump, and that it wanted deniability.\nClearly, Rosenstein has been fixed on something often ignored by the president: Trump would benefit from being exonerated after a searching investigation by Mueller.Of course, the fact that things may turn out that way does not mean that was the game plan all along.Rosenstein brought Mueller in to help Rosenstein, not Trump. The deputy attorney general was under withering attack by Democrats after the firing of FBI director James Comey and the administration’s multiple, conflicting explanations for it. He appointed Mueller at the end of a frenetic week in which, reportedly distraught, he discussed the possibility of covertly recording Trump at meetings to demonstrate the latter’s instability. This would be a prelude to invoking the 25th Amendment, the Constitution’s vehicle for sidelining a president who is non compos mentis.The Mueller appointment — after Rosenstein considered naming former Obama deputy attorney general James Cole — was designed to signal to the Washington establishment that Rosenstein (confirmed 94–6, thanks to overwhelming Democratic support in the Senate) was still on the team. The deputy attorney general sent the White House into orbit, saddling the president with a special counsel despite the lack of evidence that he’d committed a crime; and choosing for the role a Beltway doyenne who, Rosenstein assured Democrats, would have free rein to pursue an aggressive investigation.For Trump’s part, moreover, it would be foolish to believe that the president’s drumbeat against the investigation means he fails to grasp the potential benefit of being cleared by Mueller. He surely gets it. Yet, unlike Rosenstein, Trump has had to live with the challenges of governing under a cloud of suspicion; he may well believe these costs have outweighed any benefit he’d get from being cleared for something there was never much evidence he did. Plus, the president is nothing if not shrewd. There are political advantages in ripping the probe. He does not forfeit the upside of exoneration by stressing that his campaign and administration have been targeted by an investigation rife with leaks and other irregularities. Even if the riled-up Trump base believes the probe is a witch hunt, it would still credit him for being cleared. So would many other Americans, thanks to Mueller’s reputation for probity.“At the end of the day,” Rosenstein told the Journal, “the public will have confidence that the cases we brought were warranted by the evidence and that it was an appropriate use of resources.” He was talking mainly about Mueller’s aforementioned indictments against Russian operatives. Indeed, Rosenstein maintains — in the Journal’s words — that “the investigation has already revealed a widespread effort by Russians to interfere in the 2016 presidential election.”To be charitable, these are exaggerations. The widespread effort by Russians to interfere in the election was the subject of intelligence reporting long before Mueller came on the scene. His investigation did not reveal it, nor were his indictments necessary to document it.In fact, the indictments are more in the nature of publicity stunts than charging instruments. Foreign powers are subjected to counterintelligence investigations, not criminal probes, in part because they are essentially immune from prosecution. Mueller’s indictments against Russians enable Rosenstein and the special counsel’s other cheerleaders to argue that the dozens of people charged show that the special-counsel appointment was — as Rosenstein claims — “appropriate and independent.”But they don’t. An indictment is just an allegation; it does not prove anything. More to the point, everyone — very much including Rosenstein and Mueller — is well aware that Vladimir Putin was never, ever going to turn his operatives over to the American justice system for trial. As I’ve pointed out before, there are another 143 million people in Russia, and if Mueller were to charge every one of them, he’d have very impressive indictment statistics but he won’t have proved anything, and he won’t have come close to establishing that anyone in America, let alone the president of the United States, colluded in election interference. Furthermore, even if we overlook the fact that it is pointless to file indictments against foreign adversaries (rather than address their provocations by other tools of foreign policy), there is no reason the indictments against Russians could not have been filed by the Justice Department without the appointment of a special counsel — a point elucidated by the transfer of Mueller’s indictments to Justice Department components.That said, a prosecutor’s job is to see that justice is done, which means filing charges only if charges are warranted. If a lack of evidence that the president is guilty of misconduct causes Mueller to recommend that the case be closed, that is not failure. It is what is supposed to happen. And if that is in fact done by Mueller, it will have more credibility than if it were done by Trump’s own Justice Department appointees.Interestingly, Gurman in the Journal described her interview with Rosenstein as “expansive,” yet there appears to have been scant discussion of the myriad reasons why the deputy AG’s tenure has been fraught with controversy. Rosenstein refused to discuss well-sourced reports that he suggested covertly recording the president. It is not apparent whether he was asked about proposing that the 25th Amendment be invoked against Trump. Nor is there indication that Rosenstein was pressed on such flashpoints as whether he actually read the FISA surveillance warrant against a former Trump campaign official that he approved in June 2017. (The warrant expressly said that the FBI believed that Trump campaign officials were likely complicit in Russia’s election interference.) And was Rosenstein asked about the Justice Department’s stonewalling of congressional inquiries into apparent investigative irregularities? We don’t know.If Democrats take over the House after the November midterm elections, you can bet there will be a newfound media respect for congressional grilling of the Trump Justice Department. Meantime, a reader who had not been following the storms engulfing Rod Rosenstein’s tenure as deputy attorney general would come away come away from the Journal’s interview wondering why there is so much fuss about such a dedicated, unassuming public servant.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}