{"id": "Frankenstein’s Monster, Frightening Us Still   \t\t\t\t\t\t\tFrankenstein’s Monster, Frightening Us Still   \t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBelieve in Creed II \n\n\n\t\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Lessons of the Asia Bibi Case\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAgainst the ‘Coercive Elimination of Dissent’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\nI have no system for selecting exhibitions to review. Generally, my choices are governed by where I’m visiting and the museums and curators whose work I find solid and compelling. That limits my options, since so many shows are stolid, tired twaddle. I look for topics that seem to me relevant to readers. And who but a luddite can argue that technology is ever relevant? We’re living in a new age of robotics, genome editing, and body regeneration, for starters. Even among luddites living in caves, who can resist a story about forbidden knowledge, magic, playing God, and the burdens of responsibility?It’s the 200th anniversary of Mary Shelley’s 1818 novel Frankenstein. The Morgan Library observes the occasion with a very good show looking at Shelley (1797–1851), her milieu, and how the story of her “Creature” and his maker have stayed meaningful from the book’s early best-selling days to its stage and movie versions to now. It’s Alive: Frankenstein at 200 is one more show establishing the Morgan Library as New York’s best storyteller.The show first introduces us to Shelley and then places her in her time. We categorize it as the Enlightenment, but that doesn’t begin to describe how close to the bleeding edge of science this young woman lived. Her father, the journalist William Godwin, espoused an unusual philosophy, strands of which informed anarchism, libertarianism, socialism, and utopianism. Populating his circle were the early chemistry genius Humphry Davy, Erastus Darwin (Charles’s grandfather and proto-evolutionist), and James Watt, whose perfected steam engine accelerated what we call the Industrial Revolution. They came and went in a home setting where Mary, naturally intelligent and observant, was left as a human sponge.Were her father less of a free-thinking, libertine aesthete, his hellcat daughter would have given him nightmares. Having already dabbled in laudanum, motherless and rudderless, and a high-school dropout, the 16-year-old eloped with the married poet, Percy Bysshe Shelley. Percy was as much a science freak as he was a poet, and Mary Godwin’s immersion in the latest science news continued. She was already a technology geek. The show chronicles her interests in a nice selection of new scientific devices from her time, among them a set of surgical tools suitable for sawing a skull, a just-invented battery, and equipment delivering an electric shock. Frankenstein’s basic infrastructure was, for her, hanging around the house.Shelley wrote the book on a dare by Lord Byron, with whom she and Percy frolicked after they ran away together. She looked for a storyline “to curdle the blood, and quicken the beatings of the heart.” She found it. Though a modest seller, the book had legs. By the 1830s, at least 15 plays were based on it. It’s surprisingly good. It’s also visual. The Creature (unlike his creator, Victor Frankenstein) is never named and, aside from being eight feet tall and unbearably ugly, Shelley doesn’t give us much detail. The show celebrates the imagination of actors, movie makers, set designers, wig makers, makeup artists, and advertisers in taking up the challenge that the void deliberately invites. Over 200 years, they’ve made the characters and places “come alive.”It’s great fun for the show’s visitors and irresistible fun for the curators. The bride’s wig made for Elsa Lanchester in The Bride of Frankenstein, the 1935 film, is in the show. It’s sculpture more than anything else and appropriately called “Nefertiti Electrified.” The wig is in the show as well as generous clips from the film versions, one of which, in 1910, was produced by Thomas Edison, no piker in the invention department.The show makes an early choice. Frankenstein is part of what we call the Gothic tradition consisting of visual art and literature that traffics in terror, morbidity, and the supernatural. The Nightmare, the great painting by Henry Fuseli from 1781, introduces the show. There’s no better way to define the style than this scene of a sleeping woman beset by a bad dream, visualized as a grotesque imp hovering over her.These artists and writers sometimes worked in a tongue-in-cheek style. Some, like Frankenstein and my own favorite, Matthew Lewis’s The Monk from 1796, are disturbing, with no leavening. Other artists, such as James Gillray and the irrepressible Thomas Rowlandson, added a touch of glee to boneyard dances and nightmares-in-bed. I don’t think anyone can resist the campy elements of Frankenstein. The 1931 James Whale film, both serious and unserious, opened the floodgates to treatments of the story slathered with irony and slapstick. The Morgan show tends to foreground this strand of the novel’s life in our time. It ends with a very good look at Frankenstein in comic books and the graphic novel (a form that has revived the great art of book illustration). The classic film that most of us know today is the 1974 version, Young Frankenstein, a silly bit of lowdown fizz and still funny. Kenneth Branagh directed a serious, faithful version of the novel in 1994. Even The Terminator wrestled with a Frankenstein-type character.The show is what it is, and that’s the direction it takes. It’s beautifully designed, and the interpretation is perfect. The Morgan Library’s curators are captivating storytellers. Every show, and every label, has the stamp of a strong point of view expressed with conviction and flair. There is nothing antiseptic or bland. This is both unusual and commendable. Too many museums annihilate a vinegary point of view, avoid humor like the plague, and inflict on us boring, word-counted interpretations with enough jargon to become as opaque as they are boring.Having a point of view, of course, leaves points unweighed and unconsidered. The show’s first section ends with the Creature’s self-education. Frankenstein builds him in secret, stitching together human and animal parts. He zaps the inert blob — the moment is covered cryptically in the novel in one sentence — and then “it’s alive,” which nobody in the book ever says. Frankenstein sees his Creature stir, he’s chagrined and repelled, and he flees. So much for good parenting.After that, their interactions are few, brief, and pregnant with angst. The monster becomes a self-made, um, Creature, but not someone who would win a shout-out from the local Rotary Club. This isn’t a pull-yourself-up-by-your-bootstraps story. What the Creature learns from watching and listening is how abandoned he is, how hideous, and low lonely. Fittingly for a library, the show focuses on the Creature’s reading habits. He teaches himself how to read and speak. Unfortunately for his maker, Victor Frankenstein, the Creature didn’t read Dr. Seuss. He read Paradise Lost, so he learned the ways of Satan. He also read Plutarch’s Parallel Lives and The Sorrows of Young Werther, by Goethe. He had enough raw material in his head to get into serious trouble.\nThe show makes a good start in probing what the Creature learned from his core curriculum. From Werther, the Creature learned the despondency of adolescence. From Plutarch he learned to admire the heroes of the past, their full-blooded loves and quests, their ascent to the zenith of human achievement, as well as their miserable failures and falls. In Paradise Lost, he found only parallels to the first man, Adam, and no intersections. Like Adam, the Creature came to the world wholly isolated, unlinked to any other being in existence. But Adam was perfect, loved by God, and tenderly stewarded, whereas, he says, “I was wretched, helpless, and alone.” From the fallen angel, Satan, he drew “the bitter gall of envy.”Knowledge is a dangerous thing when it’s unfiltered, whether by social bonds, common sense, self-respect, humility, or perspective. The Creature has a sense of justice, but it’s warped. Shelley suggests that’s innate to humanity, as are reason and empathy, inchoate as they might be. Without cultivation by kindness, example, and love, though, they turn perverted. Justice becomes vengeance, reason aims at hurt, and empathy becomes scorn. “Why did I live,” he more demands than asks. To hate and to punish, it turns out. “I felt no sentiment but that of hatred.  . . . I am malicious because I am miserable.” As a Jet laments to Officer Krumpke, “I’m depraved because I’m deprived.”And then there is Frankenstein. In most retellings of the story, though a supporting actor, he is the real villain. First of all, in the novel he’s not doctor. He never gets that far. He’s a snotty, know-it-all graduate student, as much a piece of work as the Creature. He strikes me as very modern. He lives in a protective bubble, a precious, spoiled mama’s boy; he also has a solicitous, doting father who looks at his eldest son as his marvel. Frankenstein puts on a good act. He’s intense but smooth and polished, a good and poised talker and persuader. He impresses people who meet him as wise and kind. He’s a cad, too, and that’s putting it kindly. He wants not only to be successful but brilliantly successful and famous. He has a sick, overweening sense of his own importance. Physically, the Creature might be a monster, but psychologically, so is Frankenstein.Once he makes his Creature, he cares not a whit for his personal well-being or development. He’s repelled by the Creature’s ugliness, from the moment the “dull, yellowed eye of the creature opened,” his limbs awkwardly twitching, his breathing hard and convulsive. What did he expect, Fred Astaire?Frankenstein is precocious and inventive, but he’s a grave robber, too. He works furtively. He kills animals and stitches their organs and body parts wily-nilly with those of humans. At every pressure point, he flees the scene. As the body count mounts, Frankenstein spends months in listless indolence. He allows technology to master him. His ambition and hubris leave a train of dead. The Creature kills his young brother, his best friend, and his wife. An innocent family servant goes to the gallows for his brother’s murder while Frankenstein refuses to divulge the truth because it would acknowledge his responsibility.Ultimately, the Creature and Frankenstein experience a role reversal. The Creature demands that Frankenstein make him a woman, a companion to assuage his loneliness. Once a slave to Frankenstein’s warped ambitions, the Creature gets the upper hand. “You are my Creator, but I am your Master,” he observes. “Obey me.”It’s a good story and a good exhibition. It might end with comic books, but the novel itself never loses its frisson. “Now I know how it feels to be God,” Frankenstein shouts as the Creature begins to stir. It’s the line that movie censors in 1931 were most likely to try to cut. They saw it as blasphemous. Scientists involved in atomic-weapon development often called it Frankenstein’s baby bomb. Nazi doctors and their human experiments recalled Frankenstein’s hubris. Hal from 2001: A Space Odyssey comes directly from Frankenstein’s unintended-consequences book of recipes. Artificial intelligence might be the next Creature. Will it perfect us or destroy us? Not many shows put that question on the agenda. NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}