{"id": "Heitkamp Campaign in Trouble as Election Day Approaches\t\t\t\t\t\t\tHeitkamp Campaign in Trouble as Election Day Approaches\t\t\t\t\t", "paragraph": "National ReviewIt’s been a bad week for Heidi Heitkamp.Last night, the North Dakota Democrat squared off against Republican congressman Kevin Cramer in a debate, as she fights to hold on to her Senate seat. With less than three weeks to go until the election, Heitkamp already appeared to be at a disadvantage; most recent polls show Cramer with a double-digit lead.But that wasn’t all she had to contend with. Heitkamp also had to find a way to use the hour-long debate to recoup her losses from earlier this week, when news broke that her campaign had identified a number of constituents as victims of sexual assault without their consent. The names of these women were included as signatories of an open letter to Cramer, which the Heitkamp campaign ran as an advertisement.“The ad is about non-consent. Why would they just go ahead and take our names without our consent? It’s the same thing, just different case,” one of the women told National Review this week.It’s a great question, and it’s one that Heitkamp was forced to address during yesterday evening’s debate. When the candidates were allotted two minutes for opening remarks, the Democratic senator used almost her entire time to apologize for her campaign’s error.“Unfortunately, this week I not only disappointed many in North Dakota, I disappointed myself,” Heitkamp said. “My campaign wrongly listed many names in a campaign ad that were not authorized and not appropriate. This was a terrible mistake.”Given how much negative coverage her campaign has received for the misstep, using her opening statement to apologize was the right tactical move — not to mention the right thing to do. But it undoubtedly was not how the flailing Democratic incumbent — running for reelection in a state that the sitting Republican president won by nearly 36 points — had hoped to start out the last debate of the election cycle against a popular, at-large congressman.NR's afternoon roundup of the day's best commentary & must-read analysis.Later in the debate, Heitkamp defended her vote against the confirmation of Brett Kavanaugh to the Supreme Court, despite the fact that a majority of North Dakotans said they wanted their senators to confirm him. The senator acknowledged that her “no” vote contradicted her constituents but said it’s more important for a politician to “exercise the judgment God gave you” than to consistently represent her voters’ wishes. And after Cramer said that Senate Democrats had turned the fight over Kavanaugh’s confirmation into a spectacle, Heitkamp insisted that there was “equal blame to go around.”Today, the Heitkamp campaign is under fire again, this time for an advertisement apologizing to the women named in the previous ad. According to reports, the ad may have lacked the legally required disclaimer about having been paid for by a political-action committee. The newspaper that ran the ad says it received the payment from the Heitkamp campaign committee — which means the ad appears to be in violation of FEC guidelines. Heitkamp’s campaign has not responded to press inquiries on the subject.This year’s race already promised to be a bitter fight for Heitkamp. She was first elected to the Senate in 2012 by a margin of just 3,000 votes, and this is the first time she’s running for office with a legislative record, which makes it more difficult to present herself as being in line with North Dakota’s conservative voters. Her campaign’s blunders this week certainly haven’t helped.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}