{"id": "A Heart Stretched for Love\t\t\t\t\t\t\tA Heart Stretched for Love\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBelieve in Creed II \n\n\n\t\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Lessons of the Asia Bibi Case\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAgainst the ‘Coercive Elimination of Dissent’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\nWashington, D.C. — “I shouldn’t be getting this award — my kids should be getting this award,” Delilah Rene Luke said as she was being inducted in the National Council for Adoption’s Adoption Hall of Fame.You may know the name Delilah from radio — she is the self-described “Queen of Sappy Love Songs,” with some 9 million listeners. She’s also the mother of 13 children, ten of whom are adopted. As she tells the story, she intended on adopting only one child — “maybe two.” But then she started hearing horror stories about what happens to children when they are stuck in foster care. Knowing that there is a shortage of newborns for the couples who want to adopt, she wanted to adopt a child “who otherwise would not have a forever family.”“My kids should be getting this award because they went through hell and they survived,” she explained. “They survived the foster-care system. My kids from Africa survived situations you guys wouldn’t even believe if I told you. They survived. Not only that, they are awesome people, wonderful human beings — much better than I am. If I had gone through what they went through, I would not be kind, I would not be loving.”Her adoption story begins when she and her husband got licensed and were matched up with a little boy and arranged to take him and his siblings camping. In the middle of the night, his younger brother “reached his little hand” from across his sleeping bag and asked Delilah, “I was just wondering, could I call you mom, too, since I don’t have a mom?”Both those boys, nine and eleven, had been in foster care for more than five years — the eleven-year-old with eleven placements, the nine-year-old, seven. “I went from being a mom of two to being a mom of five in a six-month span.”\n“For some reason, our governmental systems think that it is better to leave children languishing in foster care so that the birth parent can have opportunity after opportunity after opportunity after opportunity to abuse them and break their hearts while they are moved again and again and again.” That first eleven-year-old boy she adopted had had eleven placements during his foster-care time. A ten-year-old child had had nine placements, the last in a mental-health facility, “because she had been sodomized by her foster brother, the foster mother’s oldest son.” Charges were never filed. “Why? Oh, because a year before she had been sexually abused in a foster-care setting and they didn’t want to put her through the trauma of another court case.”“How is that okay?” was Delilah’s rallying cry to post-election leaders in Washington and across the country.This is tough stuff to hear. And it doesn’t take away from the selflessness of adoptive parents who realize they are not in the best position to care for their children; it doesn’t lessen the generosity of foster families who make room in their homes knowing their own hearts will be broken when the children into whom they pour their love are moved to a forever family – whether their birth family or another. Saying it on Capitol Hill is important. Present were some key administration officials, congressional staff, and activists. One of the “Friend of Adoption” awardees was the Democratic mayor of the District of Columbia, Muriel Bowser, who had just won reelection; she’s the single adoptive mother of Miranda.Delilah was especially passionate talking about the almost 20,000 children who aged out of foster care in the United States last year. She pointed out that most of them are likely to wind up in jail before they are 25 years old.“How many of you have 18-, 19-, 20-year-olds right now?” she asked those gathered. “Are they capable of navigating life on their own? Without health-care insurance? Without a place to live? Without a life plan? Without a mom to call when they just got in a fender bender? How is that okay?”“We have to change things” in “the most prosperous place in the world.” She pointed to the dramatic drop in international adoptions in recent years. Her message is that we can do better.The National Council for Adoption exists “to ensure that more children are adopted from foster care, that women facing unintended pregnancy receive comprehensive information on the positive option of adoption, and that intercountry adoption remains a viable, ethical option for building families.” Its Hall of Fame includes Democrats and Republicans, sports stars and Dave Thomas, founder of Wendy’s.“We have to speak up. . . . We don’t have enough foster homes.” Delilah described the hotel where children as young as ten years old in foster care “are stuck” — her SWAT-police-officer son patrols there nightly in Washington State. “The parking lot is shared with a business called Lover’s Package,” which sells “sex toys.” “Would you want your ten-year-old or grandchild spending a night alone in a hotel that shares a parking lot with Lover’s Package?”Earlier in the week, in an opinion piece, one adoptive mother expressed her regret that she had adopted two girls from China, because she’s dismayed with life under President Trump. We need more, not fewer foster families stepping up to the plate, and more pregnant women and families considering adoption. So many of us have more power than we realize. The clock is ticking for children in foster care, for frightened pregnant women who feel as if there’s no one who will help them. Our feelings about the state of the world aside, they need families, they need the kind of radical hospitality that can transform lives.Delilah’s Liberian daughter Blessing, once “beaten beyond recognition” as a three-year-old, is now her class president. There are children alive today who need help, birth mothers who need an out. They deserve an opportunity for a family and some semblance of stability. Our country may just need their lives and resilience. We can’t let them continue to suffer. We can’t let them be unrealized gifts.This column is based on one available through Andrews McMeel Universal’s Newspaper Enterprise Association.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}