{"id": "It’s Time to Calm Down about the Caravan\t\t\t\t\t\t\tIt’s Time to Calm Down about the Caravan\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 17\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHow D.C. Is ‘Getting Guns Off the Street’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tOn Criminal Justice, Trump Embraces the Left’s Racism Rhetoric\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBetsy DeVos Strikes a Blow for the Constitution\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump Appointee Judge Rules for CNN. Good.\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tJudge Orders White House to Return Acosta’s Press Pass\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 16\t\t\t\t\t\t\t\nIf you believe that America is and should remain a nation of laws and borders — and if you understand the logistical and physical challenges of walking 1,000 miles through Mexico — there is a relatively simple, firm way to respond to migrant caravans.To the migrants, the message is simple. The United States will secure its border and enforce its immigration laws. In accordance with those laws, it will summarily deport illegal entrants and interpret its asylum statutes in accordance with their meaning and purpose. If you do complete the journey, you will not be released into the American interior but instead held at the border. Rather than risk a fruitless journey, it is better to turn back now.To Americans, the message is equally clear. There is no cause for alarm. To the extent that members of the migrant caravan do complete their trek through Mexico, they will not be permitted to storm border crossings, and we have sufficient resources to secure our border and enforce our laws. We will apply those laws fairly and treat migrants humanely, but we will apply the law.In other words, we can handle this. The migrant caravan is not an emergency. In fact, unless and until it gets hundreds of miles closer (while still retaining its size), there’s not even all that much cause for concern. Even if it arrives in some strength, there is no way for a group that size to sneak across the border, and the most powerful nation in the world has more than enough resources to meet the migrants when they attempt to cross, detain them, and begin the necessary legal proceedings.It would be a challenge, but (again) not an emergency. And as the caravan marches north — shedding people along the way — the president (and his allies) should be able to make a calm, compelling argument for national borders and the rule of law.Or they could publicly panic.\nHonestly, it’s hard to think of a response less measured and more effective at undermining moderate support for immigration restrictions than the reaction of the president and key allies. The president’s tweets have conveyed extraordinary alarm. Here are some selected entries:Sadly, it looks like Mexico’s Police and Military are unable to stop the Caravan heading to the Southern Border of the United States. Criminals and unknown Middle Easterners are mixed in. I have alerted Border Patrol and Military that this is a National Emergy. Must change laws!— Donald J. Trump (@realDonaldTrump) October 22, 2018Many Gang Members and some very bad people are mixed into the Caravan heading to our Southern Border. Please go back, you will not be admitted into the United States unless you go through the legal process. This is an invasion of our Country and our Military is waiting for you!— Donald J. Trump (@realDonaldTrump) October 29, 2018Then, just yesterday alone, on Fox News and Fox Business, guests raised truly absurd claims about the diseases the migrants might bring to the U.S., including leprosy, a polio-like disease, and smallpox. In case you were wondering, smallpox has been eradicated for decades, and the last known smallpox death was in 1978.Just now a Fox News guest says the migrants may have \"leprosy\" and warns that \"they're gonna infect our people in the United States\" pic.twitter.com/uflfjVJbc2— Andrew Lawrence (@ndrew_lawrence) October 29, 2018Lou Dobbs' guest blames \"the continued invasion of this country\" by immigrants for \"diseases spreading across the country that are causing polio-like paralysis of our children\" pic.twitter.com/DM9a1sKNXX— Brendan Karet 🚮 (@bad_takes) October 30, 2018And now the Pentagon is planning to send thousands of troops to the border, a military buildup that may soon match or even exceed American deployments to Iraq.Moreover, it may well be an extraordinary waste of resources. Trump is creating the impression that the Army will protect America’s borders, but it doesn’t have the legal authority to enforce American law. The Posse Comitatus Act prohibits the use of the military in a law-enforcement role. Consequently, the troops will act not — as Trump describes in his tweet — as a military force responding to “invaders” but instead as mere logistical support for conventional federal law enforcement.As a result of this rhetoric and the dramatic military deployment, we have Americans who are convinced that our border crossings are about to stormed by “invaders” who carry disease and harbor criminals (and possibly terrorists). Conversely, we have another set of Americans who are now more able to caricature the restrictionist position on immigration as driven by hysterical fear — and not just by referring to random right-wing firebrands but by quoting the president of United States and multiple guests on his adored television network.Moreover, the president’s words actually fuel the caravan and empower left-wing immigration activists. Absent his unrelenting attention, would the caravan be swarming with reporters? Absent his unrelenting attention, would it be drawing the eyes of the world?Yet that’s when the president’s defenders argue that he’s crazy like a fox. He’s baited the Left, you see, into staking out an extreme position on immigration and on backing potential border chaos that moderate Americans would reject. And they have a point. It is true that the laws of negative polarization are working their magic. Extreme rhetoric is all too often countered by extreme rhetoric on the other side. Witness former Republican strategist Steve Schmidt liken the caravan to the “Reichstag fire” (to which MSNBC’s Chris Hayes immediately replies, “Yeah.”).On the Chris Hayes Show, Steve Schmidt unloaded on the \"right-wing propaganda industry\" radicalizing evil losers, compared it to ISIS. He also compared Trump's migrant caravan lies to the Reichstag fire lies that helped establish Nazi Germany. Dude did not hold back. pic.twitter.com/UPnOtVGWEY— Adam Best (@adamcbest) October 30, 2018That’s a vile assertion. But to exult in triggering extremism is to exult in further polarization, and triggering extremism is much less amusing if the opposing extremist wins an election. In the days before a key midterm, Trump is gambling on panic. That’s not a good look for a president. It’s not good for the country. And it’s terrible for the state of the American immigration debate. The president may never calm down, but his supporters (and members of his administration) can and should.We can protect American borders by telling the truth and applying the law. It’s an approach that will work in the short term, and it’s an approach that will win in the long term. It’s time we gave it a try.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}