{"id": "In Egypt, Islamists Attack Coptic Christian Pilgrims\t\t\t\t\t\t\tIn Egypt, Islamists Attack Coptic Christian Pilgrims\t\t\t\t\t", "paragraph": "National ReviewIn Minya, Egypt, Coptic Christians were terrorized in another attack targeting the minority group on Friday.Islamic militants opened gunfire on two buses carrying Coptic Christians en route to an ancient monastery in Upper Egypt, killing seven and injuring more than eleven. Friday’s attack is one in a series of attacks on Egypt’s ancient Christian community, which currently makes up between 10 and 15 percent of Egypt’s population. Minya has the largest population of Christians in the country — 35 percent of residents are Christians — and experiences a lion’s share of the sectarian attacks.According to Open Doors USA’s world rankings of persecuted countries, Egypt is the 17th most persecuted due to Islamic oppression. In 2017, attacks against Christians included two Coptic church bombings during Palm Sunday processions, killing over 45 people and injuring over 130. In May 2017, gunmen killed 28 Christians who were traveling to the same monastery that the Christians killed in Friday’s attack were visiting. In December 2017, an Islamic extremist shot and killed eleven people at a church in Helwan, Egypt.Coptic women and girls are particularly at risk — they’re being abducted, forced to convert to Islam, and forced to wed.In April 2018, Christine Lamie, a mother of two from northeastern Egypt, disappeared after receiving threats on Facebook. Her husband contacted the police, who had told him that Christine had filed a report the day before confirming that she hadn’t been kidnapped and that she converted to Islam by her own volition.Her husband knew instantly, however, that this was a kidnapping and forced conversion:I know my wife very well; she would not convert to Islam by her will. She likes Christianity and she is very religious. She loves me and her sons very much; she cannot be away from us. Whenever she returns home after work, she rushes to our sons and hugs and kisses them and tells them how much she missed them.. . . She was forced to convert to Islam after she was kidnapped,” he added. “She was pressured and threatened to make her do so.Christine’s case is similar to those of many other girls and women, with a wide range of ages — women are often abducted from towns with high Christian populations, sometimes while leaving church.NR's afternoon roundup of the day's best commentary & must-read analysis.Discrimination against Christians in Egypt is so systemic that Christians are unable to play in professional football clubs — club officials have told men with visibly Christian names to change their names if they ever wanted to play professionally.Their absence at a professional level is “not an impossible statistical anomaly, but a product of deep-rooted discrimination that exists in the administration of football in Egypt and in Egyptian society at large”, according to Coptic Solidarity, a US-based organisation dedicated to achieve equal citizenship for Egypt’s Coptic Christians.. . . In April, the former Egypt international and Tottenham Hotspur striker Ahmed Hossam, better known as Mido, who is a Muslim, publicly addressed the issue of religious discrimination young and talented football players face in Egypt.During an interview on Egypt’s DMC Sport channel, the former Zamalek manager said: “How is it possible that in the history of Egyptian football there have only been five Christian players in the top level [Egyptian Premier League]?. There are Christian players who stop playing at a young age because of the discrimination by some of the coaches.”Egypt’s Christians have seen an increase in violence in recent years; so much so, that their steadfastness, strength, and refusal to retaliate violently in the face of such torment and terror has brought them a nomination for the 2018 Nobel Peace Prize. They were the first ethno-religious group to ever be nominated for the honor.In the U.S., there are over half a million Coptic Christians, and more than 250 parishes.Nermien Riad, the founder of Virginia-based nonprofit Coptic Orphans, told the Washington Times that it’s the Copts’ commitment that both solidifies their faith and leaves them vulnerable to the violence they face.“Although a vulnerable community, they have shown incredible courage and strength through reliance on their faith,” Ms. Riad said. “The Christian reaction is that it’s our Lord who will protect us.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}