{"id": "How Will the Governors’ Races Break?\t\t\t\t\t\t\tHow Will the Governors’ Races Break?\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAbrams Campaign Considers Drastic Legal Measure to Force Another Vote\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBroward County Missed Recount Deadline by Two Minutes\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFlorida Dems Gave Out Altered Form to Fix Absentee Ballots Past Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Election’s Lesson for Democrats: Don’t Nominate Hillary Clinton\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tMichael Avenatti Bites the Dust\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tUrban Cowboys\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Blue Wall\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLosing the Suburbs\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tToward a Bigger Coalition\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFlorida Judge Gives Voters Additional Time to Correct Rejected Ballots\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHillary Clinton: If Stacey Abrams ‘Had a Fair Election, She Would Have Already Won’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAnyone but Nancy Pelosi for Speaker\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe GOP’s Orange County Problem\t\t\t\t\t\t\t\n In my previous column, I walked through how the polls are breaking in this year’s Senate races. To do that, I looked not only at the margin by which candidates lead in the poll averages, but also at the dwindling number of undecided voters. I also noted a problem: Compared with years past, we have remarkably little current public polling in a lot of important races.The governors’ races are worse. Many of these are crucial races, yet outside of the Texas governor’s race, there is not a single governor’s race in the country that has been polled more than twice this month by reliable public pollsters. And the only reason pollsters have been bothering to confirm Greg Abbott’s 19-point lead is because they are already calling Texans to ask about Democratic Senate candidate Beto O’Rourke. So, as we walk through these races, bear in mind that any one of them could easily be off by a few points in either direction — not a big deal if you want to know if heavy favorites Andrew Cuomo or Charlie Baker will be reelected, but a very big deal in neck-and-neck campaigns.Given the stakes — including the outsize role the winners will play in drawing the boundaries for Congress after the 2020 Census — we are probably going to be flying half-blind into a lot of crucial races all the way to November 6. But it is still worth examining the data we have.Red Shirts EverywhereThe first thing to understand about the 2018 governor’s races is that — in sharp contrast to the Senate — the map is very unforgiving for Republicans. The Obama presidency saw Republicans dominate governor’s races: Between 2009 and 2016, Republicans won 66 elections for governor in 38 different states (counting recall and special elections). Democrats won 41 elections in 23 states, and independents won two elections (in Alaska and Rhode Island). Here’s a map of the states where only one party won governor’s races between 2009 and 2016, with the states in gray being won by both parties during that time:Even after giving back New Jersey at the end of Chris Christie’s two terms in 2017, Republicans control the governorship in 33 of the 50 states.If anything, that understates how overextended Republican governorships are. In closely divided Florida, where Rick Scott is running for Senate, they’ve held the governorship continuously since Jeb Bush won it in 1998. In Georgia, which is nowhere near as solidly red as its neighbors and likewise has an open seat, the streak goes back to Sonny Perdue in 2002. In Arizona, the winning streak goes back to Jan Brewer in 2010; in Texas, it goes back to George W. Bush in 1994.Two-term Republican governors are term-limited or retiring in several other purple-to-blue states: Maine, New Mexico, Michigan, Ohio, and Nevada. Republican governors are running for re-election in Massachusetts, Vermont, Illinois, Maryland, New Hampshire, Arizona, and Iowa, and Scott Walker is trying to win his fourth election (counting the 2012 recall) since 2010. None of these are races one would automatically rank as safe seats in a bad environment for the party, and Illinois’s Bruce Rauner faced a stiff primary challenge as well. By contrast, natural pickup opportunities are limited: Of the states Donald Trump won in 2016 that are electing governors this fall, only Alaska (with independent Bill Walker) and Pennsylvania do not already have Republican governors.\nThree Republican incumbents (in Iowa, Alabama, and South Carolina) were lieutenant governors elevated to the job, and are seeking their first independent electoral mandate (Alabama’s governor Kay Ivey got the job when the last Republican governor resigned ahead of impeachment proceedings). Even in typically safer territory, Republicans have to replace departing incumbents in Kansas, Tennessee, South Dakota, Oklahoma, Wyoming, and Idaho.As in the Senate, each party has a couple of well-known recruits for these races, such as congresswoman Kristi Noem (R., S.D.), who already represents the entire state. But many of them have been dented politically. Mike DeWine (R., Ohio) and Mark Begich (D., Alaska) are both former senators who were booted by the voters. Ned Lamont (D., Conn.) lost a Senate race after beating Joe Lieberman in a primary, only to see Lieberman run and win as an independent. Allen Fung (R., R.I.) is seeking a rematch of a race he lost four years ago. The most polarizing recruit is Kansas secretary of state Kris Kobach (R.), who is best known nationally for his role on the Trump administration’s widely derided and since-disbanded Presidential Advisory Commission on Election Integrity.Midterm elections are often a reaction against the party in the White House, as out-of-power partisans are angrier and independents are reminded more often of why they don’t belong to the party in power. Under George W. Bush, for example, Democrats picked up six governorships in 2006. Had Hillary Clinton won the 2016 election, Republicans may have been looking at some very big gains in the Senate and would almost certainly face no threat of losing their majority in the House. But the dynamics of the governors’ races always dictated that 2018 would be a hard year for Republicans to avoid losing some ground.Breaking Down the PollsHow are Republicans weathering this storm? Let’s take a look at the current poll averages. As before, I list Trump’s approval rating in each state from Morning Consult’s September monthly tracking poll and use that as a proxy where there are no poll data; “Break” indicates the percentage of undecideds in the poll average that the Republican would need to win; “Last poll” lists when the most recent poll went into the field; and “Since 10/1” lists how many of the polls in the current RealClearPolitics poll average went into the field on or after October 1:Start with the clearest good and bad news for Republicans. On the upside, New England is a remarkable bright spot: Charlie Baker is cruising to a landslide reelection in Massachusetts, and Chris Sununu in New Hampshire is comfortably ahead. One other deep-blue Republican incumbent in a similar state, Larry Hogan of Maryland, is sitting equally pretty. Morning Consult’s latest polling found that the ten most-popular governors in the country were all Republicans, and Baker and Hogan led that list (Oklahoma’s Mary Fallin was dead last).Vermont is harder to call: Even with a Republican incumbent seeking re-election in the deepest of blue states (where Trump is 30 points underwater), RCP doesn’t list a single poll all year that meets its standards. A September 23–26 Democratic poll shows Republican incumbent Phil Scott up 50-42, which the Democrats optimistically spin as “a statistical tie . . . well within the 4.9 percent margin of error.” That’s not much to go on, but if you’re releasing a partisan internal poll that shows your candidate down eight points, you’re not winning.The picture in Maine is foggier. RCP lists only a Suffolk poll from early August with Republican Shawn Moody tied 39-39 (a long way from 50 for either side) with Democrat Janet Mills. FiveThirtyEight lists a few more recent polls of more questionable vintage showing Mills up 41-33 or 52-44 on Moody, while an AARP poll of voters over 50 showed Mills up 39-38. It seems likely that Moody is trailing, as you’d expect after two terms of proto-Trump Paul LePage running a long-blue state, but it’s far too fragmentary evidence to count Moody out just yet. Maine polls often show a lot of undecideds, and LePage typically finished strong, albeit in years when voters were breaking Republican at the end — far from a certainty in 2018.The two other New England races, in Rhode Island and Connecticut, have shown sporadic signs of life, given Connecticut’s economic woes under outgoing Democrat Dan Malloy and a restive public-sector-union base in Rhode Island. But even with a fair number of voters still undecided, the Democrats seem likely to survive on the strength of the national environment and the states’ natural partisan leans.In three states with hotly contested Senate races — incumbents Greg Abbott of Texas and Doug Ducey of Arizona, and businessman Bill Lee in Tennessee — Republicans appear to have locked down their races. And in the one really plausible Republican pickup, Alaska, Mike Dunleavy seems to be in command of a three-way field against Walker and Begich. Oregon may be the next-closest pickup opportunity (Democrat Kate Brown, like Reynolds and Ivey, is seeking her first mandate after her predecessor resigned in scandal), but remains a long shot in a state that has eluded Republicans since the 1990s.On the downside for Republicans, New Mexico and Michigan look like predictably lost causes, albeit ones without terribly recent polling; Pennsylvania is as uncompetitive a Democratic hold as it is in the Senate; Bruce Rauner is doomed in Illinois (an incumbent below 30 percent support in September is toast), and the same Midwest malaise we see in the Senate races means that Minnesota is uncompetitive, DeWine is in a hole in Ohio, and the hard-to-bury Scott Walker is in his hardest fight yet. If you’re a Republican looking for a ray of hope, the most recent gold-standard Marquette poll had Walker up 47-46, but NBC/Marist responded swiftly with a poll showing him down 53-43, enough to sober up any optimist. Walker shouldn’t be counted out, but he’s swimming against a brutal tide. We have less to go on with Iowa, with Kim Reynolds and her opponent both in the thirties at last glance and no polls in a month.Further into the Great Plains and Mountain states, Oklahoma is closer than Republicans would like (due in part to the departing Fallin’s unpopularity), and there’s no polling to speak of in Nebraska, South Dakota, or Idaho. Some Democratic partisan polls have shown a neck-and-neck race in South Dakota, with Noem up four in July and down three in late September, but again we can place only limited stock on those. We should consider both South Dakota and Oklahoma as states reasonably likely to stay in the Republican fold, but both are potential sleeper upsets.The races that will go down the hardest, besides Wisconsin and Ohio, are Nevada, Georgia, Florida, and Kansas. Of the four, Republicans are most consistently ahead in Georgia and behind in Florida, and the Kansas polling is the least trustworthy, but these are the most toss-up-ish states. Several of them will be especially important nationally due to their role in deciding the composition of the House, their status as key presidential battlegrounds, and the national political valence of the veteran Midwest warrior Walker, the progressive African-Americans Andrew Gillum (Fla.) and Stacey Abrams (Ga.), the Trumpy Ron DeSantis (Fla.) and the extremely Trumpy Kobach.Where Are the Breaks?Finally, let’s look at where the races have been moving. Again, this is a hard thread to follow when you don’t have a whole lot of public polls to measure a trendline:The most optimistic trends for the GOP are in Arizona, Oklahoma, Nevada, and Georgia, three of which seem to be moving in the direction of the state’s recent partisan lean. The mirror image is happening in Rhode Island, Illinois, Pennsylvania, Minnesota, and Oregon, and the trendline in Ohio is not encouraging.If I had to project today, I’d see Republicans picking up Alaska and taking a net loss of about five or six governorships, bringing them down to 27 or 28 of the 50 states. But there are still a lot of races that are either in play, or still have too little reliable polling to call. There were more Election Day surprises in 2014 in the governors’ races than the Senate races, and we should not be surprised to be surprised again.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}