{"id": "On Criminal Justice, Trump Embraces the Left’s Racism Rhetoric\t\t\t\t\t\t\tOn Criminal Justice, Trump Embraces the Left’s Racism Rhetoric\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 17\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHow D.C. Is ‘Getting Guns Off the Street’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump Appointee Judge Rules for CNN. Good.\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tJudge Orders White House to Return Acosta’s Press Pass\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 16\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Case for the Wage Subsidy\t\t\t\t\t\t\t\nPresident Trump has announced his support for a proposal to ease federal sentencing laws that proponents call the “FIRST STEP Act” — and that Senator Tom Cotton has tartly labeled the “jailbreak” bill. There may not be much time for debate, since the bill’s ideologically eclectic array of champions hope to ram it through the lame-duck session of Congress. For now, though, I want to focus on an absurd assertion the president made Wednesday afternoon, in remarks touting the proposal.Trump stated that, among other things, FIRST STEProlls back some of the provisions of the Clinton crime law that disproportionately harmed the African-American community. And you all saw that and you all know that; everybody in this room knows that. It was very disproportionate and very unfair.It was not disproportionate or unfair. The argument that it was, commonly made by race-obsessed Democrats, is rooted in the noxious “disparate impact” theory of racial discrimination and a misrepresentation of history.At issue is the wide disparity between criminal penalties for crack cocaine and powder cocaine — known, respectively, in the ’80s and ’90s as “cocaine base” and “cocaine hydrochloride.” This policy did not begin with President Clinton. In 1986, President Reagan signed legislation prescribing prison sentences that were much more severe for crack, at a ratio of 100:1 (e.g., a five-year mandatory minimum prison term applied to offenses involving 500 grams of powder cocaine or 5 grams of crack).Clinton-era crime legislation built on this foundation, enhancing the phenomenon critics call “mass incarceration” (and the rest of us call “felons who prey on society being held in prison”). President Clinton signed into law the “three strikes and you’re out” provision, requiring mandatory life sentences for career criminals who commit a “serious violent felony” after having previously been convicted of at least one other such crime, in addition to another crime (which could include drug felonies). Clinton, moreover, encouraged states to adopt federal “truth in sentencing” provisions that require the sentence served in prison to approximate the sentence imposed in court.(By the way, you’ll be hearing more about “truth in sentencing” — its demise, that is — in connection with FIRST STEP. Proponents insist the bill is tough on crime, and to give that illusion, the proposal would return us to the fraudulent practice of having Congress enact hefty sentences that judges ostensibly impose in court — only to have prison authorities quietly slash them by half and more. FIRST STEP would pull this off through the application of “time credits” that prisoners earn by participation in “evidence-based recidivism reduction programming.”)\nIt is fair to contend that some Clinton (and Reagan) sentencing policies were unduly harsh — though doing so is Monday-morning quarterbacking applied to a crime environment very different from today’s. It is the job of legislators to adapt the law to changing circumstances. And we do have changed circumstances: Crime rates have been low for a long time, and policing methods have improved significantly. Certainly, we should hear out thoughtful FIRST STEP advocates, who maintain that we can keep crime low (and even further reduce it) while returning convicts to society more quickly. I don’t see it, but maybe “evidence-based recidivism reduction programming” really can prove itself over time.That said, it is specious for President Trump to insinuate that the enforcement policies he wants to change were driven by racism, or should be thought racist because of their effects.The laws, of course, did not distinguish among defendants based on race. If you were a white or black offender, the law applied exactly the same way. A narrative developed that powder cocaine was the drug of well-to-do whites and crack the drug of inner-city blacks. This was a gross exaggeration, but, more important, it had nothing to do with why the federal criminal law (and a good deal of state law) treated the two forms of cocaine differently. Rock coke was thought to be hyper-addictive and, therefore, more profitable to dealers, more dangerous to individual users, and more destabilizing to communities than powder coke. It wasn’t a race thing; it was a peril thing.African Americans were not disproportionately prosecuted for crack. The purported “disproportion” lay in the remorseless fact that, as a demographic group, African Americans (teenage boys and young men, in particular) violated the crack laws at higher rates than other groups. Policymakers, Congress, prosecutors, police, and the laws targeted behavior, not race. Nor (if we must indulge such mumbo-jumbo) was this a matter of “subliminal racism” on the part of lawmakers and law-enforcers. It was a response to determined law-breaking.Should we be concerned about disproportionate consequences and disparate impact? Sure, but those concerns should be lavished on the predominantly black communities that, far more than other communities, have been ravaged by the drug peddlers and the gangland dystopia they inevitably bring.President Trump took unseemly satisfaction in observing that the “Clinton crime law” — presumably, the one in 1994 — “disproportionately harmed the African-American community,” and that “everybody” knows it was “very unfair.” To be sure, Trump is on the receiving end of overheated racism rhetoric from Democrats. That doesn’t make his claim any less of a slander.President Clinton signed the 1994 crime bill at the behest of, among others, many leading members of the Congressional Black Caucus and African-American leaders who were alarmed at how crack trafficking was ravaging black neighborhoods. While he now says he regrets contributing to increased incarceration, Clinton recently recounted that black leaders at the time pled with him, “Take this bill because our kids are being shot in the street by gangs.” As he took a Black Lives Matter heckler to task, the former president added, “We had 13-year-old kids planning their own funerals.”Clinton emphasized that it was mainly black lives that were saved by tough anti-crime provisions. Whatever misgivings he may have now that the politics has shifted, the Clinton of 1994 and 1995 not only adamantly refused to ease up; he suggested that the sentencing disparity should be addressed by raising the powder-coke penalties, not lowering the crack ones.This was the tenor of the times, as the positive societal effects of removing serious recidivist felons from the streets were first being appreciated. That is why the crack legislation President Reagan signed in 1986 received overwhelming bipartisan support (as did the more comprehensive anti-crime bill he signed in 1984).Again, it is all well and good to argue that the 100:1 disparity in treatment of the different forms of cocaine was bad policy, and that later legislation, which reduced it to about 18:1, is more sensible. President Trump would have garnered the bipartisan applause he craves by arguing that the original disparity was overkill, and that FIRST STEP would improve on the subsequent downward adjustment by applying it retroactively (giving more incarcerated defendants the benefit of it). But it is libel against the people who enacted and enforced the laws to suggest that they intentionally harmed the African-American community.If anything, the motivation behind those laws was to protect African-American communities from determined criminals. It remains to be seen whether those communities will be as safe once, thanks to the FIRST STEP bill, many of those criminals are more rapidly set free.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}