{"id": "Don’t Write Off the Republicans in Florida Just Yet\t\t\t\t\t\t\tDon’t Write Off the Republicans in Florida Just Yet\t\t\t\t\t", "paragraph": "National ReviewThe latest polls of the Senate and gubernatorial races in Florida indicate that both Republican governor Rick Scott and GOP congressman Ron DeSantis still have a chance to pull off a victory against their respective Democratic opponents.Over the weekend, the New York Times and Siena released preliminary results from live polling in Florida, showing that Democratic senator Bill Nelson leads Scott by four points in the re-election battle, 48–44 percent. The same poll found that Democratic mayor of Tallahassee Andrew Gillum had 48 percent support compared with DeSantis’s 43.But a second survey from Sunday, CBS News/YouGov, found that Scott and Nelson are neck and neck, tied at 46 percent support each. The same poll showed Gillum ahead of DeSantis by just one point in the gubernatorial contest, 47–46 percent.NR's afternoon roundup of the day's best commentary & must-read analysis.Even more intriguing are the favorability ratings CBS/YouGov found for each candidate, based on voters’ assessments of the candidates’ experience up to this point. Despite his extensive negative press coverage — and Gillum’s increasingly outlandish attacks against him — DeSantis leads the pack with a net-positive rating of 13, with 45 percent positive and 32 percent negative.Gillum, comparatively, has the lowest rating of the four candidates, with favorable/unfavorable of 42/37. In the Senate race, Scott edges out Nelson in terms of favorability, with a 47/39 positive to negative ratio compared with Nelson’s 43/36.Meanwhile, two new polls out today show the Senate race narrowing again, with Election Day just a week away. A UNF survey shows Nelson ahead of Scott by one point, and another from USA Today/Suffolk shows the Democrat ahead by two. The UNF poll gave Gillum a six-point lead over DeSantis, but USA Today/Suffolk found him ahead by just a one-point margin.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}