{"id": "Get the Lead Out! Or Get the Rake Out.\t\t\t\t\t\t\tGet the Lead Out! Or Get the Rake Out.\t\t\t\t\t", "paragraph": "National ReviewThe National Review 2018 Buckley Legacy Conservative Cruise will be sailing in 40 days. Do you still have time to reserve a sumptuous stateroom on Holland America Line’s MS Oosterdam? Indeed you do. But the pickings will start getting slim. So you need to get yourself now to www.nrcruise.com and pick out the cabin of your taste and affordability (and yes, they are affordable), and make sure you are with us in the sunny Caribbean, December 1-8, in the company of many top conservative thinkers and writers, as we discuss the movement, the elections, WFB’s legacy, and so much more.Sure, you want to go. Sure, you fully intend to reserve that cabins. And sure, you . . . will put off the decision-making and find that your procrastination will once again guarantee that, instead of enjoying a spectacular cruise, you spend the autumnal week sobbing as you rake leaves, wondering through the pain of blisters about what could of been. Seems like an easy choice, no? Talk 2020 with Rich Lowry, or rake? Jaw with George Nash and Lee Edwards about conservatism, or rake? Explore the Left’s new-fangled attacks on the Constitution from John Yoo and David French, or rake?I . . . leave it to you to decide. Groaning pun intended.All-inclusive prices start at only $1,999 a person (based on double occupancy), or $2,699 for a single stateroom. You’ll enjoy numerous seminar sessions, Night Owls, cocktail receptions, a smoker, and dining on at least three evenings with our guest speakers and editors (here’s the Who’s Who). You want to come, so . . . come. Get the lead out and visit our dedicated website, www.nrcruise.com, for complete information about the cruise, or call The Cruise and Vacation Authority (Monday to Friday, 9AM to 5PM, Eastern time) at 1-888-283-8965 – the great folks there will be happy to answer any and all questions you might have.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}