{"id": "Why the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 17\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHow D.C. Is ‘Getting Guns Off the Street’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tOn Criminal Justice, Trump Embraces the Left’s Racism Rhetoric\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump Appointee Judge Rules for CNN. Good.\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tJudge Orders White House to Return Acosta’s Press Pass\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 16\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Case for the Wage Subsidy\t\t\t\t\t\t\t\nJeff Flake may be leaving the Senate soon, but he’s determined that his exit will be one of non-stop moral posturing.The Arizona senator is best remembered at this point for his last-minute delay of the Judiciary Committee’s approval of Justice Brett Kavanaugh when — along with his pal Senator Chris Coons — he successfully demanded a delay for an FBI investigation of the accusations of sexual misconduct against the judge.Coming after a cringe-worthy moment in which he let himself be trapped in an elevator and subjected a nationally televised tongue lashing from a Kavanaugh opponent, the gesture earned him applause from the same detractors of President Trump to whom he’s been playing for the last year. Since the Democrats rejected the investigation after it was completed, the gesture wound up doing nothing to satisfy their desire to smear Kavanaugh and stop the confirmation. It merely confirmed just how ineffectual this sort of faux bipartisanship could be.But Flake was back at the same racket this week, with Coons again at his side, as he announced he would oppose all pending judicial nominations before the Judiciary Committee until Senate majority leader Mitch McConnell would agree to a vote on a bill to protect Special Counsel Robert Mueller.The legislation is aimed at ensuring that President Trump or the new acting attorney general, Matthew Whitaker, won’t fire Mueller before he can finish his investigation into alleged collusion with Russia during the 2016 presidential election.None of the other members of the GOP caucus — including moderates such as Lisa Murkowski and Susan Collins — agree with Flake’s tactic. Since McConnell has made it clear that he doesn’t think any legislation about Mueller is necessary, the only thing this swan song of the man who had the nerve to co-opt Barry Goldwater’s book title, “The Conscience of a Conservative,” will accomplish is to prevent the confirmation of more conservatives to the courts.\nWhile this will infuriate Republicans — and make any future plans he might have to challenge Trump in the 2020 Republican presidential primaries even more futile — a lot of Republicans agree with him about wanting to protect Mueller. The bill he’s supporting passed the Judiciary Committee earlier this year with some Republican support, including that of Chairman Chuck Grassley, Lindsey Graham, Thom Tillis, and Flake.But the problem with the legislation isn’t that Flake can’t resist the impulse to grandstand or the question of whether firing Mueller would be a disaster. There is a broad bipartisan consensus that if Trump were so foolish as to attempt to quash the probe before Mueller is finished, it would set off a crisis that could endanger his presidency far more anything stemming from the fishing expeditions embarked upon by House committees that will be controlled by Democrats in 2019 will.The problem with the bill, as Judiciary Committee members such as Mike Lee pointed out at the time, is that it’s unconstitutional.We don’t know yet what sort of a threat the Mueller investigation poses to Trump. While it hasn’t leaked to the press about its plans, the liberal press continues to raise expectations about more indictments or whether Mueller’s team has found the magic bullet that will tie Trump and his closest associates to actual Russian plots, something that could make the bad dream of 2016 go away for Democrats.Trump remains infuriated by the investigation and will probably grow more so if it isn’t wrapped up in the coming months, after a year and a half during which it has been able to charge some figures — like former Trump campaign manager Paul Manafort — with crimes unrelated to collusion or the president but found nothing that relates to his original brief.To date, Trump has let Mueller be, albeit while fuming about him on Twitter and holding a grudge against former attorney general Jeff Sessions for letting the probe be initiated in the first place. McConnell and other Republicans seem fairly confident that this won’t change, largely because they think the investigation won’t touch the president even if more indictments will be filed.Nevertheless, some gesture reminding Trump of the trouble he would cause himself if he fired Mueller might be in order. But rather than satisfying themselves with a nonbinding Senate resolution, Democrats, joined by Republicans such as Flake and even current Trump ally Graham, insisted on a bill that would allow any special counsel fired by the Justice Department to challenge the action in federal court while protecting documents relevant to their investigations. As Graham put it, the bill wasn’t so much about Mueller or Trump but defending the rule of law.But however foolish the firing of Mueller might be, the notion that Congress has the power to prevent the president from discharging anyone who works in the executive branch of government is on very shaky ground. The Senate has been here before, and the precedent isn’t one that should reassure Flake or any of his colleagues who think they are defending the Constitution against Trump.The most prominent example of Congress trolling a president in this manner took place in 1867 when Congress passed and then overrode a presidential veto of the Tenure of Office Act. That legislation was a thinly veiled effort by a Republican Congress to hamstring President Andrew Johnson, a Democrat who had succeeded the assassinated Abraham Lincoln after being elected vice president on a Unionist ticket in 1864. Johnson opposed efforts to defend freed former slaves and to pursue a radical reconstruction of the South in the aftermath of the Civil War. More to the point, Johnson wanted to fire Secretary of War Edwin Stanton, a Lincoln holdover who used federal troops to stop violence against African Americans.The Tenure of Office Act denied the president the right to fire anyone confirmed to their positions in the federal government by the advice and consent of the Senate without senatorial approval. Johnson fired Stanton anyway and the Senate denied its consent for his removal. When Johnson insisted on preventing Stanton from continuing to serve, it led to impeachment and then a Senate trial where Johnson evaded conviction and removal from office by a single vote. That effort was really a referendum on Johnson’s lamentable refusal to defend Reconstruction. But as subsequent court rulings agreed, Congress had overstepped its bounds in seeking to prevent Johnson from getting rid of officials that he didn’t like.The Tenure of Office act was eventually repealed after Ulysses Grant replaced Johnson. But the issue came up again in the 1920s when the Supreme Court ruled a similar law unconstitutional in the case of Myers v. United States, which upheld the president’s right to remove a postmaster without Senate approval.The analogy between the Mueller protection bill and these examples is not exact, but the broad principle at stake in these cases is clear. Congress has no right to prevent a president from firing any official in the executive branch.A Trump firing of Mueller would be every bit as wrongheaded and suicidal as Johnson’s eviction of Stanton from his office. The current president’s desire to prevent his administration from being investigated — whether or not there is anything to the Democrats’ fantastic claims that Trump won office only as the result of plotting with a hostile foreign power — would be no less outrageous than Johnson’s refusal to protect the civil rights of freed slaves. But however mistaken these decisions might be, that doesn’t give Congress the right to breach the separation of powers in the Constitution that gives a president the right to fire those working for the Department of Justice.Republicans hope McConnell is right when he says there is no threat to Mueller’s position, in spite of the president’s fulminations about him on Twitter. But the majority leader is certainly correct in opposing this bill on constitutional grounds alone. Flake may be too lost in his vision of himself as a martyr to conscience to understand it, but the bill he’s championing is as much an assault on the Constitution and the rule of law as anything he imagines Trump wants to do.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}