{"id": "A Clash of Judicial Visions\t\t\t\t\t\t\tA Clash of Judicial Visions\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 17\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHow D.C. Is ‘Getting Guns Off the Street’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tOn Criminal Justice, Trump Embraces the Left’s Racism Rhetoric\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump Appointee Judge Rules for CNN. Good.\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tJudge Orders White House to Return Acosta’s Press Pass\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 16\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Case for the Wage Subsidy\t\t\t\t\t\t\t\nEditor’s Note: The following is the first in a series of articles in which Mr. Yoo and Mr. Phillips will lay out a course of constitutional restoration, pointing out areas where the Supreme Court has driven the Constitution off its rails and the ways the current Court can put it back on track.The end of the sordid ordeal that led to Brett Kavanaugh’s confirmation provides conservatives the opportunity to think deeply about what they want from the Supreme Court. Conservatives, of course, would have fought for Kavanaugh whether he was a stalwart Clarence Thomas or a wandering Anthony Kennedy. At stake were the principles of fairness and due process that should guide all of our institutions, even when they intersect with the #MeToo movement’s claims. The courts, Congress, federal agencies, state governments, and even the most delusional of our great societal institutions — the media and our colleges and universities — must not banish facts, proof, and the right to be heard.But now that Justice Kavanaugh has assumed his seat on the Court, conservatives can take a step back and consider their agenda for the future. Democrats launched their scorched-earth war against Kavanaugh, an outstanding judge and distinguished public servant, precisely because his appointment promised a reliable fifth vote for a conservative majority. There’s a good argument to be made that conservatives have not had such a working majority on the Court since 1936. Even though Republican presidents have appointed the majority of justices since 1968, when Richard Nixon won on a law-and-order platform, their appointments have often “grown in office” and drifted leftwards. But the outrageousness of Democratic attacks on Justice Kavanaugh should guarantee that he will not follow in the path of Republican-appointed Justices such as Harry Blackmun, John Paul Stevens, and David Souter, who became lions of the Left.The Supreme Court now has the opportunity to reconsider doctrines at odds with the Constitution’s original meaning. Before they devolved into an ugly political and personal brawl, Kavanaugh’s confirmation hearings revealed, among other things, the fault lines in American constitutional politics.Democratic senators, as well as their expert witnesses called in opposition, advanced a view of a judge as simply the enabler of a political party’s policy preferences. They cross-examined Judge Kavanaugh on the specific outcomes he had reached in cases relating to certain groups of interest: minorities, women, environmental organizations, and the like. In their view, the only difference between a judge and a congressman is the former wears a robe.Influenced by the Legal Realism movement, which is the basic approach taught in most American law schools today, these Democrats find law and facts to be mostly smoke and mirrors. Instead, to them, judges really exercise raw and unchecked political power in determining winners and losers. Judging is about outcomes, not process. To be a good judge is to pick the right winners. Lady Justice is not blind — she metes out justice with both eyes wide open so that she can favor the preferred class or group.\nIf judges simply advance political goals, then Democrats were at least honest in their desire for a judge who sympathizes with their favorite groups. That’s why President Obama said he was looking for judges with “empathy,” though undoubtedly it was not empathy for corporations, for example, but for groups he favored. Under this view, if you are a Democrat, you should only pick judges who vote for unions, racial minorities, and criminal suspects. If you are a Republican, you want judges who always vote for corporations and the police.Republican senators, however, rejected this approach. Their view requires judges to be indifferent to the demographics of the parties before them. In Chief Justice John Roberts’s metaphor, judges are umpires who call balls and strikes, but do not promote personal preferences or prejudices. In other words, as Justice Kagan put it in her confirmation hearings, “the question is not, ‘Do you like this party or do you like that party? Do you favor this cause or do you favor that cause?’ . . . The question is what the law requires.”The outcome of a case should not be the point, in other words — it’s the process judges use to interpret the law and apply it to the parties that really matters. Thomas Jefferson viewed judging as mechanical. He hoped for machine-like judges who would take the law, written by someone else, and apply it to facts presented by the parties. Of course, judging is not easy, and judges are human. But that ideal — that everyone is equal in the court of law, that there are no favorites before blind Justice — is as old as the Republic itself. Properly applied, it should make the judiciary, in Alexander Hamilton’s words, the “least dangerous [branch] to the political rights of the Constitution.”These two visions of the courts have given birth to two distinct approaches to judging. The first view mistakenly appeals to the way state judges decide the cases that most Americans encounter: criminal trials, contract and property disputes, and civil lawsuits over accidents. These cases are known to lawyers as the “common law,” which we inherited from Great Britain. Common-law judges are free to create the rules as they see fit. They often exercise the equivalent of legislative power — they are the lawgivers in these areas governed by the states. Importing that model into the federal judiciary creates judges who will not feel themselves bound by the written Constitution or congressional enactment. Supreme Court justices will find themselves tempted to lead the people to where they “should be” rather than where they are. There is nothing to limit a justice but his imagination and his fellow justices. Hence, the great liberal justice William J. Brennan reportedly said that the most important rule in the Supreme Court is the “Rule of Five”: the number of Justices needed to produce a majority, and hence the power to change any law.The alternative, conservative view sees the judge as an umpire who is as bounded as the judge-as-philosopher-king is free. An umpire-judge relies on a few basic concepts: The law is words, those words have a meaning, and that meaning is fixed at the time the law is enacted. The judge’s job is to figure out what the words meant at the time of enactment. This method of judging is called “originalism” when dealing with the Constitution, or “textualism” when dealing with statutes or regulations. The terms “originalism” and “textualism” are of recent vintage, but the methodology they represent can be traced to the beginning of our nation.Scholars and jurists can and do disagree about the various ways to get to the original meaning of a legal text. We can determine the common meaning of words to the ordinary person of the time, using dictionaries and examples of usage from the time of the Constitution’s ratification. Massive databases of texts and computer analysis may make this task easier. Another way to get at original meaning is to look through legal materials from that era: cases, treatises, legislative materials, etc. A related technique is to employ the methods lawyers of that era used to determine meaning, such as applying rules (or “canons”) of legal interpretation well-known and used during at the time. An additional technique is to see what contemporaries thought a constitutional clause meant, using all-important sources such as The Federalist Papers, The Anti-Federalist Papers, and the Constitutional Convention and state ratification debates. Finally, the practices of those closest to the enactment of the legal document may shed light on its meaning. We often look, for example, to the administration of George Washington and the first few Congresses to see if their behavior is consistent with one interpretation of the Constitution or another.All of these techniques ultimately have the same purpose: to uncover the Constitution’s original meaning. From a constitutional perspective, originalism is clearly superior to the common-law approach of judges who enact their own policy preferences like a legislator. First, originalism is the only legitimate way for a Supreme Court justice to approach the job. As Alexander Hamilton noted in Federalist No. 78, “courts must declare the sense of the law; and if they should be disposed to exercise WILL instead of JUDGMENT, the consequence would equally be the substitution of their pleasure to that of the legislative body.” Supreme Court justices acting like common-law judges by exercising their will rather than their judgment misuse their judicial power under our Constitution.Further, common-law judging by federal courts weakens our Republic. It takes away sovereignty from the people and places it in the hands of five justices who, by design, are given political independence. Abraham Lincoln rejected the idea that the people’s sovereignty should rest with the Supreme Court. He famously warned in his First Inaugural Address that, “if the policy of the Government upon vital questions affecting the whole people is to be irrevocably fixed by decisions of the Supreme Court . . . the people will have ceased to be their own rulers, having to that extent practically resigned their Government into the hands of that eminent tribunal.”Allowing a majority of the Supreme Court to amend the Constitution or a statute is anti-democratic — particularly in the constitutional context. It takes supermajorities of Congress and the states to amend the Constitution, and it took a supermajority of the original 13 states for the Constitution to have been originally adopted. It turns our constitutional system on its end to allow five justices to overrule the will of the overwhelming majority of the people.With the confirmation of Justice Kavanaugh, for the first time in generations there is a majority of justices on the Supreme Court who, to varying degrees, practice originalism and textualism. This means that the Court can systematically begin to restore the Constitution to its original meaning. This constitutional restoration does not mean that the Constitution’s original meaning is the best choice from a policy perspective on any given issue. It means that the people get to decide what is best, and the Supreme Court is bound to follow their will. The Court has no authority to diverge from the Constitution’s original meaning, only a duty to return to it until the people decide otherwise. And with the Court’s new makeup, a day when it once again sits atop the “least dangerous” branch of government is within sight.— John Yoo is the Emanuel S. Heller Professor of Law at the University of California, Berkeley, a visiting scholar at the American Enterprise Institute, and a visiting fellow at the Hoover Institution at Stanford University. James C. Phillips is an attorney in private practice and a non-resident fellow at Stanford Law School’s Constitutional Law Center.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}