{"id": "The Battle over Election Rules Will Continue\t\t\t\t\t\t\tThe Battle over Election Rules Will Continue\t\t\t\t\t", "paragraph": "National ReviewAs Election Day nears, there has been considerable discussion of exactly how Americans vote, and whether our election rules are in need of reform. Over at the Courier-Journal, D. Stephen Voss, a political scientist at the University of Kentucky, offers a note of skepticism about automatic voter registration and early voting, two popular reform measures, especially among liberals. Drawing on his reading of the scholarly literature, he observes that early voting might actually reduce participation as “voting is a fundamentally social act,” and the widespread availability of early voting might weaken peer effects that tend to boost turnout. And as for automatic voter registration, he observes that the marginal eligible voters who find themselves on the registration rolls by default tend to vote at low levels.He points to Oregon, a pioneer of automatic voter registration, where two-thirds of registrants “who had not already interacted with an election official, either to register or to declare a party affiliation” chose not to vote at all in 2016, thus lowering the overall turnout rate among registered voters. Suffice it to say, this isn’t a slam-dunk case against automatic voter registration, as Voss acknowledges. I’d still be inclined to support it. But he does remind us that well-intentioned reforms don’t always have the salutary consequences their advocates hope for.If I had my druthers, we would ensure that all voting-age citizens, especially the poorest, have a high-quality photo ID that could serve as proof of identity for purposes of voting. This would go hand in hand with automatic voter registration. To boost turnout, we’d make Election Day a federal holiday, or we’d move it to a weekend, and perhaps we’d encourage state and local jurisdictions to align their elections with federal elections, as the (decidedly left-of-center) Zoltan Hajnal recently recommended in the New York Times. Alas, the prospects for such a set of reforms are not bright, at least not now. And so election rules will continue to be a political football.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}