{"id": "The Wrong Time to Cut Defense Spending\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tArmistice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tNYC Subway Bomber to Judge: ‘I Was Angry with Donald Trump‘\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tIran Vows to Defy Reimposed U.S. Oil, Financial Sanctions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tDefense Department Budget: Trump Bump or Reagan Rebuild?\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tDHS Secretary: Midterms Will Be ‘Most Secure Election’ Ever\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump Administration to Reimpose Last of Sanctions Lifted by Iran Deal\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCruz Leads GOP Hawks in Calling for Harsher Sanctions Against Iran\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tObama CIA Read Congressional Staffers’ Emails about Protecting Whistleblowers\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump Says Border Troops Could Reach 15,000, Catching Pentagon Off Guard\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tChina Has Landed\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPentagon Will Send over 5,200 Troops to Southern Border\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tIt’s Time to Modernize Our Approach toward Iraq\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tA Famine in Yemen\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tSuspicious Packages Sent to Robert De Niro, Joe Biden\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Pipe-Bombs Story: Another Example of Why No One Trusts the Media\t\t\t\t\t\t\t\nLast month, when the Treasury Department reported that the fiscal year 2018 deficit was a staggering $779 billion, President Trump made an announcement. Before meeting with his cabinet, the president said he would be asking every secretary to trim 5 percent, “if not more,” from his or her budget. Nor would he exempt the Department of Defense.Here’s hoping Trump changes his mind. Cutting the resources available to the Pentagon is a bad idea. A new report from the bipartisan National Defense Strategy Commission underscores just how bad.“Providing for the Common Defense” is the consensus of a dozen national-security experts, including Jack Keane, Senator Jon Kyl, Eric Edelman, Gary Roughead, Michael Morell, Anne Patterson, and Roger Zakheim. These are sober people. Experienced people. They are not given to exaggeration. Yet their conclusions are alarming. “The security and wellbeing of the United States are at greater risk than at any time in decades,” they write. “America’s military superiority—the hard-power backbone of its global influence and national security—has eroded to a dangerous degree.”Great-power competition returned as our military advantage dissipated. “America’s ability to defend its allies, its partners, and its own vital interests is increasingly in doubt.”That’s more than a wakeup call. It’s an air horn inches from your ear.\nNot only has the range of threats expanded. So has the battle space. In addition to China and Russia, there are the smaller weapon-states the autocracies use to probe, divide, and entrap America and her allies: North Korea, Iran, and Syria. Nor has the Salafi-jihadist movement left the field. Reduced to its last bastions in Syria, ISIS and its comrades await the moment the United States exits Afghanistan.Once America had to assert supremacy over global sea lanes and air traffic. Now it must also claim the high ground in the commons of space and cyber. “U.S. military superiority is no longer assured,” says the commission, “and the implications for American interests and American security are severe.”This crisis was a long time in the making. For decades, America has short-changed defense, especially our navy, ground forces, nuclear weapons, ballistic-missile defenses, and the research and development necessary to maintain a qualitative strategic edge. Yet the commission points to the Budget Control Act of 2011 — the so-called sequester — as the essential instrument of our debilitation. “In percentage terms,” the authors write, the sequester was responsible for “the fastest drawdown since the years following the Korean War.”The withering of resources occurred as American soldiers fought in Afghanistan, returned to Iraq and entered Syria, and found themselves deployed in places like Niger. “By 2017, all of the military services were at or near post-World War II lows in terms of end-strength, and all were confronting severe readiness crises and enormous deferred modernization costs.” The military budget was increased in FY2013, FY2015, and again most significantly in FY2018 thanks to President Trump and the Republican 115th Congress. It is not enough. “As the world has become more threatening, America has weakened its own defense.”The commission supports the National Defense Strategy released earlier this year by Secretary of Defense James Mattis and lauds “its candid assessment of the strategic environment, the priority it places on preparing for major-power competition and conflict, its emphasis on the enduring value of U.S. alliances and partnerships, and its attention to issues of readiness and lethality.” The Pentagon document complemented the National Security Strategy and its doctrine of “principled realism” issued by the White House last December. What troubles the commission, however, is a lack of specificity. “Absent a more integrated, whole-of-government strategy than has been evident to date, the United States is unlikely to reverse its rivals’ momentum across an evolving, complex spectrum of competition.”China, Russia, and Iran seek hegemony over spheres of influence. Aware of their weakness against the superpower, they advance strategic goals through unconventional means: hybrid warfare, gray-zone aggression, threats of nuclear escalation, cyber-attacks, industrial espionage, and the reflexive control that limits an adversary’s options before a conflict begins. Meanwhile, American strategic thinking is adrift. “Unfortunately, the innovative operational concepts we need do not currently appear to exist.”Reducing defense spending in this environment would be more than foolish. It would be a non sequitur. The Pentagon budget is not the reason for America’s indebtedness. Consider last month’s deficit: revenues were $253 billion and receipts $353 billion for a deficit of $100 billion. Where did the spending go? $69 billion was spent on defense, and $137 billion spent on Social Security and Medicare. That’s close to twice as much on entitlements as on the military. Defense spending is 3 percent of our economy. Interest on the debt — for which we get nothing but a solid credit rating — has averaged 2 percent. It may rise to 3 percent by 2027.The debt won’t be fixed until entitlements are. And entitlements won’t be fixed until they absolutely have to be. An irony is that defense spending not only underwrites international security. It also backstops American profligacy. America hasn’t had to reckon with its debt because the dollar is the world’s reserve currency. This exorbitant privilege is as likely to be revoked by a national-security crisis as a financial one. That was the case when the dollar replaced the pound sterling, and America supplanted the United Kingdom as the guarantor of international security, at the end of World War II. Not only is defense spending a more effective economic stimulus than transfer payments. By deterring threats and promoting stability, it delays the day of reckoning when America’s accounts will have to be balanced.The Trump administration has identified the enemy: resurgent great powers, most significantly China, whose ultimate objective is disestablishing American preeminence. The administration has also taken the first steps to counter revisionist autocrats by boosting the Pentagon, resuming freedom-of-navigation missions in the South China Sea, sanctioning Russia, opposing Nord Stream 2, and withdrawing from the INF treaty. The beginnings of a long-term strategy of American nationalism can be found in the administration motto that “economic security is national security,” and in its focus on the defense-industrial base as the seedbed of American primacy. The National Defense Strategy Commission has 32 policy recommendations of its own. These include cancelling the remaining sequester and continuing increases in the defense budget. That is the very opposite of an across-the-board 5 percent cut.America spent years digging the strategic hole in which it finds itself. We stopped with last year’s defense-appropriation bill. Why start again? Put the shovel away, Mr. President.This article originally appeared in the Washington Free Beacon.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}