{"id": "Everyone Wants You to Be Scared\t\t\t\t\t\t\tEveryone Wants You to Be Scared\t\t\t\t\t", "paragraph": "National ReviewAlong with its propensity to treat everything that a Democratic president wants as a MacGuffin and to subordinate every story with potential to embarrass the Left to the immediate reaction of the Republican party (“Republicans pounce on news that senator is serial killer!”), perhaps the most irritating habit displayed by our political news media is this one:Donald Trump wants you to be scared at the ballot boxhttps://t.co/XIOnv5sgnh— Chris Cillizza (@CillizzaCNN) October 30, 2018It is not, of course, untrue that President Trump wants Republican voters to be scared when voting. He does, and how. But — and this is the bit that Cillizza misses — so does every other politician in the United States. “Fear,” it seems, conjugates in much the same way as do “politics” and “divisiveness”: I run on hope, you run on fear; I do what’s right, you do what’s political; If we all agreed with my plan we’d be united; that you want us to agree with yours makes you divisive. And so on.One does not need to be a political junkie to have noticed that the Democratic party is, at present, somewhere close to fever pitch in its campaign against President Trump, whom, over the last couple of years, it has cast variously as the second coming of Adolf Hitler, George Wallace, Andrew Jackson, and more. Nor does one have to be especially switched on to have observed that, in 2018, hyperbolic language is by no means the sole preserve of the Republican party. Last year, Nancy Pelosi described the GOP’s proposed healthcare bill as “death” and its tax bill as “Armageddon,” while Hillary Clinton argued that “if Republicans pass this bill, they’re the death party” and Bernie Sanders predicted that 36,000 people per year would die yearly if Obamacare were repealed. A month ago, Terry McAuliffe warned that “the nomination of Judge Brett Kavanaugh will threaten the lives of millions of Americans for decades to come,” while senators within his party ranged from advising voters that Kavanaugh would destroy the United States Constitution in toto to repeating allegations that he was a gang-rapist. In recent weeks, Hillary Clinton has taken to arguing that “our democracy is in crisis” and that this midterm election is “our last chance” to save it, and, in so doing, echoed the “Flight 93” language that many of Trump’s supporters used to justify his excesses last time around.And here’s the thing: None of these people are breaking with tradition. In 2012, Joe Biden told a room full of African-Americans that Mitt Romney wanted to put them “back in chains,” while pro-Obama campaign commercials accused Romney of killing a woman with cancer and cast him as “not one of us.” Paul Ryan, for his part, was shown pushing elderly women over cliffs. The Republican party since 2010 has been called everything under the sun: terrorists, bomb-throwers, hostage-takers, neo-Confederates, you name it.As I write, Andrew Gillum is running around Florida suggesting that his opponent is a racist who is fine with slavery, and that Floridians must “get out there and vote like your lives depend on it . . . because your lives do depend on who the next governor is.” Somehow, I doubt we will see Chris Cillizza running “Andrew Gillum wants you to be scared at the ballot box” headlines. Why not? Well, because despite Cillizza’s insistence that reporters don’t “root for a side,” most of them do, in fact, root for a side, even if they can’t see it. And when you root for a side it becomes more difficult to see things from the other side’s perspective or to grasp that the guy you like is also fear-mongering and overemphasizing. It feels natural to suggest that your plan would “unify” because, unlike the dissenters, you wouldn’t have to give up anything up if it were implemented. For the same reason, it feels normal to suggest that the policies that you believe work are just “policies that work,” and that the people who disagree with you are motivated by fear, and that America would be united if only those who disagreed with you would go live somewhere else. None of us, after all, want to consider ourselves divisive, political, or scared.But we are those things — and, sometimes, with good reason. “Unity” is not only an unattainable state in a free country such as the United States, but it should be an unattainable state. Yes, there are some elementary questions on which we should all be able to agree, but on most issues beyond the basics we will not — and we should not, because if we did we would be suppressing dissent. Worse still, we would be suppressing dissent while reassuring the suppressed that they were better off for it.There is nothing intrinsically wrong with “politics” or “division” in a country in which the people are as politically divided as Americans are at the moment, especially when one considers the alternative, which is war. We have “politics” because we do not want to kill each other over every question of national import. This may not be a perfect system — and it may especially irritate the people who believe that they have been ordained to make all the important decisions on our behalf — but it is a lot better than the other option, which is widespread death and destruction. Now, as during most of American history, Americans have differing visions as to how their affairs should be organized. Add in that we now have a culture that elevates almost all issues to the national stage a central government that has taken over most of the functions of the states, and a social-media environment that rewards distortions and punishes nuance, and it is natural that our elections — which play the role of battles in the unlovely alternative — will be marked by fear, exaggeration, and opportunism. There are many things wrong with Donald Trump, including some of the campaign choices he reflexively makes. But he did not invent fear — or politics, either.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}