{"id": "A NYT/Planned Parenthood Spin Collaboration\t\t\t\t\t\t\tA NYT/Planned Parenthood Spin Collaboration\t\t\t\t\t", "paragraph": "National Review\n\t\tIn response to Planned Parenthood’s New President Appears on CBS and Doesn’t Mention Abortion Once Leana Wen’s first day on the job running Planned Parenthood was also the occasion for an interview in The New York Times Magazine. Not a single challenging question was asked, and no bit of misleading spin was countered.In her response to a question about what she thinks of the “misinformation” used against her organization, for example, Wen says, “There is a proposed gag rule in the Trump administration’s approach to federally funded family planning that would disproportionately impact low-income patients. A doctor or nurse would now be forced to censor their speech when it comes to providing women with the full range of reproductive-health options. Imagine if this was diabetes, and doctors and nurses were forced by the government to not give any information about insulin. It’s outrageous and, frankly, racist.”The truth, endlessly obscured in the press coverage, is that doctors at federally funded family-planning clinics would be allowed to discuss abortion. Any counseling about abortion would have to be nondirective — which is a requirement of Title X appropriations law, not something the Trump administration came up with itself. If a patient said she had decided on an abortion, the federally funded doctor could provide her with a list of health providers including some who perform abortions. These funding restrictions are in no way comparable to telling doctors they cannot “give any information about insulin.”The Times ran the interview under the headline, “Dr. Leana Wen Dislikes the Politicization of Health Care.” What that verbiage means, of course, is that Wen would like her organization to continue to be the country’s number-one performer of abortions while U.S. taxpayers remain its number-one source of funding. In other words, she likes politicization just fine.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}