{"id": "Republicans Remain in a Strong Position in State Legislatures\t\t\t\t\t\t\tRepublicans Remain in a Strong Position in State Legislatures\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAbrams Campaign Considers Drastic Legal Measure to Force Another Vote\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBroward County Missed Recount Deadline by Two Minutes\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFlorida Dems Gave Out Altered Form to Fix Absentee Ballots Past Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Election’s Lesson for Democrats: Don’t Nominate Hillary Clinton\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tMichael Avenatti Bites the Dust\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tUrban Cowboys\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Blue Wall\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLosing the Suburbs\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tToward a Bigger Coalition\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFlorida Judge Gives Voters Additional Time to Correct Rejected Ballots\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHillary Clinton: If Stacey Abrams ‘Had a Fair Election, She Would Have Already Won’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAnyone but Nancy Pelosi for Speaker\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe GOP’s Orange County Problem\t\t\t\t\t\t\t\nMost of the commentary on the 2018 midterms has focused on the federal level, where Democrats won a majority in the House and Republicans extended their lead in the Senate. The states have gone somewhat overlooked, notwithstanding several high-profile gubernatorial races. But the results across the state legislatures were interesting — and somewhat consistent with the national results. When combined with the governor results we can see that Democrats made important gains across the states, but the Republicans remain in a strong position.Going into the 2018 midterm, Republicans had complete control of 26 state governments — meaning that their party held both chambers of the state legislature as well as the governorship. (This count includes Nebraska, which has a nonpartisan, unicameral legislature but is effectively run by the Republicans.) The Democrats, on the other hand, had total control of 8 state governments. Meanwhile, 16 state governments were mixed between the two parties, with one side controlling at least the governorship or one chamber of the legislature.After the midterms, the Democrats have total control of 14 state governments, compared with 23 for the Republicans. The number of state governments with mixed party control fell to 13.There were 8 states where the governorship changed hands, all of which led to a shift in party control of some kind or another. These were mostly shifts to the Democrats, with the exception of Alaska, which moved toward the Republicans. But there were also notable shifts in the control of state legislatures, all of which favored the Democrats. Democrats took control of the state senates of Colorado, Connecticut, New Hampshire, and Maine and the state houses of Minnesota and New Hampshire.All in all, Tuesday was a good night for Democrats, but the GOP remains in a relatively strong position. It is worth bearing in mind that, prior to the 2010 midterm election, Republicans had total control of just 10 states, compared with 16 states under control of the Democrats; 24 states were split. After the 2010 midterm, Republicans had control of 21 state governments, compared with 11 for the Democrats, and 18 splits. In other words, Republicans will have total control of more state governments in 2019 than they did in 2011.\nTotal Democratic control is mostly confined to strongly Democratic states on the coasts. Most of the North Atlantic is under total Democratic control, and so is the Pacific Coast. Illinois and New Mexico, two other strong Democratic redoubts on the presidential level, are in the party’s control. But most of the swing states are under split or Republican control. The only exceptions are Colorado and Nevada, and the GOP has not won a presidential race in either state since 2004.The implication of this is that while the Democrats filled in some of the holes dug during the Barack Obama administration, they are still lagging behind their peak, in 2009. It is highly doubtful they will ever come back all the way; the events of the last decade have probably been the death knell for some state Democratic majorities. Democrats, for instance, controlled the state legislatures in Alabama, Arkansas, Louisiana, Mississippi, and West Virginia prior to the 2010 midterm. Those majorities are probably not coming back, barring some unexpected voter realignment.Another reason for continued Republican strength is the solid record of victories in Florida, Georgia, Iowa, and Ohio. Despite the persistent unpopularity of President Donald Trump, and strong Democratic challenges, the GOP maintained control of these state governments.It is a mistake to try to use midterm results to predict the next election. After all, Republicans swept the field in 1946, but went on to lose in 1948. The same happened with Barack Obama: The GOP won handily in 2010, but Obama won a solid victory two years later. Democrats had a similar experience in the 1980s: A major victory in the Senate in 1986 did not presage a presidential victory in 1988.But putting aside the meaning of these election results for 2020, it is still interesting to note that Democrats will control a lot less in the states in 2019 than they did in 2009, at the party’s recent peak of its power. NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}