{"id": "Sorry, Brian Kemp Still Won\t\t\t\t\t\t\tSorry, Brian Kemp Still Won\t\t\t\t\t", "paragraph": "National ReviewHere was the state of play as of yesterday per the Kemp campaign’s breakdown of publicly available information:As of Saturday, November 10, 2018 (12:00 p.m.)*Information below is public. Total votes reported: 3,924,658Kemp: 1,975,162 (50.33%)Abrams: 1,912,383 (48.73%)Metz: 37,113 (.95%)Kemp Margin: +62,779 votesCounties certified: 89Counties remaining to certify: 70Counties reporting total provisional results: 118Original provisional ballots in those 118 counties: 4,472Total provisional ballots accepted in those 118 counties: 2,138Percentage of provisional ballots deemed ineligible by county officials thus far: 52%NR's afternoon roundup of the day's best commentary & must-read analysis.In the counties that have reported official provisional numbers on the Secretary of State’s website thus far, Abrams only has a net 90-vote margin on Brian Kemp.Counties not yet reporting provisional ballot results: 41*Even with these counties not yet reporting final provisional results, several have already reported ineligible ballot numbers. For example: Fulton County (1,556 of 3,722), DeKalb County (646 of 3,000), Chatham County (140 of 329), and Henry County (172 of 339)Maximum number of eligible provisional ballots outstanding in those 41 counties — 14,204Maximum possible remaining outstanding military absentee ballots in counties not yet certified — 3,291Total possible ballots remaining (all eligible provisional ballots + all possible military ballots) — 17,495*Military ballots must have been received by 5 p.m. on Friday, November 9. They are included in certified count from their respective county.If all 17,495 possible votes were verified and accepted, and were cast for Stacey Abrams these would be the final results:Kemp: 50.10% — 1,975,162 (current total)Abrams: 48.95% — 1,929,878 (adding all 17,495 possible outstanding ballots)Metz: 0.95% — 37,113Total: 3,942,153Kemp Margin: +45,284So even if Abrams received every possible outstanding ballot there would be no runoff and no recount. This election is over. Brian Kemp is the governor-elect of Georgia.  NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}