{"id": "Will Florida’s Senate Race Remain Too Close to Call until Election Day?\t\t\t\t\t\t\tWill Florida’s Senate Race Remain Too Close to Call until Election Day?\t\t\t\t\t", "paragraph": "National ReviewThe last week has featured an avalanche of polling in the Florida Senate race, as Democratic incumbent Bill Nelson seeks to defend his seat against GOP governor Rick Scott — and the data haven’t brought a great amount of clarity to the contest.The two newest surveys are no exception. The first, conducted by Florida Atlantic University over this past weekend, showed Scott ahead of Nelson 42-41 percent, with 13 percent of voters undecided. The second, conducted by Gravis this past Monday and Tuesday, found Nelson leading Scott 49-45 percent, with 7 percent undecided. Each poll surveyed about 750 likely voters.According to the Gravis poll, 48 percent of Florida voters either “strongly” or “somewhat” approve of Nelson’s job performance in the Senate, while 52 percent say the same of Scott’s performance as governor, and 50 percent say the same of President Donald Trump.These latest divergent results come on the heels of several polls that likewise offer observers little to go on. Quinnipiac put Nelson up by seven points and CNN gave him a five-point lead, while St. Pete Polls found Scott leading Nelson by one point. Meanwhile, Nelson leads Scott by 3.5 points in the RealClearPolitics average.Overall, the edge seems to belong to the Democratic incumbent. In the surveys where Nelson is ahead of his GOP competitor, he tends to be up by several points, while the polling advantages accorded to Scott are usually a slimmer margin of one or two percentage points. Even so, the race certainly remains a tossup, and Democrats shouldn’t consider Nelson out of the woods.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}