{"id": "Farewell to a Hollywood Master\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBelieve in Creed II \n\n\n\t\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTERF Wars\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\t‘The Process of Living’\t\t\t\t\t\t\t\nA  frustrated musician-writer once wrote that the easiest thing in the world was to compose a passage of weird, moody background music, the kind of thing that could play against a scene of creepy suspense at the movies. The hardest thing, by contrast, is to do, even once, what Paul McCartney has done hundreds of times: compose a catchy tune or just a hook.So it goes in the screen trade: Coming up with a line that catches hold on the imagination and enters the language is what every screenwriter hopes to do. One who mastered it above virtually all others was William Goldman, who died Thursday at 87.“Follow the money.” “You crazy? The fall’ll probably kill you.” “Is that what you call giving cover?” “Who ARE those guys?” “Is it safe?” “My name is Inigo Montoya. You killed my father. Prepare to die.” “Inconceivable!” “You keep using that word. I do not think it means what you think it means.” Even “follow the money” is Bill Goldman’s line, not WoodStein’s, and so is the most indelible line about Hollywood itself: “Nobody knows anything.”How does a line become etched into our group memory? Having a great actor sell it helps. So does saturation exposure: “Go ahead, make my day,” growled by Clint Eastwood’s Dirty Harry in 1983’s Sudden Impact, swept the nation before the movie even hit theaters because it appeared in an omnipresent commercial for the film. The line is credited to Charles B. Pierce. Who? Exactly. Mostly a catchphrase catches out of serendipity. “I’m walking here!” was made up by Dustin Hoffman on the spot, while Midnight Cowboy was shooting on Sixth Avenue and a (real) cab driver got too close. Cameron Crowe consciously worked to come up with a catchphrase for Jerry Maguire. Here it is: “Quit using that word, kwan! That’s my word!” Crowe was caught off guard when a different line from the movie, “Show me the money!” entered the language instead.Goldman supplied Bartlett’s with material too many times to be lucky. Though he won two screenwriting Oscars (for Butch Cassidy and the Sundance Kid in 1969 and All the President’s Men in 1976), he never became a household name, possibly because he didn’t direct his own films and didn’t appear in them. His lines are scattered among various personalities: We associate them with Robert Redford, with Laurence Olivier, with Wallace Shawn. Only if you read such memoirs as Adventures in the Screen Trade and Which Lie Did I Tell? will you appreciate the man, his wit, his storytelling prowess. Butch Cassidy is one of the greatest screenplays ever written, a template for the cool-buddy comedy in which every insult establishes just how much the guys love each other and the desperadoes continue firing quips at each other until the bullets blast into them. All the President’s Men streamlines an enormously tangled story and creates a thriller out of detail and doggedness.\nScreenwriters’ names don’t appear above the title or even in large lettering. Also there are usually several of them involved in each picture. So at the movies we tend not to be aware of who is telling us the story. True, these people are handsomely paid. But the lack of creative control faced by most of them is a source of endless frustration. Reading Adventures in the Screen Trade, you’ll want to be a screenwriter . . . and then you won’t. Even at the peak of the most glamorous of all professions, Goldman is full of woe. A Bridge Too Far (1977), about 1944’s Operation Market Garden attack in the Netherlands, defeated him; there was just too much story to get into one movie. At a screening of the Redford barnstorming drama The Great Waldo Pepper (1975), Goldman noticed with unease the exact moment in his script when he lost the audience. Goldman spent years on a script he hoped would turn out to be a cross between Lawrence of Arabia and Jaws, entitled The Ghost and the Darkness. It finally appeared with the then-hot Michael Douglas and Val Kilmer in 1996 but then instantly disappeared and now is forgotten.Goldman never had to worry about where his next meal was coming from, but when you’ve written a series of flops (Absolute Power, Hearts in Atlantis, Dreamcatcher), the system gets spooked. It turned out that the breezy Mel Gibson picture Maverick (1994) was Goldman’s last screen success, and Hollywood lost confidence in him. He retreated into polishing other, lesser, scribes’ work. In Adventures in the Screen Trade, a steady guide to the nuthouse, he notes that studio executives know they can’t do the camera guy’s job, or the sound guy’s job, but everyone knows the alphabet, hence everyone thinks he can do the writer’s job. Writers are disposable, and even Goldman’s words got rewritten on a whim. Plenty of great ones made it through, though. Bill Goldman created a part of our consciousness. Few writers can say the same.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}