{"id": "A Conspiracy of Dunces\t\t\t\t\t\t\tA Conspiracy of Dunces\t\t\t\t\tThe Limits of CivilityLet’s Just Do It and Be Legends, ManIdentity for Me, Not for TheeParty Proxies EverywhereVarious & Sundry", "paragraph": "National ReviewEDITOR’S NOTE: The following is Jonah Goldberg’s weekly “news”letter, the G-File. Subscribe here to get the G-File delivered to your inbox on Fridays.Dear Reader (Especially all incompetent conspiracy plotters),When I was in eleventh grade, my English teacher, Mrs. Bab, made me sit in the front row right by her desk to keep me from getting into trouble or talking to friends. One day, when we were reading Beowulf, Mrs. Bab called on my friend Henry (I’ll leave his last name out of it) and asked him to summarize the story so far. Henry was a very capable B.S.er, but he was no match for Mrs. Bab.Henry, who had not done the reading, offered an improvisational tour de force, repeating back random words he picked up from the classroom conversation. “Grendel and the Geats are fighting with Wiglaf for blah blah blah . . .”Mrs. Bab offered a two-word rebuke: “Dreadful, Henry.”But Henry didn’t pick up that he was being rebuked at all. He thought that she was giving him a hint. “Right,” Henry replied. “And then the Dreadfuls came down from Denmark . . .”At this point, all time slowed down for me. I turned to Mrs. Bab and, with my best Puss ’n Boots eyes, I plaintively whispered, “Please. Let. Him. Go. On.”I wanted to hear Henry go on and on about the marauding Dreadfuls. Perhaps after a while, he could have added the heroic tale of Sir Awful and his band of Incompletes and Unacceptables. But it was not to be.I hadn’t thought about all that for a long time, but that rich bouillabaisse of feelings — schadenfreude (joy at the misfortune of others), fremdschämen (embarrassment for others who don’t have the good sense to be embarrassed for themselves), and plain joyful mirth and glee — came rushing back to me recently. This time, however, there was the added spice of Justice and Comeuppance in the broth. (Henry was at least my friend.)Jacob Wohl and Jack Burkman are awful people. Now, let me admit my own hypocrisy here. As part of my growing disillusionment with partisan politics and disdain for raw tribalism, I’ve been trying — with only modest success — to pull back on the sort of casual mockery and demonization that was once part of my kit bag.But the essence of serious thinking is the ability to make serious distinctions between superficially similar things (and finding similarities between superficially different things — such as nationalism and socialism). And if we can’t mock denizens of the coprophagic phylum inhabited by parasitasters such as Wohl and Burkman, then no one save the inhabitants of the handful of lower orders of garbage people — Nazis, terrorists, pedophiles, various Florida Men — can be mocked. That’s not a world I want to live in. Civilization isn’t achieved by eradicating social stigma, but by training it on the most worthy subjects.So, as I was saying: For the last 48 hours or so, these two jackwads have been beclowning themselves across such a broad spectrum of asininity that the mind reels to capture the glory of it. Only Hollywood could come up with a visual metaphor of their almost Nietzschean will to so completely live down to their reputations.I suppose that I should back up. Jacob Wohl (rhymes with troll — for a reason) is a Twitter gadfly and former financial grifter who once claimed at the age of 18 to have had decades of experience as a hedge-fund manager. Jack Burkman’s first claim to fame came when he led an astroturf freak-out about an NFL quarterback being gay. Burkman’s own (gay) brother explained that it was “just an attention grab and a media grab to pander to those folks who pay him to lobby on their behalf.”Perhaps in the same spirit, Burkman became even more famous by peddling conspiracy theories that Seth Rich was murdered because of his involvement in the leak of the DNC emails. I should also add that they both became Trump sycophants from afar, no doubt sensing opportunities for grift and the fame that could create more opportunities for grifting.Which brings me to this week. Burkman and Wohl announced that they had learned of evidence that Robert Mueller had “brutally raped” a woman named Caroline Cass.Wohl is now walking through the accusation, saying his client was \"brutally raped\" by Mueller. There's already inconsistencies between his account and the docs handed out. pic.twitter.com/rM5I4FA7jH— Jared Holt (@jaredlholt) November 1, 2018This evidence came from Surefire Intelligence, a supposedly highly regarded investigation firm.Before their Thursday press conference, Wohl denied having anything to do with Surefire Intelligence. “I don’t have any involvement in any investigations of any kind,” he told NBC News.But Wohl apparently had no idea that the journalism profession contains individuals who know how to use the Internet. Many of the photos on the Surefire Intelligence website were stock photos, including one of the Israeli model Bar Refaeli. Another shadowy image, when brightened, revealed Wohl himself. When NBC called the listed phone number for Surefire, it went straight to Wohl’s mom’s voicemail.John McCormack has more details, but you get the point. These guys are idiots. Yes, they are funny idiots because it’s always funny when idiots celebrate their idiocy as genius. Burkman defended Wohl’s age at the press conference, insisting that “Jacob is a child prodigy who has eclipsed Mozart.”(FWIW Mozart’s first public performance was at the age of five. At six, he played for the royal court. By seven, he played across Europe. At twelve, he wrote his first opera. And so on).When Wohl was pressed for evidence that Mueller’s accuser even exists — she almost surely doesn’t — he offered a picture of a woman with her face blocked out.It turns out that, again, Wohl underestimated the wizardry of the computer age. The woman in the picture was his “girlfriend.”I put that in quotes because that woman denies she ever dated him.This gets funnier.  The photo of the \"accuser\" is just an old photo of what Wohl said was his girlfriend, with the face MS Painted-out.Now the woman allegedly in the photo claims they've never dated and Wohl is lying about having dated her. https://t.co/HkienzheV6— Donny Ferguson 🗽 (@DonnyFerguson) November 2, 2018It’s like Wohl is in his own Choose Your Own Adventure book, and every direction he goes leads him to a room where he has to punch himself in the crotch, while women he never dated point and laugh. No wonder this guy was Gateway Pundit’s ace reporter.But just because they are idiots, that doesn’t mean they aren’t evil. Cesar Sayoc, the mail bomber from last week, was apparently an idiot too. We don’t know for sure yet, but it appears he really did think his bombs would work. If that’s the case, his incompetence has no bearing on his villainy. Likewise, these wormtongued rantallians wanted to falsely accuse Mueller of rape.If you were outraged by what Brett Kavanaugh’s enemies tried to do to him, you should be no less outraged by what these peddlers of malicious jiggery-pokery tried to do. By all means laugh, I certainly am. But these guys need to go to jail all the same.NR's afternoon roundup of the day's best commentary & must-read analysis.Maybe in prison, Wohl can fulfill his destiny as a child prodigy by inventing toilet-brewed pruno that Mozart could never have imagined.I loved this line from CNN’s Don Lemon:“We have to stop demonizing people and realize the biggest terror threat in this country is white men, most of them radicalized to the right, and we have to start doing something about them.”As I said on Twitter, that sentence is like a snake eating its own tail. In a funny way, it reminds me of John Locke’s “Letter Concerning Toleration,” which was a hugely important advance for mankind and the ideas of religious tolerance and pluralism. Paraphrasing it in Lemonesque terms, Locke said, “We have to stop oppressing people of different faiths and realize that the biggest religious threat in this country is from Catholics, most of them radicalized by the evil pope in Rome, and we have to start doing something about them.”In fairness, if you listen to the broader context, Lemon’s not quite as demonizing of all white men as it seems from just that one soundbite. But it remains the case that if a Fox News host said virtually the exact same thing but replaced “white men” with “black men” or “Muslim men,” you can be sure that Don Lemon would be among the first to decry the racism or bigotry on display, and no appeal to broader context or data would change his mind.Oh, and about that data: Color me skeptical. The chart most frequently tweeted showing that right-wing white-male terrorism is America’s most serious threat begins in 2007, which is a pretty convenient date. But my skepticism isn’t really about the numbers. It’s the effort to lump in all of these different mass shooters as “right-wing” “white male” “terrorists.” For example, this article at Vox includes in its list of white-male killers the Las Vegas shooter and the Republican baseball-practice shooter. The former’s motives are unknown and the latter’s were left-wing. Again, I think that white-nationalist or white-supremacist groups are a real threat and that they should be taken seriously. But that’s not typically how it’s discussed on cable news or Twitter. In part because of Trump hatred but also Trump’s rhetoric, enormously important distinctions are blurred, and sweeping guilt by association is the order of the day.Consider the understandable passion around the Squirrel Hill synagogue shooter. You would get the sense that anti-Semitic hate crimes in America are the sole provenance of angry white men. But anti-Semitic incidents (none nearly as horrific as the synagogue shooting) are remarkably common — far more common than anti-Muslim hate crimes. In New York City, where most of the media figures decrying the anti-Semitism unleashed by Trump live, not a single anti-Semitic act has been attributed to far-right groups in the last 22 months. And, again, anti-Semitic incidents are frequent in the Big Apple.Contrary to what are surely the prevailing assumptions, anti-Semitic incidents have constituted half of all hate crimes in New York this year, according to the Police Department. To put that figure in context, there have been four times as many crimes motivated by bias against Jews — 142 in all — as there have against blacks. Hate crimes against Jews have outnumbered hate crimes targeted at transgender people by a factor of 20.It’s almost as if anti-Semitism is a huge problem only when it can be used as a partisan cudgel.The notion that white men — about a third of the U.S. population — are a terror threat is a real “Big, if true” statement. The problem with Lemon’s claim isn’t the point he was trying to make but the glibness of how he stated it — and how he thinks about it. And he’s hardly alone. You can find similar lazy bigotry on MSNBC and CNN daily.Tucker Carlson made this point last night on Fox.I agree with a lot of what Tucker says here. My only problem is that you can find the “right-wing” version of the same phenomena on Fox and elsewhere on the right all the time. Though, I will say that it’s less naked, in part because of the double standards we have about what you can and can’t say about white people and non-white people. And, unlike Lemon who has doubled-down on his comments, when Fox hosts cross a line, they often — though hardly always — apologize.But there’s one thing Tucker said that I would like to focus on.If you want to know what Democrats are thinking, watch CNN and MSNBC. Which over the past couple of years have come to function much as the DNC used to function, as the Democratic Party’s Brain Trust and mouthpiece.I think this is indisputably true. I’ve been amazed of late to hear the folks on MSNBC’s Morning Joe openly exhort viewers to vote Democrat. It’s not remotely subtle anymore.But can anyone dispute that something very similar can be said about Fox News?There’s an important distinction to be made. There’s an asymmetry between Fox and MSNBC and CNN. Fox has a distinct separation between its opinion shows and news shows. The separation can get fuzzy for viewers, depending on what pundits are asked to come on as guests. But the actual news anchors — Bret Baier, Shepherd Smith, Chris Wallace, Bill Hemmer, etc. — do not hector viewers to vote Republican or go on opinion-laden stemwinders about how Comrade Trump will deliver the greatest wheat harvests man has ever seen. With a handful of exceptions, mostly at CNN (Jake Tapper and Wolf Blitzer come to mind), many of the news people at CNN and MSNBC often indulge in sweeping partisan punditry. I think Chuck Todd tries to be even-handed, but people such as Lemon, Chris Cuomo, Stephanie Ruhl, Andrea Mitchell, and Christiane Amanpour go back and forth across the line between news and opinion constantly.This is one reason why Trump’s “fake news” and “enemy of the people” rhetoric works. Viewers see people who claim to be heroic guardians of objective reporting go on endless anti-Trump tirades that often drift into sweeping denunciations of Trump voters and even white people generally.That said, the opinion side of Fox and Fox Business — where I still have quite a few friends — is top-heavy with people who serve as the de facto Brain Trust and mouthpiece for Donald Trump (with the most notable exceptions being Dana Perino and Neil Cavuto, both of whom I have a lot of respect for). There’s a reason why Fox & Friends is called the “President’s Daily Brief.”My point here is one I keep returning to these days. Each team wants to say that the other team is violating norms — and they’re right. And each team says in response, “You’re a hypocrite” or, “Who are you to cast stones when so-and-so said X.” And they’re right, too.Career-wise, it’s probably insane for me to write any of this. But I just don’t care anymore. This timeline is so bizarre that if I saw an old-fashioned British phone booth in my driveway, I’d jump in and hit every button I saw.Maybe if I was lucky, it’d take me to the timeline where Mitch Daniels is president. Or maybe, even better, it’d take me to Spaniel Heaven.There are two — two! — new Remnant podcasts this week. The first Remnant with Reihan is a freewheeling wonk-a-thon on immigration, nationalism, conservatism, and Reihan’s dismaying Bismarkian tendencies.The second is double-whammy: a conversation with laid-off Uber driver Ben Sasse, and then some purely rank punditry from me.Canine Update: The beasts love Fall. They love, love, love, love, love, love it (the cats like it too). We do have to look them over for ticks quite a bit these days, but they are on the junk that keeps the pests from actually attaching. A staple conversation between the Fair Jessica and me is how much Zoë and Pippa would like this place or that. Whenever we drive past a farm or ranch, we’ll say, “Oh, the Dingo would like it there” or some such. I’ll often say Zoë would like some place because it looks like it’s full of critters that she can hunt and kill. But my wife has always argued that Zoë’s true earthly Valhalla is suburbia. And it’s true. She loves being off leash running around through people’s yards chasing critters that think they are safe. We can’t really let her do that in our neighborhood because there are too many small dogs around, and Zoë has a number overlapping prejudices. She’s very territorial about her neighborhood — no other dogs but Pippa should be allowed here. She’s also a bit of a kick-down/kiss-up type. She’ll growl at big dogs on her turf, but she knows her limits. Nonetheless, I’ve always thought — with some evidence mind you — that Zoë’s semi-wild status came out most gloriously on mountain hikes and the like.I’ve come to change my mind. The other morning, I had to get to the NPR studios very early. So we did a walk around the neighborhood around 5:00 a.m. I know from experience that no one walks their dogs that early around here. So I took a chance and let her off the leash. And Oh My Stars and Garters did she love it. She zoomed up and down the block, investigating one rumored rabbit bunker after another. She zipped around silently mouthing, “This is great! This is so great!” She didn’t catch anything. But it did dawn on me that not only was my wife right, but that this only buttressed her serial-killer status. So many of the great serial killers — Michael Myers, Freddy Kruger, the dude in the closet in When a Stranger Calls — preyed in suburban hunting grounds.Meanwhile, Pippa’s a lover, so her favorite thing about suburbia is running up to people and dropping tennis balls at their feet. He true joys are water, mud, and tennis balls, preferably in combination. And while the water can’t come to Pippa, she’s perfectly happy chasing a tennis ball in the backyard or a tennis court or pretty much anyplace else.Gracie meanwhile is more refined. Which Zoë and Pippa can appreciate.ICYMI . . .The latest GLoPLast week’s G-FileHoward Dean is foolishTrump is corrupting nationalismMy UNC–Chapel Hill speechTrump didn’t cause the Pittsburgh massacre, but he’s not helpingJohn Locke on zombiesThe upside of Trump’s Twitter obsessionMy interview on Planet HawkinsWhen NR’s fastest talkers collideAmerica shouldn’t become a parliamentary systemAnd now, the weird stuff.Debby’s Friday linksAmerican saves Magna CartaAmericans drink Iceland’s beerFried brain sandwichAre cats evil?Are dogs good?Well . . . are they?A house of the future . . . as envisioned by 1945The world’s first carThe last lighthouse keeper in CapriIf the Pentagon tried to build the Death Star . . .Mr. Feeny for the winDeep-sea octopiForgotten Supreme Court historyZombie antsBeauty can be yoursChampagne supernovaReagan was awesomeNR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}