{"id": "Tip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBelieve in Creed II \n\n\n\t\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Lessons of the Asia Bibi Case\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAgainst the ‘Coercive Elimination of Dissent’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\nThe Metropolitan Museum of Art’s fascinating new show, Jewelry: The Body Transformed, has many strengths. It is cross-cultural studies gone right, using splendid art from many places, times, and traditions to reveal enduring, shared human yearnings. Shows looking across cultures and the ages are often bad. The objects might all be, say, paintings of fruit, but they’ll all look like huffy, unhappy fruit if they’re not with things from their own period and school.This show draws almost entirely from the Met’s little-known collection of jewelry. Its curators and exhibition designers hit an exquisitely elusive balance of poshness, simplicity, and seriousness in the show’s look. No writer could resist curator Melanie Holcolmb’s final words in her essay as she describes jewelry’s intellectual and sensual authority as a medium that goes well beyond cosmetic allure:It expresses both the subjunctive — what is imagined or wished for or possible — and the indicative — a statement of fact. Donning a piece of jewelry is a bid to be a better self. Wearing it affirms you have become one.Well said. The show begins with the body, the thing we humans universally share, and it cleverly does it in the first gallery from toe to head. Jewelry is the unique unity of body and art, the body a moving canvas to which the best jewelers, great artists and designers, respond.As the means of mobility and the practical mechanics of life’s journey, the feet and legs have been richly decorated. Egyptian mummies had gold sandals and toe stalls both propelling the dead to eternity and keeping the foot intact, since toes sometimes fell off during ancient embalming. Belts, near the groin, are loaded with gendered symbolism. Rings often connote identity — they’re often the most individualized of jewelry — and that can mean commitment to another. The neck links, physically and symbolically, the head and the heart. It has expanse and frontality, like a billboard or prime real estate. A diamond-and-pearl necklace by the great, largely unknown maker Dreicer & Co., from 1905, is the diamond standard of America’s Gilded Age splendor. But the focus on the neck is timeless. What the Dreicer necklace has in opulence, a Celtic Iron Age torque, or neck ring, has in direct, near brazen power. Each visualize a relation between wealth, perfect design, and possession (specifically, the wearer’s by another); one does it with exquisite subtlety, the other is more to the point. Both artists had their own way to make a pretty prison.Then there’s the head. Ears frame the face and so are fun to decorate, but they also perceive. Consequently, they sometimes feature symbols associated with obedience. Sometimes they are designed to enhance sound, whether to hear the whispers of divinities before or after death. The nose, mouth, eye, and tongue jewelry make a statement.Then there are the crowns. How to wear one? Good posture helps. The men and women who wore the crowns, tiara, and headdresses in the show had to learn to fill their headwear with authority. Whether a Chinese Ming headdress from the 18th century or a ninth-century Indian diadem or an Egyptian tiara with gazelles and a stag, they’re the next best thing to a halo. The skill in making them is sublime, as is the sense of color and design.\nJewelry had enormous importance in brokering contacts between mortals and gods. People were often loaded with jewelry as they went to their tombs, giving them eternal protection. Jewelry that rustled summoned the gods. Spiral jewelry signified both the universe’s infinity (its design spun) and its rootedness in a fixed point at the spiral’s beginning. Sometimes the craftsmanship is so complex that we puzzle today to understand how a piece was made.It’s not all about lifestyles of the dead and divine. I loved the sections of the show on American jewelry, especially the great early-20th-century designers and the artists making jewelry today. Jewelry entered the realm of luxury brands in the early 1800s, with makers in Rome, Paris, London, and, later, New York developing products for women who weren’t titled but merely rich. Jewelry sometimes reflected discoveries from antiquity — Rome’s Castellani firm often for towed from Etruscan and Byzantine motifs — or new styles such as Lalique’s art-nouveau enamel, opal, and amethyst necklace from the late 1880s. Tiffany is well represented in the show, as is Marcus & Co., a mostly unknown New York firm whose work is as good and edgier. There’s also a section on jewelry sets, which started as royal accessories. Women from all classes eventually learned to love tiaras, necklaces, bracelets, and earrings matched, creating elegant ensembles whether made from gems or paste.I look at jewelry as art and its own medium, but contemporary jewelry is often sculpture meant for display on a body. Shaun Leane’s art — a jaw piece, a crown of thorns, and an aluminum and glass veil — link vanity and allure to pain. There’s a point where glamour flirts with danger and revulsion. It’s not meant for Easter dinner, however much of a conversation starter some of it might seem.In virtually all cultures, gold has been precious, but in many it was divine because it evoked the sun. The so-called Golden Man of Calima is a collection of men’s decoration reserved for leaders in the Cauca Valley in Columbia from the first through the seventh centuries,  a.d. Decked out from head to toe, the “golden men” were less men than earthbound gods. Jewelry isn’t just for women. Hellenistic kings used gold not to evoke divinity but grandeur and power. Ornamented chains, crossbow brooches, signet rings, pectoral medallions, swords, and, of course, ceremonial armor project both achievement and authority. Each culture might have its own iconography, but all start with precious base material that’s heavily decorated.The show has what I call an evening palette: black cases, dark wall colors, and a balance of soft lighting and movie-premiere spotlighting. It’s perfect for the objects and the themes, whether elegant evening jewelry or jewelry for the afterlife. The lighting makes the most of sparkle and a buff sheen, as the object best provides. Even the pronounced serif font for the wall text seems to flicker. It seemed to prove disorienting for viewers, though, when I was there during a preview. I thought it was fine, but I heard people mutter that it was too dark. They weren’t accustomed to museum space lit so evocatively.I understand it was a harmonious partnership between exhibition designers and curators. Sometimes designers flatten both the art and the curators like rollers on new interstate pavement. Their design can overwhelm the art and treat it like illustration. When I was a young curator, we saw designers as an assault on our integrity, as visual philistines, and marginalized them ruthlessly. Now, in many museums, they have the power of crazy despots. The Met’s jewelry show was a good collaboration. They have great curators and great designers who respect one another and let the art do its thing. There were many curators involved in the show, but it doesn’t have the feeling of a committee at work.I’m happy to see the Met do a strong, satisfying show using its collection. This brings objects to the public that are normally never seen, so we learn truly new things. This capacity is a big reason we have encyclopedic museums. It’s also cost-effective. The Met for years was profligate. It still does far too many loan shows. I can’t understand why it’s doing the big Delacroix retrospective, this show, and so many others at the same time. The jewelry show, with some expansion, could easily have carried an entire season. It’s that strong intellectually and that appealing. With a new director, the Met would do well to focus its energy and money on fewer shows, as too many only cannibalize one another, and on their superb permanent collection galleries.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}