{"id": "In Defense of Premature Christmasing\t\t\t\t\t\t\tIn Defense of Premature Christmasing\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBelieve in Creed II \n\n\n\t\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Lessons of the Asia Bibi Case\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAgainst the ‘Coercive Elimination of Dissent’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\nI’m one of “those people.” As soon as the clock strikes midnight on November 1, it’s tinsel time. It’s not beginning to look a lot like Christmas quite yet, outside of trigger-happy department stores preying on prudent grandmothers to get their shopping finished before the season is in full swing and parking lots are packed with holiday shoppers — but inside my kitchen cabinet is my artillery of holiday spices and cookie cutters, ready for snowmen and Christmas-tree-shaped cookies. My closet is stocked with red cable-knit sweaters and velvet dresses that I bought at the end of the last Christmas season, with tags ready to finally be removed.Christmas is such a wonderful time of year — the most wonderful — that I want to begin preparing for it while candy wrappers are still fresh on the ground from trick-or-treaters.I’ve discovered that this makes me a pariah. When I admit that I’m the type who appreciates beginning Christmas prematurely, people act as though I’ve denied Allah’s existence in Mecca. I understand that consumerism is largely responsible for choosing the earliest possible date to begin the season, in order to maximize sales. But what’s so wrong about extending the joy and purity of the season leading up to the celebration of Christ’s birthday — the most important holiday of the year, alongside Easter — by a few weeks, perhaps allowing it to remind us of its magnitude, and as a preface to Advent? What’s so wrong about scouting out the Walmart Christmas aisle once it’s constructed (and may still have remnants of costumes and candy from Halloween) and reading through meaningful, edifying messages on cards in lieu of reading the latest breaking-news story reminding us of our depraved political hellscape? What’s so wrong about spending more time reviving Christmas traditions that we’ve inherited, and that remind us of our families and innocence, when the world around us seems to want to spend the rest of the year flirting with the “progress” continuum that has often suppressed this heritage?As much as I consider eggnog an affront to food — the only time booze and raw eggs should ever be combined is in tiramisu — it’s a staple of Christmas dining, and one that Americans remember to resurrect every year. We can also expect the revival of swing and jazz on the radio, even among people who aren’t my Boomer-aged father, who winces at the sound of music popular among Millenials but who can, for a few weeks of the year, listen to Perry Como or Frank Sinatra with young adults and children. It’s the opportunity to tell children why we celebrate Christmas, and the wonderful Biblical story of the birth of Jesus and of the three kings who visited Him.The season gives us a rare time capsule, and that’s the source of its warmth — the memories from our childhoods, the comfort of sentiment that tradition gives us.\nIf we could find a balance between the excess splurging on gifts on Black Friday (I’ve visited war zones with less contention than Macy’s on that day), then maybe an early Christmas season could rejuvenate us, and allow us to refocus our lives on what actually matters.In the meantime, I’ll be searching for vegan alternatives to eggnog.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}