{"id": "The Blackface Party\t\t\t\t\t\t\tThe Blackface Party\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 17\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHow D.C. Is ‘Getting Guns Off the Street’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tOn Criminal Justice, Trump Embraces the Left’s Racism Rhetoric\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBetsy DeVos Strikes a Blow for the Constitution\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump Appointee Judge Rules for CNN. Good.\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tJudge Orders White House to Return Acosta’s Press Pass\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThis Day in Liberal Judicial Activism—November 16\t\t\t\t\t\t\t\nI must have missed something: Was there some kind of all-hands white-people meeting at which we voted to kick the Democrats out?Elizabeth Warren, Rachel Dolezal, Beto O’Rourke — what’s up with all the ethnic play-acting? Isn’t cultural appropriation supposed to be a bad thing among progressives? Isn’t blackface (and brownface) supposed to be an unforgivable sin?If a fraternity at a big state university had made the kind of mockery of Native Americans that Senator Warren has, it would be kicked off campus — and no pleas about a vague and mysterious “Cherokee princess” way back in the lost ages of the family history would save them.Senator Warren is the main offender of the moment, a significantly-whiter-than-the-average-white-woman white woman who has for years been masquerading as a Native American, telling transparent bumfodder stories about how her parents had to elope because her mother was part Cherokee and part Delaware, an obvious attempt to claim some of that victimhood juice secondhand. She allowed herself to be advertised as a woman of color by Harvard, happy in the coincidence that “her major professional advances — to the University of Pennsylvania and then to Harvard — came after she began formally identifying as Native American, a distant descendant of Cherokee and Delaware tribes,” as the Boston Globe put it.(She is a woman of color: Pantone 11-0602.)Warren, previously a mostly obscure academic and an author of dopey self-help books — The Ultimate Lifetime Money Plan — needed a little extra kick to stand out from the crowd of sanctimonious white ladies who rest like a dollop of low-fat sour cream atop the nation’s educational institutions. And so she went all in on her fictitious Indian ancestry: You’ll remember the recipe for “Pow-Wow Chow” and other “Indian” dishes plagiarized from the New York Times.\nThe Cherokee Nation is not buying it, denouncing Senator Warren’s extraordinarily tenuous claim to native ancestry as “a mockery,” “dishonoring legitimate tribal governments and their citizens,” “inappropriate and wrong,” etc. “Senator Warren is undermining tribal interests with her continued claims of tribal heritage,” Cherokee Nation secretary of state Chuck Hoskin Jr. wrote.Identity politics is generally goofy and often trivial, but this is no trivial thing: The Cherokee Nation is a separate sovereign nation, with the rights and dignity that implies. It deserves to be treated with respect, not used as a prop by an ambitious low-rent hustler from Oklahoma.White people did some pretty rotten things to the Indians over the years. But making them take Elizabeth Warren on top of it? That’s just mean.Senator Warren is a variation on the theme of Rachel Dolezal, a.k.a. Nkechi Amare Diallo, the sanctimonious white lady who masqueraded as a black woman for political gain (she was a person of some consequence as the NAACP president in Spokane), blonde and blue-eyed though she had been until she adopted a cosmetic strategy to appear passably black. (Doležal is Czech for “bum.” Fitting.) Like Senator Warren, she had public ambitions that weren’t entirely well served by her private reality, so she invented a new one.A milder version of that is playing out this election year in the campaign of Robert Francis O’Rourke of Texas, who has adopted the Hispanic nickname “Beto” as part of his public political persona. O’Rourke is as Mexican American as Senator Warren is Native American and as Rachel Dolezal is black. But Hispanic names poll well in Texas, and so this smug prep-school jackass is playing a backhanded race card against Senator Ted Cruz — the man in the race who is actually Hispanic. If O’Rourke really had wanted to Spanish up the ballot, he at least could have had the honesty to run as “Pinche Gringo,” which is what he is.America is a wonderfully mixed-up place. You meet somebody named Qiáng MacFarland Lopez and the safe bet is that he’s an American. And many of us have had the peculiar experience of feeling a strong sense of kinship with a culture that is not our own. (That’s me in a Swiss train station.) “Multiculturalism” is an intellectual dead end, but culture is not, and there is much to be said for learning Chinese or Hebrew or Nahuatl, reading the great Spanish novels, or coming to understand Buddhism as something more than a feel-good corporate trend.To consider oneself fixed within the bounds of one’s own specific patrimony is an intellectual poverty. But Senator Warren has not dug into Cherokee history, language, or culture. She simply used the fiction of her Cherokee identity to get something she wanted — a little political leg up on the rest of the sanctimonious white ladies. That’s cheap, vulgar, and wrong — and the Cherokee are right to be annoyed by it. And if Texas Democrats really want a Hispanic name on the ballot to put up against Senator Cruz, then they might consider — here’s a radical thought! — nominating someone of Hispanic heritage as their candidate. As for Rachel Dolezal — my best guess is that being Rachel Dolezal is its own punishment.Senator Warren owes the Cherokee Nation an apology. And if the Democratic party will not see to it that she does the right thing, then it should be considered a party to her deceit and to her insult.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}