{"id": "Off the Shelf: Imagine There Is No Heaven\t\t\t\t\t\t\tOff the Shelf: Imagine There Is No Heaven\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBelieve in Creed II \n\n\n\t\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Lessons of the Asia Bibi Case\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAgainst the ‘Coercive Elimination of Dissent’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\nEditor’s Note: Every week, Michael Brendan Dougherty writes an “Off the Shelf” column sharing casual observations on the books he’s reading and the passing scene.A fad or heresy is the exaltation of something which even if true, is secondary or temporary in its nature against those things which are essential and eternal, those things which always prove themselves true in the long run. In short, it is the setting up of the mood against the mind\n— G. K. ChestertonA little over a decade ago, I did a bit of journalism on what was then called the “new atheism.” I went to a conference for atheists held in a hotel in Virginia. I still think I produced a fine-enough piece of work, but I do feel a bit guilty about it. People go to conferences like these to put their guard down and get their dander up. For an aspiring magazine writer, such conferences are like setting up a minefield underneath a stampede. The carnage is incredible and inevitable. I regret that I was unsporting to a few civilians. But I tried to lightly make a point.What worried me then was that Richard Dawkins and Christopher Hitchens seemed to be developing an argument that the practice of religion, and the teaching of it, amounted to child abuse. Dawkins would later dare to say that sexually abusing children wasn’t so wicked as teaching them to believe in God. This argument against religious education should, I think, have been discredited by its application under Communism. Alas, the argument seemed to be growing then. European courts were considering bans on circumcision. A I wanted to get underneath this argument and expose it, I wrote:The question of children preoccupies Richard Dawkins. Using a PowerPoint presentation, the Oxford don displays a photo that appeared around Christmas of three children. The caption designates them “a Christian,” “a Jew,” and “a Muslim.” He changes the labels to “a monetarist,” “a Keynesian,” and “a Marxist” in order to demonstrate that classifying children according to religion is some kind of abuse. Reductively, Dawkins believes religion to be a mere set of mental propositions, not a way of life that can begin sacramentally soon after birth. Until Hayekians perform rituals on children, it’s safe to call this reasoning tendentious.I was gratified this week to see someone much more capable than I am taking up the same argument. John Gray, the British controversialist, has recently released Seven Types of Atheism. Spoiler alert: Gray is something like an atheist who despises five of the types he describes.Gray is one of my favorite writers working today, precisely because he does reject the secondhand religious cant that so often trades under the names of secularism or progressivism. Most important, he thinks the idea of the moral progress of mankind to be an absurd myth, though it is a myth that is powerfully important to the political class in most Western nations. He has a more traditional, cyclical view of history and politics. Almost as soon as one social evil is vanquished, it begins to make its return under a new name.Before taking on the really impressive names in the historical roll call of atheism, Gray first dispenses with new atheists like Sam Harris and Richard Dawkins. These men are merely recapitulating the debate launched by 19th-century Victorians against belief, one that Gray finds insipid, boring. They both, according to Gray, mistakenly reduce the phenomenon of religion to creedal commitments that are more specific to monotheism, and mistake these in turn for primitive scientific hypotheses. “The idea that religion consists of a bunch of discredited theories is itself a discredited theory — a relic of the nineteenth-century philosophy of Positivism,” he writes of Harris’s naïve faith that science can produce a morality consistent with the moral commitments of liberalism. Harris is neatly ridiculed as not only ignorant about philosophy but unfamiliar with atheism itself, which has just as often despised Christianity for giving birth to liberal values.Gray’s typical line of attack on the types of atheism and the atheists he dislikes is to show how they, unaware, continue to think in the same ways as Christians, smuggling into their own worldview ideas that cannot be justified given their premises. Some will reject the idea that history has an author, but they give history a coherent story and even a moral purpose. They reject a theological mystery, only to replicate the same problem in their account of nature. Christianity cannot solve the problem of evil to their satisfaction, but then atheism has trouble explaining the persistence and resilience of religion. At least Augustus Comte accepted the persistent human impulses and desires that religion points to, and tried to design a religion for atheism, complete with a pontiff in Paris.\nNietzche seems to agree with Christians that loss of Christian faith will be demoralizing, and instead of the Second Coming, he looks for deliverance from the Übermenschen. Followers of Mill await for the emergence of truly free “autonomous individuals.” Political atheists await the coming of new communist man. Like Christians, they are still waiting for the redeeming figure at the end of history.Very few of Gray’s disliked atheists come out better after his treatment. Though I have to give points to one for prescience: “It was Saint-Simon who first presented the religion of humanity in systematic form. In future, scientists would replace priests as the spiritual leaders of society. Government would be an easy matter of ‘the administration of things’. Religion would become the self-worship of humankind.” Prophetical.Here’s a long quotation for some flavor:Atheists attack Christian values because they are changeable and often contradictory. In incessant mawkish debates, they insist that unbelievers can be highly moral people. It does not occur to them to ask which morality an atheist should follow. Like Robinson’s Christians, they are confident that everyone knows what atheist values must be.In this as in so much else, they are mistaken. Karl Marx and the Russian anarchist Mikhail Bakunin rejected theism because it was an obstacle to human solidarity, the German egoist Max Stirner because it restricted individual self-assertion and Friedrich Nietzsche because it promoted ‘slave virtues’ like humility. Some eighteenth-century French atheists—such as the physician Julien Offray de La Mettrie, whose materialist philosophy is discussed in Chapter 5, where I consider the thought of the Marquis de Sade — recommended the enjoyment of sensual pleasures. Most English atheists at the time and later were horrified by any defence of sensuality. The mid-Victorian philosopher John Stuart Mill looked forward to a time when Christianity would be replaced by something like Comte’s religion of humanity. But Mill shared with the Christians of his time the conviction that life should be devoted to mental and moral self-improvement rather than to enjoyment of physical pleasures. There have been many atheist moralities.With few exceptions, twenty-first-century atheists are unthinking liberals.A ghost comes back to me from that atheist conference of over a decade ago. Christopher Hitchens was there, having recently released his book god is Not Great. I admired and disliked him almost equally. I took something like a perverse pleasure in seeing what I believed as his errors of moral and political judgment leading him into the support of the misbegotten Iraq War. But I knew he could be fantastically kind to young writers. And so I got in line to have him sign a copy of his book for me. I tried a move I thought would work on him; I slipped him my card. Officially it was to help him inscribe my book — but it let him know that I was another scribbler at small political magazines just as he had been. The intended impression worked, and he kindly invited me to look up his number in the phone book. I remember being impressed that he was in the phone book, and recalled instantly that a beloved high-school English teacher of mine showed my class that Nat Hentoff was also reachable this way. I think my teacher was trying to prove what you could find by paying close attention to even the most mundane texts. But I was the only student who cared about who Nat Hentoff was. I was too much a coward to take Hitchens up on the invitation. And I still regret it. He surely had entertained many people more slow-witted than I was.Hitchens isn’t even mentioned in Gray’s book. I can’t decide whether that is a slight on Hitchens or a mercy from Gray. But, Hitchens’s type of atheist, the God-hater, is represented in the figures of the Marquis de Sade and William Empson.Like Sade, Hitchens in protesting that he hated God come across far more credibly than did his attestations of disbelieving in Him. Like Empson, he claims to find the entire Christian economy of salvation totalitarian. Hitchens’s mostly rhetorical attack on God really has the force of drama only because it is a reenactment of Satan’s rebellion, Non serviam. The frisson is in his implicit promise to carry on the argument even if the Almighty himself turns up at the opposing lectern. This was entertaining as performance, but occasionally ugly in effect. Hitchens would allow his atheism to make him cheer the murderous despoliation of the Russian Orthodox Church. He clearly could reconcile with totalitarianism, when it attacked what he hated.Hitchens’s main argument that religion poisons everything was his assertion that only religion can make good people do evil things. That is, a person who normally acts with kindness can be cowed by divine authority to do what he would otherwise never do to others: torture, rape, murder, you name it. And indeed, you don’t have to go far back in the news archives to find some previously harmless boys throughout Europe who gave themselves over to jihad after a brief religious awakening they experienced in the course of torturing, raping, and murdering in Syria and Iraq.Hitchens’s attempt to escape the obvious rejoinder to his argument — that political and social creeds inspire to do just that — is lame. He just reclassifies any political murders he finds too fanatical as religious ones. In fact, in this rhetorical sleight of hand, he does precisely the thing he claims to find so repugnant about Christianity: He creates a scapegoat on which to load all the sins in the world.I played at atheism as a teenager. Like so many of Gray’s atheists, I had as my stated unbelief nothing else but a tribute to religion expressed in a rebellious mood. I had in mind very specific moral prohibitions that I wanted to eject from my life. With generous help from the culture, I constructed in my head a hateful image of what religious people were, wallowed in the prejudice, and determined not to be like that. But I noticed the way my reasoning ran after my heart. I wouldn’t just desire some pleasure or ambition in life, conclude that there was no divine prohibition against it, and then proceed on the basis of desire alone. I would invent a reason to believe that the thing I wanted was good in itself. Healthy, sociable, politically hygienic. Whatever. Realizing how much mental work was going into the permission-slip part was enough to get me doubting my doubts. Why must I approve of my own desires? Why do I feel shame at fulfilling the ones I do not altogether approve?Gray’s book is quite good fun. It’s sprightly, erudite. Gray doesn’t quite outline why in turn Christianity’s morality, its eschatological visions, or its views on Providence are so resistant to the atheist’s attempt to reject the religion in which they make sense and are defined. That there is such persistence has always made me slightly less alarmed than some of my peers and friends about an emerging “post-Christian” West. Like Don Quixote, I stubbornly refuse to notice that Christendom has ceased to exist. It hasn’t. The sacraments work ex opere operato. Our civilization has the mark of baptism because so many people in it are baptized. This mark on our civilization becomes all the more obvious in “unbelieving” Europe as Islam comes more and more into contact and collision with the laws and customs of societies that were tutored at the feet of the Church. I take it that our atheists are mostly not unbelievers, they are almost incapable of thorough unbelief. They are merely heretics. Even Gray himself, who tries hard to be a real atheist, has done something Christian and, I would say, charitable, for his fellow atheists, by running them through a compassionate but tough Inquisition.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}