{"id": "DNA Doesn’t Define Who We Really Are\t\t\t\t\t\t\tDNA Doesn’t Define Who We Really Are\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBelieve in Creed II \n\n\n\t\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Lessons of the Asia Bibi Case\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAgainst the ‘Coercive Elimination of Dissent’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\nSenator Elizabeth Warren’s big reveal that she’s got a little Native American DNA in her deserves all the mockery it’s getting. But I just want to use it as an excuse to explain why I hate the way we talk about DNA and identity.Consider Kyle Merker. You’ve probably seen the Ancestry.com commercial featuring his story. It begins with him declaring: “Growing up, we were German.”“We danced in a German dance group,” he continues. “We wore lederhosen.” We then see him doing a little German dance in his lederhosen.Merker signed up for Ancestry.com and noticed very few Germans in his family tree. So he had his DNA tested through Ancestry.com’s test service and discovered: “We’re not German at all. Fifty-two percent of my DNA comes from Scotland and Ireland.” In the ad, a little pie chart shows that the rest comes from Scandinavia, Italy, Greece, and “other.”And then the kicker: “I traded in my lederhosen for a kilt,” Merker says. And we see him in his authentic Scottish garb with a big smile.\nThis is terrible. And Merker is hardly alone. Other ads and services make similar appeals. And they are all based on the idea that your “real” culture and identity exists in your DNA. That is grotesque and profoundly illiberal.Every single person reading this column can trace his or her DNA back to some ancient ancestor who hunted antelope on some African savanna or Asian steppe. That doesn’t mean my real identity is caveman or nomadic hunter. Most of us — white, black, Asian, etc. — probably have ancestors who were serfs or slaves. All of our family trees are top-heavy with pagans and animists. That is not who we are.I don’t want to pick on Merker. He seems like an entirely decent fellow. Nor do I want to say that investigating your family tree or your DNA is a bad idea. That stuff is fascinating and has all sorts of benefits. But the idea that one could be raised by a family that takes a certain heritage to heart and then cast it aside because of a pie chart on a DNA test is terribly sad to me.Some people I know are passionate about their Irish heritage and are “black Irish” — i.e., they have dark eyes and hair and, sometimes, a more Mediterranean complexion. One theory is that they are descendants of Spanish sailors who were stranded on the Irish coast in the 1500s. Another is that they can trace their roots back to one of the countless invasions by Vikings or Normans over the centuries.I don’t begrudge anyone who wants to investigate how their people came to Ireland. But why would you throw away your culture and identity because five, 10, or 20 generations ago your great-great-great-great-great-great-grandfather or grandmother came from somewhere else? Many Italians have a smorgasbord of DNA in them — from the Moors or other invaders. Are they not “real Italians”?There’s a term for this kind of thinking: “racial purity.”Elizabeth Warren used a small blip on her retroactive genetic radar to claim a heritage she does not have and to get credit for a culture to which she does not belong. Indeed, if her DNA test came back with much “better” results — say, 25 percent Native American DNA instead of somewhere between 1/64th and 1/1,024th — it would still be tawdry for her to borrow a culture and heritage that is not hers, particularly to advance her career, because she was not remotely raised as a Cherokee. She does not speak their language, is not fluent in their customs or culture, and has little to no factual claim to their story.“A DNA test is useless to determine tribal citizenship,” the Cherokee nation explained in a statement lambasting Warren.The idea that you are what your DNA says you are is illiberal, because liberalism (in the classical sense) is premised on the idea that the individual is more than just bloodlines. Think of it this way: You know what you call an American citizen with Irish DNA going back 300 or 1,000 years? An American. (Or, if you really care, an Irish-American.) That so many people aren’t content with that is a symptom of a much deeper problem with our society today.© 2018 Tribune Content Agency LLCNR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}