{"id": "A Thousand Parents of Trans-Identifying Children Beg Doctors to Listen\t\t\t\t\t\t\tA Thousand Parents of Trans-Identifying Children Beg Doctors to Listen\t\t\t\t\t", "paragraph": "National ReviewIn child health care, the bond of trust between parents and doctors is critical. But when it comes to the treatment of youth with gender dysphoria, that bond is under a new threat. As part of an investigative series, I have been in touch with an overwhelming number of parents of trans-identifying youth who feel their voices are being shut out by activists.One online group — with a membership of over 1,000 parents — has written a moving letter to the American Academy of Pediatrics about their recent one-size-fits-all, trans-affirming policy statement. They beg for consideration. They beg for critical thinking. They beg for their children. Here is their response:Dear American Academy of Pediatrics (AAP):We need you and our children need you.  There is a great and growing disservice that needs your attention, scientific curiosity, critical thinking, clinical experience, and compassion.We have serious concerns about the AAP’s Policy Statement “Ensuring Comprehensive Care and Support for Transgender and Gender-Diverse Children and Adolescents” (Rafferty et al., 2018).  While we believe that AAP’s intention behind this position statement is to protect the health of today’s gender-diverse youth (children through young adults), we are deeply concerned that the clinicians using affirmation therapy are inadvertently inflicting physical and psychological harm.We are members of a rapidly growing online community of over 1,100 parents of transgender-identifying youth who need your help.  We have no unifying political affiliation. We empathize with mature transgender-identifying people who deserve respect. We need to stop the harm to our children.It is our concern that the AAP’s Policy Statement will continue, and possibly worsen, the harm brought to many children by the recent radical changes to treatment guidelines for transgender-identifying youth.  Over the past decade, there has been an exponential rise of predominantly adolescent girls who are suddenly declaring themselves trans after the onset of puberty and who have no previous history of gender dysphoria (GD).  Historically, GD showed at a much earlier age and has been exceedingly more common in boys. A recent groundbreaking study of an emergent late-onset, predominantly female trans-identifying patient population, finds significant parallels with the phenomenon of eating disorders, and includes social contagion as a key factor (Littman, 2018).  The drastic increase in trans-identification and the switch to the predominant adolescent girl patient has prompted the United Kingdom (UK) Government to launch an investigation over concern that the 4400% increase in the last decade could be due to a social phenomenon (Rayner, 2018).There is great harm being done to girls and some boys by medicalizing their gender non-conforming (GNC) behavior based on gender stereotypes, homosexuality, and/or underlying mental health issues that have led to trans-identification.  The medicalization with gonadotropin releasing hormone (GnRH) agonists is highly experimental and comes with serious long-term consequences for bone health, potentially for neurological health, and as sterilizes the child when followed by cross-sex hormones. The harms of sex-aligned hormones (e.g., testosterone given to natal males) are well-known, include significant cardiovascular disease, and are increasingly exposed in lawsuits for non-transgender adults. Astonishingly, cross-sex hormones are given to the opposite sex in trans-identifying adolescents who are expected to be treated for their full lives and have permanent effects. The harms of surgeries are self-evident and irreversible, which is problematic for youth who change their minds.The justification for non-FDA–approved medicines and surgeries is that the youth will commit suicide if these drastic measures aren’t taken (although this is not acknowledged in the AAP’s statement). There is no clinical data that supports that medical transition prevents suicide. Contrarily, long-term studies (>10 years) demonstrate increases in suicide rate, psychiatric hospitalization, and lower quality of life after sex reassignment surgery in adults (Dhejne et al., 2011; Simonsen et al., 2016; Kuhn et al., 2009).Most transgender youth in the US who were reported in the news as having completed suicide were affirmed by social transition; thus, disproving that affirmation prevents suicide completion. The Williams Institute California GNC study reported that the percentage of teens identifying as either highly GNC or as androgynous has increased to nearly 30% and that neither group statistically differ from non-GNC teens in rates of lifetime suicide thoughts and attempts (Wilson, 2017).  Furthermore, the risk of suicide in transgender-identifying youth is comparable or even less than that of youth who are non-heterosexual but who are not trans (CDC 2018, page 24, col 2, para 5), who have eating disorders (Smith, 2018), or who are referred to youth mental health services in the UK (GIDS, 2018) and yet, the “transition or die” mantra pervades as if transition is the only option.We ask that you (1) consider our knowledge-based concerns presented as a scientific rebuttal to five main points made in the AAP position statement, (2) query AAP and other pediatricians anonymously to understand broader views, (3) conduct a more inclusive scientific debate with GD experts critical of affirmation therapy (e.g., gdworkinggroup.org) and (4) retract the AAP statement pending your inquiry.  Please consider this letter a call to lead the way in exploring alternative non-invasive, non-harmful  treatments. Your AAP oversight over the smaller subcommittee of “trans experts” is urgently needed.[The following is an abbreviated version of the parent response letter, which omits the text and references under each subheading, but leaves the summaries for each section as shown.]Summary: Diagnosis is the youth’s self-diagnosis. The life-altering medical treatments offered do not match the diagnostic process or the clinical evaluation standards of medicinal or surgical safety and efficacy. Summary: We have experienced that providers (pediatricians, psychologists, etc.) do not explore, or only superficially inquire about, on-going or historical mental health, trauma experiences, or any potential causes of trans-identification before affirming the child’s self-diagnosis and proceeding with medical treatment, which is consistent with Dr. Littman’s study. We have also experienced that our children are using transgender-identification as a maladaptive coping mechanism as discussed in Dr. Littmans’s study.  This idea is also supported in the context of anorexia nervosa and demonstrates similar adolescent clinical  presentation profiles and social contagion aspects with the modern additional factor of pervasive social media exposure to transgender promotion.Summary: Desistance is the most common outcome among children. Persistence of the exponentially increased population of predominantly natal female, late-onset GD adolescents (including those newly identified as having rapid-onset gender dysphoria [ROGD]) has not been studied.  Today, youth are affirmed and either receive treatment or wait until they can get treatment, thus ensuring that they will be more likely to persist. Mistaken medical affirmation leading to detransition occurs regularly. Summary: There are several factors and individual trajectories leading a youth to trans-identify with the most dominant factors being environmental.  The “trans experts” have ignored all environmental factors, attempted to over-emphasize any biological components, failed to tease-apart GNC behaviors or homosexuality from any minor biological basis of transgender identification, and focused solely on the false position that the youth is infallible in their self-diagnosis despite conclusive clinical evidence that children diagnose themselves incorrectly 60-90% of the time.Summary: With no clinical data and a flawed ongoing NIH study, how can the medical transition of youth who would normally desist be justified? Modern non-affirming strategies need to be evaluated.ConclusionAfter you consider our concerns and engage in critical evaluation, can you stand by this position statement?  How about other AAP pediatricians (those outside the committee who authored this statement) – do they stand by it?  We request that you investigate their attitudes and observations by surveying them – anonymously so they aren’t targeted for non-compliance with the forces of transactivism.  We request that you stand by the APP’s commitment to be “Dedicated to the health of all children” and retract this position statement while you conduct an inquiry.If you have any doubt as to why we are anonymous, you need to look no further than Rafferty et al’s recommendation to consider legal “support” in cases where parents do not comply with subjecting their children to experimental therapies (p 8).Similarly, pediatricians and therapists remain silent or anonymous after witnessing the slander of those using non-affirmation approaches as demonstrated by world-renowned GD expert, Dr. Kenneth Zucker (Singal, 2016), and his long-awaited vindication (CAMH, 2018; The Canadian Press, 2018).Please read our enclosed GC forum letter (also available at https://gendercriticalresources.com) with our four proposals and much more support for our position (including further discussion on transgender suicide) with many more references that couldn’t be included here.Copies of this letter and the enclosed have been sent to the media.We Sincerely Thank You for Your Consideration,Parents of Trans-identifying YouthNR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}