{"id": "I’d Trust the NRA Before the AMA on Gun Safety\t\t\t\t\t\t\tI’d Trust the NRA Before the AMA on Gun Safety\t\t\t\t\t", "paragraph": "National ReviewThe American College of Physicians has issued a position paper that, if acted on, would put members in harness to promote what many will perceive as an ideological agenda on guns and–of all things–have doctors counsel patients on how to keep and handle firearms safely. From the position paper published in The Annals of Internal Medicine:b. Physicians are encouraged to discuss with their patients the risks that may be associated with having a firearm in the home and recommend ways to mitigate such risks, including best practices to reduce injuries and deaths.c. Physicians should become informed about firearms injury prevention. Medical schools, residency programs, and continuing medical education (CME) programs should incorporate firearm violence prevention into their curricula.d. Physicians are encouraged, individually and through their professional societies, to advocate for national, state, and local efforts to enact legislation to implement evidence-based policies, including those recommended in this paper, to reduce the risk of preventable injuries and deaths from firearms, including but not limited to universal background checks.If doctors want to advocate for certain gun control laws, more power to them. But I don’t think their opinions should bear greater weight in the public square than anyone else’s. That’s not an area of “medical expertise.”If I choose to own a firearm, it is not my doctor’s business. Moreover, if I do, safety will certainly be my most paramount concern. But the very best place to learn those practices is not from doctors. It is from the NRA or others with equivalent firearms expertise.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}