{"id": "Policymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBetsy DeVos Strikes a Blow for the Constitution\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Case for the Wage Subsidy\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tMaking Acosta a Federal Case\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAgainst the ‘Coercive Elimination of Dissent’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump’s Not Populist Enough\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tRick Scott’s Lead Increases after Recount\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPelosi Vows She’ll Be Speaker Despite New Potential Challenger\t\t\t\t\t\t\t\nDespite a lot of headwinds and massive spending by the teachers’ unions and other opponents of education reform, school-choice supporters did very well in the 2018 midterm elections. The American Federation for Children and our affiliates participated in 377 state races to support pro–school choice candidates in 12 states, winning 77 percent of them. Heading into the 2019 legislative sessions, there are now pro–school choice governors and state legislatures in most states in the country.Voters have made it clear: They want their policymakers to support and expand K–12 educational choice. Polling has shown that the majority of Republican, Democratic, and independent voters support school choice. Support is particularly strong among Latinos (72 percent), African Americans (66 percent), and Millennials (64 percent), according to a 2018 poll by Beck Research and commissioned by the American Federation for Children. These results were reinforced by the annual Education Next poll, which show that 57 percent of Americans support tax-credit scholarships and 54 percent support universal vouchers. And despite the avalanche of negative press about school choice and its strongest national champion, Secretary of Education Betsy DeVos, support for private-school choice and charter schools increased from 2017 to 2018.There are important takeaways from the elections for policymakers on both sides of the aisle. The Wall Street Journal and Tampa Bay Times have noted that support from communities of color played an important role in the Arizona and Florida gubernatorial elections. African-American and Latino voters whose children are enrolled in private-school-choice programs or in charter schools likely tipped the scales toward Republican Ron DeSantis in Florida and contributed to the big win by Arizona Republican governor Doug Ducey.In Florida, exit polls showed that Republican Ron DeSantis received 14 percent of the African-American vote, a strong showing against Democrat Andrew Gillum, the Tallahassee mayor and an African American. That support was bolstered by DeSantis’s unwavering support for the Florida tax-credit scholarship program, which serves more than 100,000 children from low-income families, 70 percent of whom are minority. Gillum stated that he wanted to bring the program “to a conclusion.” In Arizona, Republican governor Doug Ducey, a vocal school-choice champion, captured 44 percent of the Latino vote in his reelection victory. As we’ve seen in other elections, educational choice can be a powerful political issue and voters with children benefiting from these programs will reward candidates who stand with them.Legislative momentum to give families more educational options has been steady and strong for a decade. Today, 26 states plus Puerto Rico and Washington, D.C., offer private-school choice as an option. These programs are educating more than 500,000 children, most of whom are from lower-income and minority families.What is the reason for this momentum, and why is giving families and children greater choice in K–12 education so important and so urgent? It’s because our K–12 system assigns children to schools according to their ZIP codes rather than their educational needs. According to the 2017 National Assessment of Educational Progress (NAEP), fewer than half of our fourth- and eighth-graders are proficient in reading and math; 27 percent are scoring at the “below basic” level. The numbers are even worse for minority children and those from lower-income families. On the Program for International Student Assessment, the United States ranks 35th in math and 23rd in reading out of 72 countries. In addition, despite a government-reported 84 percent graduation rate for public high schools, the nation spends nearly $7 billion annually on remediating high-school graduates.\nThe K–12 system is failing too many of our children, and families — and voters — know it. School-choice advocates believe that every family, regardless of its ZIP code, should be able to choose the best educational environment for its children — public, private, charter, magnet, virtual, home, or a blend of those options. We also believe that real competition for an antiquated government monopoly system is essential to improving educational outcomes across the board.We have seen school choice work in states all across the country. Twenty years of research has shown that students participating in these programs are more likely to graduate from high school and enroll in college. Surrounding public schools are more likely to improve with the existence of other options for families. Private-school choice should be among the options for families in every state.The politicians in Washington, D.C., should also take note of the strong support for school choice among voters, and of the results that have been generated in the states. They can start by insisting on a rewrite of a broadly worded proposed IRS rule for the 2017 tax bill. The proposed rule threatens corporate and individual tax-credit scholarship programs that currently serve nearly 300,000 students in 18 states. If implemented as written, many corporate and individual donors would no longer participate in these programs and those scholarships would end. This not only hurts families, children, and the private schools they attend but will also have a negative financial impact on public school districts. It was not the intent of Congress to use tax reform to harm tax-credit scholarship programs and the students they serve. The proposed IRS rule should be more narrowly written.Instead of contracting school choice by IRS rule, Congress and the administration should facilitate an expansion of school choice for America’s families and children.State and federal policymakers must no longer ignore the evidence that our K–12 system is not doing the job for America’s students. Tinkering around the edges of an antiquated $650 billion system will not bring the necessary change. Governors, state legislatures, Congress, and the administration need to think outside the establishment box and act boldly. Americans expect and enjoy choice in virtually every aspect of their lives, including higher education. Educational choice is a policy and political winner. The politicians should listen to the voters and enact policies to give every child access to a quality education, which would improve educational outcomes across the board. School choice is not a silver bullet or cure-all, but it is an essential component to transforming our nation’s antiquated K–12 system into a 21st-century model for giving every child the opportunity to achieve his or her full potential.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}