{"id": "Presidents and State Universities\t\t\t\t\t\t\tPresidents and State Universities\t\t\t\t\t", "paragraph": "National ReviewFor a while now, I’ve been telling anyone who will listen (usually our dog) that liberals think the grown-up world is just like college, while conservatives think it’s just like high school. To liberals, the world after graduation is an ever-changing bunch of friendly, caring, intellectually curious people living in a place with lots of grass and buildings, where really smart folks run things and everyone spends their time doing interesting stuff, and if any disputes develop, you get together and work them out (except for conservatives, they don’t count, in fact they barely exist), and the money to pay for it all comes from . . . somewhere. To conservatives, the world after graduation is a big, drab building that smells of disinfectant where you spend all day doing things that need to be done while following arbitrary rules, and even if you hang around long enough to become a teacher, you still have to deal with assistant principals and school boards, and the money to pay for it all comes from the taxpayers, i.e. you.Of course, there are colleges and colleges. As the indispensable Iowahawk has pointed out:@The_Analyst Typical pundit writing about college: Swarthmore or Oberlin grad. Typical college: Cal State Bakersfield.— David Burge (@iowahawkblog) September 21, 2014And indeed, private colleges have dominated presidential higher education since the days of John Adams (Harvard). Just as matter of interest, how many presidents do you suppose have shared the great American experience of earning a bachelor’s degree at a state university? (Pause here if you want to guess.)[brief intermission]Still there?  The answer is three: Gerald Ford (Michigan), Lyndon Johnson (San Marcos State, now Texas State), and James K. Polk (North Carolina).*Now, I won’t put forth the fallacy that our president should be a regular guy or gal; a president should be outstanding, and in recent decades, outstanding students have increasingly tended to enroll in elite, highly selective institutions, or at least in small, close-knit liberal-arts colleges (or both, as with Obama). And to be sure, public colleges can be just as crazy as private ones.But there’s something to be said for the leveling effect of grappling with a vast and faceless bureaucracy, sitting in cavernous classrooms with hundreds of students, and making friends from widely varying income levels and social and academic backgrounds. And it wouldn’t hurt to have a president, now and then, who had lived through four years of that.***************** Three early presidents went to William and Mary, which is now a state university but in the 18th and 19th centuries was private. Three other presidents went to service academies, which are public universities but not state universities.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}