{"id": "Schubert, Early and Late, and Beethoven — in an Exceptional Concert\t\t\t\t\t\t\tSchubert, Early and Late, and Beethoven — in an Exceptional Concert\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBelieve in Creed II \n\n\n\t\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTERF Wars\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\t‘The Process of Living’\t\t\t\t\t\t\t\nSchubert died when he was 31. In his short life, he gave just one public concert. Of his 1,500 compositions, the very greatest were discovered in storage trunks after his death, Schubert having deemed them unworthy for publication. This unpublished music was so extraordinary that it belongs on a level with that of Bach and Beethoven, at the apex of musical genius.It is tempting to wonder what Schubert would have done had he been given an equal run — Beethoven lived to 57, Bach to 65. But, as Robert Schumann rightly pointed out: “It is pointless to guess at what more he might have achieved. He did enough.”Because his time was so short, Schubert lacked the luxury of an orderly progression through several musical styles. He had an early style and a late style, and there is nothing in between. The styles are distinct: The former is influenced mostly by Mozart, the latter mostly by Beethoven. Both are shot through with a unique sensitivity that belonged only to Schubert, a quality that is visible in his portraits. (The best painting of Schubert was done by Gustav Klimt, himself an incomparable artist; it was destroyed by the Nazi SS at the close of the Second World War, but a photograph survives.)Both Schubert’s early style and his late style were sampled last week at an exceptional concert of the New York Philharmonic given by guest conductor Iván Fischer. Fischer was born in Budapest and studied piano, violin, and cello in Vienna. On the podium, he is one of a vanishingly small number of world-class conductors who make the music, not themselves, the center of attention. Fischer dresses in traditional white tie and tails. His bearing is elegant and understated — one might almost say noble. He never hops and jumps about the rostrum, and you won’t hear him shouting at his musicians in excitement. His baton technique is incredibly graceful and expressive. It speaks to the audience as well as the orchestra. His gestures are a visual explanation of the music: The interplay between the first and second violins, between the violins and the cellos, and so forth, becomes clear; we can actually see how the whole machine of the orchestra fits together. Any young conductor watching him could learn a lifetime of good habits. Fischer should be conducting the New York Philharmonic every week.The two pieces of Schubert on the program were bookends to his life: Schubert wrote his Fifth Symphony in B-flat major when he was 19. The pastoral lied “Der Hirt auf dem Felsen” (The shepherd on the rock) was the last piece he ever completed. The common theme is Schubert’s lyricism. Every line he ever wrote was a singable line.The symphony is understated — “unostentatious” is the way the program notes describe it. It ignores the developments in symphonic style that Beethoven had recently made, sticking to an earlier, Mozartian tradition. The basses, for example, double the cello part note for note, where Beethoven had already begun writing a separate line for them. The ensemble is very small: two French horns, woodwinds, a single flute, and strings. Schubert had a larger orchestra at his disposal (a substantial gathering of musicians was meeting at his father’s house every week). His earlier symphonies were scored for a larger group. So here the decision to be spare was deliberate, and the result is, as Donald Tovey called it, “a pearl of great price.” The scherzo has a regular, driving pulse found nowhere else but in Schubert — in this respect it resembles later Schubert scherzi like that in the 14th String Quartet — but is unlike anything Beethoven ever wrote.\nThe lied “Der Hirt auf dem Felsen” was written for soprano, clarinet, and piano. This evening’s performance was in Carl Reinecke’s 1887 arrangement that replaces the piano with an orchestra. The soprano was Miah Persson; the clarinet soloist was Anthony McGill, a performer of rare qualities. The piece itself is a neat encapsulation of Schubert’s song cycles and is a great lied, but by no means Schubert’s greatest. The play between singer and clarinet suggests what Schubert might have done had he lived to explore further. But again, as Schumann reminds us, it is pointless to speculate. The song has a strange sweet-sadness. It was written at the special request of famed soprano Anna Milder-Hauptmann, who was a great admirer of Schubert’s (in addition to being a Beethoven protégée). But singer and composer were never to meet, and Schubert died before the piece could be performed, the manuscript being delivered posthumously by Schubert’s brother. The song ends with the line “Now must I make ready / to wander forth.”The second half of the evening’s program was Beethoven’s Fourth Symphony. This work is somewhat overshadowed on the concert circuit by Beethoven’s darker and more magisterial Third and Fifth Symphonies. It is apparently penalized by the fact that Beethoven was so obviously in a good mood when he wrote it: The Fourth has a cheerful exuberance that is unrelenting, from the laughing theme that gallops off after a deceptively slow introduction in the first movement, all the way through to the famous “bassoon joke” in the last. Fischer’s performance here was every bit as good as with the Schubert, and the music was, in absolute terms, even greater. It is nonetheless easy to find oneself hankering for a little more Schubert — not, perhaps, to guess about what might have been, but to better appreciate what actually was.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}