{"id": "Manchin Finds a Way to Support Tax-Funded Abortions\t\t\t\t\t\t\tManchin Finds a Way to Support Tax-Funded Abortions\t\t\t\t\t", "paragraph": "National ReviewWest Virginians are voting on an amendment to declare that the state constitution does not protect abortion. The immediate practical effect of passage would be to allow the state legislature to deny public funding to abortion. A generation ago, the state supreme court read the state constitution, in conjunction with the federal Supreme Court’s jurisprudence on abortion, to require state funding. The secondary effect would be to clear the way for legislative restrictions on abortion should the Supreme Court allow it. If the Supreme Court allows states to prohibit abortion, that is, the state courts would not be able to use the state constitution to keep the legislature’s hands tied.Yesterday, Democratic Senator Joe Manchin was asked about the amendment in a debate with his challenger, Republican state attorney general Patrick Morrisey. Manchin said that while he was pro-life, his opposition to abortion makes exceptions for cases of rape, incest, and threats to the mother’s life. Since the amendment does not include such exceptions, he opposes it.The more you think about it, the flimsier this rationale becomes. Note that the amendment itself neither prohibits nor even denies state funding for abortion in these cases. If the amendment passed, the legislature would be free to provide state funding for abortion in these cases (which are already eligible for federal Medicaid funding). It would be free, for that matter, to provide state funding for all abortions if it so chose. If the amendment passed and the Supreme Court quit managing abortion policy nationally, the state legislature would be free to enact an abortion prohibition without exceptions, or to enact one with exceptions, or to enact no prohibition at all. (It’s unclear whether the state’s pre-Roe law, which included an exception for life-threatening pregnancies, would be enforceable in this scenario.)People who want to prohibit abortion with the rape/incest/life exceptions are generally considered, on both sides of the debate, to be pro-lifers. But Manchin is going well beyond support for such exceptions here. He wants the exceptions in the state constitution. He wants to guard against the hypothetical possibility of restrictions on abortion in these cases so badly that he is willing to support continuing the actual state funding of elective abortions.If a politician said he were pro-life; opposed abortion except in cases of rape, incest, and threats to the mother’s life; but wanted Roe v. Wade to stay because it ensures that abortion is legal in those cases: Nearly everyone would see that this politician was at best confused and at worst deceptive. Opposition to Amendment One is, however, an even more extreme case, since it a state court decision that mandates taxpayer funding of abortion, something the Supreme Court has never done.What kind of pro-lifer takes this view? The same kind of “pro-lifer” who votes for federal funding for the nation’s largest abortion provider: Senator Joe Manchin.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}