{"id": "The Midterm Confidence Spiral\t\t\t\t\t\t\tThe Midterm Confidence Spiral\t\t\t\t\t", "paragraph": "National ReviewIn days since the midterm elections, it has gradually become clearer that the widespread first impression of the results understated the Democrats’ success. The degree of that understatement remains unclear, as a number of significant races are still being counted or recounted. But as we wait, considering just how and why that early understatement happened can tell us a bit about our political culture in this moment.The impression created by media coverage early on the night of the election was that what might have been a meaningful Democratic wave had turned out to be barely a ripple. The Democrats looked likely to take over the House by just a tiny margin, perhaps barely flipping the 23 seats they would need, or at best reaching 30. In the Senate, the particular third of the chamber up for election this year meant that Republicans had a massive advantage, with 10 Democratic seats up for election in states that Donald Trump had easily won in 2016 and only one or two Republican seats in real danger. It seemed at first as though Republicans might net four or five seats, which would be a serious gain.It was already reasonably clear by the end of the evening that this very earliest sense of the results had overstated Republican strength. But even by then it was fighting a deeply established impression that the Democrats had failed to seize their opportunity.Donald Trump’s tweet early the next morning claiming he had “Received so many Congratulations from so many on our Big Victory last night…” was a characteristically crude and self-congratulatory expression of the relief that many Republicans were feeling. Many others gave different expressions to a similar sense.I did as much myself. In an op-ed I wrote for the Washington Post the morning after the election, I pointed to the results to highlight the inability of either party to reach beyond its comfort zone and wrote that, “in the House, the Democrats had an opportunity for major gains throughout the country, but they made modest gains in friendly suburbs — winning almost exclusively districts that Hillary Clinton won two years ago.”The broader point of that piece, that both parties are now exceptionally weak, certainly remains my view, and I think it’s borne out by last Tuesday’s results among much else. But while the Democrats’ success was indeed almost entirely limited to suburban districts where Hillary Clinton did well, I would not now describe that success as “modest.” This was a robust victory for them, alas. They look to have won closer to 40 House seats (almost certainly their biggest House victory in a midterm election since the Watergate era) and to have kept Republicans down to one or two Senate seats despite those 10 Democratic seats up for election in Trump-friendly states. It was the Republicans who largely failed to seize an opportunity.There is no trucking with President Trump’s implacable narcissism. He lives in his own universe, in which he is the morning and the evening star, and he imagines everyone is always congratulating or thanking him. But more sober observers who at first shared his impression of things should presumably now recalibrate and draw the lessons of a more significant Democratic win. And yet, this likely won’t quite happen. People’s first impressions will not easily give away.NR's afternoon roundup of the day's best commentary & must-read analysis.So how did that first impression form? Part of the answer is surely that the earliest results to come in on national election nights are generally from the Southeast, which is where Republicans are generally strongest now, and were in this election. Early results there created a misimpression about the broader trend.A second facet has to do with election rules in states that were home to some key races this year, and particularly early-voting rules that ironically lead to late counting. Here is how the Arizona Secretary of State’s office describes early voting in that state:One of the major reasons it takes time to count ballots is that there are hundreds of thousands of early ballots dropped off at the polls on election day – approximately 320,000 statewide this time. The counties are currently working to verify the signatures on each and every one of those early ballots before they can be tabulated. Once the county election officials verify the signature on each of those ballots (which is no small task!), they then make sure that a voter didn’t cast an early ballot AND vote in person at a polling location. All of these processes take a little bit of time and is done to ensure that voters can trust the outcome of their elections.But a third and perhaps most significant explanation has to do with the way Twitter now distorts our understanding of live events and developing news. Early appearances in unfolding stories often require correction, and corrections often don’t fully sink in. That has been a problem since the dawn of television news, of course, if not the dawn of journalism. But there is a distinct new element to this problem in the age of social media, which hardens those early appearances. I’d call it the Twitter confidence spiral.Because media elites tend to follow one another on Twitter, vague impressions of a changing event quickly get spun up into something everybody’s saying. They then become congealed into trusted judgments and swiftly harden into conventional wisdom and so come to be treated as something everybody knows. Pretty soon (and I mean often within minutes) political and media elites are responding en masse to a slapdash interpretation of events as if it were a set of facts. The speed and strength of this setting of judgments can be especially astonishing if you’re not yourself immersed in Twitter and so observe the results of the process without quite feeling the pressures that yield them.On election night, such judgments are quickly stated on television as near-facts, since everybody on the network sets is always glued to Twitter. And that repetition only tends to feed back into the spiral, now with the supposed authority of a traditional news organization, so the whole cycle repeats. All this speeds up the process by which people come to believe they understand what they are witnessing, and the resulting confidence can be very hard for later revelations to unravel. The dynamic is more like gossip than analysis.Political campaigns have figured this out. They now work very aggressively to drive live Twitter reaction during debates, for instance, in order to shape the public’s impression of who won a debate by shaping the conventional wisdom that then shapes coverage and is treated as fact. On election nights, there is no such intentional design behind the spiral, but that hardly renders it less powerful or significant. This is yet another way in which Twitter distorts our political culture and leaves us knowing less while feeling we know more. It acts as an immensely powerful conventional-wisdom engine.And conventional wisdom can matter. If early impressions of the election had formed around the knowledge that Democrats would win nearly 40 House seats while Republicans picked up one or two Senate seats, the political dynamics not only of the past week but of the coming months could well have been meaningfully altered. We are all now gradually acknowledging that those were in fact the results, but I suspect the early impression will not quite be overcome.The solution to this problem is not to exaggerate the election results in the other direction. The results were hardly signs of a coming political revolution, and they don’t even put this election on the level of the 2010 recoil from the Obama Administration’s first two years. But within the important swing block of suburban voters, which both parties need to attract if they are to build and sustain durable coalitions, the Democrats did significantly better than they first appeared to on election night. That is a conclusion Republicans will need to internalize, but will probably manage to ignore in large part because you never get a second chance to make a first impression.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}