{"id": "What to Do about California\t\t\t\t\t\t\tWhat to Do about California\t\t\t\t\t", "paragraph": "National ReviewOur friends at Hoover have some ideas. In their new report on the state, Hoover scholars note that California is in fact an economic powerhouse and home to many of the nation’s most innovative firms and entrepreneurs — something coast-hating conservatives often find themselves trying to deny — but also finds that California has serious problems. California is our most progressive state, but it is plagued by precisely the problems that progressives claim that their approach is uniquely suited to ameliorate. From the reportCalifornia ranks 49th in the country in housing affordability and 49th in new home construction. Only about 30 percent households can afford the median priced home, while 25 percent of the country’s homeless are in CaliforniaOver half of California renters pay rents that are considered to be unaffordable relative to their income.Nearly 40 percent of Californians live at or near poverty levels, and nearly one third of the country’s welfare recipients live in California.California has the country’s 6th highest tax burden and ranks 40th in inflation-adjusted, after-tax incomeCalifornia public K–12 schools rank 41st in the country, despite substantially higher spending on schools.California’s public infrastructure receives a grade of D+ by the American Society of Civil Engineers, reflecting insufficient government capital investments.California has unreliable water supplies that severely impact the quality of life during drought periods, which raise business costs and introduce uncertainty in business planning.Average California residential electricity prices are among the highest in the country and are roughly twice as high as those in Texas, which not only has more wind and solar generation capacity than California but also has implemented vigorous competition in the retail electricity market.California’s nearly 14 million Medi-Cal recipients would represent the nation’s 5th largest stateAs we used to say in the days of Ye Olde Internet, do read the whole thing.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}