{"id": "Mary Shelley Revisited\t\t\t\t\t\t\tMary Shelley Revisited\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBelieve in Creed II \n\n\n\t\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Lessons of the Asia Bibi Case\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAgainst the ‘Coercive Elimination of Dissent’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\n‘Am I to be thought the only criminal, when all humankind sinned against me?” asks the rebellious creature in Mary Shelley’s 200-year-old novel, Frankenstein. Shelley wrote the novel, by far her best-known work, when she was just 19, which makes its scope and maturity all the more astonishing.But then, like her creation, Shelley spent her life as a social outsider.Shelley’s father, William Godwin, author of An Enquiry Concerning Political Justice (1793), denounced the Christian doctrine of original sin and argued that man should “supersede and trample upon the institutions of the country in which he lives.” Her mother, Mary Wollstonecraft, author of A Vindication of the Rights of Woman (1792), articulated a brand of feminism that, though it may be conservative by today’s standards, was considered dangerous then. And of course, there’s also Shelley’s lover-turned-husband, Percy Bysshe Shelley: a talented poet, a militant atheist, a champion of “free love,” and, frankly, a nasty piece of work.In short, if you are the company you keep, then Mary Shelley was destined to be radical. Her mother, Wollstonecraft, died shortly after childbirth, infected by the unsterilized hands of her male surgeon (how’s that for a cruel irony?). By the age of 16, she’d eloped to France with Percy Shelley, taking her step-sister, Jane-Claire, along and leaving behind Percy’s wife and two children. Traipsing around Europe, the trio saw foreign lands, cultures, and faces that helped paint the backdrop for Frankenstein.The couple was embroiled in various sexual escapades, no doubt spurred on by close friend Lord Byron, and Mary soon fell pregnant by Percy. In October 1816, her half-sister Fanny, whom the couple paid little attention to before and after her death, killed herself with an overdose of laudanum. In December 1816, the pregnant body of Percy’s wife Harriet was found floating in Serpentine. She left behind a suicide note and Percy’s two children. Weeks later, Percy and Mary were married.Perhaps it would be tempting to consider, as F. Scott Fitzgerald says of Tom and Daisy in The Great Gatsby, that the Shelleys were ‘“careless people” who “smashed up things and creatures and then retreated back into their money or their vast carelessness or whatever it was that kept them together.” But in her new biography, In Search of Mary Shelley: The Girl Who Wrote Frankenstein, Fiona Sampson maintains that, on the contrary, the Shelleys were highly principled.\nAfter all, Godwin in Political Justice argued that suicide could be rational; Wollstonecraft attempted it herself when abandoned by her lover and Fanny’s father, Gilbert Imlay. Percy Shelley’s “free love” was perfectly self-explanatory. And Mary, in her defense, was besotted by him. But in other places, Sampson’s scathing disapproval of Percy’s character is barely contained. Born to every kind of privilege, she reminds us, he pursued his own whims and appetites and squandered the happiness of those who cared for him most.Mary Shelley, however, is to be judged by a different standard. Sampson writes that she was “coached” into her callousness toward Harriet, whom she “truly” believed to be “in the wrong both politically and personally.” Likewise, her indifference to the plight of Fanny is explained away as a function of her not yet having “developed a capacity for empathy.” And when Percy tried to persuade Mary into a suicide pact, Sampson notes that this might have been “persuasive to someone like Mary, whose view of love has been shaped by literature and by her own parents’ romantic story.”Does this narrative do Mary a disservice, I wonder? Was she not a smart, strong woman — a genius, even — who knew what she wanted and wasn’t afraid to get it? And was she also not, perhaps, a bit cruel and cold-blooded in her treatment of others? Sometimes it’s hard to fathom the elasticity of some feminist readings that bend and break under the weight of their own excuses.That said, Mary certainly had much to contend with. Of the four children she had with Percy, three died in infancy, two of them in the same year. When Percy drowned, he left her a widow and their surviving child fatherless. She received little to no support from her father. No doubt because of these pressures, she was never able to recreate the success of her debut novel despite her obvious talents. And she displayed impossible dignity in the face of such adversity. Here she is writing to her friend Marianne Hunt:May you my dear Marianne never know what it is to loose [sic] two only & lovely children in one year — to watch their dying moments —  then at last to be left childless & forever miserable. It is useless complaining & I shall therefore only write a short letter for as all my thoughts are nothing but misery it is not kind to transmit them to you–Sampson, surveying all of this, concludes generously that:Out of the material we would most of us find overwhelming she created an astonishing life. Despite being born a girl and motherless in her particular time and place, and despite being almost crushed by the ‘great men’ around her, she produced, while still only a teenager, the novel that uniquely sums up the restless, experimental spirit of her Romantic times. She changed the face of fiction; she has challenged every ‘modern’ generation since she wrote her first novel to explore both empirical science and moral philosophy; and in the hubristic researcher Frankenstein and his creature, the nearly human of our nightmares, she created two enduring archetypes.If Sampson’s aim is to make Shelley fascinating and endearing despite her most glaring flaws, her most catastrophic “principles,” this book is largely a success. But she really needn’t have tried so hard. The nature of Mary’s life, the torment, the bad decisions, the frustrated talents, are as manifest in her life as in her most famous work. Still, Sampson provides a stylish portrait of the young writer, illuminating the origin of Frankenstein and ensuring that Shelley is not, like her most famous creation, “borne away by the waves and lost in distance and darkness.”NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}