{"id": "Andrew Gillum Cries Racism When Asked About His Scandals\t\t\t\t\t\t\tAndrew Gillum Cries Racism When Asked About His Scandals\t\t\t\t\t", "paragraph": "National ReviewAndrew Gillum, the Democratic nominee for the governorship of Florida, is responding to the widely reported news that he has been caught lying about perks he received while in office by accusing those who have noticed the stories of racism.Per Politico, “documents turned over to the Florida Commission on Ethics” show that Gillum has misled the public in at least two ways. First, by accepting tickets to the broadway show Hamilton from an undercover FBI agent who was posing as a lobbyist, and then pretending that he believed they had been purchased by his brother. Second, by staying at a villa in Costa Rica that was paid for by “Adam Corey, a lobbyist and longtime ally of Gillum,” and then insisting he paid for it himself:During the gubernatorial debate, DeSantis also pressed Gillum on whether he paid for the “villa in Costa Rica,” a reference to his accommodations on that trip, which did not include Miller. Gillum has said he and his wife paid cash for the May 2016 Costa Rica accommodations, a contention refuted in the newly released emails.In one of the emails, from June 2016, Corey promised his accountant a breakdown of an $8,868 credit card charge. Corey’s assistant later responded with a list of people to invoice.That list shows that Gillum and his wife, R. Jai Gillum, were responsible for $941.95, but that line was crossed out. A note next to it said, “HOLD ON BILLING.” Gillum’s email address was not included in a subsequent list of people who were invoiced for taking part in the Costa Rica trip.In September, Kise said his client never received money from Gillum.It seems pretty clear that Gillum has been untruthful in his description of these transactions. Or, rather, it seems clear to everyone other than Andrew Gillum, who has taken to suggesting that the questions he is being asked are motivated by racism. During the first debate with DeSantis, Gillum said the following when asked about the Hamilton tickets:“I didn’t take free trips from anybody. I’m a hardworking person. I know that may not fit your description of what you think people like me do. But I’ve worked hard for everything that I’ve gotten in my life, and I don’t need anybody handing me anything for free.”This morning, Politico confirms, Gillum is sticking with this angle:“All along … they’ve wanted the people of this state to believe somehow I haven’t deserved what I’ve gotten, I’m unethical, participated in illegal and illicit activity. I mean, you name it. The goal is obviously to use my candidacy as a way to reinforce, frankly, stereotypes about black men.”One has to wonder who “they” is. As far as I can see, every single newspaper here in Florida has covered this story, including all the ones that have endorsed Gillum. This is not a wild conspiracy theory, nor a half-truth spun out of proportion by a random blogger. It is a real story that has appeared in real outlets. That Gillum’s instinct is to cry “racism” when questioned about a legitimate story is extraordinary — and it does not bode well for Florida should he prevail in the coming election.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}