{"id": "Embrace E-Verify\t\t\t\t\t\t\tEmbrace E-Verify\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Case for the Wage Subsidy\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tMaking Acosta a Federal Case\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAgainst the ‘Coercive Elimination of Dissent’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe ‘Wall’ Continues to Be Built . . . Slowly\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump’s Not Populist Enough\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tRick Scott’s Lead Increases after Recount\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPelosi Vows She’ll Be Speaker Despite New Potential Challenger\t\t\t\t\t\t\t\nAs we wrote early this summer, an electronic system called E-Verify is the key to solving the illegal-immigration problem. By participating in this voluntary program, employers can ensure that their workers are in the country legally; were its use made mandatory, the attraction of illegal immigration would decline precipitously. Because so many illegal immigrants come by overstaying visas rather than by sneaking across the border, its potential effect is far greater than that of even a border wall.The 115th Congress has failed to pass legislation to this effect, but with an immigration restrictionist in the White House for at least two more years, there is still hope for the 116th — if it has a clear mandate to do so. This is why it’s crucial for Republican Senate candidates to strongly endorse E-Verify. Many candidates have done so. But others have been quieter on the issue, and they need to speak up.Among the Republicans with a decent chance to win next month, there are many who have aggressively promoted E-Verify in the past — sometimes when it really mattered. Arizona’s Martha McSally, Tennessee’s Marsha Blackburn, and North Dakota’s Kevin Cramer all cosponsored a bill in the House, the Securing America’s Future Act, that among much else would have mandated the program. Current Republican senators up for reelection Deb Fischer (Nebraska) and Roger Wicker (Mississippi) cosponsored a recent bill to mandate E-Verify as well.Florida governor Rick Scott has required state agencies and contractors to use the program; Indiana businessman Mike Braun uses it at his own company. Mitt Romney, running to take Orrin Hatch’s Senate seat in Utah, supported the program during his presidential run and continues to endorse a “simplified legal status verification system” in which employers who hired illegal workers would be sanctioned. In Ohio, Jim Renacci’s website endorses “instituting a nationwide E-Verify system.” Texas senator Ted Cruz, too, has argued in the course of his reelection campaign that E-Verify is an essential component of immigration reform. But even these candidates do not all explicitly endorse mandatory E-Verify on their 2018 campaign websites, and others’ positions are even harder for the average voter to suss out — some of them candidates who take a strong stance on the underlying issue of illegal immigration. Wyoming’s John Barrasso and Nevada’s Dean Heller cast assorted pro–E-Verify votes years ago but have not spoken up too loudly of late. Senate hopefuls Josh Hawley in Missouri and Cindy Hyde-Smith in Mississippi vociferously oppose illegal immigration but do not promote E-Verify in particular on their sites.Even some Democratic senators, facing desperate electoral circumstances, have embraced E-Verify. North Dakota’s Heidi Heitkamp and Missouri’s Claire McCaskill sponsored a bill this year to require it. What’s the holdup for Republicans?\nShould the GOP gain ground next month, a serious immigration reform may again be on the table. At that point, the GOP will need to be united — and will need a clear command from voters to address illegal immigration in an effective way. Vocally supporting E-Verify now can provide candidates that mandate, and may help them win their races to begin with as well.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}