{"id": "‘. . . That Has Such People In It’\t\t\t\t\t\t\t‘. . . That Has Such People In It’\t\t\t\t\t", "paragraph": "National ReviewIn his latest column (to which I’m now a few days late), Ross Douthat once again ably takes up the question of the decadence of our culture. But for me, he also raises the question of whether some unacknowledged source of terror has gotten us here.With his usual sharp eye for the revealing detail, Douthat notes a couple of recent bits of journalism that, from two different directions, tell a strange story about where the sexual revolution has brought us. Rather than free love (as the left might have hoped) or social chaos (as the right might have feared), he writes, many younger Americans live now in “a realm of fleeting private pleasures and lasting social isolation, of social peace purchased through sterility.”The left and the right may not have seen this coming, he continues, but:the one person who really saw it coming was Aldous Huxley in “Brave New World,” the essential dystopia for our times, which captured the most important feature of late-modern social life — the way that libertinism, once a radically disruptive force, could be tamed, domesticated and used to stabilize society through the mediation of technology and drugs.This seems right. And as NR’s Kyle Smith wisely noted in another response to Douthat this week, it is Huxley’s vision, far more than the other familiar mid-century dystopia of George Orwell’s 1984, that seems to speak to our circumstances.And yet, this reading also overlooks an essential element of Huxley’s prophecy: He thought this kind of decadence, this soul-crushing, domesticated libertinism, could only really happen as a means of escape from the horrors of a nearly apocalyptic war. The world Huxley describes lies not at the painfully ironic end of a path willingly chosen by a society that had “liberated” itself out of any genuine understanding of freedom. It is the work of an utterly totalitarian global regime offering relief from the horrors of a war that had killed untold masses and wreaked immense destruction everywhere. As Mustapha Mond, the World Controller, says in Huxley’s story:People still went on talking about truth and beauty as though they were the sovereign goods. Right up to the time of the Nine Years’ War. That made them change their tune all right. What’s the point of truth or beauty or knowledge when the anthrax bombs are popping all around you? That was when science first began to be controlled—after the Nine Years’ War. People were ready to have even their appetites controlled then. Anything for a quiet life.Again and again in the book, we find references to that war that suggest it nearly destroyed civilization. And it was that near-destruction that had caused men and women to essentially abandon the wellsprings of civilization in return for a life of fleeting pleasures and social peace. That would suggest that Huxley didn’t really foresee the cultural turn that Douthat points to. Read in its own terms, the book does not suggest that we might just do all this to ourselves on purpose without the pressure to escape at all costs from an unbearable reality of self-destruction.NR's afternoon roundup of the day's best commentary & must-read analysis.Brave New World is in a very fundamental sense an anti-war book, a warning about what the power to destroy might do to our willingness to live fully human lives. It’s a much more plausible story of how humanity could surrender to decadence. What we have in fact been witnessing and doing in the modern West is harder to explain.It may be that the near-death experience of the Second World War, which began just a few years after Huxley’s book was published, had this effect on the societies that lived through it—and that this has been less obvious but not less true in America, where we didn’t directly experience the horrendous physical destruction of the war. There was a very widespread sense at mid-century (which Huxley partially foresaw in the ’30s) that the horrors of the atomic age would destroy our capacity for civilization. This sense is everywhere in the thought of the postwar German expatriates in Britain and America in particular. And maybe they were right—maybe this really is what happened. Maybe the decadence of postwar Western culture is Hitler’s ultimate revenge, a response to coming face to face with earth-shattering power. But if so, it has happened without the actual shattering.And the explicit response of many Western societies in the immediate wake of that war was a kind of ecstatic relief that we had not gone over the precipice. Huxley himself felt this way. In a foreword written for the second edition of Brave New World, in 1946, he took note of the fact the terrible war had come but had not destroyed all civilization. Maybe the war had been a phase in the story whose future chapters he was seeking to predict in the early ‘30s, he wrote. “Its next phase may be atomic warfare, in which case we do not have to bother with prophecies about the future.” But the circumstances of the immediate postwar moment suggested there was also a possibility that we would stop short of utter self-annihilation:It is conceivable that we may have enough sense, if not to stop fighting altogether, at least to behave as rationally as did our eighteenth-century ancestors. The unimaginable horrors of the Thirty Years War actually taught men a lesson, and for more than a hundred years the politicians and generals of Europe consciously resisted the temptation to use their military resources to the limits of destructiveness or (in the majority of military conflicts) to go on fighting until the enemy was totally annihilated. They were aggressors, of course, greedy for profit and glory; but they were also conservatives, determined at all costs to keep their world intact, as a going concern…Assuming, then, that we are capable of learning as much from Hiroshima as our forefathers learned from Magdeburg, we may look forward to a period, not indeed of peace, but of limited and only partially ruinous warfare.And yet, the cultures of the Western democracies in the decades that followed have behaved in something like the ways that Huxley had originally imagined would follow the most horrendous sort of cataclysm. If his book was prophetic, it suggests that we have been acting out of a sense of trauma we have not been able or willing to quite articulate to ourselves—that we have described as a pursuit of liberty what has actually been a terrified escape from the burdens of responsibility for our civilization and from the implications of our power.Maybe that’s true. If it is, it would vindicate Huxley’s powers of prophecy while also partially absolving liberalism of some of the serious charges now increasingly thrown at it by various traditionalists. But I wonder if the fundamentally chosen (and so at least in some respects optional) character of the path we have taken suggests that, while Huxley was brilliant at following the arcs of some powerful biotechnologies to their logical conclusions, his sociology was far from prophetic.I think that’s actually a more hopeful reading of the evidence, because it would suggest that the widespread (if largely inarticulate) dissatisfaction with this path we have been on may keep us open to the possibility of another kind of path, which is still available, as ever, to those who are willing to lift their gaze toward it and so to see and to heed a very different kind of truth about what freedom is.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}