{"id": "Trump’s Judges Would Block Trump’s Birthright-Citizenship Executive Order\t\t\t\t\t\t\tTrump’s Judges Would Block Trump’s Birthright-Citizenship Executive Order\t\t\t\t\t", "paragraph": "National ReviewIn the matter of the Constitution and birthright citizenship, I believe the proper originalist interpretation is that children of even illegal immigrants are granted citizenship. In other words, in the friendly dispute between my friends and NR colleagues Andrew McCarthy and Dan McLaughlin, I’m on Team Dan. But rather than weigh in at length, let me simply refer you to the persuasive and authoritative words of former Gibson, Dunn & Crutcher partner James Ho, writing in The Federalist in 2015:To be “subject to the jurisdiction” of the U.S. is simply to be subject to the authority of the U.S. government. The phrase thus covers the vast majority of persons within our borders who are required to obey U.S. laws. And obedience, of course, does not turn on immigration status, national allegiance, or past compliance. All must obey.Common usage confirms this understanding. When we speak of a business that is subject to the jurisdiction of a regulatory agency, it must follow the laws of that agency, whether it likes it or not. When we speak of an individual who is subject to the jurisdiction of a court, he must follow the judgments and orders of that court, whether he likes it or not. As Justice Scalia noted just a year ago, when a statute renders a particular class of persons “subject to the jurisdiction of the United States,” Congress “has made clear its intent to extend its laws” to them.More:[T]he text of the Citizenship Clause plainly guarantees birthright citizenship to the U.S.-born children of all persons subject to U.S. sovereign authority and laws. The clause thus covers the vast majority of lawful and unlawful aliens. Of course, the jurisdictional requirement of the Citizenship Clause must do something — and it does. It excludes those persons who, for some reason, are immune from, and thus not required to obey, U.S. law. Most notably, foreign diplomats and enemy soldiers — as agents of a foreign sovereign — are not subject to U.S. law, notwithstanding their presence within U.S. territory.Foreign diplomats enjoy diplomatic immunity, while lawful enemy combatants enjoy combatant immunity. Accordingly, children born to them are not entitled to birthright citizenship under the Fourteenth Amendment.This conclusion is confirmed by history. The Citizenship Clause was no legal innovation. It simply restored the longstanding English common law doctrine of jus soli, or citizenship by place of birth. Although the doctrine was initially embraced in early American jurisprudence, the U.S. Supreme Court abrogated jus soli in its infamous Dred Scott decision, denying birthright citizenship to the descendents of slaves. Congress approved the Citizenship Clause to overrule Dred Scott and elevate jus soli to the status of constitutional law.Why quote Ho at such length? Because he’s now Judge Ho, a Trump appointee sitting on the key Fifth Circuit Court of Appeals. He’s a man who may very well write an appellate opinion in a case challenging a Trump executive order. Indeed, it was the Fifth Circuit that blocked President Obama’s most dramatic use of the “pen and phone” — his Deferred Action for Parents of Americans (DAPA).Of course Judge Ho may not be representative of all Trump judges, but his thoughts do show the strength of the originalist interpretation that the 14th Amendment very broadly grants birthright citizenship. But even if different Trump judges disagree with Judge Ho’s view, it’s hard to think of a single Trump judge (and I’m familiar with the writings and thinking of many of his nominees) who would hold that Trump could reject relevant federal statutes simply by signing an executive order. I completely agree with Andy McCarthy when he says, “[T]he president may not unilaterally change an understanding of the law that has been in effect for decades under a duly enacted federal law.”No, he may not, and I not only have confidence that Trump’s Supreme Court picks would block his order, I don’t believe the order would survive even a Trump district-court pick’s review. Originalism and the plain meaning of federal statutes stand in the way of the Trump trial balloon. Let’s hope it pops before the president can put his unconstitutional pen to paper.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}