{"id": "Don’t Abuse the All-You-Can-Eat Buffet\t\t\t\t\t\t\tDon’t Abuse the All-You-Can-Eat Buffet\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tWho Picked This Nose?\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tJoin Rick Brookhiser Discussing His Important New Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tDusty & Gleaves Rhodes: Class Acts\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThat War That Didn’t End All Wars\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tOn the Plus Side\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWe Are a Few Bucks Shy of the Goal\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWin One for the Gipper!\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAll the Cool Kids Are Signing Up for NRPlus\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWork For the Fix!\t\t\t\t\t\t\t\n\n\nNational Review Gives Tradition Its Due\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTommy Boy! NR Now $30 Closer to Webathon Goal\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tRecalibrating the Recalibration\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tNR Keeps the Fight for Conservatism Going\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCrispin, Crispinian, Crispiniest\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThanks to You, We Are Recalibrating\t\t\t\t\t\t\t\nThis final solicitation of our Fall 2018 Webathon will not be filed under “kill them with kindness.” No, I come to insult, to berate, to antagonize . . . which is a strange way to appeal. Let’s call it an unappealing appeal.But unappeal I must, at least when addressing a certain (very large) class of NRO readers and feasters — there are hundreds of thousands of you! — who know that their chubby hands are in the cookie jars, crumbs on their chins and shirt, and that I have the photo evidence.But let’s not play gotcha. Not too much anyway. Let’s do this instead (and be prepared for a lot of metaphor-mixing):. . . let’s encourage the NRO frequent flyer to put down the drumstick and look into his conscience and to ask it: “Conscience, given all the consumption I’ve enjoyed here at NRO, is not the right thing for me to do to make a gesture — not a hand wave or a thumbs-up or an attaboy — but a financial contribution, to acknowledge both the excellence of everything over which I’ve lip-smacked these past months and years as an NRO squatter? By the way, Conscience, I’m asking because this jackass NRO Suit is harassing me about discussing this with you.”And Conscience will reply: “You have stuffing at the corner of you mouth. Right there. Nope, the other corner. You got it. Now, are you asking me should you make a donation to NR? Of course you should, and you should have done it months ago!”If you come to NRO (I have permission to use that abbreviation; all others here now must resort to nationalreview.com) every day, several times a day . . . if you relentlessly feast here on all the amazing conservative content . . . if this is the source for a doctor-recommended daily dose of sanity and wisdom . . . if you can’t start a morning without a Geraghty Jolt . . . then you have to donate.Hey, I’m not telling you this — your Conscience is.Friends, you are not stupid. You are smart (and not in a Fredo way), because you are conservatives. We think . . . they feel. We give . . . they take. And because you are conservatives you know this cardinal rule of economics: There ain’t no free lunch.Hey! Maybe we’re the ones not so smart, because we provide that free lunch — and breakfast and dinner and late-night snack. Regardless: There comes a time when even the guy whose picture is next to “tightwad” in the dictionary knows he has to put something into the tip jar or the collection plate. Knows that yeah, it may only happen once a year, or a decade, but it’s my grudging turn to buy back. Knows that yeah, a lot of other people have been buying me and my insatiable thirst endless rounds for endless days.About the worst thing someone can say to you is: You smell. And boy oh boy have I heard a lot of that in my life.But about the next worst thing you can say to someone is : You’re cheap.Are you?You see, if you smell, it may or may not be a conscious act. And if you desire, just write me separately and I can share my thoughts and experiences offline. But if you are cheap, well, yeah, it’s not an omission. It’s very much an act — I almost said sin — of commission.Now, you don’t want to be cheap.So to you soon-to-be ex-NRO-freeloaders: The time has come for you to show support. NRO means the world to you, is your safe space, is your playground and your theater, all that and so much more, all rolled into one. All this great writing, all this ramparts-mounting and bayonet-fixing and lefty-b****-slapping, all that and more — it happens because our friends from time to time show us some support.This time is your time to time. (function() { var d = document, fr = d.createElement('script'); fr.type = 'text/javascript'; fr.async = true; fr.src = 'https://static.fundrazr.com/widgets/loader.js'; var s = d.getElementsByTagName('script')[0]; s.parentNode.insertBefore(fr, s);})();Our webathon goal is $300,000. As I type we are about $20,000 short of that. We shut down the appeals and berating at 11:59 p.m. on Election Night. See fit to making that important donation before then. How about . . . right now? As for how much, nothing is too small or too big — $10, $100, $1,000, the amounts may differ, but each and every contribution is truly appreciated and beloved.Okay, please make that donation here.Now go back to the buffet and get yourself some of that tapioca. It’s really creamy. And did you try the eggplant parmigiana? It’s like my grandmother is in the kitchen!NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}