{"id": "Winning Is the Goal, Not Hunting RINOs\t\t\t\t\t\t\tWinning Is the Goal, Not Hunting RINOs\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAbrams Campaign Considers Drastic Legal Measure to Force Another Vote\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBroward County Missed Recount Deadline by Two Minutes\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFlorida Dems Gave Out Altered Form to Fix Absentee Ballots Past Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Election’s Lesson for Democrats: Don’t Nominate Hillary Clinton\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tMichael Avenatti Bites the Dust\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tUrban Cowboys\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Blue Wall\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLosing the Suburbs\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tToward a Bigger Coalition\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFlorida Judge Gives Voters Additional Time to Correct Rejected Ballots\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHillary Clinton: If Stacey Abrams ‘Had a Fair Election, She Would Have Already Won’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAnyone but Nancy Pelosi for Speaker\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe GOP’s Orange County Problem\t\t\t\t\t\t\t\nOne day before the midterms, in “RINOs Will Take Their Revenge,” Henry Olsen forecast the election outcome but missed the mark in his gratuitous swipe at Club for Growth. Olsen repeated the theme popular among establishment Republican fundraisers that the Club for Growth’s only job during primary season is the hunting down of RINOs (Republicans in Name Only). Olsen apparently hasn’t been paying attention to the Club for Growth PACs’ many successes in recent elections.In the last two elections cycles, we have helped elect 31 senators and House members — and all are leaders in the GOP and true believers in Republican principles. These include Mike Lee, Pat Toomey, Marco Rubio, Ted Cruz, and Ron Johnson, and this cycle’s Marsha Blackburn, Josh Hawley, and Rick Scott. The goal of the Club’s super PAC is to elect leaders who will fight for conservative principles, not only in name but also in reality.This November, the Club for Growth PAC spent and bundled nearly $30 million for conservative Senate and House races. We helped fund the Senate races of Josh Hawley (Missouri), Marsha Blackburn (Tennessee), Rick Scott (Florida), Ted Cruz (Texas), and Matt Rosendale (Montana). We supported the House races of Van Taylor (TX-03), Ron Wright (TX-06), Chip Roy (TX-21), Michael Cloud (TX-27), Mark Green (TN-06), Mark Harris (NC-09), Ted Budd (NC-13), Denver Riggleman (VA-05), Steve Chabot (OH-01), and Dave Brat (VA-07).Most of these races were pitched battles against Democrats. Nine of them were key races that would determine whether the establishment Republican House would keep its majority.The Club for Growth PAC contributed substantially to three Senate pickups and won seven of those nine contested Republican House seats. That makes us the most successful Republican political organization that spent money in this election.\nWe win races for two reasons. First, we are extremely efficient in spending on political campaigns. One hundred percent of the Club for Growth PAC’s bundled contributions go to the candidates, and 95 percent of contributions to our super PAC are spent on voter contact.The second reason is that the Club for Growth PAC endorses only true believers in conservative principles. They are men and women who exhibit integrity — they campaign on principles and policies that reflect the core of their fundamental beliefs.Olsen’s worries that Republicans do not have the ability to build a governing majority coalition. In fact, he sets forth a false dichotomy that, if true, would lead to predictions of doom and gloom for Republicans. Namely he posits that Republicans must choose between a RINO vision of Republicanism and Steve Bannon–inspired style of popular nationalism. Neither will be successful in building a national governing coalition.RINOs will fail either because they force the GOP to repeatedly break faith with its conservative base and forsake campaign promises, or because they insist that there be no Republican agenda  at all, which then relinquishes the messaging advantage to Democrats. Such was their fate last Tuesday.Popular nationalism as expounded by Steve Bannon fails for a different reason. It seeks to revive an economic structure that is no longer relevant in the modern world. Nationalists call for Republicans to abandon key free-market economic tenants such as free trade and even to jettison growth-oriented tax cuts. Instead, they hope to use industrial policy to buy voting blocks of workers in favored industrial sectors. Extreme versions of this approach would involve taxing investors and capital to subsidize working middle-class wages. This is a recipe for economic disaster, and it would doom the Republican party to permanent minority status for several generations, as happened after President Hoover’s protectionist response to the Great Depression.A better path is an authentic Republican vision grounded in freedom and limited government that unleashes private-sector energy and innovation, personal freedom, and a robust civil society. Together, these forces have made and will continue to make America great.Historically, Republicans have been politically successful when they have lived up to their limited-government platform. This was true at the beginning of the 20th century, and it was true at the end of the 20th century, exemplified by the Reagan years and the 1994 Republican revolution.Olsen himself offers Reagan as a model for the GOP, but he doesn’t give our 40th president enough credit for his fiscally conservative vision.There is no question about it: Ronald Reagan won election and governed as a limited-government conservative. He warned of the dangers of big government and believed in the power of the free market to lift up people no matter where they lived and where they came from. He won with a coalition of rural, suburban, and conservative Democrats.Club for Growth’s purpose is to identify, and through its PAC elect and support, the next generation of leaders who will champion the 21st-century platform grounded in those same principles of liberty. And the results speak for themselves.The success rate of the Club for Growth PAC is 85 percent of the races in which we made endorsements — a much better average than that of the House committee and leadership super PACs. Many of seats we helped win are in competitive areas that include the suburban voters that Olsen deems “RINOs.”In Pennsylvania’s newly drawn tenth district, which includes the suburbs of Harrisburg, Freedom Caucus member Scott Perry faced a strong Democratic opponent. The Cook Political Report rated the race a toss-up. Perry embraced his fiscally conservative principles on the campaign trail instead of running away from them, and he pulled off a three-point victory.Club for Growth’s PAC also supported conservative Ross Spano in the open seat in Florida’s 15th district, another toss-up according to the Cook Political Report. The 15th district includes Tampa’s eastern suburbs, and yet Spano won 53 percent to 47 percent.In North Carolina’s ninth congressional District, the Club for Growth PAC endorsed Mark Harris in yet another toss-up race. Harris is a strong limited-government conservative who beat moderate Robert Pittenger in the Republican primary in suburban Charlotte. He pledged to join the Freedom Caucus and didn’t run away from his fiscal conservatism in the general election.These political successes are not new. Year after year, Club for Growth’s PAC has helped elect unapologetic fiscal conservatives in swing states and blue states.With the Club for Growth PAC’s support, Senator Pat Toomey has now won statewide election twice in Pennsylvania on a platform of limited government and free-market reforms. In 2016, Toomey pulled off this impressive feat by performing better than Donald Trump did in the crucial Philadelphia suburbs. Ron Johnson similarly outperformed Trump in 2016, winning reelection in blueish Wisconsin even after the political intelligentsia wrote him off for dead. Toomey and Johnson went on to become the key architects of the Republicans’ major accomplishment in this Congress: the 2017 tax cut that has sparked tremendous economic growth.Indeed, the Club for Growth is about much more than bagging RINOs: We aim to elect the next generation of leaders who will secure America’s economic and political freedom. NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}