{"id": "Adopting Life: A Symposium\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBelieve in Creed II \n\n\n\t\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Lessons of the Asia Bibi Case\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAgainst the ‘Coercive Elimination of Dissent’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\nNovember is National Adoption Month and the Saturday before Thanksgiving National Adoption Day. We asked adoptive parents and other experts: If you could do one or two things immediately to help people understand how crucial being open to and supportive of adoption, what would it be? If you could urge families to take serious steps to discern if this is something they can prudently take on, what would you have them do, read, see?What’s your chief hope for adoption in the public square and in the policy and legal spheres?Here’s how they responded. — Kathryn Jean Lopez Grazie Pozo ChristieAdoption is the best answer to many vexing situations. It’s not a perfect answer, because in human relationships nothing is perfect. But it is certainly the best answer. For instance, it is the finest answer to the question of what to do with a child who finds him or herself alone in this hard world, unprotected and unloved.\nIt also happens to be the most loving answer to the problem of infertility, turning that very painful condition into pure gift, to parents and child.I would like to see a strong and concerted effort by the current administration to open the sluicegates of international adoption. In the United States, where many thousands of couples would like to adopt, there is a dearth of orphans available for adoption, but not so in other parts of the world. Countries with cultures that reject girl-children are especially important to access, as international adoption is a much better option for these girls than abortion, abandonment, and infanticide. Diplomatic efforts are needed, as well as real legal bulwarks against the corruption that too often stains the process of international adoption. Really, it’s a question of getting the government interested in facilitating this lovely work, and gaining the trust of foreign governments.In order for any kind of adoption (domestic or foreign) to be considered by potential parents, the culture of adoption has to be strengthened. The culture means the whole philosophical understanding of what it means to be a mother or a father, and who qualifies as a son or daughter. In parenting, biology is very important, but the willing leap of love that a soul makes when it takes another for his or her very own is just as powerful. Falling in love with a child born of another woman was the prettiest thing that has ever happened to me. It taught me things about God and love that I had never known before. This experience is exalting and ennobling — and should be sung to the skies. Adoption is not a last resort but a vocation and a road to joy.— Grazie Pozo Christie is a radiologist in Miami who serves as policy adviser for The Catholic Association.Kathleen Buckley DomingoThe best way to encourage fostering and adoption is to ask! Often, people’s understanding is based upon hearsay, and misconceptions abound. Hearing directly from foster or adoption families and from social workers, judges, and agency leaders, they are introduced to children in need of homes from those who work with them daily. In this context, individuals and families are empowered to make an educated decision. Families are generous! Using this model in our Los Angeles parishes has resulted in over 600 families currently pursuing fostering after just a few months of intentional promotion. In addition, by educating parishes broadly, many people surface who can support foster families, even if they are not in a position to foster or adopt.Families discerning fostering or adoption should engage with families with personal experience. Local agencies hold events for prospective families to get to know foster families and foster youth. Online tools introduce us to foster youth and their experiences. It is important for families to understand the reality of fostering — both the great rewards and the great challenges. Today, I recommend the movie Instant Family, which humorously but accurately portrays the generosity and strength needed to lovingly welcome foster children!Adopting and fostering children is a great public service and something that should be encouraged and incentivized in public policy and in law. The process for birth mothers to create and execute an adoption plan should be made as easy and supportive as possible. And, the process for becoming a foster or adoptive parent can be streamlined. In Los Angeles, there is such a great backlog of families waiting to be approved for fostering simply because the process is long and there is a disproportionately small staff. In the meantime, we have over 30,000 children waiting in our child-welfare system in L.A. County.— Kathleen Domingo is director of the Office of Life, Justice, and Peace at the Archdiocese of Los Angeles. Holly Taylor CoolmanI don’t know of anything we do that is more important than to give kids a family and a home, a place to belong. We talk about so many ways that we can work for good in the world — and there are many! — but what could be more central than forming human beings to love and be loved? Every parent does that, but adoptive parents do it in a particular way, often with particular challenges.Given the numbers of kids who need families, I think we do best when we think of this challenge not only in terms of what individual families can do, but what communities can do. Communities of faith, especially, should consider the possibility of becoming “adoption-friendly” collaboratives in which families support one another in many ways.The single best option would be to speak with families who have adopted. We all have certain scripts in our mind for other big life options: school, marriage, travel. But most of us are missing the scripts that would allow us to think about adoption. We need stories through which we can begin to build a map of adoption: What’s possible? What’s hard? What’s great? Online resources have an important part to play. The Web can connect us to people, ideas, practical strategies, reading lists, and more.Two very important measures at present are (1) protection and expansion of the adoption tax credit (which is an important financial support for adoptive families) and (2) protection for adoptees from abroad in immigration law.— Holly Taylor Coolman is a professor of theology at Providence College and adoptive mother.Andrea Picciotti-BayerEveryone needs to feel loved. This need is enormous, however, for a child who has suffered abuse or neglect at the very hands of the people entrusted to nurture and love them. Sadly, the number of children lacking loving and stable homes has risen as the opioid crisis affects more Americans. Today, more than ever, many Americans are called to open their homes to suffering children in need. While temporary foster care is all that is needed for some, these initial safe havens often become permanent homes through adoption. But we’re seeing a terrible trend.Despite decades of service, many faith-based foster care and adoption organizations are closing their doors. They were given an ultimatum: Agree to place children in same-sex households or do get out of the foster-care and adoption-placement business entirely. While compliance is not a problem for many agencies, others cannot endorse same-sex households without contradicting their religious teaching on human sexuality and the family. Many have shut down rather than violate their deeply held beliefs. Some, however, are unwilling to go down without a fight.Catholic Social Services (CSS) in Philadelphia is an example. CSS partnered with the City of Brotherly Love’s foster care system for decades. CSS’s foster care is part of the Catholic archdiocese’s religious ministry. And they have been wildly successful. CSS-certified and -supported parents have subsequently adopted many of the children initially placed in their foster-care homes.I interviewed a number of these former CSS-supported foster children for the Catholic Association’s amicus brief supporting CSS’s suit against the city of Philadelphia. The stories are beautiful. From the first day, these children were treated as members of the family. From the first day, they felt loved.As more and more “children in need” pour into the country’s foster-care system — children needing a safe haven from abuse and neglect, children yearning for a permanent home to call their own — it is imperative to keep as many foster-care homes open as possible. Homes supported by faith-based organizations like CSS in Philadelphia need to remain open to answer their cries for security and love.— Andrea Picciotti-Bayer is legal adviser at the Catholic Association.John M. BreenThe biological connection between family members is one of the most powerful forces on earth. It binds parent and child together and gives the offspring of any couple an immediate sense of identity. The popularity of genetic testing today testifies to the power of this connection and sense of identity even with unknown ancestors across generations.But the most powerful source of connection and identity for any human being isn’t biology. It’s love. It’s not a set of genetically determined characteristics. It’s the recognition that one is loved, that one’s existence and flourishing are supported by the sacrifice of someone else. For any child, whether born into a family or adopted, their sense of identity comes from knowing that they belong to the heart of another!Society’s emphasis on the physical misleads some into thinking that adoption doesn’t create a “real” family and is always second best. The truth is that both biological birth and adoption are to parenting what a wedding is to marriage: a momentous event that marks the beginning of something the full meaning of which lies ahead in the joys and sorrows, triumphs and challenges of a life lived together.Every child is a gift, but an adoptive parent realizes this in a more immediate way. You know that you did not bring this child into the world, yet you are now the person responsible for their well-being. The truth is there and stares you in the face. And you stare back at him or her — at this perfect stranger, this perfect gift — and you know in an instant that your heart is not your own. Love is thicker than blood and it conquers all the failures and disappointments that life presents.The resolution to an unplanned pregnancy is often seen in stark, binary terms: parenthood or abortion, an unfulfilled life “punished with a baby” or freedom. Adoption is too seldom considered, and when proposed is easily dismissed. We live in the Upside Down in which placing a child for adoption is regarded by many as a greater tragedy than abortion. This confusion must be overcome. Women who make the truly loving choice of adoption must be honored and supported, financially and otherwise, through crisis pregnancy centers and other institutions that attend to the needs of both mother and child. Only then can the world again be set right.— John M. Breen is the Georgia Reithal Professor of Law at Loyola University Chicago. He and his wife Susan are the parents of two teenage boys whom they adopted as infants.Elizabeth KirkAdoption, properly understood, is a response to brokenness, a means of healing, and ought always be in service to the child. But, in the popular imagination, adoption used to have a stigma, one earned through a complicated history and amplified by negative portrayals in novels, films, and sensational news stories. Particularly, those with the obligation of care for vulnerable orphans have never fared well in fiction — from Oliver Twist to Harry Potter. Today, however, that cultural perception is changing. From the quirky, heartwarming depiction of infant adoption in Juno, to the deftly sensitive depiction of transracial adoption in the NBC series This is Us, to the upcoming feel-good film about adoption through foster care in Instant Family, the institution of adoption is experiencing a rehabilitation, even a celebration, and rightly so. Today, adoption is an institution that most people would describe as beautiful, selfless, and even noble.And yet . . . the choice of adoption is quite rare. To take domestic infant adoption for example: women facing a crisis pregnancy choose abortion over adoption by a ratio of 50:1. Let that sink in. There are approximately 1 million abortions annually in the United States, while by the most generous reports, there are less than 20,000 newborns placed each year for adoption. Women consider abortion a solution largely because they believe they have other competing demands (e.g., other children, a job, an education) and not enough support or resources (e.g., income or partner) to meet those demands. In other words, they do not feel they are able to parent. But instead of placing a child for adoption, women overwhelmingly choose abortion. The reality is that, despite positive social attitudes toward adoption, most women facing a crisis pregnancy do not consider it a meaningful option. Similar gaps between theory and practice could be described in foster care, where in 2015, more than 110,000 children across the nation waited to be adopted.We have a paradox of abstract esteem for the institution of adoption that goes hand-in-hand with the reality that it is a disfavored choice. We must do more — in culture, policy, and law — to change that reality. We must give pregnant women in crisis accurate, complete, and non-coercive information about adoption. We must ensure that a diverse group of providers, including faith-based organizations, are available to serve all vulnerable women and children. We need to do more to keep families in crisis out of foster care, and to promote efficient, timely permanency planning for those children in the foster-care system. We need to support post-adoption resources, especially for those families that welcome children with special challenges or needs.Each of us must ask: What can I do to respond to the plight of today’s orphan — the child at risk of abortion and the child languishing in foster care?— Elizabeth Kirk is a lawyer, writer, and consultant who has a special interest in adoption law and policy. She also serves as an associate scholar with the Charlotte Lozier Institute.Rebecca MastersonPlease let me introduce you to Johnny.Johnny’s parents severely neglected him, and, on his third birthday, the state removed him from their care. He spent the following 14 years in “temporary” foster care. That’s when I entered the picture as Johnny’s pro bono special-education attorney.A review of his file told me all I needed to know — Johnny had been moved over 40 times. From foster placements to group homes, from county to county, he moved every few months, sometimes several times a semester. Credits went missing, progress was lost, and Johnny, as a ward of the state, had no one to help him.I quickly saw that when Johnny advocated for himself, he was labeled defiant. When he became upset that past school work vanished, he was labeled aggressive. When he expressed legitimate frustration at the system in which he was trapped, he was medicated.I took an interest in this young man. Johnny was whip-smart, eloquent, and motivated. But he had no marketable skills, no place to live, no family. Johnny knew that he was going to age out of foster care because “no one wants me.” After all, that had been the story of his life. He was scared to death.After being Johnny’s advocate for six months, I couldn’t shake the feeling. I tried to reason my way out of it: I already had one child with severe special needs. He needed a mom who could parent full time. I knew nothing about raising teenagers. And yet . . .Three months shy of his 18th birthday, Johnny formally became my son through adoption.In state care, Johnny had been diagnosed with seven psychological disorders, prescribed psychotropic medications, placed in special-education classes, and considered behavioral and violent. In the arms of my family, Johnny is off medication, has an accurate diagnosis of untreated PTSD, is in a mainstream classroom earning all As and Bs, and his most severe behavior is rolling his eyes when I ask him to take out the trash.No two stories will be the same. How will yours be written?— Rebecca Masterson has two sons, both adopted, and serves as chief counsel and vice president of Generation Justice.Jedd MedefindWe need to hear directly from people who needed a family but never got one: The young man who aged out of foster care and now has no place to go home to for holidays or the teenage orphan in another country who might have been adopted as a little girl but was prevent by bad policies. We should also hear reflections from a person who was welcomed into a loving family through adoption. Certainly, adoption can be messy. But when you hear these stories, you grasp why family is the most precious gift on earth.To help families, we should encourage anyone considering adoption to talk with at least a few others who are well down that road now. No single perspective is the complete picture, of course. But each will give an important window into the special joys and challenges of adoption. Likewise, a trustworthy adoption agency can also be a great ally in understanding the lay of the adoption landscape and what to expect, both in the adoption process and in the life-long adoption journey. I’d also recommend the book, The Connected Child.The American people believe deeply in the importance of family, and most view adoption as a beautiful way for a child to become part of one. I’d love to see this core American value reflected even more vividly in public leadership and policy over the years to come. In this U.S., this could look like governors championing foster care and adoption, improving their systems, and honoring both social workers and families that foster and adopt. Internationally, this could include a much more active U.S. role in helping other countries that want to prioritize the goal of family for their kids who lack it — including earnest efforts to restore broken families, promote local adoption, and enable inter-country adoption when local families aren’t available.— Jedd Medefind is president of the Christian Alliance for Orphans.Russell MooreFor years, I’ve called Christians to live out what the Apostle Paul calls the “spirit of adoption” (Rom. 8:15), by which we’ve been included into the gospel. That means, for many, “welcoming others as we have been welcomed” (Rom. 15:7) by adopting and fostering vulnerable children in need of families. Not every Christian, though, is called to adopt or foster. There are many who should not. Even so, every Christian is called to, as the Bible puts it, “care for widows and orphans in their distress” (Jas. 1:27).For some, adoption should be seriously considered. They have the means and the love, and they’ve (again, as the Bible puts it) “counted the cost” of what it means to be family. Those who aren’t called or equipped to do this though are still necessary in carrying out ministry to orphans and their families. Adopting families need their churches. Some, as did my wife and I when we were a young, money-strapped couple adopting, need financial help to defray the often-enormous costs. Others need people to stay with their already-there children through the process, and to pray with them and support them.But as much as adopting and fostering families need their church communities at the front-end of the process, they need them much more in the years that follow. In every situation, no matter how joyous, of adoption or foster care, something has, by definition, gone wrong. Someone has died. Someone has left. Something has happened. Children then are facing, in many cases, varying levels of trauma or of special needs of diverse kinds. Caring for vulnerable children means churches learning to bear the burdens of the child suffering with fetal alcohol syndrome or who is born addicted to heroin or a thousand other potential issues. It also means providing respite care for families, called to this mission, but who are sometimes overwhelmed and feel alone. A first step would be to ask adoptive families in your congregation what they would think that other such families might need. That will indicate often what the church needs to do, even where families feel awkward asking for such help for themselves.On the legal and political front, those on the frontlines of adoption and foster-care work simply need, to start with, a government that doesn’t actively work against the cause of children. That means, whatever your stance in the “culture war,” allowing Catholic adoption agencies to be Catholic, Evangelical adoption agencies to be Evangelical, and so on, even if you disagree with the theologies or worldviews of those groups on other issues. The country faces a crisis of children in need of families, and of children who need temporary measures until their families can be restored. Whatever one thinks of the views of those of us who are (small “o”) orthodox religious people, there just aren’t enough Unitarian and New Atheist adoption and foster-care ministries to meet that need. When we drive people out of caring for orphans because of their religious views, the religions are not the ones “punished,” the most vulnerable children among us are.— Russell Moore is president of the Ethics & Religious Liberty Commission, the policy arm of the Southern Baptist Convention.Grover NorquistMy hope — my goal — is that most Americans learn three numbers.The number we do not know is “how many families would wish to adopt.”We know that when we hear the unemployment number is 9 percent that, we “must do something.” Simple numbers can drive individuals and families to say: “I did not know there were so many children who needed families.” The second, thought: “Might our family be open to growing?” will flow naturally for many.People need to know there is a crisis. Unlike other challenges — say, a hurricane — we know what needs to be done with children without families. We have seen it done. We, as Americans, have done it before.— Grover Norquist is president of Americans for Tax Reform and an adoptive father.Branden S. PolkOur nation has a duty to care for our children — it comes with being an American. It comes with being a human. Not one of us has been released from our moral duty to love, emotionally and in practice, those that are beaten, abandoned, and abused, even though many of us feel that we should be “called” to foster or adopt a child. We often treat this as a special assignment or mission for the most generous and kind among us. But in reality, we all have a role to play in either supporting, fostering, or adopting children in care. Together, Americans can ensure that our nation’s future is grafted into families, that the most vulnerable among us feel worthy of connection, no matter their age or background.The current foster-care and adoption circumstances are dire. I do not believe that a socially and morally conscientious society can afford to ignore this problem, and yet so many children remain in care. If I could immediately do one thing to help compel more engagement, I would make sure that all families on the fence about fostering or adopting were guaranteed robust social and spiritual supports, which would surely increase their retention and increase the recruitment of other families. Additionally, I would elevate the voices of youth in foster care more frequently through film, music, and media. Those most impacted by this crisis can provided valuable clarity on how to deliver effective supports.For children in care, the days drag on, and perhaps their hopes wain. The system is overloaded. Maybe it’s not hard for them to imagine aging out of foster care without a forever family. My hope for adoption policy is that decision makers will see this as a true crisis and an issue of conscience, putting aside all political differences in order to create nonpartisan solutions that free all of our hands to be altruistic helpers. Even so, if the politicians continue to have a hard time regulating, my hope is that our faith-based and community-based organizations will take up arms, setting aside our differences, on behalf of children and older youth who need and deserve amazing families.— Branden S. Polk is senior associate for Justice and Child Welfare at the Clapham Group.Heidi SaxtonThis Christmas when my family will be making its annual pilgrimage to visit my mother-in-law in Florida, one less person will be coming with us. Our 18-year-old son, whom we fostered with his younger sister for nearly three years before adopting them in 2005, has chosen to spend the holidays with members of his birth family in Detroit. We will miss him terribly, but we also understand that we have a promise to keep: That he would be able to see his mother, as the judge decreed, after he turned 18. “Can I go, too?” my daughter asked.Not this year, we told her. This year it’s Christopher’s turn. She accepts this grudgingly, and soon is talking about the fun we’ll have on the beach. Later, as we’re riding home in the car, she begins to process the situation out loud: “I will always have two families. My birth family, and my real family.” Instinctively I recoiled at this a bit. As much as I want my children to have a sense that the bonds we share are as secure and as permanent as those they share with the couple who gave them life, denying the bond they share with their first family is not the way to achieve that. “We are your forever family, honey. You have two real families who love you — your birth family, and us. You don’t need to choose between us.” She visibly relaxed.What I did not say — because at this stage of her life, it would only confuse her — is that family is something that over time is chosen by both sides. The infant who is baptized into the family of God, will one day choose for himself, often through the sacrament of confirmation. For the child who is surrounded by loving family even before she draws her first breath, that choice can be very natural and instinctive (though it may hit a few bumpy patches as she enters adolescence). For the child who has been adopted — perhaps especially one who is adopted with clear memories of his or her first family — that pull between two camps can cause confusion, ambivalence, and anxiety. We can support our children through this process, but ultimately the choice is theirs to make. Love that manipulates or controls only causes resentment. Children are not rights to be protected, nor are they prizes to be won. We are gifts to one another, brothers and sisters in Christ helping each other along heaven’s highway to join the forever family of the Father of us all.— Heidi Hess Saxton offers resources for foster, adoptive, and special-needs families at Extraordinary Moms Network. She is an author and editor at Ave Maria Press.Jaymie Stuart WolfeTake a look at what happens to kids who have no family support, kids who have never been told that they have value or shown that they are worth loving. Every time you see a young person who is involved in crime, struggles with addiction, drops out of school, is promiscuous — every time you see a kid in trouble — look deeper. What you may be seeing is how the adults in that child’s life failed him. Are you open to being the one who doesn’t?The single most important step to discerning adoption is prayer. Every family should ask God if adopting a child is part of His plan for them. Set your own thoughts, ideas, preconceived notions, and desires aside and listen. Then follow the path that opens up in front of you. Take one step at a time. Know that discernment doesn’t necessarily end with a yes. If you can, find adoptive parents who can accompany you on the journey.My hope is that our society would do more to make adopting a child an option for families who don’t earn a lot of money, for older parents, for parents who may have some health problems. We tend to disqualify people too quickly, and for reasons that have little to do with giving a child a family to grow up in. But we also need to give adoptive families more ongoing support to help them better understand what to expect and how to handle the challenges that may flow from adoption itself. Remember: Adoption is not a “solution” to a “problem.” Adoption is the next best option for a child who, for a host of negative reasons, does not have a family that can give him or her what every child needs.— Jaymie Stuart Wolfe is author of Adoption: Room for One More?Sarah ZagorskiWe can’t know what the adoption process is like until we engage with those who have already gone through it and encountered difficulties. We must listen to the stories of adoptive families and ask an adoptive family to share their experience prior to, during, and after adoption. It would also be helpful for these families to share the needs of their children after their adoption. Some adopted children have unique challenges such as broken attachments or grief to process.Any family that is ready to commit to a child for life should discern carefully what kind of adjustments their family could make. My adoption story was particularly complex, but a resource my adopted parents worked through was Wounded Children, Healing Homes: How Traumatized Children Impact Adoptive and Foster Families. Books like this help families have realistic expectations for their children while also helping parents learn how to care for a child with a complicated background.I would encourage families that are considering infant adoption to watch I Lived on Parker Avenue, a powerful documentary on how adoption saves lives.My chief hope is for more education on adoption to be in the public arena, in both public and private schools, and through advocacy organizations. Views of adoption are often negative, with only 51 percent of Americans viewing it as something positive for our society. Also, studies show there are many misconceptions discouraging birth mothers from placing their children for adoption. They often believe they will never see their child again regardless of the kind of adoption plan they make or that their child will have a difficult life. The truth is more than 90 percent of adopted children aged five and older have positive feelings about their adoption.— Sarah Zagorski was adopted from foster care.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}