{"id": "The Pipe-Bombs Story: Another Example of Why No One Trusts the Media\t\t\t\t\t\t\tThe Pipe-Bombs Story: Another Example of Why No One Trusts the Media\t\t\t\t\t", "paragraph": "National ReviewThe political Left has been known to orchestrate frame-up attacks designed to make it appear that right-leaning opponents are responsible for violent acts and plots.If I wrote the paragraph above in the context of reporting or commenting on the pipe bombs that were reportedly sent by an unidentified person or persons to prominent Democrats, many people would react angrily, and rightly so. After all, there is no evidence that the atrocious but thankfully unsuccessful targeting of the Obamas, the Clintons, CNN, George Soros, and Eric Holder (as well as “Debbie Wasserman Shultz,” whose Florida office, with her name misspelled, was given as the return address on some of the packages) was carried out by political leftists. There is no proof that any Democrat was hoping to cast suspicion on Republican supporters, to suggest to voters, less than two weeks before the midterms, that Trump and GOP rhetoric incites violence. To intimate, in the absence of any proof, that left-wing agitators may be responsible would be a condemnable smear.That’s why this paragraph, by the usually sensible Will Rashbaum in the New York Times’s report on the apparent attempted bombings, is so infuriating:Mrs. Clinton, Mr. Obama, Mr. Soros and CNN have all figured prominently in conservative political attacks — many of which have been led by President Trump. He has often referred to major news organizations as “the enemy of the people,” and has had a particular animus for CNN.The report goes on to say that the CNN bomb package was addressed to former Obama CIA director John Brennan (who is actually a commentator at MSNBC, not CNN). The Times then adds, gratuitously, that Brennan “is a harsh critic of Mr. Trump,” who revoked Brennan’s security clearance “in what was seen as an act of retribution.”NR's afternoon roundup of the day's best commentary & must-read analysis.At this point, there is no evidence whatsoever that provocative words from the president had anything to do with the sending of bombs. Indeed, there is as yet no known evidence of who is behind these possible attacks. And speaking of “attacks,” why, in light of the context of a possible bombing spree, is the Times asserting that Secretary Clinton, President Obama, and Mr. Soros have “figured prominently in conservative political attacks”? They have not been subjected to “attacks” in the sense conveyed by this report; they have been on the receiving end of mere political criticism, not the subjects of attempted political assassinations.There is plenty of media commentary at the moment about incivility, in the form of incendiary rhetoric and actions. This is entirely appropriate. But I’m at a loss to understand how the climate is improved by spicing up reports with thinly veiled suggestions that President Trump may have triggered a series of potentially murderous attacks on political opponents. When Bernie Sanders supporter James Hodgkinson opened fire on the Republicans he targeted and nearly killed Representative Steve Scalise, I don’t recall much Times speculation about whether he could have been set him off by Democrats urging their supporters to get aggressive — “get in their face”; “if they bring a knife, we bring a gun” — when dealing with political adversaries.As we often observe after terrorist attacks, everyone needs to take a deep breath until facts begin to emerge. The investigators are doing their jobs. Chances are we will know soon enough who is actually responsible for the pipe bombs. Then we probably won’t need speculation about motive and incitement . . . though there will be no shortage of it, anyway.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}