{"id": "What’s Exceptional, What’s Emblematic\t\t\t\t\t\t\tWhat’s Exceptional, What’s Emblematic\t\t\t\t\t", "paragraph": "National ReviewEver since Donald Trump started to encourage brawls at his rallies, and maybe even before then, American commentators have been predicting a return of political violence, and looking at the statistics for bombings in America in the early 1970s.Just in the last few days, suspicious packages or bombs have been sent to famous liberals in neighborhoods near mine. George Soros’s home in Katonah, N.Y., and the Clinton’s home in Chappaqua was menaced in this way. The Obama family received a suspicious package. So did CNN.On days like this, partisans spend a lot of rhetorical energy on the “emblematic/exceptional” distinction. Their violence is emblematic of their real views and character; political violence by our side is the exception to the rule.In recent weeks, I’ve seen lists circulate about acts of political violence, usually trying to show that aside from the attack on congressional Republicans that nearly killed House majority whip Steve Scalise — these have mostly been phenomena of the Right. They usually forget the North Carolina GOP office that was firebombed, and given the warning “Nazi Republicans leave town or else.” Or the one in Wyoming that was destroyed by arson. The killing of Dallas police officers by Micah Xavier Johnson is usually not included either. On a less grave, but still troubling level, GOP candidates in Minnesota were assaulted.NR's afternoon roundup of the day's best commentary & must-read analysis.Still and all, there are good reasons to believe that in America extreme right-wing violence is currently more common than left-wing violence. How either of these phenomenon relate to the rhetoric of elected officials, or to the passions of millions of members of the two main political parties is much more mysterious.President Trump is very likely making it worse. Extreme rhetoric is percolating in our mainstream politics. Because of the office he holds, Trump’s incitements to violence, the “lock her up” chants, and the conspiracy theories about Democrats paying the migrant caravan are all toxic. What he says could inspire a lunatic to act. On the other side, the constant invocation by pundits of the 1930s and how fascism is coming to America may act on a certain febrile imagination. The firebomber in North Carolina certainly had this rhetoric in mind. Though, again, there is simply no obvious mechanism that converts a politician’s overheated analogies into violent acts by others.Dylan Matthews worries that our norms against violence could break down. I worry too. But I’m not convinced when he says, “Many if not most people have vaguely consequentialist ways of thinking about government, and the danger with those views is that they can make killing people (abortion doctors, meat/fossil fuel executives, liberal/conservative donors, etc.) seem like a viable, moral strategy.” He is right about a strain of consequentialism licensing these acts. But, it is just as likely that people who are already attracted to violence embrace consequentialism, rather than the other way around.The truth is that, for now, all acts of politically motivated violence in America are exceptional, not emblematic of our major political differences. It’s true many Americans take their politics seriously, and they believe it concerns the most important moral considerations. It’s true that many of them indulge in rhetorical excess when talking about the other side. But scores of millions of Americans will vote in two weeks, and almost all of them want to see the perpetrators of these mail bombs punished severely.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}