{"id": "Economic Improvement Continues under Trump\t\t\t\t\t\t\tEconomic Improvement Continues under Trump\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tThe Wrong Time to Cut Defense Spending\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPolicymakers Should Listen to Voters on School Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhy the Senate Shouldn’t Grandstand on Mueller\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tReport: HHS Aims to Retire $100 Million of Fetal Tissue Research\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBasta La Vista, Baby\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tScott Campaign Asks Secretary of State to Accept Broward Recount Despite Missed Deadline\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFederal Judge Rejects Nelson’s Challenge to Vote-Count Rules\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics of the Amazon Deal Have Valid Reasons to Oppose it\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWashington Gun Rights Group Sues to Block Semi-Automatic Rifle Purchase Restrictions\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Case for the Wage Subsidy\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tMaking Acosta a Federal Case\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCongress Finds Bipartisanship in Farm Welfare\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAgainst the ‘Coercive Elimination of Dissent’\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTrump’s Not Populist Enough\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tRick Scott’s Lead Increases after Recount\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tPelosi Vows She’ll Be Speaker Despite New Potential Challenger\t\t\t\t\t\t\t\nNot even Jared Bernstein, former economic adviser to Joe Biden, could put a negative spin on Friday’s jobs report. The U.S. economy created some 250,000 jobs in October, beating expectations. The labor participation rate increased even as unemployment held steady at 3.7 percent. That’s a 50-year low. The best part: Wages rose 3 percent in the highest rate of growth since the Great Recession a decade ago. “Pretty much everything you could want in a monthly jobs report,” Bernstein tweeted.October 2018 is the 97th consecutive month of jobs growth. The trend began with the end of the Great Recession, allowing Barack Obama as well as Donald Trump to take credit for it. The Trump economy is more than the jobs figure, however. Amidst volatility in the financial markets, at the time of writing the Dow is up close to 30 percent since Inauguration Day 2017. The economy grew by 4 percent in the second quarter of this year and 3.5 percent in the third quarter, according to the Bureau of Economic Analysis. (The third-quarter number will be revised on November 28.) That puts us on track for the best annual growth since 2005.These are numbers to be proud of. And while it is difficult to say just how much credit goes to President Trump’s tax cuts, deregulation, defense spending, and confidence boosting, we can say that these policies have not impeded the economy. There are reasons to worry — rising debt, uncertainty and unpredictability in trade, a Federal Reserve that might remove the punch bowl too quickly. But for the moment the Trump economy is an undeniable bright spot in a foggy world.And the moment is important. The midterm election is days away. The fate of the House and Senate is uncertain. Certainly the economy will carry the day for Trump and the Republicans?Not so certain. The economy was booming in 1966 when the public first recorded its judgment on the Great Society of LBJ. That verdict was negative. The Republicans, declared dead only two years before, took 47 House seats, three Senate seats, and seven governor’s mansions. Nor did low unemployment and economic growth prevent the Republican Revolution of 1994. The economy was expanding during the 2004 presidential campaign in which George W. Bush eked out reelection by two points and 100,000 votes in Ohio. And of course Obama’s record was not decisive for Hillary Clinton in 2016.\nThe lesson of American political history is that growth is not enough. You can have a booming economy, with low unemployment and wage growth, and still lose seats or the White House. Growth helps. It’s a prerequisite for success. But it is not determinative. America is long past the time when economic concerns dominated our politics. When recession or Depression strikes, then the economy is the issue — the only issue. Otherwise it’s a backdrop. Nonmaterial issues come to the fore.President Trump understands this. He made jobs a major focus of his 2016 campaign. But he did not focus on the economy exclusively. His campaign was heavily socially conservative: protecting the Second Amendment, appointing strict constructionists to the bench, enforcing the border, and reducing crime.And it’s why he has spent this last week of the 2018 campaign rallying his base against the immigrant caravan and birthright citizenship. A great economy is worth bragging about. But it does not drive voters to the polls. What motivates voters are larger questions involving the character of presidential leadership, the strength of the social fabric, and the fear of losing economic and civil rights and national identity.Two years ago, if you had asked me the major problem facing the United States, I would have said lackluster growth. A boom would abate populist energies. It was up to Republicans to marry pro-growth economics with a concern for working-class people. Only then would the temperature begin to cool, politics become less important, and culture war recede.Well, we have our bread. But we haven’t been made good. The polarization of the political class has not stopped. It has escalated. The volume hasn’t gone down. It’s blaring.The reason? Part of it is President Trump, his rhetoric and conduct, and the fervent reactions he inspires in friend and foe. But there is also the sensationalistic and hyperbolic broadcast, print, and digital media, the radicalizing instrument of social media, and the general trend in our culture towards reductionism, essentialism, and catastrophism.And there is the more encompassing social question — the quality of life in the United States, the health of our civic institutions, and the condition of our citizenry. I’m not sure Dr. Ronny would give us a clear bill of health. We have an amazing ability to provide work for hundreds of millions of people. This truly is the land of plenty. But what is the state of our popular culture, our churches and synagogues, our schools, and most importantly our families? Have we even begun to address seriously the corrosion of American civic education and civil religion? Have we confronted what Roger Scruton calls the “culture of repudiation” that has left Americans without a historical memory and the sense that anything goes?A healthy economy is a precondition of American renewal. But it is not the end state. Good times come and go. The question we should be asking — and which few in either party seem much interested in — is altogether different. The question is this: What steps are necessary for America to endure?This article originally appeared on the Washington Free Beacon.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}