{"id": "Van Gogh for Beginners\t\t\t\t\t\t\tVan Gogh for Beginners\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBelieve in Creed II \n\n\n\t\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTERF Wars\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\t‘The Process of Living’\t\t\t\t\t\t\t\n‘You overpaint,” Paul Gauguin tells Vincent van Gogh in At Eternity’s Gate. “Your surface looks like it’s made of clay. . . . It’s more like sculpture.” A light goes on in Van Gogh. This contrarian . . . this recusant . . . this redhead resolves to do the opposite of what he’s been told. He not only continues to overpaint, he over-overpaints. The canvas doesn’t know what hit it. “It is the universal, mad and blinding coruscation of things,” wrote the first critic of Van Gogh’s work, Albert Aurier. “It is matter and all of Nature frenetically contorted. . . . It is form, becoming nightmare; color, becoming flame, lava and precious stone; light turning into conflagration; life, into burning fever.”The painter and filmmaker Julian Schnabel tries to organize his movie into a burning fever, and partially succeeds. Van Gogh’s intoxicating swirls, his effulgent colors, his starburst energy carry the film, which Schnabel co-wrote and directed with Willem Dafoe as his Vincent. (After playing at the New York Film Festival, it is set for a November 16 theatrical release.) Though uneven, particularly in the matter of its ungainly writing, it’s a worthy tribute.Beginning in overcast Paris, Van Gogh strikes up a friendship with Gauguin (Oscar Isaac), who resolves to leave all systems behind and strikes out huffily for Madagascar. Van Gogh dislikes the grisaille quotidienne of the city and yearns for sunlight. “Go south,” Gauguin tells him, as though his friend couldn’t have figured out Provence is sunny. Such cloddish, audience-signaling dialogue mars the screenplay Schnabel co-wrote with Jean-Claude Carrière and Louise Kugelberg. Later in the film Van Gogh tells a priest he is painting for “people who haven’t been born yet.” That seems conveniently backward-looking, a line written from a 21st-century perspective, but, worse, it baldly states what need not be stated. We’ve seen that Van Gogh lives in poverty in Arles, supported by his businessman brother Theo (Rupert Friend), and we’re aware that the paintings first seen in hilarious profusion cluttering up a wall in a tavern are today worth millions, in some cases tens of millions.Yet if Schnabel, the director of one of the few truly sublime films released this century, The Diving Bell and the Butterfly, is a shaky writer he brings the appropriate visual allure to the story. Using colors and landscapes familiar from the canvases, he creates moments of serene beauty out of watching Van Gogh work, reveling in how the land, or a model, or even a still life looks through the painter’s appreciative gaze. A Van Gogh movie is not the place to exercise restraint: “I want to be out of control, I want to be in a fever state,” the painter says, and who could doubt it, from looking at the The Starry Night? “The faster I paint,” he adds, “the better I feel.” At one point Van Gogh produces 75 paintings in 80 days. Rebuke and shame hit me as I realized I couldn’t produce 75 movie reviews in 80 days. In Arles, Van Gogh was an eruption of life force.And its awful opposite number. Schnabel parts company with most biographers in that he advances a theory, from Steven Naifeh and Gregory White Smith’s book Van Gogh: The Life, that the end of the painter’s life was not suicide but involved an accidental shooting. Still, darkness was a constant companion. Out of mercy, or respect, Schnabel does not depict the deranged moment in which Van Gogh sawed off his left ear because he was despondent about feeling rejected by Gauguin, instead limiting himself to Van Gogh’s dazed recollection of the event. That is Dafoe’s big moment of the film, yet it doesn’t quite break the heart.Dafoe makes an adequate Van Gogh, not a shattering one. As much intensity as he has brought to the screen in his career, he is no longer quite right for the part. At 63, he is far too old to play the painter, who died at 37. Also he speaks French like a tourist.\nWhile Dafoe wrestles with his accent, so Schnabel has trouble keeping his admiration from swamping the biography. The worship reaches a comical level when, interviewed by the priest at the insane asylum, Van Gogh compares the situation to Pilate’s interrogation of Christ. “Jesus wasn’t discovered until 30 or 40 years after he died,” Vincent says. Schnabel seems eager to depict Van Gogh as a man of faith, but comparing oneself to Jesus Christ is not how one exhibits Christian bona fides. And let’s not say Jesus Christ was “discovered.” Save that term for magazine pieces about Gisele Bündchen.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}