{"id": "The Dan Crenshaw Moment\t\t\t\t\t\t\tThe Dan Crenshaw Moment\t\t\t\t\t", "paragraph": "National Review\n\n\t\t\t\t\t\t\t\tTip-to-Toe Body Ornaments Bedazzle at the Met  \t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAdopting Life: A Symposium\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBelieve in Creed II \n\n\n\t\t\t\t\t\t\t\tPrince Charles Is Saving Britain’s Heritage for the Next Generation\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tFarewell to a Hollywood Master\t\t\t\t\t\t\t\n\n\nA Chorus Line Never Gets Old\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tLast Eats\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tStan Lee’s Work Is a Reflection of His Times\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tYour Death Row Meals, or Last Suppers\t\t\t\t\t\t\t\n\n\nGreen Book Turns Brotherhood into a Bromide\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tThe Church of the Secret Ballot\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCritics’ Choice\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tBad Banditti, Bad Book\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTribes of the Lonely\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tTERF Wars\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\t‘The Process of Living’\t\t\t\t\t\t\t\nGiven the spirit of our times, things could have gone so differently. On November 3, when Saturday Night Live comic Pete Davidson mocked Texas Republican Dan Crenshaw’s eye patch, saying he looked like a “hit man in a porno movie” — then adding, “I know he lost his eye in war or whatever” — it was a gift from the partisan gods.A liberal comic had gone too far. He had mocked a man who was maimed in a horrific IED attack, an attack that had taken the life of his interpreter and nearly blinded him for life. He mocked a courageous man’s pain. And thus Crenshaw had attained the rarest position for a Republican politician: aggrieved-victim status. He was free to swing away.Instead, he refused to be offended. He noted that the joke was bad, but his handling of the whole affair was — as the Washington Post described him — “cool as a cucumber.” Then Saturday Night Live called. The show wanted to apologize, and they wanted Crenshaw on-air. He said yes, and this happened:It was the act of grace heard ’round the nation. Davidson came on the “Weekend Update” set and offered his apology, and then Crenshaw joined. He took some good-natured shots at Davidson — Crenshaw’s phone had an Ariana Grande ringtone (Grande recently broke her engagement with Davidson), and he mocked Davidson’s appearance — but then things took a more serious turn.Crenshaw briefly spoke of the meaning of the words “never forget” to a veteran, saying that “when you say ‘never forget’ to a veteran, you are implying that, as an American, you are in it with them.” Then he addressed his next words to Davidson: “And never forget those we lost on 9/11 — heroes like Pete’s father. So I’ll just say, Pete, never forget.”\nDavidson’s father was a firefighter. He died trying to save others when Davidson was a young boy. In one moment, Crenshaw not only honored a true hero, but also softened American hearts towards Davidson, casting him in a new light. He’s a man who carries his own pain.It turns out that there’s a market for grace in American politics. Within minutes, clips of the apology and Crenshaw’s tribute to Davidson’s dad rocketed across Twitter. As of this morning, the YouTube clip of the moment — not even 48 hours old — already had more than 5 million views. And it seems as if this is no act. This act of grace was an expression of who Crenshaw is.In a long Washington Post profile, Crenshaw spoke of the distinct trail he wants to blaze in the age of Trump. Speaking of the president, he said, “His style is not my style. I’ll just say that. It’s never how I would conduct myself. But what readers of the Washington Post need to understand is that conservatives can hold multiple ideas in their head at the same time. We can be like, ‘Wow, he shouldn’t have tweeted that,’ and still support him. . . . You can disapprove of what the president says every day, or that day, and still support his broader agenda.”Crenshaw’s young. He’s 34. And that means that he stands a good chance of being in Washington long after Donald Trump is gone. If he’s a voice of the post-Trump GOP, then perhaps the future isn’t as bleak as critics may fear.There are those who argued before the election that, to punish the GOP for Trump, even conservatives should vote against Crenshaw. Vote against a good man for the sake of beating a bad man not on the ballot. That would “send a message,” they said.But it turns out that one of the messages we needed to hear came from Crenshaw himself. Even in the age of Trump, a Republican politician can be his own man. He can show that grace isn’t weakness and that reconciliation can sometimes be more compelling than division.As the Post noted in its profile, Crenshaw is at the very start of his “next mission.” He’ll face the bitter cynicism of Washington, the drudgery of daily politics, and the festering divisions in a polarized capital. His future is not yet known. But when faced with a clear political temptation — to indulge in a period of partisan pugilism — he chose a different path. He (and Davidson) gave Americans a moment they needed. It turns out it was also a moment they wanted.Crenshaw’s next mission, then, is off to a very good start.NR's afternoon roundup of the day's best commentary & must-read analysis.\n\t\t\t\t\t© 2018 National Review\t\t\t\t\n\t\t\t\t\t\tNewsletters\t\t\t\t\t\n\t\t\t\t\t\t© 2018 National Review\t\t\t\t\t"}