{"id": "NewsPenguins show pedigree in win against Maple Leafs", "paragraph": "Welcome to NHL.com, the official site of the National Hockey LeagueBienvenue à LNH.com , le site officiel de la Ligue nationale de hockeyДобро пожаловать на NHL.com, официальный сайт Национальной хоккейной лигиTervetuloa NHL:n viralliselle nettisivustolle NHL.comiinVälkommen till NHL.com, NHL:s officiella web-sidaVítejte na NHL.com, oficiálních stránkách National Hockey LeagueVitajte na NHL.com, oficiálnych stránkach National Hockey LeagueWillkommen auf NHL.com, der offiziellen Seite der National Hockey LeagueTORONTO -- John Tavares experienced an old feeling with his new team Thursday. [GAME RECAP: Murray shuts out Maple Leafs, ends Matthews' streak in return to Penguins] The disappointment of losing to the Pittsburgh Penguins.\"I've seen them a lot in my career,\" the center said after his Toronto Maple Leafs lost 3-0 to the Penguins at Scotiabank Arena. \"Obviously it leaves a sour taste in your mouth. Leaving the rink not earning two points, especially on home ice. A great challenge against a very proven hockey team. I think we were excited and ready to play and we're obviously peeved off and disappointed that we didn't get the result.\"It's a good learning opportunity and it's a good test now to try to find [how to get] that momentum back.\"His point is valid. The Penguins taught the Maple Leafs a lesson, just like they did to the New York Islanders so many times when Tavares played for Pittsburgh's Metropolitan Division rivals. Tavares signed a seven-year, $77 million contract with Toronto on July 1 after nine seasons in New York.Video: PIT@TOR: Malkin beats Andersen five-hole for PPGThe Penguins have won three Stanley Cup titles (2009, 2016, 2017) since centers Sidney Crosby and Evgeni Malkin became teammates in the 2006-07 season. They showed their mettle again Thursday against the up-and-coming Maple Leafs.The majority of the pregame hype swirled around Toronto, which entered with a five-game winning streak. Center Auston Matthews came in leading the NHL with 16 points (10 goals, six assists) and had seven consecutive multipoint games to start the season. Only Mario Lemieux and forward Kevin Stevens (Penguins, 1992-93), Mike Bossy (Islanders, 1984-85) and Wayne Gretzky (Edmonton Oilers, 1983-84) also had streaks of at least that long. Matthews' hot start mirrored that of the Maple Leafs, who had scored an NHL-high 33 goals in starting the season 6-1-0. Local talk shows were dominated by callers suggesting Matthews was the best player in the game.Pittsburgh thought otherwise. Its championship pedigree overcame Toronto's talent and young legs, which came as no surprise to Maple Leafs coach Mike Babcock.\"I thought their team played good,\" Babcock said after Toronto was shut out for the first time this season. \"I didn't think there was tons of room out there tonight. I thought they played fast, they played with good structure. It's not often you see our team get no goals. I just thought they did a good job. \"They're a more veteran, polished, playoff team than we are. It showed.\"Babcock, holding the final line change at home, started the game with Matthews going head-to-head against Crosby. He pulled the plug on that plan after Matthews was relatively ineffective in the first period.\"It seems like they were just calm, cool, collected out there,\" Matthews said. \"They didn't run around, they just played smart and didn't force anything and made plays. It seemed like they had us running around quite a bit.\"Call it veteran savvy. Crosby is 31; Malkin is 32. Each feels he has plenty left in the tank despite critics claiming that the window of opportunity is closing on the aging Penguins.\"We certainly don't feel within our organization,\" Pittsburgh coach Mike Sullivan said. \"We believe in this group. This is as good a core group of players as I've been around. They can still play. And they know how to win.\"You get everybody's best every night. You get that burden of responsibility every night when you've accomplished what this group has accomplished. That's a credit to them and the reputation they've earned.\"Video: PIT@TOR: Malkin credited with empty-net goalGoalie Matt Murray, who has two Cup rings at age 24, made 38 saves. Malkin scored in the first period, scored into an empty net in the third and then assisted on Kris Letang's empty-net goal.\"We battled hard,\" said Murray, who played for the first time since sustaining a concussion in practice Oct. 8. \"That's a crazy dynamic team over there and we controlled them pretty good.\"We were ready to face a great team and I thought we played hard. I think we're all encouraged by the way we played.\"The Maple Leafs are 6-2-0, the Penguins 3-1-2. For Malkin, those records don't matter. Pittsburgh's performance Thursday does.\"We played against Matthews, Tavares and we did a great job,\" said Malkin, one day after telling NHL.com that Tavares and Matthews could have the type of impact on the Maple Leafs that he and Crosby have had on the Penguins. \"We understand they're great players and we played physical against them, we played tight against them and we deserved to win.\"I don't think about the Leafs. We knew they had six wins already, but we concentrated on our game. We know they are a great team, but we played smart. We have a great, experienced team. We know how to play tough games. We've been there before. We know how to play skilled guys. We stopped Matthews. It's the first game he didn't score [in]. \"If we play like this, we'll win a lot of games.\"\n                    The NHL uses cookies, web beacons, and other similar technologies. By using NHL websites or other online services, you consent to the practices described in our Privacy Policy and Terms of Service, including our Cookie Policy.\n                NHL.com is the official web site of the National Hockey League. NHL, the NHL Shield, the word mark and image of the Stanley Cup, the Stanley Cup Playoffs logo, the Stanley Cup Final logo, Center Ice name and logo, NHL Conference logos, NHL Winter Classic name, and The Biggest Assist Happens Off The Ice are registered trademarks and Vintage Hockey word mark and logo, The Game Lives Where You Do, NHL Winter Classic logo, NHL Heritage Classic name and logo, NHL Stadium Series name and logo, NHL All-Star logo, NHL Face-Off name and logo, NHL. TV, NHL Premium, NHL After Dark, NHL GameCenter, NHL GameCenter LIVE, NHL Network name and logo, NHL Tonight name and logo, On The Fly, NHL Awards name and logo, NHL Draft name and logo, Hockey Fights Cancer, Because It's The Cup, NHL Green name and logo, NHL Vault, Hockey Is For Everyone, NHL Thanksgiving Showdown name and logo, NHL Centennial Classic name and logo, NHL Centennial Season logo, NHL100 Classic name and logo, NHL Global Series name and logo, NHL China Games name and logo, and Don't Miss A Moment are trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks depicted herein are the property of the NHL and the respective teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. © NHL 2018. All Rights Reserved. All NHL team jerseys customized with NHL players' names and numbers are officially licensed by the NHL and the NHLPA. The Zamboni word mark and configuration of the Zamboni ice resurfacing machine are registered trademarks of Frank J. Zamboni & Co., Inc.© Frank J. Zamboni & Co., Inc. 2018.All Rights Reserved. Any other third party trademarks or copyrights are the property of their respective owners. All rights reserved."}