{"id": "NewsIslanders top Penguins to complete road sweep; Lehner injured", "paragraph": "Welcome to NHL.com, the official site of the National Hockey LeagueBienvenue à LNH.com , le site officiel de la Ligue nationale de hockeyДобро пожаловать на NHL.com, официальный сайт Национальной хоккейной лигиTervetuloa NHL:n viralliselle nettisivustolle NHL.comiinVälkommen till NHL.com, NHL:s officiella web-sidaVítejte na NHL.com, oficiálních stránkách National Hockey LeagueVitajte na NHL.com, oficiálnych stránkach National Hockey LeagueWillkommen auf NHL.com, der offiziellen Seite der National Hockey LeaguePITTSBURGH -- Jordan Eberle scored twice to help the New York Islanders to a 6-3 win against the Pittsburgh Penguins at PPG Paints Arena on Tuesday.Eberle's first goal, which gave the Islanders a 4-2 lead on a power play at 11:56 of the second period, chased Penguins goalie Matt Murray from the game. His second made it 5-2 at 13:49.The Islanders (6-4-1) outscored their opponents 14-5 during a three-game road sweep of Metropolitan Division teams. [WATCH: All Islanders vs. Penguins highlights] \"I know it's early on in the year but these games are important,\" Eberle said. \"You get into a three-game road trip stretch against three divisional teams, you want to win. ... So we're just going to keep trying to play the same way, keep building on our game. Obviously take the lesson tonight and move on.\"Video: NYI@PIT: Eberle pots second goal on odd-man rushRobin Lehner made 23 saves on 25 shots for the Islanders. Thomas Greiss replaced him to start the third period and stopped 12 of 13 shots.Islanders coach Barry Trotz said Lehner experienced a \"little strain.\" No further update was provided.Murray was pulled after allowing four goals on nine shots for Pittsburgh (6-2-2), which had won four in a row. Casey DeSmith made 14 saves on 16 shots in relief.\"Sometimes you make the change, it's not so much about the goalie. It's about the rest of the group,\" Penguins coach Mike Sullivan said. \"So we just thought it was the right thing to do at that particular time. ... I don't fault Matt for the goals. I think they were such high-quality chances, they were very, very difficult saves.\"The Islanders scored on three of their first seven shots, four of their first nine and five of their first 10. But Trotz wasn't satisfied.Video: NYI@PIT: Nelson, Bailey combine for smooth tally\"I just thought our first period was maybe one of our worst periods of the season,\" Trotz said. \"We had heavy boots. We weren't skating. We were watching the game. As I always say to you, if we're watching the game, we're watching ourselves lose, so we were watching and they were moving around.\"Andrew Ladd and Brock Nelson put New York ahead 2-0 before Dominik Simon and Sidney Crosby scored to tie it. Ladd gave New York a 1-0 lead at 10:43 of the first period before Nelson made it 2-0 at 12:28 with his fifth in his past five games.Simon cut it to 2-1 at 14:24. Crosby, who has six goals in his past four games, tied it 2-2 at 17:41. Crosby was named the NHL's First Star of the Week on Monday.Video: NYI@PIT: Crosby picks the corner on LehnerMatt Martin gave the Islanders a 3-2 lead at 9:32 of the second period before Eberle scored twice. Eberle's second goal was upheld after the Penguins challenged if Adam Pelech was offside while entering the zone.Evgeni Malkin scored on the first shot Greiss faced to cut it to 5-3 at 1:23 of the third period before Tom Kuhnhackl scored against his former team to extend New York's lead to 6-3 at 9:44. It was Kuhnhackl's first goal for the Islanders in his fourth game. \"It felt great [to score against the Penguins]. I didn't even know if I should celebrate or not. I guess good things happen when you throw pucks on the net. I'm just happy it went in.\" -- Islanders forward Tom KuhnhacklVideo: NYI@PIT: Kuhnhackl scores off defender's skate \"We would've liked a better result. A lot of different emotions, I think, going through our mind to start. But the bottom line is we wanted to find a way to get a win for a lot of reasons, so unfortunately it didn't happen.\" -- Penguins captain Sidney Crosby The Penguins honored the victims of the Tree of Life Synagogue shooting and their families before the game. A moment of silence lasting 11 seconds, one for each of the 11 people killed, was held after a video celebrating diversity and inclusion played. ... Islanders forward Cal Clutterbuck missed a second straight game with an upper-body injury. He remains day to day, Trotz said. ... New York has won its past six games against Metropolitan Division opponents, including each of its four this season. ... Malkin has 16 points (five goals, 11 assists) in an eight-game point streak. … Penguins defenseman Kris Letang, who is day to day, did not play after being named a game-time decision after the morning skate Tuesday. He left practice early Monday because of precautionary reasons stemming from a lower-body injury sustained against the Vancouver Canucks on Saturday. Juuso Riikola replaced Letang on a defense pair with Brian Dumoulin. Islanders: Host the Penguins on Thursday (7 p.m. ET; SN360, SNE, SNO, SNP, MSG, ATTSN-PT, NHL.TV)Penguins: At the Islanders on Thursday (7 p.m. ET; SN360, SNE, SNO, SNP, MSG, ATTSN-PT, NHL.TV)Video: Eberle, Barzal power Islanders past Penguins\n                    The NHL uses cookies, web beacons, and other similar technologies. By using NHL websites or other online services, you consent to the practices described in our Privacy Policy and Terms of Service, including our Cookie Policy.\n                NHL.com is the official web site of the National Hockey League. NHL, the NHL Shield, the word mark and image of the Stanley Cup, the Stanley Cup Playoffs logo, the Stanley Cup Final logo, Center Ice name and logo, NHL Conference logos, NHL Winter Classic name, and The Biggest Assist Happens Off The Ice are registered trademarks and Vintage Hockey word mark and logo, The Game Lives Where You Do, NHL Winter Classic logo, NHL Heritage Classic name and logo, NHL Stadium Series name and logo, NHL All-Star logo, NHL Face-Off name and logo, NHL. TV, NHL Premium, NHL After Dark, NHL GameCenter, NHL GameCenter LIVE, NHL Network name and logo, NHL Tonight name and logo, On The Fly, NHL Awards name and logo, NHL Draft name and logo, Hockey Fights Cancer, Because It's The Cup, NHL Green name and logo, NHL Vault, Hockey Is For Everyone, NHL Thanksgiving Showdown name and logo, NHL Centennial Classic name and logo, NHL Centennial Season logo, NHL100 Classic name and logo, NHL Global Series name and logo, NHL China Games name and logo, and Don't Miss A Moment are trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks depicted herein are the property of the NHL and the respective teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. © NHL 2018. All Rights Reserved. All NHL team jerseys customized with NHL players' names and numbers are officially licensed by the NHL and the NHLPA. The Zamboni word mark and configuration of the Zamboni ice resurfacing machine are registered trademarks of Frank J. Zamboni & Co., Inc.© Frank J. Zamboni & Co., Inc. 2018.All Rights Reserved. Any other third party trademarks or copyrights are the property of their respective owners. All rights reserved."}