{"id": "NewsWillie Desjardins Named Head Coach; John Stevens Relieved of His Duties", "paragraph": "The LA Kings have relieved John Stevens of his head coaching duties and Willie Desjardins has been named the new interim head coach, Kings Vice President and General Manager Rob Blake announced today.\"This is a critical time in our season and our results to date have fallen well below our expectations. With that in mind, this was a difficult decision but one we feel was necessary,\" said Blake. \"We have a great deal of respect and appreciation for John's time with our organization. He was a key part of our past success, and we have tremendous gratitude for his many contributions.\"In addition, Don Nachbaur, who joined the Kings as an assistant coach prior to last season, has been relieved of his duties.His replacement behind the Kings bench will be former Kings player Marco Sturm, who is currently the Head Coach and General Manager of the German National Team.\"We appreciate everything Don has done as a member of the Kings coaching staff, and wish him the best moving forward,\" Blake said.Desjardins has 20-plus years of coaching experience. In the NHL he served as head coach of the Vancouver Canucks for three seasons (from 2014-17). He also served as associate head coach with the Dallas Stars for two seasons (2010-12).A native of Climax, Saskatoon, Desjardins is 61 years old. He is officially the 25th different coach in Kings history.Sturm is a native of Germany who appeared in 938 NHL games during his playing career that spanned over 14 seasons. He registered 487 total points during his career (242-245=487), a career plus-59 rating and 446 penalty minutes. The Kings continue their seven-game homestand on Tuesday when the club hosts the Ducks. The game will be broadcast on FOX Sports West, the FOX Sports App and the LA Kings Audio Network.The Kings had a scheduled day off today. lakings.com is the official Web site of the Los Angeles Kings. Los Angeles Kings is a trademark of Los Angeles Kings, LLC. NHL, the NHL Shield, the word mark and image of the Stanley Cup and NHL Conference logos are registered trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks as well as all other proprietary materials depicted herein are the property of the NHL and the respective NHL teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. Copyright © 1999-2017 Los Angeles Kings, LLC and the National Hockey League. All Rights Reserved."}