{"id": "NewsColliton loses coaching debut with Blackhawks to Hurricanes", "paragraph": "Welcome to NHL.com, the official site of the National Hockey LeagueBienvenue à LNH.com , le site officiel de la Ligue nationale de hockeyДобро пожаловать на NHL.com, официальный сайт Национальной хоккейной лигиTervetuloa NHL:n viralliselle nettisivustolle NHL.comiinVälkommen till NHL.com, NHL:s officiella web-sidaVítejte na NHL.com, oficiálních stránkách National Hockey LeagueVitajte na NHL.com, oficiálnych stránkach National Hockey LeagueWillkommen auf NHL.com, der offiziellen Seite der National Hockey LeagueCHICAGO -- Jeremy Colliton lost his NHL coaching debut with the Chicago Blackhawks, 4-3 to the Carolina Hurricanes at United Center on Thursday.\"We definitely got better as the game went on,\" Colliton said. \"No doubt about that. I liked, we had a push there mid second period. We started to really skate and pressure the puck, and I thought we were a little bit better in our own end, which helped us to create a little more.\"Colliton, at 33 the youngest coach in the NHL, was promoted from Rockford in the American Hockey League.\"We were skating and had some zone time and were able to generate some energy,\" he said. \"Of course we scored, but it looked like we had some push back, which was nice to see, and we carried that over into the third. We had our chances, we had our pressure moments, and we scored the third goal. It looked like we were close to really turning the game.\" [WATCH: All Hurricanes vs. Blackhawks highlights] Chicago (6-7-3), which trailed 4-0, has lost six straight games. It named Colliton coach after firing Joel Quenneville on Tuesday.Andrei Svechnikov, Jaccob Slavin, Phil Di Giuseppe and Calvin de Haan scored for Carolina (7-7-2), which ended a five-game losing streak.Video: CAR@CHI: Svechnikov scores on an incredible effortScott Darling, who was traded after three seasons with Chicago (2014-17), made 35 saves in his first game against former teammate Corey Crawford.\"Right now I just want to win,\" Darling said. \"It's my first win of the season here so it feels good. It's not like I want to beat the Hawks or anything, I just want to win the game, no hard feelings towards them, but it's nice to win.\"Patrick Kane had a goal and an assist, and David Kampf and Nick Schmaltz scored for Chicago. Crawford made 30 saves.Video: CAR@CHI: Kane pokes puck in from goal lineSvechnikov gave Carolina a 1-0 lead at 4:46 of the first period with a diving backhand off a rebound. Slavin made it 2-0 at 9:09 with a power-play goal.Di Giuseppe extended the lead to 3-0 at 15:53 with his first goal of the season. He was recalled from Charlotte of the American Hockey League on Wednesday.De Haan scored his first goal with the Hurricanes to make it 4-0 at 1:20 of the second period.\"Kind of prescouted that before the game, how their wingers are going to try to take the walls away in the [defensive] zone,\" de Haan said. \"I saw the opportunity to jump in, and fortunately there was no one in front of me or covering me and Sebastian [Aho] made a great play, and without a pass like that, that puck doesn't go in.\"Video: CAR@CHI: de Haan scores off nifty pass from AhoAho's assist ended a three-game pointless streak. He had four goals and 13 assists in a 12-game point streak to start the season.Kane made it 4-1 at 4:34 of the second period with his 12th goal of the season, tied for the NHL lead. Kampf made it 4-2 at 10:53.Schmaltz got Chicago within 4-3 at 3:33 of the third period.\"A little toe pull and shot and anything can happen,\" Schmaltz said. \"Goalie loses it or whatever, get a lucky bounce through an arm. Never a bad play. So I'm just trying to, it was a 1-on-2 or something, I don't have another play, so I took a shot on net.\"Video: CAR@CHI: Schmaltz fires shot through screen \"It wasn't pretty at times, but it's also nice to play with the lead. To have that four-goal cushion is something we haven't really had all year. We grinded it out and ended up getting the two points, that's all that matters, especially on the road and [in] one of the hardest buildings to play in in the League.\" -- Hurricanes defenseman Calvin de Haan \"Yeah, it's different. We've played with the same guy for 10 years, so obviously any type of change is going to be different, but I thought for his first game he was very calm and seemed like he had a powerful message there in the first and second, just to clean up some things and have a better response, but any time you play for a new coach there's going to be a few differences here and there. But as far as judging a coach, I thought he was a good presence behind the bench.\" -- Blackhawks forward Patrick Kane on Jeremy Colliton Blackhawks forward Marcus Kruger did not return for the third period after injuring his left leg. Colliton said Kruger could be scratched Saturday against the Philadelphia Flyers. ... Kane has 13 points (seven goals, six assists) in his past nine games. He is tied for the goals lead with Timo Meier of the San Jose Sharks, Alex Ovechkin of the Washington Capitals, and David Pastrnak of the Boston Bruins. ... Crawford has made at least 30 saves four times in eight games this season. Hurricanes: Host the Detroit Red Wings on Saturday (7 p.m. ET; FS-CR, FS-D, NHL.TV)Blackhawks: At the Philadelphia Flyers on Saturday (1 p.m. ET; NHLN, NBCSP, NBCSCH, NHL.TV)Video: Hurricanes snap skid with 4-3 win against Blackhawks\n                    The NHL uses cookies, web beacons, and other similar technologies. By using NHL websites or other online services, you consent to the practices described in our Privacy Policy and Terms of Service, including our Cookie Policy.\n                NHL.com is the official web site of the National Hockey League. NHL, the NHL Shield, the word mark and image of the Stanley Cup, the Stanley Cup Playoffs logo, the Stanley Cup Final logo, Center Ice name and logo, NHL Conference logos, NHL Winter Classic name, and The Biggest Assist Happens Off The Ice are registered trademarks and Vintage Hockey word mark and logo, The Game Lives Where You Do, NHL Winter Classic logo, NHL Heritage Classic name and logo, NHL Stadium Series name and logo, NHL All-Star logo, NHL Face-Off name and logo, NHL. TV, NHL Premium, NHL After Dark, NHL GameCenter, NHL GameCenter LIVE, NHL Network name and logo, NHL Tonight name and logo, On The Fly, NHL Awards name and logo, NHL Draft name and logo, Hockey Fights Cancer, Because It's The Cup, NHL Green name and logo, NHL Vault, Hockey Is For Everyone, NHL Thanksgiving Showdown name and logo, NHL Centennial Classic name and logo, NHL Centennial Season logo, NHL100 Classic name and logo, NHL Global Series name and logo, NHL China Games name and logo, and Don't Miss A Moment are trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks depicted herein are the property of the NHL and the respective teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. © NHL 2018. All Rights Reserved. All NHL team jerseys customized with NHL players' names and numbers are officially licensed by the NHL and the NHLPA. The Zamboni word mark and configuration of the Zamboni ice resurfacing machine are registered trademarks of Frank J. Zamboni & Co., Inc.© Frank J. Zamboni & Co., Inc. 2018.All Rights Reserved. Any other third party trademarks or copyrights are the property of their respective owners. All rights reserved."}