{"id": "NewsHagelin traded to Kings by Penguins for Pearson", "paragraph": "Welcome to NHL.com, the official site of the National Hockey LeagueBienvenue à LNH.com , le site officiel de la Ligue nationale de hockeyДобро пожаловать на NHL.com, официальный сайт Национальной хоккейной лигиTervetuloa NHL:n viralliselle nettisivustolle NHL.comiinVälkommen till NHL.com, NHL:s officiella web-sidaVítejte na NHL.com, oficiálních stránkách National Hockey LeagueVitajte na NHL.com, oficiálnych stránkach National Hockey LeagueWillkommen auf NHL.com, der offiziellen Seite der National Hockey LeagueCRANBERRY, Pa. -- Carl Hagelin was traded to the Los Angeles Kings by the Pittsburgh Penguins on Wednesday for Tanner Pearson.Hagelin, a 30-year-old forward, has three points (one goal, two assists) in 16 games this season. He had 31 points (10 goals, 21 assists) in 81 games last season.Hagelin was acquired by the Penguins in a trade with the Anaheim Ducks on Jan. 16, 2016, and won the Stanley Cup twice with Pittsburgh (2016, 2017).\"This could be the start of more changes. We'll see how it goes,\" said Penguins general manager Jim Rutherford, who signed a three-year contract Wednesday that will take him through the 2021-22 season. \"The way things have gone, it's obvious that we had make a change. I feel bad; Hagelin is a popular guy. I like him a lot personally. He was part of winning a Cup ... but changes are necessary.\"Video: Breaking down today's Penguins-Kings tradeSelected by the New York Rangers in the sixth round (No. 168) of the 2007 NHL Draft, Hagelin has 225 points (89 goals, 136 assists) in 504 regular-season games and 47 points (22 goals, 25 assists) in 121 Stanley Cup Playoff games.Pearson, a 26-year-old forward, has one assist in 17 games this season. He had 40 points (15 goals, 25 assists) in 82 games last season.\"Our team is obviously not in a position that we are comfortable with in terms of how we are playing,\" Kings general manager Rob Blake said. \"This is a change to our lineup that gives us an additional amount of speed. With Carl Hagelin, his No. 1 asset is speed and getting to holes, and we think he will play a big role on the penalty kill for us going forward.\"Penguins coach Mike Sullivan said he expects Pearson to be available when Pittsburgh hosts the Tampa Bay Lightning on Thursday (7 p.m. ET; ATTSN-PT, SUN, TVAS, NHL.TV).\"He's a very good player,\" Sullivan said. \"I think he's a guy that could help us offensively. I think he has the ability to play with some of our top people. He certainly did that when he was in [Los Angeles]. He's had a 20-goal season. He's had a 40-plus-point season or two. So he has shown an ability to produce offensively.\"Selected by Los Angeles in the first round (No. 30) of the 2012 NHL Draft, Pearson has 144 points (69 goals, 75 assists) in 325 regular-season games with the Kings and 15 points (five goals, 10 assists) in 34 playoff games. He won the Stanley Cup with the Kings in 2014.Pearson is signed through 2020-21 at an average annual value of $3.75 million; Hagelin signed a four-year contract with the Ducks on Aug. 14, 2015 and can become an unrestricted free agent July 1.The Penguins (7-6-3), who lost 4-2 at the New Jersey Devils on Tuesday, are 1-5-1 in their past seven games and are seventh in the Metropolitan Division.\"I just think we're in a funk now,\" Rutherford said. \"We're a fragile team. We're struggling. But for the most part, I still believe in this team.\"Penguins forward Patric Hornqvist said Rutherford got his point across with the trade.\"This is part of the business. If you don't play well there are going to be changes,\" Hornqvist said. \"That's exactly what happened. For me, personally, it's too bad it was that guy. ... Obviously, he sent a big message to the group. We have to be better.\"The Kings (5-11-1) have lost three straight games, including 5-1 at home to the Toronto Maple Leafs on Tuesday. They have the fewest points in the NHL (11), have scored the fewest goals (34), and are 1-3-0 since firing coach John Stevens and replacing him with Willie Desjardins on Nov. 4. Los Angeles plays at the Chicago Blackhawks on Friday (8:30 p.m. ET; NHLN, NBCSCH, FS-W, NHL.TV).\n                    The NHL uses cookies, web beacons, and other similar technologies. By using NHL websites or other online services, you consent to the practices described in our Privacy Policy and Terms of Service, including our Cookie Policy.\n                NHL.com is the official web site of the National Hockey League. NHL, the NHL Shield, the word mark and image of the Stanley Cup, the Stanley Cup Playoffs logo, the Stanley Cup Final logo, Center Ice name and logo, NHL Conference logos, NHL Winter Classic name, and The Biggest Assist Happens Off The Ice are registered trademarks and Vintage Hockey word mark and logo, The Game Lives Where You Do, NHL Winter Classic logo, NHL Heritage Classic name and logo, NHL Stadium Series name and logo, NHL All-Star logo, NHL Face-Off name and logo, NHL. TV, NHL Premium, NHL After Dark, NHL GameCenter, NHL GameCenter LIVE, NHL Network name and logo, NHL Tonight name and logo, On The Fly, NHL Awards name and logo, NHL Draft name and logo, Hockey Fights Cancer, Because It's The Cup, NHL Green name and logo, NHL Vault, Hockey Is For Everyone, NHL Thanksgiving Showdown name and logo, NHL Centennial Classic name and logo, NHL Centennial Season logo, NHL100 Classic name and logo, NHL Global Series name and logo, NHL China Games name and logo, and Don't Miss A Moment are trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks depicted herein are the property of the NHL and the respective teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. © NHL 2018. All Rights Reserved. All NHL team jerseys customized with NHL players' names and numbers are officially licensed by the NHL and the NHLPA. The Zamboni word mark and configuration of the Zamboni ice resurfacing machine are registered trademarks of Frank J. Zamboni & Co., Inc.© Frank J. Zamboni & Co., Inc. 2018.All Rights Reserved. Any other third party trademarks or copyrights are the property of their respective owners. All rights reserved."}