{"id": "NewsPenguins could see more changes after trading Hagelin, GM says", "paragraph": "Welcome to NHL.com, the official site of the National Hockey LeagueBienvenue à LNH.com , le site officiel de la Ligue nationale de hockeyДобро пожаловать на NHL.com, официальный сайт Национальной хоккейной лигиTervetuloa NHL:n viralliselle nettisivustolle NHL.comiinVälkommen till NHL.com, NHL:s officiella web-sidaVítejte na NHL.com, oficiálních stránkách National Hockey LeagueVitajte na NHL.com, oficiálnych stránkach National Hockey LeagueWillkommen auf NHL.com, der offiziellen Seite der National Hockey LeagueCRANBERRY, Pa. -- The Pittsburgh Penguins traded forward Carl Hagelin on Wednesday, and more moves could be coming.\"We're not tracking toward winning a Stanley Cup right now,\" general manager Jim Rutherford said after the trade with the Los Angeles Kings for forward Tanner Pearson was announced, \"and changes are necessary.\"The trade came a day after the Penguins (7-6-3) lost 4-2 at the New Jersey Devils, dropping them to 1-5-1 in their past seven games. [RELATED: Hagelin traded to Kings by Penguins] Rutherford, who signed a three-year contract with Pittsburgh that runs through the 2021-22 season shortly before the trade was announced, said, \"I'm usually very patient, but my patience is running out.\"Trading Hagelin, 30, who can become a free agent July 1, 2019, for Pearson, 26, could be the first of several difficult decisions Rutherford makes to try to help the Penguins, who host the Atlantic Division-leading Tampa Bay Lightning on Thursday (7 p.m. ET; TVAS, ATTSN-PT, SUN, NHL.TV)\"Everybody wants to win a championship. I still believe we can,\" Rutherford said. \"Whether we can come out and do it this year, or whether we have to make some changes and do it next year, I still believe we have a window here. We're going to start making changes to this team here. ... We're going to make some changes and hopefully get it on track.\"Video: Hall records four points in Devils' 4-2 win vs. PensDuring a radio interview with 105.9 FM in Pittsburgh on Nov. 7, Rutherford expressed disappointment before the Penguins lost a fifth straight game that day. He said some players were too reliant on forwards Sidney Crosby, Evgeni Malkin and Phil Kessel, and defenseman Kris Letang, who are 31 or older. He also described the goaltending as inconsistent and said Pittsburgh seemed to lack urgency.Rutherford didn't change that narrative Wednesday but did say he doesn't feel the Penguins, who won the Stanley Cup in 2016 and 2017, have bottomed out.\"As bad as we feel right now as to where the Penguins are right now and how we're playing, I don't think we're at that point,\" Rutherford said. \"Certainly over the next couple of months, I'll watch the situation a lot closer to see where we are.\"President and chief executive officer David Morehouse said he was confident Rutherford would do what's necessary.\"We're in a little bit of a downturn, but we're not panicked over it,\" Morehouse said. \"He's going to do what he needs to do to make the team better. That's his job.\"Video: ARI@PIT: Crosby beats Kuemper with sweet backhandHagelin won the Stanley Cup twice with the Penguins after being acquired from the Anaheim Ducks in a trade for David Perron and Adam Clendening on Jan. 16, 2016. Hagelin played mostly second-line left wing with Malkin at center this season and had three points (one goal, two assists) in 16 games.\"At some point in time, we'll have to make some tough decisions on some good players that are the favorites,\" Rutherford said. \"Obviously, most of our players are favorites because when you win a championship, that's what happens. And turn those players into younger players.\"Penguins coach Mike Sullivan said he hopes this trade and any in the future light a fire under his players.\"I think it should be a wakeup call to all of us that we've got to find some consistency in our game,\" Sullivan said. \"Part of the burden of responsibility when you have success is the expectations are extremely high. No one has higher expectations than the people in this dressing room.\"Hagelin was popular within the locker room, Rutherford said. He went on to say he was sure Hagelin's departure would affect the chemistry, which might be for the best.\"I'm not sure how strong the chemistry is right now based on what I'm seeing,\" Rutherford said.Asked if chemistry has been a concern, Letang said the outcomes speak for themselves.\"I don't think we're playing the way we want right now,\" Letang said. \"I don't think we're happy about the results. I think [trades] happen in those circumstances. ... When you're not getting the results, clearly there's a problem. The [general manager] and the coach have certain jobs to do. That's what they try to do. They try to spark things up and try to get us on the right track.\"Letang's review of the Penguins seemed to mirror Rutherford's. But despite his critiques, Rutherford said he expects Pittsburgh to succeed.\"I just think we're in a funk now,\" Rutherford said. \"We're a fragile team. We're struggling. But for the most part, I still believe in this team.\"\n                    The NHL uses cookies, web beacons, and other similar technologies. By using NHL websites or other online services, you consent to the practices described in our Privacy Policy and Terms of Service, including our Cookie Policy.\n                NHL.com is the official web site of the National Hockey League. NHL, the NHL Shield, the word mark and image of the Stanley Cup, the Stanley Cup Playoffs logo, the Stanley Cup Final logo, Center Ice name and logo, NHL Conference logos, NHL Winter Classic name, and The Biggest Assist Happens Off The Ice are registered trademarks and Vintage Hockey word mark and logo, The Game Lives Where You Do, NHL Winter Classic logo, NHL Heritage Classic name and logo, NHL Stadium Series name and logo, NHL All-Star logo, NHL Face-Off name and logo, NHL. TV, NHL Premium, NHL After Dark, NHL GameCenter, NHL GameCenter LIVE, NHL Network name and logo, NHL Tonight name and logo, On The Fly, NHL Awards name and logo, NHL Draft name and logo, Hockey Fights Cancer, Because It's The Cup, NHL Green name and logo, NHL Vault, Hockey Is For Everyone, NHL Thanksgiving Showdown name and logo, NHL Centennial Classic name and logo, NHL Centennial Season logo, NHL100 Classic name and logo, NHL Global Series name and logo, NHL China Games name and logo, and Don't Miss A Moment are trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks depicted herein are the property of the NHL and the respective teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. © NHL 2018. All Rights Reserved. All NHL team jerseys customized with NHL players' names and numbers are officially licensed by the NHL and the NHLPA. The Zamboni word mark and configuration of the Zamboni ice resurfacing machine are registered trademarks of Frank J. Zamboni & Co., Inc.© Frank J. Zamboni & Co., Inc. 2018.All Rights Reserved. Any other third party trademarks or copyrights are the property of their respective owners. All rights reserved."}