{"id": "NewsCrosby could be out one week for Penguins with upper-body injury", "paragraph": "Welcome to NHL.com, the official site of the National Hockey LeagueBienvenue à LNH.com , le site officiel de la Ligue nationale de hockeyДобро пожаловать на NHL.com, официальный сайт Национальной хоккейной лигиTervetuloa NHL:n viralliselle nettisivustolle NHL.comiinVälkommen till NHL.com, NHL:s officiella web-sidaVítejte na NHL.com, oficiálních stránkách National Hockey LeagueVitajte na NHL.com, oficiálnych stránkach National Hockey LeagueWillkommen auf NHL.com, der offiziellen Seite der National Hockey LeagueCRANBERRY, Pa. -- Sidney Crosby could be out up to one week for the Pittsburgh Penguins with an upper-body injury, coach Mike Sullivan said Thursday.The 31-year-old center skated on his own before the Penguins took their morning skate. He was scratched when Pittsburgh lost to the Tampa Bay Lightning 4-3 at PPG Paints Arena on Thursday.Sullivan did not disclose when Crosby was injured but confirmed he does not have a concussion. Crosby had two assists in 21:32 of ice time in a 4-2 loss to the New Jersey Devils on Tuesday. He did not practice Wednesday, when he was evaluated for the injury.\"We're going to have to do it by committee at this point,\" Sullivan said. \"We've got a couple of our centers (also Derick Brassard) that are out. It's going to be a great opportunity for others to step up and play a more significant role, more significant minutes. So guys have to take advantage of that opportunity. So we believe we have capable people in the lineup, and we just have to make sure that everyone steps up and brings their best game.\"Video: The crew discusses Sidney Crosby's upper-body injuryCrosby has 19 points (eight goals, 11 assists) in 16 games this season.The Penguins have lost seven of their past eight games following a four-game winning streak from Oct. 18-27. Their game against the Lightning was the first of four they play in the next week.\"We've got to find some consistency in our game,\" Sullivan said Wednesday. \"If you don't, then change is inevitable. That's just the reality of our business. We're trying to push this team in the right direction to play the game the right way, to play a certain way that gives us the best chance to win. We've done it at times through this early part of the season, but not nearly consistently enough to get the results.\"\n                    The NHL uses cookies, web beacons, and other similar technologies. By using NHL websites or other online services, you consent to the practices described in our Privacy Policy and Terms of Service, including our Cookie Policy.\n                NHL.com is the official web site of the National Hockey League. NHL, the NHL Shield, the word mark and image of the Stanley Cup, the Stanley Cup Playoffs logo, the Stanley Cup Final logo, Center Ice name and logo, NHL Conference logos, NHL Winter Classic name, and The Biggest Assist Happens Off The Ice are registered trademarks and Vintage Hockey word mark and logo, The Game Lives Where You Do, NHL Winter Classic logo, NHL Heritage Classic name and logo, NHL Stadium Series name and logo, NHL All-Star logo, NHL Face-Off name and logo, NHL. TV, NHL Premium, NHL After Dark, NHL GameCenter, NHL GameCenter LIVE, NHL Network name and logo, NHL Tonight name and logo, On The Fly, NHL Awards name and logo, NHL Draft name and logo, Hockey Fights Cancer, Because It's The Cup, NHL Green name and logo, NHL Vault, Hockey Is For Everyone, NHL Thanksgiving Showdown name and logo, NHL Centennial Classic name and logo, NHL Centennial Season logo, NHL100 Classic name and logo, NHL Global Series name and logo, NHL China Games name and logo, and Don't Miss A Moment are trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks depicted herein are the property of the NHL and the respective teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. © NHL 2018. All Rights Reserved. All NHL team jerseys customized with NHL players' names and numbers are officially licensed by the NHL and the NHLPA. The Zamboni word mark and configuration of the Zamboni ice resurfacing machine are registered trademarks of Frank J. Zamboni & Co., Inc.© Frank J. Zamboni & Co., Inc. 2018.All Rights Reserved. Any other third party trademarks or copyrights are the property of their respective owners. All rights reserved."}