{"id": "NewsRutherford acquires Pearson to help Pens break funk", "paragraph": "General manager Jim Rutherford signed a three-year contract extension with the Pens on Wednesday afternoon. Rutherford's first order of business after the extension? A trade. Pittsburgh acquired forward Tanner Pearson from the Los Angeles Kings in exchange for locker room favorite Carl Hagelin. \"We felt that we needed to make some changes,\" Rutherford said. \"This could be the start, but we'll see how this goes for a little bit. The way things have gone here in the first part of the season, it was obvious we had to change some things up.\"The Pens are mired in a current slump that has seen them lose six of their last seven contests (1-5-1). Pittsburgh has a 7-6-3 record for 17 points, which is four out of a wild card position. Only New Jersey, a team that has beaten the Pens twice in this stretch, has fewer points. Rutherford decided the time had come for a change. \"We entered the season with a very good team, a team that should contend for the Cup,\" Rutherford said. \"I believe we can still do that. But we've got some work to do. We've got some inner-workings in the team that needs to be worked out. I believe we have the players to do it.\"One of the players that will help them do it is Pearson. The 26-year-old was a first-round pick (30th overall) by Los Angeles in the 2012 NHL Draft held in Pittsburgh. Pearson (6-foot-1, 201 pounds) has decent speed that will fit well with the Pens' style. He's also been a consistent 40-point player with a Kings team that emphasizes defense. Pearson's production should only increase while playing with Pittsburgh's system and talent. \"I think he's a guy that can help us offensively,\" head coach Mike Sullivan said. \"He has the ability to play with some of our top people. He certainly did that when he was in LA. \"He's a decent skater so we think he can play the type of game that we're trying to play. And he's got a good 200-foot game.\"Pearson's best offensive season came in 2016-17 when he boasted career highs with 24 goals and 44 points. Perhaps his biggest contribution to the Kings was scoring four goals, 12 points in 24 playoff games to help the LA win the 2014 Stanley Cup title. \"Played against him, he's a big boy,\" defenseman Kris Letang said. \"He's got a good shot. I think he can score goals. A big, power forward.\"But Pearson has been off to a rough start to the current season. He has zero goals and just one point in 17 contests. But, perhaps a new team is what Pearson needs to regain his scoring touch. \"He's off to a slow start this year and maybe lost his confidence a little bit,\" Rutherford said. \"But he's had a good career. I think a change will be good for him and he's a good fit for us.\"pittsburghpenguins.com is the official website of the Pittsburgh Penguins. The Pittsburgh Penguins and pittsburghpenguins.com are trademarks of Lemieux Group, LP. NHL, the NHL Shield, the word mark and image of the Stanley Cup and the word mark NHL Winter Classic are registered trademarks and NHL Stadium Series name and logo and the NHL Winter Classic logo are trademarks of the National Hockey League. NHL and NHL team marks are the property of the NHL and its teams. © NHL 2017. All Rights Reserved."}