{"id": "NewsCrawford plays well for Blackhawks in first game since December", "paragraph": "Welcome to NHL.com, the official site of the National Hockey LeagueBienvenue à LNH.com , le site officiel de la Ligue nationale de hockeyДобро пожаловать на NHL.com, официальный сайт Национальной хоккейной лигиTervetuloa NHL:n viralliselle nettisivustolle NHL.comiinVälkommen till NHL.com, NHL:s officiella web-sidaVítejte na NHL.com, oficiálních stránkách National Hockey LeagueVitajte na NHL.com, oficiálnych stránkach National Hockey LeagueWillkommen auf NHL.com, der offiziellen Seite der National Hockey LeagueCHICAGO -- Corey Crawford's excitement was tempered, to say the least. [GAME RECAP: Crawford returns, Blackhawks lose to Coyotes] Crawford, who was playing in his first game since Dec. 23, 2017, because of a concussion, made 27 saves for the Chicago Blackhawks in a 4-1 loss to the Arizona Coyotes on Thursday. He said he felt better as the game continued, but that the outcome was more important than his performance.\"I don't know if there's a bigger picture than winning hockey games,\" Crawford said. \"That's our goal every time we go out there.\"Crawford may not have been outwardly excited about his return, but the Blackhawks were.Video: ARI@CHI: Crawford denies Grabner twice\"That's the one real positive, with [Crawford], how well he played,\" Blackhawks coach Joel Quenneville said. \"I thought he was in control, he handled the puck around the net well, his movement was excellent, he anticipated well, he was on top of his crease and stopped some real dangerous looks. He kept us in the game. Unfortunately we didn't take advantage.\"While Crawford missed the final 47 games of last season and the first five of this season, he didn't look rusty. He faced 12 shots in the first period and allowed one goal, when Coyotes forward Lawson Crouse scored off a 2-on-1 with Clayton Keller to give the Coyotes a 1-0 lead at 11:43. As Crawford left the ice for the first intermission, the Blackhawks greeted him with fist bumps.Crawford made his biggest save with the Blackhawks trailing 2-1 at 4:02 of the third period, stopping Michael Grabner on a breakaway. But following a turnover by Blackhawks forward Chris Kunitz, Keller scored on a wrist shot to make it 3-1 at 14:22.\"I felt better in the second and third,\" Crawford said. \"It was a tough, tough break at the end. Still felt I should have stopped that [Keller] one. I mean, we were right there, we were creating a lot, and I (have to) try to come up with that one. Just (have to) forget about it and worry about the next game.\"Crawford will start at the Columbus Blue Jackets on Saturday (7 p.m. ET; FS-O, WGN, NHL.TV) in the first of back-to-back games. The Blackhawks host the Tampa Bay Lightning on Sunday.\"It's almost to be expected,\" center Jonathan Toews said. \"He comes in, he's so confident and relaxed and he just goes out there and plays hockey. He's looking like himself and I think that's a great sign. I wasn't sure when that was going to happen, so it's great that it's happening early in this season. It's fun to see him play well and just get back out there, regardless of the result tonight.\"Video: ARI@CHI: Crawford closes his pads on Grabner\n                    The NHL uses cookies, web beacons, and other similar technologies. By using NHL websites or other online services, you consent to the practices described in our Privacy Policy and Terms of Service, including our Cookie Policy.\n                NHL.com is the official web site of the National Hockey League. NHL, the NHL Shield, the word mark and image of the Stanley Cup, the Stanley Cup Playoffs logo, the Stanley Cup Final logo, Center Ice name and logo, NHL Conference logos, NHL Winter Classic name, and The Biggest Assist Happens Off The Ice are registered trademarks and Vintage Hockey word mark and logo, The Game Lives Where You Do, NHL Winter Classic logo, NHL Heritage Classic name and logo, NHL Stadium Series name and logo, NHL All-Star logo, NHL Face-Off name and logo, NHL. TV, NHL Premium, NHL After Dark, NHL GameCenter, NHL GameCenter LIVE, NHL Network name and logo, NHL Tonight name and logo, On The Fly, NHL Awards name and logo, NHL Draft name and logo, Hockey Fights Cancer, Because It's The Cup, NHL Green name and logo, NHL Vault, Hockey Is For Everyone, NHL Thanksgiving Showdown name and logo, NHL Centennial Classic name and logo, NHL Centennial Season logo, NHL100 Classic name and logo, NHL Global Series name and logo, NHL China Games name and logo, and Don't Miss A Moment are trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks depicted herein are the property of the NHL and the respective teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. © NHL 2018. All Rights Reserved. All NHL team jerseys customized with NHL players' names and numbers are officially licensed by the NHL and the NHLPA. The Zamboni word mark and configuration of the Zamboni ice resurfacing machine are registered trademarks of Frank J. Zamboni & Co., Inc.© Frank J. Zamboni & Co., Inc. 2018.All Rights Reserved. Any other third party trademarks or copyrights are the property of their respective owners. All rights reserved."}