{"id": "NewsStrome traded to Rangers by Oilers for Spooner", "paragraph": "Welcome to NHL.com, the official site of the National Hockey LeagueBienvenue à LNH.com , le site officiel de la Ligue nationale de hockeyДобро пожаловать на NHL.com, официальный сайт Национальной хоккейной лигиTervetuloa NHL:n viralliselle nettisivustolle NHL.comiinVälkommen till NHL.com, NHL:s officiella web-sidaVítejte na NHL.com, oficiálních stránkách National Hockey LeagueVitajte na NHL.com, oficiálnych stránkach National Hockey LeagueWillkommen auf NHL.com, der offiziellen Seite der National Hockey LeagueRyan Strome was traded to the New York Rangers by the Edmonton Oilers for Ryan Spooner on Friday.Strome, a 25-year-old forward, has two points (one goal, one assist) in 18 games this season. He was in his second season with the Oilers, who acquired him in a trade with the New York Islanders for forward Jordan Eberle on June 22, 2017. Strome had 34 points (13 goals, 21 assists) in 82 games last season.Selected by the Islanders with the No. 5 pick of the 2011 NHL Draft, Strome has 162 points (59 goals, 103 assists) in 358 games with the Islanders and Oilers, and eight points (three goals, five assists) in 15 Stanley Cup Playoff games.\"The fact that he can play center, that he can play wing, that he can play on the power play, that he can kill penalties, he can take face-offs, I think he brings a little bit of everything,\" Rangers general manager Jeff Gorton said, \"and with our group right now, having somebody who can play in all different areas of the game, I think he can help us.\"When you're a top-five pick overall, there's a lot of pressure on you to perform. … I think he feels like, and we feel like, maybe there's a little bit more that he can still get to the level we're all hoping he can get to.\" Spooner, a 26-year-old forward, had two points (one goal, one assist) in 16 games this season, his second with the Rangers. He was acquired in a trade with the Boston Bruins on Feb. 25 with forward Matt Beleskey, defenseman prospect Ryan Lindgren and a first-round pick in the 2018 NHL Draft, for forward Rick Nash. Spooner had 16 points (four goals, 12 assists) in 20 games with the Rangers last season.Selected by the Bruins in the second round (No. 45) of the 2010 NHL Draft, Spooner has 160 points (46 goals, 114 assists) in 289 games with the Bruins and Rangers, and two assists in four playoff games.Oilers general manager Peter Chiarelli was Bruins GM when they drafted Spooner.\"We chatted and I told him how excited I was to get there and he said the same thing,\" Spooner told the Oilers website. \"Hopefully I can get back to playing the game I know I can play.\"Spooner was teammates with Edmonton forward Milan Lucic in Boston.\"I actually played on the same line with him for a bit, too,\" Spooner said. \"I was 21 or 22 when I played with him, and he was great to me and always positive, so that was definitely something good to see.\"\n                    The NHL uses cookies, web beacons, and other similar technologies. By using NHL websites or other online services, you consent to the practices described in our Privacy Policy and Terms of Service, including our Cookie Policy.\n                NHL.com is the official web site of the National Hockey League. NHL, the NHL Shield, the word mark and image of the Stanley Cup, the Stanley Cup Playoffs logo, the Stanley Cup Final logo, Center Ice name and logo, NHL Conference logos, NHL Winter Classic name, and The Biggest Assist Happens Off The Ice are registered trademarks and Vintage Hockey word mark and logo, The Game Lives Where You Do, NHL Winter Classic logo, NHL Heritage Classic name and logo, NHL Stadium Series name and logo, NHL All-Star logo, NHL Face-Off name and logo, NHL. TV, NHL Premium, NHL After Dark, NHL GameCenter, NHL GameCenter LIVE, NHL Network name and logo, NHL Tonight name and logo, On The Fly, NHL Awards name and logo, NHL Draft name and logo, Hockey Fights Cancer, Because It's The Cup, NHL Green name and logo, NHL Vault, Hockey Is For Everyone, NHL Thanksgiving Showdown name and logo, NHL Centennial Classic name and logo, NHL Centennial Season logo, NHL100 Classic name and logo, NHL Global Series name and logo, NHL China Games name and logo, and Don't Miss A Moment are trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks depicted herein are the property of the NHL and the respective teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. © NHL 2018. All Rights Reserved. All NHL team jerseys customized with NHL players' names and numbers are officially licensed by the NHL and the NHLPA. The Zamboni word mark and configuration of the Zamboni ice resurfacing machine are registered trademarks of Frank J. Zamboni & Co., Inc.© Frank J. Zamboni & Co., Inc. 2018.All Rights Reserved. Any other third party trademarks or copyrights are the property of their respective owners. All rights reserved."}