{"id": "NewsWild send Kings to sixth straight loss", "paragraph": "Welcome to NHL.com, the official site of the National Hockey LeagueBienvenue à LNH.com , le site officiel de la Ligue nationale de hockeyДобро пожаловать на NHL.com, официальный сайт Национальной хоккейной лигиTervetuloa NHL:n viralliselle nettisivustolle NHL.comiinVälkommen till NHL.com, NHL:s officiella web-sidaVítejte na NHL.com, oficiálních stránkách National Hockey LeagueVitajte na NHL.com, oficiálnych stránkach National Hockey LeagueWillkommen auf NHL.com, der offiziellen Seite der National Hockey LeagueST. PAUL, Minn. -- The Minnesota Wild extended their winning streak to four games with a 4-1 victory against the Los Angeles Kings at Xcel Energy Center on Thursday.The Kings (2-7-1) lost their sixth straight game (0-6-0). Eric Fehr had a goal and an assist, and Devan Dubnyk made 23 saves for Minnesota (5-2-2), which is 4-0-2 at home. [WATCH: All Kings vs. Wild highlights] Kyle Clifford scored for Los Angeles.Fehr's first goal with the Wild made it 1-0 at 15:13 of the first period when Marcus Foligno's cross-ice pass deflected off him as he slid into the right post. Video: LAK@MIN: Fehr scores while sliding along the iceThe Wild scored the first goal of the game for the first time since Oct. 6, a 2-1 shootout win against the Vegas Golden Knights. \"It's huge for us,\" said Fehr, who signed a one-year, $1 million contract with Minnesota on July 1. \"It's a tough grind when you're playing from behind the whole time. To score the first goal and come out of the first period with a lead is great because you can see in the dressing room the guys are a little more encouraged by it.\"Jonas Brodin made it 2-0 at 14:22 of the second period on a wrist shot from the left circle with Kings goalie Jack Campbell (22 saves) screened.Video: LAK@MIN: Brodin wires wrist shot past Campbell\"It's just tough,\" Campbell said. \"We expect to win here. [The Kings aren't] just any other team where maybe they've been through this before. This is a winning team and we expect to be winners and expect to contend for Stanley Cups. This is real frustrating. We have the leaders in our locker room, whether they have a letter on their jersey or not, they're so many guys in this room that, personally, I look up to. \"Just keep the boots moving and keep working every day. I think that's what everybody is trying to do.\"Clifford picked up the puck after a turnover by Nick Seeler and scored from the right face-off circle to pull Los Angeles within 2-1 at 3:39 of the third period.Video: LAK@MIN: Clifford steals puck and scoresMikael Granlund scored a shorthanded empty-net goal with 45 seconds remaining to make it 3-1, and Mikko Koivu scored into an empty net with 24 seconds left for the 4-1 final. Minnesota killed off three penalties in the final 7:28. \"I thought [the Kings] were a team that didn't have a lot of confidence, which is why I was worried when they made it 2-1 because then they could sit there and my thought was 'Oh, OK, we're right here. Let's go,'\" Wild coach Bruce Boudreau said. \"But we were lucky enough to kill three penalties after that, so that was good.\" \"Losing in this game is not enjoyable. … At the end of the day, results are two points, [whether] you do good things or don't do good things. I thought the guys played hard tonight but we need more execution in what we're doing. We're in this business to win. And when you don't win, it's not fun.\" -- Kings coach John Stevens\"I was just telling [my teammates], I said, 'I might call in sick on Saturday so we don't have to do that (pregame celebration) just to get it over with. Hopefully after Saturday it'll be done.\" -- Wild defenseman Ryan Suter on being recognized for playing his 1,000th NHL game Thursday  The Kings have been outscored 29-8 during their losing streak. … Los Angeles last lost six straight Jan. 4-19. ... Granlund extended his point streak to six games (four goals, three assists). … Parise has 10 points (two goals, eight assists) in the past seven games. ... Each team went 0-for-4 on the power play. Kings: Host the New York Rangers on Sunday (3:30 p.m. ET; MSG, FS-W, NHL.TV)Wild: Host the Colorado Avalanche on Saturday (8 p.m. ET; FS-N, ALT, NHL.TV) Video: Wild take down Kings for fourth consecutive win\n                    The NHL uses cookies, web beacons, and other similar technologies. By using NHL websites or other online services, you consent to the practices described in our Privacy Policy and Terms of Service, including our Cookie Policy.\n                NHL.com is the official web site of the National Hockey League. NHL, the NHL Shield, the word mark and image of the Stanley Cup, the Stanley Cup Playoffs logo, the Stanley Cup Final logo, Center Ice name and logo, NHL Conference logos, NHL Winter Classic name, and The Biggest Assist Happens Off The Ice are registered trademarks and Vintage Hockey word mark and logo, The Game Lives Where You Do, NHL Winter Classic logo, NHL Heritage Classic name and logo, NHL Stadium Series name and logo, NHL All-Star logo, NHL Face-Off name and logo, NHL. TV, NHL Premium, NHL After Dark, NHL GameCenter, NHL GameCenter LIVE, NHL Network name and logo, NHL Tonight name and logo, On The Fly, NHL Awards name and logo, NHL Draft name and logo, Hockey Fights Cancer, Because It's The Cup, NHL Green name and logo, NHL Vault, Hockey Is For Everyone, NHL Thanksgiving Showdown name and logo, NHL Centennial Classic name and logo, NHL Centennial Season logo, NHL100 Classic name and logo, NHL Global Series name and logo, NHL China Games name and logo, and Don't Miss A Moment are trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks depicted herein are the property of the NHL and the respective teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. © NHL 2018. All Rights Reserved. All NHL team jerseys customized with NHL players' names and numbers are officially licensed by the NHL and the NHLPA. The Zamboni word mark and configuration of the Zamboni ice resurfacing machine are registered trademarks of Frank J. Zamboni & Co., Inc.© Frank J. Zamboni & Co., Inc. 2018.All Rights Reserved. Any other third party trademarks or copyrights are the property of their respective owners. All rights reserved."}