{"id": "NewsFacts and Figures: Avalanche top line continues fast start", "paragraph": "Welcome to NHL.com, the official site of the National Hockey LeagueBienvenue à LNH.com , le site officiel de la Ligue nationale de hockeyДобро пожаловать на NHL.com, официальный сайт Национальной хоккейной лигиTervetuloa NHL:n viralliselle nettisivustolle NHL.comiinVälkommen till NHL.com, NHL:s officiella web-sidaVítejte na NHL.com, oficiálních stránkách National Hockey LeagueVitajte na NHL.com, oficiálnych stránkach National Hockey LeagueWillkommen auf NHL.com, der offiziellen Seite der National Hockey LeagueThe Colorado Avalanche top line of center Nathan MacKinnon and forwards Mikko Rantanen and Gabriel Landeskog had another big game Friday, combining for 10 points in a come-from-behind 6-3 win against the Ottawa Senators at Pepsi Center. [RELATED: NHL Records and Stats] Rantanen scored one goal and had three assists and leads the NHL with 20 points (five goals, 15 assists). MacKinnon and Landeskog each had three points (one goal, two assists), helping Colorado rally after trailing 2-0 and 3-1. Rantanen scored at 14:32 of the second period to make it 3-2; it was the first of five consecutive goals by the Avalanche (7-2-2), who are tied with the Nashville Predators (8-2-0) for the most points in the NHL (16).Rantanen and Landeskog are tied for the NHL lead in plus-minus at plus-14; MacKinnon is third at plus-12.Video: OTT@COL: Landeskog roofs wrister to take lead in 3rdOnly once in the previous 11 seasons has a player reached 20 points in fewer team games than Rantanen (11). Steven Stamkos (20 points; three goals, 17 assists) did it in 10 games with the Tampa Bay Lightning last season.Rantanen also leads the NHL with 15 assists. That's tied for the third-most by an Avalanche/Quebec Nordiques player in the month of October, behind Hockey Hall of Famers Peter Stastny (21 in 1983-84, Nordiques) and Joe Sakic (16 in 1996-97, Avalanche).MacKinnon and Landeskog each scored his ninth goal of the season in the third period to move one behind center Auston Matthews of the Toronto Maple Leafs and forward David Pastrnak of the Boston Bruins, who share the NHL lead with 10.Video: OTT@COL: MacKinnon buries one-timer to extend leadThe Avalanche play their last game in October at the Minnesota Wild on Saturday (8 p.m. ET; FS-N, ALT, NHL.TV). Stastny (13 in 1982-83) and Owen Nolan (13 in 1991-92) hold the Avalanche/Nordiques record for most goals in October. Three Avalanche/Nordiques players have had at least 23 points in October; the record is 24, set by Michel Goulet (10 goals, 14 assists) and Stastny (three goals, 21 assists) in October 1983.\n                    The NHL uses cookies, web beacons, and other similar technologies. By using NHL websites or other online services, you consent to the practices described in our Privacy Policy and Terms of Service, including our Cookie Policy.\n                NHL.com is the official web site of the National Hockey League. NHL, the NHL Shield, the word mark and image of the Stanley Cup, the Stanley Cup Playoffs logo, the Stanley Cup Final logo, Center Ice name and logo, NHL Conference logos, NHL Winter Classic name, and The Biggest Assist Happens Off The Ice are registered trademarks and Vintage Hockey word mark and logo, The Game Lives Where You Do, NHL Winter Classic logo, NHL Heritage Classic name and logo, NHL Stadium Series name and logo, NHL All-Star logo, NHL Face-Off name and logo, NHL. TV, NHL Premium, NHL After Dark, NHL GameCenter, NHL GameCenter LIVE, NHL Network name and logo, NHL Tonight name and logo, On The Fly, NHL Awards name and logo, NHL Draft name and logo, Hockey Fights Cancer, Because It's The Cup, NHL Green name and logo, NHL Vault, Hockey Is For Everyone, NHL Thanksgiving Showdown name and logo, NHL Centennial Classic name and logo, NHL Centennial Season logo, NHL100 Classic name and logo, NHL Global Series name and logo, NHL China Games name and logo, and Don't Miss A Moment are trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks depicted herein are the property of the NHL and the respective teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. © NHL 2018. All Rights Reserved. All NHL team jerseys customized with NHL players' names and numbers are officially licensed by the NHL and the NHLPA. The Zamboni word mark and configuration of the Zamboni ice resurfacing machine are registered trademarks of Frank J. Zamboni & Co., Inc.© Frank J. Zamboni & Co., Inc. 2018.All Rights Reserved. Any other third party trademarks or copyrights are the property of their respective owners. All rights reserved."}