{"id": "NewsMaple Leafs defeat Ducks in OT, complete California sweep", "paragraph": "Welcome to NHL.com, the official site of the National Hockey LeagueBienvenue à LNH.com , le site officiel de la Ligue nationale de hockeyДобро пожаловать на NHL.com, официальный сайт Национальной хоккейной лигиTervetuloa NHL:n viralliselle nettisivustolle NHL.comiinVälkommen till NHL.com, NHL:s officiella web-sidaVítejte na NHL.com, oficiálních stránkách National Hockey LeagueVitajte na NHL.com, oficiálnych stránkach National Hockey LeagueWillkommen auf NHL.com, der offiziellen Seite der National Hockey LeagueANAHEIM -- Morgan Rielly scored with 1:43 left in overtime to give the Toronto Maple Leafs a 2-1 win against the Anaheim Ducks at Honda Center on Friday.Garret Sparks made 38 saves in his fourth start of the season for the Maple Leafs (14-6-0), who improved to 9-1-0 on the road this season, winning three straight against the Ducks, San Jose Sharks and Los Angeles Kings. It is the first time since 1995-96 that Toronto won road games against the three California teams.\"We had the opportunity to sweep the road trip, and we like winning hockey games as a group, so I think we poured out everything that we had left in the tank for the road here,\" Sparks said. \"It's nice to see that effort was enough for the win.\" [WATCH: All Maple Leafs vs. Ducks highlights] John Gibson made 33 saves for the Ducks (8-9-4), who have lost two in a row and are 2-3-0 in their past five games.Maple Leafs defensemen Jake Gardiner (8:01) and Nikita Zaitsev (13:57) each saved a goal in the third period by blocking a shot with an open net behind them.\"We've been snakebit to provide offense, tonight was a demonstration of that,\" Anaheim coach Randy Carlyle said. \"It was probably the most frustrating time all year because of the open nets we missed.\"Video: EA Sports Overtime Winner: Rielly wins it for TorontoThe Ducks had a 2-on-1 just before Rielly's winner, but Maple Leafs center John Tavares came from behind to poke the puck away from Rickard Rakell.Rakell and Adam Henrique then collided in front of the Toronto net, causing Rakell to go down to the ice and allowing the Maple Leafs to start an odd-man rush in the other direction.Mitchell Marner slid a pass to Rielly on his left, and he shot into the left corner for his ninth goal, most among NHL defensemen.\"Lots of nights in the League, you don't have your best, but as long as you compete and you work hard, things are going to go your way,\" Toronto coach Mike Babcock said. \"It was a good play by [Tavares], real good play by [Marner] and [Rielly] to finish it off. We needed the points, and it was good we got them.\"Pontus Aberg scored his Ducks-leading sixth goal to tie the game 1-1 at 18:35 of the second period. Just as Nick Ritchie crossed the Maple Leafs blue line, he slid a pass to Aberg on his right for a one-timer that beat Sparks between his right pad and arm.Video: TOR@ANA: Aberg wires a slap shot past Sparks The Maple Leafs entered the game 8-0-0 when scoring first, and they took a 1-0 lead at 5:42 of the first period. After Gibson made a glove save on Gardiner, Nazem Kadri won the ensuing face-off back to Gardiner, and Kadri and Patrick Marleau cut to the net. Gardiner's centering pass redirected off Marleau's left skate, the left post and the back of Gibson's right shoulder, and then went across the goal line.The Ducks are averaging the fewest shots in the NHL (26.3) and allowing the second most (36.1), but they outshot the Maple Leafs 12-9 in the first period and 39-35 for the game.\"In the end, we got our game going in the last half,\" Carlyle said. \"We started to play a lot more in their zone, and we started to create more for ourselves.\"Video: TOR@ANA: Marleau uses his skate to open the scoring \"I thought our guys stayed with it here tonight. I didn't think our energy was like it's been, but I thought we found a way to win the game.\" -- Maple Leafs coach Mike Babcock \"I thought we played well as a team. We had good possession, attacked with speed, and created some off the rush. We had some good changes and the next line came on and did the same thing. That was the first time in a long time we've done that.\" -- Ducks forward Rickard Rakell The 14 wins for the Maple Leafs are tied for second most through the first 20 games of a season in their history (1933-34, 1940-41, 1941-42). They won 15 in 1934-35, losing four and tying one. … Zaitsev had a season-high seven blocked shots. … Rielly has seven points (three goals, four assists) in a five-game point streak. … Kadri has seven points (four goals, three assists) in the past seven games. … Marner, who set up Rielly's goal, has 10 points (two goals, eight assists) in the past seven games. … Maple Leafs forward Zach Hyman played his 200th NHL game. … Tavares had a four-game goal streak and a seven-game point streak end. ... Five players have played all 21 games for the Ducks, compared to 13 players who have played all 20 games for the Maple Leafs. ... Anaheim is 8-0-3 when allowing two goals or fewer. … The Ducks were 2-for-2 on the penalty kill and have killed 28 of the past 31 power plays they have faced. Maple Leafs: Host the Columbus Blue Jackets on Monday (7 p.m. ET; TVAS, SNO, FS-O, NHL.TV)Ducks: Host the Colorado Avalanche on Sunday (8 p.m. ET; PRIME, ALT, NHL.TV)Video: Rielly scores OT winner to lead Leafs past Ducks, 2-1\n                    The NHL uses cookies, web beacons, and other similar technologies. By using NHL websites or other online services, you consent to the practices described in our Privacy Policy and Terms of Service, including our Cookie Policy.\n                NHL.com is the official web site of the National Hockey League. NHL, the NHL Shield, the word mark and image of the Stanley Cup, the Stanley Cup Playoffs logo, the Stanley Cup Final logo, Center Ice name and logo, NHL Conference logos, NHL Winter Classic name, and The Biggest Assist Happens Off The Ice are registered trademarks and Vintage Hockey word mark and logo, The Game Lives Where You Do, NHL Winter Classic logo, NHL Heritage Classic name and logo, NHL Stadium Series name and logo, NHL All-Star logo, NHL Face-Off name and logo, NHL. TV, NHL Premium, NHL After Dark, NHL GameCenter, NHL GameCenter LIVE, NHL Network name and logo, NHL Tonight name and logo, On The Fly, NHL Awards name and logo, NHL Draft name and logo, Hockey Fights Cancer, Because It's The Cup, NHL Green name and logo, NHL Vault, Hockey Is For Everyone, NHL Thanksgiving Showdown name and logo, NHL Centennial Classic name and logo, NHL Centennial Season logo, NHL100 Classic name and logo, NHL Global Series name and logo, NHL China Games name and logo, and Don't Miss A Moment are trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks depicted herein are the property of the NHL and the respective teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. © NHL 2018. All Rights Reserved. All NHL team jerseys customized with NHL players' names and numbers are officially licensed by the NHL and the NHLPA. The Zamboni word mark and configuration of the Zamboni ice resurfacing machine are registered trademarks of Frank J. Zamboni & Co., Inc.© Frank J. Zamboni & Co., Inc. 2018.All Rights Reserved. Any other third party trademarks or copyrights are the property of their respective owners. All rights reserved."}