{"id": "NewsStevens fired as coach of Kings, Desjardins named replacement", "paragraph": "Welcome to NHL.com, the official site of the National Hockey LeagueBienvenue à LNH.com , le site officiel de la Ligue nationale de hockeyДобро пожаловать на NHL.com, официальный сайт Национальной хоккейной лигиTervetuloa NHL:n viralliselle nettisivustolle NHL.comiinVälkommen till NHL.com, NHL:s officiella web-sidaVítejte na NHL.com, oficiálních stránkách National Hockey LeagueVitajte na NHL.com, oficiálnych stránkach National Hockey LeagueWillkommen auf NHL.com, der offiziellen Seite der National Hockey LeagueLOS ANGELES -- John Stevens was fired as coach of the Los Angeles Kings on Sunday.Willie Desjardins was named his replacement for the remainder of this season. Assistant Don Nachbaur was also fired and replaced by Marco Sturm, though Sturm will not join the Kings until after the Deutschland Cup concludes next week to fulfill his obligations as coach of Germany.The Kings are 4-8-1 this season, last in the Pacific Division, and have lost seven of their past nine games (2-7-0). They defeated the Columbus Blue Jackets 4-1 at Staples Center on Saturday.Desjardins' debut will be Tuesday when the Kings host the Anaheim Ducks (10:30 p.m. ET; FS-W, PRIME, NHL.TV).General manager Rob Blake had been monitoring the Kings since training camp and was not seeing enough emotion and commitment from players, an issue he believes Desjardins can help resolve.  \"It hasn't gone the way we expect it to and we haven't played the way we expected to, so fast forward here today,\" Blake said. \"What Willie will bring, what we want to bring back is we got to get the compete level up on our players. We got to get the passion back in the game, and we expect fully that he can right that and get us back in the right direction.\"Desjardins, 61, was coach of the Vancouver Canucks for three seasons (2014-17), going 109-110-27.Blake did not rule out player personnel changes moving forward, adding that \"We're going to create a desire for these players to play well here.\" Stevens, 52, had been with the Kings since the 2010-11 season and was hired to replace Darryl Sutter on April 23, 2017. An instrumental figure in building the Kings' defensive identity and structure, which helped them win the Stanley Cup in 2012 and 2014, Stevens went 45-29-8 in his first season as coach before Los Angeles was swept by the Vegas Golden Knights in the Western Conference First Round. Stevens also coached the Philadelphia Flyers from 2006-09 and is 171-148-43 as an NHL coach.Blake, in his second season as general manager, said it was \"awful\" and \"terrible\" to tell Stevens he was fired around 10 a.m. Sunday. However, Blake believes it was one of the few options available to shake up a team that president Luc Robitaille said in August has a three to four-year window to contend for the Stanley Cup.The Kings signed forward Ilya Kovalchuk to a three-year, $18.75 million contract (average annual value $6.25 million) July 1 to help boost an offense that was 16th in the NHL last season with 2.89 goals per game. But Los Angeles is last in goals scored (28) and goals per game (2.15) and lost six in a row from Oct. 13-25. Goalie Jonathan Quick is also out 3-6 weeks following knee surgery.\"You look at training camp, you look at the regular season to where we are now, those expectations have not been met,\" Blake said. \"We have really good players. We have players that can make plays. We expect them to make plays and we expect them to play with that level of compete, and it hasn't been (there). There's an accumulation of a lot of it through the season, but we need to get that straightened around immediately.\"\n                    The NHL uses cookies, web beacons, and other similar technologies. By using NHL websites or other online services, you consent to the practices described in our Privacy Policy and Terms of Service, including our Cookie Policy.\n                NHL.com is the official web site of the National Hockey League. NHL, the NHL Shield, the word mark and image of the Stanley Cup, the Stanley Cup Playoffs logo, the Stanley Cup Final logo, Center Ice name and logo, NHL Conference logos, NHL Winter Classic name, and The Biggest Assist Happens Off The Ice are registered trademarks and Vintage Hockey word mark and logo, The Game Lives Where You Do, NHL Winter Classic logo, NHL Heritage Classic name and logo, NHL Stadium Series name and logo, NHL All-Star logo, NHL Face-Off name and logo, NHL. TV, NHL Premium, NHL After Dark, NHL GameCenter, NHL GameCenter LIVE, NHL Network name and logo, NHL Tonight name and logo, On The Fly, NHL Awards name and logo, NHL Draft name and logo, Hockey Fights Cancer, Because It's The Cup, NHL Green name and logo, NHL Vault, Hockey Is For Everyone, NHL Thanksgiving Showdown name and logo, NHL Centennial Classic name and logo, NHL Centennial Season logo, NHL100 Classic name and logo, NHL Global Series name and logo, NHL China Games name and logo, and Don't Miss A Moment are trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks depicted herein are the property of the NHL and the respective teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. © NHL 2018. All Rights Reserved. All NHL team jerseys customized with NHL players' names and numbers are officially licensed by the NHL and the NHLPA. The Zamboni word mark and configuration of the Zamboni ice resurfacing machine are registered trademarks of Frank J. Zamboni & Co., Inc.© Frank J. Zamboni & Co., Inc. 2018.All Rights Reserved. Any other third party trademarks or copyrights are the property of their respective owners. All rights reserved."}