{"id": "NewsSchmidt signs six-year extension with Golden Knights", "paragraph": "Welcome to NHL.com, the official site of the National Hockey LeagueBienvenue à LNH.com , le site officiel de la Ligue nationale de hockeyДобро пожаловать на NHL.com, официальный сайт Национальной хоккейной лигиTervetuloa NHL:n viralliselle nettisivustolle NHL.comiinVälkommen till NHL.com, NHL:s officiella web-sidaVítejte na NHL.com, oficiálních stránkách National Hockey LeagueVitajte na NHL.com, oficiálnych stránkach National Hockey LeagueWillkommen auf NHL.com, der offiziellen Seite der National Hockey LeagueNate Schmidt signed a six-year, $35.7 million contract extension with the Vegas Golden Knights on Wednesday. It has an average annual value of $5.95 million.The contract begins next season and runs through 2024-25. The 27-year-old defenseman's salary cap charge this season is $2.225 million after he signed an arbitrator-awarded two-year, $4.45 million contract Aug. 5, 2017.\"Nate's turned out to be a pretty good defenseman for us,\" general manager George McPhee said. \"There's still a lot of room for growth for Nate. He's the kind of defenseman every team in this league is looking for. ... He's become a shutdown defenseman for us.\"Schmidt was suspended without pay for the first 20 games of the season Sept. 2 for violating the terms of the NHL/NHL Players' Association Performance Enhancing Substances Program. He is eligible to return Nov. 18 at the Edmonton Oilers.\"It was utterly shocking to be informed that I tested positive for a microscopic amount of a tainted substance,\" he said in a statement at the time. \"... While I support having a strong Performance Enhancing Substances Program in place for our sport, it is difficult to accept this suspension. I understand that I will miss these games, but I do not agree with the suspension and I will not accept being labelled a cheater.\"Schmidt was selected by the Golden Knights from the Washington Capitals in the 2017 NHL Expansion Draft. He helped Vegas reach the Stanley Cup Final in its first season, losing to Washington in five games.\"The knock on him was that he wasn't a good defender,\" McPhee said. \"When paired with [Brayden] McNabb, they do a good job eating up a lot of minutes and playing against the other team's top guys.\"Schmidt had 36 points (five goals, 31 assists) and a plus-19 rating in 76 games last season, and then had seven points (three goals, four assists) and a plus-7 rating in 20 Stanley Cup Playoff games. He has 79 points (13 goals, 66 assists) in 276 games for the Capitals and Golden Knights.NHL.com correspondent Danny Webster contributed to this report.\n                    The NHL uses cookies, web beacons, and other similar technologies. By using NHL websites or other online services, you consent to the practices described in our Privacy Policy and Terms of Service, including our Cookie Policy.\n                NHL.com is the official web site of the National Hockey League. NHL, the NHL Shield, the word mark and image of the Stanley Cup, the Stanley Cup Playoffs logo, the Stanley Cup Final logo, Center Ice name and logo, NHL Conference logos, NHL Winter Classic name, and The Biggest Assist Happens Off The Ice are registered trademarks and Vintage Hockey word mark and logo, The Game Lives Where You Do, NHL Winter Classic logo, NHL Heritage Classic name and logo, NHL Stadium Series name and logo, NHL All-Star logo, NHL Face-Off name and logo, NHL. TV, NHL Premium, NHL After Dark, NHL GameCenter, NHL GameCenter LIVE, NHL Network name and logo, NHL Tonight name and logo, On The Fly, NHL Awards name and logo, NHL Draft name and logo, Hockey Fights Cancer, Because It's The Cup, NHL Green name and logo, NHL Vault, Hockey Is For Everyone, NHL Thanksgiving Showdown name and logo, NHL Centennial Classic name and logo, NHL Centennial Season logo, NHL100 Classic name and logo, NHL Global Series name and logo, NHL China Games name and logo, and Don't Miss A Moment are trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks depicted herein are the property of the NHL and the respective teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. © NHL 2018. All Rights Reserved. All NHL team jerseys customized with NHL players' names and numbers are officially licensed by the NHL and the NHLPA. The Zamboni word mark and configuration of the Zamboni ice resurfacing machine are registered trademarks of Frank J. Zamboni & Co., Inc.© Frank J. Zamboni & Co., Inc. 2018.All Rights Reserved. Any other third party trademarks or copyrights are the property of their respective owners. All rights reserved."}