{"id": "NewsHighlights from Hockey Hall of Fame Class of 2018 speeches", "paragraph": "Welcome to NHL.com, the official site of the National Hockey LeagueBienvenue à LNH.com , le site officiel de la Ligue nationale de hockeyДобро пожаловать на NHL.com, официальный сайт Национальной хоккейной лигиTervetuloa NHL:n viralliselle nettisivustolle NHL.comiinVälkommen till NHL.com, NHL:s officiella web-sidaVítejte na NHL.com, oficiálních stránkách National Hockey LeagueVitajte na NHL.com, oficiálnych stránkach National Hockey LeagueWillkommen auf NHL.com, der offiziellen Seite der National Hockey LeagueTORONTO -- The six newest members of the Hockey Hall of Fame were inducted Monday.Here are some of the key moments from the induction speeches of Commissioner Gary Bettman, Willie O'Ree, Alexander Yakushev, Jayna Hefford, Martin St. Louis and Martin Brodeur: Bettman's tenure as NHL Commissioner nearly never happened. After interviewing as the last of five finalists in November 1992, he received a call offering him the position. He initially turned it down.\"Thank you, but the terms of engagement were not acceptable; it had nothing to do with compensation, it was over the duration,\" the Commissioner said. \"The League was offering a relatively short-term contract and I was looking for a longer-term commitment so that I could begin to do the things that I knew had to be done.\"His negotiation tactic worked.\"He called back 10 minutes later and here we are 25 years later,\" Commissioner Bettman said. \"The term I was looking for was not 25 years though.\"Bettman has been Commissioner since Feb. 1, 1993, and is the longest-serving active commissioner among the four major North American professional sports. Under his leadership, the League has grown from 24 to 31 teams, increased its annual revenue from $400 million to more than $4.5 billion, and incorporated annual outdoor games to a growing list of League events.Commissioner Bettman acknowledged his public appearances generate an energetic reaction, but he's come to embrace the booing he receives when he presents the Stanley Cup.\"So let there be no doubt, tonight should erase any claim that election to the Hockey Hall of Fame is a popularity contest,\" Commissioner Bettman said. \"Almost 26 years later and tonight especially, and perhaps I'm an acquired taste, I guess the 'theys' have finally learned to love me, and I'm grateful for that.\"But for anyone who thinks Bettman is tiring of the job after more than a quarter century in the role, think again.\"I don't love being commissioner as much as I used to, I actually love it even more,\" Bettman said. \"So for those who think I might be getting ready to retire, forget it.\"Video: Commissioner Gary Bettman enshrined in Hall of Fame St. Louis stepped onstage and immediately was thrown off by the magnitude of the moment.\"I might sound like I'm reading, but I'm actually not at all,\" St. Louis said. \"I'm totally going off track, but I'm going to try to bring it back in.\"He did, with a few stops to compose himself, especially as he talked about his family.St. Louis told the story of how he met his wife, Heather, at the University of Vermont. He spoke directly to his three boys, Ryan, Lucas and Mason, all hockey players, and reminded them how lucky they were to have Heather as their mother.He spoke to his father, Normand, and reminded him of the support he felt from him throughout his playing career. He thanked his sister, Isabelle, for her support, and for being his first goalie.St. Louis got choked up while he talked about his late mother, France, who died May 8, 2014.\"She was the best woman I ever met,\" he said. \"She convinced me that my heart and will was taller than everyone else.\"St. Louis shared special words for John Tortorella, his former coach with the Tampa Bay Lightning, saying he went further because Tortorella pushed him to do so. He specifically thanked his three main centers in Tampa Bay, Brad Richards, Vincent Lecavalier and Steven Stamkos, who was among the seven current Lightning players standing stage right after traveling from Buffalo to support St. Louis.\"I'm here a lot because of those guys,\" he said.St. Louis closed with a word advice for kids, telling them to follow their dreams and to always keep pushing to break down the barriers others have thrown up in front of them.And, finally.\"Mom, this one is for you,\" he said.Video: St. Louis enshrined into Hockey Hall of Fame [RELATED: Brodeur recalls unique bond with father | St. Louis gets support from Lightning] O'Ree didn't know he had made history with the Boston Bruins, he was too busy focusing on the next step of his career.\"Believe it or not, on Jan. 18, 1958, when I stepped on the ice with the Bruins, it didn't dawn on me that I was breaking the color barrier, that's how focused I was on making my dream come true,\" O'Ree said. \"I did not know I made history until I read it in the paper the next day.\"O'Ree has never stopped living the dream. He enjoys working for the NHL as its diversity ambassador, helping the League open the game to as many people as possible.\"I want to thank NHL Commissioner Gary Bettman for trusting me with his vision of the NHL that hockey is for everyone,\" he said. \"Thank you from the bottom of my heart for the opportunity you have given me.\"O'Ree gave advice using his friendship with musician Snoop Dogg to illustrate his point.\"Years ago, I was doing an event in Los Angeles and Snoop Dogg was there,\" he said. \"We know he loves the game, but when I got him out there on the skates, he said, 'Willie, I hope I don't fall.' I told him what I tell the kids: If you fall, just get back up.\"O'Ree closed by issuing a challenge to all who love the game.\"Tonight, I tell you we are not done,\" he said. \"We have barriers to break and opportunities to give. I leave this with you: When you return to your communities, take a look around, find a young boy or girl who needs an opportunity to play hockey, and give it to them. You never know, they may make history.\"Video: Willie O'Ree inducted into Hockey Hall of Fame In his remarks introducing fellow Hockey Hall of Fame Class of 2018 inductees, Commissioner Bettman said that Yakushev \"caused upset stomachs\" across Canada with his play for the Soviet Union during the historic 1972 Summit Series.The Commissioner was understating the truth: In fact, Yakushev gave Canadian hockey fans ulcers.\"There couldn't be a loser in that series,\" Yakushev said. \"The winner was hockey in all its majesty.\"The Moscow Spartak forward is the 19th player from the Summit Series to be enshrined in the Hockey Hall of Fame (16 Canadians and three Russians). Central Red Army goaltender Vladislav Tretiak, a cornerstone of the best Soviet teams and a 1989 inductee, presented Yakushev with his plaque.\"I was born in the post-Second World War Soviet Union and I lived the first seven years of my life outside of Moscow in a wooden barrack,\" Yakushev said while thanking his parents for providing all they could as metallurgical-plant workers.Life improved for the family of five when it moved to Moscow, first into a single room of roughly 38 square feet, then into a one-bedroom apartment.From there, Yakushev would find his way into the Spartak Moscow club program, where he spent his entire Russian career.Yakushev thanked the coaches and teammates who played a major role in his hockey life, especially those on the national teams \"with whom I defended the pride of my country and won two Olympic gold medals and seven world championships.\"Spartak Moscow still burns brightly in his heart, no matter that the country wanted him, in his prime, with the powerhouse Red Army.\"I never considered this option,\" he said. \"One time, in order to draft me into the army, an officer and two soldiers came to my apartment. But Tatiana, my wife, wouldn't open the door, telling them I wasn't at home.\"That unanswered door likely changed Yakushev's future, which would lead him into the Hockey Hall of Fame.Video: Alexander Yakushev earns Hall of Fame honor Hefford never dreamed of being inducted into the Hockey Hall of Fame when she was growing up. She wanted to play in the NHL and win a Stanley Cup.Ultimately, she went on to a storied international career representing Canada, winning seven gold and five silver medals at 12 World Championships and four gold medals and one silver in five Olympics. In 267 games playing for Canada, she scored 157 goals and had 291 points, second all-time behind Hayley Wickenheiser.\"I was fortunate to have a family and a support system around me to follow the obvious passion I had for the game,\" Hefford said. \"The amazing part of my story is that those closest to me never once told me I would not play in the NHL.\"Hefford's passion for the game came from her father, Larry, who died in 2007. She paid tribute to her father and her mother, Sandra, for encouraging her to follow her passion for hockey at a time when few girls played the game.\"My dad was my biggest fan. He would have been obviously incredibly proud of me, but he would have been so proud to be in this Hall with the likes of all of you. I know I got my passion for the game because of him,\" Hefford said. \"To my mom, thank you for encouraging me to follow my dreams and my passion, and not letting anyone else put limits on those.\"Now the commissioner of the Canadian Women's Hockey League, Hefford focused on delivering a message of inclusiveness so that anyone who wants to play hockey has the opportunity.\"I wouldn't be up here tonight if I didn't have the opportunity to play the game even at a time when it was still considered a boys' sport,\" Hefford said. \"I hope you'll join in advocating for the power of opportunity for everyone because it's only when our voices are united that we become too loud to ignore.\"Video: Jayna Hefford inducted into Hockey Hall of Fame Brodeur delivered his Hockey Hall of Fame induction speech in French and English.But the tears trickling down his cheeks symbolized a universal language that hockey fans around the world could understand.The emotions of his enshrinement moment bubbled over when he spoke of his late father, Denis, who was the Montreal Canadiens' team photographer for more than two decades. It was through Denis that young Martin first was brought into a professional hockey environment and would meet icons like Jean Beliveau and Guy Lafleur.Beliveau and Lafleur are in the Hall. Now Brodeur is too.\"I know my dad would be proud,\" Brodeur said, trying not to cry as he looked up to the sky.Brodeur then made a revelation: He almost walked away from hockey.\"When I was 14 years old, I was cut from a AA team,\" Brodeur said. \"I wasn't really happy about this. A few months went by, and I decided I was going to quit hockey and hang around with all of my buddies.\"Brodeur paused. More tears.\"When my big brother Claude found out, he grabbed me by the collar and brought me right back to the team,\" Brodeur said after several seconds. \"When you are a teenager, you need your family and friends to keep your eye on the goal.\"Brodeur's goal: to make the NHL like his idol, Patrick Roy. Mission accomplished.Brodeur won the Stanley Cup three times with the New Jersey Devils (1995, 2000, 2003). Fittingly, it was two of his Hockey Hall of Fame teammates, Scott Stevens and Scott Niedermayer, who presented him with his plaque.He fought back tears when he received it, a recurring theme on this special night.Video: Martin Brodeur welcomed into the Hockey Hall of Fame\n                    The NHL uses cookies, web beacons, and other similar technologies. By using NHL websites or other online services, you consent to the practices described in our Privacy Policy and Terms of Service, including our Cookie Policy.\n                NHL.com is the official web site of the National Hockey League. NHL, the NHL Shield, the word mark and image of the Stanley Cup, the Stanley Cup Playoffs logo, the Stanley Cup Final logo, Center Ice name and logo, NHL Conference logos, NHL Winter Classic name, and The Biggest Assist Happens Off The Ice are registered trademarks and Vintage Hockey word mark and logo, The Game Lives Where You Do, NHL Winter Classic logo, NHL Heritage Classic name and logo, NHL Stadium Series name and logo, NHL All-Star logo, NHL Face-Off name and logo, NHL. TV, NHL Premium, NHL After Dark, NHL GameCenter, NHL GameCenter LIVE, NHL Network name and logo, NHL Tonight name and logo, On The Fly, NHL Awards name and logo, NHL Draft name and logo, Hockey Fights Cancer, Because It's The Cup, NHL Green name and logo, NHL Vault, Hockey Is For Everyone, NHL Thanksgiving Showdown name and logo, NHL Centennial Classic name and logo, NHL Centennial Season logo, NHL100 Classic name and logo, NHL Global Series name and logo, NHL China Games name and logo, and Don't Miss A Moment are trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks depicted herein are the property of the NHL and the respective teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. © NHL 2018. All Rights Reserved. All NHL team jerseys customized with NHL players' names and numbers are officially licensed by the NHL and the NHLPA. The Zamboni word mark and configuration of the Zamboni ice resurfacing machine are registered trademarks of Frank J. Zamboni & Co., Inc.© Frank J. Zamboni & Co., Inc. 2018.All Rights Reserved. Any other third party trademarks or copyrights are the property of their respective owners. All rights reserved."}