{"id": "ESPNMolineux, top-order muscle give Australia 1-0 lead in T20IsMatch CoverageBetting OddsPresented ByBet365ABOUT COOKIES", "paragraph": "Australia women 195 for 3 (Gardner 63*, Healy 59, Mooney 38) beat Pakistan women 131 for 7 (Nahida 43, Molineux 4-16) by 64 runsBatsmen Alyssa Healy and Ashleigh Gardner carried their sparkling form from the ODIs into the T20Is and left-arm spinner Sophie Molineux bagged career-best figures of 4 for 16 to continue Australia women's dominance over Pakistan women. After putting on a challenging 195 for 3, Australia allowed only one Pakistan batsman to score over 25 and restricted them to 131 for 7 to take a 1-0 lead in the three-match T20I series.Opting to bat, Australia's top order took on the bowlers from the first over, as Beth Mooney (38) and Healy hammered three fours and a six each to put on 57 in the Powerplay. Mooney was soon trapped lbw by left-arm spinner Nashra Sandhu, but Healy continued smashing boundaries to reach her fifth T20I half-century - following her 97 in the third ODI three days ago - off only 28 balls. Gardner took over once Healy fell for 59, and struck three consecutive fours against Aliya Riaz in the 16th over. Even though Nida Dar took the big wicket of Meg Lanning for 6 in the next over, Elyse Villani belted an unbeaten 18 off 13 and Gardner's 63 off 37, with nine fours and a six, powered Australia close to the 200-run mark. Gardner had also struck an unbeaten 62 in the third ODI against Pakistan, although at No. 7.Sana Mir, who recently became the top-ranked bowler in ODIs, Sandhu and Dar conceded at least 10 runs per over each, and sent down eight wides together.Molineux struck on her fifth ball by removing left-handed opener Muneeba Ali for a duck, when she paddled the ball fine but Healy completed a quick take and a stumping down the leg side. Javeria Khan showed glimpses of form with a back-foot punch and a slog towards wide long-on for fours against Ellyse Perry in the third over, but Molineux returned in the fifth over and took a straightforward return catch to her left to remove Javeria for a 12-ball 16.Nahida Khan, the other opener, and debutant Umaima Sohail scored briskly in a stand of 55 for the third wicket to take Pakistan past 80 just after the halfway mark. Molineux broke that stand too, when Nahida tried slog-sweeping but missed, to be bowled for a 32-ball 43. From 82 for 3 in the 11th over, Pakistan never recovered, losing four more wickets for 41 runs and managing only 29 runs in the last five overs.Megan Schutt was economical once again, with figures of 4-0-14-1 and Molineux's four-for showed good signs for Australia's spin attack ahead of the Women's World T20 next month.Alyssa Healy and Ashleigh Gardner continued their sparkling form, while Sophie Molineux bagged a career-best 4 for 16Sign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}