{"id": "ESPN'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upShakib returns from finger injury to lead against West Indies in first TestABOUT COOKIES", "paragraph": " Shakib Al Hasan will lead Bangladesh in the first Test against West Indies, ending speculation about his finger injury. Shakib returned to training earlier this week after a month-long rehabilitation programme, following complications with the injury that he sustained in January this year.IN: Shakib Al Hasan, Soumya Sarkar, Nayeem HasanOUT: Liton Das, Nazmul Hossain Shanto, Abu Jayed, Shafiul Islam, Nazmul IslamShakib, Soumya Sarkar and 17-year-old offspinner Nayeem Hasan were the inclusions in the Bangladesh Test squad that was trimmed to 13 players from the 15-man squad that had been named against Zimbabwe. Liton Das, Nazmul Hossain Shanto, Abu Jayed, Shafiul Islam and Nazmul Islam were all dropped.Chief selector Minhajul Abedin said that Shakib was fit but needed game time under his belt, while Soumya was picked to resolve Bangladesh's Test opening conundrum, with Tamim Iqbal still recovering from a side strain.\"He has no physical problems currently, but he is short of match fitness. But since he is a senior player, we think that he is ready,\" Minhajul said. \"Soumya has done well in the NCL. Our openers have failed in Tests, so we want to give him a chance. Soumya plays fast bowling quite well.\"Soumya effectively replaces Liton who showed glimpses of form in ODIs but has struggled in Test cricket this year. Shanto, Jayed, Shafiul and Nazmul have all been dropped, according to Minhajul, because the selectors wanted a smaller Test squad. These players will be playing in the Bangladesh Cricket League, the first-class tournament which is scheduled to begin next week.It is, however, particularly chastening for Jayed, who was Bangladesh's standout bowler July in the West Indies, but is suddenly behind Khaled Ahmed in the selectors' pecking order.\"[Abu Jayed] Rahi is not really dropped. We may go with one seam bowler, so there's no point keeping him around the squad. The same goes for [Najmul Hossain] Shanto, Shafiul [Islam] and [Nazmul Islam] Apu,\" Minhajul said.Nayeem, who was a surprise choice in the Bangladesh Test squad last January, has been picked this time for topping the wicket-takers' charts in the NCL, the first-class tournament that concluded last week. Soumya meanwhile last played Tests more than a year ago.Squad: Shakib Al Hasan (capt), Soumya Sarkar, Imrul Kayes, Mohammad Mithun, Mominul Haque, Mushfiqur Rahim, Ariful Haque, Mahmudullah, Mehidy Hasan Miraz, Mustafizur Rahman, Taijul Islam, Syed Khaled Ahmed, Naeem HasanTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}