{"id": "ESPNHey Virat, you're the captain of the Indian cricket team, not Captain IndiaSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upHey Virat, you're the captain of the Indian cricket team, not Captain IndiaABOUT COOKIES", "paragraph": "Virat Kohli is old enough to know better. He is 30 years old, a modern great, one of the richest sportsmen in the world, and the captain of the Indian cricket team. And yet, a few days ago, he chose to release a video for his online app where he picked on a desi fan who was sceptical of the quality of Indian batsmen, Kohli included, and declared that he preferred batsmen from other Test-playing countries. Kohli's response was to say, on camera, that he was okay with the fan's preferences but if that's how he felt, he didn't understand why he lived in India; he ought to live elsewhere, presumably in the country to which his batting heroes belonged.This didn't go down well. Instead of hosannas of praise for this piece of casual rabble-rousing, fans and commentators pushed back. Aakash Chopra predicted that Kohli wouldn't be proud of his choice of words in retrospect, and Harsha Bhogle saw the tone-deaf comment as a symptom of the self-affirming bubble in which celebrities live, which insulated them from the diversity of the real world. This is why, Bhogle suggested, \"... contrary opinions are frowned upon. Power and fame tend to attract those people who agree with you and reinforce your opinion because they benefit from proximity to fame and power.\"Bhogle spoke from experience. Two years ago, he was abruptly shut out of commentary contracts. During the World T20 tournament in 2016, that noted cricket analyst Amitabh Bachchan deplored the lack of patriotism amongst Indian commentators. Bachchan came to this conclusion because he felt they spent too much time praising foreign players: \"Fed up ho gaye yaar\" he tweeted, in his best blokeish manner, \"Jab dekho unki tareef karte rehte hain\" [I'm fed up. They keep praising them all the time]. When, Kohli's predecessor, MS Dhoni, retweeted Bachchan's complaint and glossed it with \"Nothing to add\", it became obvious that he shared Bachchan's grouse. Kohli's willingness to police the patriotic credentials of India's cricketing public is part, then, of a larger culture of thin-skinned entitlement.Part of the reason for this recent recourse to ready-mix chauvinism is that it is a force-multiplier in the online world. There was a time when the thoughts of India's cricketers on the game and the world weren't so freely available because, in the pre-digital world, active sportsmen didn't, as a rule, editorialise. But in the digital world, a celebrity's social-media presence is crucial to his visibility, his influence, his endorsements, his revenues and his connection to his public. Kohli's tweets, his videos and his app nurture his persona; they are, if you like, his version of the prime minister's Mann Ki Baat.We have seen other cricketers like Virender Sehwag and Gautam Gambhir build their online constituencies on a reputation for reliably calling out \"anti-national\" eruptions in the world around them. Their Twitter followers number in the millions; not only can these numbers be monetised (into advertising revenues), they are also useful groundwork for possible careers in public life. In a way that Donald Trump has made familiar, social-media accounts and digital apps are ways of driving traffic and capturing a news cycle: every unfiltered, provocative, drum-beating intervention helps its author trend, makes him, for that moment, a master of the interwebs. You would have thought that Dhoni, Kohli, Sehwag and Co would be surfeited by celebrity, but Modi and Trump have taught us that visibility is everything: \"I trend, therefore I am.\"Kohli's bid to challenge the patriotism of his critics, Dhoni's willingness to reduce cricket commentary to mindless pandering, is wrong-headed for any number of reasons. It is, to start with, stupidly narcissistic. Kohli said what he did because he is a great batsman. Had he picked on a desi fan who said that he preferred Dale Steyn and Vernon Philander to Indian seamers, his response would have been self-evidently daft. Take spin bowling. I, and every other Indian cricket fan with half a brain, knew that Muttiah Muralitharan was twice the bowler that Harbhajan Singh was and no one suggested we were unpatriotic for thinking that. Kohli isn't making a general point; he's making a pointedly personal one. Worship me, he's saying, because I'm arguably the best batsman in the world, and if you can't do that much, you're a self-hating desi who doesn't deserve to live in India.The other problem with this peremptory demand for patriotism is that it is one thing to unconditionally support a cricket team when it's an underdog, as India used to be in the sixties and seventies, up against better organised, better funded, more gifted teams, and quite another to demand unthinking loyalty when India is the 800-pound gorilla of world cricket, led by an all-powerful board and represented by the best-paid cricketers in the world. Bishan Bedi tells of a Test against New Zealand that his team won in four days; they were rewarded by being docked the Rs 250 they would have been paid as daily allowance for the fifth day, because the Test didn't go the distance.With great power comes great responsibility, and it's reasonable for an Indian spectator to rate AB de Villiers the better player because, other things being equal, he prefers his on-field demeanour to Kohli's effing and blinding. Come to think of it, Kohli could render great patriotic service to his female compatriots if, the next time he vented, he forbore from machoing and panchoing in deference to the Indian mothers and sisters who make up half of India's cricketing public.Many of the responses to Kohli's video made the point that it was absurd for a man who endorses foreign cars, had his wedding in an Italian location, and more generally, lives the life of the roving cosmopolitan, to hector others for their sporting preferences. If Kohli prefers German carmakers and Italian hoteliers, why shouldn't Indian cricket fans prefer Australian batsmen? It's a clever comeback but it isn't a good argument. People recognise that cars and hotels are things, not national symbols. They can be, of course, which is why the US president rides an American brand car, but for the most part in a market society, they are seen as commodities that can be neutrally consumed.Kohli is guilty of excessive pride, not hypocrisy. He has confused being the captain of the Indian cricket team with being Captain India. He believes that unconditional admiration for him is a necessary condition for being a patriotic Indian. The truth is that the very notion of an \"Indian\" cricket team is possible only because Indians over a century and a half ago fought to imagine themselves into a united nation. It wasn't given to us; generations of Indians dreamt it into being. In that sense, the profile of the Indian cricket team and the stature of its captain are figments of the Indian public's collective imagination. It's not for Kohli to demand its allegiance or certify its patriotism; it is this cricketing public's prerogative to extend or withhold its support. It can choose, should it find cause, to stop believing in Kohli and his team, in the way that the Australian public chose to withdraw its faith in and support for Steven Smith and his cheating men.Smith's fate is (or ought to be) a cautionary tale. When a cricketer becomes a law unto himself, as Kohli has, with a tame board and a pliant manager, he tends to mistake his social- media echo-chamber for the world. The ancients had a word for this: hubris. Luckily Kohli seems to have been shocked into self-awareness by the pushback, so nemesis might yet be forestalled. He backed away with a disarming tweet: \"I guess trolling isn't for me guys, I'll stick to getting trolled!\" The next step would be to get off his hillock of self-esteem, back on to level ground: those 22 yards of turf that are the firm foundation of his fame.Mukul Kesavan is a writer based in New Delhi. This article was first published in the Kolkata TelegraphTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}