{"id": "ESPNShield to remain at SCG despite new $50 million hubSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upShield to remain at SCG despite new $50 million hubABOUT COOKIES", "paragraph": "New South Wales will still play the majority of their home Sheffield Shield matches at the SCG, despite the inclusion of an ICC-compliant oval in plans for a new A$50 million training base for the state association. It is the first time NSW has shifted its headquarters away from Sydney's eastern suburbs in more than 150 years of existence.Discussions about the headquarters and training facilities of Cricket NSW have been going on for more than five years, and focus upon a new \"hub\" site in the Sydney Olympic Park region began to take shape in late 2016. It was hastened by concurrent plans to redevelop the Sydney Football Stadium adjacent to the SCG, thereby squeezing the state association out of offices it had occupied for some years.At the same time, ongoing squabbles between NSW and the SCG Trust, plus the expansion of the state's number of elite teams with the advent of the NSW women's team and men's and women's Big Bash League sides, created further pressure for expansion. To that end, the NSW state government has pledged A$30 million to the project, with NSW and Cricket Australia to contribute A$10 million. The remaining A$10 million expected to be required to fund the project will be sought in coming months from sponsors and also the Federal government.\"This is a landmark day for NSW cricket. NSW produces the best cricketers, male and female, in Australia and they will now have the best facility in Australia to train,\" NSW chief executive Andrew Jones said. \"This facility will also accommodate indoor training and outdoor playing for men, women, boys and girls from all over Sydney.\"The growth of cricket and the Allianz Stadium redevelopment make this facility urgently needed. During the past decade the number of elite teams under the Cricket NSW umbrella has grown from two to six with the advent of the men's and women's Big Bash. With Cricket NSW also leading the professionalisation of women's cricket two seasons ago, we have simply outgrown what we currently have at Moore Park.\"The new facility will allow us to have a modern high-performance centre with a cricket field and plenty of turf nets to cater for the increased number of elite and developing players now coming through our pathway system. With our extra training facilities at Blacktown and a continuing presence at the Sydney Cricket Ground we will now be able to better cater for all our athletes right across Sydney.\"Key to the new facility will be the ability to train on turf wickets during the winter months, an advantage previously available only by venturing north of the NSW border to the National Cricket Centre in Brisbane. But despite the inclusion of a new cricket ground in plans, the association's strategy will still be to play four of every five home Shield fixtures at the SCG, leaving the new Olympic Park precinct, to be completed by 2022, as a training and administrative base.\"The government's investment of $30m towards a Western Hub will be a game changer for our sport in NSW,\" CA chief executive Kevin Roberts said. \"I know first-hand the importance of facilities like these to support young aspiring cricketers, particularly in one of the fastest growing areas of Australia. CA is pleased to join Cricket NSW and the NSW Government in investing in this project and we can't wait for it to get started.\"Since the opening of the NCC in Brisbane in 2013, Cricket Victoria has unveiled its own A$40 million headquarters at Junction Oval in Melbourne, Tasmania has worked to allow its players the chance to train on turf during the winter by installing a large marquee in Hobart, and now NSW has followed suit with its own set of year-round facilities. CNSW will move to temporary offices in Sydney Olympic Park at the end of this season, ahead of the new centre's opening.\"In our 159-year history we have never had a home that we manage and control,\" Jones said. \"We produce the best male and female cricketers in Australia and they deserve the best facilities, and now we will have them. It will be the best high-performance cricket facility in Australia. There have obviously been some issues for cricket lately, but they are one or two-year issues, this is a 100-year success story. So this will set Cricket NSW up until 2118, so what happened in 2018 won't matter.\"NSW already shared a playing and training facility at Blacktown Oval to Sydney's west, while the Sydney Thunder play their BBL home games at Sydney Olympic Park.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}