{"id": "ESPN'Game is still evenly poised' - Zimbabwe fielding coach MakunuraSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-up'Game is still evenly poised' - Zimbabwe fielding coach MakunuraABOUT COOKIES", "paragraph": "Having watched Mushfiqur Rahim and Mominul Haque bat for close to two days after they had Bangladesh on the ropes at 26 for 3, Zimbabwe have been given a thorough lesson in how to apply themselves on a pitch that has occasionally offered something for the bowlers.\"Our batters can learn a thing or two from him [Mushfiqur], from how he applied himself on that pitch,\" said Shepherd Makunura, Zimbabwe's fielding coach. \"Earlier on, especially in the first session, the ball did quite a bit, but he batted quite well.\"Mominul's counterattacking ton and Mushfiqur's watchful double allowed Bangladesh to seize control of the game after Zimbabwe's early inroads. But Makunura presented a brave face when asked about what must have been a frustrating experience for the visitors.\"That's part of cricket,\" he said. \"Things like that will always happen. You do get a few wickets early on, but in Test cricket there's bound to be partnerships along the way. The way the Bangladesh batters applied themselves, they set themselves up for the other batters coming in.\"One of those other batters was Mehidy Hasan, who made an attacking, unbeaten 68 at No. 9 to extend Bangladesh to a total of 522. \"Coming in to a set batter like Mushfiqur made it a little easier for him, and the stage was set for a good partnership,\" Makunura said of Mehidy's knock. \"They did bat quite well, the two of them.\"Helpful in Bangladesh's recovery were Zimbabwe's lapses in the field. They dropped Mominul three times during his 161, and also offered Mushfiqur a second life in the fourth over on Monday, when an inside edge ricocheted off his thigh and wicketkeeper Regis Chakabva put the chance down.\"It's always frustrating,\" Makunura said of the drops, \"But it's part of the game. You catch some, you drop some, and it's part of the game. We have to take it in our stride, and move on from there.\"Zimbabwe were made to pay for their mistakes in the field, and their bowling attack struggled to maintain the consistency that had helped set up their win in Sylhet. Fast bowler Tendai Chatara was stretched off with a suspected Grade 2 tear on his left quadriceps muscle, and though Kyle Jarvis stuck to his lines to take 5 for 71 in his absence, he was given precious little support by Zimbabwe's spin attack, who went wicketless.\"I don't think the guys were complacent,\" Makunura said. \"We spoke in our change rooms earlier on this was an opportunity for us to win an away Test series, which we haven't done in a long time. I don't think we bowled well enough, but I wouldn't put that down to complacency. We didn't bowl as well as we should have, but we also must give credit to the Bangladesh batters.\"Makunura remained hopeful that Zimbabwe could learn from Mominul and Mushfiqur's example and bat themselves back into the game, pointing to the first session of the third day as being crucial to their mission.\"I think the game is still evenly poised, although Bangladesh batted quite well,\" he said. \"It's all going to depend on how well we bat tomorrow, especially the first session. If we can negotiate the first session, we can make life a little easier for ourselves. It's going to take a lot of batting for us.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}