{"id": "ESPNHayley Matthews helps West Indies storm into semi-finalsMatch CoverageBetting OddsPresented ByBet365Women's World T20ABOUT COOKIES", "paragraph": "West Indies women 187 for 5 (Matthews 62, Dottin 49) beat Sri Lanka women 104 (Atapattu 44, Matthews 3-16) by 83 runsSri Lanka were caned by Hayley Matthews, first with the bat at the start of the match, and then with the ball at the end as they crashed out of the tournament with an 83-run loss against West Indies. The result also meant that the last two semi-final qualification spots were sealed, with England and West Indies going through from Group A with a game each to spare.Matthews was imperious in the Powerplay after West Indies had elected to bat, racing to 49 off 23 balls as she and Deandra Dottin made 72 runs in the first six overs. Sri Lanka had conceded that many against Bangladesh in 20 overs during their last game at the same venue. With three changes, most crucially the ouster of seamer Sripali Weerakkody, they struggled to settle in the face of West Indies' assault against an attack that was almost exclusively made of spinners.The spinners found no control - the flighted deliveries were lofted straight or over covers, and every time they went flat, they were carved behind square on the off side. Udeshika Prabhodani - their frontline seamer, and the only one in the XI on Friday - got the ball to move around as she had all tournament. But against significantly more aggressive and powerful batsmen, she struggled for support from the other end.For the most part, Sri Lanka's strategy was to get their spinners to bowl full and wide outside off with a packed field on that side, but Matthews circumvented that challenge with the use of her feet to hit straight over the bowlers, or to bring her reach into play with heaves over midwicket. She also managed to do this with a decent control rate, offering the first chance after she had made her 25-ball fifty; that chance was dropped at point, but Hasini Perera held on in that same position the next time Matthews went aerial.Dottin hadn't quite hit the straps in Matthews' company, despite striking comfortably over a-run-a-ball; but within two overs of their partnership ending on 94, she moved from 27 off 22 to 47 off 32.That momentum was kept even after her dismissal for 49, with promoted No. 4 Natasha McClean making no effort to settle in. She went after the bowling straightaway, hitting a six and a four in her brief knock before she was run out by Ama Kanchana, who got a direct hit from deep midwicket at the non-striker's end. It was Sri Lanka's only inspired moment on the field.Sri Lanka's captain, Atapattu, had mysteriously strived all evening to have five fielders inside the circle even after the Powerplay. Several runs that could have been saved were scored through cover and past mid-off, particularly by Stafanie Taylor who accelerated late into the innings to get West Indies to 187 after a dull between overs 16 and 18 where they hit no boundaries.Sri Lanka's response was spirited, but ineffective. The intent to score was there, but the runs themselves weren't coming. Against West Indies' varied bowling attack and more considered strategies, only Atapattu could get deep into the innings with a passable strike rate. The other experienced batsmen - Shashikala Siriwardene and Eshani Lokusuriyage - came in with the required rate well above ten per over and had no choice but to attack almost every delivery they faced. Their attempts weren't sustainable and, with their wickets, Sri Lanka were truly out of the chase even though their captain battled.West Indies used the opportunity to slip in overs from seven bowlers, and by the end of the night, six of them got at least a wicket. Matthews came close to getting the second hat-trick of the day - England's Anya Shrubsole got the first against South Africa in the previous game - and Sri Lanka lost their last six wickets for 16 runs. If it weren't for the last-wicket stand of nine, they would have finished the tournament without once going past 100.Hayley Matthews caned West Indies with the bat at the start of the match, before rushing through their lower order with three wickets as West Indies won by 83 runsSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}