{"id": "ESPNFailure of leadership, Peever's position 'untenable'Sense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upFailure of leadership, Peever's position 'untenable'ABOUT COOKIES", "paragraph": "There was plenty to digest for Australian cricket after the findings of two reviews into the game were revealed on Monday. Here is a selection of the media reactionGreg Baum, The AgeThe individual could only dissemble and squirm. Peever said he had taken responsibility, \"voluntarily\" commissioning two \"independent\" reports and transparently and fully releasing their contents and findings. As if he had any choice to order up the reports. As if they could credibly have been anything other than independent... And yet still presiding is the man who sat atop the previous dispensation, the one that neglected the spirit of cricket, for which he says he accepts full responsibility while everyone else cleans out their lockers and desks. Even if only as a figurehead, it is an uncomfortable position for him, incongruous in the eyes of the cricket world; in a word, untenable.Tracey Holmes, ABCCricket has become a commodity, a business, where only numbers matter, and the human element -- ethics, morals and personal values -- has diminished to the point of hardly being recognised. Cricket Australia did not deliberately set out to get to this position but, the Ethics Centre report suggests, it was a foreseeable consequence of the way the governing body has gone about making the success of the men's team the measure of its reputational standing.The Aussie cultural review is cringeworthy ... 'Smile with us , Dream with us ' !!!!!! What a load of B ......... !! Just play good,hard,fair cricket & win a few games is all that's required ... !!Patrick Smith, The AustralianPeever could not middle any delivery aimed at knowing why he is still in charge of the sport when even the most sympathetic interpretation of good governance would demand he step away. The review by The Ethics Centre identified what was essentially a cultural cesspool. Deaf to advice, irrational abhorrence to defeat, crass and offensive behaviour, barely a trace of respect between officials and players. Peever, as chairman, and others within Cricket Australia, had to accept responsibility because they failed hopelessly to show appropriate leadership.Gideon Haigh, The AustralianIn a corporate model, there are external agents, such as regulators, such as institutions, such as government. Chairs resign; boards reconstitute; executives get fired, and even have bonuses clawed back. At Jolimont, somehow, a small elite award themselves promotions, new terms, fat benefits, cheery farewells. Let's not forget that the only reason we have been afforded this glimpse of the degree of cricket's organisational dysfunction is because a vigilant cameraman spied a cricketer scratching a cricket ball; otherwise CA would still be stumbling along counting its millions, oblivious to the players' discomfiture and the public's discontent.This comment from Cricket Australia chairman, David Peever when speaking on ABC Radio Melbourne about the damning report into CA's governance shows why he is not fit for the job ... \"No I'm not embarrassed, I'm excited about the opportunity this presents for cricket\"Sam Perry, The GuardianIt is a wicked problem for the governing body. Already under pressure from a sceptical public to enact concrete change following Dr Longstaff's findings, any decision to uphold the player bans without requisite and tangible leadership accountability would smack of the precise double-standards they stand accused of in the culture review. Should their executive survival instinct remain strong, another route would be to reduce the bans applied to the trio, though it would infer poor original judgment. But it takes special mental gymnastics to at once reform a \"win at all costs\" attitude, and to simultaneously conclude that Smith and Warner deserve an early return. Australia will of course win more games with these two in the side.Robert Craddock, News CorpAdministrators can pound the pulpit as much as they like but the success of any renewed push for the spirit of cricket rests squarely on the shoulders of the players. Passion tends to be at its strongest at the start of projects. If player commitment is patchy now, how will it be when the battle starts? The most significant part of the review is Australia is now a prisoner of its own improved standards. The bar has been lifted. The standard has been set. Now, can anybody bat?To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}