{"id": "ESPNMorris and Shamsi impress as South Africa extend Australia's miseryMatch CoverageBetting OddsPresented ByBet365ABOUT COOKIES", "paragraph": "South Africa 6 for 108 (du Plessis 27, de Kock 22, Tye 2-18) beat Australia 7 for 87 (Maxwell 38, Morris 2-12) by 21 runsA torrential downpour on the Gold Coast dampened the mood before South Africa inflicted Australia's third loss in four matches to leave the home side down right miserable.Australia have now lost their last four T20Is and five of the last six on top of losing a one-day and Test series in between times.The rain reduced the game to a 10 overs-a-side on a surface at Metricon Stadium that was hosting international cricket for the first time.South Africa coped with the unknowns of the conditions and the pitch better than their opponents, piling on 108 in 10 overs thanks to a power-packed Powerplay from Quinton de Kock and Reeza Hendricks.Australia's chase drowned under the scoreboard pressure. Kagiso Rabada and Lungi Ngidi built the pressure before Chris Morris delivered the knock-out blow in the third over removing D'Arcy Short and Chris Lynn and Australia never recovered.Rain, rain go awayMetricon Stadium on the Gold Coast had set itself for its first international cricket match, just seven months after hosting the 2018 Commonwealth Games. But a deluge of rain pre-game, 18 millimetres in total, nearly ensured the match never started. Fortunately, the heavy rain cell passed due to strong winds. The game did start after a delay of nearly two hours, with the playing conditions changing to 10 overs per side, two overs maximum for each bowler, with a three over Powerplay.Pace gets burntAustralia opted for an all specialist pace attack, leaving out Adam Zampa and relying on the part-time spin of Glenn Maxwell and Short. They paid a price in the three-over Powerplay. Jason Behrendorff, Billy Stanlake and Nathan Coulter-Nile were clubbed for 42 in three overs. de Kock and Hendricks feasted on the shorter lengths and inconsistent lines that were offered before Hendricks holed out from the second last ball of the Powerplay. Finch turned to spin post Powerplay and it put the brakes on. Maxwell and Short bowled the next three overs for 28 runs and it could have been far less with a bit of luck. Maxwell had de Kock stumped and should have had du Plessis stumped as well and numerous mis-hits fell safely into the gaps.Maxwell's catchThe innings changed with du Plessis' dismissal. With 3.1 overs left South Africa had a score of 120 on offer. Du Plessis hammered Stanlake to deep midwicket. Very few fielders in the world could have saved six let alone completed the catch. Maxwell leapt high and took the catch at full stretch above his head while momentum carried him over the rope. He threw the ball up just before his left foot hit the ground over the rope, he balanced, got back inside the rope and made the end result look exceptionally simple despite the incredible degree of difficulty. Coulter-Nile and Andrew Tye then closed the innings brilliantly conceding just 24 runs from the last 18 balls and claiming three wickets with some well-executed slower balls.The old-fashioned yorkerLynn opened the innings in the shortened chase and held the key. He was missed fourth ball of the innings at deep square when Hendricks misjudged a catch that sailed over his head and landed inside the rope. Finch was tied down by some strategic straight bowling and was clean bowled by Ngidi. Short fell first ball picking out cover off Morris. But Lynn is capable of anything. Morris, in his first match of the tour, delivered the perfect yorker. It was fast and straight, tailing in a touch, it slid under Lynn's bat and crashed into middle. Australia slumped to 3 for 27 at the end of the Powerplay and never recovered. Morris was magnificent taking 2 for 12 from two overs with almost flawless execution throughout. Tabraiz Shamsi bowled very well claiming 1 for 12 from his two overs of left-arm wrist spin and earned the Man of the Match award. Maxwell tried in vain to chase the target down making 38 from 23 balls, which was remarkable in itself as he faced three consecutive dots from Morris while he struggled to keep his shape trying to clear the rope.A torrential downpour on the Gold Coast dampened the mood before South Africa inflicted Australia's third loss in four matchesSouth Africa will look to follow up their one-day series victory by taking the one-off T20 against an Australia side juggling resourcesSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}