{"id": "ESPNHeadaches aplenty for 'one-dimensional' AustraliaSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first TestPakistan players contract-less during Women's World T20'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussleN Srinivasan's 3am message to Dwayne Bravo: 'Please take the field''Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestPakistan players contract-less during Women's World T20BCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargeN Srinivasan's 3am message to Dwayne Bravo: 'Please take the field'Poonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upHeadaches aplenty for 'one-dimensional' Australia'Bully' Lynn vulnerable to pace - du PlessisABOUT COOKIES", "paragraph": "Australia's batsmen must change their style or the selectors must change personnel to fit the desired game plan. The captain Aaron Finch gave this frank assessment in the knowledge that the national team has only three ODI series left to form cohesive plans for next year's World Cup, with performances and changing tactics indicating that these are some distance from completion.Chris Lynn's power game is dangerous against medium pacers but South Africa's genuine speed had him covered, according to South Africa captain Faf du Plessis.\"I do feel he is going to give you a chance from a bowling point of view because he's an X-factor player who wants to go hard at the ball,\" du Plessis said. \"That creates an opportunity for us as a bowling attack to try and get him out. We've got a bit of pace in our attack so that helps. You can push him back.\"He looks like he's comfortable when the ball is a little bit slower and 130s, and he tries to bully that pace. The nice thing is we do have pace in our attack to make sure he doesn't get to free his arms consistently.\"Finch sounded a note of disappointment and some indecision after losing the decisive third match to South Africa in Hobart, having gambled on the hyper-aggressive pairing of himself and Chris Lynn at the top of the batting order in pursuit of 321 for victory only to see both openers dismissed cheaply by the new ball. Running his eye down a batting order that has now shuffled Glenn Maxwell as low as No. 7, Finch said that the Australian bent towards aggression had created a \"fairly one-dimensional\" collection of batsmen.Alongside the coach Justin Langer and the selectors Trevor Hohns and Greg Chappell, Finch said that either the selected group needed to become more adaptable to the demands of the 50-over game, or the selectors had to go in another direction. This calculation will be complicated by the fact the banned duo of David Warner and Steven Smith will return to eligibility in April, with the World Cup set to begin on May 30 in England.\"If you look at our line-up on paper at the moment you'd say it's an attacking side,\" Finch said. \"A fairly one-dimensional side in terms of attack, versus workers of the ball and your traditional batsmen. Not to disrespect any of the players by any stretch, but it's probably that way and we haven't got it right for a while.\"And that does expose you in the middle order at times when you come upon some different wickets or a really good attack who get on top of you early. We've got a bit over two months until the next one-day games against India, so that'll be a really good opportunity to sit down and reassess and start mapping out that process of how I and JL (Langer) and the leaders think we can be the most successful in this format.\"The side we've got at the moment is that way inclined, it's not necessarily the way we've been trying to play. So it's going to be a combination of both, we have to either adapt our game plan a little bit around the way the side is structured best, or we slightly change our personnel to fit a style we think can win. That's something that will come out over the next couple of months when we sit down and dig into it and find a way to get back on top of the world.\"Asked about England's high octane approach to the early overs of an innings, after which the likes of Joe Root and Eoin Morgan could either carry on the momentum or repair things after the loss of early wickets, Finch said that the more sedate early overs approach of India also needed to be considered in Australia's planning.\"That [England] is not the only way it's heading,\" he said. \"If you look at India, they're quite conservative in that first 10, really solid in that middle 30 overs where they rotate the strike and lose minimal wickets, then they load up at the back end. When they're chasing they're pretty clinical or have been in the last five or six years.\"There's two totally different ways to go about it, but they've both been ultra-successful in the last couple of years. I don't think it's all about going head on and smacking it, all-out attack, the way England play, but if you can mix and match, and find what best fits your batting seven, I think it'd be naive and ignorant to think every team can play like that, or every team can play like India. I think it's about finding out balance and finding what works best for us.\"Like the decision to take the new ball away from Mitchell Starc for the opening game of the series in Perth, the promotion of Lynn, who swapped places with Travis Head, was the result of lengthy talks between Finch and Langer. \"JL and I discussed it and slept on it to be honest,\" Finch said. \"We had a chat last night and went through it and were excited about it. We thought it was a really attacking move to try to take South Africa head on in that Powerplay, something we hadn't nailed in this three game series so far, and we wanted to fight fire with fire almost.\"It didn't pay off, but that's cricket. Some days it comes off and you get off to a flyer, that makes it a bit simpler down the line. I think it can be a long-term plan. It was an attacking option to put Chris at the top, change him and Travis. I think to put a couple of guys up there who can take it on and get off to a bit of a flyer is an attacking move. If I had my time again I'd still do it again, it just didn't come off for Chris or I.\"Chris, it was only his fourth game, so he's still relatively new to international cricket. He's been around domestic cricket and various tournaments for a long time, but international cricket he's probably still trying to find his feet a little bit and work out ... he knows what works best for him in the shortest format, T20, just about finding that balance at international level as well. The way he can turn a game, we saw it briefly in Adelaide when he flicked the switch against [Kagiso] Rabada for that over, yes he got out but he changed the momentum of the game totally. That's still definitely a thought going forward.\"By contrast, Finch was adamant that Maxwell was currently not deserving of any position higher than No. 7, from where he walked out to bat in Hobart with an enormous task to conclude the chase. An innings of 35 from 27 balls was handy, but not enough to either bridge the gap to South Africa's total or convince Finch that his fellow Victorian should bat any higher.\"If you look at Glenn's stats recently he probably hasn't made as many runs as he'd like as a pure batsman, so therefore for him to be in the side and as an allrounder he's probably batting in that No. 7 spot,\" Finch said. \"With guys playing reasonably well around him, [Marcus] Stoinis played really well at No. 5 today, Alex [Carey] at five and six he played excellent, so I think Maxy would've liked some more runs and obviously wants to bat higher.\"But the reality is he's in the side as a bit of an allrounder, but he hasn't scored as many runs as he needed to in one-day cricket over the last little while to probably justify taking up a top four spot. That's just reality. We're all under pressure when we lose, no doubt about that. Between the batting line-up not having got it right for a little while now, there's going to be some questions asked, whether its Maxy, Lynny, Heady, myself, Stoin, there's going to be questions asked of all of us. It's important we start to really nut down the balance of the side and get that right.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}