{"id": "ESPNBen Foakes set to retain gloves despite Jonny Bairstow's return to trainingSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upBen Foakes set to retain gloves despite Jonny Bairstow's return to trainingABOUT COOKIES", "paragraph": "Wicketkeeper takes part in football practice, but only as referee, as Jos Buttler prepares for No. 3 (1:21)England declined to name their team for the second Test on Monday but, for anyone watching training, the answers were there.While Ben Foakes practised his keeping, for example, Jonny Bairstow practised his catching in the outfield. And, along from Foakes in the cordon, was Jos Buttler at third slip.It's hard to reach any conclusion other than Foakes will retain the gloves for Kandy. And, after that debut in Galle, anything else would be a bit silly, really.England declined to say who would bat at No. 3, either. But the evidence suggests that it will be Buttler. While the other serious candidate - Ben Stokes - may have a large bowling workload, Buttler is now in the team as a specialist batsman. Moeen Ali and Stokes are therefore likely to bat at No. 5 and No. 6.So, is this a 'horses for courses' choice? Or is it reflective of England's enduring inability to find a replacement for Jonathan Trott at his best?A bit of both probably. Only a few months ago, Buttler was recalled to the team with a specific brief to bat with freedom at No. 7. He has been promoted now at least as much due to the failures of other candidates - a list that could include Moeen, Joe Root and, at a push Joe Denly (who was pencilled in for the role but failed a couple of times in the warm-up games) - as any particular aptitude he has shown for a role in the top-order. He may, after all, have to curb that freedom for which he is celebrated just a little if he comes in against a swinging new ball.Having said that, Buttler does appear to have settled into his Test career (he has scored a century and two half-centuries in his last four Tests) and is a fine player of spin. There's no reason he could not make the move work for the rest of the winter. Whether it is a ploy that could be used in the Ashes seems somewhat more debatable.There is a sensitive dynamic here, though. Having played much of his career as an all-rounder, Buttler has always had a certain freedom to his game. A sense that, if he fails in one discipline, he can compensate in the other. And, as a result, a sense of relaxation in both. Knowing he is no longer likely to keep - he may now be third choice when everyone is fit on this tour - and that he is expected to bat a little more responsibly at No. 3 does present something of a new challenge to him. And it would be a shame to curb the qualities for which he was selected.Much the same could be said of Bairstow. He looked fit in training. But, partially because he only refereed in the football warm-ups, the suspicion remains that his ankle may not be fully healed and that he may not be risked this week. That might also avoid a selection headache.But Bairstow requires a bit of support right now. He is a fine player, especially with the bat, and has worked exceptionally hard to improve out of all recognition as a keeper. But he also appears to be slightly more sensitive than some. He was discombobulated in the English summer when there was talk of him losing the gloves and he was discombobulated even more by talk of playing him out of position. On both occasions, the talk seemed a bit unnecessary.It's all very well saying - as Trevor Bayliss did quite reasonably a day or two ago - that players have to accept the competition that comes with the territory. And few could doubt that Foakes is simply better at keeping than either Buttler or Bairstow. But most players (people, even) perform at their best when they feel valued, supported and secure. Bairstow has been a very fine player for England for a few years now; it would be a shame if his effectiveness were to be compromised by any sense that he feels threatened or insecure now.If you doubt the importance of such issues, think back to the careers of Mark Ramprakash and Graeme Hick. They were, arguably, as talented a duo as England have had available in the last 50 years or so. But neither fulfilled that ability - at Test level, at least - partially because of the poor management to which they were subjected. Dropped, recalled and dropped more than 10 times apiece, they rarely played with the freedom or confidence for which they were known at county level.The England management these days is wiser. But if Bairstow is to be left out of this side, it would be helpful if he understood - and bought into - the decision. There's no reason he shouldn't have the best years of his career ahead of him, but the knowledge that he has lost the gloves - after all that time fighting to justify them - will take some adjustment.England could still make a change to their side, though. Before they arrived in Kandy, there was a thought they could play an extra seamer in place of one of the spinners; probably Adil Rashid. Stuart Broad is one option to come into the side on a surface expected to offer a little more pace, though Chris Woakes - who missed training on Monday due to illness but will be present on Tuesday - might be preferred due to his batting ability.The rains have abated a little in recent days, however, and the pitch already looks pretty dry. It would be no surprise if England went into the game with an unchanged XI.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}