{"id": "ESPNSri Lanka's cricket legacy is glorious, but what does the future hold?Sense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upSri Lanka's cricket legacy is glorious, but what does the future hold?ABOUT COOKIES", "paragraph": "The first two Sri Lankan cricketers to catch this observer's eye were Roy Dias and Duleep Mendis. Dias, slim and elegant at the crease, played the game in beautifully straight lines and had a hand in important moments during Sri Lanka's early days at the top table, most especially against Pakistan and India. Mendis was a bull of a fellow on first look but the most genial of cricketers, whose explosive strokeplay at Lord's in 1984 won him many a heart. It was for the Indians, however, that he reserved his very best cricket, making hundreds in both innings of the 1982 Madras Test and then leading his country to a famous series win in 1985 with a match-saving hundred in the final Test at the Asgiriya Stadium in Kandy. It is close to impossible to describe how much this meant to his people. It was more than a victory for cricketers; it was a victory for character and for relevance - a precursor to the days when Arjuna Ranatunga would bow before no one in the pursuit of his country's place in the world order.By the time England B arrived on Sri Lanka's shores in 1986, cricket was on the lips of Sri Lankan people to the north, the south, the east and the west. Though the civil war prevented us playing in the furthest corners, the fact that the game mattered so was hugely rewarding. We came with good players - Derek Randall, Bill Athey, Chris Smith, Steve Rhodes, Derek Pringle, Nick Cook, Norman Cowans and Jonathan Agnew amongst them - and held our own in the unofficial Test matches before being pounded in the one-day internationals.Alongside older sweats such as Sidath Wettimuny and Ranjan Madugalle, the two who made the most impression were Ranatunga and Aravinda de Silva. It was immediately obvious that Arjuna was a force of nature, leading the side as he did with edge and a sharp wit. It was as if cricket had crawled under his skin to become the essential part of his DNA. He gave nothing and expected nothing back; he was deliberately confrontational and often pushed boundaries, but we had the utmost respect for his devotion to the cause and a quite overwhelming determination to carry it through. He batted with an old head on young shoulders and bowled tidy medium-pacers with an attitude more Lillee than gentle loper. Fielding, however, was an irritant to him.Aravinda had a pure talent, moving as quickly into position to play his strokes as anyone we had seen. He played marvellous shots off the back foot, picking spots to score from balls that others would defend from the front foot. Of course he timed these strokes like a dream and had the capacity to play the innings that mattered with freedom and a formidable strength of mind.Ravi Ratnayeke and Rumesh Ratnayake, not related, bowled with firebrand spirit; one, Ravi, a deck-hitter; the other, Rumesh, a fast, slightly slingy outswing bowler whose good days and bad could be pulled from a hat. There was Vinothen John, Ashantha de Mel, Asanka Gurusinha, Roshan Mahanama and other names that won fame and respect in the corridors of the game. Even Dias appeared for a \"Test\" to lead the younger tyros, while Ranatunga brooded in waiting. To tour this fabulous island was both an honour and an experience like few others. The clear and present message was that Sri Lankan cricket was on the move.It was ten years before I was back, this time as writer and broadcaster, and a long friendship with Ranatunga had formed. It was in Colombo, over splendid dinners, that he told me how his team could - would, he said - win the 1996 World Cup. It was a tournament troubled by controversy, not least when Australia and West Indies refused to play in Sri Lanka after the Central Bank bombing by the Tamil Tigers. Sri Lanka were awarded those matches on forfeit and therefore automatically qualified for the knockout stages.At that point, said Arjuna, his main rivals were seeing red upon any sighting of Sri Lankan royal blue. He talked about using Sanath Jayasuriya and Romesh Kaluwitharana as assault weapons on everyone else's new ball, an experiment that had been tried in Australia during the previous winter to occasional effect and otherwise uncertain conclusion. But on the flat, slow pitches of the subcontinent, Arjuna pointed out that most opening batsmen would be content to see off the new ball and then make hay, while his plan was to make hay before anyone was looking. At a time when 50 to 60 in the first 15 overs was considered par, Jayasuriya and Kaluwitharana with their portfolio of opening partnerships changed the way one-day innings were constructed.Arjuna also convinced his batting line-up to be flexible, sometimes promoting Mahanama to No. 3 and demoting Gurusinha to the lower deck. He played tiki-taka himself, rotating the strike with cheek and impunity, while developing angles that even Javed Miandad might not have explored. He had Aravinda in supreme nick at four, and perhaps above all, he had Muttiah Muralitharan, the most talked-about bowler on the planet.Murali's action blew fuses in opposition heads: with it came accuracy and mystery - a deadly combo on the dusty pitches prepared at home and most surfaces in Pakistan and India too. England were slam-dunked in the quarter-final; India in the Eden Gardens semi when Clive Lloyd, the match referee, awarded the game to Sri Lanka after crowd rioting suspended play with the match all but done and dusted in Sri Lanka's favour anyway. The four Sri Lankan spinners squeezed the life out of Sachin Tendulkar and Co, delivering 23 of the 34 overs bowled and creating a template for taking the pace off the ball in one-day cricket.Arjuna got the final he most wanted, the chance for his boys to outwit Australia - the nation he collectively blamed for the global witch hunt against Murali. He sent Mark Taylor's team into bat, thus subjecting them to field on the Gaddafi Stadium's dewy evening outfield in Lahore, which made gripping the ball especially difficult for Shane Warne. The same four spinners - Murali, Kumar Dharmasena, Aravinda and Jayasuriya - bowled all but 13 of Sri Lanka's 50 overs and the target of 242 to win the Cup was achieved with Aravinda and Arjuna at the wicket together, unbeaten on 107 and 47 respectively. The joy was unbridled. David had slain Goliath and all but those in the Great Southern Land cheered from rooftops.The third, and last time, I was in Sri Lanka before now, Arjuna had finished with playing cricket and was floating around both the sporting world and real world of politics. He was feisty as ever, banging the drum for Murali loudly as he had ever done and hammering away at ineffective, nay incompetent, administration. On the field, bright young things caught the eye: Mahela Jayawardene and Kumar Sangakkara first among them; Chaminda Vaas, Tillakaratne Dilshan and Marvan Atapattu a length or two behind.Mahela was a delight to watch, for he made batting appear so easy - almost misty, as if he were on cine film in a golden age long consigned to the history books. Kumar was less deft but somehow even more substantial, a man born to read high literature and fight in the street on the same day. A way to categorise their achievements is to say that around them were some batsmen who stand in the pantheon of the game - Tendulkar and Rahul Dravid, Ricky Ponting and Matthew Hayden, Brian Lara, Jacques Kallis and AB de Villiers among them - but the two Sri Lankans did not wilt or pale, rather they excelled to ensure that their country remained at the forefront of the game's attention and appreciation.Now I sit in Kandy wondering what will happen next to Sri Lankan cricket. The present one-day team is neither a good one nor an especially promising one. The Test team relies greatly on a 40-year old left-arm spinner, Rangana Herath, but recently beat South Africa by a distance, so must be taken seriously. The newspapers are full of Sanath Jayasuriya again, but for the wrong, and perhaps hugely damaging, reasons. The general view is that this story must out because rumours have lingered to the point of accusation for too long. These are heart-breaking stories to report, neither investigated as yet and far from proven. But they are stories all the same.Goodness knows how they affect the current players, already under the cosh as they are from England's mighty one-day team. By most accounts, the administration of the game here is in a dark place and itself under suspicion. For too long now, the people at the head of Sri Lankan cricket have failed a nation that deserves so much better.Another beautiful island, and one even smaller than this, Barbados, has lost something of its once irrepressible cricketing mojo. The game was played on the beaches, in the parks, on the streets and at the clubs as a way of life but is now neither so visible nor so loved. Sri Lanka maintains the love affair but love is fragile and needs both nourishment and preservation. Let the dating begin.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}