{"id": "ESPNMitchell Marsh left with mountain to climb against QueenslandMatch CoverageBetting OddsPresented ByBet365Sheffield ShieldABOUT COOKIES", "paragraph": "Queensland 9 for 488 dec (Renshaw 89, Peirson 82*, Hemphrey 72, Neser 56, Kelly 3-80) lead Western Australia 5 for 159 (Marsh 64*, Turner 48) by 329 runsAn excellent 115-run seventh-wicket partnership between Jimmy Peirson and Michael Neser and key wickets late in the day put Queensland in command of the clash with Western Australian in Brisbane.Having contained the Bulls to 4 for 269 on day one the Warriors were able to remove Charlie Hemphrey (72) and Jack Wildermuth (42) on the second morning to expose the tail.But Peirson and Neser put together a blistering rearguard scoring 115 in just 21.5 overs to swing the game violently in the Bulls favour. Both men reached half-centuries. Neser made 56 while Peirson went on to 82 not out from just 106 balls before the declaration at 9 for 448.Neser made the early breakthrough with the ball with Josh Philippe bowled via an inside edge playing away from his body. Hilton Cartwright was caught at cover failing to keep his drive down before Jonathan Wells was adjudged lbw to a ball that nipped back from Mark Steketee to reduce the visitors to 3 for 42.The WA captain Mitchell Marsh and vice-captain Ashton Turner pulled the team out of the mire with a 112-run stand for the fourth wicket and looked likely to get to stumps safely. Marsh reached an important half-century to gain some confidence following a tough Test series against Pakistan in the UAE.But Turner fell two short of 50, and just three overs before stumps, slicing a drive straight to cover-point. The night-watchman David Moody was then caught at short leg off Mitchell Swepson in the next over leaving Marsh - 64 not out from 125 balls - with much work to do early on day three.The surface at Allan Border Field proved far too good to produce a result as batsmen filled their boots throughoutWill Bosisto batted throughout the third day at Allan Border Field for a career-best 132* as Western Australia moved into the leadThe Western Australia captain scored an unbeaten half-century to gain some confidence back after a poor series against Pakistan, but his team is in deep troubleQueensland enjoyed a solid opening day against Western Australia with Charlie Hemphrey continuing his good formSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}