{"id": "ESPNHope ties game against India with last-ball boundaryMatch CoverageVideosBetting OddsPresented ByBet365ABOUT COOKIES", "paragraph": "India 321 for 6 (Kohli 157*, Rayudu 73) tied with West Indies 321 for 7 (Hope 123*, Hetmyer 94, Kuldeep 3-67)The Indian captain took 54 innings fewer than Sachin Tendulkar to get there in ODIsThis will hurt more than their three previous one-sided defeats. Shimron Hetmyer's sensational hitting and Shai Hope's near run-a-ball unbeaten hundred brought West Indies awfully close to their highest successful chase in ODIs, but they contrived to somehow fall behind and then hit a last-ball four to come away with a tie. When they lost Rovman Powell in the 38th over, West Indies needed just 69 at well under a-run-a-ball, but somehow failed to punish a spate of full tosses bowled with the wet ball and needed 14 off the last over.Relieved was Virat Kohli, who had earlier almost single-handedly carried India to 321 with a century that took him past 10,000 ODI runs in record time. However, he will also be revisiting his decision at the toss, batting first despite knowing the dew in the evening would restrict their three spinners significantly. Kohli scored 157 of the 281 runs that came when he was at the wicket.The final flourish from Kohli - 48 off the last 17 balls he faced - seemed bonus runs given the slow nature of the pitch, but soon it was apparent that India needed every last one of those. In typical scenes at an Indian ground, mild applause drowned in deafening funereal silence as Hetmyer first and Hope later stunned India in dewy conditions. It is usually hard to hear yourself think at an Indian ground except when India are at receiving end of an onslaught by a visiting batsman. Hetmyer seemed like he wanted to find out how quiet Vizag can be. He hit seven sixes in his 64-ball 94, got out trying to hit an eighth, but the more subdued Hope stayed back to make sure West Indies remained the favourites till the end.The ball was wet, it skidded off the pitch, and spin was meat and drink for Hetmyer. Before that, Kuldeep had shown his party tricks to reduce West Indies to 78 for 3. Stock ball, stock ball, wrong'un, and it was enough to send back Chandrapul Hemraj and Marlon Samuels. But now the dew began to have an effect, and Hetmyer amplified it by putting the spinners under extreme pressure. All his seven sixes came against spin and into the leg side. Eventually Yuzvendra Chahal managed to start a long hop so wide that pulling instead of cutting proved to be a fatal error. Still, that partnership of 143 in under 20 overs had put West Indies well on their way.Hope and Rovman continued to bat sensibly, happy with the odd boundary, keeping the asking rate under a-run-a-ball. Kuldeep, though, returned to get Rovman with another wrong'un, a panicked attempt to keep the ball out after reading it off the surface. India had no choice at that time but to have a slip in, where Rohit Sharma completed a sitter.Jason Holder and Hope then batted cautiously - some might say too cautiously - to see through the spin threat. The asking rate gradually began to go up as India got in a spell of 50 balls without a boundary. With 52 required off 39, Hope broke the shackles, hitting Kuldeep for a six over wide long-on, and just like that the game was back in West Indies' control. When Hope brought up his hundred, West Indies needed just 34 off 29, but then came an Umesh Yadav over where Hope hit one plum half-volley and two even juicier full tosses straight to the infielders.Panic only set in next over when he sold Holder down the river although Holder will be the first one to admit he could have done better than 12 off 23 at that stage. West Indies should still have finished the game off with 22 required off 16, but Mohammed Shami bowled a fantastic 49th over to leave Umesh 13 to defend in the last.Umesh began well with yorkers, was unlucky in conceding four leg-byes, but when he erred big time with a full toss, Ashley Nurse had already premeditated a ramp shot. The ball was wide so Nurse's only option now was a reverse ramp, and India's third man was fine to complete the catch. Seven runs were now required off two balls. Hope dug the first one - a yorker - out for two, and could get only four off a wide half-volley last ball.India players wore the look of a side that had dodged a bullet. They had banked on the pitch deteriorating in its due course even if the dew affected the outfield, but were surprised by how good it was to bat on in the evening. They should know. When they were batting, West Indies went to spin as early as the Powerplay, and drew instant results too. Nurse removed Shikhar Dhawan to reduce India to 40 for 2 in the ninth over.It was here that Kohli and the newly crowned No. 4 Ambati Rayudu added 139 for the third wicket. While Kohli took one early risk before settling into an efficient typical Kohli innings, Rayudu kept driving between mid-off and cover, hitting five of his eight boundaries in that zone. Rayudu did take the extra risks, though, and that got him out in the 70s.Kohli continued to bat the way he does even as both MS Dhoni and Rishabh Pant - incumbent and successor - failed to convert their good starts. Only 69 came in those 67 balls that Dhoni and Pant were at the wicket. However, in the company of Dhoni, a captain Kohli reveres, he took that single to reach 10,000 runs in 54 innings fewer than the previous record, held by Sachin Tendulkar, a batsman Kohli reveres.However, it was his hitting in the end, having exhausted himself running 62 of the first 102 runs he scored in the humidity of India's east coast, that Kohli made the vital difference to the game. All four of his sixes came in the last four overs as he showed he can hit the big ones too but chooses not to in the earlier parts of his innings. This is a spell of play that Holder will look back with regret at: he had dropped Kohli on 44, running back from mid-off after debutant Obed McCoy had done Kohli in with a back-of-the-hand slower ball.Both players have games tailor-made for the modern-day ODI bash, but should feed off lessons from each other's approachThe India captain was reprieved on 44 and couldn't find the boundary regularly, but he still overcame them to tick off the landmarkThis was the ninth time India were involved in a tied ODI and the tenth such occasion for West IndiesVirat Kohli smashed records on reaching 10,000 ODI runs. Here's how the cricketing fraternity reacted on social mediaWhile the raw stats indicate Kohli is ahead on all the key parameters, a comparison based on the norm for each era reveals something slightly differentSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}