{"id": "ESPN'Father figure' Holder wants WI to target 300-plus scoresSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first TestPakistan players contract-less during Women's World T20'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussleN Srinivasan's 3am message to Dwayne Bravo: 'Please take the field''Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestPakistan players contract-less during Women's World T20BCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargeN Srinivasan's 3am message to Dwayne Bravo: 'Please take the field'Poonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-up'Father figure' Holder wants WI to target 300-plus scoresNobody's given us a chance. That's incentive for us - LawABOUT COOKIES", "paragraph": "Jason Holder talks about the young West Indies side and the need to consistently score 300-plus scores in ODIs (1:31)It's time for another West Indies series, and that means, once again, it's time for Jason Holder and the team's leadership to try and achieve results in the face of forced changes. While opener Evin Lewis' withdrawal from the limited-overs leg of the India tour for personal reasons isn't in the same vein as some of the more controversial pulling outs West Indies have seen in recent years, it is a massive setback for a squad that contains nine players who have played fewer than 20 ODIs.Although the West Indies squad is inexperienced, the head coach Stuart Law insisted that they had more than enough talent to surprise their doubters.\"[This series] is all about opportunity. These kids have been identified throughout T20 tournaments and domestic cricket back home,\" he said. \"So they're really green. But sometimes the greener you are, the less fear you have. You don't know the unknown. I notice in the press that everyone's given us absolutely no chance to win a game. That's incentive for us. It's great for us to also have no expectations from the media and the public. We're supposed to get our backsides handed to us but it's great motivation for us to show that we're not just here to make up the numbers.\"\"It's hard to lose a player who has been around and has some success in the particular format we're playing in. No doubt, it's tough,\" Holder said. \"You obviously set your plans and you formulate your plans around the composition you would have selected. [To have someone pull out at] such a late time is tough.\"I've got to only cope with what I can, I've got to control what I can. I've been given a task to marshal the troops that we have here. Know that I'll be going out on the field trying to give my best with the side. For me, it's just leading from the front and leading by example with my own personal performances. We've set up roles for everyone, so everyone can carry out their roles and make the team's success a lot easier.\"Holder has been on a steep rise over the last 18 months or so, particularly in Tests, where along with a vast improvement in his all-round skills, he has led West Indies to six wins alongside coach Stuart Law. He has emerged with a reputation of being an up-and-coming young leader of a young team, but that is far from the case behind the scenes.\"Funnily enough, I'm staring down the barrel of my 27th birthday next month,\" Holder said. \"I've been around for a little, but I'm relatively still young as well. I'm playing the father figure role, trying to mentor and nourish the young talent we have. It's enjoyable for me. I like things like this. I love challenges. The talent we have in the Caribbean is something that really excites me.\"\"You see young people like Fabian Allen who has come into this team or [Obed] McCoy... he's done really well for us in domestic cricket, so we've got good talent here. This is the future for West Indies cricket. Obviously for anyone coming into international cricket, there's a bit of nerves and pressure trying to solidify yourself into the side. Hopefully, those guys can put that aside and channel the nervous energy in the right direction.\"That direction is next year's World Cup, for which West Indies qualified with some difficulty earlier this year. And there are spots to be filled. Before pulling out of the tour, Lewis rejected a contract with Cricket West Indies; Chris Gayle, who was part of the team that played in the qualifiers, has been told that he won't have an automatic place in the World Cup squad, and Andre Russell has been battling his own hamstrings, which are currently incapable of getting him through 50-overs cricket. With that reality, West Indies and their plethora of youngsters have 13 ODI matches between now and the World Cup to emerge as a settled team. And there are specific challenges they are looking to overcome.\"Consistency is one of the main things we need to look at,\" Holder said. \"Particularly in our batting. We haven't really been able to get consistent scores in excess of 300. A lot of times you've got to be able to set your benchmark around 300 or 320. That's one area that our batters really need to look at. We've spoken about it in our dressing room and we need be to hitting that mark more often than not and be consistently doing it.\"It's a big test to play against India in India. This gives us a really good gauge to see where we're at. This team is fairly competent in terms of one-day cricket. We had a really good time in the World Cup qualifiers, which was a challenge you know, playing in Zimbabwe - turning tracks playing against opponents you know very little about. That was a challenge in itself and we had a Test series against Bangladesh, one we felt we should have done a lot better in but we weren't able to clinch it with confidence. So, all to play for here. Again, it's another opportunity for players. No doubt it'll be very competitive in terms of selection.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}