{"id": "ESPNSarfraz should be relieved of Test captaincy - Mohsin KhanSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upSarfraz should be relieved of Test captaincy - Mohsin KhanABOUT COOKIES", "paragraph": "Mohsin Khan, freshly installed as the head of the PCB's new cricket committee, wants Sarfraz Ahmed to be relieved of the Test captaincy, a suggestion that will do little to calm an already turbulent start to the committee's existence. It is also a suggestion that the board chairman Ehsan Mani has shot down.Announced publicly only on Friday, Mohsin's appointment had the PCB apparently distancing itself from the Justice Qayyum report on match-fixing, in a bid to convince him to work with Wasim Akram. Misbah-ul-Haq and former women's captain Urooj Mumtaz are the other members of the committee.It then emerged that only a week before the committee was formed, Mohsin had called Mickey Arthur a \"stupid donkey\" on a show on Bol TV, an assessment that could presumably make the three meetings in a year the committee will have with the coach a little awkward.On that same show, Mohsin had first aired the opinion that Sarfraz should not be Test captain, an opinion he remained true to when talking to Hum News on Tuesday evening.\"I have said it before and I will say it now too,\" Mohsin, who is associated with the channel as an expert, said \"with Sarfraz I was saying you got a new guy in, don't put the burden of three formats on him. It will take such a physical load on him, T20s, ODIs and then Tests if he is captain he will not get any mental relaxation.\"I had said make him T20 and ODI captain and in Tests, put in a senior player for a year, year-and-a-half which will give him [Sarfraz] time, allow him to relax and groom himself as a leader, to get some confidence.\"Mohsin pointed to Pakistan's haggard performances in the Asia Cup, which appeared to have taken a toll on Sarfraz.\"Sarfraz's body language was so down. I felt sorry for him that he's had so much pressure put on him, with T20s, ODIs and Tests. There's no doubt he is so talented and it's not as if he is 35-36. He is young, he has a lot of time. That was my view before and it is now as well.\"It is a more sympathetic take than it may come across as; the burdens of captaincy in every format have weighed heavily on Sarfraz, who until recently was in the midst of a poor run with the bat as well as in uncertain form with the gloves.But the timing of his remarks will raise eyebrows. Sarfraz has just led Pakistan to a Test series win against Australia - where he finally managed some big scores - and then oversaw a resounding 3-0 whitewash in the T20I series. That result, incidentally, has been sidelined by the news the cricket committee has been making.Mohsin and the committee do not have the power to remove Sarfraz from the Test captaincy, only to make a recommendation to Mani, the chairman. And that is something Mohsin will be doing.\"Yes, absolutely,\" he said. \"I have spoken to Ehsan Mani, the final decision will of course be his but I will give him the suggestion. Whatever suggestions I give, it will not be out of personal interest. I will only suggest those things that will help make Pakistan better on or off the field.\"This New Zealand series, it has Tests, ODIs and T20s, it will give us a better picture of how much mentally stronger Sarfraz has become. I will repeat - I only say this because he is still young and he doesn't need this much pressure on him. He needs some relief time because wicketkeeping itself is such a difficult job.\"Mani will not be taking that suggestion on.\"I have full faith in Sarfraz as Pakistan captain,\" Mani told ESPNcricinfo. \"He is the Pakistan captain, that is completely unambiguous. He is the Pakistan captain today, there is no other consideration or thought in anyone's mind. He has the absolute support of the board.\"Mohsin's comments, no matter the nuance, are unlikely to enamour him to Sarfraz, which means he will have managed to annoy both coach and captain less than a week into his job. Arthur has been understandably unimpressed by Mohsin's remarks about him, and is believed to have asked for an apology. That has left the PCB scrambling to find a way for the pair to move on from this, with a first meeting between the two likely to be in front of Mani.On Tuesday, the board was forced to clarify their stance on the Qayyum report, insisting that the \"work of Justice Qayyum is acknowledged and appreciated by PCB and there is no truth in the perception… that the report has been dismissed by the PCB.\"In the same statement, the board added that it \"maintains a zero-tolerance policy on corruption.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}