{"id": "ESPNChris Tremain skittles Tasmania for 81Match CoverageBetting OddsPresented ByBet365Sheffield ShieldABOUT COOKIES", "paragraph": "Victoria  5 for 148 (White 63) lead Tasmania 81 (Tremain 5-13) by 67 runsChris Tremain's third five-wicket haul of the Sheffield Shield season helped Victoria dismantle Tasmania on day one of the clash at Bellerive in Hobart.After being sent in to bat by Victorian captain Peter Handscomb, the Tigers were bowled out for 81 in just 29.5 overs.Tremain picked up three of the first four wickets of the innings trapping Alex Doolan in front, getting Jordan Silk caught at point with a sliced drive and finding Beau Webster's outside edge to leave the home side 4 for 34.James Pattinson and Scott Boland also got in on the act. Pattinson picked up three scalps of his own in a brisk five-over spell while Boland claimed Jake Doran and the crucial scalp of Matthew Wade.Tremain returned to claim the last two wickets of the innings including Australia's Test captain Tim Paine.Victoria were in early trouble at 2 for 21 in reply after Travis Dean was run out and Handscomb nicked a superb delivery from Gurinder Sandhu. Marcus Harris failed to capitalise on a start edging an attempted cut off Riley Meredith.Cameron White steadied with a calming half-century. His patient 63 from 121 balls featured just five boundaries but put Victoria in control. He got good support from Seb Gotch who remained 23 not out at close and will look to build a significant lead early on day two with the help of Victoria's lower order.Victoria had a handy lead by the close thanks to a calm half-century by Cameron WhiteSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}