{"id": "ESPN'We need four or five batters to rock up' - van NiekerkSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-up'We need four or five batters to rock up' - van NiekerkABOUT COOKIES", "paragraph": "If there is one team you could pick as a dark horse for a run to the final in the Women's World T20, South Africa would have to be it. They are an electric team when it all clicks, but they are also as inconsistent as they are exciting.In the last two years, they have been knocked out of one world tournament in the group stage (2016 World T20) and come within touching distance of the final in another (2017 World Cup). They have conceded world record totals, and set records of their own. They have been all over the world, playing far more than any other team, and their preparation for the World T20 involved holding the reigning world champions West Indies to a 2-2 draw in the Caribbean.\"I think I've said it 100 times: we can beat anyone in the world, it just depends on what we do on the day,\" captain Dane van Niekerk said on the eve of the team's departure for the Caribbean. \"In the recent past we haven't been a consistent unit, and that's been our downfall. Somewhere it needs to click, and hopefully it will in a big tournament like a World Cup.\"Everything seemed to be coming together for South Africa during the tail end of their limited-overs series against West Indies earlier this month. They recovered from a couple of limp batting performances that left them 0-2 down to win the fourth T20I by eight wickets before squaring the series with a thrilling three-wicket win with a ball to spare. When the top order makes runs, they look a different team.\"It was a great learning curve going to the West Indies and playing the defending champions,\" van Niekerk said. \"Our top order needs to fire. In the last three tours, we've only had two batters that rocked up. We need four or five batters to rock up and do really well for us. In the last two weeks that we've been home, a lot of our batters have had time for some introspection, and they're ready to go for the World Cup.\"Coach Hilton Moreeng echoed van Niekerk's call for consistency, especially with the bat. Whether or not Lizelle Lee and Laura Wolvaardt are off to get South Africa to rapid starts at the World T20 will be vital in conditions that will allow the spinners to control the middle overs of the game.\"The Powerplay is going to be key,\" Moreeng said. \"We've got two subcontinent teams in the group and in those kinds of conditions, they'll have three to five spinners in the team. We need to counter that with the bat. With the hard ball up front, we need to capitalise, because it can get very difficult in the middle period. For us, as a batting unit we need to work on our consistency. One of the top three needs to bat as deep as they can to give us a chance on the day.\"South Africa are in Group A, alongside England, West Indies, Sri Lanka and Bangladesh, and their games will be played at the Guyana National Stadium in Providence, the Darren Sammy Cricket Ground in Gros Islet, and the Sir Vivian Richards Stadium in North Sound, Antigua. Van Niekerk insisted that there would be no easy games in the group.\"A big tournament like this, and it being T20 cricket, it brings all the teams closer,\" she said. \"We're not going to take anyone lightly. We know what Sri Lanka can bring: one of their top batters scored 170 against Australia in a World Cup. They have world-class players in their side. And Bangladesh, we had a really good series against them at home but like Hilton said, the conditions there suit the subcontinent teams a little more and we know they have a lot of spinners and talented players.\"While van Niekerk is hoping for a little more consistency from her batsmen, she believes that it could be the team with the best bowling attack that ultimately lifts the trophy. \"I made the, I guess, brave comment that the best bowling team in the Caribbean is going to win the World Cup,\" she said. \"I just find that the batting conditions in general in women's cricket with four out and small boundaries, batting is a bit easier. So that's the main thing that we're going to focus on: our bowling and just getting our plans 100%.\"Moreeng agreed with her: \"The captain was spot on. The best bowling team needs to be backed up by good fielding.\"South Africa have unfortunately lost one of their bowlers before the tournament even begins, offspinner Raisibe Ntozakhe having been suspended for an illegal bowling action, but they will also be bolstered by the return of Shabnim Ismail for the World T20. Fast bowler Ismail is South Africa's leading wicket-taker in T20Is, with 72 dismissals in 69 matches, while both Marizanne Kapp and van Niekerk have 49 wickets each in the format.\"Going into the World Cup, there's ten teams going there with the same intent: to win,\" Moreeng said . \"So we need to stay focused on us as a team. If we can apply the basics better than our opposition, on that day we believe we've got an opportunity to do it. Everyone has realised what needs to happen, and they're hungry for it. We believe at the end of the day that the team that wants it more is going to win. And we're working hard to be that team.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}