{"id": "ESPNThe runners and riders in the race to be the England team directorSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upThe runners and riders in the race to be the England team directorABOUT COOKIES", "paragraph": "With a remit to restructure Loughborough and appoint a new coaching team to the senior England side by October 2019, the successor to Andrew Strauss as managing director - England cricket, will have plenty on their plate. George Dobell assesses the likely candidates.Age: 45\n Hugely experienced - and successful - as a player, coach and now director of cricket, Giles is all but certain to be short-listed for the job. An Ashes winner (in 2005), he became an England selector in 2008 and made his name as a coach in turning a shambolic Warwickshire into county champions in 2012. As head coach of the limited-overs team, he then took England to within an ace of their first global ODI trophy (the Champions Trophy of 2013) before falling victim to the clear-out at the end of the 2013-14 Ashes debacle. Moving on to Lancashire, he oversaw their Championship promotion and T20 Blast success in his first season before returning to Warwickshire at the end of 2016. With a masters degree in sporting directorship and experience as a board member of England Netball, he is probably the favourite for the role.Age: 47\n Believed to be the first British-born Muslim of Pakistan heritage to play county cricket, Wasim was a member of the Warwickshire side that won the double in 1995. Made CEO of the Cricket Foundation in 2009, he played a huge role in the growth and expansion of Chance to Shine. Taking on a fiendishly tough task at Leicestershire in 2015, he rapidly improved fortunes off the pitch and, eventually, saw something of a resurgence in their on-field results. Well connected and respected, he sits (or has sat) on the Equality & Human Rights Commission Sports Group, The Prince's Trust Cricket Group, the board of Sport England and was recently named in the Parliamentary Review Muslim 100 Power List. Understood to be in demand for several roles, it seems unlikely Leicestershire will be able to retain him.Age: 55\n An outsider for this role simply on the grounds that it seems unlikely he can be lured away from what he has always described as \"the best job in the world\" at Surrey. That seems a shame as, in turning Surrey into County Champions with a largely home-grown squad of England-qualified talent, Stewart has done an excellent job. Vastly experienced as a player, his calm but no nonsense approach may prove just what's required in rationalising the money-pit that Loughborough has become. Unlikely to apply.Age: 42\n If she applied, she would be another very strong candidate. Having enjoyed a hugely successful career as a player - including leading England to the women's Ashes for the first time in 42 years - Connor has overseen the rapid development in the women's game as an administrator at both the ECB and ICC, and her role as director of women's cricket pretty much mirrors the job Strauss has fulfilled over the last few years. But, having spent half her life championing women's cricket, she may well be reluctant to move away from it just as it starts to flourish. After all, in the long term, there is no reason the men's job should be seen as bigger or more prestigious than the women's job. As a result, she seems unlikely to apply.Age: 50\n If Flower applies - he says he has not yet decided whether to do so - he would be a strong candidate. Effectively the man in possession, given that he took temporary charge when Strauss first went absent and will remain in the role until a permanent candidate is appointed, he has held many of the senior off-field coaching roles in English cricket and knows the system's strengths and weaknesses better than anyone. A hugely successful head coach - it ended badly but Flower played a huge role in taking England to No. 1 in the world and a World T20 title - he also knows what is required. It may be telling that Flower unsuccessfully interviewed for the role of National Selector, however, and the vague sense remains that the ECB may want to go in another direction. If Giles' Warwickshire job becomes available, however, Flower may well come into contention for it.Age: 53\n He may be lower-profile than others on this list but Newell's CV would render him another strong candidate if - as expected - he decides to apply. Nottinghamshire twice won the County Championship title with Newell as coach and won the limited-overs double in his first season as director of cricket at the club in 2017. He also served as an England selector for four years. While there have been hiccups - such as relegation - along the way, the manner in which his sides have bounced back may give him an edge over the likes of Angus Fraser, whose Middlesex side will play a second successive season in Division Two in 2019. The perception that Nottinghamshire have picked up players from other counties rather than developing their own - there's a grain of truth in there, but it is often overplayed - may count against him.Any of these former England captains would make attractive candidates. There is no indication that any of them will apply, however, with the nature of the role - likely to involve quite a lot of arduous planning and admin work around issues such as age-group teams, the reimagining of the MCCU system and more cuts at Loughborough - may not appeal to men used to the cut and thrust of live broadcasting.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}