{"id": "ESPNColombo shocker could cost World Cup places - Trevor BaylissSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upColombo shocker could cost World Cup places - Trevor BaylissABOUT COOKIES", "paragraph": "George Dobell and Mark Butcher discuss England's potential squad to play in the 2019 World Cup and how far they can go in the tournament. (2:30)Trevor Bayliss has warned Tuesday's poor performance in Colombo could cost players their chance of making the World Cup squad.England suffered the worst loss - in terms of runs - in their ODI history and, while Bayliss reasoned the experience could provide a useful wake-up call, he also stressed that time was running out for several players to press their case for selection.England now have only one ODI series left - against West Indies in the Caribbean in February and March - before they have to select their 15-man World Cup squad.\"It's one thing giving guys an opportunity, but those guys have to take hold of that opportunity,\" Bayliss said. \"Those opportunities could determine who makes a World Cup squad and who doesn't. That's the way it is. It's a tough school, international cricket.\"There are not too many more opportunities before the World Cup squad is picked, so some of the guys will have to turn it around pretty quick. We're looking for some of those guys to take hold of that opportunity. If they do, they might find themselves in a World Cup squad. And if they don't, well, they might miss out. There will be some disappointed guys in the changing room.\"Our batting and spin-bowling line-up is pretty well set ahead of the World Cup, so it comes down to pace bowling. The West Indies series could mean a lot in that respect.\"Bayliss was particularly disappointed with England's attitude in the field. Not only did England put down three chances - two of them relatively simple - but he felt the general display lacked intensity.\"I'm disappointed with the way we played obviously,\" he said. \"I think it comes down to attitude. I didn't think our attitude in the field was anywhere near as good as it has been. Our attitude in the field wasn't up to scratch and that affected the way we bowled and we batted.\"We have some good fielders in the team, and some guys who aren't quite as naturally gifted athletically in the field. At the very least if you have the right attitude, you're going forward and you want the ball to come to you, that can make up for a lot. We were a long way short of that.\"But Bayliss did feel that such a drubbing might remind his side that there is no room for complacency in international cricket and suggested that winning the series in conditions in which England players often struggle suggested his side were learning to adapt their games to the circumstances as required.\"Winning the series is what we set out to do, so I'm very happy in being able to achieve that,\" he said. \"But this was a bit of a reminder that you can't take your foot off the gas and it's not quite as easy as some guys think.\"If you are not 100 percent on it, this game can bite you in the backside.\"The good thing is the way we adapted to different conditions. The conditions will be different in the World Cup but it's a good sign going forward. We've shown we can play a little bit differently.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}