{"id": "ESPNSmith, Warner, Bancroft: let them play, says Australian Cricketers AssociationSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upSmith, Warner, Bancroft: let them play, says Australian Cricketers AssociationABOUT COOKIES", "paragraph": "The Australian Cricketers' Association renewed calls to reduce the sanctions of players involved in the ball-tampering scandal (1:56)The Australian Cricketers Association has reiterated its call for the bans of Steven Smith, David Warner and Cameron Bancroft to be lifted in the light of the findings of the cultural reviews into Australian cricket.The Longstaff review said the events of Newlands were not a one-off and were caused by the pervading culture of Cricket Australia which the players association called \"hugely significant.\"Smith and Warner are currently serving a one-year ban while Bancroft was sanctioned for nine months for the ball-tampering scandal in March.\"What the Longstaff Review reveals is that Cricket Australia itself must also take a share of responsibility for what happened in South Africa,\" Greg Dyer, the ACA president, said. \"Yes, this moment of madness was 'individual' but now there is evidence and independent verification of system failure as well. This is hugely significant.\"With this new information common sense, common decency, basic fairness, proportionality and natural justice demand that the punishment is reduced. The players have already lost time in the game, chances to play for Australia, endured public humiliation and faced massive financial penalties.\"My message to Cricket Australia is a simple one: these contrite men have been punished enough. Let these contrite men play.\"I add that the ACA will be relentless in pursuing this end.\"Finally, I also offer a message to the Australian public on behalf of the ACA. In short, Australia's cricket players 'get it.' We assure you. The players 'get it.' The players understand.\"A Cricket Australia spokesperson said: \"We have seen the Australian Cricketers' Association press conference and note they will be making a submission to the CA Board in the next 48 hours. We look forward to engaging directly with the ACA in a positive and constructive manner in the best interests of the game.\"Speaking in the wake of the publication of the reviews, CA chairman David Peever said there was no chance of the punishments being rescinded.\"Sanctions were carried out and imposed by the board after a very full and thoughtful process. So the sanctions stand,\" Peever said.On Tuesday, the new CA CEO Kevin Roberts also indicated there would be no early route back for the trio, citing the appeals path that was open to the players when the sanctions were handed down.\"There's no provision to review the sanctions,\" Roberts told 116SEN. \"There's an appeals mechanism which was available to the players before the sanctions were finalized. I really empathise with each of the three players and have chatted with them in recent weeks. They are experiencing a challenging time. They made a serious mistake. I'm getting as many people saying to me the sanctions are too harsh as those who say they aren't harsh enough. We want to keep supporting the players.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}