{"id": "ESPNWorrall's career-best seven headlines bowler-dominated dayMatch CoverageBetting OddsPresented ByBet365Sheffield ShieldABOUT COOKIES", "paragraph": "South Australia 251 & 5 for 94 (Kelly 3-27) lead Western Australia 207 (Richardson 53, Cartwright 42, Worrall 7-64) by 138 runsCareer-best figures of 7 for 64 from South Australia paceman Daniel Worrall put the Redbacks in control of the Shield clash with Western Australia at Adelaide Oval.Worrall put on a swing bowling exhibition with five of his six victims on day two caught behind the wicket.Shaun Marsh and Mitchell Marsh both missed out. Shaun was the first man to fall on day two when he edged Joe Mennie to first slip for 21 and Mitchell fell to Worrall balls later caught at second slip. The Warriors tumbled from 1 for 35 to 8 for 123 in 28 overs before Jhye Richardson came to the rescue.Following on from his maiden five-wicket haul on the opening day, Richardson scored his second consecutive Shield half-century. His run-a-ball 53 featured six fours and in conjunction with Matt Kelly, who made 25 not out, dragged the total up to 207 before Worrall wrapped up the innings.South Australia were cruising late in the day at 0 for 62 with a lead an overall lead of 104 before a mini collapse let WA back into the match. Jake Weatherald was caught and bowled driving firmly back at David Moody. Callum Ferguson chopped on trying to force Kelly through cover-point.Then the Redbacks lost three in three balls. Conor McInerney fell to a stunning catch in the gully from Josh Philippe off Richardson before Travis Head and Jake Lehmann were claimed by Kelly from the first two balls of the next over with Head unfortunately strangled down leg while Lehmann nicked an attempted upper cut. South Australia finished at stumps just 138 runs in front with five wickets in hand.Western Australia fought back late in the day as they took three wickets in three ballsJhye Richardson bagged a five-wicket haul after Western Australia's surprising decision to bowl firstSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}