{"id": "ESPNFormer India seamer Praveen Kumar retiresSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upFormer India seamer Praveen Kumar retiresABOUT COOKIES", "paragraph": "Former India and Uttar Pradesh seamer Praveen Kumar has retired from all forms of cricket. Known for his ability to swing the ball both ways and bowl long spells, the 32-year old played 84 internationals for India between 2007 and 2012, taking 112 wickets across formats.\"I have no regrets. Dil sey khela, dil sey bowling daala [I played and bowled with my heart]. There are good bowlers waiting in the wings back in UP and I don't want their careers to be affected,\" Praveen told the Indian Express.\" Mein kheloonga toh ek ka jagah jayega, [If I play, one spot would go]; it's important to think of other players' future as well. My time is over and I have accepted it. I'm happy and thankful to god for giving me this chance.\"He made his ODI debut against Pakistan in Jaipur in 2007 and soon established himself as one of the key members of India's bowling attack alongside Zaheer Khan and Ashish Nehra. He was central to India's title win in the Commonwealth Bank ODI tri-series in Australia, also involving Sri Lanka. After dismissing Adam Gilchrist and Ricky Ponting in successive overs in the first final, he claimed 4 for 46 in the second final to help India defend 258 and seal the series.\"I can't forget the CB series which we won in Australia, probably it was the highest point in my career,\" he said.Praveen also made some vital contributions in Test cricket although he played only six matches. He was India's highest wicket-taker on their disastrous tour to England in 2011, picking up 15 wickets in three Tests, including figures of 5 for 106 that got him onto the Lord's honours boards.He sparkled briefly in T20 cricket as well, studded by an IPL hat-trick for Royal Challengers Bangalore against Rajasthan Royals in 2010.His highlights in the Ranji Trophy included a career-best 8 for 68 that ripped through the Delhi line-up in the final in January 2008, but it was not enough to win the title for UP. His last competitive match came in January earlier this year for UP against Baroda in the 20-over Syed Mushtaq Ali Trophy.Praveen still hoped to be associated with the game and expressed a desire to take up coaching.\"I want to become a bowling coach. People know that I have this knowledge. I think it's an area which I can work dil se [dedicatedly], I can pass on this experience to the young ones.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}