{"id": "ESPNMismatch on the cards as fragile West Indies take on Kohli's IndiaMatch CoverageVideosBetting OddsPresented ByBet365ABOUT COOKIES", "paragraph": "Ajit Agarkar's picks his India XI for the first ODI against West Indies in Guwahati (3:33)It is never good news for a series when the build-up talk is more around who is missing rather than who is playing. And we are not even talking about the Test series in Australia later this year. After tough tours of South Africa and England, India's tryst with lack of competition is in full swing. The home Test series is done in six days, and they are now staring at a West Indies ODI side without Chris Gayle, Evin Lewis, Bravo brothers, Sunil Narine and Andre Russell. For the health of international cricket, look as much at this West Indies series as at the Edgbaston Test between India and England earlier this year.India will not complain. There is every chance, though, that they might not get to work on their middle-order issues in this series. Those issues crop up only when the top order doesn't bat through, and that usually happens in close contests. West Indies will have a big challenge to make that happen against a top order in which all three ODI giants will be looking to fill their boots. Don't bet against records being broken. There could be double-centuries and some monstrous scores.Spare a thought, though, for the West Indies captain Jason Holder. The losses all go against his name when unfortunately the best players in the islands can't be available to play international cricket. The big guns came out during the World Cup qualifiers, but they are either on hire elsewhere right now or rusty and in a state of disrepair. While facing India's slow wristspin will be a challenge for them, the likes of Shmiron Hetmeyer and Shai Hope should be able to give a better account of themselves against the white ball, especially if they catch India on a dew-laden evening. And it will take all that to make sure it is not one of the most one-sided ODI series in India.India WTWWW (most recent first)\nWest Indies LWLLWWhat a remarkable turnaround for Rishabh Pant, who not long ago was far far away from making himself an international career before the World Cup in 2019. Having played T20Is in the Nidahas Cup in Sri Lanka, he was left out of the limited-overs sides in favour of MS Dhoni and Dinesh Karthik. He was not even originally part of the India A first-class side on the shadow tour of England, which was used for selection hints.Then it emerged that Test regular Wriddhiman Saha had not recovered from his injury in time, and India hurriedly placed Pant in the unofficial Tests side and named him in the Test squad, back-up to Dinesh Karthik. Midway during the series, Karthik was dropped, and Pant - even though still a work in progress as a pure wicketkeeper - grabbed his chance with a hundred at The Oval, the first by an India wicketkeeper in England, Australia, South Africa or New Zealand. He followed it up with a pair of attacking 92s in the Tests against West Indies, and is now set to make his ODI debut with India continuing to look for a solution to their middle-order problems.Samuels first toured India in 2002 and has since amassed over 900 ODI runs in the countryThe last man to score an ODI hundred in India, Marlon Samuels, is the most experienced player in the West Indies squad. He will need to shepherd the young batting unit in their first challenge against the limited-overs spin of such good quality.India have named Pant in a XII that includes six batsmen, Ravindra Jadeja as the allrounder and five other bowlers. In all likelihood, it will come down to choosing between Mohammed Shami and Khaleel Ahmed for the 11th place.India: 1 Rohit Sharma, 2 Shikhar Dhawan, 3 Virat Kohli (capt), 4 Ambati Rayudu, 5 Rishabh Pant, 6 MS Dhoni (wk), 7 Ravindra Jadeja, 8 Kuldeep Yadav, 9 Yuzvendra Chahal, 10 Umesh Yadav, 11 Mohammed Shami/Khaleel AhmedNeither of the regular West Indies openers is here, which leaves them a big challenge. Kieran Powell should take up one of those slots even though he played in the middle order in their last ODI.West Indies (possible): 1 Sunil Ambris, 2 Kieran Powell, 3 Shai Hope (wk), 4 Shimron Hetmeyer, 5 Marlon Samuels, 6 Rovman Powell, 7 Jason Holder (capt), 8 Ashley Nurse 9 Keemo Paul, 10 Devendra Bishoo, 11 Alzarri Joseph/Kemar RoachThe winter is just around the corner in most of India, and that means dew. Guwahati should be no exception to that. A 1.30pm start should mean only the second half of the second innings should get affected.Virat Kohli is 221 runs away from absolutely smashing the record for the least innings taken to reach 10,000 runs. The record belongs to Sachin Tendulkar, who reached 10,000 runs in 259 innings. Kohli has played 56 less innings to get to 9779 runs.Not that all of Kohli's records are safe. If Shikhar Dhawan can score 177 runs by the end of the five-match series, he will become the fastest Indian to 5,000 runs.West Indies have never been whitewashed in an ODI series in India\"If you see our one-day performances there's not much to ponder on apart from that one slot [No. 4] I spoke of. The bowlers are bowling well, the batsmen are batting well, the lower order hasn't got much batting because Shikhar, Rohit and myself have made a lot of runs. But having those experienced guys in the middle order will definitely help us and we feel quite settled as a batting unit.\"\nIndia captain Virat Kohli sounds happy with life\"We expect a really tough challenge from them, but it's all about building towards the World Cup. We've got some youngsters here who we want to see and hopefully they can express themselves and make us proud.\"\nWindies captain Jason Holder is looking towards 2019While the 21-year-old showed his class during his 78-ball 106 in the first ODI, a little more tempering will not hurtTheir dominance is comparable on the surface to Ricky Ponting's Australian team that demolished sides with a formidable top three during the period of their consecutive World Cup triumphs\nThe Barsapara Stadium was not in good shape two days out from the India-West Indies fixture, but an official said all would be well on match dayStats highlights from the Guwahati ODI, where Kohli and Rohit brought up their fifth double-century partnership in the formatShimron Hetmyer scored a brilliant 106, but too many batsmen threw away their wickets, leaving West Indies about 40 runs short of a testing total on a flat pitchSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}