{"id": "ESPNKusal Mendis' intensity the key as Sri Lanka's hitman turns the cornerSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upKusal Mendis' intensity the key as Sri Lanka's hitman turns the cornerABOUT COOKIES", "paragraph": "He had gone 24 innings without a fifty, His four most recent innings featured three ducks and a score of 5. But it was the intensity that Kusal Mendis brought to his fielding that tipped the team management off that a good innings might be around the corner. That was the reason why they refused to drop him for the fifth ODI.This was what captain Dinesh Chandimal revealed following Sri Lanka's 219-run DLS victory over England in Colombo. Sri Lanka could have brought the experienced Upul Tharanga back into the side, after Mendis had registered scores of 0 and 5 in his other two outings of the series - never looking like the kind of player the likes of Kumar Sangakkara had predicted would go on to score 10,000 runs in ODIs and Tests.But suddenly, in this match, a fire reignited in Mendis' game. His 56 from 33 balls was not the most substantial knock in Sri Lanka's innings, but it was the most eye-catching. He struck at a run-rate of 170 and hit six sweet sixes, the most attractive of them an imperious lofted off-drive off Tom Curan, in the 38th over.\"We looked at Mendis' fielding, and that was the No. 1 reason we trusted him,\" Chandimal said of giving Mendis another opportunity despite the lean run of scores. \"His attitude on the field was great. We know that when you have a player like that, he can get into form very quickly. We know how good a batsman he is. Kusal Mendis is our future. He took that responsibility on and played well for the team.\"Fielding, in general, has been something Chandimal has emphasised since taking the captaincy from Angelo Mathews, and in this series, Sri Lanka have seemed to raise their game on that front. Where in previous months, including in September's Asia Cup, Sri Lanka were perhaps the worst fielding side on show in any trophy they happened to be playing for, they arguably out-fielded England through the course of this series. At the very least, Sri Lanka were the more proficient side in Tuesday's game.\"The main thing for us is fielding,\" Chandimal said. \"If you can keep that energy and good attitude when you are fielding, other things fall into place. That's what we did as a team.\"Much as Sri Lanka would have loved Mendis to hit this kind of form earlier in the series, that he has done so with the Tests on the horizon will be an especial fillip to the hosts, who often look to him for top-order runs on turning tracks. Two other key Test batsmen were also among the runs in this game. Chandimal himself struck 80 off 73 balls - the first occasion since 2016 in which he scored more than fifty at better than a run-a-ball. Wicketkeeper-batsman Niroshan Dickwella, who opens the innings in ODIs, and bats in the lower middle order in Tests, made the highest score of the series, hitting 95 off 97 deliveries.\"We had lost the series when we got here, but we were intent on regaining form ahead of the T20 and Tests,\" Chandimal said. \"I'm glad three of our Test batsmen made runs today. We're hopeful we can take that confidence in to those next two series.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}