{"id": "ESPNMatthew Maynard appointed as Glamorgan interim coachSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upMatthew Maynard appointed as Glamorgan interim coachABOUT COOKIES", "paragraph": " Matthew Maynard will take charge of Glamorgan's preparations for the 2019 season, after being appointed as the county's interim head coach following the departure of Robert Croft last month.Maynard, 52, scored 22,764 first-class runs for the county in a 20-year career - only two players, Alan Jones and David Davies, have managed more - and in 1997 he captained the county to their first County Championship title since 1969.He returned to the club last season as a consultant batting coach, following three seasons as director of cricket at Somerset, but there are no guarantees at this stage that he will be offered the permanent position, with external applications for the role being accepted and interviews set to take place in December.In the wake of their calamitous campaign in 2018, Glamorgan have been subjected to an independent review, undertaken by Huw Bevan, the former Engand fitness coach.In addition to Croft's removal as head coach, which ended an unbroken 30-year association with the club, Hugh Morris has foregone his duties as director of cricket, although he remains in situ as chief executive.\"I'm delighted to take up the role as interim head coach. Glamorgan has always been my home, so when Hugh asked me to coach the team over the winter it was an opportunity I couldn't turn down,\" said Maynard.\"We've had a couple of tough years but I'm very excited at the prospect of working with our talented bunch of players over the winter and I can't wait to get started.\"Morris added: \"Matt has a wealth of experience as a head coach and a real understanding of the club from his time here as both a player and a coach.\"He is highly respected at the club and in the wider cricketing community and has a proven track record of developing and improving young players.\"He's the ideal person to work with our young Glamorgan Pathway players over the winter while we continue our search for a new director of cricket and head coach.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}