{"id": "ESPNCoA asks Supreme Court to suspend voting rights of non-compliant statesSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upCoA asks Supreme Court to suspend voting rights of non-compliant statesWhere the states standABOUT COOKIES", "paragraph": "Non-compliant: Haryana, Himachal Pradesh, Karnataka, Gujarat, Meghalaya, Nagaland, Arunachal PradeshPartially compliant: Tamil Nadu, Madhya Pradesh, Jharkhand, Goa, Maharashtra, Bihar, Bengal, Chattisgarh, Manipur, VidarbhaSubstantially compliant: Andhra Pradesh, Assam, Baroda, Mizoram, Puducherry, Delhi, Hyderabad, Jammu & Kashmir, Kerala, Mumbai, Odisha, Punjab, Rajasthan, Saurashtra, Sikkim, Tripura, Uttar PradeshThe Committee of Administrators (CoA) has identified seven state associations for \"neglecting\" and \"breaching\" the Supreme Court order of August 9 that had directed all BCCI members - states - to comply with the new constitution formed on the basis of the Lodha Committee's recommendations.Other states fall under \"partially compliant\" and \"substantially compliant\" categories - they have made modifications to several key reforms that were approved by the court. None of the 34 state associations of the BCCI has complied fully with the reforms in the new constitution.Consequently, the CoA has asked the court to warn all non-compliant states that their voting rights at the BCCI elections would be \"suspended\" if they fail to produce an eligible compliance certificate within a set timeframe.On August 9, a three-judge bench of the Supreme Court, led by the then chief justice of India, Dipak Misra, approved the new constitution of the BCCI as drafted by the CoA, with certain amendments. The BCCI registered its new constitution on August 21 at the Registrar of Societies. As per the court order the states would have needed to submit a compliance certificate to the board within a month from that date - by September 20.Although the states were not expected to follow an identical image of the BCCI constitution, they were told by the CoA to record in writing the reasons behind any modification or deviation along with the modified constitution.In its tenth status report submitted to the court on October 28, the CoA said seven state associations have \"failed and neglected\" to file the compliance certificate. High-profile state associations such as Haryana, Karnataka and Gujarat feature among this pack, which the CoA has termed as being \"clearly in breach\" of the court order and classified as \"Non-Compliant State Associations\".The CoA has also shortlisted 10 \"partially compliant\" state associations, which include heavyweights like Tamil Nadu, Bengal, Madhya Pradesh, Maharasthra and Jharkhand. There are 17 others state associations that have accepted most of the reforms barring a few in their new constitution.In August, the court had warned that any state association that defied its order would be barred from receiving funds from the BCCI until it adopted the new constitution. Although many states have set the ball rolling, many have dragged their feet on key reforms such as the cooling-off period, disqualification criteria and selection panels while altering a few others significant reforms. Considering the court's warning to have fallen on deaf ears, the CoA has now told the court it ought to issue further stringent directions.Each of the seven non-compliant state associations, the CoA has said, should submit a compliance certificate and the new constitution as per the prescribed format within a week. Failing to do so would lead to suspension of their voting rights at the BCCI general body along with additional penalties.The same would apply to the partially compliant states as well as those that had accepted the new constitution in substantial parts, who, the CoA has recommended, should be given two weeks to submit fresh compliance certificates.Once they have amended their constitutions along similar lines to the BCCI, all eligible states will conduct elections as per the protocol set by the BCCI's electoral officer, who will be chosen by the CoA in consultation with the Election Commission of India. The CoA has told the court that the BCCI should conduct its elections within 90 days and only those state associations found eligible can attend/vote/contest.The Supreme Court hearing into the status report, originally listed for Tuesday, has been postponed to November 27.GMT 0700 The article was updated to include news of the postponement of the Supreme Court hearing.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}