{"id": "ESPNFormer South Africa batsman Gulam Bodi pleads guilty to corruptionSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upFormer South Africa batsman Gulam Bodi pleads guilty to corruptionABOUT COOKIES", "paragraph": "Former South Africa and Lions batsman Gulam Bodi has pleaded guilty to eight charges of corruption and begged for clemency in the Pretoria Commercial Crimes Court. On Friday, Bodi became the first South African sportsperson to be criminally convicted for match-fixing and is facing a potential 15-year sentence.Bodi is being charged under the Prevention and Combating of Corrupt Activities Act of 2004, which makes match-fixing and spot-fixing in sport a crime in South Africa. The act was introduced after the Hansie Cronje match-fixing saga in 2000, and this is the first time it is being exercised.In 2016, Bodi was banned from taking part in any activities relating to cricket for 20 years by Cricket South Africa for his part in contriving to fix, or otherwise improperly influence aspects of the 2015 Ram Slam T20 tournament. Six other players - Alviro Petersen, Thami Tsolekile, Lonwabo Tsotsobe, Jean Symes, Pumi Matshikwe and Ethy Mbhalati - were also implicated.CSA handed their evidence over to the South African police services, who launched their own investigation culminating in this case.\"It has been a very tough few years,\" Bodi told reporters outside the courtroom. \"I've been banned for 20 years. That's already a long sentence. So for me not to be able to do something I loved my entire life has been terribly hard. I haven't really settled in the last three years. It's been a constant battle.\"Just recently I managed to get a job, and after three years of running around and struggling, things started slowly looking a bit better, and now this comes up. It's completely shattered me.\"They pulled me out of school when I was just 16 and put me in a cricket academy. I don't even have an education background to fall back on, so it's been a real battle. This is going to greatly affect my job and my family, because nobody wants to be associated with a criminal.\"Sinenhlanhla Mnguni, Bodi's legal representative, said his client acknowledged his wrongdoing and pleaded for the court's mercy. The state and defence legal teams both asked for more time in order to prepare for a sentencing, and Magistrate Nicola Setshogoe agreed to a postponement, acknowledging that as a first-time offender Bodi had handed himself in and co-operated fully with authorities since being arrested in July.\"Before this whole thing transpired, my client was offered a job at a cricket academy and had also been commenting with SuperSport,\" Mnguni told The Saturday Star. \"The fact that the ban he received meant he couldn't be involved with cricket took away any form of income he would be able to earn because in essence this man only knows cricket. He doesn't have an academic background.\"I'm hoping that when we bring forward all these issues to the court, in addition to the fact that he's got three very young children and he's got an elderly unemployed mother, whom he financially supports.\"I feel for my client because I know he's been through a lot. He's made a mistake and I won't say he's been punished enough, but he has been punished and he suffered a lot going through this process, and he obviously feels very sorry for what he's done and the harm he has caused to CSA and the damage that they suffered in the public for what he's done.\"Bodi will return to court on 28 January next year for sentencing.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}