{"id": "ESPNMalcolm Speed wants Mark Taylor to replace David Peever as CA chairmanSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upMalcolm Speed wants Mark Taylor to replace David Peever as CA chairmanABOUT COOKIES", "paragraph": "Malcolm Speed, James Sutherland's predecessor as chief executive of Cricket Australia, has called for the resignation of the chairman David Peever and his replacement by the former captain Mark Taylor as a signal for \"dyed-in-the-wool cricket people\" to take back control of the game from an increasingly corporatised Board of the governing body.Still directly involved in sports administration as the executive director of the Coalition of Major Professional and Participation Sports, Speed decried Peever's handling of the release of cultural reviews into CA in the wake of the Newlands ball-tampering scandal, particularly his interview with Leigh Sales on the 7:30 Report, in which he described the scandal as a \"hiccup\" for cricket.Speed also indicated that a host of eminent leaders with a background in cricket would be open to joining the CA Board were it to be chaired by Taylor, who has served as a director across two separate stints since 2004 but has never assumed the role of leading it. \"I have been friends with the recent chairmen of Australian cricket. David is the first to have come out of the corporate world rather than out of the cricket world and I think in this crisis that's what's shown here,\" Speed, also a former CEO of the ICC, told ABC radio.\"One thing that did strike me last night, I watched the 7:30 Report, at the end of the interview when he was talking about something that I would regard as orchestrated cheating - the captain, the vice-captain, the youngest player sit down and decide that they will go out onto the ground with sandpaper, will tamper with the ball, which is against the laws of the game, so they decide to go out and cheat - David Peever described this as a hiccup.\"Now, it's not a hiccup, it's much more than that, and my response to that was when I saw that interview and I saw that comment, I thought Australian cricket can do better in choosing its chairman and the game deserves better governance, the game deserves better leadership.\"Taylor, who backed Peever's re-election as chairman of CA for a further three years at the CA AGM last week, was present in Melbourne on Monday for the release of CA's cultural reviews, conducted by Dr Simon Longstaff of the Ethics Centre and the former Test opening batsman Rick McCosker. Speed said that the increasingly corporatised direction of CA, as outlined by Longstaff's report, had created a gulf in terms of genuine knowledge of the game and how it should be run at the Board level.\"I'd like to see Mark Taylor stand up as chairman of Cricket Australia,\" Speed said. \"He's on the board, he's been there for quite a long time and there is a bit of an outcry that the whole of the board must go, I don't agree with that, there are some very good people on that board who work hard, who have good judgment. I'd like to see Mark Taylor come forward as the next chairman.\"Mark is an outstanding man, who's lived and breathed Australian cricket, who's been on the Board for some time. I say I've run my race, like a lot of other people who've been involved in cricket, yes we'd love to be involved again if Mark were to be chairman and he rang me and said 'I want you to be on the Board' I would be there in a flash, as would lots of other people who've contributed to Australian cricket.\"There is a strong corporatisation of the board, that was a result of a serious governance review seven or eight years ago. It's good to see some diversity on the board - some women on the board, some people who aren't from the cricket family so to speak - but I think that's missing at the moment, that the dyed-in-the-wool cricket people need to stand up and take back their sport.\"In making observations of the review, Speed said he was surprised to hear recommendations that captaincy candidates required lessons in moral courage, and that the selectors should include questions of character in their assessments of the players they choose. Speed described these conclusions as \"naive\".\"A couple of things struck me as quite strange. Firstly, that the candidates for captaincy should have extra lessons in moral courage,\" Speed said. \"Now, if I had said to the captains I dealt with, people like Mark Taylor, Steve Waugh, Ricky Ponting and before them Allan Border, that they needed lessons in moral courage, that would've been a very short conversation, I can tell you that ... they were never short of moral courage.\"The other thing that struck me is the direction that the selectors are now to take into account character when they're picking the Australian cricket team as well as ability. That's happened from the start of Australian cricket. It's a major feature of what the selectors do so there are parts of the report that I think are naive.\"Among the areas for question about the review was the low level of return by current players to Longstaff's requests for survey responses or interviews - revealed to be around 30% of those asked. Alistair Nicholson, the Australian Cricketers' Association chief executive, indicated that most players felt more comfortable contributing to the ACA's own submission, noting that the review itself cited CA's inability to handle negative feedback.\"Players contributed a lot to what our submission to the review was, whether it was through a survey or interviews. They gave us a lot of feedback around that, so it's important to note that came through in the overall Longstaff report,\" Nicholson said. \"The other thing is there's indications in there around how negative feedback is not well taken [by CA] and in some cases players decided they didn't want to do it and referred through us, and we compiled an appropriate submission.\"At the same time, the ACA's president Greg Dyer indicated that relationships between the leaders of the two organisation had improved since last year's fractious pay dispute, even though he stated bluntly that much of the players' association's criticisms of CA over recent years had been fully backed up by the findings of Longstaff and McCosker.\"Cordial, friendly, there's a thawing which has commenced is how I'd describe it,\" Dyer said of the relationship. \"There are fruitful discussions underway, which obviously are confidential in nature, but there is a thawing, a definite willingness on both sides to improve that at the personal level, but we need to make sure the organisation beyond David Peever and Greg Dyer, beyond Alistair Nicholson and Kevin Roberts, we need to make sure that organisational relationship is founded on very strong foundations.\"Nobody within the ACA, nobody within our membership has been surprised by any of the findings of the Dr Longstaff review. This report details a corporate culture which is as bad as I've seen in my 30 years in the commercial world.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}