{"id": "ESPNPCA criticised for failing to mark Remembrance DaySense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upPCA criticised for failing to mark Remembrance DayABOUT COOKIES", "paragraph": "The Professional Cricketers' Association (PCA) has acknowledged that it could have done more to mark Remembrance Sunday on its social media channels, after receiving a complaint from a member.The players' union admitted to ESPNcricinfo that not recognising the centenary of Armistice Day on its Twitter feed was \"an oversight\" but insisted that \"in no way should it be interpreted as disrespectful to our members who were involved in the armed forces\".They also pointed out that staff were busy helping PCA members - the organisation helps many former players who have fallen on hard times - and that they would always want to recognise such an event in a meaningful way and not just in a tweet.It comes after David Smith, the former Leicestershire and Northamptonshire chief executive who also played for Warwickshire, said he was \"ashamed\" of what he believes was the PCA's failure to mark Remembrance Day.In an email sent to PCA chairman, Matthew Wheeler, and seen by ESPNcricinfo, Smith registered his \"grave disappointment\" in the absence of any output on the organisation's social media channels. By contrast, the Twitter accounts of both the Rugby Players' Association and the Professional Footballers' Association put out posts to mark the day.\"I find myself yet again compelled to write to you, this time to express my grave disappointment at the fact the PCA did not recognise Remembrance Day on our website or social media platforms,\" Smith said. \"There are ceremonies worldwide to mark the centenary of the Armistice.\"Almost 150 county cricketers have given their lives in armed conflict since 1881. More than 100 died in WWI including three England players. Frankly not recognising our cricketers who gave their lives is an absolute disgrace. I'm really ashamed of our organisation.\"For goodness sake get a grip. You're supposed to be directing us. You have taken us to an all-time low. By way of comparison the Rugby Players' Association tweeted 'Lest we Forget' at 11am.\"Smith qualifies for PCA membership as a former Warwickshire player. He also represented England Under-19s, Under-25s and England A, before serving on the ECB cricket committee. He has been an extremely vocal critic of the PCA in recent months and has resisted suggestions that he might be suited to serving on its board.The England team did recognise the day. They held a two-minute silence at the team hotel in Kandy with Joe Root, the England captain, addressing the players, coaches and traveling media to remind them that none of them would enjoy the life they lead today without the sacrifice of previous generations.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}