{"id": "ESPNSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upSense of belonging helps Keaton Jennings stay relaxed in the line of fireABOUT COOKIES", "paragraph": "George Dobell and Andrew Fidel Fernando review day four of the second Test in Kandy as Sri Lanka require 75 runs to win. (3:38)If England do go on to win the second Test in Kandy - and a match of endless fluctuations of fortune could easily contain one more twist - it will have been their fielding that made the difference.Twice in this game Dimuth Karunaratne (63 in the first innings and 57 in the second) has looked set to carry his side into a position of dominance. And twice his innings have been ended by outrageously good pieces of fielding.In the first innings, it was Ben Stokes' brilliant pick-up-and-throw that ended Karunaratne's innings with a run-out. And, in the second, it was a brave, intelligent and, yes, somewhat fortuitous, piece of fielding by Keaton Jennings, at short leg, that resulted in his dismissal.Kennings admitted his deflection to Ben Foakes was actually an attempted catch. But perhaps his commitment and courage deserved some reward. After all, the instinct of most people upon seeing a batsman shape to paddle-sweep is surely to take evasive action. But Jennings anticipated the direction of the ball and attempted to put his body in its way. A grab for the catch subsequently resulted in a deflection which Foakes - alert as ever - held.\"I'd love to say I parried it to Foaksey [on purpose],\" Jenings said afterwards. \"But I genuinely tried to catch it. It hit me really hard and went straight off to Foakesy.\"You get a feeling of what the batter is looking to do. You try to watch his movements and match your movements to where he is trying to hit the ball: generally you try and get in the way.\"I saw him go down to paddle and just set off running. He got a little too much bat on it and it ended up at me.\"It wasn't England's only moment of inspiration in Sri Lanka's second innings. Or Jennings'. His catch to dismiss Dhananjaya de Silva, also at short leg, was every bit as impressive. Again anticipating the direction of the ball, Jennings moved to his right (towards fine leg) only to see the ball squeeze out much more square than he had presumed. But, using his reach - he is six foot four - and benefiting from have remained low and in position, he stuck out his left hand and clung on to an outstanding one-handed catch.\"It was actually off the face so I saw it all the way,\" Jennings said afterwards. \"I went down the leg side thinking that's where he was trying to hit the ball. It kind of went the other way so I stuck out a mitt and it hit the middle of it, thankfully. It's one of those that, on a lot of other days, would have hit my hand and gone back out. Thankfully, today it stuck.\"Now, when you combine those Jennings efforts with Stokes' catch of Kusal Mendis in the first innings, Ben Foakes' stumping of Kaushal Silva in the second and that Stokes run-out, you start to understand how vital a contribution England's fielders have made. For on a pitch where England's spinners have, at times, struggled to threaten or even contain the Sri Lankan batting, it has been the fielding that has made the breakthrough and the difference. Without it, England would have looked worryingly impotent at times.It's worth contrasting England's effort in the field with Sri Lanka's. For it's not just that Sri Lanka have, on the whole, lacked such moments of inspiration, it is that at times they have spurned pretty straightforward chances. And a couple of them have been very costly.Sam Curran, for example, should probably have been stumped on 14 in the first innings. And he certainly should have been caught on 53 when Malinda Pushpakumara made a fearful hash of a chance on the long-on boundary. Instead he went on to make 64. Bearing in mind the tight margins that seem destined to define this game, that is clearly vital.Equally James Anderson might have been missed - again by Niroshan Dickwella - before he had scored in England's second innings. While he scored only 7, he helped Foakes add 41 for the final wicket. And how different might this game appear if Sri Lanka were going into the last day requiring 34 for victory instead of 75? There's very little between these sides in batting and bowling. But in the field, there is a chasm.Hard, technical work in training is, no doubt, one of the key factors in England's improvement in the field. Jennings, for example, has spent many hours in recent weeks working on the position - much of it with Paul Collingwood - having been relegated from the slips after an error-filled summer. From a low-base - he was at short leg in India a couple of years ago but did not look a natural even a couple of weeks ago - he has probably earned himself the job for the rest of the winter. Even though it is, as he joked, \"a good job to do badly.\"But Jennings had another theory about his success. He reckoned that it was his comfort in the England environment that had allowed him to both relax in the role and throw himself into it with hardly a thought for his own safety.That's a remarkable thing. He was protected by nothing more than a helmet, shin pads and a box, after all. Over the last two weeks, two games on this tour - the first Test in Galle and the warm-up game in Colombo that preceded it - have been stopped to provide treatment to fielders struck when close to the bat. To hear Chris Rogers - a proficient and apparently fearless short-leg fielder - talk about it towards the end of his career was to hear a man who had started to think of it as something approaching torture. The courage required to stand there should not be under-rated.\"I really enjoyed it on this surface,\" Jennings said. \"You feel in the game all day. It's good fun. It's like being in the slips in England: you feel in the game and want to make a difference.\"Cricket balls hurt regardless of whether you're an opening batter or a bowler. You just hope it misses you or hits you on the shins.\"Maybe the runs I've scored recently have helped with my confidence. But it's also feeling settled in the environment. Generally, when you move into a new environment, it is tough to settle down and find a stable base for yourself.\"But I've enjoyed it. I've really enjoyed the trip.\"It has been mentioned before that Trevor Bayliss, the England coach, takes a hands-off approach to nearly everything. So there may be times when players requiring technical intervention do not receive it, or the tactics are just a little too aggressive to be sensible.But what he is really very good at achieving is a relaxed environment where stress on players is reduced. They are encouraged to express their skills and enjoy the journey far more than previous teams. It doesn't mean they are not expected to work hard - quite the opposite, really - but it does mean the environment is welcoming and supportive. You wonder how the likes of Mark Ramprakash and Graeme Hick, in such an environment and supported by more continuity of selection - might have fared.There is still progress to be made on England's fielding. They put down a couple of relatively straightforward catches at Galle and, over recent months, have proved particularly fallible in the slips. But, with more people now in their optimum positions - the cordon regularly contains Joe Root, Stokes, Rory Burns and Jos Buttler, with Stokes the slip to the spinners - they are starting to improve. And, sometime on Sunday morning, it may have proved one of the key factors behind a rare series win in Asia.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}