{"id": "ESPNDavid Warner will have to prepare himself for English hostility, warns Joe RootSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upDavid Warner will have to prepare himself for English hostility, warns Joe RootABOUT COOKIES", "paragraph": "Joe Root has warned that David Warner could face a \"hostile environment\" if he is a member of Australia's touring squad to England in 2019.Warner briefly walked off the pitch while playing Grade cricket at the weekend having taken exception to comments made by Jason Hughes, the brother of Warner's former team-mate Phillip Hughes, who died in a tragic on-field incident in 2014.But Root, the England Test captain, suggested English supporters may prove even more vociferous in their views of Warner if he is a member of either Australia's World Cup or Ashes touring squads next year. Warner was sent home from England in 2013 after punching Root in a bar, is currently serving a ban for his part in the Cape Town ball-tampering debacle.\"I'm sure he will have to accustom himself to what might be a slightly hostile environment from the English public,\" Root said. \"I wouldn't wish that upon anyone, but time will tell as to what happens.\"While Root said he had never considered walking off the field following a negative comment from an opposition player, he declined to criticise Warner for doing so.\"It is something you don't see very often,\" Root said. \"But unless you know exactly what went on out there you can't say if it was a justified thing or not. You don't know what was said and you don't know what was involved and what happened out there.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}