{"id": "ESPN'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-up'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussleABOUT COOKIES", "paragraph": "Keaton Jennings reflects on his fantastic catch and an excellent fourth day against Sri Lanka, at Kandy (0:47)Keaton Jennings believes the second Test at Pallekele is \"set up for a bit of a thriller\" after a gripping fourth day was brought to an early close by rain with the match very much in the balance.By the close, Sri Lanka needed another 75 runs to square the series with three wickets in hand, one of them being the unconventional and aggressive wicketkeeper, Niroshan Dickwella, who has the range of strokes required to overcome the spinning conditions and get his side across the line.However, Jennings - whose sharp reactions at short leg were instrumental in two of England's seven wickets on the day - believes that the brief passage of play after tea, in which Angelo Mathews and Dilruwan Perera fell in quick succession, has tipped the balance firmly in England's favour.The first of those wickets was the key scalp of Mathews, who had been firmly entrenched on 87 in a sixth-wicket stand of 43, but then fell to Moeen Ali to his second ball after the break.Asked if the tea interval had come at an ideal moment for England, Jennings told Sky Sports: \"15-20 minutes earlier would have been ideal, but I think it really did. It stops their momentum, and you come out with fresh energy.\"When you walk off the field with 80 needed, and five wickets in hand and a guy well set, it's tense, but then you get two breakthroughs and suddenly it looks a different game.\"Wickets have fallen in clusters, as we saw in our innings. It is tough to start, so hopefully we can strike early and put the pressure on.\"Dickwella, however, remained unbeaten on 27 from 30 balls at the close, having taken a leaf out of England's own book in both of their innings - using the sweep to good effect to disrupt England's lines and lengths and keep the scoreboard moving.\"He's a bit awkward,\" said Jennings. \"He sweeps, reverse sweeps, puts you under pressure, so hopefully we can hold him tight.\"Even some of the good balls turn too much, so that slow turn allows you to get the ball away square, so even when you bowl good balls you still seem to go at threes and fours an over. We need to restrict that as much as we can.\"Despite Sri Lanka's late setbacks, Mathews remained upbeat: \"It is evenly poised,\" he said. \"Unfortunately I got out at a very crucial time. But we still have got a batter at the crease. Then guys like Akila Dananjaya and Suranga Lakmal are no mugs with the bat. So we are not out of the game. If we get one good partnership we are in with a win.\"We are still 75 runs away. The ball is soft and the wicket is slow. You have about another 18 overs for the new ball. We need to get as much before as we can. The first hour will decide. Cricket is a funny game.\"Jennings added: \"We need to have a good first half hour tomorrow, even if we just restrict the scoring rate, that will build the pressure on them to play a false shot. There's enough balls in there to create that pressure, we just need to make sure we hold that scoring rate.\"Our mood is really positive. A good day's work but it's set up to be a really good Test match. The last four days have been absolutely amazing to watch.\"If you'd arrived before the Test and looked at the surface, I'm not sure you'd have expected it to get to day five.\"On the subject of his own involvement in the field, where he put in arguably England's most impressive stint at short leg since James Taylor starred on the tour of South Africa three years ago, Jennings joked: \"It's a good job to do badly, I've heard!\"I really enjoyed it on this surface, when you feel in the game all day, it's good fun. It's like being in the slips in England, you feel in the game and want to make a difference.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}