{"id": "ESPNRutherford ton makes India A's pacers toilMatch CoverageBetting OddsPresented ByBet365ABOUT COOKIES", "paragraph": "New Zealand A 176 for 1 (Rutherford 106*, Young 49) trail India A 467 for 8 dec (Parthiv 94, Vihari 86, Shankar 62, Tickner 4-80) by 291 runsThe lower-order trio of Parthiv Patel, Vijay Shankar and K Gowtham propelled India A to 467 for 8 on the second day of their first unofficial Test against New Zealand A, after which the hosts put on a solid batting show to finish on 176 for 1. Opener Hamish Rutherford crunched his 13th first-class hundred following India A's declaration post lunch. In the afternoon, the India A bowlers toiled for 55 overs to prise out a solitary wicket. With two more days of play remaining, New Zealand A trail by 291.Parthiv, batting on 79 overnight, fell six short of a 27th first-class ton after edging Blair Tickner's medium pace to the keeper. But Shankar and Gowtham added 89 in a ninth-wicket stand that took them past 450 before India A captain Ajinkya Rahane declared in the 123rd over. Tickner's dismissal of Gowtham on 47 was his fourth wicket; he finished with figures of 4 for 80.It took India A almost 38 overs to earn their first wicket as New Zealand A's opening pair of Rutherford and Will Young added 121. Fast bowlers Deepak Chahar, Navdeep Saini and Mohammed Siraj went wicketless, as did Shankar off his medium pace. The only India A wicket-taker was Gowtham, whose offspin dismissed the captain Young one short of a 28th first-class half-century. But Rutherford pushed on, reaching his ton in 155 deliveries, and by stumps, New Zealand A ensured they lost no further wicket. Rutherford's innings featured 16 fours and a six.India A's lower-order trio of Parthiv, Shankar and Gowtham helped the visitors make 467 for 8, after which their bowlers were made to work hard for 55 oversHanuma Vihari, Parthiv Patel, Mayank Agarwal and Prithvi Shaw enjoyed productive outingsSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}