{"id": "ESPNVirat Kohli backs Ambati Rayudu for the No. 4 spotSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upVirat Kohli backs Ambati Rayudu for the No. 4 spotABOUT COOKIES", "paragraph": "The India captain talks about India's middle-order conundrum and the perfect combination for the World Cup (1:49)Ahead of the first ODI against West Indies, India captain Virat Kohli said that his team has come close to figuring out their combination for the World Cup, which begins in May 2019. India have 18 ODIs between now and the World Cup and this time will be used to perfect what Kohli called a \"sorted\" batting order. Ambati Rayudu's return to the ODI team is at the centre of this certainty after over a year of deliberation for the No. 4 spot with Kohli almost categorically stating that the Hyderabad batsman had it.\"The only position that we were trying to figure out for a long time was No. 4,\" Kohli said. \"We tried many players which unfortunately could not be capitalised or cemented in the way we wanted. We were looking at Rayudu for England but some guidelines had to be followed because of which he couldn't make it.\"The guidelines that Kohli was referring to were those pertaining to fitness. After a dazzling IPL season where Rayudu made 602 runs at 43 with a strike-rate of almost 150 in Chennai Super Kings' title-winning return to the tournament, he was in line for a return to international cricket after two years. But he couldn't make it to India's limited-overs tour of England after failing the yo-yo test, a mandatory requirement for India's selection process.That meant India's prolonged shuffling of batsmen at the No. 4 spot continued, with KL Rahul and Dinesh Karthik getting opportunities to make their cases one more time in an 18-month hunt that has involved Yuvraj Singh, Ajinkya Rahane, MS Dhoni, Kedar Jadhav, Hardik Pandya and Manish Pandey.At last month's Asia Cup, however, Rayudu broke into the XI to take Kohli's spot and made two fifties.\"He made it to the Asia Cup and the team felt that he is designed to play that middle-order batsman's role,\" Kohli said. \"So the batting is more or less balanced now and these 18 games would be to get the perfect combination that we want to take into the World Cup. All games together, barring injuries or niggles, we want one combination to play through and through.\"Apart from bowlers resting here or there in one-day cricket, we only changed the No. 4 slot because we wanted somebody to cement it. We believe that Rayudu is the right person to capitalise because he's experienced and he has won many games for his state and in IPL cricket. He has a great one-day record already for India, so I think the batting order is sorted as far as we're concerned.\"Rayudu, of course, batted mostly at No. 3 in the Asia Cup, where he has got most of his runs - 687 at 68.70 - for India, apart from one game where he opened the innings. In the quadrangular series before the Asia Cup, Rayudu batted at No. 4 for India A, and in the Vijay Hazare Trophy following the Asia Cup, he turned out at No. 5 in both matches that he played for Hyderabad. His adaptability was also on show during his successful season with CSK and this experience of jumping up and down the order seems to have been a key factor in Rayudu's favour, particularly in a batting line-up that often has to follow a formidable performance from the top three.\"Giving him enough game-time between now and the World Cup, I think that particular slot will be sorted. If you see our one-day performances there's not much to ponder on apart from that one slot. The bowlers are bowling well, the batsmen are batting well. The lower order hasn't got much batting because Shikhar [Dhawan], Rohit [Sharma] and myself have made a lot of runs. Having those experienced guys in the middle order will definitely help us and we feel quite settled as a batting unit.\"With this seemingly a fortified plan, Kohli also ruled out experimentation in terms of pushing batsmen who normally play below No. 4 into that slot barring specific match situations.\"If the openers bat till the 30th over, you send someone who can do a better job than me; there's no rocket science to it,\" he said. \"In T20 cricket you do that all the time. Invariably you would want a consistent batting line-up. But if there is a situation, if it's 40 overs and you're only two down, someone who can capitalize on those next 4-5 overs better will step in. As a team, we understand that and the batting order is always ready. The guys below No. 4 are always flexible. It's always about what the team wants, and being flexible is important.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}