{"id": "ESPNPat Howard won't extend contract beyond 2019Sense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upPat Howard won't extend contract beyond 2019ABOUT COOKIES", "paragraph": "Pat Howard, Cricket Australia's team performance chief, will not seek an extension to his current contract, meaning he will finish a tenure that began in the wake of the 2011 Argus review at the end of next year's Ashes tour of England at the latest.Installed as a \"single point of accountability for team performance\" as one of the Argus review's recommendations, Howard has been arguably the most debated figure in Australian cricket over the past seven years. He signed a contract extension in May last year to take his time at CA through to 2019, mirroring those of the former coach Darren Lehmann and his support staff. However, all faced a hailstorm of criticism in the wake of the Newlands ball-tampering scandal, forcing Lehmann to resign immediately.While Howard's team performance wing of CA is expected to face plenty of criticism in the independent cultural review of the governing body, commissioned in the wake of Newlands, he retorted to its facilitator Simon Longstaff that the performance of the men's national team represented only \"25%\" of his job.\"It'll be interesting where that goes and I don't know where that's going. I haven't had anything to do with it,\" Howard told News Corp last month. \"I'm in charge of men's and women's teams and underage teams so I guess if the environment had been the same everywhere … then I would have a different view, but I don't think [problems] have been consistent across all the teams.\"The cultural review did ask about that [win-at-all-costs culture] and I said I'm happy to give you my KPIs as a starting point. About 25 per cent is on outcomes, ie winning, and then there's a lot of stuff in line with strategy and which is available freely. Don't get me wrong, I want people to be the best they can be, me included, players, managers, all of us. But I don't believe I have a win-at-all-costs culture. My proudest ever tour was the 2017 Indian tour, which we lost.\"A CA spokesperson said Howard's decision not to renew his contract, of which he has recently been informing CA and national team staff and players, was unrelated to the review's imminent release. \"Pat had previously indicated that he would not be seeking contract renewal beyond the end of the 2019 Ashes series, when his contract was due to conclude,\" the spokesperson said. \"The decision is his own and is no way connected to the reviews to be released on Monday. A recruitment process will be decided and announced in due course, but there is plenty of time for this to be considered.\"Since joining CA from a rugby background in late 2011, Howard has been in almost perpetual motion in the job, trying many things while also developing a long list of critics. His innovations have included the return of bonus points to the Sheffield Shield and the trial of Dukes balls in the second half of recent seasons, the use of wellness apps to monitor the health of CA-contracted players, encouragement of increased management for fast bowlers to reduce their injury rate, moving the domestic limited-overs tournament to the front end of the season, and the use of the ICC academy in Dubai to prepare for a competitive showing on the 2017 India tour.Howard was also an advocate of introducing performance bonus pay to the national teams, as per the recommendations of the Argus review, during the 2012 MoU negotiation. The scheme remained in place for the current MoU, during which Howard and Sutherland completed compromise talks with the Australian Cricketers Association after the game was brought to a standstill by the players' dispute with CA's lead negotiator Kevin Roberts, who has since been named as the new chief executive.However he has faced criticism from numerous quarters of the game in Australia for the perceived marginalisation of the Sheffield Shield and limited-overs tournaments, and the perpetuation of a system geared towards finding great players at the expense of the merely very good. A famously combative character, he was recently revealed to have sent a scathing email to performance staff in the wake of a Test-match loss to Bangladesh in Dhaka in 2017.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}