{"id": "ESPNZohaib Khan's heroics help HBL beat WAPDA in finalMatch CoverageBetting OddsPresented ByBet365Quaid-e-Azam One Day CupABOUT COOKIES", "paragraph": "Habib Bank Limited (Zohaib 68*, Ramiz 55, Arshad 2-48) beat Water and Power Development Authority (Butt 56*, Rafatullah 51, Amade 3-49) by 62 runsAn all-round batting effort by Habib Bank Limited (HBL) was enough to overpower Water and Power Development Authority (WAPDA) in the Quaid-e-Azam One-Day Cup final, with Umar Gul's men clinching the trophy with a 62-run win. Put in to bat by WAPDA after losing the toss, all of HBL's top order contributed, with seven of the top eight reaching double figures. Zohaib Khan at No. 7 was the top scorer, as well as the fastest one, his unbeaten 68 coming off just 57 balls to help HBL surge close to 300. He was adjudged the Player of the Match. Aside from him, Rameez Aziz (55), Umar Akmal (49) and Imran Farhat (40) all kept the scores ticking over, without allowing the bowlers to stem the tide with regular wickets. It was WAPDA's internationally capped fast bowlers who were most expensive, with Wahab Riaz and Mohammad Irfan conceding 71 and 59 runs in their allotted quota respectively.In response, WAPDA overcame the early loss of Kamran Akmal to amass a 98-run stand for the second wicket, Rafatullah Mohmand and captain Salman Butt both scoring half-centuries. But after Agha Salman removed both batsmen within four overs of each other, the wheels came off the chase, and HBL took full control. No other batsman crossed 30 as HBL landed regular blows to WAPDA's hopes with intermittent wickets. As was the case with the runs, the wickets were shared around too, among five different bowlers, including Zohaib. By the end, WAPDA were running out of players, and found themselves bowled out with over five overs still to go.HBL and WAPDA had each finished third in their respective groups en route to the quarter-finals, but beat higher-ranked KRL and PTV to advance to the final.An all-round effort from Zohaib Khan helped HBL clinch the Quaid-e-Azam One Day Cup trophy by 62 runs against WAPDASign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}