{"id": "ESPNFaf du Plessis expects Australia to be 'nice and hostile'Sense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upFaf du Plessis expects Australia to be 'nice and hostile'ABOUT COOKIES", "paragraph": "Brace yourselves. South Africa are on their way Down Under for their first games against Australia since the epoch-ending ball-tampering scandal earlier this year.Australia received a hostile reception from South Africa's supporters during a bad-tempered tour leading up to the Newlands incident that resulted in bans for Steven Smith, David Warner and Cameron Bancroft, and South African captain Faf du Plessis is relishing the backlash he expects to receive from fans and the media in Australia.\"Australia is our favourite team to play against, all the stuff that comes with playing them, on and off the field, I love that and I feel that brings the best out of us as a team and even us as South Africans, we love that fiery competition,\" du Plessis said on the day of South Africa's departure for a limited-overs tour that includes three ODIs and a T20I.\"It will be nice and hostile. The last two tours home and away, it's certainly been very entertaining off the field. We are not expecting anything less. Zunaid our security officer has been working hard in the gym, he's prepared for whatever lies ahead,\" du Plessis said, possibly only half-joking. \"It is a bit of a poker game as well. We expect them to try and unsettle us as a team when it comes to the media space, obviously with myself being at the forefront of it, but we see it as part and parcel of touring Australia.\"It's definitely not an easy place to travel. The crowds do play their part, they're like a 12th man. Your mental capabilities and strength is just as important as your skill. For a lot of the new guys it will be the first time where they field on the boundary and they hear just how good they are as human beings.\"That will be a new thing for them. You don't get much of that anywhere else in the world anymore, it is the one place where you still feel like the crowd gets on top and really behind the home team.The fact that du Plessis has himself twice been found guilty of ball-tampering in the past won't escape the attention of the media, and he suggested that the entire squad would be under increased scrutiny. \"I do think this time round there may be one or two more traps for the players to try and stay away from,\" he said. \"But at the end of the day we want to go there and play a brand of winning cricket.\"Injuries have presented a further challenge, stripping South Africa's squad of batting experience and stalling the next stage of Vision 2019 - their blueprint for the World Cup. Du Plessis had wanted to be more settled on his World Cup probables by the time the team left for Australia, but injuries to Hashim Amla, JP Duminy and Wiaan Mulder have necessitated further tinkering.\"We were looking to fine-tune our balance a little bit more in this series, but then the JP injury is a big one for us, because he is a two-in-one player and we don't have a lot of them,\"du Plessis said . \"So now you're almost looking at two players instead of one in his place, so there are a few more new faces than anticipated for this series.\"Mulder and Duminy have both recently had surgery, Mulder on his ankle and Duminy on his shoulder, and both are expected to be out of action for at least three months. Amla's recovery has taken longer than expected, and the finger tendon injury he picked up during the Caribbean Premier League has affected his ability to grip the bat handle.Team manager Dr Mohammed Moosajee confirmed, however, that Amla is still expected to be fit to play as Durban Heat's marquee Protea player in the Mzansi Super League in November. \"Hashim picked up a finger tendon injury, which you need to treat very delicately,\" Moosajee said . \"He's doing well, he's in a brace at the moment. We're hoping that with another three weeks of rest he should be fit to play in the T20 league.\"At the other end of the spectrum, South Africa are also welcoming one player back from injury. Allrounder Chris Morris last played international cricket against India in February before injuring his back during the IPL. He has since returned to form and fitness in South African domestic cricket, and du Plessis looked forward to the \"X-factor\" that a fit and confident Morris might bring to his team.\"He's got so much X-factor as a white-ball cricketer, and this is an important tour for him to make sure he starts getting it right in terms of consistency,\" du Plessis said of Morris. \"We know on his day he's as good as any player in the world. Something that's always been important for him is that a confident Morris is a very good cricketer, and he'll have some confidence from his [domestic] performances. Fitness wise, I hear he's been working really hard.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}