{"id": "ESPNBangladesh-based company bags Cricket Ireland's first multi-year media-rights dealSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upBangladesh-based company bags Cricket Ireland's first multi-year media-rights dealABOUT COOKIES", "paragraph": "Total Sports Marketing (TSM), a Bangladesh-based sports-management company, has bagged Cricket Ireland's first multi-year media-rights deal. They will broadcast international matches of the Ireland men's cricket team for the duration of the ICC's Future Tours Programme between 2019 and 2022.Cricket Ireland CEO Warren Deutrom said that they are focusing on domestic audiences in Ireland and the UK, and that the deal will give his board financial stability.\"This is the first time that Cricket Ireland is engaging directly with the broadcast rights market and is another welcome development arising from our elevation to Full Member status of the ICC, and entry into the Future Tours Programme,\" Deutrom said. \"One of our priority objectives now is to work with TSM and our broadcast advisers Pitch International to ensure that, alongside our worldwide footprint, we also have visibility in our key domestic markets of Ireland and the UK, not just on TV, but also radio and online.\"The deal provides an element of financial stability for Cricket Ireland by allowing us to enter into multi-year budgeting processes. This, in turn, means we can - with more certainty - invest back into talent development and support the game at domestic and grass-roots levels.\"In May this year, TSM also bought the broadcast rights of Afghanistan Cricket Board for the 2018-23 period.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}