{"id": "ESPNAustralia's batting conundrum: show faith, tinker, or wholesale change?Sense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upAustralia's batting conundrum: show faith, tinker, or wholesale change?Time to go left field: how many can we name?ABOUT COOKIES", "paragraph": "Australia's first Test against India is six weeks away, and the composition of their top six for Adelaide is anyone's guess. Barring injury, the bowling attack of Mitchell Starc, Josh Hazlewood, Pat Cummins and Nathan Lyon is set, and Tim Paine will captain and keep wicket. But a 373-run defeat to Pakistan in Abu Dhabi shone a glaring spotlight on the top order. Australia made three changes to the top six from Cape Town to Johannesburg after the suspensions of Steven Smith, David Warner and Cameron Bancroft, then a further three changes to the next Test in Dubai before going unchanged into Abu Dhabi. How many will be made for Adelaide? Here are the contenders.Aaron FinchHaving only made his Test debut in Dubai, Finch is now virtually the only guaranteed starter for Adelaide with Usman Khawaja under a fitness cloud. Where Finch bats is a matter of debate. He was perfectly suited to opening in the slow, low conditions in the UAE. Although he opens in short forms in Australia, he has predominantly batted in the middle order in Shield cricket for Victoria. He will only theoretically be available for one Shield round before the first Test, which starts two days after the final T20I against India, but whether he will be allowed to play due to his heavy white ball workload remains to be seen.Usman KhawajaFitness is the only question mark for Australia's best batsman. He has six weeks to overcome a meniscus tear in his knee. He had surgery on Wednesday morning but an official recovery time is yet to be determined. The first Test starts on December 6, just over seven weeks from when he suffered the injury. The last Shield round before the Test starts on November 27 and there are initial hopes Khawaja could possibly be fit to play in that. Khawaja's Queensland premier club side Valley has a two-day fixture on December 1 and 2 that could provide an opportunity for some match practice if he did not meet the deadline for the Shield fixture.Shaun MarshThe 35-year-old is under pressure. The familiarity of his four failings in the UAE is the source of much consternation and thus the quality of the deliveries of three of those four cheap dismissals have not been considered as a result. His last 12 Test scores, all away from home read, 40, 33, 24, 1, 26, 0, 16, 7, 7, 0, 3, and 4. But his last summer at home against England produced two centuries, one of the highest order against the swinging pink ball in Adelaide, and two half-centuries. He also batted at No.5 in the Ashes as opposed to spots 2, 3, and 4 in the UAE. He is set to a play a mix of Shield cricket and ODIs in the lead-up to the first Test, with coach Justin Langer stating his retention in the ODI team was only fair given his twin centuries during the ODI series in England in June.Callum Ferguson is certainly worthy of mention after an excellent JLT Cup. He was the Shield's third leading run-scorer last year but made just one hundred. At 33, with one Test to his name, if not now, then when?Alex Doolan and Jake Lehmann both played well in the first Shield round on bowler-friendly surfaces. Doolan made a hundred, Lehmann a half-century and an unbeaten two-hour 33 to save the game for South Australia. But both had mediocre Shield seasons last year although Doolan did make 247 not out against Victoria and has Test experience.Marcus Stoinis has started the season superbly in both domestic 50-over and Shield cricket. But his overall body of work doesn't stack up against some of the other options with just four first-class hundreds to his name and none in the last two Shield seasons.Kurtis Patterson is a name that continually gets mentioned but his last Sheffield Shield century was scored in October 2016.Matthew Wade has played as well as anyone in Shield cricket in this calendar year. He scored three centuries last season and opened the season with twin half-centuries at the Gabba in a low scoring game. Paine's keeping spot is not in question but could Wade be an option in the middle order as a batsman only, a la Jos Buttler for England? He does have two Test hundreds.Jake Weatherald is another name on the lips of experts but would need a consistent set of Shield scores to put himself in the frame.The boltersWill Pucovski's 243 against Western Australia has vaulted him into the reckoning. The names he joined on the list of youngest double-century makers in Sheffield Shield cricket are the who's who of Australia cricket, including Sir Donald Bradman, Ricky Ponting, Ian Chappell, Doug Walters and Darren Lehmann among others. Another big score and the chorus of calls will come but has been ruled out of the next round due to illness.Josh Philippe is an exciting prospect but extremely raw. He would need an exceptional set of scores over the next three Shield games to leap the queue that could stretch across the Nullarbor.Travis HeadLike Finch, Head showed promise in the UAE without capitalising on a couple of important starts. His 175-ball 72 was vital to Australia saving the Dubai Test and that alone should see him start in Adelaide. But his twin dismissals against Mohammad Abbas in Abu Dhabi need addressing as India's fast bowlers, particularly Ishant Sharma, would have taken keen note of his propensity to play at the ball that is moving well away from his off stump. He will also have a mix of Shield cricket and ODI cricket to prepare for his first lengthy Test series.Mitchell MarshAustralia's new vice-captain is a vexed question. What to do with him and how to best deploy his raw ability? The facts are he is 27, has played 51 Test innings and has passed 50 just five times. The last of those was an outstanding, match-winning 96 against South Africa in Durban, coming on the back of two breakout centuries in the Ashes. But like his brother the numbers since then are stark, 6, 4, 45, 5, 16, 4, 0, 12, 0, 13, and 5. But unlike his brother, there were no caveats to his dismissals in the UAE. The hours of work spent on tightening his defence with batting coach Scott Meuleman in 2017, were undone by a 28-year-old former welder in the same manner on three occasions in the UAE. He will only have white-ball cricket to prepare for the first Test, save for maybe the round five Shield game on November 27. Again, workload management will dictate his availability.Marnus LabuschagneHis selection for the UAE tour came out of the blue and his Test debut also came as a shock after Matt Renshaw suffered concussion in the warm-up game and was then omitted. Labuschagne's legspin was a revelation and his fielding was excellent save for a key drop of Fakhar Zaman on the opening morning in Abu Dhabi. After a shaky start he showed promise with the bat, playing Yasir Shah with increasing confidence. If not for a farcical run out and a slightly unfortunate dismissal in the second innings he might have been able to post twin half-centuries. He is not guaranteed a spot in Adelaide and Shield runs will be needed to shore up his place. But he is not the man under the most pressure and despite a fortunate path into the team he may be given an extended run on the back of the glimpses of promise he showed.Matt RenshawDespite being fit to play in Dubai his omission due to a lack of competitive cricket in the lead-up raised eyebrows. However, by not playing his stocks for Adelaide may have only risen. He made an unbeaten 145 on immediate return from the UAE for his premier cricket team Toombul in Brisbane on Saturday. Unless he has a spectacular run of outs in Queensland's next three Shield games he appears almost certain to open the batting in Adelaide.Peter HandscombThe 27-year-old was all set for the UAE until a string of low scores during the Australia A tour of India caused the selectors to baulk at his inclusion. He has spent the Australian winter tweaking his unique technique with CA high performance coach Chris Rogers and those changes need time to bed down. He had a very good JLT one-day domestic tournament for Victoria leading them to the title. Shield runs will be his ticket to Adelaide. He missed out in his only innings in Perth last week. He has three more games to make a statement.Glenn MaxwellMaxwell's omission from the UAE Test squad was widely condemned. Like Renshaw his stocks would have only risen, at least in the public's estimation, having not played. How he gets into the team for Adelaide is the question. He will only have T20I and ODI cricket to make a case. That did not stop Finch from getting selected. The instruction from Justin Langer was to score hundreds, and Maxwell didn't provide them in the JLT Cup despite a couple of golden opportunities to do so. But in fairness to him, centuries are exponentially more difficult to score from the middle order in 50-over cricket than they are from the opening positions.Joe BurnsFor all of the public outrage over Maxwell's omission, Burns' non-selection for the UAE caused the most head-scratching amongst the Australian cricketing fraternity. He played in Johannesburg making 4 and 42 after horrific preparation. He made 725 runs at 55.76 in the Sheffield Shield last season despite missing four games with a torn adductor. He made two centuries, one an unbeaten double. Aside from Khawaja and Shaun Marsh, he has more Test centuries, three, than every other contender on this list. A string of poor scores in his lone Asian tour, in Sri Lanka 2016, where he only played two of the three losing Tests appears to still be a black mark on his record. It must be remembered, Khawaja's highest Test score in Asia prior to the UAE tour was 26, Burns' is 29 in four innings. Burns was knocked over twice cheaply on a seamer's paradise at the Gabba last week. Shield runs will also be his ticket back and he is on Langer's radar after the pair had a conversation post his UAE omission.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}