{"id": "ESPNBen Foakes 'very much in England's thinking' for first TestSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upBen Foakes 'very much in England's thinking' for first TestABOUT COOKIES", "paragraph": "Ben Foakes and Jos Buttler both kept in training for England in Galle ahead of the first Test with Sri Lanka, starting on Tuesday (0:50)Head coach Trevor Bayliss has admitted England have \"some thinking to do\" before deciding on their team for the Galle Test. With Jonny Bairstow now confirmed as an absentee for the first Test, which starts on Tuesday, England still have to decide who will keep wicket, who will bat at No. 3 and on the balance of their side.They arrived at the ground on Sunday and were surprised to find just a little moisture in a pitch that otherwise looked pretty good for batting. With heavy rain again curtailing training, the ground was covered raising the prospect that the surface may not dry out as much as was previously expected. As a result, England are hesitating before confirming the selection of all three spin bowlers on a pitch that usually provides copious assistance for such bowlers.\"We've got a bit of thinking to do,\" Bayliss told Talksport. \"We're not committing to an absolute 11 at this very moment. We'd be silly to do that in these weather conditions.\"The pitch has a little moisture in it at the moment but there's still two days to go. If the covers are down for a little while it might hold some of that moisture but I still expect it to dry out and spin as the game goes on.\"It's a harder selection from the point of view that we're not discussing one position. We're discussing three or four positions. So it's very hard.\"With Bairstow ruled out of this game - but back in training and understood to have a good chance of returning for the second Test - Bayliss confirmed that either Jos Buttler or Ben Foakes will keep. While Foakes has yet to play international cricket, he is the higher-rated keeper, with Buttler admitting towards the end of the limited-overs series that he had not been satisfied with the level of his own keeping in recent times.\"I think Jos would be the first to agree he's kept better at different times,\" Bayliss said. \"We know he is a good keeper but sometimes here, on these different wickets, it doesn't come through quite so well and it shows up a little bit of footwork. But he's been in the nets and working very hard over the last week or so and gloved them pretty well in the practice game.\"Buttler and Foakes are both still very much in our thinking. Definitely one of them will be keeping but how we structure the batting order and what combination of bowlers we put in to the team could determine who eventually gets the gloves.\"We've got to pick a team we think can take 20 wickets on some of these pitches in Sri Lanka.\"Among the options to be considered by Bayliss and Joe Root - Ed Smith is in Galle but does not select the final XI - is playing either Moeen Ali or Ben Stokes at No. 3. But there are concerns that their workload as bowlers could prove too onerous. As a result it remains possible England could also play Sam Curran and Chris Woakes among an allrounder-studded line-up that includes four seamers and three spinners. In that eventuality, Buttler would have to keep and bat No. 6.\"Yes, that's been one of the discussion points,\" Bayliss said. \"Moeen batted at No. 3 in the last Test at home. But his bowling workload is a concern if we want him to bat at three. How will he handle bowling maybe 40-plus overs in an innings?\"It might give the allrounders a break [if we played seven bowlers]. Ben Stokes, for example, is in the team because he bats. It's a bonus that he bowls. It's a little bit the same with Moeen, too, even though he probably bowls a little more. It just allows us the opportunity to put in the extra bowler or an extra batter when we want to, depending on the conditions. And if we do go with three spinners we've got right arm offspin, left-arm orthodox and legspin. We've got all bases covered.\"But we certainly haven't finalised an XI yet. We want a final look at the wicket over the next 24 hours. I think we're getting closer but I think we'd be silly to make a decision now two days out.\"1800 GMT - This story was updated with embargoed quotesTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}