{"id": "ESPNRanasinghe retained in Atapattu-led Sri Lanka women squadSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upRanasinghe retained in Atapattu-led Sri Lanka women squadABOUT COOKIES", "paragraph": "Sri Lanka have named a largely unchanged side to the one that lost at home to India last month. They made just two changes to the 15-member squad for November's Women's World T20 in the Caribbean.Oshadi Ranasinghe and Inoshi Fernando, who were out of the initial squad to face India only to be included midway through the series, have been retained. Ranasinghe picked up four wickets across the final two games in that series and scored a brisk 22 in the final T20I, while offspinner Fernando picked up three wickets in the same game.Imalka Mendis, who was named in the squad to face India but failed to play a game, made way, as did batsman Anushka Sanjeewani. The team will be led by Chamari Atapattu, whose century in the final ODI against India had given Sri Lanka their first win over their neighbours in over five years.Sri Lanka begin their campaign with warm-up games against New Zealand and Ireland on November 5 and 8 respectively, before facing England on November 10 in their tournament opener.Full squad: Chamari Atapattu (Captain), Yasoda Mendis, Shashikala Siriwardene, Eshani Lokusuriyage, Hasini Perera, Ama Kanchana, Rebeca Vandort, Dilani Manodara, Nilakshi De Silva, Sripali Weerakkody, Udeshika Prabodhani, Sugandika Kumari, Kavisha Dilhari, Oshadhi Ranasinghe, Inoshi Fernando. Standby list: Imalka Mendis, Anushka Sanjeewani, Nipuni Hansika, Harshitha Madavi, Inoka RanaweeraTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}