{"id": "ESPNAaron Finch leaves Test series baggage behindSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upAaron Finch leaves Test series baggage behindABOUT COOKIES", "paragraph": "In 2013, Chris Rogers finished his first full Test series and within a handful of days was back playing for Middlesex in the County Championship. Battling through scores of 8 and 2 against Somerset at Lord's, he found himself far more exhausted than expected, having realised the mental toll of the game's longest form.Five years on and Aaron Finch finds himself about to lead Australia's T20 side just four days after the conclusion of his own first Test series, where he performed creditably in the touring team's 1-0 defeat by Pakistan, who now seek to defend their No. 1 ranking in the 20-over format.It was a task Sarfraz Ahmed's side accomplished with aplomb in a Zimbabwe triangular series earlier this year, but Finch has now been bolstered by plenty of talent from the Big Bash League, not least Chris Lynn, fit enough to be considered after missing the mid-year tour with his persistent shoulder problems. Pointing out that he was the lone survivor of the Test top six, Finch reckoned any \"baggage\" would be at a minimum.\"There's nine fresh guys that have come into our squad from the Test series, so there'll be no baggage from them whatsoever. I think I'm the only batsman out of the top handful that was here for the Test series,\" Finch said in Abu Dhabi. \"So I think in that regard they're just going to come in and play their natural game. They're all really good strikers of the ball, but I don't think batting outweighs bowling in any way, I think your defensive bowling is the most important thing, along with your batting.\"Teams who take wickets in the Powerplay tend to win games, and teams who when they get a team on the ropes really squeeze them I think goes a long way to winning the game. We're going to have our game plans on how we approach it and how we plan out our game, so it'll be an exciting three games. Both sides are very attacking, particularly in the Powerplay, both sides have plenty of power, so it'll be a great series.\"[Lynn] played nicely [against UAE], being injured for quite a while it's always a bit uncertain with Chris in the field, whether he's diving and stuff like that, but from all reports he's 100%, he says he's feeling great at the moment, it's great to have him back. We've also got Ben McDermott who made his debut yesterday and played really well towards the end of the innings. When you have new guys coming in it's really exciting, particularly on their debut.\"In the Pakistan side, Finch said the threat posed by the wrist spin of Shadab Khan, returned from injury, would be keenly monitored by the Australians on surfaces likely to provide some assistance for the slow bowling craft. \"He's a world-class spinner Shadab, I thought we played him really well in Harare on a wicket that was spinning a little bit, especially towards the back end of that tri-series,\" he said.\"Both sides are pretty familiar with each other coming off that tri-series in July and also a Test series. There's a lot of work that goes in from backroom staff and players individually preparing for each game and each series and each opponent individually, but as a collective there was some good knowledge on both sides from that tri-series. Their spinners play a big part in their plan as well, so we're going to have to play well against them to be a chance and to win this series.\"As for favouritism, Sarfraz has argued that Australia were No. 1 in the world based on their bevy of BBL stars. Finch, though, looked only upon the world rankings. \"They're all world-class players, they're No. 1 in the world for a reason, and no doubts they go in with the favourite tag,\" Finch said. \"So I think there'll be more pressure on them than there will be on us.\"\"Any time you're playing a series against another country is important, and everyone wants to win, so regardless of if the No. 1 ranking is on the line or if you're playing anyone.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}