{"id": "ESPNGibson hopes for fresh start after Newlands sagaSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upGibson hopes for fresh start after Newlands sagaABOUT COOKIES", "paragraph": "Amid the soul-searching around the results of Australia's Longstaff review, visiting South Africa coach Ottis Gibson pointed to something that was lost in the unfolding uproar since the cataclysmic ball-tampering incident at Newlands in March. When all eyes are focused on events happening off the field, no-one's talking about the actual cricket.\"It's disappointing when cricket gets lost among all the other stuff, because at the end of the day that's why we're all here: to play some cricket,\" Gibson said. \"When you look at the cricket that was played in that series, after every game there was some sort of incident and the standard of cricket never got mentioned. I thought in the first Test in Durban, [Mitchell] Starc was fantastic and bowled really well. In Port Elizabeth, we were backs against the wall and AB de Villiers makes a brilliant hundred, then you had another incident at the end of that game.\"The independent review has suggested that a bullying corporate culture within Cricket Australia contributed to the errant player behaviour that came to a head during a bad-tempered series. Gibson also pointed out another truth that doesn't fit within an ultra-competitive, win-at-all-costs mindset: ultimately, it's just a game.\"Guys are making friends and playing together in other teams around the world. So when it comes to playing for the national team, you don't expect them to take that friendship onto the field, but obviously, you don't want it to boil over into some of the shoulder brushing and all the stuff that happened in South Africa. It's just a game,\" he said, repeating: \"It's just a game\".Gibson refuted the suggestion that there had been especially intense scrutiny of Australia's handling of the ball during that series, saying that South Africa were well aware that the ball \"is being followed all the time\", even before the infamous Cape Town Test. \"The international game now, the way cricket is going even in the IPL and other leagues, there's so much television and so much coverage that the ball is being followed all the time, is what we've been told, even before the Cape Town [Test]. So it just seemed like a silly thing to do, bearing in mind the number of cameras and the number of eyes that are on the game at the moment.\"We moved on a long time ago. It happened many months ago now. Obviously, it shouldn't have happened, we all accept that it shouldn't have happened.\"While South Africa might have moved on, that hasn't been possible for their hosts. The Australian Cricketers Association has reiterated its call for a reconsideration of the harshness of penalties handed down to Steven Smith, David Warner and Cameron Bancroft in light of the findings of the review. Gibson said that hindsight might have changed perceptions about the players' bans, adding that culpability must fall to CA to decide whether the punishment still fits the crime.\"What happened called for strong action and, I guess, that's what the people who made the decision at the time thought was strong enough,\" Gibson said. \"Now we're six months down the road, and everybody has had a bit of time to step back and see what's going on, and obviously, some people think that it has been too harsh. But was that their same opinion six months ago when it all unfolded? Hindsight gives us the opportunity to step back and look at things, but what happened shouldn't have happened, and therefore, it called for an action and that's the action that was taken. It's up to those people to decide whether it's too harsh.\"Gibson empathised with Australia coach Justin Langer, and admitted that the team South Africa will face in three ODIs and a T20I over the next two-and-a-half weeks have \"had their issues\".\"It's been well-documented, and still being documented even now. I'm sure Justin Langer and his coaching team would like to put it all behind them and focus on cricket, and that's what we'll be focusing on.\"Gibson's squad has been in Australia preparing for nearly a week, and their tour match against a Prime Minister's XI will be their first - and only - opportunity for some time in the middle before the opening ODI in Perth on Sunday.\"We have had a couple of good days in Perth and we are looking forward to this game,\" he said. \"It is our first actual match, the guys get tired of net sessions, so we want to get out in the middle.\"South Africa are without the experienced pair of Hashim Amla and JP Duminy for this series, with both recovering from injuries, and while they used their limited-overs games against Zimbabwe earlier this month to field-test new options, these ODIs against Australia signal the start of an important next phase of their preparation for the World Cup.\"We are halfway to our preparation for the World Cup, that is what we are focusing on,\" Gibson said. \"This is the next step on that World Cup journey. We have been trying to play a certain brand of cricket, a little bit more positive and aggressive, and we would like to test that out.\"The team that Australia has put out, despite what is going on off the field, we have to respect them. They still have quality players. This will be an opportunity for us to test ourselves against them and to see where we are.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}