{"id": "ESPN'No one is close to his genius'Sense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-up'No one is close to his genius'ABOUT COOKIES", "paragraph": "Virat Kohli smashed records on reaching the milestone of 10,000 ODI runs. Here's how the cricketing fraternity reacted on social media.Virat Kohli stands alone, no one now or ever is close to his genius! #ODI #INDvWISoftware update all the time. Virat Kohli has redefined what consistency means. Got his 9000th odi run just 11 innings ago and got his 10000 th today, to go with his 37th century. Enjoy the phenomena #KingKohli pic.twitter.com/OPhvIsBRDJOne of the finest reaching 10k in a hurry @imVkohli take a bow..congratulations an all the best.#stayblessedSwitch on the TV, @imVkohli is batting on 144 having crossed the collosal 10k run mark. Double it up now as they would be calling for it in the dressing room. #battingartist #INDvWINODI runs and in no time!! Congratulations on the record @imVkohli #Virat10k Congratulations to @imVkohli to achieve milestone of 10000 runs in ODI cricket , Great player & Humble human , u entertaining all fans of cricket with ur Skills , Passion & determination , stay blessedTake a bow the greatest limited over cricketer EVER!! I bet you'd get 20,000 ODI runs. Congratulations. Here's to 10,000 more!! @virat.kohli @indiancricketteam @icc #GOAT #10000runsA post shared by  Robin Uthappa (@robinaiyudauthappa) on Oct 24, 2018 at 5:19am PDTAnd the insanity continues with an undying intensity. Congratulations #KingKohli on 10,000 ODI runs and 37th century. The hunger, consistency and intensity is simply incredible pic.twitter.com/DGoP1GlZ01Well done @imVkohli on becoming he fastest man to 10,000 runsWhat is next on your list to off? #INDvWINExactly why he is the!! #Fact https://t.co/oE1vhsZtAqCongratulations #KingKohli on becoming the fastest to 10000 ODI runs. What a player ! pic.twitter.com/fUkMgldTExFastest 10k odi runs.Legendary stuff from #ViratKohli\"Century pe century baar baar, run hue pure dus hazaar!\" Heartiest congratulations brother @imVkohliFastest player ever to complete 10,000 ODI runs! What a remarkable journey it's been so far!#ViratKohli #Virat10K pic.twitter.com/HRzLEGaxzNYou are not just a run machine but also a ton machine, @imVkohliCongratulations on your amazing achievement of becoming the fastest player to reach 10K runs#KingKohli #INDvWITo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}