{"id": "ESPNRai, Edulji depose before BCCI harassment investigationSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upRai, Edulji depose before BCCI harassment investigationABOUT COOKIES", "paragraph": "The independent inquiry committee set up to probe allegations of sexual harassment against BCCI chief executive officer Rahul Johri held its first full day of hearings on Monday, with the two-member Committee of Administrators comprising Vinod Rai and Diana Edulji, BCCI treasurer Anirudh Chaudhry, former Mumbai captain Shishir Hattangadi and whistleblower Aditya Verma testifying before it.After his testimony - which could involve a third allegation against Johri - Hattangadi said the session was \"structured\", transparent and \"to the point.\" \"Pertinent, point of references clear, seeking clarity in the probe, no subject outside the terms of reference were discussed,\" Hattangadi said after reporting to the inquiry committee. He said he was \"very impressed\" by the panel, which gave him the \"respect\" of being a former Ranji captain. \"There was a clear structured method. Very impressed with the clarity over the deposition method.\"His appraisal was in contrast to earlier comments made after he'd received a response from the committee with Verma copied into the conversation. Hattangadi had said he was \"appalled\" and that the committee's action \"rules out the confidentiality of any communication and sends a signal of the communication being flippant rather than stringent and \"one-on-one\".On October 26, Hattangadi revealed that a friend of his contacted him to check how she could approach the CoA, the Supreme Court-appointed supervisory authority of BCCI, to lodge a complaint of \"harassment\" against Johri. Having heard her case, which he found \"authentic\", Hattangadi put his friend in touch with former Indian women's captain Edulji, who is part of the two-member CoA, which is headed by Rai, the former Comptroller and Auditor General of India. Hattangadi then put out a post on his Twitter, saying he would be happy to \"testify' in front of the inquiry committee, if it wanted him to.The independent inquiry committee, comprising Rakesh Sharma (former judge of Allahabad High Court), Barkha Singh (former chairperson of Delhi Women's Commission) and Veena Gowda (human rights lawyer), originally wanted to question Hattangadi over Skype, but he insisted on testifying in person, which he finally did on Monday.The first person to depose in front of the inquiry committee was Neeraj Kumar, former head of the BCCI's anti-corruption unit till last year before his contract was not renewed owing to his being over 65. Kumar spoke to the inquiry committee last Saturday via Skype and is understood to have provided details concerning an alleged harassment of a current BCCI employee by Johri.It cannot be confirmed whether the employee, who was shifted to another department, has written to the inquiry committee, but she was on the verge of quitting the BCCI until the CoA intervened to resolve the issue. It is understood the CoA has already forwarded all the material concerning this issue to the inquiry committee.Verma was the first one to depose on Monday, followed by his legal counsel Sanjeev Mishra. It was Verma who had challenged the committee's initial response asking him to establish his \"locus standi\" concerning the allegations against Johri. Verma retorted saying, the language that the inquiry committee used would \"scare away complainants rather than make it conducive for them to complain about being harassed.\" Verma was eventually invited, and according him he testified for about 90 minutes.Chaudhry was the only BCCI office bearer to meet the inquiry committee. He had written to them before the deadline closed last Friday.It may be significant that the inquiry committee questioned Rai and Edulji again. The interviews were done separately, but this is the second time both of them have been spoken to by the inquiry committee since it formally started work on October 30.The depositions will continue this week and ESPNcricinfo understands that both Johri and Hattangadi's friend are likely to testify.As per the terms of reference, the CoA gave the inquiry committee a fortnight to finish the probe against Johri. It is also understood that the CoA will accept the inquiry's committee's decision as final. Both parties, the complainant as well Johri, have the option to contest that decision in court.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}