{"id": "ESPNEngland seal series with latest comfortable DLS victorySense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upEngland seal series with latest comfortable DLS victoryABOUT COOKIES", "paragraph": "Take a look at social media's reactions as England seal an ODI series win with an 18-run DLS victory over Sri Lanka (1:44)England 132 for 2 (Roy 45) beat Sri Lanka 273 for 7 (Shanaka 66, Dickwella 52) by 18 runs (DLS method)\nScorecard and ball-by-ball detailsSri Lanka overcame their-now traditional mini-collapse to post a respectable 273 for 7, but the efforts of the lower order, who had propelled them to that score, were not enough to deny England another comfortable victory.In yet another calm and proficient display of batting, England cruised to 132 for 2 at the end of 27 overs - captain Eoin Morgan and Joe Root hitting 56 in each other's company to hoist the team to safety. When the forecast monsoonal deluge hit, they were 18 runs ahead of the Duckworth-Lewis-Stern par score. The series now sewn up 3-0, England head to Colombo's dead rubber with the licence to give their second-choice players a run.Sri Lanka can at least dwell on a few decent batting performances, chief among them that of Dasun Shanaka, who struck a run-a-ball 66 to re-energise the Sri Lanka innings after Moeen Ali and Adil Rashid had lorded it over the early middle overs. Had he not attempted a suicidal single just as he was starting to ramp up the big hitting in the death overs, Sri Lanka might have managed a score closer to 300. Other lower-middle order contributors included Thisara Perera, who made 44 off 41 balls, and Akila Dananjaya who hit a tenacious 32 not out off 26.In response, the visitors just never looked like they were daunted by the target. The first over, bowled by Lasith Malinga, yielded 12 runs, with wicketkeeper Niroshan Dickwella unable to stop two balls from running away for four byes each. Jason Roy was comfortable against the left-arm spin of Amila Aponso, which you suspected had been specifically deployed to unseat him. Dananjaya struck twice in his first four overs to eventually get rid of both openers, but Morgan and Root - both monsters against spin - ensured England's advance continued smoothly.The only possible late hiccup for the visitors was when Root top edged a sweep off a full toss to short fine leg, but although the catch was completed, eagle-eyed umpire Lyndon Hannibal denied Sri Lanka a wicket. The umpire had spotted that Kasun Rajitha had not entered the circle at mid-off, and ruled that delivery a no-ball, on account of too many fielders being outside the circle. Even if that wicket had been awarded, however, England would probably have been ahead of the DLS par-score when the rains came.Earlier, having arrived at the crease with the score on 102 for 4 and three wickets having fallen in the space of 13 runs, Shanaka had immediately cut a confident figure at the crease. He reverse-swept Mooen for four eighth ball, before tonking towering sixes off the spinners in the following few overs.He probably should have been out for 24, though. He lined up the midwicket boundary with a slog sweep, but should have been caught on the rope by Alex Hales, who failed to close his hands around the high chance, while leaning backwards over the rope. A six was the result. England, in general, were sloppy on the field, several fielding lapses marring their performance, while they spurned three clear-cut wicket opportunities.That Moeen had created so many chances before Shanaka arrived, was perhaps down to Sri Lanka's top-order batsmen being more aggressive against him, compared to their watchfulness against Rashid. Having begun his spell the moment the first Powerplay concluded, Moeen was accurate and guileful, occasionally gaining substantial turn. He was the man who set in motion the mid-overs slump in the Sri Lanka innings, bowling and advancing Dinesh Chandimal through the gate in the 19th over, before getting Dickwella lbw - Dickwella having helped lay some sort of foundation for Sri Lanka with a 70-ball 52.Rashid, whose variations the batsmen did not always read, was more difficult to milk for singles, and collected the third wicket in Sri Lanka's mini-collapse, trapping the struggling Kusal Mendis in front with a slider. He collected 1 for 36 from his 10 overs; Moeen took 2 for 55.Aside from the poor fielding, England's other major failing was their bowling at the death. Olly Stone was expensive, leaking 50 runs from his seven overs, and neither Ben Stokes nor Tom Curran were especially miserly either. Given the paucity of Sri Lanka's lower-order batting, England will feel they should not have given away even as many 74 in the last 10.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}