{"id": "ESPNTactical decision to not give Mitchell Starc new ball - Aaron FinchSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upTactical decision to not give Mitchell Starc new ball - Aaron FinchABOUT COOKIES", "paragraph": "Australia captain reflects on the team's seventh straight ODI loss in Perth (0:45)Australia's captain Aaron Finch has revealed he abandoned the new-ball skills of Mitchell Starc as an attempt to find a way out of their recent ODI losing streak - now 17 defeats in 19 matches following a six-wicket trouncing by South Africa in Perth.Defending an inadequate total of 152, there was widespread surprise when Australia opened up with Josh Hazlewood and Nathan Coulter-Nile rather than Starc, the first time since September 2014 that he had not been called upon to use the new ball in an ODI.South Africa certainly couldn't believe their luck, collaring 16 from Coulter-Nile's opening over before Starc was swiftly called in for the fourth over of the innings. Finch said the decision had been to do with seeking a fresh tactical edge rather than any fitness concerns for Starc, who entered the series with Billy Stanlake as injury cover after complaining of hamstring tightness during the UAE tour.\"We'd planned to go in with Coults and Josh with the new ball,\" Finch said. \"It didn't work out for Coults in the first over today, then we went to Starcy pretty quick. It's just a tactical thing to be honest. Sixteen out of 18 losses in a row, 17 out of 19 now, we're looking for something to try, to try some new things, something different.\"If you keep doing the same thing over and over it's the definition of insanity, isn't it? We're looking for a combination, looking for a method. Obviously, a few more runs would be handy as well.\"When you're defending a low total it feels like you have to over-attack. It's almost like the quicks can't settle in to their work. They're always searching for something.\"The choice of Coulter-Nile and Hazlewood over Starc reflrcted an Australian set-up that is straining every sinew to find new and better ways of performing, perhaps even to the point of overthought. Reacting to the result, Finch intoned his belief that the wheel would turn. In his position it is impossible to publicly conclude anything else.\"It will turn,\" Finch said. \"The way that we're training, believe me, the way that we're training and preparing the wheel will turn and it will happen quickly. It might not be tomorrow, it might not be the next day. But I think if we keep improving and keep practicing as we are it will turn.\"You'd say guys at times are probably doubting themselves. When guys are not performing as well as they can do and have done in the past there's always going to be a little bit out of doubt. When South Africa bowled as well as they did today you have to be at your absolute best to get through that.\"We can't question the way anyone's been training or preparing. It's been spot on. It's just one of those things. You're only one good shot away from feeling on top of the world again.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}