{"id": "ESPNCanterbury hold on for draw with one wicket in last sessionMatch CoverageBetting OddsPresented ByBet365Plunket ShieldABOUT COOKIES", "paragraph": "Northern Districts 378 (de Grandhomme 115, Brownlie 77, McConchie 2-41) & 234 for 6 dec (Cooper 58, Henry 2-64) drew with Canterbury 228 (Murdoch 59, Sodhi 3-48) & 221 for 9 (Boyle 108, Nicholls 54, Sodhi 4-82, Wagner 3-50)A maiden century from 22-year-old opener Jack Boyle followed by a lower-order collapse kept Northern Districts only one wicket away from victory against Canterbury at the Hagley Oval, in the only match of the second round that went to the last day.Chasing a stiff 385 after Northern Districts declared on 234 for 6 on the final day, Canterbury were led into the last session with a valiant century from Boyle and a half-century from Henry Nicholls. Canterbury needed 211 runs in the final session and while they would have looked for a draw, the international duo of Ish Sodhi and Neil Wagner gave them a scare. With 15 overs left in the day, Sodhi had Boyle caught at slip for 108 only five overs after James Baker had dismissed Nicholls to break the 141-run third-wicket partnership. To add to Canterbury's problems, captain Cole McConchie was snapped by Sodhi too and No. 5 Ken McClure had to retire hurt for 14 after being hit by a bouncer by Wagner.It looked like Northern Districts would wrap things up when Sodhi and Wagner ran through the tail to dismiss Matt Henry for 5, and the trio of Cam Fletcher, Andrew Hazeldine and Will Williams for ducks. With only one wicket left, the pair of Theo van Woerkom and Fraser Sheat, who have played less than 10 first-class matches each, saw through the final seven overs of the day to clinch four points for Canterbury compared to Northern Districts' eight, which would have been 20 had the won.Earlier in the day, Northern Districts resumed from their overnight 204 for 5 to add another 30 runs before the declaration. They had taken a first-innings lead of 150 after they were put in to bat and Colin de Grandhomme scored a rapid 115 off 135 balls - his 12th first-class hundred - at No. 6 after his side was 168 for 4. Half-centuries from Dean Brownlie (77) and Sodhi (50) meant they scored a respectable 378 before Sodhi took three wickets, Wagner two and they restricted Canterbury to 228 after a half-century from Stephen Murdoch. Northern Districts continued their dominance by declaring in their second innings but were left with a draw.Canterbury's last-wicket pair survived seven overs to earn them four crucial points, while Northern Districts collected eight. The win would've been worth 20 points had they wonSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}