{"id": "ESPN'Used to the unpredictability of Mirpur pitch' - MashrafeSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-up'Used to the unpredictability of Mirpur pitch' - MashrafeABOUT COOKIES", "paragraph": "Bangladesh are now used to the unpredictable nature of the pitch at the Shere Bangla National Stadium, said captain Mashrafe Mortaza. While Zimbabwe expect spin to play a big part, Mashrafe warned that even turn can't always be assured in Mirpur.In the last three years, teams have struggled to push the scoring rate under lights. It has been more favourable for teams batting first as the pitch has changed nature with lots of use. As recently as February this year, the stadium was slapped with a demerit point when the second Test between Bangladesh and Sri Lanka ended on the third afternoon.Since April 2015, the side batting first has won 14 out of 23 ODIs, averaging 241 per innings, while those chasing have managed only 196. Bangladesh's 251 for 2 against Pakistan in 2015 is the highest successful chase in this period.Mashrafe said that sides with tougher mentality - Bangladesh themselves since 2015 - have done well in Mirpur. But whenever they have been impatient, they have lost, as was the case in the tri-nation series final against Sri Lanka in January this year.\"Mirpur wicket is unpredictable because it changes behaviour almost suddenly,\" Mashrafe said. \"It keeps low or starts turning without warning. Batsmen have to quickly change their mindset in the middle, and also in the dressing-room. Most of the senior players have played here for more than ten years, so we are now used to the unpredictability. It obviously becomes hard for the opposition.\"Only when we started to believing in ourselves since 2015, did we have a good record here. In cases when we were mentally weak, like in the Asia Cup final [in 2012], we lost here.\"Mashrafe expected his players to be able to deal with whatever surface is prepared for the first ODI on Sunday. \"Chittagong is predictably a batting wicket unless it is prepared slow or a turning track. Mirpur is totally different. It starts behaving differently after the half-time. I hope the boys won't use it as an excuse. It is always helpful if we think of scoring 250-260, which always puts pressure on the opposition in Mirpur,\"Zimbabwe captain Hamilton Masakadza said that spin remains the major challenge for his batsmen, particularly in the subcontinent. \"It is obviously one of the things you focus on when you play in the subcontinent. Spin plays a very big role. We have prepared for it. It is in the back of our minds.\"The main thing is to stay positive and back ourselves. We also have to deal with the challenge of spin. We can go forward from here after the recent disappointments.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}