{"id": "ESPNThis much we know: Eoin Morgan can't be dropped, October is a rubbish month for cricketSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upThis much we know: Eoin Morgan can't be dropped, October is a rubbish month for cricketABOUT COOKIES", "paragraph": "England's rain-affected ODI series in Sri Lanka was their penultimate opportunity to finalise their squad for the 2019 World Cup. And in spite of a crushing defeat in the final match at Colombo, they ended this leg of the tour with several issues confirmed.Ahead of this series, there had been whispers about Eoin Morgan's place in the side. That was understandable: with a batsman as good as Alex Hales fighting for a place, Morgan's somewhat streaky form - he had scored one fifty in 15 innings up to and including the defeat in Edinburgh in June - was becoming a talking point. He acknowledged this ahead of the series when insisting he would have no hesitation in dropping himself if he wasn't contributing sufficiently. But Morgan offers more than runs: as the leader of this side, he has played a huge role in transforming it from also-rans at the last World Cup to favourites going into the next one. The drop in intensity shown by England in the field when Morgan left himself out of the final game was revealing though it may, in part, have been due to the fact the series was already settled. Morgan rediscovered something like his best form with the bat, too. He has scored half-centuries in four of his last six ODI innings (and six of his last 10) with the other two both not out. Any suggestion that England could do without him has been banished.It would be harsh to judge Sam Curran on one game played on a very flat pitch. But the fact is, with only one series to come before England select their World Cup squad, that was probably his one opportunity to show what he could do. While doubts remain about how often David Willey will contribute 10 overs - he has done so only twice in his 25 most recent ODIs - he is dangerous with the new ball and showed notable improvement over the course of the English summer both with his batting and his ability to come back into the attack with the older ball. Morgan made the point in the press conference after the series in acknowledging England saw Curran as \"a potential replacement if Willey is injured\". Aged 20, Sam Curran may have a huge part to play in several World Cups but he may be reliant on injury to Willey to play any part in the 2019 one.Chris Woakes' value was demonstrated most keenly when he didn't play. Without him in Colombo, Sri Lanka were able to start brightly - England conceded more runs in the first 15 overs than any time since February 2016 - and England's spinners were obliged to bowl against well-set batsmen. There is no doubt that Woakes will, if fit, take the new ball for England in the World Cup. There's not much doubt, either, that Liam Plunkett will bowl in the middle overs of the innings. While his return to the side in Colombo was underwhelming, and it seems he is unable to generate the pace he once could, his ability hit the pitch hard and the control of his cutters render him a hugely valuable asset. And, for all the pace of Olly Stone and Mark Wood, they do not offer quite the same package of middle-overs skills. Plunkett may be in a gentle decline, but the World Cup should come soon enough to ensure he remains a valuable part of the England attack.Every game on England's tour to date has been affected by weather. Most of them very badly with two - the second warm-up and the first ODI - abandoned entirely. It was not an unpredictable problem: this is monsoon season in Sri Lanka. It was always going to rain. So why did it happen? Because administrators are so desperate for money - or greedy, if you prefer - that they cram as much cricket as possible into the year without pausing to consider the long-term damage caused to players, spectator numbers (there are a few who have spent thousands on this tour who will never return) or even the value of broadcast deals. But nothing changes: England's schedule for 2019-20 (they play Test series in New Zealand, South Africa and Sri Lanka) isn't just arduous, it is bordering on the immoral.While England used this ODI series to take a look at a couple of fringe players, it is increasingly easy to predict their side for their opening World Cup fixture. That's just as well: they play just one more ODI series - in the Caribbean - before they have to name their World Cup squad. So while the likes of Sam Curran and Sam Billings might yet be considered as replacements in case of injury, there are now only one or two places left to confirmed in the 15-man party. Given no surprises with the pitch, fitness or the conditions, England will probably field this XI against South Africa at The Oval on May 30: Jason Roy, Jonny Bairstow, Joe Root, Eoin Morgan, Jos Buttler, Ben Stokes, Moeen Ali, Chris Woakes, Adil Rashid, David Willey and Liam Plunkett. With Alex Hales, Mark Wood, Tom Curran and one other - perhaps Olly Stone or Liam Dawson - in reserve. In a format where role definition is so important, that level of certainty bodes well for England.For a good side - and England have proved themselves a really good ODI side over the last couple of years - England still have it in them to produce the odd absolutely stinking performance. For as excellent as they have been in recent months, it is worth remembering they were beaten by Scotland in June and conceded their largest ODI defeat in history in terms of runs (albeit via the DLS method) on Tuesday against a modest Sri Lanka side. The 2017 defeat against South Africa at Lord's - England were 20 for 6 within about half-an-hour in that match - wasn't especially clever, either. That's a bit of a worry because, while teams may be able to cope with one bad day in the early rounds of a World Cup, they can't afford one in the knock-out stages.Jonny Bairstow's ankle injury revived the moans about England playing football as part of their warm-up routine. Never mind that Bairstow simply slipped on damp grass - an injury that could have occurred had he been fielding - it encouraged the usual voices to bemoan the practice as if it were akin to knife throwing or shark wrestling. It is true there have been some notable injuries sustained by cricketers playing football over the years, but there have also been injuries sustained by stretching, running and going to the gym. To some extent, these things happen. The current squad enjoy the football, do not tackle, and find it both unites them and is good for their overall fitness. With the squad together for approaching 300 days a year, it is impractical and unhelpful to suggest they are so risk averse that they avoid such things. The resurgence of this team has largely come about through a shared enjoyment in what they do. Let's not crush it out of them.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}