{"id": "ESPNJoe Root and Rory Burns show encouraging form in drawn warm-up gameButtler relieved after short leg scareMatch CoverageVideosBetting OddsPresented ByBet365ABOUT COOKIES", "paragraph": "England 365 for 7 (Root 100, Moeen 60, Peiris 3-108) drew with Sri Lanka Board XI 392 for 9 dec (Kaushal Silva 62, Sarathchandra 59*, Samarawickrama 58, Priyanjan 50, Moeen 2-64)A sickening blow to the head to Pathum Nissanka overshadowed the final day of England's warm-up match against a Sri Lanka Board side.Thankfully the player appears to have avoided serious injury, but play still was suspended for around 20 minutes after he was struck on the crown of his helmet by a fierce pull shot from Jos Buttler.The initial response to the incident was amusement - the ball ballooned into the air and was caught by Angelo Mathews at leg slip to end Buttler's innings - but the mood soon changed as Nissanka fell to the ground clutching his head and the players realised the potential seriousness of the situation.Within moments the England team doctor, Moiz Moghal, ran on to the pitch to assess the situation. Nissanka remained motionless for around 20 minutes before he was taken, on a stretcher and in a neck brace, to a waiting ambulance. It is understood he did not lose consciousness but was complaining of pain in his neck. An MRI scan later confirmed that he was \"out of danger\" but he will be kept in hospital for 24 hours for observation.Jos Buttler admitted he feared the worst after his thumping pull shot crashed into the head of Pathum Nissanka.Buttler was dismissed in the incident as the ball rebounded off Nissanka's helmet to Angelo Mathews at leg slip, but insisted that was of little consideration.\"You always fear the worst,\" Buttler said. \"I hit him very hard and straight in the middle of the helmet. I knew I had hit it pretty hard and straightaway you're worried about the guy.\"Luckily the medics rushed straight on and treated him. We've got a great doctor and physio here and they did a good job. I'm glad to hear he's doing better.\"You don't really care about getting out. You just hope the lad is okay.\"You're just worried. You don't mean to cause injury. It was just a really unfortunate accident.\"England had an injury worry, too, albeit a far less serious one. Ben Stokes was obliged to retire hurt, on 10, having sustained a blow just above the elbow after missing an attempted pull shot off Lahiru Kumara. He was able to resume later, however, and is not thought to be a serious injury doubt ahead of the first Test in Galle that starts on Tuesday.The highlight of the day from an England perspective was a fluent century from their captain, Joe Root. Completely untroubled against pace or spin, Root showed his game was in fine order in reaching his hundred off 117 deliveries before retiring to allow other players an opportunity.Almost as impressive was the performance of Rory Burns. Having seen off the seamers without fuss or trouble, Burns then took to the spinners with encouraging success. Whether skipping down the pitch to drive or rocking back to cut, he looked both solid and fluent, while he also played the reverse-sweep effectively. There was also a half-century for Moeen Ali, who timed the ball beautifully, and an increasingly fluent 44 from Buttler before his freakish dismissal.Joe Denly was less convincing. After surviving a leg before appeal first ball to the seamer Kasun Rajitha, he almost played on to his second, appearing hurried on both occasions despite the sedate pace of the wicket. He then edged one within an ace of leg slip before he missed a full, straight ball. He was also involved in the run-out of Burns as he called him through for an optimistic single. Suffice to say that, having had a tough day with the ball on Tuesday, he didn't especially strengthen his claims for a Test debut next week.Keaton Jennings didn't enjoy an especially good day, either. After getting on the mark with a thinly edged hook, he played on off the inside edge as he attempted to run one down to third man.There was slightly more encouraging news of Jonny Bairstow, too. Although it appears the first Test may come a bit soon for him, he was able to resume light training and was seen undertaking some keeping drills and batting in the nets. The fact that Ben Foakes came in to bat after Ollie Pope underlined the impression that England are more likely to give the gloves to Buttler if Bairstow is unable to play in Galle.Nishan Peiris, the offspinner, was probably the most impressive of the bowlers. He finished with three wickets having Stokes caught at slip as he attempted a reverse-sweep - Stokes' reaction suggested he did not think it was much of a decision - before Moeen was beaten by a hint of turn and edged to the keeper.England start another two-day warm-up game on Thursday at the Cricket Club of Colombo's ground just across the road from Nondescripts' where this match has been played. While no team has yet been named, both Jack Leach and Olly Stone will play while it is possible Bairstow could be included at some stage. The match is again likely to see 13 or 14 players involved on the England side.There was a fifty for Moeen Ali, too, but Joe Denly and Keaton Jennings were less convincing in their stints at the creaseFor all the talk of England searching for a \"different formula\", there was a wearing familiarity to their approach on the first day of the red-ball leg of their tourSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}