{"id": "ESPNDidn't think of a double-hundred at any point - Rohit SharmaSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upDidn't think of a double-hundred at any point - Rohit SharmaWest Indies captain Jason Holder on…ABOUT COOKIES", "paragraph": "Rohit Sharma reveals what goes through his mind when he plays innings like the one he did today (2:17)When Rohit Sharma completed his first ODI century in Mumbai, he took some time to savour it, settling into a relaxed acknowledgement of the applause with his arms outstretched. Even at about 60% capacity, the crowd was rather loud for their local hero.What went wrong: \"We definitely didn't play well. The way we started the series and the way we have played so far, we certainly didn't do any justice today. Gave away too many runs. I felt it was a very good wicket, the outfield was lightning. It was a wicket where once you get in, you can go really big. Unfortunately none of our batters just really got it and gave themselves a chance to bat deep into the innings.\"Coping with the rising asking rate: \"The asking rate definitely plays on your mind as well, you know. Obviously a big total and you need to be up with the total for a majority of the innings. We never really got any momentum up front, lost too many wickets up front. And the two run-outs didn't really help us. Set us back really - two of our better players, and we didn't really have any momentum in the middle. Credit to India, they bowled reasonably well upfront and caused trouble.\"Rohit likes playing at the CCI's Brabourne Stadium. It is the venue where he made his first T20 hundred, an unbeaten 101 against Gujarat in 2007, and two years later made 309 in a Ranji match against the same opposition.\"I have played a lot of cricket at CCI and I have always enjoyed batting here,\" Rohit said. \"It is a good pitch and you get value for your shots. It has a fast outfield, so you don't need to try and hit too hard. You can find the gaps, and that's what I was looking at.\"When you come to a ground where you have played enough cricket, you feel confident of going into a match. That was my mindset before walking into bat. I understand the nature of the pitch and what it does when the spinners are bowling. Those things are important. Like I said, I've had lot of opportunities to play here and it was going about and doing the same thing.\"This hundred, Rohit's 21st, comes in the middle of a purple patch and falls in line with a pattern of increasing scores every time he has gone past 50 over the last month. After scores of 52 and 83* in the Asia Cup, Rohit made an unbeaten 111 against Pakistan in the same tournament, and in the next instance of making a 50-plus score, Rohit finished with an unbeaten 152 at the start of this series. Incredibly, he managed to better even that score, but the three-time ODI double-centurion said didn't think of a fourth at any point.\"While batting, I don't think about scoring hundreds or double-hundreds. I just want to go bat, score runs and get the team to good positions,\" Rohit said. \"The three double-hundreds that I've got, I had never thought about getting them. Even today, in fact, Rayudu was telling me that I can get a double-hundred. But I was just trying to focus on my batting and not think about how I'm going to get to double-hundred. I wanted to score runs and make sure that we get enough runs because CCI can get tricky while [defending]. But we bowled well to get them out.\"There were signs that Rohit was alluding to in terms of balance between bat and ball, and perhaps nothing nailed down that hypothesis better than the 224-run margin of victory. And among the stars of India's 377 defence was left-arm fast bowler Khaleel Ahmed.\"In the first innings when me and Shikhar were batting, we were not finding it that easy because it was doing a little bit,\" Rohit said. \"You can't just go straight away and start playing shots. You need to spend some time. So in my opinion the pitch was on offer for both batsman and bowlers. It was probably one of the best pitches that I've played on in India.\"When the left-armers swing the ball the way Khaleel did today, it's always going to trouble the batsman no matter what sort of batsman he's bowling against. If he's swinging the ball the way he is, any batsman in the world will find it difficult. He's maturing very fast, he understands his bowling. And the management also understands where he needs to be come the World Cup. I hope he continues to do that because it's only going to be better for us. Come New Zealand, and the World Cup in England, where the ball swings a lot, he might be very handy there.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}