{"id": "ESPNPeter Handscomb makes case for Test return with unbeaten tonMatch CoverageBetting OddsPresented ByBet365Sheffield ShieldABOUT COOKIES", "paragraph": "Victoria 7 for 345 (Handscomb 123*, Dean 75, Harris 65, Winter 3-81) lead South Australia 244 (Cooper 118, Lehmann 56, Boland 7-54) by 101 runsPeter Handscomb has made a statement to Australia's selectors with a patient unbeaten century to put Victoria in control of the Sheffield Shield clash with South Australia at the MCG.Handscomb, who lost his Test place on Australia's tour of the UAE, capitalised on a superb 132-run opening stand from Travis Dean and Marcus Harris to grind out 123 not out from 215 balls and give Victoria a 101-run lead with two days remaining. He struck 15 boundaries in his 14th first-class century, which he brought up with lovely cover drive off Cameron Valente.Victoria at one stage looked set to pile up a huge score but Nick Winter put them back under pressure with three wickets in the space of eight overs. He found the edge of Harris' bat before trapping Dean in front and got Cameron White caught behind for a duck as well.Handscomb and Matthew Short steadied Victoria for over 18 overs but they again slumped to 5 for 193, losing both Short and wicketkeeper Seb Gotch in quick succession before Handscomb found solid allies in James Pattinson and Peter Siddle. Pattinson made 32 after being promoted to No. 7 while Siddle contributed 13 not out from 72 deliveries in an unbeaten 55-run stand with Handscomb to take the home side through to stumps.However, Victoria's charge to a third straight win to start the season may be hindered by some wet weather that is due in Melbourne on day three.Close to 20 millimeters of rain fell on the fourth morning prior to the start of play which left a large chunk of the MCG outfield under waterSouth Australia's middle order crumbled at the MCG but lower order runs meant Victoria still have a challenge on the final dayHaving lost his Test place on Australia's tour of the UAE, the middle-order batsman made 123 not out from 215 balls and give Victoria a 101-run leadThe Redbacks lost their last six wickets for 13 runs before Victoria's openers laid a solid base in replySign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}