{"id": "ESPNKirstie Gordon stars with ball as England shake off rust with seven-wicket winMatch CoverageBetting OddsPresented ByBet365Women's World T20ABOUT COOKIES", "paragraph": "England 64 for 3 (Jones 28*, Sciver 23) beat Bangladesh 76 for 9 (Ayasha 39, Gordon 3-16) by seven wickets (DLS method)\nScorecard and ball-by-ball detailsEngland's women overcame a top-order wobble, and another dramatic flurry of St Lucian rain late in their run-chase, to get their World T20 campaign up and running with a seven-wicket victory over Bangladesh at Gros Islet.They were set a sub-par 77 after a hit-and-miss performance from Bangladesh, but England took their time to calibrate the appropriate response in tricky, tacky conditions, as Danni Wyatt was pinned lbw for a first-ball duck before Tammy Beaumont toe-ended a cut to point for 2.England's situation could have been even more dicey at 16 for 3 in the fourth over had Amy Jones been caught by the wicketkeeper, Shamina Sultana, who instead suffered a nasty faceplant after diving at full tilt to intercept a top-edge to point.But, as Sultana was taken from the field nursing a bloody nose, England found a more measured gear to break the back of their run-chase. Jones settled in to anchor the innings in a 38-run stand for the third wicket with Nat Sciver, who made 23, and finished on 28 not out from 24 balls. England were 55 for 3 when the rain caused a lengthy late delay, and ended up reaching a revised target of 64 in just three balls after the resumption, thanks to a brace of boundaries and a winning single from the captain, Heather Knight.It was a slightly scrappy performance from England, the reigning 50-over World Champions, but having been deprived of any meaningful practice in the build-up to this game, and even resorting to improvised net sessions under the grandstand, they were ready to accept any victory going.Only 24 hours earlier, the ICC had seriously been considering relocating this group to Antigua to avoid further washouts, but in the event the start of play was delayed by just 15 minutes after a heroic mopping-up effort from the groundstaff.Knight won the toss and chose to bowl first, with the boundary ropes brought in to the minimum legal requirement of 55 metres as part of the authorities' bid to get this leg of their tournament up and running.And Knight's decision was quickly vindicated as Bangladesh were reduced to 5 for 2 in their first five overs. Anya Shrubsole found some wicked late inswing to bowl Sultana for an eight-ball duck, before Sciver - slipping into the new-ball role vacated by the injured Katherine Brunt - found Fargana Hoque's outside edge to give Jones an early catch, diving to her right.But, having stacked their side with three left-arm spinners - including two of the three debutants in Linsey Smith and Kirstie Gordon - England quickly chose to take pace off the ball, and Bangladesh responded with a block-or-slog response through the endeavours of Ayasha Rahman who, quite remarkably, would be the only Bangladesh batsman to make a single run in the first nine overs of the innings.A mow for six over backward square leg off Shrubsole was followed by a violent slog through the line as Gordon's fourth ball as an England cricketer was deposited back over her head. However, Ayasha's blood appeared to be pumping a touch too much when she sold her partner a massive dummy - leaving Nigar Sultana run out for the third duck of the innings - and she even appeared to strain her hamstring in the process of aborting a quick single into the covers.Undeterred, Ayasha continued to plant her front foot in a batting-by-numbers fashion, swiping Ecclestone for a third six over midwicket before hauling Gordon for four through square leg to move to 39 out of Bangladesh's 12-over total of 42. But four balls later, she chanced her arm once too often to pick out Wyatt at cow corner and Gordon, the former Scotland international, was off the mark for her new country.Gordon added two more scalps in her final over, including a maiden catch at long-off for England's third new girl, Sophia Dunkley, to finish with an impressive 3 for 16 in four overs. Bangladesh kept battling to the bitter end, with Jahanara Alam smashing Sophie Eccleston for the fourth six of the innings, but their total of 76 for 9 never seemed like being enough, even allowing for the conditions, and for England's rusty response.Three wickets on England debut helps restrict Bangladesh to 77, as batsmen overcome wobble to launch campaignSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}