{"id": "ESPNDubey, Tare the stars as Mumbai lift Vijay Hazare title after 12 yearsMatch CoverageBetting OddsPresented ByBet365Vijay Hazare TrophyABOUT COOKIES", "paragraph": "Mumbai 180 for 6 (Tare 71, Lad 48, Saini 3-53) beat Delhi 177 all out (Himmat 41, Dubey 3-29, Kulkarni 3-30) by four wicketsNavdeep Saini brought alive what should have been a routine chase for Mumbai, blasting out three wickets and being denied a fourth due to over-stepping, but he couldn't stop Mumbai's march to the Vijay Hazare Trophy 2018-19 title.Mumbai's bowlers had won the patience game with Delhi's batsmen after Shreyas Iyer opted to bowl first, and the tight lines drew a number of rash strokes that ultimately cost Delhi dear. With a few more runs to defend, Saini could have induced real panic in Mumbai's batsmen. But despite getting Prithvi Shaw, Ajinkya Rahane and Suryakumar Yadav within the first five overs - and Kulwant Khejroliya snaring Shreyas Iyer after the same batsman had been dropped off him - Mumbai had the depth to chase down the 178-target in 35 overs, with four wickets standing.Siddhesh Lad, who benefitted from a Saini no-ball when he drove tamely to point before opening his account, hit a 68-ball 48 while Aditya Tare carved out 71 (89 balls) in a match-defining 105-run stand for the fifth wicket. Gautam Gambhir had attacking fields, knowing that wickets was Delhi's only path to victory, but both batsmen showed admirable temperament in their counter-attack, putting away anything loose and not letting the pressure of a 40 for 4 scoreline consume them.Tare was lbw to Manan Sharma with Mumbai 33 runs away, and Lad fell at 176, but Mumbai were not to be denied.The margin appeared reasonably comfortable at the end, but it was hard-fought all the way. Saini's first spell had brought 3 for 41 in seven overs, but once that initial phase was weathered, Mumbai were in control. They had been the best team in the league stages, and they lived up to their star billing, winning the first domestic 50-overs title since 2006-07, when Amol Muzumdar's team had beaten Rajasthan by 72 runs in Jaipur.The first two balls of Mumbai's chase had been glanced and punched for fours by Shaw, but Saini's third ball straightened to cannon into the stumps past the outside edge. In the fifth over, Saini got the ball to move off the seam again and beat Rahane for pace, trapping him in front. Three balls later, Suryakumar's airy drive went straight to the keeper.Mumbai could have been four down if Nitish Rana held on to a straightforward edge off an Iyer flash in the very next over, and in the over after that, Lad was caught off a no-ball. Iyer repeated his error in Khejroliya's next over, and this time he was pouched safely. Eight overs into the chase, Mumbai could have been six down, but had lost only four wickets. While things were still rocky, they had two batsmen up for the fight in the middle, and that made the difference in the end.Both men survived a few other close calls too, with the third umpire kept busy. Suryakumar's dismissal had been touch and go with regard to Saini over-stepping, and Lad's reprieve was almost equally close. On both occasions, a millimetre made the difference. In 19th over, Subodh Bhati drew a bottom edge off an attempted cut from Tare, and Unmukt Chand tumbled forward to claim the catch. Numerous replays later, third umpire Ulhas Gandhe overturned the soft signal of 'out', ruling that the ball had touched the ground first.Bhati was the bowler again when Lad hit a bullet straight drive that crashed into the stumps at the non-striker's end with Tare out of his crease. The point of contention now was whether Bhati had got a touch on the ball with his boot, and once again, the third umpire ruled in favour of the batsman, with the ball showing no appreciable deviation from its path.The feature of the Lad-Tare stand though, was that they never allowed those moments to curb their natural games. If the bowlers strayed, as they were likely to in an all-out attack to get wickets, the ball was put away for runs.Earlier, lapses with the bat had cost Delhi. Gambhir slashed the pacy Tushar Deshpande straight to Shaw at third man in the second over, putting Delhi on the back foot at the start with the in-form batsman gone.Delhi couldn't string partnerships together, and the move to send Manan in at No.3 backfired too. Nitish Rana and Dhruv Shorey tried to rebuild with a sedate 39-run stand for the fourth wicket, but that ended when Rana tried an ill-advised pull that resulted in a top-edge. It wasn't until Himmat Singh (41 off 65) and Pawan Negi got together that Delhi showed any fight.Fresh from his heroics in the semifinal, Negi was confident, and even hit Shams Mulani out of the attack with a 15-run over. But a Deshpande snorter struck his right hand hard, forcing him to retire hurt. Bhati swung his bat for a few quick runs, but the pace trio of Deshpande, Dhawal Kulkarni and Dubey kept striking, as Delhi finished on 177.At the halfway stage, it looked completely inadequate given Mumbai's imposing batting line-up. Saini's fire breathed life into the contest, but eventually, Mumbai's resilience and discipline won the day.Mumbai waited 11 years to add to the 50-overs trophy cabinet, but the victory reinforced that the side is still among the top dogs in IndiaAfter sleepwalking their way to wins in the league phase, Mumbai exhibit lower-order might to clinch victory in a tricky chaseSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}