{"id": "ESPNChatara stretchered off with suspected quadriceps tearSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upChatara stretchered off with suspected quadriceps tearABOUT COOKIES", "paragraph": "Zimbabwe were dealt a major blow in the Mirpur Test against Bangladesh, after fast bowler Tendai Chatara was stretched off with a suspected Grade 2 tear on his left quadriceps muscle. The injury occurred in the 100th over of the Bangladesh first innings. Chatara pulled up while running in to deliver the over's third ball, and after some initial checks by the physiotherapist, he was carried away from the ground.A Zimbabwe Cricket spokesperson confirmed the extent of the injury afterwards, but said that there may be more updates on Chatara's condition as the day progressed.Chatara had been in good form prior to the injury, having taken 1 for 34 in 22.2 overs, with 12 maidens. He had also played a critical role in Zimbabwe's famous victory in the Sylhet Test, where his three-wicket burst in the first innings opened up Bangladesh's batting line-up, which eventually collapsed twice in the game.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}