{"id": "ESPN'We are a perfect team, and that is why we have won' - IyerABOUT COOKIES", "paragraph": "\n\n\n\r\nShreyas Iyer raises his bat as he gets to fifty\t\t\t\t © PTI \n\n\n\nBefore the tournament final on Saturday, Siddhesh Lad had batted only five times in the Vijay Hazare Trophy this face, facing 124 balls and staying unbeaten thrice. Aditya Tare had batted only four times, staying not out twice and facing a total of 48 balls. \n\nThis is not surprising because Mumbai's top order featured Shreyas Iyer, Prithvi Shaw, Ajinkya Rahane at various times, and even Rohit Sharma for a couple of matches. They either finished off games quickly, leaving little work for the lower middle-order, or simply batted through. Against a Navdeep Saini-inspired Delhi in the final though, Mumbai found themselves 40 for 4 in the eighth over, with the 177-run target suddenly looking a lot more troublesome than it ever had. Tare and Lad were in the position of stage prompters who have suddenly been thrust in the starring role because the protagonists' no-show on the big night.\n\nThey responded with a 105-run partnership in 23 overs that knocked the wind out of Delhi's defiance. Tare got 71 off 89, an incredible 58 runs coming from boundaries. Lad made 48 off 68, and looked more measured than Tare but just as reassuringly solid for Mumbai.\n\n\"Amazing is the one word,\" gushed Iyer after the four-wicket win. \"The consistency which we have shown in the tournament has been brilliant from the first match. The lower order batsmen hardly got a chance to bat, and today when they got an opportunity, they showed what they are made of. Everybody in our team can bat and bowl. We are a perfect team, and that is why we have won.\n\n\"They are batsmen who have performed previously in pressure situations,\" added Iyer. \"We believed in them because we knew that they would finish off the game. Ajinkya [Rahane] and I were chatting and said they would win us the game.\"\n\nThe feature of the Tare-Lad stand was how they counter-attacked, despite having lost important wickets. Iyer said that was the strategy that made most sense, given the attacking fields Gautam Gambhir had employed. \n\n\"We (the top order) were also doing the same, but we got out,\" Iyer said. \"We had to play that way as they had put an attacking field. If we got bogged down, they would have been on top. You never know, we might have lost five-six wickets and the match would have been sealed (in Delhi's favour). But our team were going at six runs per over, which was a positive sign for us. We just knew that they (Tare and Lad) had to play out this phase. Delhi did not have a fifth bowler with [Pawan] Negi having got injured as well.\"\n\nMumbai's bowling attack has been the unheralded champion of their campaign. The batting had drawn the most eyeballs, but match after match, the bowlers stepped up too. \"Our bowling has improved really well,\" Iyer agreed. \"Since the batting has been really strong through the league phase, it was a bit of a worry for us how our bowling unit would perform. But they lived up to expectations. We had planned how we would go up against each batsman, and they really executed plans really well. Not only against Delhi but also against other teams. I wasn't there in a few matches, Ajinkya wasn't there, and Dhawal [Kulkarni] was leading and we defended a good total against Punjab. From there on, we got the momentum. They (the bowlers) have been really focused and motivated since the start of the league phase, and they wanted to do something good for the team.\"\n\nWhile most teams stress on reducing the pressure before big games, harping on the 'treat-it-as-another-game' byword, Mumbai chose to do the opposite.\n\n\"We decided yesterday that we'll play this match as a final and not as just another match,\" Iyer said. \"Right from the toss, it went with me and I gained momentum from there onwards. We were a little bit confused when we saw the wicket and couldn't analyse how it would play. The best chance was to bowl first and everything went really well until we came on to bat.\n\n\"What sets us apart is that all of us gel together really well. Even off the field, we stay together, cherish each other, play around with a little bit of pranks and fun. This is what the team is made up of.\"\nSaurabh Somani is an assistant editor at ESPNcricinfo\n        To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies.\n      "}