{"id": "ESPNDale Steyn sets the tone to set up crushing South Africa winMatch CoverageVideosBetting OddsPresented ByBet365ABOUT COOKIES", "paragraph": "South Africa 4 for 153 (de Kock 47, Hendricks 44) beat Australia 152 (Phehlukwayo 3-33) by six wicketsElite honesty, meet elite performance. Australia's home summer without their best two batsmen began in sickening style for the hosts, shot out for 152 by South Africa's high quality pace attack and consigned to a six-wicket hiding on a fast and fiery Perth Stadium pitch in front of a disappointing crowd.Where 53,781 had been present at the new venue for a January ODI against England, only a fraction of that assembly were in attendance as the side captained by Aaron Finch were sent in to bat after Faf du Plessis won a more than useful toss. They were to be witness to Australia's lowest total in a home ODI against South Africa for 21 years, since cobbling 125 at the MCG in 1997.A target of 153 was to prove a simple task for South Africa, guided with some panache by Quinton de Kock with the assistance of Reeza Hendricks. Their calm and positive approach to Australia's new ball attack contrasted greatly with that of Finch's team, reflecting a mental gulf between the two sides that will take some bridging in the remaining two matches.The bounce and seam on offer was exploited brilliantly by Dale Steyn and company, as the Australians slid to 3 for 8 then 6 for 66 against bowling perfectly suited to the conditions. Even so, the technical shortcomings recently bemoaned by the coach Justin Langer were on show as batsmen went hard at the seaming ball outside off stump, resulting either in edges behind the wicket or miscues in front of it.Finch meanwhile succumbed to a lapse in judgment, given lbw by Aleem Dar then failing to review a ball that ball-tracking showed would have cleared the stumps. Steyn, Kagiso Rabada and Lungi Ngidi all delivered their share of fiendishly prancing deliveries, but it was the lesser pace of Andile Phehlukwayo who capitalised most noticeably with a trio of victims, as the Australians tried to attack after being tied down by his faster teammates.Granted five overs of their pursuit before the full innings break, the visitors were swiftly into gear through the positive footwork and shot selection of de Kock, while there was also a curious call in terms of Australia's new-ball combination. Not since the 2015 Ashes had Mitchell Starc not taken the new ball in an international match, but here he was consigned to first change. Nathan Coulter-Nile served up a nervous first over that went for 16, and Starc was on for the fourth over, but many were left to wonder at the choice.After dinner, Starc and Josh Hazlewood drifted into de Kock's cover driving and leg-side flicking zones, either side of a raucous lbw appeal by the left-armer that replays showed to be comfortably missing leg stump. When Hendricks chimed in with a percussive cover drive of his own, the 50 was raised well inside eight overs.Pat Cummins proved a more difficult proposition with his sharp trajectory, and one ball flew from just short of a good length to strike Hendricks a stinging blow on the shoulder. After seeking treatment for the blow, Hendricks responded well with a couple of solid defensive strokes and then a back foot punch for three, to underline South Africa's composure.De Kock made it as far as a fluent 47 before skying an attempt to muscle Coulter-Nile down the ground, and Australia may have had a brief glimmer when Aiden Markram was given out caught down the legside off Cummins. But unlike Finch, Markram reviewed successfully, with closer inspection showing the ball had missed his glove, making it a wide instead of a wicket.A handful of smart strokes from Markram, opposite Hendricks' level young head, had South Africa hurtling towards the win, also maintaining their strong record against Australia in the closest Antipodean city to their homeland. Hendricks' dismissal late in the piece, followed by two more to the medium pace of Marcus Stoinis, allowed du Plessis the pleasure of being in the middle for the winning runs - with all of 20.4 overs to spare.The margin meant Australia avoided their second 10-wicket ODI defeat - the first took place in Wellington in early 2007. That team, with some high profile reinforcements, went on to win the World Cup a matter of weeks later. Langer's team have around six months to prepare for their own global tournament, but seem a long way from being competitive.Plenty of grass on the surface had led both sides to favour pace in their bowling lineups. Shaun Marsh could not be considered due to requiring surgery for an abscess on his buttocks, with D'Arcy Short coming into the lineup and batting at No. 3. The loss of Marsh is a significant blow as he was Australia's leading batsman in their previous series, a 5-0 loss to England in the UK in mid-year.The match was Australia's first on home turf since the Newlands ball tampering scandal. It was also the first home international for the new broadcaster Fox Sports, the first time in history that any such matches have moved behind a paywall - albeit still available free on the Cricket Australia live app for the time being.Walking out to bat alongside Finch, Travis Head was beaten by Steyn's perfectly pitched first ball, and in the third over edged behind when trying to drive at the first ball Steyn flung further up to the bat. Two balls later and Short fell similarly, offering a chance very well taken by du Plessis, leaping off the ground to reel it in.Finch weathered 16 deliveries before being pinned in front of the stumps by Ngidi, and was on his way after a brief nod of the head by the non-striker Chris Lynn. However, the considerable bounce in the pitch provided cause for doubt about a ball that struck Finch above the knee roll of the pad, and technology duly confirmed a reprieve would have occurred if the captain had reviewed.Lynn and Alex Carey tried to right the ship for a time, as the run rate crept along at barely two an over and the first boundary was not collected until Lynn punched a Rabada full toss down the ground at the end of the 12th over. Lynn, though, was to fall to a thin edge behind off Phehlukwayo, who was also to capture the wickets of Glenn Maxwell and Stoinis when both were pouched at mid-on. In Maxwell's case, the dismissal arrived a ball after he had been struck a painful blow on the thumb, and did not take place without rancour form the batsman, who believed a low chance had not carried to Heinrich Klaasen - replays suggested otherwise.After Cummins was well run out by David Miller's side arm flick, Carey's long and unsupported occupation was to be ended by a top edged attempt to paddle Imran Tahir, who would go on to find Starc lbw. Coulter-Nile offered a selection of strong blows, but it said everything about this innings, and ultimately the match, that the top score was registered by Australia's No. 9 in the batting order.The 19 runs scored by Australia in the first Powerplay was their fewest in an ODI at home\"Elite honesty\" was among the slogans in Australia's dressing room for the Perth ODI. And honestly it got elite attention on TwitterAndile Phehlukwayo picked up three wickets in an outstanding collective bowling display but Australia's batsmen aided in their downfallAfter a week of dramatic boardroom developments, Australia's international season gets underway in Perth with the hosts desperate to find some ODI formSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}