{"id": "ESPN'Matt Parkinson never leaves anything in the sheds' - Stuart MacGillSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-up'Matt Parkinson never leaves anything in the sheds' - Stuart MacGillABOUT COOKIES", "paragraph": "Former Australia spinner Stuart MacGill is \"really, really excited\" by Matt Parkinson's deal with the Melbourne Stars, and thinks that the young legspinner can use the Big Bash as a platform to stake an England claim.Parkinson, a 22-year-old who has starred for Lancashire in white-ball cricket, will play half the season for the Stars, sharing an overseas berth with Nepal legspinner Sandeep Lamichhane.He was mentored by MacGill in Sydney last winter as part of the ECB's Pathways programme, while playing grade cricket for Gordon and when training with the England Lions, and the pair have kept in regular contact since.\"I'm over the moon for him,\" MacGill told ESPNcricinfo. \"I think he'll benefit from the experience immensely, and I think the Stars will too.\"The big thing with Matt is how genuinely enthusiastic he is. He trains like crazy, and he plays at 100mph. Whenever he gets the ball in his hand he's super excited, and he watches a lot of cricket, which is quite unusual for young pros nowadays. He's always looking to improve himself: he wants to know what other people are doing so that he can keep up.Parkinson has established himself as one of the best limited-overs spinners on the county circuit since his first appearance in July 2017. He took 18 wickets in the Royal London Cup this year to finish as the tournament's leading wicket-taker, and nobody has taken more than his 39 Blast wickets since his match-winning debut against Derbyshire.And in the days leading up to his man-of-the-match performance in this year's T20 quarter-final win at Kent, Parkinson was effusive in his praise for his mentor.\"I did some tweaks with Stuart to give me more energy and momentum towards the target and I'm now probably using my front arm a bit more,\" he told ESPNcricinfo. \"The six months with him were fantastic because they gave me confidence I could take with me into this season. They really helped me to understand my game more and to deal with the off days. I'm not saying it was s*** or bust for me last year, but this year I'm a lot more consistent and I've grown as a bowler. I understand my own bowling better.\"For the ECB, Parkinson's Big Bash deal represents a success for their development programmes. MacGill has now worked with several young English spinners, starting with Mason Crane in the 2016-17 season, as well as Josh Poysden, Matt Critchley and Delray Rawlins last winter, and his role as a mentor rather than just as a coach seems to be working perfectly.\"All I did with him, as with any of the guys I work with, was really encourage him to become increasingly familiar with his cricket,\" MacGill said. \"Not just with his mental and tactical stuff, but with his actual action itself: make sure there's that consistency, routines, and processes.\"The opportunity the guys have when they come out to work here is that they just do get a little bit more time and less pressure - more training time I guess - and to really get to know themselves on the cricket field and in the cricketing context. Consequently, their consistency and the clarity with which they look at wicket-taking improves, so they know how they take their wickets. It's different for each individual, but they just know their game a lot better.\"[Parkinson] stays in touch almost religiously,\" he said, \"which is really nice for me to be honest, because when you're a former player you do tend to feel like a bit of a grandpa!\"But he lets me know how he's going, what he's doing - we flick messages backwards and forwards - and he was great with my family. He's a good kid: he trains hard, he runs hard, and he really takes pride in everything he does, so I'm really really excited for him and I know he's very excited as well.\"Whether he gets on the field every game or just some games, I know that he'll never let himself down - he's one person who you know will never leave anything in the sheds.\"Parkinson's Lancashire performances have already won him England Lions recognition, and it is understood that an IPL franchise was interested in securing his services ahead of last year's auction, so it comes as no surprise that MacGill thinks the Big Bash stage could further his case for international selection down the line.\"It's certainly good timing. If I were a young cricketer around the world at the moment, I'd be pretty keen to get involved in the Big Bash next season.\"With the World T20 in Australia on the horizon, he couldn't get a better training field, and he's working with some good people there: Trent Woodhill [the Stars' list manager and assistant coach] in particular is a very good operator. He's in great shape.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}