{"id": "ESPNDuckett's 45-ball 75 helps Giants cruise homeMatch CoverageBetting OddsPresented ByBet365Mzansi Super LeagueABOUT COOKIES", "paragraph": "Nelson Mandela Bay Giants 127 for 5 (Duckett 75, Hendricks 2-5) beat Jozi Stars 124 for 7 (Vilas 38*, Gayle 23, Smuts 3-20) by seven wickets He isn't a recognised T20 name worldwide yet, but Ben Duckett showed he has the ingredients to become a hard-hitting match-winner. A fine exhibition of back foot play that yielded runs against pace and fleet-footedness that brought rewards against spin delivered a 27-ball half-century, as Nelson Mandela Bay Giants cruised to a five-wicket win over Jozi Stars on Saturday.Duckett made a 45-ball 75 before falling in the 16th over with Giants needing 16 off 33 balls. Victory in 16 overs or fewer would have fetched them a bonus point, but the middle order sputtered and they eventually had to settle for winning with 12 balls to spare. Only time will tell if a missed opportunity to pocket the extra point might haunt them later in the tournament.Stars, meanwhile, paid the price for injudicious shot selection that had them limp to 124 for 7. This was comfortably 30 below par on a surface where JJ Smuts, the left-arm spinner, was Ravindra Jadeja-esque with his control and guile.Smuts took 3 for 20 to leave a gaping hole in the Stars middle order, one they couldn't recover from. Among their takeaways from the contest was the performance of left-arm swing bowler Beuran Hendricks, who ran in hard and troubled the openers during the course of an intense spell with the new ball. He finished with figures of 4-1-13-2, bowling his entire quota first up with the Stars knowing that picking a bunch of wickets was their only chance of defending the total.Duckett then took on the experienced Dan Christian in the fourth over. A sequence of 4,4,6 showed his wide range and his confidence in executing brave strokes. The first boundary was a front-foot pull, the next was a scoop over short fine leg. The best of the lot was the short-arm jab for six over deep midwicket.Later, he brought out a reverse sweep for six against Eddie Leie's leg spin, to bludgeon his way forward. The Stars total didn't let them apply any sustained pressure, and the chase increasingly resembled a carefree net session for Ducket despite the Giants losing two more wickets than they would have liked. Duckett fell perhaps trying to gather runs quickly enough for a bonus point, and it was left to Ryan McLaren and Rudi Second to bring up the winning runs.While Duckett and Smuts deservingly walked away with the top honours, Junior Dala's effort with the ball was alos noteworthy. In the context of the game, his 1 for 19 off four overs may have not been too significant, but in hustling Chris Gayle for sheer pace with the new ball, he provided the early spark to the contest.Gayle started slowly - like he usually does in T20s - and was reprieved when McLaren put down a dolly at cover point in the third over. For a while, it seemed as if the mistake would prove costly as Gayle blasted 6,4,4 in the next over bowled by McLaren, but he was eventually snuffed out in the same over by a yorker that hit him flush on the toe to trap him lbw.The only semblance of resistance from there on came courtesy captain Dane Vilas, who shut out the big shots and relied on his industry to pinch runs in the face of some disciplined bowling. He was briefly complemented by Rassie van der Dussen, who made an attractive 19-ball 23.Amid the bowling stifle, left-arm spinner Aaron Phangiso provided the moment of the match when he came sprinting at least 25 yards in from the deep cover boundary before putting in a full-stretch dive forward to complete a sensational catch off Nono Pongolo. Play was held up for five minutes as the third umpire looked at multiple replays before confirming that the soft-signal of 'out' stood. With the ball too, Phangiso was tidy, taking 1 for 20 off his four overs.Smuts stifles Stars with 3 for 20, but Giants falter towards back-end with the bat to miss out on a bonus pointSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}