{"id": "ESPNTrent Boult and spinners lead New Zealand's fightbackMatch CoverageVideosBetting OddsPresented ByBet365ABOUT COOKIES", "paragraph": "New Zealand 153 and 56 for 1 (Williamson 27*, Raval 26*) trail Pakistan 227 (Babar 62, Boult 4-54) by 18 runsThere's a thrilling Test match unfolding in Kandy, and two days in at Abu Dhabi, there's reason to believe something similar might be brewing here. On a fascinating day of Test cricket, New Zealand kept dragging Pakistan back just when the hosts looked like they might slip away out of reach. They were kept to no more than a modest lead of 74, before a gritty partnership between Kane Williamson and Jeet Raval - 56 off 129 balls - chipped away at it, New Zealand 18 runs from parity with nine wickets still in hand.It was, in the end, New Zealand's day, the fact they clawed back into the match no mean feat, given how far behind they were after being bowled out for 153 yesterday. Even today, New Zealand's bowlers were in charge over large periods and could have made inroads earlier. Trent Boult was exceptional throughout the day, and Williamson's decision not to start the day with him looked like an error. Just the second ball of his spell, he seamed one away from Azhar Ali that very nearly caught the edge, and two balls later, a simple chance was grassed by Raval at short midwicket.All day, Boult was unplayable, mesmeric, even, on a pitch where it looks especially hard to get settled. In the six overs before Boult was brought on for the first time, Pakistan scored 28 without loss. In the nine overs that followed, they managed just six runs and lost two wickets. It could have been several more, the way Boult kept moving the ball outside off stump, long after the ball had ostensibly grown too old to swing. However, it was Ish Sodhi - also introduced somewhat late and clearly the better spinner on the day - who got the first wicket. It wasn't the best ball, a low full-toss that Haris scooped up to short midwicket. New Zealand deserved their luck, and five balls later, Boult got the wicket he had deserved.Azhar Ali had been at the crease for 95 balls, scoring only 22 and not looking nearly like getting back to form. It was a corker of a delivery that sent Azhar packing, another ball that seamed and swerved outside off stump, but it also required excellent reflexes from BJ Watling to dive sharply to his right and complete a one-handed grab in front of first slip. It was the second of four wickets he would take; his performance good enough to grace any five-for.Pakistan looked like running away with the game again after lunch, having moved into the lead, with Babar Azam and Asad Shafiq striking up the biggest partnership of the match. Neil Wagner bowled with characteristic discipline, at one point bowling four consecutive maidens. However, it was Boult again who penetrated Shafiq's defences. A lovely late inswinger caught the batsman with his feet trapped in the crease, and all Shafiq could do was drag it back into his off stump. As has been the case all game, one wicket foreshadowed more. Sarfraz Ahmed played an ill-advised sweep into the hands of square leg to give Patel his first wicket, while Bilal Asif was caught out of his crease soon after, and departed thanks to nifty glovework by Watling. Wagner himself found just reward before tea was called, the fast bowler inducing Yasir Shah's outside edge to claim his 150th Test wicket.Babar might have found it hard to sink his teeth into Test cricket to begin with, but there are finally signs it's falling into place for Pakistan's brightest batting talent. He might have been bitterly disappointed after falling for 99 against Australia last time around, but it has appeared to turn a corner for him. In a low-scoring game, he played a chanceless innings that may well win Pakistan this Test match. With 62, he extended Pakistan's slender lead and cushioned against the possibility of a steep fourth-innings chase.Where Pakistan and New Zealand diverged was the hosts' ability to strike up more than one significant partnership. Azhar and Haris's dismissal didn't herald a collapse as Babar and Shafiq hung in, developing a partnership of their own and dispelling any thoughts of Pakistan being bowled out around the 153 New Zealand had managed. With Boult needing a rest, the pair saw out the initial barrage and then began to chip away at the bowlers, and with Wagner and Patel unable to exert the same pressure as Boult or Sodhi had, batting became easier; it was as if the pitch had flattened out.But a lead of 74 isn't exactly small in what has been an uncharacteristically low-scoring match in Abu Dhabi, and New Zealand looked like being bowled out of the match again when Hasan Ali sent Tom Latham's off stump cartwheeling with his first ball. With dark clouds hovering overhead and the new ball in the lethal hands of Mohammad Abbas and Hasan, the visitors needed to dig especially deep to make it through the last 20 overs. That Williamson helped do that wasn't a surprise, but even Raval, still young in his Test career, showed he had learned from his first-innings dismissal. He played Abbas expertly, both leaving and blocking well, and not worried about his strike-rate.That they can leave for the third day, as New Zealand continue to dig themselves out of the hole of the poor first-innings display. They have already come further than most sides do against Pakistan in the UAE, and whether they continue the good work tomorrow makes for an intriguing day's cricket on Sunday.The left-arm quick picked up 4 for 54 to help the visitors bowl Pakistan out for 227 and limit their first-innings lead to 74It's not been a month since the 'biscuit' trophy, and we have another fascinating one for the Pakistan-New Zealand Tests. Where would you rank the Oye Hoye Cup when it comes to the most bizarre trophies in cricket?The visitors lost their last seven wickets for the addition of only 42 runs and slipped to the lowest-ever first-innings total in Abu DhabiPakistan will look to pick up where they left off against Australia last month, while New Zealand play their first Test match since MarchSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}