{"id": "ESPNChatara and Jarvis have 'synergy' - Zimbabwe bowling coachSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upChatara and Jarvis have 'synergy' - Zimbabwe bowling coachABOUT COOKIES", "paragraph": "Many of the best fast-bowling double-acts have been built around variation. Wasim and Waqar, Donald and Pollock, Marshall and Garner, Anderson and Broad - their differences are a vital ingredient in their shared success. So after Tendai Chatara and Kyle Jarvis shared five wickets to dent Bangladesh and secure a first-innings lead on the second day in Sylhet, Zimbabwe bowling coach Douglas Hondo settled on exactly the right word to describe his quicks' complementary relationship: synergy.\"They have got synergy,\" Hondo said. \"They've played a long time together. Chatara takes it away, Jarvis a little bit in, so that's a good mix.\"Though Jarvis is two years older, he and Chatara made their first-class debuts within two weeks of each other in 2009. They bowl at similar speeds, though both men started their careers in tearaway mode and had to re-adjust after major injuries, Jarvis to his back while Chatara broke his leg playing football. Both men have had breaks from the international game: Jarvis when he went to Lancashire for four seasons, and Chatara when he was out for more than six months after his horrific leg injury. But that is where their similarities end.Jarvis was always destined for cricket. Born into a famous cricket-playing family - his father Malcolm played five Tests and 12 ODIs for Zimbabwe as a left-arm medium pacer in the 1990s, and would have taken the first wicket by a Zimbabwean in Tests were it not for a dropped catch - he grew up in Harare's leafy northern suburbs, hanging out with Mitchell Marsh when he lived in Zimbabwe for a time while his father Geoff was coaching the national side.Chatara was born in Dangamvura, a poor, high-density suburb in Mutare, nestled in Zimbabwe's eastern highlands. He never attended any of Zimbabwe's main cricket-playing schools, and turned up at his first Under-17 cricket trial wearing basketball sneakers. Indeed, basketball and athletics were Chatara's primary sports until he was picked for the national Under-19 side.Their bowling actions speak to their contrasting paths into the game: Jarvis bowls with an orthodox action lacking in frills, while Chatara's action is one of homespun lopsidedness. But together, against Bangladesh, they produced a combined effect greater than the sum of their separate parts.Before this Test, Hondo worked hard with them to alter their lengths to suit the longer format. Where they had tried to keep batsmen on the back foot in the ODIs, to prepare for this game he placed the bowling target mat on a much fuller length, attacking the stumps. Jarvis, in particular, stuck firmly to this tactic virtually throughout his spells, making the batsmen play a high percentage of deliveries, while Chatara - who had also worked on honing his line to left-handers, offered the temptation of a line outside off stump. On game day, the bowling coach's instructions were: \"Just bowl enough balls in the right area to ask enough questions and don't give up, don't let up. Just keep bowling in the right areas. The pitch has enough natural variation, the pitch will do enough.\"With Bangladesh stuck in one-day mode, batsmen played at deliveries they might easily have left alone, with Imrul Kayes and Mahmudullah playing on and Nazmul Hossain Shanto nicking a distinctly short-format drive against Chatara. Jarvis, meanwhile, had Liton Das and Mushfiqur Rahim caught behind poking at outswingers, having kept the batsmen tied down with a constricting wicket-to-wicket line.\"They had a good series in the ODIs, so we knew that they were going to come and play in that one-day mode, which will present us with a lot of chances in the Tests because the field sets will be quite attacking,\" Chatara said. \"I think they haven't really adjusted from ODI cricket to playing Tests, where you leave many balls, whereas in ODIs you'll be looking for scoring shots.\"\"Early on I was just trying to hit a good area, because there's so much talk about Bangladesh [pitches] being flat,\" he added. \"So hitting a good area early on, and making the batsman play as much as possible.\"Chatara and Jarvis did just that, but Bangladesh's top order also obliged them with an overly attacking mindset. The end result of that impatience was that, while there are still three days left in the match, the game moved on very swiftly on day two and it is now Zimbabwe who hold an unlikely ascendancy.\"It's Test cricket, sometimes you have to leave some balls, sometimes you have to hold yourself in,\" explained Hondo. \"There's five days of play so you have to play accordingly. If you ask enough questions and they're obliging, things will happen like that. We're just trying to complement our batters, who took a lot of time at the wicket. So we have to complement them by bowling in the right areas.\"Chatara admitted even he was a little surprised by how easily Bangladesh slipped into the seamers' traps to put Zimbabwe in a good position. \"Considering the fact that we won the toss and batted first, we really wanted to bat deep, to tea today,\" Chatara said. \"With Bangladesh batting before lunch, it actually felt like we gave them too much time to bat today. So I actually thought they were going to bat well. But the way we bowled, we bowled very well to restrict them to the score they had at the end of the day.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}