{"id": "ESPNZimbabwe seek ODI turnaround against depleted BangladeshMatch CoverageBetting OddsPresented ByBet365ABOUT COOKIES", "paragraph": "Zimbabwe and Bangladesh know each other intimately. The teams have played each other far more than they have anyone else, and have a rich shared history.Shakib Al Hasan, Tamim Iqbal, Mushfiqur Rahim and Mashrafe Mortaza all debuted in ODIs against Zimbabwe, Mashrafe a whopping 17 years ago. On the Zimbabwe side, this is Hamilton Masakadza's ninth tour to Bangladesh. Elton Chigumbura will also be making his ninth trip, while Brendan Taylor has made seven. Many of Zimbabwe's squad members also have experience in domestic 20- and 50-over competitions here.In other words, they have come to know each other's strengths and weaknesses extraordinarily well. In recent years, it is Bangladesh who have displayed more of those strengths, and Zimbabwe's last away ODI victory against them came as long ago as 2010. Zimbabwe also arrive in the midst of a seven-month losing streak, having been whitewashed by both Pakistan and South Africa in their last two series. A change of fortunes wasn't suggested by their performance in their warm-up game against a BCB XI on Friday. Masakadza scored a century and Chigumbura a battling 47, but no other batsman reached double figures and the visitors sank to an eight-wicket defeat.Yet, Zimbabwe may sense an opportunity in a Bangladesh squad who are walking wounded and missing two of their most senior players. Shakib's recurring finger injury has ruled him out for another three months, while Tamim is yet to recover from the knuckle fracture he sustained after being struck by Suranga Lakmal in the opening Asia Cup match. Mashrafe and Mushfiqur have only recently recovered from injuries sustained in the same tournament, and neither is 100% fit. Even Mahmudullah was struggling with a little rib pain earlier this month.The visitors will look to target Bangladesh's stand-ins. The opening partnership was an issue for Bangladesh in the Asia Cup - Liton Das and Mehidy Hasan's 120-run stand in the final being the exception after Nazmul Hossain Shanto and Soumya Sarkar failed earlier in the tournament.That being said, Bangladesh still start Sunday's game as firm favourites, and positive results in the next three games will obviously help their preparations for next year's World Cup.Bangladesh LWWLL ((last five completed matches, most recent first))Zimbabwe LLLLLAfter stringing together a series of 20s against South Africa, Hamilton Masakadza finally converted a start into a century in Zimbabwe's warm-up. With his extensive experience of conditions in Bangladesh, Zimbabwe will look to their captain to set a platform for them at the top of the order. Masakadza has yet to win a game in his current stint in charge, and he has also registered just one fifty since he took over from Graeme Cremer after the World Cup Qualifiers meltdown.Liton Das seems to be in good nick. He scored a century in his last international innings, though his maiden ODI century was not enough to overcome India in the Asia Cup final. But he followed that up by racing to the fastest double-hundred in Bangladesh's first-class history, smashing a record he in fact already held after his 190-ball double in April, by 50 deliveries. With Bangladesh eyeing potential opening partnerships for next year's World Cup, quick runs at the top of the order on Sunday would definitely help to cement his place.Rubel Hossain is suffering from fever, but he could yet be fit for the first game. As they tinker with the opening slot, Bangladesh may pick both Imrul Kayes and Nazmul Hossain Shanto in the top order alongside Liton Das. At No. 7, it is a three-way battle between Mohammad Saifuddin and the uncapped Ariful Haque and Fazle Mahmud.Bangladesh (probable): 1 Liton Das, 2 Nazmul Hossain Shanto, 3 Imrul Kayes, 4 Mushfiqur Rahim (wk), 5 Mohammad Mithun, 6 Mahmudullah, 7 Fazle Mahmud, 8 Mehidy Hasan, 9 Mashrafe Mortaza, 10 Rubel Hossain, 11 Mustafizur RahmanSikandar Raza will slot straight back into a middle order that looks much more solid with him in it, but Zimbabwe have an opening conundrum to answer. Solomon Mire struggled through single-figure scores in South Africa, while Craig Ervine's trial as a makeshift opener in the warm-up lasted just three balls before he was caught behind off Ebadat Hossain. Zimbabwe have also drafted Cephas Zhuwao into their squad, but the left-hander remains a hit-and-miss option.Zimbabwe (probable): 1 Hamilton Masakadza, 2 Solomon Mire, 3 Craig Ervine, 4 Brendan Taylor (wk), 5 Sean Williams, 6 Sikandar Raza, 7 Elton Chigumbura, 8 Wellington Masakadza, 9 Brandon Mavuta, 10 Kyle Jarvis, 11 Tendai ChataraThe usual slow turning pitch at the Shere Bangla National Stadium is expected. A 2:30pm start means that the side fielding first will have to endure only about 90 minutes of hot weather. It promises to be a pleasant evening.Bangladesh and Zimbabwe have played each other 69 times in ODIs, with Bangladesh winning 27 games at home and 13 away.These two teams played each other in the very first ODI ever hosted at this ground back in 2006, Bangladesh winning that game by eight wickets.No player has scored more ODI runs against Bangladesh than Brendan Taylor, who has racked up 1222 runs in 46 innings. Both Masakadza and Chigumbura also have over 1000 runs against themThree Bangladesh players have scored over 1000 runs in ODIs against Zimbabwe but only one of them - Mushfiqur - is playing in this game\"We are not expecting the wicket to be slow or with turn right from the start. We are hoping for a good wicket. But since this is Mirpur, it is tough to predict how it will play.\"\nMashrafe Mortaza on the pitch\"Having everyone around is a big plus for the team. Apart from Graeme [Cremer] who is still injured, we have everyone around which is a positive for the team.\"\nHamilton Masakadza is glad to have Sikandar Raza back in his squadHis 127-run stand with No. 9 Saifuddin set the tone for a competitive score before their spinners applied the chokeTwo players with different mindsets and in different stages of their career fed off each other in a heartening display of confidence and maturityWith Bangladesh walking wounded in the absence of two of their seniormost players in Tamim Iqbal and Shakib Al Hasan, Zimbabwe may sense an opportunitySign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}