{"id": "ESPNBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upBCCI limits Shami workload to 15 overs per innings in Ranji matchABOUT COOKIES", "paragraph": "To ensure that Mohammed Shami arrives fit and not overworked for the Test series in Australia, the BCCI has put a condition on him turning up for Bengal next week for their Ranji Trophy match against Kerala. The BCCI cleared Shami, India's highest wicket-taker in Tests so far this year, to play the match at Eden Gardens from November 20, subject to him bowling not more than 15-17 overs in an innings.The BCCI was responding to the request from Cricket Association of Bengal (CAB) on whether Shami could play in the Kerala match since he was available. Shami had turned up in the Bengal dressing room this week during their match against Madhya Pradesh. Bengal captain Manoj Tiwary was pleasantly surprised to see the fast bowler and checked about his availability. \"I asked him if you are here anyways, why don't you play [the next round of Ranji],\" Tiwary told ESPNcricinfo.Shami was eventually picked in the 16-man squad for what will be Bengal's second Ranji game this season. According to Tiwary, Shami responded positively and said he was \"eager\" to play as long as the BCCI gave him the permission. At the selection meeting on Friday, also attended by former India opener Arun Lal (Bengal mentor), Bengal coach Sairaj Bahutule and CAB secretary Avishek Dalmiya, Tiwary was informed about the BCCI making it mandatory to maintain Shami's workload.The BCCI informed CAB that Shami should ideally bowl not more than 15 overs per innings and a few additional ones if need be. The BCCI physio would also need to be sent a daily chart of Shami's workload after each day's play.Although Lal understood BCCI's concern of ensuring the senior bowler would not be overused, he pointed out that Shami playing the Ranji match would only be beneficial for both him and India. \"I am glad that he is playing,\" Lal said. \"But if you want to prepare for a Test series, what better than match practice.\"The BCCI's concern is based on Shami's recent fitness issues. He was hampered by a knee injury during the IPL, which played a role in him not regaining fitness for the one-off home Test against Afghanistan. However, Shami returned strong and was relentless during the five-Test series in England, followed by the first Test at home against West Indies. He also played the first two ODIs against West Indies last month.Shami was picked as part of of the Indian Test squad for the four-match Border-Gavaskar Trophy that gets underway in Adelaide from December 6. Shami has been an integral part of the Indian fast-bowling unit, which played an impressive role on the tours of South Africa and England. So far this year, Shami has 33 wickets in nine Tests, at an average of 27.60, including a five-for in the final innings of the Johannesburg Test that India won in January.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}