{"id": "ESPNPakistan's T20I juggernaut awaits New Zealand's challengeSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upPakistan's T20I juggernaut awaits New Zealand's challengeABOUT COOKIES", "paragraph": "In this day and time, it's a surprise that a team can go seven months without playing international cricket. However, that's the case with New Zealand, who played their last game in March-April 2018. They will end the drought with the three-match T20I series against the No. 1-ranked Pakistan in the UAE, the first of which will be held in Abu Dhabi on Wednesday night.It's not as if the players have been taking it easy though. Many of them, including Colin Munro, Kane Williamson, Ross Taylor and Ish Sodhi were part of various franchises during the IPL or CPL. Also, New Zealand A were involved in a three-match T20 series in Dubai where they defeated Pakistan A 2-1. Players like Glenn Phillips, Corey Anderson and Mark Chapman were part of that team.Even so, New Zealand were dealt a blow when Martin Guptill was ruled out of the limited-overs leg due to a calf strain. It came after they were already without their first-choice spinner Mitchell Santner, who was ruled out for nine months after his right knee problem worsened in March.Guptill's absence meant Phillips was rewarded for his good form in CPL 2018 and the T20s against Pakistan A. The wicketkeeper-batsman is likely to partner Munro at the top of the order, while Williamson and Taylor will complete the top four.Sodhi is set to lead the New Zealand spin attack, and given the nature of the wickets in Abu Dhabi, he is likely to be backed by the left-arm spin of uncapped 30-year-old Ajaz Patel. Wednesday's game can also mark Anderson's return to international cricket, who last played for New Zealand in the 2017 Champions Trophy.Pakistan, on the other hand, seem to have mastered the unpredictable nature of T20 cricket under Sarfraz Ahmed. They will be chasing their 11th successive series win. After demolishing Australia 3-0 recently, they have once again shown what a strong bowling attack can do even in the shortest format. While there is Hasan Ali's pace and Faheem Ashraf's guile, the bowlers who will test the New Zealand batsmen most are spinners Shadab Khan and Imad Wasim.Pakistan have always had bowling riches, but in Babar Azam, they now have a batsman around whom other power-hitters can play. Mohammad Hafeez and Shoaib Malik not only lend experience and stability to the middle order, but they are also as good as any backup spinners.Pakistan WWWWW (last five completed matches, most recent first)New Zealand LLLWLBabar Azam is currently the No. 1-ranked batsman in T20Is, and there is a good reason for that. His last five innings read: 50, 45, 68*, 51, 97*. During this period, he averages 103.66 with a strike-rate of 131.22. It was Babar, who held the innings together in the first T20I against Australia where Pakistan suffered a middle-order collapse and slipped from 130 for 3 to 133 for 8. While there are more experienced batsmen in the Pakistan squad, there is little doubt who the main threat is.Colin Munro is one of the most destructive batsmen around. The left-handed opener not only has the most T20I hundreds, but his strike-rate of 163.59 is the highest for anyone with more than 500 runs in the format. However, by his own admission, he finds it difficult to spot the ball when it is turning both ways. This means it will be a fascinating battle when he faces Shadab's wristspin; it could well decide the series.Pakistan have stuck with the same squad that whitewashed Australia earlier this month. While they may juggle between Usman Khan and Shaheen Afridi for the role of the second seamer, there are not many changes expected from the XI that played in Dubai on Friday. Fakhar Zaman remains out with knee pain.Pakistan (possible): 1 Babar Azam, 2 Sahibzada Farhan, 3 Mohammad Hafeez, 4 Shoaib Malik, 5 Asif Ali, 6 Sarfraz Ahmed (capt & wk), 7 Faheem Ashraf, 8 Imad Wasim, 9 Shadab Khan, 10 Hasan Ali, 11 Usman Khan/ Shaheen AfridiWith Phillips set to open the batting, he will also keep wicket. This means Tim Seifert will have to miss out. Seth Rance may also have to wait for a chance with Anderson and Colin de Grandhomme occupying the allrounders' spot.New Zealand (possible): 1 Colin Munro, 2 Glenn Phillips (wk), 3 Kane Williamson (capt), 4 Ross Taylor, 5 Mark Chapman, 6 Corey Anderson, 7 Colin de Grandhomme, 8 Tim Southee, 9 Ish Sodhi, 10 Ajaz Patel, 11 Adam Milne/ Lockie FergusonAbu Dhabi's is not on a typical T20 wicket where batsman could hit through the line and on the up, as Australia found out when they were bowled out for 89. The average first-innings score here is 147. The forecast for Wednesday is partly cloudy with the temperature hovering around 27 degree Celsius. With the games being held at night, dew is also expected to play a role.Pakistan have now bowled out their opposition 30 times in T20Is. New Zealand and Australia are the next with 19 each.Pakistan have won 26 out of 30 matches under Sarfraz Ahmed. Their four losses came against West Indies, World XI, New Zealand and Australia.Colin Munro (567) and Glenn Phillips (457) were the top two run-scorers in CPL 2018.It [seven months] is an unusually long time between internationals but I guess that makes the guys very excited to get back involved. It's a great country to come to and play cricket against Pakistan, who are one of the strongest teams in world cricket at the moment.\nNew Zealand captain Kane WilliamsonTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}