{"id": "ESPNAustralia a different ball game, but India high on confidence - RohitSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upAustralia a different ball game, but India high on confidence - RohitABOUT COOKIES", "paragraph": "India captain Rohit Sharma says India will not get complacent following their 3-0 series sweep against West Indies (1:51)Rohit Sharma believes that the 3-0 whitewash of West Indies has completely prepared the Indian white-ball side for their tour of Australia which begins in nine days.After Shikhar Dhawan and Rishabh Pant scored match-winning half-centuries on Sunday, India's stand-in captain told reporters that they were \"high on confidence\" to take on the Australian challenge that kicks off with a three-game T20I series.\"It was important from the team's perspective for the players to get some runs ahead of the important Australia tour,\" Rohit said. \"Shikhar was batting well in the ODI series. He was not able to get big scores. He was getting 30s and 40s, but I am glad that he could play a match-winning knock today and get some form under his belt before the crucial tour. Rishabh was also hungry to go out and get some runs. It was the perfect situation today.\"When you win a series like this, you are high on confidence and it is all about taking that confidence there. Australia will be a different ball-game, and I completely understand that. But I think the things we have been doing as a team, we have to keep repeating the same thing we have been doing.\"India will, once again, be without MS Dhoni for the T20Is in Australia but Rohit backed Dinesh Karthik, the wicketkeeper during the West Indies T20Is, to keep coming good. In any case, they aren't short of options behind the stumps with Pant and KL Rahul both part of the squad.\"MS [Dhoni] not being in a team is a miss for any team,\" Rohit said. \"But I have played with Dinesh in Mumbai Indians when I was captain. We understand each other really well. His thought behind the stumps is important, like any other wicketkeeper.\"Dinesh's input has been important - on how the pitch is doing and the angle where the fielders are. Small little things like that. Dinesh has been helpful. He is also the skipper of one of the IPL franchises [Kolkata Knight Riders], and that really helps.\"The West Indies series also gave India an opportunity to test Krunal Pandya in international cricket. Already a vital cog in the IPL for Mumbai Indians, the 27-year old allrounder played a match-winning innings on debut, and was also tidy with the ball, giving away only 78 runs in 72 balls across three games.\"Krunal is a street-smart cricketer,\" Rohit said. \"He is never afraid of going and bowling to any batsman whether the batsman is set, whether it is a left-hander who is set. We have seen that when he played the IPL.\"I am quite impressed with how he approached these three internationals. He has got a great ability to play for India for a long period of time, only because he can also bat. You have seen how he finished the first game. He came and played shots which were not expected from a debutant, but he is fearless, just like his brother.\"At the end of the day, you need characters in the team like Krunal and Hardik who are not afraid of expressing themselves. I don't like to mention one or two players. All the players have different characters and, at different point of time, they have raised their hands and taken responsibility.\"The greatest positive from the series, according to Rohit, was India's fielding, and he led the way himself, with three sharp catches in the second T20I. \"There was going to be a question mark on our fielding after a long home season that we have played. We ticked a lot of boxes but I am especially happy how we fielded. Batting and bowling, there will be mistakes and good performances but I was particularly happy with our fielding.\"Rohit, however, brushed aside his own personal ambitions for a place in India's XI for the Australia Tests, opting to play down the hype around his return to the Test squad after being axed midway through the South Africa series in January this year.\"I am not thinking about the Test match. I am someone who doesn't think too far ahead. All I am thinking is going back, taking few days off, and take the flight to Australia,\" he said. \"If I try and stay in present, it works for me.\"Test matches are something I was looking forward [to] for a long time. It will be a nice to go out there and play a Test match for India. As a batsman, I don't think about my past performances. Every game is a new game. Every time I go out there in the middle, I keep things simple. This game is simple if you keep it simple. If you overthink, it can get complicated. So it is important to stay in [the] present. It is important to start well in Australia and then, take it from there.\"India play their first T20I at the Gabba on November 21, after which the series moves on to Melbourne and Sydney. Then comes a four-Test series before the tour finally winds down with three ODIs starting January 12.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}