{"id": "ESPNWho's the next fastest to 10,000 ODI runs after Virat Kohli?Sense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upWho's the next fastest to 10,000 ODI runs after Virat Kohli?ABOUT COOKIES", "paragraph": "I know that Virat Kohli reached 10,000 runs in ODIs quicker than anyone else. Who was the next fastest? asked Ghulam Karmarkar from India\nVirat Kohli scorched past 10,000 runs in one-day internationals during his unbeaten 157 in the tied match against West Indies in Visakhapatnam last week. That was his 205th innings, in his 213th ODI. The next fastest to 10,000 was Sachin Tendulkar, who got there in his 259th innings (266th match). That means that Kohli could make ducks in his next 50 innings, and still have the most runs at that stage of an ODI career.Of the others in the select band of batsmen who have scored 10,000 ODI runs, Sourav Ganguly needed 263 innings (272 matches) to get there, Ricky Ponting 266 (272), Jacques Kallis 272 (286), MS Dhoni 273 (320), Brian Lara 278 (287), Rahul Dravid 287 (309), Tillakaratne Dilshan 293 (319), Kumar Sangakkara 296 (315), Inzamam-ul-Haq 299 (322), Sanath Jayasuriya 328 (337) and Mahela Jayawardene 333 (355).Among current players, the only one threatening Kohli's marks is Hashim Amla, who has so far scored 7696 runs in 166 innings (169 matches); at the same point, Kohli had 7460 runs. Since then Kohli has increased his average from 52.90 to a giddying 59.90, so Amla - who is more than five years older - will do well to keep up.Tom and Sam Curran both played for England in one of the ODIs in Sri Lanka. When was the last time England fielded brothers in the same team? asked Kenneth Day from England\n I suppose it was only a matter of time before Tom and Sam Curran played in the same England team - they had racked up 24 international appearances between them before finally doing so, in the fifth ODI against Sri Lanka in Colombo last week. The last pair of brothers to appear in the same ODI for England were Adam and Ben Hollioake, against Sri Lanka in Sydney in 1998-99.The Hollioakes also played a Test together - their joint debut, against Australia at Trent Bridge in 1997. That was the first time England had fielded brothers in the same Test team for 40 years, since Peter and Dick Richardson both played against West Indies, also at Trent Bridge, in 1957.Aaron Finch scored nine centuries in ODIs before making his Test debut. Has anyone made more than this? asked Kade McNamara from Australia\n Aaron Finch and Ireland's William Porterfield made 11* one-day international hundreds before making their Test debuts; Paul Stirling made seven and Ed Joyce six. Virat Kohli made five, while Ahmed Shehzad of Pakistan, South Africa's Quinton de Kock and Rohit Sharma all made four.But Porterfield leads the way for ODI runs before Test debut - he piled up 3692, in 119 matches. Finch is second with 3361 from 93. Stirling made 3295, Kevin O'Brien 3126 and Rohit 3049. The current player with the most runs in ODIs without having appeared in a Test is South Africa's David Miller with 2588, just ahead of England's Jason Roy (2536). Among non-Test players, Calum Macleod has made seven ODI centuries, Roy six, Ryan ten Doeschate five, Miller and Kyle Coetzer four.We had this question in a recent quiz, and it floored everyone - what's the answer please! What do Gerry Alexander, Chandrakant Pandit, Wally Grout and Tim Zoehrer uniquely have in common? asked M Rajneesh from India\n Well, all four of them are wicketkeepers - but they do share something more specific than that. Alexander and Grout were keepers in the first tied Test, between Australia and West Indies in Brisbane in 1960-61, and Pandit and Zoehrer featured** in the second tied Test, between India and Australia in Madras (now Chennai) in 1986-87.Who reached 50 in his first Test innings by hitting 12 fours? asked Mukul Ahmed from India\n I think the answer here is Shikhar Dhawan, who raced to 50 on debut, with a dozen fours for India against Australia in Mohali in 2012-13. His eventual 187 - from just 174 balls - contained 33 fours and two sixes.When New Zealand's Tim Southee walloped an unbeaten 77 in the second innings of his first Test, against England in Napier in 2007-08, his half-century included 50 in boundaries. He hurtled to 53 (from 29 balls) with his seventh six, and also hit two fours. Southee ended up with four fours and nine sixes - and hasn't yet bettered that debut score in 59 further Tests.*Oct 31: This answer was revised completely. It previously had out-of-date informationUpdate: ** Pandit actually played this Test as a batsman and kept in the second Test in Delhi. Kiran More was the keeper opposite Tim Zoehrer in ChennaiUse our feedback form or the Ask Steven Facebook page to ask your stats and trivia questionsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}