{"id": "ESPNMushfiqur Rahim's record double-hundred underpins Bangladesh's dominanceABOUT COOKIES", "paragraph": "\nStumps Zimbabwe 25 for 1 (Chari 10*, Tiripano 0*, Taijul 1-5) trail Bangladesh 522 for 7 dec (Mushfiqur 219*, Mominul 161, Jarvis 5-71) by 497 runs\n\n\n\n\n\r\nMushfiqur Rahim celebrates his double-hundred\t\t\t\t © Raton Gomes/BCB\n\n\n\nMushfiqur Rahim lit up the second day in Mirpur with a brilliant, unbeaten 219 that allowed his team to declare their innings at a massive 522 for 7. Mushfiqur's was the first Test double-hundred of 2018 and the highest score recorded by a Bangladesh batsman in Tests, while he also became the first wicketkeeper in Test history to hit two double-tons. \n\nHaving set a new Bangladesh record for the fourth-wicket partnership with Mominul Haque on the first day, Mushfiqur followed that up by setting a new record for his country the eighth with Mehidy Hasan. Together they added an unbeaten 144, Mehidy striking five fours and a six in an adventurous 68 before the declaration came 40 minutes after tea.\n\nMushfiqur reached the landmark 15 minutes after tea, having batted for over nine hours, and his marathon knock meant that Bangladesh were able to weather a five-wicket haul from Zimbabwe seamer Kyle Jarvis. While Jarvis was probing in every spell he bowled, Zimbabwe were hampered by an injury to his seam-bowling partner Tendai Chatara. He pulled up short running up to bowl the third delivery of his 22nd over of the innings, clutching his left thigh and wincing in pain. He was stretchered off with a suspected grade 2 quadriceps muscle strain, and Zimbabwe lost a leader of their attack for the remainder of the match.\n\nIn his absence, Jarvis struck twice in the first half-hour after lunch to pick up his third five-for in Tests, but Mushfiqur held firm. A slash over the slips brought up his 150, which took up 334 balls and five minutes short of eight hours at the crease. \n\nHe greeted Sikandar Raza's introduction for the first time in the day by twice using his feet to get down the track, driving inside out through cover and then clobbering the first six of the innings over midwicket. Mehidy brought up a 78-ball fifty by double-stepping and slamming Raza over long on for another six, and proved the perfect foil for Mushfiqur's more level-headed accumulation.\n\nMushfiqur's acceleration in the afternoon stood in stark contrast to his morning go-slow, when he faced 55 deliveries in the first session before hitting his first boundary. There was no hint of the impatient, limited-overs batting style that blighted Bangladesh's efforts in the first Test, and Mushfiqur and Mahmudullah progressed through the morning very much in Test mode.\n\nMushfiqur had been the fortunate recipient of another missed chance in the field by Zimbabwe in the fourth over of the morning, when Chakabva tumbled to his right but failed to hold onto a thin inside edge that had ricocheted off the batsman's pad. Mushfiqur doubled down his defence in response, taking an hour and a half to score his first ten runs of the day, but then unfurled the sweep shot to good effect against Zimbabwe's spinners, collecting boundaries off Sean Williams and Brandon Mavuta.\n\nAs he batted on and on through to tea and beyond, he found increasing momentum, picking the right ball to attack, and when the declaration finally came, a Zimbabwe line-up, fatigued by the better part of two days in the field, was faced with the prospect of surviving a tricky 18-over period before the close.\n\nHamilton Masakadza survived a review for lbw after being hit on the pad by Mustafizur Rahman third ball, and was gifted a second life when he edged debutant Khaled Ahmed into the slips, where Ariful Haque dropped the chance. But in fading light, his battling knock came to an end when he edged Taijul Islam low to Mehidy at slip to fall for a 44-ball 14. Brian Chari and nightwatchman Donald Tiripano survived unscathed to the close, but Zimbabwe have been left with a mountain to climb after Mushfiqur's epic.\nLiam Brickhill is a freelance journalist based in Cape Town\n        To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies.\n      "}