{"id": "ESPNEngland contemplate change but must be ruthless to end winless overseas runSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upEngland contemplate change but must be ruthless to end winless overseas runABOUT COOKIES", "paragraph": "You know what Joe Root means when he says England have to \"show courage\" if they are to prevail in Sri Lanka. You know what he means when he says they have to \"take the odd risk\" and find a \"different formula\", too.He means they have to consider altering the balance of their side. He means they might have to ditch their long-held reliance on seam - and their record-breaking pair of opening bowlers - to find room for three spinners and, perhaps, a wicketkeeper who might not demand a place in the side as a batsman.And those are no trivial considerations. The last time England dropped Stuart Broad was - depending on your definition - either in 2012 (he would claim in was injured during that India tour, but the team management at the time were not so charitable) or 2008 (also in India), while the last time they played anything approaching a specialist keeper was in 2009 when Tim Ambrose, who was a good enough batsman to score a Test century, played the last of his 11 Tests. James Foster played his last Test in 2002; Chris Read in 2007.So talk of England handing a debut to Ben Foakes is significant. As is talk of Broad making way for a spinner, or to ensure England's batting can be bolstered. And while England have played three spinners a few times in recent years (it was relatively common in Bangladesh and India on the 2016-17 tours), there has often been an insistence that all three of them be something approaching allrounders. Jack Leach has earned his selection purely through his skill as a bowler.And Root is right, too. For if England keep to the same formula they have tried in recent years, they will no doubt suffer the same results. They have lost 10 of their last 13 away Tests (and won four of the last 30), after all, and not won an away series since defeating South Africa at the start of 2016.And that's despite bowling pretty well on most of their tours. Look at the Ashes, for example: Tom Curran, James Anderson, Craig Overton, Chris Woakes and Broad, among others, hardly bowled a poor spell. They were determined, accurate, persistent and consistent. They just didn't have the skills to unlock Australia's batting - and the excellent Steve Smith, in particular - on good surfaces.It was not so different in India. Broad and Anderson conceded their runs at well under three an over but simply could not find a way past the bat of Virat Kohli and co. There's no point them trying the same approach. It doesn't work.And while Root is too polite to say it, he knows that England's catching in the cordon has not been good enough in recent times. He knows his side were fortunate to get away with dropping Kohli during India's visit to England in the summer and that they cannot afford similar mistakes here. Only a couple of Tests ago, there was serious consideration being given to preferring Jos Buttler to Jonny Bairstow with the gloves. Now it seems Foakes, who is more likely to take the under edges and stumping opportunities that could define this series, is within an ace of a Test debut.It would make sense, too. Buttler, by his own admission, was not at his best with the gloves during the limited-overs series and has plenty on his plate as one of England's best batsmen against spin. And while Broad is fond of saying he is England's unluckiest bowler (in terms of drops), Moeen is every bit as unfortunate but tends not to react as much. Foakes' inclusion could make the difference between accepting a series-turning chance or spurning it.But Root isn't entirely right. For while England's approach in the field - admirable but limited on recent overseas tours - may require a fresh look, their batting just has to be better. Take the India tour, for example: twice they failed to reach 300 in their first innings and when they made 400 in Mumbai, India made 631 on the way to an innings victory. In Chennai, their first-innings 477 was put into perspective as India amassed 759 for 7 declared and again won by an innings.So England don't necessarily have to be courageous or take risks with the bat to prevail in Sri Lanka. They might just have to be more ruthless, more determined and more hungry. So, if they reach 368 for 4, as they did in Perth during the Ashes, they have to understand the job is not done. They were eventually bowled out in that match for 403, only to see Australia reply with 662 for 9 and - you've guessed it - win by an innings.There are some reasons for limited optimism. For a start, this is a Sri Lanka side in something of a transition and without the batting giants who gave them an advantage so often. This England side - well, the part of this England side that also play ODI cricket - also play spin better than most of their compatriots (this is not especially high praise, it is true) and have remarkable depth due to a proliferation of allrounders. It's a significant strength.But winning in these conditions - when confronted by the heat, a relatively unfamiliar ball and, most of all, by spin bowling - will always be the ultimate challenge for England. In scheduling just four days of warm-up cricket (reduced to three by the rain), they have hardly given themselves the best chance. It will be a terrific achievement if they can pull it off.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}