{"id": "ESPNPerth ODI not quite behind paywallSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upPerth ODI not quite behind paywallABOUT COOKIES", "paragraph": "Australia's first international match under the new terms of the broadcast rights agreement with Fox Sports will not take place entirely behind the paywall due to the fact the network's flagship sports streaming app has not yet launched.One of the key planks of the $A1.18 billion deal with Fox Sports and the Seven network was that all of Australia's home ODIs and Twenty20 matches would be exclusive to the pay TV provider, meaning that a subscription would be required to watch these matches.However, this was also contingent on streaming being provided via a new digital sports streaming app, aimed at being considerably cheaper than the prices of sport packages on Foxtel's existing digital box and streaming services.Due to the fact this app has not yet been launched, viewers are able to watch Sunday's Perth ODI between Australia and South Africa for free on Cricket Australia's Cricket Live app, requiring only to sign up to the app - without paying a fee - to do so. It is not yet clear how long this arrangement will last, depending on when the Foxtel sports app is launched.After that time, users of the CA live app will have to subscribe to Foxtel's streaming serve to be able to watch those same pictures via the app. Under the previous deal with Nine and Ten, users paid CA directly for this streaming service.CA has faced criticism for taking a significant portion of international and Big Bash League cricket behind the paywall, but the outgoing chief executive James Sutherland has argued that the decision was based around a combination of changing viewing habits among fans and the need to reach a desired level of broadcast rights funding for the game in coming years.\"The significance of it is more to do with the way of the world and the way people are consuming media today than anything else,\" Sutherland told ESPNcricinfo on his final day in the job. \"It's also a reflection of the way in which the landscape's changing and perhaps the economics of free-to-air television and all of that, but through other means we're continuing to try to broaden the access to the game, or to complement that access with digital media platforms and other access.\"It'll certainly be a change, but by and large it'll be a huge positive for the game, because of the way Fox will provide huge bandwidth and promotion of cricket that we haven't been able to enjoy previously to that same extent, and the way that AFL and NRL have enjoyed for a number of years now.\"The deal struck in April essentially doubled the amount of money being paid by broadcasters when lined up against the A$590 million deal signed by the Nine and Ten networks in 2013.\"I was very open throughout the process talking publicly and to our media partners that the preferred outcome was to land in a free-to-air environment and that we were prepared to take a significant discount for everything to be on FTA,\" Sutherland said. \"But there was a point there where that discount became too great, and as a Board we talked about that, and the Board gave us guidance as to what premium we needed in order to go down a slightly different path, where we were on FTA but some went behind the paywall.\"So it wasn't a conscious decision to say this is where we're going, it was just how it turned out. We were very close to a different outcome, but it never quite got there.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}