{"id": "ESPNRCB sell de Kock to Mumbai in IPL 2019's first tradeSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upRCB sell de Kock to Mumbai in IPL 2019's first tradeABOUT COOKIES", "paragraph": "South African wicketkeeper-batsman Quinton de Kock is the IPL's first trade of 2019, before the auction takes place in mid-December. ESPNcricinfo understands that de Kock, who last year played for Royal Challengers Bangalore, has been traded to Mumbai Indians in an all-money deal.Royal Challengers had bought de Kock for INR 2.8 crore (USD 437,000) at the 2018 auction. ESPNcricinfo has learnt that Mumbai have bought de Kock at that price and to offset the deal, they have released Bangladesh fast bowler Mustafizur Rahman (INR 2.2 crore, USD 343,000) and Sri Lankan offspinner Akila Dananjaya (INR 50 lakh, USD 78,000).De Kock played eight matches in IPL 2018, scoring 201 runs at a strike rate of 124.07. Although Mumbai already have two wicketkeepers in Ishan Kishan and Aditya Tare, they might have been keen on de Kock for his top-order batting. They used the hard-hitting West Indies batsman Evin Lewis as opener earlier this year, but he struggled towards the end of the season, prompting the Mumbai coaching staff to seek back-ups. De Kock, who has also played for Delhi Daredevils and Sunrisers Hyderabad, has impressive numbers in the IPL, scoring a hundred and six fifties in 34 innings. He has also made 573 of his 927 runs in the Powerplay, at a strike-rate of 125.6.The IPL has two main trading windows with the first one starting immediately at the end of the season stretching to a month before the auction and the second one from after the auction till the start of the tournament. Since 2018, the IPL also introduced a mid-tournament window for franchises to trade uncapped players and players who had not played more than two matches.With the last date for retentions and release being November 15, franchises are busy working out their plans for the new season before they make fresh buys at the auction. A purse of INR 3 crore will be available for the franchises in addition to the balance left after last year's auction.The IPL has not yet formally communicated an auction date, but ESPNcricinfo understands December 16 has been earmarked with Goa as the likely venue. The franchises were told that the auction was supposed to happen between December 15 and 20.The franchises will also want clarity over where the IPL will take place in 2019 because India's general elections will be taking place around the same time as the tournament. This had been the case in 2014 as well when, owing to security concerns, the first set of matches were played in the UAE.Now, however, the franchises are averse to playing in the Dubai and Abu Dhabi because they fear the pitches would end up being too slow. The IPL has not revealed any plans yet, but it is understood that South Africa has been chalked in as an alternative venue. It is also waiting for the central election commission to announce the date for the elections, but franchises want an answer soon so they can prepare for the auction accordingly.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}