{"id": "ESPNNew Zealand lose eight for 23 as Pakistan complete 3-0 sweepMatch CoverageBetting OddsPresented ByBet365ABOUT COOKIES", "paragraph": "Pakistan 166 for 3 (Babar 79, Hafeez 53*) beat New Zealand 119 (Williamson 60, Shadab 3-30, Maqsood 2-21, Imad 2-28) by 47 runsFor all of ten glorious overs - and it was glorious, no matter who one supported - it seemed like Kane Williamson would single-handedly snap Pakistan's T20I winning streak. With Colin Munro and Colin de Grandhomme dismissed early in a chase of 167, and the Powerplay almost over, this looked like a stroll for Pakistan. It ended up being every bit the stroll it appeared at that point, with Pakistan winning by 47 runs, but Williamson gave them an almighty scare in the middle. He smashed - caressed, really - 60 runs off 38 balls in a manner so classical you'd feel blessed to see it in a Test match. It wrested the advantage back in New Zealand's favour, but once he holed out to long-on off Shadab Khan, the tourists went back to being the side they had looked before their captain had sprinkled his class over the contest. They lost their last eight wickets for 23 runs, and Pakistan had yet another well-deserved clean sweep to their name.This was not to be the close contest the first two games had been, even though New Zealand made an excellent start. Seth Rance found the sort of prodigious swing no bowler had managed all season, and Fakhar Zaman was particularly discomfited. Pakistan manged just 33 runs in the first six, with Zaman dismissed following an ugly hoick to the offside, ensuring the left-hander's poor run in Asia continued.It was Babar Azam, inevitably, who got his side back on course. Needing 48 runs to overtake Virat Kohli to become the fastest to 1000 T20I runs, he began to take control of the overs immediately following the Powerplay, picking up the run rate alongside the in-form Mohammad Hafeez. Just as this pair had done for much of the T20I series against Australia, the pair was responsible for the bulk of the runs scored in the Pakistan innings, the partnership adding 96 off 64 deliveries. For the first time in six games, Pakistan knocked themselves out of the magnetic field that seems to hold them within the 145-160 range, a late flourish ensuring they set the tourists 167 to chase.Hafeez was the man they had to thank for that flourish, with the 38-year old seamlessly taking over once Babar was dismissed for 79. That is usually the point at which Pakistan innings have stuttered of late, but four boundaries in the following seven balls that New Zealand bowled to Hafeez and Shoaib Malik went for four. The momentum thus remained unequivocally with Pakistan, who carried it right throughout the innings.They held onto it at the change of innings, and struck New Zealand a hammer blow with the wicket of Colin Munro in the second over. Faheem Ashraf, who had borne the brunt of his belligerence in the previous match, knocked back his middle stump as Munro cleared his front leg, and the flying start he had provided to New Zealand in the first two games would have to be made up for elsewhere.With Glenn Phillips still struggling, and Colin de Grandhomme carelessly run out Williamson took up the responsibility. Never a big hitter, he was relentlessly inventive in the way he found his boundaries, from lapping the fast bowler over fine leg to delicate touches that beat third man. Even when he danced - and it really did look that graceful - down the wicket to loft the ball out of the ground, they looked more like drives than slogs. The only thing about him that looked like a modern T20 player was his strike rate.But with no support coming from the other end, it would require a one-man effort if New Zealand were to deny Pakistan a clean sweep. Once he was dismissed, Pakistan immediately reverted to being the side that beats the opposition into the ground, and they did that with devastating efficiency. Shadab Khan, Imad Wasim and debutant Waqas Maqsood each took two wickets in an over as they scorched their way through the middle and lower order, and within 25 balls of Williamson's departure, the innings was over.That is what Pakistan have reduced oppositions to at the moment. Passages of ascendancy. The prospect of a team extending that passage to the point it becomes a match-winning one continues to remain elusive, as the home side cap another hugely successful year in the format; they have lost just two T20Is in 2018.What seems most predictable at the moment is arguably cricket's most unpredictable side winning in the sport's most unpredictable format. Who would have predicted that?Fifties from Babar Azam and Mohammad Hafeez had helped Pakistan put up 166 before the spinners derailed New Zealand's chasePakistan will hope to extend their T20I winning run to nine in a row having already sealed an 11th consecutive series victorySign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}