{"id": "ESPNKarthik, Krunal usher India home in low-scoring scrapABOUT COOKIES", "paragraph": "\nIndia 110 for 5 (Karthik 31*, Krunal 21*, Brathwaite 2-11, Thomas 2-21) beat West Indies 109 for 8 (Allen 27, Kuldeep 3-13) by five wickets\n\n\n\nWest Indies' next-gen T20I stars, plucked out of the Caribbean Premier League 2018, were tipped to challenge India more than their ODI and Test sides had done. Their batsmen cobbled only 109 for 8, but their bowlers, led by debutant quick Oshane Thomas, ambushed India's top order and ran them close, before Dinesh Karthik and Krunal Pandya, also on debut, ushered the hosts home.\n\nKrunal, whose first touch with the ball was a fumble to the boundary in the game's first over, hit the winning runs with an eye-catching chip over extra-cover. He had also played a part with the ball, claiming the wicket of his IPL team-mate Kieron Pollard, while conceding only 15.\n\nIt was anybody's game when 21-year-old Thomas and his captain Carlos Brathwaite pinned India down to 45 for 4 inside eight overs. Thomas set the speedgun on fire - like he had done at the CPL and in the ODI series - ripping out both Rohit Sharma and Shikhar Dhawan with 147kph inswingers. It was the third time in three innings on this tour that he had nailed Dhawan's stumps. Brathwaite then dug the ball into the pitch and had Rishabh Pant and KL Rahul holing out for 1 and 16 respectively.\n\nThomas continued to hit speeds north of 145kph, leaving Karthik and Manish Pandey ducking and weaving. At one point, Brathwaite even deployed Pollard at forward short leg. Karthik and Pandey saw him and Brathwaite off, putting on 38 for the fifth wicket off 45 balls.\n\nLeft-arm spinner Khary Pierre, who like Krunal bowled constricting lines, gave India further jitters, when he beat Pandey with dip and turn, drawing a return catch. At that point, India needed 27 off 30 balls. While Karthik simply defended tightly or knocked the ball into the gaps, Krunal was more adventurous; even venturing a reverse-paddle off his third ball. They ultimately sealed the game with five wickets and 13 balls to spare in India's first-ever T20I at home without MS Dhoni.\n\nWest Indies' T20I line-up was dripping with flair and depth - they had hitters until No. 10 - but their troubles at the top set them up for failure. In the absence of their gun openers Chris Gayle and Evin Lewis, West Indies used a make-shift opening pair in Shai Hope and Dinesh Ramdin, who had laboured to 24 off 30 balls in his most recent game as an opener, in the CPL final earlier this year. Before that, Ramdin had opened only twice in competitive cricket - both in 2007.\n\nHe was uncertain against the swing of left-arm quick Khaleel Ahmed, but it was Umesh Yadav, playing only because of Bhuvneshwar Kumar's illness, who found Ramdin's outside edge. In the next over, Hope was involved in a farcical mix-up that might break Youtube hit counters. After he clipped the ball away to the right of short midwicket, Rahul hunted it down but lobbed the ball over wicketkeeper Karthik's head. Both Hope and Shimron Hetmyer were dashing towards the non-striker's end by the time Pandey swooped in from backward point and effected a run-out, despite colliding with Karthik.\n\nHetmyer then flickered briefly before Jasprit Bumrah bounced him out with a 141kph short ball that was aimed at the armpit.  Pollard, West Indies' most experienced batsman, was all at sea against both swing and spin, as he tiptoed to 14 off 26 balls, before Krunal sent him off with a kiss.\n\nIt turned into a full-blown collapse when Darren Bravo, Rovman Powell and Brathwaite all fell to Kuldeep Yadav. At 63 for 7 in 14.5 overs, West Indies were in danger of being dismissed for a sub-100 total, but Fabien Allen (27 off 20 balls) and Keemo Paul (15* off 13 balls) helped their side avoid that ignominy. Thomas' blistering pace then made their total of 109 look bigger, but not big enough.\nDeivarayan Muthu is a sub-editor at ESPNcricinfo\n        To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies.\n      "}