{"id": "ESPNNeser-Steketee rearguard for Queensland eclipses Lyon four-forMatch CoverageBetting OddsPresented ByBet365Sheffield ShieldABOUT COOKIES", "paragraph": "New South Wales 279 & 0-33 (Larkin 20*, Hughes 12*) lead Queensland 260 (Neser 62, Labuschagne 52, Lyon 4-83) by 52 runsA four-wicket haul from New South Wales spinner  Nathan Lyon was overshadowed by a stunning rear-guard from Queensland duo Michael Neser and Mark Steketee to leave the game evenly poised at the end of day two in Canberra.Queensland looked in danger of giving up a significant first innings lead when Lyon had Jimmy Pierson stumped to leave the Bulls 7 for 146.But Neser and Steketee unleashed a vicious counter-attack. The pair put on 64 in just 11 overs to tick the total past 200. Neser struck 10 fours in his 62 before falling caught and bowled to Lyon. He has now scored three consecutive Shield half-centuries. Steketee hammered four sixes and two fours in his 41 before holing out at deep midwicket off Pat Cummins.Earlier, Marnus Labuschagne made a compact half-century as he continued to push to retain his spot in the Test side. He cruised to 52, with six fours, before chopping on off Cummins. Matt Renshaw was one of Lyon's four wickets, edging behind trying to force square off the back foot for just 21.Blues openers Nick Larkin and Daniel Hughes made it to stumps to give New South Wales a lead of 52 with 10 wickets in hand heading into day three.Michael Neser and Mark Steketee's brisk 64-run stand left the game evenly poised at the end of day two in Canberra after Nathan Lyon took four wicketsQueensland lost an early wicket in reply and will face Australia's Test attack on the second daySign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}