{"id": "ESPNSophie Devine pummels Ireland with 21-ball fiftyMatch CoverageBetting OddsPresented ByBet365Women's World T20ABOUT COOKIES", "paragraph": "New Zealand 81 for 2 (Devine 51, Delany 1-9) beat Ireland 79 for 9 (Lewis 39, Kasperek 3-19, Tahuhu 2-17, Kerr 2-18) by eight wicketsNew Zealand put an end to their tournament with all the verve that was expected of them at the start, brushing Ireland aside by eight wickets and more than 12 overs to spare. Allrounder Sophie Devine followed up figures of 3-1-4-1 with a 21-ball fifty - the joint-fastest with Alyssa Healy this tournament - to lead the rout in Group B's last fixture. The spin trio of Leigh Kasperek, Amelia Kerr, and Jess Watkin played a significant part in New Zealand's triumph, taking six wickets in the 12 overs they bowled.Ireland had begun solidly after electing to bat, down largely to No. 3 batsman, 17-year-old Gaby Lewis who displayed extraordinary strokeplay down the ground as veteran Clare Shillington struggled to find rhythm in her last T20I innings. The same had been the case with opener Cecelia Joyce, and her twin Isobel Joyce, who came in at No. 4 and announced after the match that they would retire too. That made Ireland's tally four on the night, with 39-year-old Ciara Metcalfe also among the names.Lewis hit three boundaries down the ground, the best one an inside-out drive against Kerr that went wide of mid-off, while the rest of the line-up relied on going across the line on a pitch that had kept low right from the first over. Many of them were lbw as a result - although Isobel and Shauna Kavanagh would have both survived had they chosen to review their lbw calls.Ireland's only substantial partnership was between Lewis and captain Laura Delany. The pair put on 39 for the fourth wicket, but Delany's stay was also wrought with struggles against the slow bowlers. Just before her 22-ball 12 ended, Ireland showed the first sign of a frenzied finish. To be more particular, Lewis had, running aimlessly and ending up at the same end as Delany without making a call for the run. Cover-point's throw was high, though, and allowed Delany to make it to the non-striker's end. She was out the next over, and the immediate ball after that, Lewis tried to steal a single from the wicketkeeper off Kavanagh's inside edge. She was at least two yards short when the throw missed.In the next over, it all came to an end. After a composed, organised innings, she capped of the delirium of her last 10 minutes in the middle by running past Kerr's legbreak to be stumped. It was the final straw. Ireland made only 10 runs off their last 5.1 overs, losing six wickets in the process.New Zealand's innings wasn't anywhere near as sluggish. Ireland's bowling was loose, without putting too fine a point on it. Devine manufactured her first boundary by stepping out and driving past her opening partner Suzie Bates, but was fed a full toss on the pads next ball by spinner Eimear Richardson. New Zealand made 11 in the first over, more than Ireland made in their last five.Bates became the first woman to 3,000 T20I runs in the third over of the chase, but that was about the last time she would be prominent in the innings. Devine picked up two sixes off that Metcalfe over, and one four, to get well on the path to a rapid fifty. She missed her own world record of an 18-ball one, and could only get a single off the 20th ball when she was on 46. But she drilled Delany's first ball of the sixth over past Bates to equal the tournament record. She fell soon after, but New Zealand had finished the Powerplay with 74 on the board, and victory wasn't too far away.New Zealand restricted Ireland to 79 and chased down the target in under eight overs as the Group B games came to a closeSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}