{"id": "ESPN'Deep sense of fear and worry' for Indian cricket - GangulySense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-up'Deep sense of fear and worry' for Indian cricket - GangulyChange in independent committeeABOUT COOKIES", "paragraph": "In a letter to the BCCI's office bearers, Sourav Ganguly, the president of the Cricket Association of Bengal (CAB), said he has a \"deep sense of fear and worry\" about how cricket is being run in India and that the game's popularity is \"in danger\" because of the current administration.In his letter, which ESPNcricinfo has accessed, he has also spoken publicly for the first time about the \"appalling\" way in which Ravi Shastri was selected as the national team's head coach. He also criticised the handling of the recent sexual harassment case and the changing of playing conditions in domestic cricket in the middle of the season.Veena Gowda, the independent member on the BCCI's internal complains committee, has replaced PC Sharma on the independent committee put together to probe into allegations of sexual harassment against the BCCI CEO Rahul Johri. The BCCI statement on its website did not give a reason for the change but Vinod Rai, head of the the Supreme Court-appointed Committee of Administrators (CoA), told the Times of India that Sharma, a former Central Bureau of Investigation director, is in a \"minor\" conflict of interest. Sharma's son-in-law is a BCCI employee, the paper reported.The BCCI has also uploaded the terms of reference for the committee on its website, which made clear that the committee was free to probe into allegations that pertain to a time outside Johri's tenure with the board. An email address will soon be set up to invite any person \"desirous of placing any fact before the committee\". The first meeting of this committee will be held in Mumbai, where the CoA will share with the committee all it knows about the case.Two of these three decisions - made with the blessings of the Supreme Court-appointed Committee of Administrators (CoA) - directly involved Ganguly, and possibly overruled him.Ganguly was on the Cricket Advisory Committee that selected Shastri as India's coach after the bitter falling out of captain Virat Kohli with incumbent coach Anil Kumble. First, the deadline for the application was extended, allowing Shastri to apply. After the interviews, Ganguly said in a press conference he wanted to give Kohli some time to think about his demand. However, the CoA and the BCCI announced Shastri's appointment the same evening. The first press release said Rahul Dravid and Zaheer Khan had been appointed batting and bowling consultants, but neither Dravid nor Zaheer ever got to work with the team.\"My experience in the matter of coach selection was appalling,\" Ganguly wrote. \"The less said the better.\"Ganguly is also the head of the BCCI technical committee, which has traditionally framed rules, regulations and playing conditions for the domestic game. But their recommendations on how to include north-eastern state teams into Ranji Trophy were also overlooked. \"Cricketing rules are changed in the middle of a season, which has never been heard of,\" Ganguly wrote. \"Decisions made in committees are turned around with complete disrespect.\" There have been other cases of qualification criteria being changed mid-tournament in domestic cricket this year as well.Another important recommendation of the committee was to favour day-night Test cricket, but the BCCI CEO Rahul Johri said that plan was put on hold because the team management was against it. Consequently, for India's tour later this year, Cricket Australia has scheduled an all-day Test in Adelaide for the first time since 2014.Ganguly was also critical of the manner in which the charges of harassment against Johri was being handled by the CoA. After an anonymous sexual harassment complaint against Johri popped up on Twitter on October 12, a divided CoA constituted an independent committee on October 30 to investigate the allegations. There had also been murmurs of an internal complaint against Johri, but the CoA neither acknowledged nor denied them until it asked this committee to look into internal complaints as well.Johri was first given a week to explain himself; Diana Edulji, one half of the CoA, wanted Johri to resign before any such probe, but Vinod Rai constituted the independent committee, which was then revealed to include a member, PC Sharma, whose son-in-law was a BCCI employee.\"I don't know how far it's true, but the recent reports of harassment has really made the BCCI look very poorly,\" Ganguly wrote in his letter. \"More so the way it has been handled. The committee of CoA from four has come down to two and now the two seem to be divided.\"Ganguly used strong language to describe the state of cricket administration in India. \"I write this mail to you all with the deep sense of fear as to where Indian cricket administration is going,\" he wrote. \"Having played the game for a long period of time, where our lives were ruled by winning and losing, and the image of Indian cricket was of paramount importance to us. We wake up looking at how our cricket is faring even now.\"But with deep sense of worry, (I used the word worry) I beg to state that the way things have gone in the last couple of years, the authority of Indian cricket to the world and the love and belief of millions of fans is on the way down.\"Indian cricket with its massive following has been built over the years of hard work from superb administrators and greatest of cricketers who have managed to bring thousands of fans to the ground. I, at the present moment, think it's in danger. Hope people are listening.\"Ganguly's comments came on a day when it was revealed that the CoA had identified the CAB as one of the state associations \"partially compliant\" with the Supreme Court order of August 9 that had directed all BCCI members - states - to follow the new constitution created on the basis of the Lodha Committee's recommendations.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}