{"id": "ESPNShane Warne appointed to MCC World Cricket CommitteeSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upShane Warne appointed to MCC World Cricket CommitteeABOUT COOKIES", "paragraph": "ESPNcricinfo's Andrew Miller padded up to face an over from legendary Australian spinner Shane Warne (2:03)Shane Warne has been appointed to the MCC World Cricket committee.Warne, who claimed 708 Test wickets to cement his status as one of the game's all-time greats, will take over from his fellow Australian, the former wicketkeeper Rod Marsh, who is standing down after six years in the role.\"It is an honour to have been asked to be a member of the MCC World Cricket committee,\" said Warne. \"It is an extremely exciting time for cricket and I hope that I will have plenty to offer in discussion and debate. I look forward to contributing to the work of the committee.\"The committee, which meets twice a year to discuss the important issues in the game, has forged a reputation as an independent voice in world cricket, and has tabled a number of recommendations that have gone on to be implemented by the ICC, including the development of pink balls for floodlit cricket, the mandatory use of DRS in international cricket, and a limit on bat sizes to improve the balance between bat and ball.One of the key outcomes of the committee's last meeting, which was held at Lord's in August, was the proposal that a \"shot clock\" should be introduced to help speed up play.Mike Gatting, Chairman of the MCC World Cricket committee, said: \"We're delighted to welcome Shane on to the committee. Obviously his profile in the world game is as big as they come and with his extensive experience, I am sure he will offer great insights into many different facets of the game.\"I'd also like to pay tribute to Rod Marsh, who leaves the committee after six years. He has provided valuable contributions across a variety of areas and we thank him for his efforts.\"Warne made his debut against India at Sydney in 1992 and bowed out 15 years later at the same venue, with a 5-0 Ashes series win in 2006-07. He also took 293 wickets in 194 ODIS, making him one of only two bowlers, alongside Muttiah Muralitharan, to have taken over 1,000 international wickets across all formats of the game.Warne spent five seasons in English county cricket with Hampshire, and captained the side between 2004 and 2007. He officially retired from all formats of the game in 2013 following stints in Australia's Big Bash and the Indian Premier League, but returned to captain the Rest of the World XI against MCC at Lord's to celebrate the Bicententary of the ground in 2014. He was made an Honorary Life Member of MCC in 2009.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}