{"id": "ESPN'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-up'Not sure how I got the hat-trick' - Anya ShrubsoleABOUT COOKIES", "paragraph": "Anya Shrubsole said she's \"not sure\" how she got her hat-trick at Gros Islet and instead turned the spotlight on her team-mate Natalie Sciver, as the duo played key roles in bowling South Africa out for 85 and knocking them out of the Women's World T20Shrubsole, Player of the Final at last year's World Cup, became the second England bowler after Sciver to take a T20I hat-trick, claiming the wickets of Shabnim Ismail, Masabata Klaas and Moseline Daniels in the last over of South Africa's innings. However, it was Sciver who had set up the game earlier, bowling 20 dot balls and finishing with incredible figures of 4-1-4-3.\"I'm not sure how (I got the hat-trick),\" Shrubsole said. \"A couple of slow balls came off for me, and then when they hit the stumps, it's something that's pretty special. But I think credit has got to go toward all the bowlers, and in particular, Nat [Sciver], who was outstanding today.\"I think the bowlers seem to have had the best thing so far here in St. Lucia. The way they came out and played really put us on the front foot.\"The pair's contribution on the whole read 6 for 15 to hand as England cruised into the semi-finals with their third win of the tournament. They are now are set to take on West Indies and the clash will decide who finishes top of the table in Group A.\"We've got a great game to go yet. I think we can't overlook that,\" Shrubsole said. \"I think momentum is a huge thing in Twenty20 cricket. It's nice to have one foot in the semi-finals, but we want to come out here and put in a really good performance against West Indies on Sunday, and then we'll start to look to Antigua and adapting to how things might be different out there.\"Meanwhile, South Africa were left to rue yet another poor batting display, with a spot in the knockouts on the line. Just two nights after losing 9 for 28 against West Indies, South Africa collapsed from 55 for 4 to 85 all out against England. It left their captain Dane van Niekerk morose and their coach Hilton Moreeng annoyed.Sorry South Africa....\"We're so frustrated because some of the players got in a muddle, they just changed their game plan and approach,\" Moreeng said. \"For us, it's when you look at the entire batting line-up, actually, since we got to our game against the West Indies, it hasn't been good. When you look at application, even simple things like rotation is something that's not happened like it's supposed to.\"So for us, I think, in the changing room, we need to sit down again and go back to the drawing board because it's been a really disappointing World Cup for all of us. With the talent we have on the team, it's really tough. For supporters back home to us, I think for us, it's unacceptable.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}