{"id": "ESPNMcCullum, Narine, Umar Akmal exit Lahore QalandarsSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upMcCullum, Narine, Umar Akmal exit Lahore QalandarsABOUT COOKIES", "paragraph": "Lahore Qalandars will need to appoint a new captain, after Brendon McCullum parted ways with the franchise.\"A big thank you to Lahore Qalandars for the past 2 seasons,\" McCullum tweeted on Saturday. \"Today we have parted ways but I leave with fond memories and friendships. I wish you all the best in the future. To the Rana family, a special thank you. Our friendship will always remain.\"Earlier this year, McCullum had offered to \"offload\" his captaincy in a bid to change the fortunes of the side, which had lost six straight matches last season and finished at the bottom for the third consecutive year.McCullum moves back into the draft and snapping him up will require franchises to use their Platinum pick. The former New Zealand international was himself signed by Lahore in this manner two years ago for the second season, when finishing bottom in the first year gave them first pick in the draft. He served as captain of the Lahore for both seasons, but failed to turn their fortunes around.McCullum's departure was just one among a number of high-profile exits for the beleaguered franchise, which is looking to stay off the bottom for the first time in the PSL's history. Sunil Narine and Umar Akmal have been traded by Lahore to Quetta Gladiators in a deal that sees Rahat Ali and former Under-19 captain Hassan Khan move the other way, into the Lahore franchise.Lahore's chief operating officer Sameer Rana, said: \"On behalf of the Lahore Qalandars management and fans, we would like to thank Sunil and Umar for their services to the team. They added tremendous value to the Qalandars and I wish them well on this next chapter in their PSL careers. We are very excited to welcome Rahat Ali and Hassan Khan to the Qalandars family. Rahat showed what he is capable of with the ball in this format with his excellent bowling last year and Hassan has impressed everyone with his determination and calmness on the field.\"Quetta owner Nadeem Omar called Narine and Umar \"world-class additions to the Gladiators' squad\". He was particularly effusive in his praise for the West Indies offspinner, whom he labelled a \"magician with the ball and one of the best match-winners in T20 cricket\".The swap deal between Lahore and Quetta also means the former will take Quetta's Platinum pick in the first round, while Quetta get Lahore's Silver pick in the second round.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}