{"id": "ESPNAustralia, Pakistan begin T20I leg on even keelMatch CoverageBetting OddsPresented ByBet365ABOUT COOKIES", "paragraph": "A three-T20I series would be appealing served as an appetiser, but it sits a little awkwardly on the menu offered after the main course.That, however, is where this particular series between Pakistan and Australia has been placed, following on from an absorbing Test series that had more moments of competitiveness than the visitors' squad might have shaped up to provide.This format offers Aaron Finch, captaining the side, much improved odds of being competitive than the longest format did. Indeed, when these two sides met a few months ago in Harare, an Australian side boasting much of the same personnel that will play in Abu Dhabi on Wednesday gave Pakistan as good as they got, thrashing Sarfraz Ahmed's men in one league game and taking them to the last over in the final. Glenn Maxwell returns to the squad and Finch himself has been in sparkling T20I form over the last few games, and along with them Australia possess a cadre of diversely challenging bowlers who specialise in the shortest format.It is a format where they perhaps miss the banned Steven Smith, and even arguably David Warner, least. While Warner's unique ability is irreplaceable, Australia aren't as short of big-hitting openers as steady Test accumulators. Opening alongside Finch, D'Arcy Short averages nearly 50 in his 11 T20Is, and scored an unbeaten 68 in Monday's T20I against the UAE. With Maxwell, Chris Lynn, and Travis Head in the middle order, there is plenty of potential for big runs, and for players to cement their place in the side while the opportunity presents itself.But facing Pakistan is the toughest challenge a side could face in T20I cricket, and that has been the case for over two years now. A side honed on the smarts that helped Sarfraz Ahmed make his name - a trait he appeared to be regathering following an excellent Test with the bat last week - Pakistan have turned their approach to this format on its head since the debacle of the 2016 World T20.The advent of the PSL has helped them uncover talents who have smoothly integrated into the national side, as unafraid to take on an international powerhouse as they were a formidable franchise.They've beaten Australia before in a pressure game, the final of the tri-series in Harare in July, and they did so from a weak position. The size of the occasion doesn't faze them, and in an Australian side that is impressive but perhaps a shade inexperienced, they will smell an opportunity to press home the advantage.Pakistan (most recent first) WWWLW\nAustralia WLWLWAt the start of the year, Imad Wasim was billed as a future Pakistan captain by none other than then-PCB chairman Najam Sethi. He was appointed captain of the Karachi Kings franchise, and almost imperceptibly, began to move into the role of leader-in-waiting. But a series of injuries, as well as fitness and attitude problems, have meant Imad hasn't played an international game this year. He was left out of the tour of Zimbabwe specifically for fitness reasons, and failed to make the cut for the Asia Cup too. Pakistan fans have shorter memories than most, and if Imad can't make an impact soon over the handful of opportunities he may get in the coming weeks, he may begin slipping down the pecking order rather quickly. Tomorrow, with the all rounder guaranteed a starting berth, would be a good time to start.There was much controversy and criticism over Glenn Maxwell's omission from the Test side, but he's very much around for the T20s. Arguably Australia's most well-known international cricketer in the absence of Smith and Warner, Maxwell's reputation for prolific and devastating hitting in T20I cricket - he has a strike rate of 162 - makes him a danger to the opposition. He may well be smarting from a perceived sense of injustice after not being part of the Test unit, and be more keen than ever to make a point. Pakistan will have their hands full to ensure he doesn't make it at their expense.Pakistan have, somewhat unusually, named their XI a day ahead of the game. Shoaib Malik is not available for the first T20I, as he is due to arrive in Dubai and join the squad only on the morning of the match, which allows the trio of allrounders - Imad, Shadab Khan and Faheem Ashraf - to all start.Pakistan: 1 Mohammad Hafeez, 2 Fakhar Zaman, 3, Babar Azam, 4 Hussian Talat, 5 Asif Ali 6 Sarfraz Ahmed (capt & wk), 7 Faheem Ashraf 8 Shadab Khan, 9 Imad Wasim 10 Hasan Ali, 11 Shaheen Afridi,Australia's line-up is far less settled, but an easy win over the UAE may give them some confidence and stability. Mitchell Marsh, somewhat surprisingly named vice-captain of the side, may find it difficult to secure a spot in the XI, and wasn't part of the team that beat the UAE.Australia (possible): 1 Aaron Finch (capt), 2 D'Arcy Short, 3 Chris Lynn, 4 Mitchell Marsh/Ben McDermott, 5 Glenn Maxwell, 6 Alex Carey (wk), 7 Ashton Agar, 8 Mitchell Starc, 9 Adam Zampa, 10 Nathan Coulter-Nile, 11 Billy StanlakeBesides Monday's game, UAE hasn't hosted a T20I for a year. But pitches in Abu Dhabi usually provide low-scoring games. With the games held at night, dew is expected to be an equal factor for both sides.Pakistan have lost just four T20Is out of 27 since the World T20 in 2016.None of those losses came in the UAE, where they have won their last five.D'Arcy Short has reached double figures in 10 consecutive T20Is. His only single figure score in his career came on debut, when he was dismissed for 4 against New Zealand.They took five wickets between them after Babar Azam's 68* carried Pakistan to 155 for 8The trophy unveiled for the Pakistan-Australia T20I series caught the attention of many. But does it take the biscuit when it comes to cricket trophies?Shoaib Malik is not available for the first T20I, which allows the trio of allrounders - Imad Wasim, Shadab Khan and Faheem Ashraf - to all startSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}