{"id": "ESPNPanchal's 112* gives Gujarat nine-wicket winSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upPanchal's 112* gives Gujarat nine-wicket winABOUT COOKIES", "paragraph": "What did the Test stars do?Rain in southern India had a say as Tamil Nadu and Madhya Pradesh shared a point in Dindigul. R Ashwin took a four-wicket haul, while it wasn't a productive game for M Vijay, who was out for 19. In Rajkot, Cheteshwar Pujara made a half-century in a drawn game, with Saurashtra walking away with three points, but not before he had retired hurt because of a stiff neck.Top young performersAkshdeep Nath, leading Uttar Pradesh, banished murmurs of his failed yo-yo test with an imposing 194 to help UP beat Goa and pick up a bonus point  in Kanpur. Ricky Bhui made a 370-ball 181 to help Andhra chase down Punjab's 414 for a first-innings lead.Roosh Kalaria, the left-arm fast bowler, hastened Baroda's end with a career-best 6 for 35 for Gujarat. Victory was achieved when Priyank Panchal celebrated his captaincy debut with an unbeaten 112 in a chase of 168 to help record a nine-wicket win. Panchal had had a blockbuster 2016-17 season, before slipping under the radar in the season that followed.The thrillerWith four overs remaining in the game, Nathu Singh struck twice in four deliveries to give Rajasthan a thrilling win over Jammu & Kashmir. This meant heartbreak for Parvez Rasool, who held fort to make a combative second-innings century as J&K looked to save the match. He was unbeaten in the end. The last pair needed to survive 29 deliveries, but Nathu, off the India A radar because of form and injury concerns, chose the season opener to serve a reminder. He finished with 4 for 83. Earlier in the game J&K's Mohammad Mudhasir picked up a hat-trick in the first innings.What about Mumbai?Mumbai had to settle for a draw against Railways in a game where protective masks were brought out to help battle Delhi's infamous smog. Aditya Tare, who spoke at length about the team culture and new leadership, walked away with a final-day century. He had talked up the side's bowling and Tushar Deshpande proved why.In Trivandrum, Kerala had one full day to bowl out Hyderabad for a lead, but were thwarted by B Sandeep's defiance. In Nadaun, Bengal had a good hit out in the second innings after pocketing a lead against Himachal Pradesh, while Haryana and Tripura walked away with the first-innings lead against Odisha and Services respectively. Jharkhand took the first-innings honours against Assam.The best rearguardFaiz Fazal. The Vidarbha captain came up with a monumental second-innings effort after they were asked to follow-on against Maharashtra. Having nothing but one point to salvage on a Pune flatbed, Fazal batted 324 deliveries to make 131, his 17th first-class century. He batted for a day-and-a-half to help Vidarbha not just wipe out the 223-run deficit but also drive forward. They eventually finished with 501 for 8 when the captains shook hands. The defending champions had just gotten out of jail.Professionals rescue North-East outfitsAfter struggling to find a regular place for Karnataka, Abrar Kazi celebrated his move to Nagaland with a maiden first-class double century. He also picked nine wickets with his left-arm spin in an imposing bonus-point victory over Mizoram. Similarly, after moving out of Delhi, Milind Kumar found instant success for Sikkim, lifting them from 15 for 5 to 372. His contribution was a mammoth 261 that set up a massive victory against Manipur.The Delhi duo of Puneet Bisht and Yogesh Nagar struck second-innings half-centuries to give Meghalaya a seven-wicket win over Arunachal Pradesh.The shortest matchUttarakhand celebrated their debut with a bonus-point win in just five sessions. At the receiving end were Pragyan Ojha's Bihar, who were shot out for 60 and 169, lasting a combined 73 overs. Needing three to win, Uttarakhand hit a four off the first ball of their second innings. Karn Veer Kaushal and Deepak Dhopola, two homegrown players, starred for them.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}