{"id": "ESPNEoin Morgan critical after 'extremely poor' England displaySense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upEoin Morgan critical after 'extremely poor' England displayABOUT COOKIES", "paragraph": "England were \"extremely poor\" in defeat against Sri Lanka in the fifth ODI, according to their captain, Eoin Morgan.But while Morgan, who left himself out for the match so England could take a look at Sam Curran, also labelled his team's attitude as \"very poor\", he felt the overall experience could prove beneficial for the side ahead of the World Cup campaign.He promised there would be no \"papering over the cracks\" when they reviewed what went wrong, having lost by a record margin of 219 runs on the Duckworth-Lewis-Stern method.\"It can be extremely helpful,\" Morgan said. \"For 50 overs today we were under serious pressure and we didn't have a lot of answers. That gives us a good opportunity to go back and look at everything from preparation right down to the end result. That's always better when you've been put under a lot of pressure.\"We didn't take our game forward today. There were areas it went backwards. Our fielding was extremely poor, our attitude was very poor and that has to be addressed. We'll have to break down everything from yesterday's practice. Did we do too much the day before the game? Did we overcook ourselves? We might have been a little bit fatigued. I don't know.\"We will break it down and find an answer because otherwise we're just papering over the cracks which is not what we want to do.\"Sri Lanka hit 366 - their highest ODI score against England - in the first innings of the game, plundering a bowling attack that included both Sam and Tom Curran for the first time in an international game.But Morgan defended the changes England made to their line-up on the grounds that some of these players - notably Sam Curran - could come into the World Cup squad as injury replacements.\"Sam has only played his second ODI today,\" Morgan said. \"If we're going to be serious about considering him as a potential replacement if David Willey is injured for the World Cup squad we need to know more about him.\"Today we learned more about him. If Sam Curran's name goes down on that paper we know what his strengths and weaknesses are now, and we try to improve them as we go along. He needs games under his belt.\"When you leave yourself out the one thing you don't want to compromise is winning the game. That's the best environment to learn from. But on the other hand you want to see the players who come in be challenged and put under pressure. That's one thing we definitely saw today.\"People will say you don't want to see your bowlers hit all over the place, hit back over their head, but I think it's necessary to learn. When we go into the World Cup and play against the better teams they perform like that on a regular basis.\"It's not that you want to get used to it but you want them to get used to the situation, and experience refocusing for the next delivery.\"The time for experimentation is now over, however. England have only two full ODI series to play before embarking on their World Cup campaign - against West Indies in the Caribbean and at home to Pakistan - and have to select their squad before meeting Pakistan in May.\"Today we played five out-and-out batters,\" Morgan said. \"We normally play six, but the balance of the team changed. I'd like to think we'll go back to our strongest suit and strongest balance consistently going to the West Indies and then against Pakistan and Ireland in World Cup year.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}