{"id": "ESPNAssociates pathway to 2023 World Cup undergoes major revampSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upAssociates pathway to 2023 World Cup undergoes major revamp2023 Men's World Cup Qualifying StructureABOUT COOKIES", "paragraph": "The ICC announced on Saturday that the diet of 50-over fixtures for Associate teams will undergo a significant transformation from 2019 as part of a redesigned qualification pathway leading into the 2023 Men's World Cup in India.The number of countries playing in the tournament will remain at 10 for 2023. The top eight will automatically qualify based on their performance in the 13-team ODI League, or as it is now known, the ICC Cricket World Cup (CWC) Super League. This means that 24 teams - the bottom five in the Super League plus 19 Associates from the rest of the old World Cricket League structure - will compete for the final two spots in the 2023 Men's World Cup.13-team 2020-2022 ODI Super LeagueTop 8 teams: Qualify for World CupBottom 5 teams: Placed in 2022 World Cup QualifierSeven-team 2019-2021 CWC League 2 (ODI Status)Top 3 teams: Advance to 2022 World Cup QualifierBottom 4 teams: Placed in 2022 WCQ PlayoffDual six-team 2019-2021 CWC Challenge League A & B (List A Status)1st Place in League A or B: Advance to 2022 WCQ PlayoffBottom 5 teams in League A or B: EliminatedSix-team 2022 World Cup Qualifier PlayoffTop 2 teams: Advance to 2022 World Cup QualifierBotttom 4 teams: Eliminated10-team 2022 Men's World Cup QualifierTop 2 teams: Qualify for World CupBottom 8 teams: EliminatedIt will remain a frustration to many considering the competitiveness of not just Ireland and Zimbabwe but also Scotland and Netherlands at this year's World Cup Qualifier in March. In the long term though, the broad increase in fixtures for Associates approved at the ICC meeting in Singapore may help players get desperately needed time on the field and build a case for expanding the number of teams at future World Cups.Here's a rundown of what has changed in terms of the Men's World Cup pathway from Full Member level down to the Division Five of the World Cricket League:The 13-team ODI League rebranded \"ICC CWC Super League\"Before: Eight teams, including hosts England, automatically qualified for the 2019 World Cup based on their ICC rankings. There was no obligation to play against other teams at the bottom of the table, leaving scheduling of fixtures and rankings points open to manipulation.For example, right now, India have 53 matches counting towards their No. 2 ODI ranking. The corresponding figure for 12th ranked Ireland is 23 and it is a mere 16 matches for 13th ranked Scotland, who beat top-ranked England in June. With teams at the top end of the table not playing those at the bottom, it was virtually impossible for the Associates to improve their positions.After: The prize that Netherlands won for finishing first in the three-year WCL Championship from 2015-17 is being grouped with the 12 Full Members in a two-year long ODI tournament beginning in May 2020. Each team will play eight of the other 12 possible opponents - four series home and four series away - with three matches in each series for a total of 24 matches.Since everyone plays an equal number of fixtures, qualification will now be based on the points table rather than a rankings calculation. The top eight teams at the end of the Super League will automatically go through to the 2023 Men's World Cup. The bottom five teams will fall back into the World Cup Qualifier for a second chance at taking one of the final two spots in India.WCL Championship rebranded \"CWC League Two\" with expanded fixtures and ODI statusBefore: Netherlands only had 14 one-day fixtures from 2015 to 2017 as part of the WCL Championship, and they wound up playing only 12 with two matches washed out. The eight-team competition was played across seven rounds - three home and three away with a final neutral round in the UAE - with two matches per round. Only teams with ODI status (Scotland, Hong Kong, Papua New Guinea, UAE) could have matches against each other counted as ODIs.After: Netherlands promotion to the Super League means the next edition will have seven teams - Nepal, UAE, Scotland plus the top four finishers in WCL Division Two to be played in early 2019. However, all of them will play each other on a home and away basis - three matches home and three away per opponent - for a total of 36 matches per team from July 2019 through to the end of 2021. Unlike the WCL Championship, all teams and matches in CWC League Two will have ODI status.The top three teams on the points table at the end of the competition advance to the World Cup Qualifier. The bottom four teams fall back into a repechage event dubbed the CWC Qualifier Playoff, or what was formerly known as WCL Division Two.WCL Divisions Three, Four and Five rebranded \"CWC Challenge League A & B\" with expanded fixtures and List A statusBefore: If a team failed to gain promotion through the WCL Division structure - six-team round-robin tournaments where only the top two finishers were promoted into the next division - their hopes of qualifying for the World Cup were effectively dashed.For example, Division Three only took place once every 18-24 months. If a country failed to secure promotion during the five round-robin matches, it might have no more 50-over cricket for two years - until the next Division Three, or Division Four if they suffered relegation by finishing in the bottom two - for another chance at promotion.Prior to this week's ICC meeting in Singapore, List A status was only given to matches starting in WCL Division Two or higher including the WCL Championship. WCL Divisions Three, Four and Five were classified as \"other 50-over cricket\".After: Following the conclusion of WCL Division Three in Oman next month - where the top two of six teams will be promoted to WCL Division Two - and WCL Division Two in early 2019, Divisions Three through Five will be bunched together and divided into two groups of six teams each. These two groups of six will be rebranded as \"CWC Challenge League A & League B.\"Instead of having possibly just five matches every two years, all teams in League A & League B will be guaranteed 15 fixtures across 27 months from August 2019. Also, they won't suffer the drastic consequence of relegation for one bad week at a WCL Division tournament. They will be judged on their form across more than two years of competition and all matches in this competition will have List A status, putting it on par with domestic one-day leagues in all Test nations.The respective winners of League A & League B will join the bottom four finishers from CWC League Two in the CWC Qualifier Playoff, effectively the former WCL Division Two. The top two finishers in the CWC Qualifier Playoff will then join the other eight teams in the World Cup Qualifier. The most recent version of WCL Division Two/CWC Qualifier Playoff took place at Namibia in February. Nepal and UAE finished in the top two after a wild final day of drama to advance to the World Cup Qualifier in Zimbabwe.The most significant aspect of the WCL restructure is that it still leaves the door open to 2023 Men's World Cup qualification for a team who begins 2019 ranked as low as No. 32, which would have placed them in WCL Division Five. That team would need to finish at the top of CWC Challenge League A or League B, then finish in the top two of the six-team CWC Qualifier Playoff, and then finish in the top two of the ten-team World Cup Qualifier to reach the World Cup. But as Afghanistan showed by starting off in WCL Division Five in 2008, there's hope for every Associate.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}