{"id": "ESPNHealy's 21-ball half-century blows Ireland awayMatch CoverageBetting OddsPresented ByBet365Women's World T20ABOUT COOKIES", "paragraph": "Australia 94 for 1 (Healy 56*) beat Ireland 93 for 6 (Garth 24, Perry 2-12) by nine wicketsChances are it may have taken Australia longer to load their kits from the baggage carousel to the team bus than it took to see off Ireland's small target at Providence Stadium. The enforcer was Alyssa Healy, who walloped a 21-ball half-century - the fastest in the tournament's history and the second fastest in women's T20Is - to raze down 94 in just 9.1 overs.The beauty lay in Healy's brutality. Full tosses and long hops were gleefully accepted. But amid the muscle, there was also grace and elegance which she displayed in equal measure, while lofting the ball inside-out over extra cover. In the end, Ireland's only takeaway was the experience of playing Australia only for the second time in four years.The result was another reminder of why teams like Ireland need more exposure and not just one qualifying tournament amid the jostle with Full Members for game time.Ireland's best chance of competing was to bat first and put runs up against the three-time champions. Laura Delany called correctly and they finished the Powerplay 27 without loss. Then the big-match nerves failed Ireland as they lost 5 for 16, resulting in a breakdown they didn't recover from.Ireland didn't run well, and weren't helped by poor umpiring calls either - like the controversial call by Langton Rusere to dock them five runs because Delany seemingly ran onto the 'danger zone'. All this coupled with some tight, relentless Australian lines, resulting in no leeway. Ireland limped to 93 for 6 on the back of Kim Garth's 24 at No. 7. It left open the prospect of a bruising chase.The struggle wasn't just restricted to their batting, though. Lucy O'Reilly failed to control her late inswing to deliver as many as five wides in her opening over - the second of the innings. Then Ciara Metcalfe delivered a 12-run over with a mixture of short balls and full tosses, Isobel Joyce went for four boundaries in her first, and suddenly, Ireland were short of ideas as Australia wiped out 60 in just five overs en route a second win that gave their net run rate a massive fillip.The story of the match - as it was on the first of Sunday's double-header - was the awarding of penalty runs for running on the pitch. In the 13th over of Ireland's innings, Gaby Lewis was first warned for stepping onto the danger area, when she seemingly steered clear after taking a couple of steps to meet the ball.Off the next ball, Ireland were docked five points when umpire Rusere felt Delany had run mid-pitch. This seemed to have played on Lewis' mind as she was out in the same over trying to run wide, in the process losing the extra yard to a direct hit to the bowler's end from mid-off.Umpiring aside, Ireland weren't also helped by injudicious shot selection. Twice in two overs, they had batters out attempting to scoop Ellyse Perry, only to not just play down the wrong lint but also get beaten by the skid off the pitch. Clare Shillington was the first to perish in this fashion after stroking 19 while Eimear Richardson followed suit in the next over, the 10th of the innings.Then Australia employed the spin choke with rookie legspinner Georgia Wareham clocking in three right overs, with Sophie Molineux - the left-arm spinner - at the other end to stifle the life out of Ireland. The result wasn't really in doubt at any stage. It was only a matter of when.The Australia wicketkeeper smashed the fastest World T20 fifty to give Australia's net run rate a massive fillip after their second winSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}