{"id": "ESPNAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'ABOUT COOKIES", "paragraph": "Sri Lanka's Angelo Mathews believes it's still evenly poised against England despite the visitors' commanding day four, at Kandy. (1:19)A week after coach Chandika Hathurusingha praised the progress Angelo Mathews had made on his fitness and attitude since being axed from the ODI team, Mathews has claimed that his preparation for the ongoing Tests, in which he has now hit three half-centuries in four innings, was no different than usual.Essentially, Mathews still appears to be indignant about being dropped following Sri Lanka's exit at the Asia Cup. He had been particularly hurt at the time given that Hathurusingha, the very man who had asked him to resume the ODI captaincy at the start of the year, had also pushed for the stripping of that captaincy and his omission altogether.Upon reaching fifty on day four in Pallekele, Mathews pointed to his bat and made a yapping motion with his gloves - signalling that he was letting his \"bat do the talking\". He had made the same gesture upon reaching fifty in the first innings in Galle as well, and was pointedly looking in the direction of the dressing room on both occasions.On Saturday, following his 88, Mathews was asked asked whether he was happy with his running between the wickets and fitness - the two reasons Hathurusingha had provided as justification for his omission. Mathews replied: \"You tell me. That's not something that I have told. But people are concerned, and they need to answer that question.\"Hathurusingha had said after the loss in Galle that Mathews was now \"making the effort to do things the way we expect\". But Mathews denied he had done anything different for this series.\"I have done nothing extraordinary when it comes to preparation,\" he said. \"I have been training the same way for the past ten years. I must thank the high performance centre staff and all the coaches, and the physios and trainers and everyone for providing me all the facilities and looking after me well. I concentrated on what I need to do. I didn't concentrate on other things. I prepared myself like I have always prepared. If I get the opportunity I want to score runs.\"My job is to score runs and not worry about other things. Just focus on the game and move forward and not to worry about what other people are saying. If I am honest with myself and If I am doing the thing, that's what matters.\"Mathews had actually been Sri Lanka's most consistent ODI batsman since the start of 2017, before he was dropped. Which is part of the reason why he had felt especially aggrieved. Despite having now spent over two weeks in the company of Hathurusingha, in the Test dressing room, he does not seem any less hurt.\"My stats will speak on behalf of me,\" Mathews said. \"But they took a decision. I'm disappointed but I can't control it.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}