{"id": "ESPNSri Lanka's sports ministry sets up a cricket advisory committeeSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upSri Lanka's sports ministry sets up a cricket advisory committeeABOUT COOKIES", "paragraph": "Sri Lanka's sports ministry has appointed a five-member advisory committee to assist in Sri Lanka Cricket's day-to-day operations, until yet-to-be-announced board elections are held. It is expected to share duties with the sports ministry-appointed Competent Authority, which has been heading up SLC since June 1.Comprising president's counsel Dinal Philips, Samantha Rajapaksa, Mohamed Hisham Jamaldeen, Ranil Pathirana and Lasantha Wickremasinghe, the committee has been mandated with \"inculcating corporate and operational efficiency.\"An SLC release said: \"The new committee will provide guidelines for the SLC management to continue its operations unhindered, whilst it will also focus on inculcating corporate and operational efficiency to SLC operations, going forward\"The appointment of this advisory committee - effective November 9 - comes on the heels of three other committee appointments last week, though SLC confirmed that each committee would retain a degree of autonomy and exist independent of each other.\"The recently appointed Cricket Advisory Committee, Tournament Committee and the Umpires Committee will co-exist independently and are authorised to take decisions, without interference from any parties on cricket-related matters,\" the release concluded.SLC elections have been delayed indefinitely since May 31 after a Court of Appeal found that SLC election protocol had been flouted in the run-up to the elections. While the court subsequently lifted the ban, elections failed to materialise in the months since. The ICC has set a deadline of February 9, 2019 for the SLC to hold its elections.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}