{"id": "ESPNChatara, Raza bowl Zimbabwe to 139-run leadMatch CoverageBetting OddsPresented ByBet365ABOUT COOKIES", "paragraph": "Zimbabwe 282 and 1 for 0 lead Bangladesh 143 (Ariful 41*, Chatara 3-19, Raza 3-35) by 140 runsBangladesh were bowled out for 143 in their first innings, after Tendai Chatara ripped through the top-order with a three-wicket burst, and Sikandar Raza followed it up with three wickets of his own, giving Zimbabwe a crucial 139-run lead in Sylhet. Zimbabwe could only add one more run in reply before the umpires ruled that the light was too bad, bringing an end to a day dominated by the visitors.It was Bangladesh's seventh successive sub-200 total in Tests this year. Chatara initiated the collapse by removing Imrul Kayes, the player of ODI series, who tentatively poked at a short ball away from his body and inside-edged onto the stumps.Kyle Jarvis then got into the act, getting Liton Das to drive him for four through the off-side before sucking him into another drive. However, the second one ended up being a sharp outswinging delivery that took the outside edge.Chatara then had Nazmul Hossain Shanto also playing away from his body. One ball later, Mahmudullah fell, inside-edging Chatara as the home side sunk to 19 for 4. All four wickets had resulted from bad shots.Mushfiqur and Mominul Haque added the first of four small partnerships that took Bangladesh beyond the follow-on mark, and into three figures. Mominul edged Raza to Masakadza at slip to end their 30-run stand, before Jarvis had Mushfiqur caught behind after the tea interval. Having cracked him for a four through point off the first ball of the third session, Mushfiqur poked at the next ball, another delivery that subtly left him.Mehidy Hasan then perhaps had the softest of dismissals, top edging a leg-side bound delivery from part-timer Sean Williams. Raza took his second and third wickets by removing Taijul Islam and Nazmul Islam, before Abu Jayed's run-out put an end to Bangladesh's misery.The morning session belonged to Taijul who completed a six-wicket haul. He broke through the visitors' resistance in the 12th over of the morning, though Shanto's catch played a bigger part in the dismissal. As Chakabva clipped Taijul, Shanto was looking for cover but the ball settled straight into his palms. Taijul also removed Wellington Masakadza, before picking up Jarvis and Chatara off consecutive balls.Any high the hosts may have got from the rapid end to the Zimbabwe innings, however, was quickly snuffed out.They were without their best spinner, Graeme Cremer, but two debutants and a batting allrounder more than made up for his absenceThey lost a piece of their future when they failed, agonisingly, to qualify for the World Cup. With their performance in Sylhet, they have gained a little piece backSeveral different things - from the toss to various on-field performances - fell in place for the visitors in SylhetSikandar Raza says the pain of failing to qualify for the 2019 World Cup will never fully go away, but hopes the Sylhet Test win will be the first step towards easing itA first Test win away from home for Zimbabwe in 17 years, Bangladesh's endless batting woes in the format and other statistical highlights from the Sylhet TestSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}