{"id": "ESPNMandhana, spinners demolish Australia as India top Group BABOUT COOKIES", "paragraph": "\nIndia women 167 for 8 (Mandhana 83, Kaur 43, Perry 3-16, Gardner 2-25) beat Australia women 119 (Perry 39*, Patil 3-15, Radha 2-13) by 48 runs\n\n\n\nIndia's spinners choked out a weakened Australian line-up with relentless accuracy to send them crashing to 119 all out, and a 48-run defeat in their final Group B game at the Providence Stadium in Guyana. The win meant India finished atop the Group B table, undefeated after four games. They will now face the loser of West Indies v England on Sunday, while the winner takes on Australia in the semifinals.\n\nThe win was set up by Smriti Mandhana, whose belligerent 83 hauled India to a competitive 167 - their highest in T20Is against Australia - after they had elected to bat. Known for her free-willed stroke-making, Mandhana capitalised on some erratic Australian bowling to set the foundation for a winning score.\n\nAustralia were hit hard by an injury to Alyssa Healy, the Player of the Match in their last three encounters. Healy was involved in a nasty collision with Megan Schutt, as both bowler and keeper went for a catch in the 19th over of the Indian innings. Healy seemed to cop a hard blow around her left shoulder as Schutt crashed into her before spilling the catch. She went down immediately upon impact and was taken off the field, handing over the gloves to Beth Mooney. It was subsequently revealed that the wicketkeeper-batsman had suffered a mild concussion and wouldn't take part in the chase.\n\nEven with her absence, India needed to bring out their best game against the might of this Australian line-up. Their chances always hung on how well their slower bowlers would be able to tie down the opposition. And sure enough, five of the six bowlers used by Harmanpreet Kaur, including herself, were spinners.\n\nIndia trialled with pace just for one over first-up - the very first of the innings - and immediately Australia hit their groove, Mooney finding the boundary twice and pinching 11 off Arundhati Reddy. The message was clear: deny Australia pace and take them out of their comfort zone.\n\n\n\n\n\n © Getty Images\n\n\n\nKaur heeded to it the very next over, bringing in Anuja Patil, the offspinner. It cost just three, further reinforcing the strategy. From there, India unsparingly kept the leash on. When Villani pulled Deepti Sharma's offbreak into the hands of deep midwicket at the start of the fifth over, it became clear that Australia were in a scrap against lack of pace. Mooney's start was snuffed out next ball, when she was bowled around her legs.\n\nThe only time Australia found any momentum was against the easy pace of Reddy. As in her first, she was taken apart for a brace of boundaries in her second over, the last of the Powerplay, which also turned out to be her last.\n\nThe passage immediately after the Powerplay marked the worst of the slowdown. After Ashleigh Gardner launched Poonam Yadav for six over long-off in the ninth over, Australia went 34 balls without a boundary. They also lost two wickets in the interim.\n\nRadha Yadav, bowling from several yards behind the crease to slow it up even further, had Meg Lanning caught at deep midwicket when the Australian captain tried to force a sweep. And when Gardner was out, trying to clear long-off, to Poonam in the next over, the heart of Australia's batting had been ripped out. Ellyse Perry dazzled with an unbeaten 39 thereafter, but with the rest of Australia's line-up crumbling in the face of a mounting required rate, their resistance ended in 19.4 overs.\n\nThese struggles were a far cry from how India had begun their own innings. Mandhana launched a boundary-laden assault that offset the early loss of Taniya Bhatia in no time. Mandhana boldly stepped down the pitch to pace and moved sharply around the crease to make room when the bowlers tightened their lines. Australia fed her strengths with a generous mix of full and short balls, and Mandhana didn't let a single one go unpunished.\n\nThe loss of Jemimah Rodrigues in the seventh over only eased some of the load on Mandhana, as Kaur matched her aggression with some imperious hits of her own.\n\nKnown for her blazing starts but a tendency to not capitalise on them, Mandhana showed she was in for the long haul this time around, when she raised a fifty, off 31 balls, in the tenth over. The duo's partnership was thrown a lifeline when Healy missed a stumping, with Kaur on 26. Kimmince broke the stand at 68. But Mandhana continued to strike them big and hard, in the process becoming the second-fastest Indian batsman, after Mithali Raj, to 1000 T20 international runs, as she put the game beyond Australia.\nAkshay Gopalakrishnan is a sub-editor at ESPNcricinfo\n        To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies.\n      "}