{"id": "ESPNWhy is the PCB sweeping the Qayyum report under the carpet?Sense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upWhy is the PCB sweeping the Qayyum report under the carpet?ABOUT COOKIES", "paragraph": "Last Friday, under the new chairmanship of Ehsan Mani, the PCB formed a new cricket committee. It is to be headed by Mohsin Khan and includes Misbah-ul-Haq and Urooj Mumtaz. You might have noticed that it also includes Wasim Akram.One reason you might have noticed this is that it can be said to be Akram's first official role with the board since his retirement. He has held fast-bowling camps, helped find coaches, and worked in the PSL, but not for the board as such. The other reason you might have noticed it is that if at all Mohsin Khan has crossed your radar in recent years, it is probably because he has been shooting his mouth off about how he will never work with cricketers who are tainted by corruption allegations, such as Akram.And what should definitely not escape your attention is how the PCB has managed to bring the two to work together - the collateral damage, so to speak, of this arrangement.That became clear with a lazy half-question posed to Mani at the announcement by a journalist. It was the kind of non-specific question designed to get the questioned to speak rather than respond. \"Just tell us with reference to Wasim Akram and the Justice Qayyum report…\"The Justice Qayyum report, you might remember, was the result of a 13-month long inquiry into the raft of corruption allegations swirling around Pakistan's players in the mid-to-late '90s. Nearly 70 players and officials were questioned and gave testimony at the inquiry, in the centre courtroom at the Lahore High Court.Akram was a prominent figure in the report, and one of eight players punished to some degree as part of its recommendations. At the time, the report was the first and most comprehensive investigation into match-fixing from any of the many member nations affected by it.Back to that lazy half-question. \"How many of you have read the Justice Qayyum report?\" Mani asked in return. \"How many?\"Perhaps the journalists gathered in front of him hadn't read it - at least, nobody seemed to respond in the affirmative to an admittedly rhetorical question. But given its importance when it came out, it is safe to assume that a lot of us out here have read it.Also, it is not rotting away in some musty archive. It is right here. It is also right here, on the PCB's own website. It has been for years. That is the beauty of the internet - it is a home to everybody and everything and it never forgets. Take some time to read it if you haven't. It's not as dry a piece of work as it might sound, and it actually ends up being a compelling documentation of an epically fractious, broken, and yes, corrupt, era in Pakistan cricket.Mani's rhetorical question was the beginning of an amazing, brief but clear walk-back. The report, Mani said, was Justice Qayyum making some allegations. It wasn't - it was Justice Qayyum investigating a lot of allegations and then making recommendations. Justice Qayyum promised more details, Mani explained, only to renege. He didn't. Only in the case of Mushtaq Ahmed was there prescribed a future course, and that was for further investigation, not revelation.Those who were punished, Mani argued, have since coached in England, and been involved in cricket internationally, which he believes proves them clean. That's one way of looking at it, even if it is wrong. The ICC had advised England against the appointment of Mushtaq Ahmed as spin-bowling coach. The other, more worrisome, way is to see it less as a reflection on the substance of the report and more on cricket's institutional and deliberate amnesia (even the ICC has inducted two of the players named in the report into their Hall of Fame).Mani must be familiar with the report. He was in the thick of cricket administration during those years and would rise to become ICC president three years after the report went public. Standing next to him on Friday was Subhan Ahmed, the PCB's chief operating officer and one of its longest-serving employees. Ahmed was very much part of the PCB in 1998, the same PCB that wrote to the president of Pakistan and asked for a commission to be set up. He was very much part of the board that accepted and acted upon the recommendations of the report and of all administrations since that have taken the report to be valid and valuable.The Qayyum report wasn't perfect. It couldn't be, given the nature of the charges and misdemeanours. Hard evidence was scant and what there was - in the infamous Rashid Latif tapes - was troublesome. Latif, crusading against the corruption from within, had secretly recorded conversations with team-mates in which they were said to be talking about fixes. But he submitted edited versions, in which he allegedly shielded some players he was closer to. The tapes were mostly disregarded.So Justice Qayyum and his men had to work with, to a large extent, the testimonies of some players and officials. There was no anti-corruption unit to help them, and no specific code that had been breached, leading to the investigation of the allegations.The publication of the report was delayed without explanation, and so was inevitably accompanied by rumours that it had been tampered with, that stronger findings had been kept from the public. That is officially denied by all, though the published version was, according to Justice Qayyum, not the full report - what was unpublished, he said, referred mostly to players from other countries. And its reputation was not helped by the entanglement of its author very soon after in a controversy, over a separate matter, in which his role appeared to have been politically compromised.And retrospectively, because it left players dangling between innocence and guilt - all eight were sanctioned but not all were found guilty outright - it feels frustrating. But that was, in part, because of its pioneering nature. The question that hung over the end of the inquiry was whether the guilt would be established based on criminal law or civil law - important because there was no precedent, no code, nothing to work off.The lead counsel on the case, the PCB's legal advisor, Ali Sibtain Fazli, wanted guilt to be based on what applied in civil cases; that is, on reasonable doubt. Justice Qayyum insisted on criminal weightage; that is, for allegations to be proved beyond any reasonable doubt. He was, in other words, willing to give the cricketers as much doubt as possible. Akram escaped a guilty verdict solely because the main witness against him - Ata-ur-Rehman - perjured himself. (Justice Qayyum actually later admitted he might have gone soft on Akram.)But in any final assessment the sheer weight and detail of testimony pointing to corrupt behaviour, matching up to enough specific instances on the field, was such that to deny it was happening is to be delusional. And the testimonies had to count for something, even if proving them outright was not possible.What doubt there was in any case should have been blown away by the original News of the World sting on Salim Malik, published three days before the Qayyum report. And by the fact that there had been another inquiry, before Qayyum's, which had given credence to much the same allegations.Is this the cost of formulating a committee to include Akram? To say, as Mohsin did on Friday that he was convinced by the board's chairman and COO that the Qayyum report lacked authenticity, and that there was no authenticity in the charges? To paint it all as some kind of fakeness? Why not accept the report and argue simply that enough time has passed since its findings, or that the report made recommendations and did not hand out legally binding sentences?Because in this climate, from a board not two years out of a widespread corruption scandal, not a decade removed from another major one, creating alternative truths is not a good look.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}