{"id": "ESPNDasun Shanaka rues the opportunities that slipped away for Sri LankaSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upDasun Shanaka rues the opportunities that slipped away for Sri LankaABOUT COOKIES", "paragraph": "Take a look at social media's reactions as England seal an ODI series win with an 18-run DLS victory over Sri Lanka (1:44)Sure it's another Sri Lanka loss, and sure they are ruing their mistakes yet again, but at least this time it is specific moments that lost Sri Lanka the game, rather than overs upon overs of incompetence. Dasun Shanaka, whose run-a-ball 66 did the most to propel Sri Lanka toward respectability, pinpointed two of the instances in which his team had let the match slip.The first of these was his own run-out, he said. Having just struck two towering sixes off Olly Stone in the 42nd over, Shanaka seemed as if he was just beginning a death-overs cannonade. But then, disaster. Thisara Perera mis-hit a ball into the leg-side, more or less directly to the fielder ranging close at midwicket. Shanaka took off from the non-strikers' end, perhaps especially eager to regain the strike because by now he was seeing the ball so well. He had run about halfway down the pitch before he realised Thisara had correctly turned down the run, and was run out trying to regain his ground at the non-strikers'.\"There was no run there,\" Shanaka said. \"I came out too far. Normally I have this habit of coming down the wicket about two feet whenever a shot is played. It's a fault that I have that I need to rectify - it's not Thisara's fault.\"When I went in we were 102 for 4, and I played my normal game without any pressure although we had lost wickets. If I had continued batting longer we could have got a result in our favour. If had stayed with Thisara for the 50 overs, we could have got around 290-300.\"Sri Lanka 's other costly mistake came when they were bowling, in what would turn out to be the final few overs of the game. Joe Root mis-hit a sweep off the bowling of Dhananjaya de Silva, and although the resulting top-edge was caught at short fine leg, Sri Lanka had too many men outside the circle - Kasun Rajitha having failed to come in from the boundary to mid off.Umpire Lyndon Hannibal called a no-ball, denying the hosts the wicket. Had Sri Lanka reduced England to 112 for 3, the Duckworth-Lewis-Steyn par score would have reduced almost all the way to that total, meaning they could then have applied more pressure on Eoin Morgan and the new batsman as the rainclouds gathered.\"If we had not made a mistake of having five fielders outside the circle and got Root's wicket it would have been a close game,\" Shanaka said. \"We could have built on the pressure from there and forced another mistake.\"For England, meanwhile, Morgan dwelt on the frustrations of a rain-hit series, and spoke about the many unquestionable positives for his side for what seems like the millionth time after arriving in the country. What choice does he have, really? England really have been that dominant.But there was an area in which he felt his side had let themselves down in this particular game. No fewer than three clear-cut wicket opportunities were spurned, with a tough catch being dropped, an easy stumping being missed, and a run-out chance going astray. Elsewhere, he felt, the ground fielding has also been sloppy.\"The fielding wasn't good,\" Morgan said. \"It was average. It's definitely something we can improve on. We were better in the last game but today we weren't anywhere near as good as we should be.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}