{"id": "ESPN'There's a long way left for me' - SaifuddinSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-up'There's a long way left for me' - SaifuddinABOUT COOKIES", "paragraph": "When David Miller had struck Mohammad Saifuddin for five consecutive sixes in Potchefstroom a year ago, Mashrafe Mortaza and Tamim Iqbal couldn't keep their cool back in Dhaka. Tamim remembers that he got really nervous for Saifuddin and screamed at his TV, urging him to bowl the wide yorker. He did, and Miller had to contend with 31 runs off the over.A month later, Darren Sammy took 32 off Saifuddin during the Comilla Victorians-Rajshahi Kings BPL match at the Zahur Ahmed Chowdhury Stadium, where a year later Saifuddin was adjudged Player of the Match for his bowling performance against Zimbabwe. His 3 for 45 slowed down Zimbabwe particularly in the last five overs when he used a fine mix of slower bouncers and fuller length deliveries to stop their big-hitters.Saifuddin said that he wanted to support Mustafizur Rahman, who is one of the leading death bowlers in the world, by keeping the run rate around seven in the slog overs. He conceded 22 runs in his last three overs, picking up a wicket.\"I have been bowling in the death overs in the Under-15 and Under-17, while playing under Miraz,\" Saifuddin said. \"I struggled in my early days in international cricket but I always speak to Miraz and Mustafizur, who is an experienced bowler. I tried to execute whatever I have learned.\"It was a batting track. Having conceded some runs in Mirpur during the same period of the innings, we wanted to keep them under 250. Mustafizur is a superb death bowler. I supported him by giving away five to seven runs.\"It was a far cry from the \"has been\" tag that some had put on him quite prematurely after he lost his place in the Bangladesh team earlier this year, having played two ODIs and two T20Is in January and February.Without doing anything flashy in domestic cricket or with the Bangladesh A team in the interim, Saifuddin was brought back because Bangladesh don't really have a pace-bowling allrounder. He was earmarked from his age-group days as a future Bangladesh prospect. He was fast-tracked into the senior side last year, with disastrous results.Saifuddin said that one of the things he did was discuss handling pressure with the senior players.\"I worked on the mental aspects of bowling,\" Saifuddin said. \"I have discussed it with senior players on how to approach bowling in international cricket. I have been quite expensive at this level previously. I will try to keep up what I did today. There's a long way left for me.\"I wanted Mash bhai to bring me into the attack. I wanted to show something since I am playing in place of Rubel [Hossain] bhai. I wanted to do something different so that I get noticed.\"Saifuddin also said that he drew inspiration from his mother's advice about failing in life, while also using his experience of bowling at the death since his age-group days.\"There will be some slips when you are trying to get success. My mother tells me that a baby may fall while taking his first steps but does that mean he will not walk? I will get hit but I will learn from it,\" he said.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}