{"id": "ESPNVihari the difference as another spin-choke takes India B to finalMatch CoverageBetting OddsPresented ByBet365Deodhar TrophyABOUT COOKIES", "paragraph": "India B 231 for 9 (Vihari 76, Gurbani 3-38, Roy 3-45) beat India C 201 (Suryakumar 39, Gill 36, Gowtham 3-40, Tiwary 3-44) by 30 runsHanuma Vihari struck his third successive List-A fifty and his second of the Deodhar Trophy to lift India B to 231 for 9 before their spinners asphyxiated India C through the middle overs to register a comfortable 30-run win in Delhi. The result booked India B's place in the final, rendering the last group match between India A and India C a virtual semi-final.Vihari came to the middle at 47 for 2, after Rajneesh Gurbani sent the openers Prashant Chopra and Mayank Agarwal back. But it was not long before India C seized the control as captain Shreyas Iyer, Manoj Tiwary and Rohit Rayudu fell cheaply to leave the side precariously placed at 90 for 5. After Gurbani did the early damage, left-arm spinner Pappu Roy, aided by medium-pacer Vijay Shankar made inroads through the middle stages, having Rayudu caught behind for 1 and Pappu accounting for Iyer and Tiwary.Vihari and wicketkeeper Ankush Bains then stitched a 60-run stand, the highest of the match, to breathe life into the innings. After Bains was bowled by Suresh Raina for 25, K Gowtham offered Vihari a helping hand with a 19-ball 18 that included two sixes. But neither batsman could go on and provide a final flourish as Gowtham fell to Pappu in the 39th over and Vihari fell to Gurbani for 76 in the 45th. With India B facing the prospect of being dismissed well inside 50 overs, Jaydev Unadkat and Shahbaz Nadeem joined hands and put together an unbeaten 36-run stand that proved match-defining.Things, however, could have been different had at least one of the four India C batsmen who crossed 30 gone on to get a more substantial score. But what an otherwise similar innings to the first one lacked was a Vihari-like contribution. It didn't look that bad for India C despite the early loss of R Samarth for a painstaking 5 as Ajinkya Rahane and Shubman Gill added 44, albeit at a sedate pace. But once Rahane fell to Gowtham for a 61-ball 32, it triggered a cascading effect. Raina became Gowtham's second victim, bowled for just 1 and Gill fell to the part-time spin of Tiwary for 36, as India C were reduced from 65 for 1 to 85 for 4.Part-time spin played a huge role in dismantling India C, as another threatening partnership, this time between Vijay and Suryakumar Yadav that added 48 in 51 balls, was broken by Iyer, who pinned Vijay lbw for a 34-ball 35. With 99 still needed for a win, spinners tightened the noose, as Gowtham had Ishan Kishan caught behind for 5 and then Tiwary hammered the final nail with the wicket of Suryakumar for 39. Much like Unadkat and Nadeem for India B, the ninth-wicket pair of Washington Sundar and Navdeep Saini fought valiantly to add 36, but the mounting required rate caught up with them as India C folded for 201 in the 49th over.The result rendered the last group match between India A and India C, on Thursday, a virtual semi-finalSign up, deposit £5 or more to your account and bet365 will match your qualifying deposit in Bet Credits when you place qualifying bets to the same value and they are settled. Min odds/bet and payment method exclusions apply. Returns exclude Bet Credits stake. T&Cs, time limits & exclusions apply. More DetailsTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}