{"id": "ESPN'Win at all costs' culture led to Newlands scandal - Rod MarshSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-up'Win at all costs' culture led to Newlands scandal - Rod MarshABOUT COOKIES", "paragraph": "Former selection chairman Rod Marsh has laid the blame for the Newlands ball-tampering scandal squarely at the feet of Cricket Australia, citing a \"win at all costs\" culture that he says was repeated at \"every meeting\" of which he was a part.With CA's chairman David Peever set to be re-elected as chairman for a further three years at the Board's AGM in Melbourne on Thursday and the new chief executive Kevin Roberts due to start his role the following day, Australian cricket is still awaiting the release of two separate reviews into CA's culture as an organisation, helmed by the corporate ethics expert Simon Longstaff, and another of the men's team led by the former Test batsman Rick McCosker.Marsh, who served as a selector from 2011 to 2016 and as chairman of the panel from 2014, said that there was no doubt in his mind the pressure to win in South Africa had contributed to the actions of Warner and Bancroft, with Smith's tacit approval, during the third Test of the series in Cape Town, calling CA's culture \"toxic\".\"It wasn't around when I was a player [but] it was around when I was a selector,\" Marsh told News Corp. \"At every meeting it was said we had to get to number one in every format. I felt extremely sorry for Davey Warner. Still the worse thing happened was when Steve Smith and Cam Bancroft going up in front the press at the end of the day's play. That wasn't necessary. It caused all the problems.\"Look, I will always support the players and there's a reason for these things happening. They were under an enormous amount of pressure to win. It's win, win, win, win, win at all costs, which is not the way the game is meant to be played.\"When it did come to a head, I think Cricket Australia realised they were to blame and the only way they could escape public scrutiny (to a degree, at least) was by imposing these penalties on the three players involved. They would have been delighted to tell David Warner about his punishment, as they would still have been seething over the role he played in the MoU saga the year before -- another example of how bad things had become.\"In an interview to promote his new book, Marsh also expressed his strong disagreement with CA's lengthy bans on Warner, Smith and Bancroft, describing ball-tampering as a practice so common even the soon-to-be outgoing chief executive James Sutherland was likely to have done it in his days as a seam bowler for Victoria.\"I wrote it in the book; every fast bowler that has picked up a cricket ball, he's tampered with it, make no mistake about it,\" Marsh said. \"I even questioned whether James Sutherland might have picked the seam, a former fast bowler for the University club in Melbourne, who played some matches for Victoria, if he says he hasn't, I'd ask him the question again.\"That [using sandpaper] wasn't that smart. No doubt in my mind it was one of the dumbest things I've ever seen upon reflection. You can't get away with that with cameras around.\"On the topic of Warner's role in the team, Marsh has written in the book that CA's management was \"very aware\" of the vice-captain's unofficial role as the \"attack dog\" of the side. \"But to my knowledge there was never any pulling him aside and politely inviting him to be quiet on the field,\" he wrote, \"except perhaps when another misdemeanour meant suspension.\"I know from past experience, and close up experience in the later years what the players have to go through. It's not an easy thing. It sounds very glamorous. Sure they get paid exceptionally well but it's a very, very difficult. The players have to be looked after and the players have to respect the game … you've got to show respect and if you don't then the game will bite you as we've seen.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}