{"id": "ESPNSaifuddin, openers help Bangladesh clinch seriesABOUT COOKIES", "paragraph": "\nBangladesh 250 for 3 (Imrul 90, Liton 83, Raza 3-43) beat Zimbabwe 246 for 7 (Taylor 75, Raza 49, Saifuddin 3-45) by seven wickets\n\n\n\n\n\n © Getty Images\n\n\n\nAfter the fast bowlers significantly slowed Zimbabwe down to a middling 246 for 7 - they looked set to double their score of 147 for 2 in the 30th over - openers Liton Das and Imrul Kayes struck aggressive half-centuries to give Bangladesh a series win. The pair added 148 to ensure Bangladesh's passage was a smooth one, victory coming in the 45th over when Mohammad Mithun pulled a long hop for six to take an unassailable 2-0 lead.\n\nMohammad Saifuddin, playing in only his fifth ODI, left a mark with a three-wicket haul that bottled up pressure towards the end overs. Mustafizur Rahman and Mashrafe Mortaza were clinical, not allowing the batsmen a final flourish; Zimbabwe managed just 19 off the last five overs.\n\nThen heavy dew made the ball greasy, thereby hampering Zimbabwe's bowling plans. This played into the hands of the Bangladesh openers who shellacked their way towards the target, wiping off half the runs inside the first 25 overs, before Liton fell looking to hit inside-out. Beaten by turn and dip, he sliced a flighted delivery to point to fall for a 77-ball 83.\n\nHowever, Liton nearly didn't give himself time to settle in. Given out lbw off the fourth ball of the chase to Kyle Jarvis, Imrul coaxed Liton to review Rod Tucker's decision. HawkEye showed the ball would have missed leg. This proved to be the trigger for Liton's onslaught as he treated the crowd to an array of dazzling strokes, hitting five fours in the first five overs.\n\nAs Liton sped away, Imrul consolidated and was the recipient of a reprieve in the 24th over on 58 when Brendan Taylor put down a tough chance off Sikandar Raza. But soon after Liton fell in the same over, Raza removed Fazle Mahmud for his second successive duck - he became the fourth Bangladeshi to earn this unwanted feat in his first two ODIs - to briefly excite the visitors. Having fluffed the opportunity on the first grab, Taylor somehow managed to complete the stumping.\n\nBangladesh recovered from that little spell quickly as Zimbabwe gifted Imrul another life on 70 when Brandon Mavuta dropped him at midwicket off Doland Tiripano. Mushfiqur Rahim and Imrul milked the bowling to add a further 59 for the third wicket before the latter holed out to long-off to give Raza a third wicket, in the 38th over. Mushfiqur and Mithun then scored the remaining 36 without much fuss to extend Zimbabwe's poor 2018.\n\nBut it could have been so different had one of Zimbabwe's batsmen gone on to make three-figures. After the openers departed, Taylor started aggressively, picking off runs without playing a shot in anger. He was particularly swift with his footwork, unafraid of walking across to throw the bowlers off by sweeping against the spinners. In the 23rd over, he reached his first half-century since the World Cup Qualifiers in March, celebrating the landmark with a chip off left-arm spinner Nazmul Islam. Once the landmark was out of the way, he seemed like a man unleashed, hitting straight over mid-off off Mustafizur.\n\nThen he lofted Mahmudullah through the line to the deep-extra-cover fence. It seemed he was set, but all the build-up came crashing down when he played an inopportune reverse sweep to be dismissed for 75.\n\nAll along, Sean Williams was just pottering along, giving Taylor company before he realised the need to step up. He consolidated and was three short of a half-century when he bottom-edged a cut to the wicketkeeper to end a 41-run stand with Raza. This somewhat denied Zimbabwe a late flourish, even though Raza and Peter Moor stuck in and took the innings deep before a clutch of wickets threw them back.\nMohammad Isam is ESPNcricinfo's Bangladesh correspondent. @isam84\n        To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies.\n      "}