{"id": "ESPNChris Gayle's absence is background noise for realist Jason HolderSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upChris Gayle's absence is background noise for realist Jason HolderDon't think I was out of contention before the IPL - RayuduABOUT COOKIES", "paragraph": "West Indies captain Jason Holder talks about the kind of challenges visiting teams face while playing in India (1:28)Jason Holder has called for a focus on the present as West Indies cricket grapples with Chris Gayle's availability for next year's World Cup, and has urged the younger players in the squad to make full use of their opportunities in India.\"What I say is, Gayle is not here,\" Holder said ahead of the second ODI. \"We've got a pretty young core group of players. Regardless of what happens after this tour, that is too far and beyond at the present time. I'm just focusing on what we have to do and that is to play cricket here in India with the squad that we have selected. We've got young Chandrapaul Hemraj and obviously Kieran Powell at the top of the order. Hopefully these guys can get us off to a really good start. \"Ambati Rayudu returned to international cricket after more than two years during last month's Asia Cup but the batsman, who has been publicly backed by the management, doesn't think that he was ever out of the race for a spot in the team.\"I don't think No. 4 is new to me because it's a position I've played a lot in and there's nothing new they've asked me to do. They've asked me to go out and play my game. Even before the IPL, it's not that I wasn't in contention. It was just I had a few injuries and wasn't fit.\"IPL is a good platform to come back strongly, specially fitness, and I think I've done that. And I had to do. In terms of fitness, I'd been working on it, not only now but right from my injury so the yo-yo test didn't have any bearing on how I was preparing. I'm happy that I've cleared the test. [Lately] I've been going to the NCA for a week and then coming back, so there have always been these small pockets [where I've worked on fitness].\"During the first ODI, Gayle was at the inaugural Afghanistan Premier League, where he won the title with Balkh Legends shortly after retiring from List A cricket for Jamaica with a century. At the time, Holder had said he would welcome Gayle into the team at the World Cup and that the veteran would not have played in the qualifiers if he did not have West Indies' best interests in mind.But Holder's appeal to the youngsters to focus on their game rather than their place in the team adds weight to the words of head coach Stuart Law, who told ESPNcricinfo that senior players like Gayle and Andre Russell have been told that World Cup selection will come down to performances, and suggested that extra room for them in terms of criteria is not yet a given.\"Dre Russ and Chris - Chris has given us his programme for the next three months. I think he and Russ have been told that it'll now be down to performance, which is what selection should be based on. You're talking about two special cricketers there though, \" Law said, \"so whether or not they get extra room to move remains to be seen. But for me, you need players with good experience leading into a World Cup, guiding the youngsters how to play. We're lucky to have Marlon Samuels here. And his job on this tour is to show these kids how to go about a game.\"Who knows what the future holds. But yes, leading into the World Cup, this tour and the Bangladesh tour - you've got to be pretty settled and you go into the England series with the full ODI squad. We'll still be thinking about different positions and how we go. It's an opportunity for some to keep scoring runs and taking wickets - can't ignore it.\"If you have a batsman scoring hundred, and an 80 not out, all of a sudden their name's up in our minds. A bowler coming in taking a four-for, or a five-for in a couple of games, their name's up in minds. So at the moment it's all about opportunity. \"In keeping with that philosophy, West Indies fielded two debutants - Hemraj and Oshane Thomas - in the first ODI and have two uncapped players in Obed McCoy and Fabian Allen available in the reserves, among a few other inexperienced players. But while they hope to give everyone a run in the XI, it is unlikely that the batting order that made 322 in the last game will be changed, particularly on a pitch where India are likely to pick three spinners and form is going to be handy.\"I had a look at the wicket,\" Holder said. \"Definitely, there is no grass on it. As we have seen, spinners tend to do pretty well here. Our spinners didn't do as well as we would have liked in the last game. Credit to the two Indians who played outstanding knocks. I felt [Devendra] Bishoo came into his own in the second spell. He got the wicket of [Virat] Kohli, which is crucial for his confidence. It's important for him to be a bit more expressive and look to take wickets. [Ashley] Nurse just needs to just build more pressure and take one or two wickets in the middle overs. The wicket might suit a little bit of spin. Hopefully, whoever is picked delivers.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}