{"id": "ESPNFocus shifts to running on pitches after three penalties in one daySense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upFocus shifts to running on pitches after three penalties in one dayABOUT COOKIES", "paragraph": "All teams in the Woman's World T20 are on notice for running on the protected area of the pitch after three five-run penalties were issued in the two matches played in Providence on Sunday. Pakistan were docked twice during their seven-wicket loss to India, which incurred a total of 10 penalty runs, before Ireland were penalised five runs in their nine-wicket defeat by Australia.Umpires also issued several warnings to individual players throughout the day. Pakistan were warned three times before incurring their first penalty while India received what Mithali Raj termed a \"friendly warning\". The umpires also made the Australian team aware of the extra scrutiny before they took the field in the second match of the day.ESPNcricinfo understands that before the start of the tournament, match officials discussed how to deal with both batsmen and bowlers running on the 'danger zone', perceived to be an issue in women's cricket. As a guide, umpires would gently remind players to keep clear of the protected area and, if they transgressed again, they would then be given a formal warning in accordance with the laws. A further incident would lead to a five-run penalty.But while Ireland's Kim Garth said there were no excuses for breaking the rules, she believed Ireland had only received one warning, in contrast to the three given to Pakistan, when umpire Langton Rusere issued a caution prior to penalising captain Laura Delany.\"I think she had been given a warning,\" Garth said. \"I think rules are rules, and we broke them so we just need to learn from it. I think in previous competitions, like qualifiers, we've kind of been given two or three warnings before they do anything about it. Like we hadn't been penalised before for it.\"Now we just need to learn from it and move on, and know that we're only going to get one warning and one warning only. And it's very simple: we just have to run off the wicket. That's it.\"Former England captain Charlotte Edwards questioned whether the crackdown was necessary, partly because female players tend to weigh less than men and are subsequently less likely to tear up the pitch.\"This whole 'running down the wicket' seems harsh,\" Edwards tweeted. \"Surely the rule needs to be different for the women's game, women hardly damage the pitch at the best of times. Last thing we want is slow spin being played from the crease!!!\"Netherlands men's coach Ryan Campbell suggested pitch preparation was a factor. Television camera positions necessitate all games being played on one day use the same pitch. Three games were played on the opening day of the tournament in Providence and two have been scheduled for each day's play for the remainder of the group stage. The two semi-finals are also scheduled to be played one after another at the Sir Vivian Richards Stadium in Antigua on November 23.\"Gee this running down the wicket is going a bit overboard at #WWT20,\" Campbell wrote on Twitter. \"Umpies a bit over the top, poor old @Irelandcricket copping it....here's an idea, maybe leave some grass on the pitches so they don't get so much wear & tear!! #WT20.\"On the opening day of the tournament, the pitch in Providence became noticeably slower and became more difficult for the batting side. However, Australia allrounder Ellyse Perry denied the pitches being too slow and understood the need to ensure their maintenance.\"I wonder if, to a degree, that's also got to do with the fact that we're playing a lot of games on these wickets and we probably need to be mindful of looking after them. And I think we want really good games of cricket. So we need good wickets for that.\"To be really clear, I don't think the wickets are an issue. I think they are playing fine and I'm just hazarding a guess that we should be looking after them so that they remain fine for the next couple of rounds.\"Both Perry and Garth expressed surprise that the issue was considered a significant problem within the game.\"Look, I've never played in a tournament where this has been, I guess, a key issue,\" Perry said. \"It seems to be in the first couple of matches. And that's completely fine. That's within the rules of cricket and something that they're paying particular attention to.\"Garth accepted that Ireland's batsmen had not shown enough care after seeing Pakistan being penalised twice.\"It is a bit unusual,\" Garth said of the crackdown. \"But I'm kind of more surprised that I suppose we didn't learn from it. And same with Pakistan. To do it once is criminal. But to do it twice is a bit of a brain explosion. And we definitely should have learned from that.\"Former England batsman Lydia Greenway called for consistency from umpires. While the penalties had little effect on the outcome of either of these games, five runs could be the difference between progressing to the knockout stage in tight matches.\"I think whatever happens in this tournament it has to be consistent and the umpires have set a precedent now where anyone who runs down the wicket once they're going to get a warning straight away,\" Greenway said. \"It's just a part of the game that you don't really want to be affecting outcomes and results.\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}