{"id": "ESPNEngland ponder dropping Stuart Broad for first Sri Lanka TestSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upEngland ponder dropping Stuart Broad for first Sri Lanka TestRoot targets T20 developmentABOUT COOKIES", "paragraph": "Stuart Broad could be dropped from England's Test side for the first time since 2012. Broad, the second-highest wicket-taker in England's Test history, would appear to be vulnerable as England balance the desire to play three spinners while ensuring their batting strength is not diluted.Any final decision will be delayed until the team management have had a good look at the surface for the first Test in Galle but it is expected to offer assistance - possibly substantial assistance - to spin bowlers and little to seamers. That means Moeen Ali, Adil Rashid and Jack Leach could all be in line to play.Joe Root has reaffirmed his determination to play for England in all three formats, despite being omitted from the team for their two most recent T20Is. He said he accepted the reasons for being left out but hopes a spell playing for Sydney Thunder in the Big Bash will allow him to push his T20 credentials.\"I suppose I was given a rest,\" he said. \"Of course you always want to be involved and playing but sometimes these things are out of your hands and what it has done is give me a couple of extra days to get ready for the Test matches.\"I'm very ambitious to play in all three formats and I've an opportunity this winter to go to the Big Bash and put some strong performances in for the Thunder. It will be the first time I've had a block of T20 cricket to play since the World T20.\"I'm trying to do everything I can to stay current in that format and develop that side of my game and be a part of the team moving forward.\"With James Anderson and Ben Stokes all but assured of two of the seam-bowling positions, it may well be the final place in the England side is to be contested by Sam Curran and Chris Woakes who, these days, both offer more with the bat than Broad.Broad has, when fit, been an almost ever-present in England's Test team over the last decade. The last two occasions he has been dropped, however, have both come in Asia, with Kevin Pietersen omitting him from his side for the Chennai Test of 2008 and Alastair Cook doing the same in Kolkata in 2012. He was also rested from a Test against West Indies in 2012 but only once the series was won.While Broad's record in Asia is far from awful - he has claimed 41 wickets in 17 Tests at an average of 36.92, a strike rate of 79.50 and conceding just 2.78 runs-per-over - the England management may feel that Anderson offers at least as much control and a little more threat. Anderson averages exactly 30 in Asia, with lower strike and economy rates. In two Tests in Sri Lanka (one in 2007 and one in 2012) Broad has claimed three wickets at a cost of 66.33 apiece, while Anderson has 11 wickets at 40.72 in four Tests in the country.It could also be that England plan to rotate Anderson and Broad, with the former swapping out for the second Test.While Joe Root, the England captain, insisted that no decision had been made over Broad's involvement in the first Test, he did accept that England may need to adopt a \"different formula\" if they are to improve their modest away form. It is two years since England won an away Test - against Bangladesh in Chittagong - and they have lost all three of their most recent away series, to India, Australia and New Zealand.\"Obviously our away record has not been what we'd like over the last couple of years,\" Root said. \"But it's an opportunity for this group of players to turn that around. We shouldn't be scared or intimidated by the surfaces or by the make-up of their team.\"But we've been away from home for a number of times now and struggled. So whether we have to find a different formula we'll just have to wait and see.\"We still haven't finalised the team. Stuart could still definitely play a massive part within the three-match series and definitely he is an option in the first game.\"I wouldn't say it's a changing of the guard and I wouldn't say he's in a weaker position than he has been previously. I think he's actually improving all the time and using his experience wisely. His action is as strong as it has ever been. If we find a different formula with him or without him, I don't think it weakens him as a player or shows where his game is going.\"Ultimately it will come down to the balance of the side. We've a bit of time now to work out what that will be and when we get to Galle we'll make a big call on that.\"Central to England's thinking is the understanding that they have actually bowled pretty well on recent tours. During the Ashes, for example, their seam attack was largely faultless but rendered impotent by a lack of pace that left them unable to extract much out of pitches. The team management are aware, therefore, that they may have to try something different - whether in terms of a three-man spin attack or by adding Olly Stone's extra pace - if they are to achieve different results.\"We've got a number of points of difference within our attack, with spin and seam, which pose a different threat on surfaces that are different to what we've played on in the past,\" Root said. \"What let us down in India, if you look at the results, is that we either dropped chances that were crucial or we wilted on days four and five in our second innings. In the first inning we batted extremely well and put 400 on the board in the majority of occasions.\"Taking those chances will be crucial and making sure we've got plenty of variety.\"England start a two-day warm-up match in Colombo on Tuesday. They may well play up to 13 men in their side and will hope to bat the whole of the first day and bowl for the whole of the second.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}