{"id": "ESPNBismah Maroof returns for Women's World T20 but not as captainSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upBismah Maroof returns for Women's World T20 but not as captainPakistan squad for World T20ABOUT COOKIES", "paragraph": "Bismah Maroof has returned to the Pakistan women squad for their World T20 campaign after having successfully recovered from sinus surgery. However, Maroof, who was the team's regular captain before her absence, will not lead them in the tournament. A PCB press release said she had stepped down from the role and Javeria Khan, who filled in for Maroof, will continue to lead.Javeria Khan (capt), Bibi Nahida, Ayesha Zafar, Muneeba Ali Siddiqui, Bismah Maroof, Omaima Sohail, Nida Rashid, Sidra Nawaz (wk), Sana Mir, Nashra Sundhu, Anum Amin, Natalia Parvaiz, Aliya Riaz, Diana Baig, Aiman AnwarPakistan had already named a 15-member squad for the tournament earlier this month. That squad did not contain Maroof, or a stand-in captain, with the PCB choosing to wait on her fitness. Maroof's return now means that Sidra Ameen, who had been named in the original squad, no longer finds a place.Maroof won nine out of the 22 games she captained in a tenure that began in July 2016. A key batsman in the side, she averaged only 19 when she was juggling leadership duty, with two fifties in 20 innings. Javeria has been at the helm for only six matches - three against Bangladesh, which Pakistan won, and three against Australia, which they lost.Pakistan will warm up for the World T20 with a brace of games, against South Africa and Bangladesh, on November 3 and 6, respectively. They will open their tournament against three-time champions Australia.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}