{"id": "ESPNBismah Maroof reveals she feared for playing career after sinus operationSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking''It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upBismah Maroof reveals she feared for playing career after sinus operationABOUT COOKIES", "paragraph": "Bismah Maroof, Pakistan's former captain, has revealed she had doubts she would ever play cricket again after undergoing surgery for a sinus problem earlier in the year. Maroof experienced issues with her vision before and after the operation, but has recovered to play a part in Pakistan's Women's World T20 campaign in the Caribbean.It was after suffering from blurred vision during training in July that Maroof was told she needed an urgent operation. Because the sinus attack was related to her brain, doctors said the problem could be life-threatening; and even after the four-hour operation went to plan, she faced complications.\"It was quite challenging,\" Maroof told the ICC's website. \"After the surgery, I was on a high dosage of medicines. My eyes got affected, so it took time for me to return to playing.\"\"I was quite depressed. Lying there, at one point I couldn't imagine that I could get up and play again. But they say that whatever plan is made for you is for the good.\"Having been initially told she could not play cricket, Maroof's condition fortunately improved and she was able to return to the Pakistan set-up during the T20 series against Australia in Kuala Lumpur last month.Although she has been replaced as captain by Javeria Khan, Maroof remains a key part of the set-up. She is her country's leading run-scorer in women's T20Is, and the second-most capped player in the format - experience that came to the fore in her innings of 53 in Providence on Sunday, helping Pakistan to their highest T20 total against India. She also took the crucial wicket of opener Smriti Mandhana,It was not enough to set up victory, however, and with Pakistan also beaten in their opening match, against Australia, they face a struggle to qualify from Group B. They have an opportunity to notch a first win against Ireland on Tuesday but, it seems, whatever the game throws at her and her team, Maroof will be ready.\"It's important now to prioritise my health. It has been a stressful time,\" she said. \"I have learnt that you shouldn't plan too much. All your life plans can be turned upside down. So I will not plan again!\"To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}