{"id": "ESPNNajam Sethi threatens legal action against PCBSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upNajam Sethi threatens legal action against PCBABOUT COOKIES", "paragraph": "Najam Sethi wants an apology from the PCB for releasing details of his personal expenses from his tenure as head of board. Sethi sent a three-page legal notice through his lawyers to the new chairman Ehsan Mani and threatened to take him to court under the defamation ordinance.The PCB is in the process of conducting internal appraisals of each of its departments following Sethi's resignation in August when Imran Khan - with whom Sethi has a famously poor relationship - became the Prime Minister of Pakistan (and, by default, the board patron).It isn't unusual for new administrations to release such details of their predecessors, though generally this has been through leaks in the media. This time the PCB has published the expenses on their website. Sethi was the head of an executive committee (ExCo) for three years from August 2014, when Shaharyar Khan was the board chairman. Sethi eventually took over from Shaharyar in August 2017. The PCB findings state that in that time Sethi had incurred total expenses of PKR 71.95 million (PKR 40.84 million as PCB chairman and PKR 31.12 million as ExCo chief)\"There is no valid business reason for the release of such incorrect and misleading information,\" reads the legal notice, a copy of which ESPNcricinfo has seen. \"Instead, the publication of the chart is clearly intended to malign Mr. Sethi, presumably at the behest of Mr Imran Khan. It is unfortunately beyond measure that you are complicit in the abuse of PCB for male fide political purposes. You and PCB are thereby called upon to apology to Mr. Sethi and to withdraw the chart. If you fail to do so, we have been instructed to commence appropriate proceedings under the Defamation Ordinance, 2002. Please note that such proceedings will be at your risk and cost.\"Sethi, a noted media professional before he joined the PCB, became a figure of considerable influence in Pakistan cricket in his time. The PCB had never had anything in the manner of the ExCo until it was created in 2014 and Sethi appointed as its chief. The ExCo did not have any decision-making powers - it could only make recommendations to the board - but Sethi grew in power to such an effect that he was running the day-to-day affairs of the board.On Saturday, the PCB released a one-page summary of Sethi's personal expenses, broken down into categories such as personal vehicles, foreign travel, daily allowance, business entertainment and more. In it, there was mention of a \"special allowance\" for paying Sethi retrospectively for his three years as ExCo chief. It was originally meant to be an honourary position. The PCB said the purpose behind the release was not to point out financial irregularities but to show how much money was being spent on an official ranked below the chairman.Mani has already undone a few decisions made by Sethi, including the buying of bulletproof vehicles. The board had initiated a tender process at a cost of PKR 30 million but that's been scratched off the docket. Mani has also cancelled a payment of roughly PKR 575,000, approved in February 2018, made out to the PSL governing council (Sethi is part of it)The PCB's report also made a mention of its expenses in 2016-17 when Shaharyar spent PKR 8.09 million on medical bills. Shaharyar had to go through heart surgery in London and spent over eight weeks in his London residence. His one year at the helm cost the board PKR 19.49 million.An administration conducting an audit into the previous regime is nothing new. Sethi himself had asked for one looking into his predecessor Zaka Ashraf's term. The Ijaz Butt administration had commissioned an extensive, independent, government-organised audit of the PCB covering the tenures, upto June 2008, of three chairmen: Tauqir Zia, Shaharyar (in his first stint) and Nasim Ashraf. That report had also revealed financial ineptitude, mismanagement and wastefulness.To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}