{"id": "ESPNMeg Lanning ton leads Australia women to series winABOUT COOKIES", "paragraph": "\nAustralia women 273 for 7 (Lanning 124, Haynes 79, Sandhu 3-54) beat Pakistan women 123 all out (Nahida 66, Molineux 4-14) by 150 runs\n\n\n\n\n\r\nMeg Lanning latches on to a short ball\t\t\t\t © Getty Images and Cricket Australia\n\n\n\nMeg Lanning's 12th ODI hundred in 68 innings helped Australia trounce Pakistan by 150 runs in the second ODI in Kuala Lumpur. Batting first, Australia posted an imposing 273 for 7. Left-arm spinner Sophie Molineux then ran through the Pakistan line-up with a 4 for 14 to bowl them out for 123, helping Australia go 2-0 up in the series with one match still to go. The win also put Australia two points clear at the top ICC Women's Championship table.\n\nPakistan displayed a marginally better show with the bat on Saturday after being skittled for 95 in the first encounter. But that was all thanks to opener Nahida Khan's 114-ball 66, the highest score by a Pakistan batsman against Australia. The second-highest contribution was Sana Mir's 15, while the rest of the batsmen crumbled once again. \n\nChasing 274, they were 37 for 3 in the tenth over with Megan Schutt and Ellyse Perry doing the damage early on, after which Molineux came to the fore. Molineux took two wickets in her first spell to reduce Pakistan to 77 for 5 before coming back to break the 44-run sixth-wicket stand by Nahida and Sana. In her nine overs, Molineux bowled 48 dots. Eventually, Pakistan were all out in the 41st over with Ashleigh Gardner's two wickets cleaning up the tail. \n\nEarlier in the day, Lanning opted to bat after winning the toss, and walked in when Alyssa Healy was dismissed by Diana Baig in the seventh over. Lanning then saw Nicole Bolton and Perry make the walk back, after which she combined with Rachael Haynes for a 181-run fourth-wicket stand that flattened the Pakistan bowlers. Haynes and Lanning were then dismissed in the 44th and 46th over respectively, as Nashra Sandhu helped Pakistan finish their bowling effort on a strong note.\n\n        To help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies.\n      "}