{"id": "ESPNSoumya Sarkar added to ODI squad for last matchSense of belonging helps Keaton Jennings stay relaxed in the line of fireAngelo Mathews still hurt by ODI axing as he lets 'bat do the talking'Shakib returns from finger injury to lead against West Indies in first Test'It's set up for a bit of a thriller' - Keaton Jennings braces for day five tussle'Not sure how I got the hat-trick' - Anya ShrubsoleDenmark coach Jeremy Bray's journey: from 'going bananas' to being zenWhy women's cricket appeals to all cricket watchers nowShakib returns from finger injury to lead against West Indies in first TestBCCI limits Shami workload to 15 overs per innings in Ranji matchOman secure promotion with win over USA; Kenya deny Singapore's thrilling chargePoonam Yadav, India's pint-size magicianIns and Outs of the IPL trade windowSunrisers retain David Warner for IPL 2019, Wriddhiman Saha releasedShastri a yes-man? 'Most bizarre' says defiant KohliKohli wants batsmen to 'show more character' in AustraliaNo more chopping and changing in ODIs - Ravi ShastriBalls to statistics: Ben Stokes' moments of brilliance show his true valueTough sharing the Test series trophy at home - MahmudullahZimbabwe's fight a big takeaway for satisfied MasakadzaSingapore crush Uganda; USA outlast Denmark to stay unbeatenTaylor overcomes neck injury to take career-best 4 for 12'I don't know what happened' - Jahanara after Bangladesh lost chasing 98Stephen Fleming helps lure Dwayne Bravo to Melbourne StarsAustralia players to have only limited IPL roleContaining Kohli in first 10-15 balls will be key - Mike HessonBCCI panel wraps up hearings after Johri, two complainants deposeMCC back-track on beamers rule after criticism from grassrootsGlenn Maxwell critical of 'broken' start to Australian seasonStarc released from IPL amid Australia contracts debateInjured Holder out of Bangladesh tour; K Brathwaite to lead in TestsTicketmaster apologises for World Cup mix-upSoumya Sarkar added to ODI squad for last matchABOUT COOKIES", "paragraph": "Bangladesh have included Soumya Sarkar in the squad for the third ODI against Zimbabwe in Chittagong. Soumya left Khulna on the third day of his side's ongoing first-class match against Rajshahi Division.Chief selector Minhajul Abedin confirmed to ESPNcricinfo that Soumya was the only addition to the current squad.This is the second time in succession that Soumya has been added to the ODI squad midway through a series. He was flown to the UAE to join the team during the Asia Cup as \"batting reinforcement\" after Bangladesh were hit by an injury to Tamim Iqbal and were grappling with the form of their top order. In his two outings, however, he opened the batting only once, with a five-ball duck against Pakistan, before chipping in with a handy 33 in the final against India, where he batted at No. 7.Since then, he has made a century and three fifties in the NCL first-class competition, apart from an unbeaten 102 for BCB XI against Zimbabwe in the practice match in BKSP last Friday. He also took a five-for in the last match for Khulna against Rangpur.Khulna have called upon Robiul Islam Robi as his replacement for the remainder of the first-class match.Squad: Mashrafe Mortaza (capt), Liton Das, Imrul Kayes, Nazmul Hossain Shanto, Mushfiqur Rahim, Mohammad Mithun, Mahmudullah, Ariful Haque, Mehidy Hasan Miraz, Mustafizur Rahman, Nazmul Islam, Rubel Hossain, Abu Hider, Mohammad Saifuddin, Fazle Mahmud, Soumya SarkarTo help make this website better, to improve and personalize your experience and for advertising purposes, are you happy to accept cookies and other technologies?"}