{"id": "Netflix tests ads: No need for drama", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Michal Wlosik\n            — \n                        in Contributors\nNews of Netflix testing ads spread like wildfire and caused outrage among bingers worldwide, but there’s no need to fret. For me, the proportions of the meltdown only show that most people have little idea about what Netflix ads really are and how they could actually benefit our watching experience.Netflix boasts over 130 million active subscribers around the globe and certainly can’t afford to alienate its viewers by adulterating the watching experience. However, the news of introducing ads in-between episodes made a lot of people jump to hasty conclusions about the company’s greed. @netflix I have heard about others getting advertisements in between shows now. Is that true?Fair warning, first advertisement I get, I am cancelling my subscription and will urge my friends and family to do the same.I pay a monthly service fee to NOT get ads.#netflixads— Kyle Stephens (@kyle59sh) August 17, 2018It’s called Hard Fork DecentralizedI’ll be the one of millions to say it. If you introduce any ads to your service that we pay for, I am cancelling my subscription that I had for years and move on somewhere else. @netflix #netflixads #subscriptioncancellation— iGameOver (@quantumstate12) August 20, 2018Netflix, what are you doing? I’ll never understand corporations that have a great product and feel the need to randomly change said product for the sake of change. Leave well enough alone. @netflix #netflixads— TheRealMatthewJones (@MJonesEsquire) August 18, 2018Users get easily triggered by words like ads or commercials, but the drama is simply unfounded in this case. Netflix calls their ads promos, and uses them to recommend other Netflix shows.The system is based on sophisticated on-site behavioral targeting algorithms and audience segmentation, which is actually very useful for viewers and a far cry from yesteryear’s 12-minute commercial breaks in the middle of a 30-minute show. Let’s dig deeper into some of the reasons why everybody should chill out and appreciate the possibilities behind.In all the excitement people seem to forget the most obvious: the ads promos are skippable and don’t compromise the viewing experience in any way.It works just as before; after each episode of your show, the final credits roll and the “Play Next Episode” button appears. Netflix ads will work just like that, the only difference being that a promo video will be shown with the “Play Next Episode” button instead.Even if you’re too lazy to actually press the “Play Next Episode” button, the promo is still only 30 seconds long. This is rather fair and hardly intrusive at all, especially given that the promo rolls only after a 60-minute, uninterrupted episode.Netflix’s noble pledge to keep the platform completely ad-free still stands. On top of the promos, there are and will likely never be any third-party ads displayed to the platform’s users, which was reiterated by the company’s representatives on numerous occasions. Currently the only type of external advertising Netflix uses is slight product placement, which is still fairly non-intrusive.The company’s actual intention behind the “promos” is to advertise their own content to existing subscribers and by extension, “promote new content in such relevant ways that we wouldn’t have to spend externally,” says Netflix Chief Executive Reed Hastings.This will help the company to promote new content to long-time bingers internally, but also promote some old content to new subscribers, which makes sense.Chances are you have never seen a promo, and may never will. Promos are only displayed to select audiences, but may never end up being rolled into the actual service. This is because Netflix is only testing the idea, and may not implement at the end of the day.Netflix is known for running tests of new features. The video previews that play when users hover over a show’s title started off as a test and was then rolled out as a permanent feature, but hundreds of other functionalities didn’t.If Netflix promos are not right up your alley, you can simply opt out. The very reason why you are currently seeing them, it’s probably because you agreed to participate in tests and previews. You can shift back to the original watching experience by going to your account settings from your web browser: click the profile icon in the top-right corner, go to Account then Test participation, then turn off the test participation setting, hey presto – promos are gone.Let’s face it: nobody knows your bingeing habits better than Netflix itself. The shows Netflix promotes are actually very likely to fit your taste. It doesn’t sound that bad, does it?It makes all the sense in the world for them to tap into their immense data about subscribers’ behavior and forge it into valuable insights and a better user experience for all. The net result is a more satisfied audience and extra viewership.A Netflix spokesperson said the promos are expected to “significantly cut the time members spend browsing and [help] them find something they would enjoy watching even faster.”In spite of the threats of global exodus (see the tweets above), there is really no viable ad-free video-streaming alternative nowadays. Netflix is still, in fact, one of the last platforms considering a foray into ads, and the way it has decided to implement promos is still very minimal. To put it in perspective:Netflix promos surely won’t damage your watching experience. If anything, they might actually prove useful when you give them a try. There are 130 million Netflix subscribers around the globe. What’s even more impressive is that the number could easily be double that, considering almost everyone shares the account with at least one other person. It’s not surprising that Netflix seeks ways to capitalize on its immense user base and grow its viewability.The Netflix “ad scandal” is an example of how people can blow an innocuous change out of proportion and trigger a global meltdown.Commercial breaks are one of the reasons people gravitate away from traditional television or streaming platforms. The ad-free experience is an important allure of the platform, and Netflix must be fully aware of that.\nRead next:\n\n        Learn to become Cisco certified in networking and cloud computing for $39    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}