{"id": "Moonday Mornings: AT&T and T-Mobile sued by victims of sim-swap cryptocurrency theftsExplore our decentralized future", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Blockchain, cryptocurrencies, and insider stories by TNW.\n            Powered byRegulations, patents, lawsuits, and miningWith the nights drawing in, we’re officially in hibernation mode now, so we spent most of the weekend in bed hiding from the wind and rain. But it was all in vain, and now it’s Moonday again.Here’s this weekend’s round-up of top cryptocurrency and blockchain news you need to know about:1. Another American state is coming down hard on cryptocurrency baddies. The state of Colorado has taken action against four ICOs that were pushing unregistered securities. Ordered with a cease-and-desist the ICOs can no longer operate in the Centennial State.2. A leading American cryptocurrency law firm is filing lawsuits against cell network providers, AT&T and T-Mobile, on behalf of its cryptocurrency hodling clients who fell victim to sim-swapping hacks. I guess that’s another hack to watch out for.3. According to researchers from London and Cambridge in the UK, private blockchains, like those being developed for banks and corporations, could be compliant with EU privacy laws and hence be safe and controlled places to store data.4. The Malaysian education ministry has formed a consortium of universities to put degrees on the blockchain. Apparently, Malaysia is rife with fake degree certificates, and the Malaysian government believe blockchain can fix this. For the sake of academic integrity, let’s hope so.5. The largest bank in America has filed a patent for a form of private key storage that is “tamper responsive.” Basically, this means if private keys are tampered with, the owner will be notified in real-time.6. DMG Blockchain Solutions has launched an 85 megawatt cryptocurrency mining facility that is powered entirely by hydro-electric energy. What’s more, the power is delivered by DMG’s own substation – separate from the local grid – so local electricity supplies won’t be affected.Well there you have it, another weekend of blockchain and cryptocurrency news caught up with. It was another weekend of regulations, lawsuits, and patents. But hey, cryptocurrency mining is going green!\n                                    Published November 12, 2018 — 09:47 UTC\n                                \n                                        November 12, 2018 — 09:47 UTC\n                                    12 - 14 DECEMBER - ALL OVER LONDON Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}