{"id": "Alibaba’s inexpensive smart display tech makes shopping easier for the visually impaired", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Ivan Mehta\n            — \n                        in World\nTech giants are generally slow when it comes to making their products accessible to the differently abled. But lately, some of them have been working on innovative projects that will accommodate more users. One of the most interesting of these comes from Chinese tech conglomerate Alibaba, which introduced a smart display technology to help the visually impaired with shopping and payments on their phones.As per a TechCrunch report, Alibaba’s R&D wing, Damo Academy, collaborated with China’s Tsinghua University to develop a cheap silicone sheet with sensory buttons that go on top of a smartphone display. The sheet – which costs just 3.6 cents to produce – has three small buttons on each side; you can press them to perform actions like ‘Confirm’ or ‘Go back’ while using supported apps.It’s all about cryptocurrency and blockchainCurrently, the smart film works with special versions of Alibaba’s e-commerce app Taobao and Alipay, its mobile payment service. The buttons on the film have different functions in each app. Right now, The research team is testing and refining the product with volunteers. It is also working on making the technology device-agnostic. The film will launch officially early next year.“We thought, human-machine interaction can’t just be for sighted people. Besides voice, touch is also very important to the blind, so we decided to develop a touch feature,” said Chen Zhao, research director at Damo Academy. “Unlike with regular apps, it’s hard to beta test Smart Touch because the blind population is relatively small.”Alibaba doesn’t intend to make money by selling its smart film; instead, the company will distribute it for free via its brick-and-mortar outlets.Many tech companies are taking up projects to help the visually impaired take advantage of smart devices to improve their lives. Google’s Lookout app helps people ‘see’ things around them using their phones; Mircosoft has an app called Soundscape that assists people in getting around a city through audio cues.More ideas like this, please.\nRead next:\n\n        Moonday Mornings: AT&T and T-Mobile sued by victims of sim-swap cryptocurrency thefts    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}