{"id": "Bethesda braces for Fallout 76 beta’s inevitable bevy of bugs", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Rachel Kaser\n            — \n                        in Gaming\nBethesda Game Studios today released a note to its fans warning its upcoming game, Fallout 76, was likely to have some pretty big bugs and glitches, and it would need gamers’ help finding them. In other news, the sky is still blue and bears still shit in the woods.As the Fallout 76 beta is due to open tomorrow, one can only assume the note was a bizarre attempt to soften the blow for the people who are going to find the bugs the hard way. It begins with a description of how the game came to being, and how the studio feared trying something that was a bit out of their comfort zone. It’s all very self-effacing (and dare I suggest a bit disingenuous):Once the idea of ‘Fallout-Online-Survival-Game’ stuck, there was not running back, but still some worry and questions. Will people want this from Fallout? Will they want it from us? How the hell are we going to make this? And what, exactly is this?”It’s our cool new gadget site.With that in mind, the company very tactfully suggested players would find some glitches when they fired up the game, and it would require player input to know what to fix first:Given what we’re doing with 76, we know we’re opening everyone up to all new spectacular issues none of us have encountered. Some we’re aware of, such as areas where performance needs to improve with lots of players. Others, we surely don’t. We need your help finding them, and advice on what’s important to fix.Really inspires excitement to play, doesn’t it?Remember when Skyrim first came out and darned near everybody reported a humorous bug or twenty? My favorite was the dragons flying backwards. To this day, I still get the occasional NPC glitching through the ground or an item floating in the air. And it’s not like Skyrim was a unique Bethesda RPG in that regard. Several of the Fallout and Elder Scrolls games have had massive bugs on launch — it’s just something we’ve come to accept about them.The problem is so endemic that Todd Howard even joked about it during this year’s E3 event, saying “I’ve read on the internet that our games have a few bugs. I did, I read it on the internet, so it’s true.” Cheeky smugness aside, he’s not wrong.So for Bethesda to plead for mercy with its prospective new players by admitting upfront there are going to be massive bugs even they don’t know about is an odd way to welcome them into the beta phase. We’re kind of expecting it, guys. But if you, my gentle readers, are part of the beta and you spot some problems, remember to complain about them often and loudly — Bethesda is literally asking you to.\nRead next:\n\n        Trump begs big tech for free labor to avoid federal hirings    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}