{"id": "US authorities to auction off nearly $4M in confiscated BitcoinExplore our decentralized future", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Blockchain, cryptocurrencies, and insider stories by TNW.\n            Powered byWhat goes around, comes aroundThe American government is again showing that it has no interest in hodling, and is auctioning off over 600 BTC.The US Marshals Service (USMS) announced yesterday the auction will be taking place between 8am and 2pm EST on November 5th. Oh, the irony. Nope? Just me then.The Bitcoin BTC being auctioned has been confiscated and seized from a number of federal, civil, and administrative cases.Before you start rummaging through your savings to make a bid, there are a few hurdles to jump over first.Interested bidders must register with the USMS by e-mail by midday on October 31st, and of course registrations must be approved the the US marshals office.Oh, and you must put down a deposit of $200,000 as a sign of intent too. For whatever reason, it seems the Marshals office is keen on keeping this sale within America. While non-US bidders can bid, all payments must be made from a US bank account.The Bitcoins are split up into seven blocks. Six blocks of 100 BTC, and one block of 60 BTC. Bidders are welcomed to bid on one or more of these blocks.Sure, it’s kind of ironic that the government is liquidating confiscated Bitcoin to generate cash revenue, but it’s becoming fairly standard practice to sell off confiscated cryptocurrency. The proceeds usually go back into various government bodies that help fight crime.Governments have had a hazy past when it comes to handling seized cryptocurrency. In August, a San Francisco judge ordered a cyber criminal to pay bail in Bitcoin. Days later, the court had to backpedal after it found performing the transaction to be incredibly impractical. This auction seems like a smarter move.\n                                    Published October 19, 2018 — 13:51 UTC\n                                \n                                        October 19, 2018 — 13:51 UTC\n                                    12 - 14 DECEMBER - ALL OVER LONDON Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}