{"id": "Details of 170,000 Pakistani debit cards leaked on dark web", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Ivan Mehta\n            — \n                        in Security\nLast week, we reported that nearly 20,000 Pakistani debit cards were put up for sale on the dark web. Now, cybersecurity firm Group-IB has found out that earlier this week, a new dump of whooping 177,878 appeared on the dark web.The report noted that the new dump appeared on the dark website Joker Stash on November 13. From the total number of cards, there were 150,632 cards of Pakistani banks, 16,227 cards of other regions’ banks, and 11,019 cards of undefined banks.Visit Hard Fork.The report further notes cards issued by Habib Bank accounted for nearly 20 percent of the dump.“Card dumps are usually obtained by using skimming devices and through Trojans infecting workstations connected to POS terminals. The large part of compromised card data is sold in specialized card shops, such as Joker’s Stash.” said Dmitry Shestakov, Head of Group-IB Cybercrime research unit. “Group-IB Threat Intelligence continuously detects and analyses data uploaded to card shops all over the world.”He added that the dump wasn’t mentioned anywhere earlier on dark web forums or card shops.Group-IB notes that the estimated value of the dump is $19.9 million. The sale price for the cards was anywhere between $17 to $160.This new incident points to glaring holes in Pakistani banks’ security systems. They will need to investigate and take the right measures to ensure safety for their customers.\nRead next:\n\n        Twitter says the Bitcoin scam wave came from third-party app    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}