{"id": "Dell’s XPS 15 with 4K display is the laptop for people who want it all", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Gadgets for humans\n            And won't settle for lessDell recently updated its already-excellent XPS 15 with some tweaks (and a sweet new 8th generation Intel processor) and the results are exceptional. We knew the latest iteration of the highly-anticipated laptop would be good, but once we got our hands on one it was clear it’s among the best.The unit we reviewed was a regular XPS 15 laptop, not the 2-in-1 version. Otherwise it had most of the top specs for the model, including the excellent 4K Infinity Edge touchscreen display.The XPS 15 starts at $999.99, but the configuration we reviewed comes in at a slightly more gulp-inducing $2,099.99. If you can deal with half the RAM and a 1080p non-touch screen, you’ll save a bunch of money. But you’ll have a slightly less complete experience.To get an idea of who this laptop is designed for, let’s dive right into the specifications:This thing is a beautiful beast. It’s fast enough to replace your desktop (in fact, it’s one of the few laptops I’d argue can replace all but the most high-end users and gamers’ desktops), the screen is good enough for professional photographers to edit with, and it can play Fortnite at a silky-smooth 60FPS at the top settings. Aesthetically, it compares well to the LG Gram.Credit: Nicole GrayThe XPS 15 is a bit thicker and twice as heavy, but this is one of the sleekest powerhouse laptops you’ll find. If you plop this thing down in a group of people who are unfamiliar with its pedigree, with the lid closed, they might think you have one of those cool lightweight devices that eschews power and practicality for low-cost and easy portability.They’d be dead wrong.The XPS 15 can do it all. And it becomes pretty apparent this isn’t your run-of-the-mill device once you open it up and power it on. The unit I reviewed was an ode to the kind of excess that seems wasteful to some and necessary to others.Do you need an Nvidia 1050 GTX graphics card in a laptop that’s obviously trying to catch the eye of the professional crowd? No, you don’t. But it sure is nice to fire up The Witcher 3 in between meetings.And do you really need your 4K display to be a touchscreen? No, you don’t. But it sure is nice to scroll through Netflix by dragging my fingers on the screen like I’m on a phone or tablet, then watch Stranger Things in glorious 4K resolution the way it was meant to be seen.The Infinity Edge display from Dell may not be the technical marvel it would have been two years ago with it’s near bezel-free design, but it produces images better than any I’ve seen in a laptop sans Apple’s. You simply have to see it to believe it but, even at 400 nits brightness, it’s a delight to behold at its full battery life-sucking intensity. And it’s quickly become my favorite screen to view 4K videos, TV, and movies on, period.Performance-wise, it’s monster-iffic. It can handle Photoshop and Chrome and a dozen other programs being open at the same time. The 8th gen Intel i7 processor operating at 2.2GHz and 16GB of RAM are more than enough to handle almost any software that doesn’t require a specialty-computer. As far as business, office, or what I’d consider to be “day-to-day professional” use is concerned: throw your desktop away and get this thing.As far as processor speeds go, Digital Trends has it neck and neck with the Razer Blade and the Macbook Pro. In my experience, each one excels at something the other doesn’t, but the XPS 15 might be the best total package.I won’t get into a deep dive of the specific benchmarks, but I will say that it’s the fastest Windows 10 laptop I’ve used when it comes to launching programs and performing routine functions. I’ve seen less of the Windows hourglass with this than any other laptop running Windows 10 I’ve used.I definitely think it compares nicely to the Razer Blade when it comes to performance outside of gaming. But, if gaming is an important consideration when it comes to choosing a new laptop, it’s worth pointing out Dell’s own G3 Gaming Laptop is less expensive and seems to perform just as well in that department.Overall, I’d consider other options if gaming were my primary concern. Especially since you won’t be able to make use of the 4K screen with most games anyway.Credit: Nicole GrayIt is, however, perfectly suited for editing video and photos. The touchscreen brings some interesting options to the editing process — though you should banish thoughts of controlling Photoshop with a specialty pen directly on the screen.It’s touchscreen sensitivity is perfect for using it like a tablet, but professional photographers are going to want to use an external input device for fine-grain editing. More important is the quality of the display.Its rich and vibrant color profile doesn’t rely on blowing out the brightness to make images pop, and that means it’s a more “fair” display when it comes to showing your unedited work. It also means that it handles blacks well enough to make watching horror movies in 4K simply delightful.So, if you ever stop working and use it for R&R, it’s a decent enough reason to upgrade your Netflix account to 4K. Everything looks a little better on the anti-glare screen, though your optical delights do come at the cost of extended battery life. You’ll be getting around half the performance out of the XPS 15’s larger-than-average battery with the 4K screen than you would with configurations featuring the 1080 screen.It’s not that bad — I got about 7-8 hours between charges with fairly heavy video and software use. It was enough to make it most of the day without plugging in, and luckily the included charger isn’t of the bulky variety so it’s not a pain to travel with.There’s a lot of little things to like about the XPS 15 as well. The slightly-grippy surface surrounding the keyboard is appreciated as long-term use can lead to slightly sweaty hands and wrists — a little grip goes a long way.I was also pleasantly surprised by the keyboard. I tend to hate laptop keys because I prefer some travel, and they usually have very little “clickiness.” This one is an exception. While it still doesn’t have a lot of travel, the keyboard does feel somewhat clicky and responsive. I didn’t mind using it for entire work days, but in the end I’d still prefer to connect a mechanical keyboard. The touchpad is fantastic, it functioned flawlessly during my testing.Credit: Nicole GrayOn the negative side, there’s a few problems with the XPS 15 that belie its status as an elite machine for professionals … who need a 4K screen … and also like to game. Chief among those issues is the placement of the webcam. It’s smack dab in the crease of the machine so it always has a perfect view up your nostrils.People who don’t want to show off the under-side of their chin may need to connect an external webcam to use with this device, or just take video calls on their phone. I despise webcams and video chatting, so it’s not a problem for me. For what it’s worth the picture from the webcam is crisp and clear.Another issue I had was with the speakers. On the plus side they do get loud enough to watch movies in a somewhat noisy environment, and they’re tuned well enough that you won’t constantly have to change the volume to maintain a listenable experience. But, otherwise, they manage to pull of the rare feat of having both slightly tinny highs and slightly flat lows.This is possibly due to the shell design and speaker placement. Don’t get me wrong, they don’t sound bad, just underwhelming for a package that’s otherwise exemplary. It shouldn’t be a deal-breaker unless you have no external speaker or headphone options.Those caveats aside, I don’t think I’d recommend another 15-inch laptop over this one, especially as a desktop replacement. Apple fans can shrug knowing it doesn’t matter to them, but other power users will be hard-pressed to find a better combination of lightweight aesthetic, price, and performance.Stay tuned for our upcoming review of the XPS 15’s littler sibling, the XPS 13.We like some products. We don’t like others. Either way, if you buy something through our affiliate links, we get a small cut of the revenue. This isn’t a sponsored post, but for the sake of transparency, you deserve to know what’s up.\n                                    Published October 23, 2018 — 22:19 UTC\n                                \n                                        October 23, 2018 — 22:19 UTC\n                                    Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}