{"id": "Legendary cypherpunk declares cryptocurrency is failing its creatorsExplore our decentralized future", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Blockchain, cryptocurrencies, and insider stories by TNW.\n            Powered byBitcoin is dead, long live BitcoinAs cryptocurrency falls further into the hands of the mainstream, it falls further away from its creators, the cypherpunks.Earlier today, CoinDesk published an in-depth interview with Timothy May, one of the founding members of the cypherpunk movement.In the interview, May highlights how the ideology that spurred the creation of Bitcoin is slowly being eroded.After asking May a few questions, CoinDesk received “a sprawling 30-page evisceration of a technology industry [May] feels is untethered from reality.”In an article dating back to 1985, David Chaum, the creator of DigiCash, outlined the concept of the “dossier society.” This society, he thought, would come as an inevitable result of our increasing reliance on technology.In his interview May reaffirmed with all its regulation, blockchain is slowly becoming another tool that enables a “surveillance state, a dossier society.”But we must remember, blockchain was created to support a system, and perhaps more importantly, an ideology that sought to challenge the “dossier society.” Only now, this isn’t what is panning out, as more centralized bodies are getting their hand into blockchain.When CoinDesk asked May if he thought Bitcoin has stuck to its cypherpunk roots, he replied it is far, far away.May went on to say, “I think the greed and hype and nattering about “to the Moon!” and “HODL” is the biggest hype wagon I’ve ever seen.”May told CoinDesk how the hype and intense interest in cryptocurrency and blockchain has swept through industries like a tsunami leaving behind “confusion and carnage.”Some might call this disruption, May likens it more to Schumpeter’s “creative desctructionism.” Some even might claim this is necessary for societal development. May doesn’t seem to think so.“What I see is losses of hundred of millions in some programming screw-ups, thefts, frauds, initial coin offerings (ICOs) based on flaky ideas, flaky programming, and too few talented people to pull off ambitious plans,” May told CoinDesk. “Sorry if this ruins the narrative, but I think the narrative is fucked.”May highlights how sheer interest and hype surrounding blockchain has got every man/woman and his/her dog developing some kind of use for the supposedly decentralized tech. But when this happens, the tech becomes inherently more centralized.“People and companies are trying to stake-out claims.” May continued, “Some are even filing for dozens or hundreds of patents in fairly-obvious variants of the basic ideas, even for topics that were extensively-discussed in the 1990s”Using blockchain to posture for competitive advantage couldn’t be any further from what it originally set out to achieve. As May put it, “Satoshi would barf.”May might have a point here. A recent study showed China’s control of Bitcoin’s hashrate. Another study found only 16 percent of cryptocurrencies are truly decentralized. Then there are the seemingly weekly announcements of yet another bank using blockchain.All of which create a centralized and controlled reality, contrary to the original visions for Bitcoin.“Remember, the excitement about [Bitcoin] was mostly about bypassing controls, to enable exotic new uses like Silk Road. It was some cool and edgy stuff, not just another PayPal,” May said.The lengthy interview is worth a leisurely read; find it over on CoinDesk.\n                                    Published October 19, 2018 — 11:14 UTC\n                                \n                                        October 19, 2018 — 11:14 UTC\n                                    12 - 14 DECEMBER - ALL OVER LONDON Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}