{"id": "These stylish sunglasses also capture HD video and photos", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by TNW Deals\n            — \n                        in Insider\nIf you think about it, it makes sense that out of all the tech giants out there, that the company behind Snapchat would be ahead of the curve when it comes to integrating wearables with the functionality of capturing videos and photos for sharing. We are used to this tech popping up in the health sector, but what about everyday wearables like sunglasses that capture video in HD, as well as high quality pictures?  Snap Inc. recently launched a new wave of Spectacles — a set of wayfarer-style sunglasses that come in unisex and women’s styles. Ideal for when you want to capture a random moment without disrupting whatever scene is taking place without interrupting what’s happening or being slowed down by needing to pull out a phone or camera. Hard Fork.The polarized lenses boast a sleek, sophisticated look. Perfect for slipping on before you run errands or taking with you on your next camping trip. They’re even water-resistant enough to use at pool parties and in shallow water, and have enough onboard memory to use without needing your phone. Spectacles can now record up to 30 seconds of HD video — and even though they’re made for Snapchat, you can export the photos and videos you take to any platform. They’re preset to record from a circular perspective, but you can download your media to square or rectangular formats if you’re an Instagram user or otherwise. All you need to do is press a button, and you’re able to start taking all the photos and videos you like — without needing to stage the scene, or ask friends to stop and pose for the photo. Priced anywhere between $150-200 per pair, these sunglasses are stylish enough to wear anywhere, and are a perfect way to help you relive your memories. Bring a pair with you before your next trip or holiday, and you’re ready to go. Check out the collection here before they sell out. \nRead next:\n\n        Our lack of interest in data ethics will come back to haunt us    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}