{"id": "Last week’s best Android games to distract you from your inevitable death", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by NimbleThor\n            — \n                        in distract\nWelcome to our weekly column, in which YouTuber NimbleThor brings you a short list of the best new mobile games for your Android device, released over the past week. We’re actually a week behind this time; please bear with us while we get back on track next Friday.Whether you’re into casual time wasters or hardcore shooters, you’ll find something in here to exercise your thumbs with.It’s all about cryptocurrency and blockchainLife is short. And one day, you’ll be outta here. Heck, there’s even an app that reminds you about it several times a day. But you’re probably better off thinking about other stuff. We’ve got a bunch of new Android games to get your mind off things.Blastlands is a fun casual top-down Battle Royale-style “.io” shooter which sees you start out as a human trooper, defeating enemies to collect scrap parts, leveling up and scoring better vehicles to add to your arsenal.The game is lightweight, fun and chaotic, matches start almost instantly, and with three game-modes; Free for All, Team Deathmatch, Domination, and a clan system coming soon, we can easily see this game competing with the likes of Battlelands Royale in the future.Get Blastlands on Google Play.This new title from Oddrok – the developer behind Power Hover – is a top-down singleplayer casual racing game with nine different cars and no upgrades or confusing in-game currencies (thank you!).While there are only 30 levels so far, each of them are well designed and challenge you by alternating between two objectives: beat the time, or pick up all the letters scattered across the course. I’m really hoping Oddrok will add more levels and game-modes in the future, but this is is fun enough to try right now.Get Best Rally on Google Play.Fate of Nimi is a lovely new indie retro platforming adventure game with a polished art style that reminded us a bit of Sword of Xolan. It also has 10 infuriatingly difficult levels. I’m talking really, really difficult!The simple control setup is easy enough to get used to, but you’ll need some practice to master the odd jump mechanic. But overall, it’s a promising new indie platformer that just needs more content to make your must-play list.Get Fate of Nimi on Google Play.Ending this list with a blast from the past, we’ve got Cover Fire, which isn’t exactly brand new (it was launched in 2016), but it remains one of the highest-rated third-person non-moving-around shooters (that’s a term now, okay? :P) – and I genuinely enjoyed returning to it this week.With campaign, skirmish, and time-based events, the offline-playable shooter has you grind through levels with various characters, leveling up your skills in between missions, and increasing your base levels across all characters.Despite the graphics being a bit outdated, and the overall quality certainly not as high as online games like PUBG Mobile, Cover Fire is a decent offline shooter – as long as you can live with its energy system, which tries to limit our playtime (looking at you, mom!).Get Cover Fire on Google Play.Psst: If you want more great games, be sure to check out our previous roundups here.\nRead next:\n\n        Redefining commerce: The underappreciated, but growing prominence of online marketplaces    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}