{"id": "Cryptocurrency fraudster faces 5 years in prison for selling fake ICOsExplore our decentralized future", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Blockchain, cryptocurrencies, and insider stories by TNW.\n            Powered byBoth cryptocurrencies were shams - no blockchain, no diamonds, no real estateA Brooklyn-based businessman turned cryptocurrency huckster faces up to five years in prison for orchestrating two monstrously phony initial coin offerings (ICOs) last year.Maksim Zaslavskiy, a former institutional developer and “businessman,” plead guilty to two counts of conspiracy to commit securities fraud before a New York district court yesterday, reports FinanceFeeds.Zaslavskiy confessed to defrauding “around” 1,000 investors with a cryptocurrency called RECoin, marketed as the first ever cryptocurrency to be backed by real estate. He also sold special Diamond tokens that were supposed to be hedged by physical diamonds.Not only were both claims fake, but so were the tokens. There was never any blockchain technology powering either of them.“The calculated lies of Zaslavskiy and others led unsuspecting investors who thought they were purchasing cryptocurrency securities to buy worthless certificates,” said US district attorney Richard Donague.The court documents also detail how Zaslavskiy declared RECoin to have a “team of lawyers, professionals, brokers and accountants,” and that 2.8 million tokens had been sold, when really only 1,000 investors had been tricked into purchasing the bullshit certificates.FBI Assistant Director-in-Charge, William Sweeney, commented that Zaslavskiy and his goons dressed “old-fashioned criminal schemes in the language of new currency” in order to swindle cash from unsuspecting, newbie investors.The court also used this opportunity to issue a warning to the greater industry: simply labeling something a “cryptocurrency” does not magically transform it into a currency, and simply using this moniker does not allow projects to skirt the SEC’s strict laws related to securities.Zaslavskiy now faces up to five years in prison. Further, the SEC also filing related civil charges against Zaslavskiy, which are to be settled following the court’s criminal sentencing.\n                                    Published November 16, 2018 — 11:18 UTC\n                                \n                                        November 16, 2018 — 11:18 UTC\n                                    12 - 14 DECEMBER - ALL OVER LONDON Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}