{"id": "Xiaomi’s UK launch was a hilarious embarrassment", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Gadgets for humans\n            Behold, the omnishambles phone launch.Last week, Xiaomi formally entered the UK market. It’s an exciting development for the British phone-buying public. Not only are Xiaomi’s phones really good, but they’re also inexplicably cheap.There was no way Xiaomi could possibly screw things up. And yet, somehow, they found a way.First, a bit of background. As a launch promo, Xiaomi offered two models of its phones for the implausibly low price of just £1. This, obviously, is a bargain, and thousands of punters were champing at the bit to get their hands on one.However, it was unclear how many phones were available for just a quid. On this salient detail, Xiaomi kept shtum.Although both Gizmodo and Trusted Reviews covered the deal, neither offered any concrete numbers on how much stock was on offer, which suggests that Xiaomi neglected to mention it in the press release. Perhaps that was a deliberate maneuver on Xiaomi’s part because if people knew the truth, there would have been a lot less enthusiasm for the sale.That’s because according to the promotion’s terms-and-conditions, only three Mi 8 Lite phones were available during the first flash deal. You read that right. Three. Other flash deals only had two units available.These pocket-money phones were more scarce than gold dust. Or Hamilton tickets. Or Hamilton tickets constructed entirely out of gold dust. That didn’t matter though, as few bothered to read the fine print.Hundreds — likely thousands — of potential buyers logged on. They registered. They waited with anticipation. And ultimately they were disappointed, as the meager number of handsets sold out in a matter of seconds.Don't want to say that the #Xiaomi £1 phone was a publicity #scam, but I had 3 devices set up to access website on different networks and none of them saw the £1 price…— Christian Cawley (@thegadgetmonkey) November 10, 2018@xiaomi What a scam.How many phones did you have on the limited offer?As soon as the button turned green and you clicked on it it showed sold out. Shame on you.Xiaomi more like Xiaoscammi.Please explain.— Danny Frampton (@dannyframpo) November 10, 2018@xiaomi UK 1£ event! What a scam! All sold out in less than a second! Wow!— George Ivanov (@george_i81) November 11, 2018One user even looked into the site’s code, and found that it was set to show the phone as being sold out as soon as the sale began, without actually checking to see stock levels.@XiaomiUK_ Your promotion for the £1 phone was a scam. Looking at the logic and browser requests, there are no calls to check stock limits, you simply swap the text to show 'out of stock' once the timer expired. pic.twitter.com/4HxKFENufL— Phil Williams (@phil_williams81) November 9, 2018The company later clarified that that the phones would be sold on a lottery basis. Those who clicked the button closest to a pre-defined time will be placed into a pool, with “winners” selected randomly.Xiaomi had previously made no mention of a lottery, with the legal text for the promotion stating that phones would be sold on a first-come, first-serve basis.It goes without saying that people are utterly furious. Judging from the vitriol bubbling on Twitter, many have a bitter taste in their mouth. Deep down, they’re angry and feel misled.While I’d stop short at accusing Xiaomi of any deliberate wrongdoing (while the site’s source code is certainly fishy, the terms-and-conditions were pretty clear about the number of cheap phones available), I’d certainly say that they’re guilty of stupidity.You only get one chance at making a first impression, and Xiaomi really could have handled this one better. Given the company is entering a market for the first time, it would have been prudent to avoid doing anything that would engender ill-will or suspicion.At least their phones are good, eh?\n                                    Published November 12, 2018 — 17:17 UTC\n                                \n                                        November 12, 2018 — 17:17 UTC\n                                    Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}