{"id": "This is why women’s panties are trending on social media", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Tristan Greene\n            — \n                        in Social Media\nA women-led protest that began in Ireland has gone global. After a rape trial ended last week in a controversial acquittal, women took to the streets in a protest that’s now going viral with the hashtag #ThisIsNotConsent, and images of women’s underwear.Trigger warning: please be advised the following article contains frank discussion of rape and has embedded media with imagery and terminology that discusses rape and consent.  It’s called Hard Fork.An Irish man was acquitted of rape charges last week during a trial that centered on whether his 17-year-old accuser consented to their sexual encounter. The accused alleged the girl was a willing participant and that he wasn’t even sure intercourse actually took place due to his erectile dysfunction.Over the course of the trial, jurors heard evidence that, immediately after the encounter, the 17-year-old said to the accused “You just raped me.” His reply, reportedly, was “No, we just had sex.”During her closing remarks, the attorney for the accused, Elizabeth O’Connell, implored jurors to consider the way the child was dressed as evidence of her consent:Does the evidence out-rule the possibility that she was attracted to the defendant and was open to meeting someone and being with someone? You have to look at the way she was dressed. She was wearing a thong with a lace front.Outraged by the implication that wearing a certain type of underwear indicates a person has given their consent to a sexual act, women around the world are posting pictures of their panties in protest.Jurors in Cork were asked to consider the underwear a SEVENTEEN YEAR OLD GIRL was wearing when she was raped by a 27-year-old man.Join the cause in solidarity, can’t believe this girl was subjected to these comments after such a traumatic event.#ThisIsNotConsent #Ibelieveher pic.twitter.com/PfkYERulgY— Courtney Peterson (@_courtneymaria) November 13, 2018Most of my underwear has lace on it. This doesn’t mean I want to be raped. No matter what I wear, no means no!! #ThisIsNotConsent pic.twitter.com/dUBaA702oS— Clàudia 🎗️ (@catalanaalcor) November 14, 2018Irish politician Ruth Coppinger took to the floor of the Dail – parliament, for the rest of us – on Tuesday to bring the issue up before the assembly.I hear cameras cut away from me when I displayed this underwear in #Dáil. In courts victims can have their underwear passed around as evidence and it's within the rules, hence need to display in Dáil. Join protests tomorrow. In Dublin it's at Spire, 1pm.#dubw #ThisIsNotConsent pic.twitter.com/DvtaJL61qR— Ruth Coppinger TD (@RuthCoppingerTD) November 13, 2018A government review of rape trial procedures is reportedly underway in Ireland but, as social media has shown, the issue isn’t just a local one.In fact, fifteen years ago in Scotland, 17-year-old Lindsay Armstrong took her life after she was forced to hold up her own panties during her rapist’s trial. Her mother, Linda Armstrong, told BBC News Scotland earlier this year:It’s quite sad that there is still plenty of chance for people to go through what Lindsay went through. I feel like they are not taking it seriously enough.The conversation about consent is no longer avoidable by citing a case-by-case basis and ignoring uncomfortable questions, thanks, at least in part, to the endless reach of social media. And the idea that some people are “asking for it,” likely won’t survive intelligent discourse.As Irish Prime Minister Leo Vradkar put it:Nobody asks to be raped. And it’s never the victim’s fault. It doesn’t matter what you wear, it doesn’t matter where you went, who you went with, or what you took — whether it was drugs or alcohol.\n\nCounsel for man acquitted of rape suggested jurors should reflect on underwear worn by teen complainant\non The Irish Examiner\n\n\nRead next:\n\n        Report: People are going to have a lot of sex in self-driving cars    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}