{"id": "Mobvoi’s TicWatch C2 is a classy Wear OS smartwatch for $200", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Gadgets for humans\n            But it still runs on the old Qualcomm 2100 chipsetMobvoi has a new smartwatch on the way: The TicWatch Classic 2, or C2 for short. Fittingly enough, it’s one of the classier Wear OS smartwatches we’ve seen to date – Mobvoi already has some solid entries under its belt – and it comes in at a relatively affordable price of $200.It’s a pleasantly spartan design available in 18mm and 20mm wristband sizes, and it comes in rose gold, black, or platinum. Somewhat disappointingly, rose gold is only available on the smaller size; a rose gold watch with a blue strap is one of my favorite color combinations on my chunky wrists. That caveat aside, it’s a good-looking device, and I really dig some of Mobvoi’s analog watchfaces here.Otherwise, it’s typical Wear OS fare. There’s a heart rate sensor, a 400 mAh battery good for two days, GPS, and NFC for payments. Unfortunately, it’s stuck on the years-old Snapdragon 2100 platform – just as devices are set to start shipping with Qualcomm’s 3100 chips later this year.I dig the design, but that older chipset makes it a tougher pill to swallow. Then again, I’ve never really had problems with the older chipset’s performance on recent versions of Android Wear and Wear OS; I mainly would’ve appreciated the extra battery life from the more efficient hardware.You can pre-order the TicWatch C2 from Mobvoi’s website starting today for $200; the watches will ship the first week of December.\n                                    Published October 24, 2018 — 19:50 UTC\n                                \n                                        October 24, 2018 — 19:50 UTC\n                                    Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}