{"id": "Twitter is sorry about that whole ‘Kill all Jews’ thing", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Bryan Clark\n            — \n                        in Social Media\nMany New Yorkers awoke to a bit of a surprise when “Kill all Jews” briefly made an appearance in their Twitter sidebar.On a social network with a hate speech problem, it’s not unusual to see this type of content. Twitter has been locked in a perpetual grappling match with hate groups clinging to the fringes of society — those most often responsible for creating vitriolic content — for some time now. What is surprising, however, is seeing Twitter amplify the message itself.Visit Hard Fork.Credit: BuzzFeed NewsFirst spotted by BuzzFeed News, the Trending Topic made a brief appearance lasting 10 minutes or so for the users who saw it. And not everyone did. The topic, reportedly, only appeared in the sidebar of some New York residents’ feed.The phrase, recently, has been the subject of discussion after a Brooklyn synagogue was vandalized prior to the appearance of Broad City co-creator Ilana Glazer. An unknown person, or persons, littered the synagogue with anti-semitic graffiti, such as “die Jew rat,” etchings of “iset oven here” (presumably meant to be “insert”), and at least one mention of “Hitler.” A NYPD spokesperson confirmed the message contents.“The phrase should not have appeared in trends, and we’re sorry for the mistake,” a Twitter spokesperson said in a statement. “This was trending as a result of coverage and horrified reactions to the vandalism against a synagogue in New York. Regardless, it should not have appeared.”This follows the killing of 11 people at a Pittsburgh synagogue just one week prior.For Twitter, it’s a one-off screwup, an algorithmic error that pushed a popular news story into Trending Topics, as it’s designed to do. But it couldn’t have come at a worse time.Human editors, which Twitter employs, should have prevented the mistake from happening at all. So, while it might not be worth breaking out the pitchforks and torches just yet, it is worth questioning whether Twitter is doing enough to prevent this type of thing from happening in the first place.\nRead next:\n\n        Watch: US Navy shoots down a (fake) nuclear missile in space    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}