{"id": "The Bitcoin Cash hash war has no real winnersExplore our decentralized future", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Blockchain, cryptocurrencies, and insider stories by TNW.\n            Powered byThe hash war continuesYesterday, the Bitcoin Cash BCH (BCH) blockchain split in two separate networks, each kicking off a new cryptocurrency.Now that Bitcoin Cash has forked into two rivalling cryptocurrencies – BAB, maintained by Bitcoin-ABC, and BSV, maintained by Craig Wright’s nChain – it remains to be seen which network will surface as the dominant chain.But before we dive into the initial fallout from the split, we need to address what factors go into determining what qualifies as the “dominant” chain.There are two main schools of thought when it comes to determining the health of a blockchain – the height of its ledger (or the total number of validated blocks) and the amount of work done to keep the chain secure (or the cumulative computing power it has generated for solving puzzles so far).From this perspective, two of the most important factors to consider are the number of blocks mined (after the hard fork) and the hash rate possessed by each network.Let’s start with the hash rate.Even though most miners had initially indicated they will support nChain’s SV implementation (see image above), ABC quickly took the lead in the subsequent hash war.While the numbers have varied significantly in the immediate aftermath, blockchain explorer Coin.Dance indicates that ABC commands 58 percent of the computing power, followed by SV’s 42 percent.It’s worth pointing out the numbers might not be entirely accurate, with many industry insiders speculating there might be quite a bit of shadow mining taking place in the background.Whatever the case is though, ABC seems to be edging out SV when it comes to hash power – at least for the time being.Similarly, ABC is winning the block height game too.At the time of writing, its chain has 30 more blocks than SV’s. For the record, there has been a total of 171 mines blocked since the chain first split.The most concerning development is that it appears both newly-spawned Bitcoin Cash forks are currently losing from the split.Most exchange services have temporarily halted Bitcoin Cash trading until consensus has been reached about the hard fork, but chances are both cryptocurrencies will experience a significant drop in price.To make matters worse, miners are validating transactions at a loss. According to estimates from Bitcoin developer Jimmy Song, both chains are losing about $500,000 in opportunity cost each day. (It should be noted some of those estimates might not be entirely accurate.)In the meantime, exchanges are still mostly sitting on the sideline, waiting out to see which chain it makes more sense to support in the long run. Of course, some exchanges like (Binance and the controversial Bitfinex) have already announced intentions to support both implementations.So who is really winning the Bitcoin Cash war? It is difficult to say – but neither side seems willing to concede defeat.Logging off for the day. No more updates to my article (https://t.co/01r9sza3n3) or the @BitcoinMagazine Twitter feed.TL;DW so far: BCH split in 2, ABC chain much longer and more valuable on (futures) exchanges. No 51%-attack. ABCers feel victorious, SVers don't concede defeat.— Aaron van Wirdum (@AaronvanW) November 16, 2018Anyone interested in a more detailed explanation of the Bitcoin Cash network split ought to head to our extended breakdown.\n                                    Published November 16, 2018 — 15:42 UTC\n                                \n                                        November 16, 2018 — 15:42 UTC\n                                    12 - 14 DECEMBER - ALL OVER LONDON Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}