{"id": "Fickle Fallout 76 beta refuses to be uninstalled on PC", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Rachel Kaser\n            — \n                        in Gaming\nYou know, Bethesda, when you mentioned there would be issues with Fallout 76, I thought it would be one of your fun ones — you know, where locations have items floating in the air, or the NPCs heads rotate on their shoulders like The Exorcist. Something wholesome and harmless, yeah?But thus far, Fallout 76‘s run on the market is plagued with bugs that are honestly getting a little difficult to laugh off. First we had that situation where the whole beta was mysteriously deleted for some users. Now, perhaps with a touch of irony from the universe, some players can’t get rid of the beta no matter how hard they try. It’s called Hard Fork.As reported by VG247, PC beta players on Reddit began to notice an interesting problem with the Bethesda launcher. Namely, every time they tried to uninstall the beta, they were told they didn’t “have access to this game.” The pop-up also says to be sure you’re signed in with the account “associated with the purchase of this game.”Naturally, this made some users say, “Hang on a minute… purchase?” — taking this to mean they won’t actually be able to delete the game unless they pay for it. That said, even some players who did buy the game report they still can’t uninstall the beta.I’m assuming these are the “all new spectacular issues” Bethesda promised when it launched the beta. At least, I sincerely hope even if the former users are right (and purchasing the game does make the beta uninstall-able) that this is a bug and not a passive-aggressive way to try and make sure all beta players purchase the game.There’s also a chance this issue will vanish when the beta officially ends with the release of the game on November 14, when the servers go live, although we won’t know for sure until November 14. Either way, the fact this beta doesn’t seem to want to leave is fitting.via PCGamesN\n\nFallout 76 beta can’t be uninstalled unless bought\non VG247\n\n\nRead next:\n\n        Stan Lee, comic book writer extraordinaire, has died    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}