{"id": "The week’s best Android games to play while putting off your holiday shopping", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by NimbleThor\n            — \n                        in distract\nWelcome to our weekly column, in which YouTuber NimbleThor brings you a short list of the best new mobile games for your Android device. Whether you’re into casual time wasters or hardcore shooters, you’ll find something in here to exercise your thumbs with.Listen, the holiday season as the end of the year is great and everything. But sometimes, you just need an excuse to avoid your friend Christy, who, for some reason, believes it’s appropriate to listen to Christmas carols and drink eggnog in mid-November while shopping for gifts online. It’s a no from us, Christy, so just stop it!Hard Fork.Luckily, we’ve got just the cure: a bunch of addicting Android games that you can dive into and avoid any holiday-related activities until it is ACTUALLY Hanukkah/Christmas/Festivus. Here we go!Toy Odyssey is a difficult 2D Metroidvania-style action platformer with rogue-like elements, which means you can play an unlimited number of randomly generated levels. The game takes place in a beautifully hand-drawn house in which a bunch of toys have come to life (Toy Story, anyone?). You take on the role of an action figure trying to defend the house against the evil toys who have taken over.The core gameplay of going on an adventure and solving varied puzzles in the house’s’ many rooms is enjoyable, and the character controls work great (which can’t be said for all mobile platformers).However, the challenges can get difficult, and combat isn’t particularly interesting, so you might give up on the huge grind required to finish the game. Still, it’s a unique experience that’s worth a go if you’re into platformers.Get Toy Odyssey on Google Play.Tacticool is a new fun casual 5v5 “tactical” shooter that mixes a Dota 2-like isometric third-person view with Battlefield-like combat. It boasts easy-to-learn gameplay, lots of weapons, and vehicles that you can even drive around the small map and shoot from. The game is fast-paced and intense, and playing as a team makes a huge difference between winning or losing.You can train offline with bots, and get into one-minute-long online matches with friends or random players for a quick break. It also features an excellent control system – arguably one of the best I’ve tried on a mobile shooter lately – and that makes this a joy to get into and play often.Get Tacticool on Google Play.ReversiQuest2 is an old-school singleplayer fantasy RPG with SNES-like graphics based on the strategy board game Reversi. That means you’ll take turns placing units on a grid-based map, and dealing damage or healing your team whenever you surround an opposing unit, and convert them to your side (turn to the dark side, Luke!).The maps often include interesting traps and treasure chests, and in between rounds of deep combat, you can explore a dungeon-like world to pick up new items from chests to boost your chances of winning.The strategic combat is great, and the RPG elements are satisfyingly deep, with items and potions modifying a wide range of character stats. The first few levels are free, with the full game unlocking at $8, which should provide around 20 hours of gameplay according to the developer. It’ll also get more content later this month.Get ReversiQuest2 on Google Play.FPS.io is a casual and fast-paced shooter that mixes the quick matches of “.io” games with a blocky art-style and third-person shooter combat. It’ll see you fight against seven opponents in a thrilling everyone-vs-everyone game mode. If you’re looking for fun battles that you can quickly hop into, this is a good way to go.Get FPS.io on Google Play.Knights of Fury is a casual – yet surprisingly deep – RPG by King with a great art style. But wait a sec! King? Yes, King, the makers of Candy Crush. It’s made an RPG, and it’s actually rather enjoyable. Who would’ve thunk it?The game has you travel along a path around a fantasy universe (think the Candy Crush level screen), with levels, bosses, and shops along the way. You’ll want to watch the video above to get a better idea of the turn-based combat system works, so you can get a grip on tackling all the unique enemies you’ll encounter.The game also has guilds, random enemy encounters, boss fights, a ton of items to unlock and upgrade, a fully-fledged potion system, and so much more. Color me impressed!Get Knights of Fury on Google Play.Phantomgate is a Norse Mythology-inspired turn-based RPG mixed with platformer and gacha elements, which makes for a fun and surprisingly fresh take on the role-playing genre.The English voice-over is phenomenal, and the story had me hooked right from the start. The core gameplay sees you take four heroes into combat, each with unique skills, and opportunities to level them up as you progress. If you’ve never played a gacha RPG before, this one is worth starting off with at the great low price of free.Get Phantomgate on Google Play.Psst: If you want more great games, be sure to check out our previous roundups here.\nRead next:\n\n        Blockchain hard forks explained as quickly as possible    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}