{"id": "Facebook’s former PR firm seeded fake stories about bias at Apple News", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Bryan Clark\n            — \n                        in Insider\nFacebook‘s recently-fired PR firm allegedly floated a story to journalists that Apple News was biased against Republicans. The company, Definers Public Affairs, made headlines this week after a bombshell New York Times report revealed that it was employed by Facebook to dig up dirt on critics and competitors. One of these competitors, according to documents obtained by CNN, was Apple News.Apple’s News app is pre-installed on all iOS devices, and features human editors working with AI to curate stories in a range of topics, from business, to fashion.Hard Fork.According to CNN, the company pitched a story titled “Apple News Curators’ Political Donations” to at least one reporter this summer. The firm, seemingly, was attempting to make a case that human editors suppress conservative viewpoints on the app, and it could prove this allegation based on a history of their political donations.“30 individuals have been identified as working for Apple in media curation roles or specifically at Apple News,” the document read. “Five of these individuals have contributed to Democratic candidates or causes.” There was little additional evidence to back the claim, nor was there proof that the people listed were Apple News employees rather than others with similar names.One possible employee donated $55 to Democratic candidates and causes in 2018. Another, Definers claimed, made $11,500 in donations, although the firm notes that it can be certain that it’s the same individual that works for Apple News, or just someone who shares their name.The evidence was not very compelling, according to CNN.In a statement released this morning, the company said:To be clear: Definers was not hired by Facebook as an opposition research firm. That might be the sexy story for media outlets because several of us have spent years doing research and communications for high-stakes political campaigns, but that was not the scope of the work we had for Facebook.In fact, Definers’ main services for Facebook were basic media monitoring and public relations around public policy issues facing the company. We ran a large-scale news alert service keeping hundreds of Facebook staff informed on news stories about the company and its policy challenges.Some of these policy challenges were directly tied to the allegations made against Apple News. Facebook, often accused of bias against conservative voices itself, fired its trending team, a group of human editors designed to maintain control of an algorithmic system for supporting its trending topics. This group had been accused of bias before, with one worker speaking out and alleging that Facebook conservative viewpoints in an interview with Gizmodo.It didn’t work. Days later, algorithms surfaced a fabricated story that Fox News anchor Megan Kelly had been fired after pleading her support for Hillary Clinton.For its part, Facebook executives Mark Zuckerberg and Sheryl Sandberg denied knowing that the company had even hired Definers.Facebook wasn’t immediately available for comment.\n\nFirm that worked for Facebook tried to plant story alleging liberal bias at Apple News\non CNN\n\n\nRead next:\n\n        This is why women's panties are trending on social media    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}