{"id": "Japan wants to regulate cryptocurrency wallet servicesExplore our decentralized future", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Blockchain, cryptocurrencies, and insider stories by TNW.\n            Powered byBut not all types of walletDespite granting the industry self-regulatory status, it seems Japanese regulators are still keen to keep an eye on things.The Japanese Financial Services Agency (FSA) recently announced that it is devising a regulatory framework for cryptocurrency wallet services, Bitcoin News reports.While the industry may now be left to police and regulate itself, cryptocurrency exchange businesses must still be registered with the country’s FSA as they buy and sell virtual currencies. However, as cryptocurrency wallets don’t technically provide a trading service to customers they are currently in a regulatory gray-area.As  wallets are required to trade cryptocurrency, FSA lawmakers believe they should be appropriately regulated.It should be noted that not all wallets will be affected by this proposal, rather the regulations are designed to apply only to custodial wallets – wallets that are maintained and controlled by a third-party. Software and hardware wallets will not fall under this regulatory framework.The regulations will be designed to satisfy international standards for anti-money laundering and anti-terrorism financing, and police some of the risks associated with wallet services, like hacks, theft, and failures. The regulations will then most likely require wallet providers to have know-your-customer (KYC) policies in place.When these regulations will be implemented and enforced has not been disclosed. But it has has been made clear than any cryptocurrency wallet service provider that does not adhere to the rules will be forced to shut-up shop, or will be operating illegally.Sadly, there will always be those that do operate outside of the law, and Japan is no stranger to dealing with its own fair share of cryptocurrency hacks and scams.Earlier this week Tokyo police arrested a group of eight in connection with a $68 million Ponzi scheme. In September it was revealed that Japan lost over $540 million to cryptocurrency hacks in the first half of this year.\n                                    Published November 16, 2018 — 09:50 UTC\n                                \n                                        November 16, 2018 — 09:50 UTC\n                                    12 - 14 DECEMBER - ALL OVER LONDON Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}