{"id": "Violent videos put journalists at increased risk of post-traumatic stress", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by The Conversation\n            — \n                        in Syndication\nNewsrooms across the UK are finding themselves increasingly under-resourced. Less journalists and constrained budgets has meant many editors now rely on their staff to use more information from digital sources – such as social media.But as more journalism work relies on – or at least incorporates – potentially violent or harmful user-generated content, the risks of post-traumatic stress disorder (PTSD) in journalists has increased. This can lead to short, unpleasant careers and, in severe cases, long lasting mental health risks.It’s our cool new gadget site.PTSD is more commonly associated with combat situations or war reporting – but anyone can develop post-traumatic stress after being involved in, or witness to, a traumatic event. And this can even happen when the traumatic event is witnessed through social media.New research shows that neither UK universities, nor newsrooms, are adequately preparing their students or staff for these potential risks. Nor are they informing them as to how to seek support when confronted by the symptoms of PTSD.The research, which examined 63 undergraduate journalism-related courses from a 61 universities across the UK, found that many courses are not teaching students about the risks of PTSD within the job.The mental health charity Mind, has previously noted that newsrooms are workplaces that increasingly revolve around high stress levels thanks to staff cuts, tight deadlines, long hours and erratic shift patterns. The charity reports that lone working and poor relationships with colleagues are most frequently to blame for stress.But there is also evidence that violent user-generated content – such as graphic videos – are posing additional risks to journalists. The effects of having to work with this disturbing material can be just as pronounced as first-hand experiences of war or reporting on humanitarian crises. Jenni Regan, from the mental health charity, Mind, explains:We know of court and crime reporters tasked with covering horrific crimes or newsroom producers having to view hours of disturbing footage who report signs of secondary trauma.Many media organizations now have systems to support those returning from situations such as war zones, but there are others who may be experiencing this trauma with little or no support offered.But while the research found that many educators do want to focus more on the psychological risks posed to journalists, a number of institutional factors make this difficult.Lack of training and time, as well as worries over duty of care and insufficient resources were all mentioned as reasons why these risks aren’t presently covered. This results in less than 1% of UK courses including information on trauma or PTSD.The study expresses concerns over the preparation of students for this sort of work and also noted that most journalists are not provided with adequate on the job training or support.The research also reveals that universities often believe students will receive adequate training in the workplace – while employers expect graduates to have already covered topics of concern on such courses.It’s clear then that a greater awareness of the potential risks of working with harmful online content is needed – at both universities and in the newsroom.And staff and journalism students need to be more aware of the wider implications of looking at graphic content as part of their job.Mental health provision must also be made available to journalists, and training must be made available for those working remotely – just as it is for war correspondents.Journalists face psychological trauma from producing news even when they are distant from the scene of violent incidentsThe risks and demands placed on journalists must become a core part of training. And news organizations must also provide adequate support for staff before, during, and after working with this type of content.The charity Mind suggests media organizations could also offer a buddy system for journalists to share their experiences. This would help to encourage a work environment that is open and honest around mental health.As resources become stretched in both universities and newsrooms it is imperative that the mental health of journalists is not overlooked. Instead, training on the potential risks of vicarious trauma from online content must be available – throughout all stages of a journalist’s career – from university to the newsroom, and beyond.This article is republished from The Conversation by Doug Specht, Senior Lecturer in Media and Communications, University of Westminster under a Creative Commons license. Read the original article.\nRead next:\n\n        Netflix tests ads: No need for drama    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}