{"id": "OnePlus pushes its 6T launch event up to avoid Apple overlap", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Gadgets for humans\n            New Apple gear would've overshadowed the 6TWe’ve known for a while that the OnePlus 6T would launch on October 30. It’s set to be OnePlus’ most ambitious device to date, with pre-launch coverage pointing to a smaller notch, and in-display fingerprint reader, and official carrier support via T-Mobile.But then Apple announced it was hosting an event the same day.For all of OnePlus’ popularity, it’s still no Apple. Making matters worse, Apple’s event would be held in New York, meaning a lot of journalists would potentially have to double up on coverage. So OnePlus did the best it could do when dealt with a bad hand – it moved the event up by one day, to October 29.In a blog post, OnePlus’ Pete Lau said the decision wasn’t taken lightly, but it ultimately made the most sense. Journalists would have to divide their attention, and chances are OnePlus would get the short stick.Also of note, unlike Apple’s event, OnePlus’ is open to fans as well, and some bought tickets to fly into New York for the launch. Lau says those fans can apply for a refund to their flight tickets or hotel dates.As one of the many tech journalists who has to cover both events, I have one comment: Thank God.\n                                    Published October 19, 2018 — 19:58 UTC\n                                \n                                        October 19, 2018 — 19:58 UTC\n                                    Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}