{"id": "Review: Tetris Effect is my new favorite drug", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Nino de Vries\n            — \n                        in Gaming\nThere’s nothing like Tetris. Invented 33 years ago, Tetris barely needed evolve thanks to its simple ingenuity. It’s meditative and infuriating at the same time. It induces anxiety, but it also helps people that struggle with that same anxiety. You don’t need to tell anyone Tetris’ rules, because they are so simple and intuitive that anyone can quickly deduce them, simply by looking at the game in action. It’s called Hard Fork DecentralizedTetris’ appeal hasn’t gone lost on Tetsuya Mizuguchi. The influential Japanese game designer behind titles like Rez, Every Extend Extra and Lumines, is back from his short hiatus and he made a Tetris game. Mizuguchi is known for combining trippy visuals, pumping soundtracks and addictive gameplay.His games look like a stroll through Tokyo’s neon-drenched streets, on a designer drug that hasn’t been invented yet. They’re mesmerizing in a way that no other game is. Needless to say, I was beyond stoked when I first found out that Miz’ first new original game since 2011 was a Tetris adaption.Tetris Effect came out last week and I can’t stop thinking about it. It’s exactly what you would expect of a Mizuguchi Tetris game. It’s the Tetris we all know and love, plastered onto over 30 different trippy stages.The visuals, the music, the sound effects, and the controller vibration all respond to your inputs, slowly slipping you into a trance-like state while you arrange your blocks to form lines. The game’s main mode takes you on a journey through all the stages, increasing the tempo – and thus the difficulty – as you progress.I couldn’t stop playing the first night I got my hands on Tetris Effect. I loved Tetris when it was monochrome and simple on the Gameboy. I love Tetris even more when it has Mizuguchi’s special sauce all over it. Tetris is easily the best way to experience Tetris (by yourself). I deeply regret selling my PlayStation VR headset because I hear that the VR support in Tetris Effect is amazing. Ah well.There’s one thing that irks me about this game though; it’s a pretty barebones package for a $39.99 game. Sure, it has a ton of stages and a fair bit of different marathon and challenge modes, but that’s about it. It has leaderboards with weekly challenges, but no multiplayer at all, not even local. Tetris Effect would’ve been perfect as a party game if it let you play against your friends. Turn off the lights, turn up the volume and compete. But alas, it’s a completely solo affair.Tetris Effect is an easy recommendation for anyone who’s looking to play an amazing version of Tetris. The lack of multiplayer is a bummer, but the amazing audiovisual experience makes up for it. And $39.99 is still cheaper than most drugs.\nRead next:\n\n        Here’s how blockchains could be ruined by personal data    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}