{"id": "Redefining commerce: The underappreciated, but growing prominence of online marketplaces", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Brian Solis\n            — \n                        in Contributors\nSince the launch of eBay in 1995, Etsy in 2005, AirBnB in 2008, Uber 2010 and so many other game changing startups,digital marketplaces have fundamentally transformed the commerce landscape and will only continue to do so. By 2020, marketplaces around the world will account for 40 percent of the global online retail market. Traditional retailers are also recognizing the opportunity, as well as the need, to invest in marketplaces if they’re to compete against the growing and expanding array of modern commerce brands, next-generation startups and of course, Amazon, Alibaba and other digital behemoths investing in marketplaces. And yet, very little research and analysis has gone into understanding the dynamics and trajectory of these disruptive players or to forecast what’s next.It’s in London from December 12-14Marketplaces are more than digital venues for hosting sellers and attracting customers. Marketplaces are changing market dynamics and pushing sellers and service providers to rethink their missions, value propositions and overall experiences. And yet the path to success for today’s digital marketplaces isn’t well understood. Back in 2012, renowned VC Bill Gurley penned his landmark guide on how to evaluate the potential success of a new marketplace opportunity, much of which rings true to this day. Except that six years later, thanks to the steady drumbeat of new technology developments and shifting consumer behaviors, the digital marketplace opportunity is bigger than ever—and not just for investors. That’s why this year, Altimeter set out, in partnership with Kahuna, to get a handle of both the current “state and future of digital marketplaces.” It’s the first report in this space and it’s free to download.In surveying marketplace executives, my team and I found that, while marketplaces today face very traditional challenges around issues like retention, these business have been underappreciated in their role in reshaping commerce. And indeed, they are poised to again redefine next-generation experiences for consumers and businesses alike.Gross merchandise volume (GMV) — the total value of merchandise sold to customers through a marketplace — is considered one of the most important business metrics for marketplaces. In our survey, the majority of marketplaces (35 percent) reported GMV of $500 to $999 million. Only 12 percent reported over $1 billion in GMV. In addition, 25 percent reported GMV of $250 to $499 million, and 19 percent reported $50 to $249 million.The four top challenges facing marketplaces are competitive differentiation (39 percent), buyer retention (32 percent), buyer acquisition (29 percent), and effective social media campaigns (29 percent).Retaining sellers requires marketing on behalf of marketplaces, and integrated platform services offer opportunities for merchants to create standalone value. Sellers disengage from marketplaces because platforms don’t provide “growth as a service.” The three main reasons for seller disengagement are insufficient competitive differentiation (46 percent), insufficient sales (33 percent) and marketplace service fees (31 percent). Additionally, sellers claim that marketing costs (28 percent) and the lack of buyers (26 percent) are critical business issues. The majority of marketplaces claim that the concentration of sellers driving 80 percent of transactions ranges between 40 percent to 60 percent.Almost half of all marketplaces say that repeat customers account for upwards of three-quarters of all transactions, and one-third say repeat customers are responsible for half of all transactions.Get ready for ‘The Platform Economy’. In relatively short order, the term “marketplaces” will cease to encompass the role that these entities truly play in society. Rather, marketplaces are evolving into holistic platforms. They’re enhancing product and service models and experiences between what sellers offer and what buyers demand. As they grow, general and nuanced marketplaces will become go-to discovery hubs. Customers are already exhibiting behavior that not only complements but expands search and discovery beyond Google and YouTube. Yes, that’s right: Marketplaces are becoming discovery engines. While consumers may want greater choices, they also want simplicity, utility, integration and value-added experiences. As a result, marketplaces will look beyond connecting buyers, sellers and service providers. They’re going to be looking to create platforms that deliver complete experiences as their core product or service. How marketplaces develop solutions for holistic experiences will become the next competitive advantage for them. As these experiences become more valuable, the trust and loyalty that’s earned among consumers becomes stronger. And, with that stronger loyalty comes a greater exchange of mutual value across the board. This post is part of our contributor series. The views expressed are the author's own and not necessarily shared by TNW.\nRead next:\n\n        Call of Duty: Black Ops 4 posts $500M sales and it's still a disappointment    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}