{"id": "Chrome 70’s best new feature is picture-in picture", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Napier Lopez\n            — \n                        in Insider\nPicture-in-picture has been available in Android for a while now, allowing you to watch a YouTube or Netflix video while doing other stuff. Now that same feature is coming to Chrome on the desktop.The feature has technically been available for a couple of months in the Chrome 69 beta, but Chrome 70 makes PiP public.Visit Hard Fork.It works like this: Open a video, right click on it, and select picture-in-pitcure. Your video will be transferred to a floating window.. You can resize or move it to your liking, and it will remain on top of all your other apps and windows as you go on about your business.The only caveat: Developers have to enable the feature first. Still, with YouTube Support already available, I imagine it won’t be long until other video providers follow suit.The feature is available with Chrome 70 on Windows, Mac, and Linux now. Ironically, it’s not quite rolled out to Chrome OS yet, but I’m guessing it won’t be long.Via Android Police\n\non Google\n\n\nRead next:\n\n        An entrepreneur's guide to Mexico City's tech scene    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}