{"id": "Tech companies are using machines to fight terrorism and hate speech, and you can do it too for $49", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by TNW Deals\n            — \n                        in Offers\nMachine learning isn’t just building robots and self-driving cars. In fact, machine learning and the principles of artificial intelligence refining and policing itself might be the next great frontier for many industries.Case in point: Facebook is utilizing machine learning to better assess and remove terrorist propaganda posted by Al Qaeda or ISIS on the social platform. Facebook claims their computer-driven process has gotten so good that content espousing terrorist messages are spotted and automatically deleted in under 2 minutes. That process used to take up to 14 hours just a few months ago. It’s called Hard Fork.If you understand how machine learning works, then you can get working too — at a pay rate a fair cry above what you’re making now, we’re guessing. The Machine Learning Masterclass Bundle ($49, an 89 percent savings, from TNW Deals) takes you inside this exploding tech sector.While it may sound impossible for you to create a programming that actually thinks and makes decisions for itself, this 50-plus hours of coursework will likely have you thinking overwise.With the training in these courses, students will explore building their own neural networks, the cornerstone concept behind artificial intelligence. The courses give instruction in understanding data science, visualization and analysis as well as how to code it all using Python and R Programming languages.Meanwhile, the academic learning is coupled with practical hands-on exercises to help bring the training to life. From building your own 3D game to training using algorithms for credit card fraud detection, object recognition and more, this is active real world training that makes machine learning itself real — and something you could even see yourself doing as a career. A $449 value, save $400 if you get the complete bundle now before this deal runs out.\nRead next:\n\n        The week's best Android games to play while putting off your holiday shopping    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}