{"id": "Samsung’s foldable ‘Galaxy F’ will reportedly launch next March – and it’ll be pricey", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Gadgets for humans\n            Calling all early adopters with money to burnAfter Samsung teased its foldable phone at an event last week, South Korea’s Yonhap News Agency reported today that the company plans to launch the device in March 2019 – with a hefty price tag.The phone is expected to be named the ‘Galaxy F’ and cost roughly $1,770. The official unveiling will follow that of the company’s Galaxy S10 flagship in February. Samsung hopes to sell a million units of its foldable handset.Yonhap noted that alongside the Galaxy F, we’ll also see a 5G-capable version of the S10 in March.If the report is accurate, the Galaxy F will be one of the most expensive phones you’ll be able to buy from a mainstream brand next year; it’s nearly double the price of the biggest phones of 2018, and there aren’t likely to be many devices that will bridge the price gap in the few months left until next March. Yes, there are pricier models already, like this $2,700 doodad, but those are for crazy people.Still, it’s no surprise that a product with a brand-new technology will initially only attract enthusiastic early adopters, and be priced accordingly.We don’t know much more about the Galaxy F, but Samsung did reveal that it sports a 7.4-inch screen when unfolded, and have a 4.6-inch display like a regular smartphone when folded. At an Android Dev Summit event, Samsung Mobile engineering director Jisun Park noted that the unfolded screen will have a resolution of 1536 x 2152 pixels, at 420 dpi.He added that the idea is to use the phone in its folded state for quick tasks, like making calls, reading messages, and looking up maps; when unfolded, the device is said to allow for a seamless experience that expands the functionality of the apps you use, and support multiple windows simultaneously (for responding to messages while watching YouTube side-by-side, for example). Android will soon natively support foldable devices, so hopefully this will all work as advertised.All eyes will be on the South Korean giant next year to see if it can make foldable phones a thing; if this doesn’t pan out, Samsung can continue to make expensive flip phones that are, for all intents and purposes, foldable, and call it a win.\n                                    Published November 12, 2018 — 10:48 UTC\n                                \n                                        November 12, 2018 — 10:48 UTC\n                                    Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}