{"id": "Blockchain hard forks explained as quickly as possibleExplore our decentralized future", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Blockchain, cryptocurrencies, and insider stories by TNW.\n            Powered byYou won't find a more concise explainerWelcome to Hard Fork Basics, a collection of tips, tricks, guides, and advice to keep you up to date in the cryptocurrency and blockchain world.Cryptocurrency forks are as inevitable as death and taxes. You might have seen recent news detailing the contentious Bitcoin Cash hard fork, and be wondering what a fork actually is.While every hard fork comes with its own nuances and intricacies, beneath all that is a fairly concrete principle for what a hard fork is and what it is supposed to do. This article will try to explain, as simply as possible, what a hard fork is.Before we dive in and start talking about hard forks it’s useful to remember how blockchains are structured. Put simply, a blockchain is a series of verified and chronologically ordered cryptocurrency transactions organized into blocks. These blocks are added by a process called mining.The transactions of one blockchain will relate to one specific cryptocurrency or token. Naturally, each of these has its own set of rules that dictate how transactions are verified, how many can be verified in each block, and so on. These rules must be followed if you want to mine a specific coin and blocks to that blockchain.Quite simply, if you don’t like the rules, you can change them, and in doing so “fork” the existing blockchain.When you make a hard fork, you are making a new blockchain, with new rules that are not compatible with older versions. As a result, an entirely new cryptocurrency will be created.You might think that your cryptocurrency needs bigger blocks to try and lower transaction fees. If some devs agree, and others don’t, you can take the codebase of the original blockchain, update it to allow for larger blocks, and roll out the update to fork the blockchain. It’s then up to the community to decide which blockchain to support: the old one, or the newly “forked” one, or both.This is what happened with Bitcoin back in August 2017. A group of developers decided the cryptocurrency needed bigger blocks after transaction fees for the original Bitcoin were getting out of hand. So they wrote a new protocol, started a new blockchain, and with it a new cryptocurrency, Bitcoin Cash.Fundamentally, when developers instigate a fork, all they are doing is updating, changing, or rewriting the software code that makes a cryptocurrency work.You might have also heard of “soft forks.” While soft forks operate on the same premise as hard forks, there is one key difference. In a soft fork, the resulting software update is backwards compatible with older versions. In soft forks, there is no new cryptocurrency created, and for the most part business will continue as normal.Now, next time your favorite coin is talking about “forking” you’ll hopefully know what they’re talking about.\n                                    Published November 16, 2018 — 15:31 UTC\n                                \n                                        November 16, 2018 — 15:31 UTC\n                                    12 - 14 DECEMBER - ALL OVER LONDON Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}