{"id": "Alibaba wins copyright case against cryptocurrency knock-offExplore our decentralized future", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Blockchain, cryptocurrencies, and insider stories by TNW.\n            Powered byAlibabacoin is not AlibabaThe Chinese internet shopping Goliath, Alibaba, has overcome its previous struggles to win a trademark infringement case against a cryptocurrency that was blatantly sponging off its recognizable name.Alibaba has won a preliminary injunction against Alibabacoin Foundation (ABBC) for trademark infringement, MarketWatch reports.Despite the obvious likeness in the names of the two corporations, they are not affiliated in anyway.Earlier in the year Alibaba was unsuccessful in filing a lawsuit against ABBC. The case was denied by judges on the grounds that US district courts did not have jurisdiction over ABBC – which claims to be based in Dubai and Belarus.Since then, Alibabacoin Foundation has stepped even further over the mark. According to reports, ABBC continued to use Alibaba’s branding and trademarks to promote its ICO and cryptocurrency.Alibabacoin Foundation was using the unlicensed materials to try and raise $3.5 million in an ICO. The coin has a current market value of $1.9 million.The injunction prevents ABBC from using any materials, terms, marks, designs, words, and terms belonging to Alibaba.If ever there is a reason not to trust the promotional materials of a cryptocurrency on first sight, this is it.It would be quite reasonable (for the uninitiated) to assume Alibabacoin is affiliated to the mega-successful Alibaba corporation – but it’s not. Any company that uses stolen copyright material isn’t one to trust in my books.That said, it’s not like Alibaba has never been used to sell knock-off goods before…\n                                    Published October 24, 2018 — 10:46 UTC\n                                \n                                        October 24, 2018 — 10:46 UTC\n                                    12 - 14 DECEMBER - ALL OVER LONDON Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}