{"id": "Battlefield V devs reveal how they recreate era-appropriate sounds", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Rachel Kaser\n            — \n                        in Gaming\nWith Battlefield V beginning to peek its head out on the horizon of game releases, the game development team is opening the curtain on the making of the game. If you’ve ever wanted to see what goes on in the studio when the game du jour is being created, you’ll find some of EA and DICE’s Dev Talks fascinating.Members from DICE’s sound design team were the focus of the latest episode of the behind-the-scenes shoot, and they revealed some of the stuff they do to get the in-game booms and bangs sounding just right.Visit Hard Fork.As far as historical accuracy is concerned, the devs said it was easier to find historical weaponry for this game’s WWII-era gunplay than it was for Battlefield One‘s WWI setting. And while they don’t comment on it specifically, the foley work they do apparently includes multiple takes of things like putting a bare hand against a grip, or fiddling with different parts of the gun. The team also attempted to accurately recreate the sounds of the airplanes, like the infamous siren of the Stuka dive bomber.One major focus of the video is the attempt to capture the sound of the V-1 pulsejet-powered rocket historically used by the Luftwaffe. Essentially the audio team recorded a pulse engine attached to a snowmobile, and it looks rather dangerous given it could only be run a few times. But it’s worth it to hear the distinctive roar as a rocket passes overhead in-game. It’s the same one you can hear at this point in the reveal trailer, just before the player character is flattened by its blast.I can’t speak for the entire game, but the sound design and audio looks solid. We’ll know for sure when the game drops on its delayed date of November 20.\nRead next:\n\n        Violent videos put journalists at increased risk of post-traumatic stress    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}