{"id": "Facebook needed to hire a diplomat, and Nick Clegg is the smartest choice", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Matthew Hughes\n            — \n                        in Opinion\nWhen Elliot Schrage announced he was stepping down from his role as Facebook’s Head of Global Policy and Communications, the Internet was abuzz with rumors about who would replace him. Today, we learned that it would be Nick Clegg, former Deputy Prime Minister of the United Kingdom, and one-time leader of the Liberal Democrats.Nick Clegg’s formal title will be VP of Global Affairs and Communications. According to the BBC, he’ll start working at the company next week, and will relocate with his family to California next year.Those sweet cool gadgets?I don’t think anyone saw this coming. When Recode published a speculative list of potential candidates earlier this month, Clegg was nowhere to be seen among the former British political heavyweights. Instead, it suggested more plausible names like former UK Secretary of State for Foreign Affairs, David Miliband, and one-time Chancellor of the Exchequer, George Osborne.Furthermore, Clegg also has an image problem. He lead the Liberal Democrats during its brief stint as the minority partner in the coalition government between 2010 and 2015. Many people — particularly young people — felt betrayed, and eight years on, few have forgiven him.Given Facebook’s public perception woes, it wouldn’t have been blamed if it opted for a less controversial figure, like Miliband, or perhaps IMF chief Christine Lagarde, as was suggested by Recode’s Kurt Wagner.Despite that, I’m convinced that Facebook’s picked the top man for the job. For the first fifteen years of Facebook’s life, it moved fast and broke things. Now, as battles with regulators and governments are reaching a fever pitch, it’s time for a grown-up to take the reins.Nick Clegg is unreservedly that grown-up. He’s a natural and instinctive diplomat. During his five years as the minority partner in the 2010-2015 coalition government, he delicately balanced the interests of his party and voters, while simultaneously ensuring that government continued to run smoothly.Despite holding just 57 seats, the Liberal Democrats delivered on many of their manifesto promises (although controversially failed to stop a rise in tuition fees). This was accomplished without the government collapsing in acrimony, as is often the case in coalition governments.This delicate hand will undoubtedly come in handy as Facebook navigates the aftershocks of Cambridge Analytica, the Brexit referendum, and the 2016 US general election.There’s another reason why Clegg is ideally suited to Facebook’s Global Policy job: he’s an enthusiastic Europhile who understands the complicated machinations of the European Union.The Lib Dems are passionate believers in the European Project. Clegg backed Remain in the 2016 Brexit referendum and remains a vocal voice in favor of a People’s Vote on the final deal. Crucially, Clegg sat as a Member of the European Parliament between 1999 and 2004.As Facebook locks horns with European Union regulators over issues such as privacy and security, Clegg’s experience and understanding will prove to be an invaluable asset.Although few people could have predicted Facebook hiring Nick Clegg for one of its most important roles, looking back, it makes perfect sense.\nRead next:\n\n        Samsung's Galaxy Book 2 is like a Surface Pro with up to 20 hours of battery life    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}