{"id": "Facebook now lets you add music to your profile and Stories", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Rachel Kaser\n            — \n                        in Facebook\nFacebook today announced it was offering several new ways for users to incorporate music into their on-site identities — and in doing so, is starting to look very much like MySpace. The company plans to add the ability to listen to music on Stories and Profiles.Starting today, users will be able to use music in Stories. To use it, they just need to tap the “Music” sticker and select the song of their choice. You can select a specific section from a song if that’s all you want to play, or you can let it play until your Story ends. It works much the same as it does on Instagram Stories. It’s called Hard Fork.The other major feature is that Facebook will soon allow you to play songs on your profile, which is what sparks the aforementioned comparison to MySpace. The new Music section on your profile lets you show what songs you’re listening to, and you can also pin one of them to the top of your profile to show visitors what kind of mood you’re in. Visitors who open the Music section can listen to short clips of any of the songs, as well as visit the artist’s page.From the sound of it (no pun intended), it gives you the chance to show visitors to your profile hints of your personality. Keep your volume turned down if you visit my profile, because I guarantee I’ll have the loudest Led Zeppelin song I can find pinned to my profile at any given time.It appears Facebook is making the most out of its deals to license music from the likes of UMG, Sony, and Warner Bros. It’s also expanding on Lip Sync Live, its answer to Musical.ly. Now users will be able to read the lyrics for the songs the user is syncing to. At the moment, it’s only available for a few songs, but Facebook claims it will add more over time.Facebook hasn’t said exactly when these features will be rolling out.\n\nMore Ways to Share and Connect With Music on Facebook\non Facebook\n\n\nRead next:\n\n        Tomorrow's telescopes will be planet-sized quantum teleportation devices    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}