{"id": "Stan Lee, comic book writer extraordinaire, has died", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Rachel Kaser\n            — \n                        in Insider\nStan Lee, former editor-in-chief of Marvel Comics and the creator of some of the most popular superheros in the world, has died at the age of 95, says TMZ.His daughter, J.C. told the outlet, “My father loved all of his fans. He was the greatest, most decent man.”It’s in London from December 12-14For those somehow unfamiliar with his output, Stan Lee was the man behind several of Marvel’s most popular characters. If you seen a popular movie in the last ten or fifteen years, it probably starred one of his creations. Along with legendary artists such as Jack Kirby, Lee created the likes of Spider-Man, the Hulk, the Avengers, the X-Men, Daredevil, Black Panther, Doctor Strange… the list is long enough to keep you here for hours.Bob Iger, CEO of the Walt Disney company (which owns Marvel Comics), said in a statement:Stan Lee was as extraordinary as the characters he created. A super hero in his own right to Marvel fans around the world, Stan had the power to inspire, to entertain, and to connect. The scale of his imagination was only exceeded by the size of his heart.Lee first started with Marvel — then called Timely Comics — as an assistant in 1939. One of his earliest creations that stuck in the public consciousness was The Fantastic Four, which debuted in 1961. His characters have remained a staple of popular culture ever since, renowned for their recognizable flaws and sympathetic personalities.In recent years, Lee is perhaps most recognizable for his multiple cameos in works based on his characters. Spotting him in Marvel movies has become a common pastime among fans, and he made a notable appearance in the PS4 Spider-Man game, released earlier this year.Marvel and others who knew him have been sending out their memorials:Today, we pause and reflect with great sadness on the passing of Stan Lee: https://t.co/J0cwgdn677 pic.twitter.com/eOBdZAqdZ0— Marvel Entertainment (@Marvel) November 12, 2018There will never be another Stan Lee. For decades he provided both young and old with adventure, escape, comfort, confidence, inspiration, strength, friendship and joy. He exuded love and kindness and will leave an indelible mark on so, so, so many lives. Excelsior!!— Chris Evans (@ChrisEvans) November 12, 2018Damn… RIP Stan. Thanks for everything. pic.twitter.com/TMAaDJSOhh— Ryan Reynolds (@VancityReynolds) November 12, 2018Rest in peace, Stan Lee.\nRead next:\n\n        How I learned to be a better #MeToo ally    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}