{"id": "Watch: US Navy shoots down a (fake) nuclear missile in space", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Bryan Clark\n            — \n                        in Insider\nThe US Missile Defense Agency recently destroyed a fake nuclear warhead launched into space.It’s our cool new gadget site.Released last week, a video from defense contractor Raytheon, shows a ballistic missile launch from the Pacific Missile Range Facility in Kuai, Hawaii. Also in that video is footage of its interceptor technology, Standard Missile-3 Block IIA, successfully destroying it shortly after being launched from the USS John Finn, a naval destroyer vessel.The launch is notable due to failure in previous systems designed to do the same thing. The US Patriot missile and Israeli Arrow, for example, are prone to malfunctioning and missing their targets — if they get there at all.Raytheon’s previous attempt, depending on who you ask, was either “proven and effective” or a complete failure. The former was a comment praising the system by Greg Black, of Raytheon. The latter is a reference to later claims that the missile defense system failed to neutralize its target some 80 percent of the time.via Motherboard\n\nStandard Missile-3 Block IIA intercepts medium-range ballistic missile target\non US Missile Defense Agency (YouTube)\n\n\nRead next:\n\n        The new space race is all about satellites: Pros and cons of each orbit    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}