{"id": "This Day in Deals: A 9ft inflatable dragon to earn you UNESCO recognition", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Gadgets for humans\n            Get $40 off the best purchase you'll ever makeThis Day In Deals is our new section where we share a historical fact and the day’s best deal – and try to connect them. The aim? To enrich ourselves financially, and you spiritually.Here’s a photo of the very large Chartres Cathedral:On this day all the way back in 1260, this magnificent French cathedral was consecrated in the presence of King Louis IX. In other words, it was declared sacred – meaning it was formally dedicated to god.Good one, Louis!These days, it’s a UNESCO World Heritage site, an honor it earned in 1979. The reason? Because it marks a “high point of French Gothic art,” contains “porches adorned with fine sculptures from the middle of the 12th century,” and has “magnificent 12th and 13th-century stained-glass windows.”Even better, it’s all in “remarkable condition.” Great to hear, Chartres Cathedral!I have a question though: if it’s such a masterpiece, why did it take until 1979 for it to get UNESCO certified? With the organisation founded in 1945 that means it took 34 years for Chartres Cathedral to get proper recognition. Scandalous.While I can’t say why it took so long, I know exactly what would’ve got it World Heritage status quicker – if they installed a nine foot tall inflatable dragon that lights up.Observe, please, the majesty:Just look at it compared to a normal human male:Don’t believe me? How about we do a thought experiment.Are you sitting comfortably? Good. Imagine you’re a UNESCO representative. You hear about a cool cathedral. You think “that sounds nice, maybe I’ll check it out in 34 years.” Then – and this is the kicker – you hear this cathedral has a nine foot tall inflatable dragon that lights up. I guarantee you’ll be on the first plane to France to declare it a World Heritage site.Basically, this dragon will improve the class and status of any situation – whether you’re looking for an internationally recognised award or not.And you know what’s even better? You can currently save $40 on this breathtaking beast, making it only $109.99.What are you waiting for? Why are you still reading? Go buy this goddamn inflatable dragon and become the person you aways knew you could be.We like some products. We don’t like others. Either way, if you buy something through our affiliate links, we get a small cut of the revenue. This isn’t a sponsored post, but for the sake of transparency, you deserve to know what’s up.\n                                    Published October 24, 2018 — 11:20 UTC\n                                \n                                        October 24, 2018 — 11:20 UTC\n                                    Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}