{"id": "D’Angelo slipped a brand new song into Red Dead Redemption 2", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Georgina Ustik\n            — \n                        in distract\nD’Angelo, the king of neo soul, the artisan of R&Baby making music, has a new song — and it’s tucked away in the Red Dead Redemption 2 soundtrack.You may have heard some buzz about RDR2 — like, how it’s had the biggest opening weekend in entertainment history after grossing $725 million in its first three days. You’ve probably seen the memes popping up for months from fans and celebs alike:*me after playing red dead redemption 2* pic.twitter.com/9nNNKGg3IH— Desus Nice (@desusnice) October 26, 2018It’s all about cryptocurrency and blockchainThe hype is deserved — it’s been in development for eight years, thousands of people worked on it, and, as our own Nino de Vries wrote, “it’s generation-defining, it’s bar-raising” from its graphics to its gameplay. And its accompanying soundtrack certainly keeps up.Even without D’Angelo, it’s an impressive playlist, with contributions from Arca, Colin Stetson, and Queens of the Stone Age drummer Jon Theodore.D’Angelo’s track, “May I? Standing Unshaken — Oh Traveller Have a Seat,” plays in the fifth chapter, between the “Paradise Mercifully Departed” and “Dear Uncle Tacitus” missions. Music fans were quick to spot it, including New York magazine’s critic, Craig Jenkins.Holy fuck did Red Dead slip a new D'angelo song in?— Craig Bro Dude (@CraigSJ) October 29, 2018This is D’Angelo’s first release since his 2014 album Black Messiah, which, let’s face it, was the best album released that year.Listening to the song, I’m transported back to 2015, when I saw D’Angelo and the Vanguard live at Forest Hills Stadium in Queens — the converted outdoor tennis courts were literally full of middle age women swooning. It was the best show I’ve ever been to, as well as the closest thing to an orgy I have seen, and ever hope to see, in my life. I mean, try to watch this music video with your parents without regretting your own existence:Let’s hope the track is a sign of more to come — an album, maybe?I don’t write much about video games — actually, I haven’t played one in years. But I do listen to music. A lot. And news that D’Angelo slipped a new song into its soundtrack is enough to make me want to buy a copy.\nRead next:\n\n        Intel's AI strategy for 2019 goes beyond chips    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}