{"id": "TNW presents the greatest gift guide in the world… everUE BOOM 3Master & Dynamic MW50+Pax 3Oculus GoApple Watch 4The Nintendo SwitchA pair of Joy-ConsOrzly Nintendo Switch CaseA PlayStation 4Dobble (AKA Spot It!)Exploding Kittens7 Wonders: DuelTamagotchi‘The Power’ by Namoi AldermaniStorage diskashur 2 hard driveAnker PowerCore 26800 Portable ChargerA Torro iPhone case", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Gadgets for humans\n            Here be the best stuff for you to buy in 2018The adverts have started, the songs are blaring, and dust is being blown off the decorations. Truly, the holiday season is upon us. And you know what this means? Gifts. Lots of gifts.Whether you’re putting together your own list, or trying to find the perfect thing to get someone else, we’re here to help. We’ll be running a range of difference gift guides over the coming weeks, but this is our first: the ultimate guide.Basically, this is a selection of some of our favorite stuff in the world. It’s brimming with items we couldn’t live without and we think you’ll feel the same.Here we go!On the lookout for a portable bluetooth speaker? Well, I’m happy to say your search is over.The UE BOOM 3 is the best around – it’s tough, waterproof, stylish, and reasonably priced. Sound-wise, it handles all music genres (and podcasts) with aplomb. Plus, it can get loud.The battery lasts for ages and it’s small enough to just slip in your bag when you go out. You can also turn it from across the room using your phone, which is a blessing for the lazy person.Please never leave us, UE BOOM 3, you’re too beautiful.Price: ~$130Amazon | Best Buy (US) | Currys (UK)This was a tough one. There are a lot of brilliant premium headphones out there (shout out the Sennheiser HD1 and the Sony WH-1000MX2), but the Master & Dynamic MW50+ have captured my heart. I couldn’t imagine not having them in my life.The build quality is brilliant. They’re bluetooth, but you have the option to use a wire if you dig the headphone jack. Plus – you can also change the headphones to be either on-ear or over-ear.And the sound, oh lord, the sound. Rich, precise, and with enough oomph to make even the most mundane tracks exciting. You can’t go wrong with the Master & Dynamic MW50+. Get them for yourself or your loved one and everyone will be happy for years.Price: ~$400Amazon | Best Buy (US)Weed’s everywhere these days. It used to be something you did hidden away, but the legalization movement has swept the globe. And, just like attitudes towards the plant has changed, so has the way we consume it.One of the most popular – and in my mind best – is the humble vape. Over the past few years, this technology has gone from bulky and inefficient, to slick and premium. And in this market, the Pax 3 is the best.It’s simple to use, portable, and delivers a great high. And did we forget to say it’s also a bit of a looker? If you’re looking to switch up your marijuana habit, check out the Pax 3. It comes highly (get it?) recommended.Price: ~$200Namaste Vapes | Everyone Does ItIf you’re curious about VR, the Oculus Go is the perfect introduction. It’s a standalone headset (and controller) that can take you to a virtual world quickly.I’ve spent a lot of fun hours with the Oculus Go and almost everyone I’ve shown it to has been impressed. No, it’s not the same VR experience as an expensive computer-bound headset, but the Oculus Go is accessible, entertaining, and an ideal gift for someone wanting a gadget that’s a bit different.Price: ~$200Amazon | NewEgg (US) | Currys (UK)Finally, the Apple Watch has delivered. The past iterations of the smartwatch have been good, but Apple has hit its stride with this generation.Aesthetic-wise, it’s a thing of beauty – everything about it screams quality. The battery life is better than ever and when this is combined with the groundbreaking health applications (including the EKG feature), the Apple Watch has moved from a curiosity to a must-have.It’s an incredible device and should be top of lots of your wish lists.Price: ~$430Best Buy (US) | Currys (UK)Well, Nintendo‘s truly got its mojo back. The Switch is a wonder. It’s one of the most innovative devices out there, and something you couldn’t have imagined any other company creating.And while some of the company’s other experimental consoles (think the Wii U) were poorly made, the Switch feels like an engineering marvel. To this day, being able to play the same game in your living room and on public transport is breathtaking. It’s the future.One of the criticisms originally levelled at the Switch was the lack of games, but now – a year and a half since its release – this has changed. Super Mario Odyssey, Pokémon: Let’s Go, Pikachu! and Let’s Go, Eevee!, Breath of the Wild, Diablo III, and many more will keep everyone hooked.The Switch is a must-own gadget, whether you’re an intense gamer or not. I couldn’t imagine being without mine.Price: ~$300Amazon | Best Buy (US) | HMV (UK)One of the joys of the Nintendo Switch is the multiplayer experience. Nothing beats crowding around a TV with some friends and gaming into the wee hours. And the best way to do that? With another set of Joy-Cons.Just like the Switch itself, the controllers are well-made, finely engineered, and innovative. Despite their looks, they feel like an advanced bit of technology, not a toy.Whether it’s Mario Kart, Mario Party, or Overcooked 2, there are a raft of games that an extra pair of Joy-Cons will take to the next level. Plus, they’re an ideal present if the person you’re buying for already has a Switch.Price: ~$68Amazon | Best Buy (US) | Currys (UK)If you have a Switch, you’re going to need a case. I mean, how else are you meant to carry it around? I tried out a few and the Orzly case had the best balance of storage space, protection, and price.You won’t regret it.Price: ~$12AmazonIf you love gaming, but don’t like the look of the Switch, the PS4 will be the console for you.The wide range of games, more mature content, and next-gen graphics make the PS4 a must-buy. It’s powerful, has some terrific exclusive titles, and really has become the de facto console for the dedicated gamer.Price: ~$300Amazon | Best Buy (US) | Currys (UK)Dobble is like snap, if snap was sent back from the future to avenge its dead family. There are multiple variations of the game, but they all work in a similar way. There’s a card with a selection of images, one of which will match an image on a card you’re holding.It might sound simple, but I can’t describe how much brain energy it takes.Dobble is a heap of fun, and can be picked up and played in seconds. Also, it can take up to eight players, which is great for family gatherings. I warn you though, things are going to get loud. Still, it’s a perfect gift for people who like their games short.Price: ~$12Amazon (Spot It!) | Amazon (Dobble)If you’ve been on the internet, you’ll have come across the Oatmeal. The site, run by Matthew Inman, is filled with webcomics that have their fingers firmly on the pulse of internet culture. But Inman didn’t stop at just comics…Enter Exploding Kittens. It’s a card-based game that requires very little time to play, less to learn, but is a whole load of fun. Think of it like an advanced version of Uno. It’s part luck, part strategy, but pure entertainment.The whole thing is imbued with Inman’s particular sense of humor, but most importantly, it’s a great way to spend some time with your loved ones. And a brilliant gift.Price: ~$20ThinkGeek | AmazonThe other two physical games we’ve recommended can be played and enjoyed by almost anyone. 7 Wonders: Duel isn’t the same. Think of it like a two-player board game version of Civilization. If that sounds like something someone you know will like, they’re going to be so happy when you buy this for them.It’s a bit fiddly when you start playing, but it doesn’t take too long to get in the groove and you realize what a finely balanced game it is. 7 Wonders: Duel is the ideal gift for the board-game nerd in your life – their evenings and weekends are bound to get a lot more fun.Price: ~$30AmazonWe all remember Tamagotchis, right? RIGHT?These virtual pets were all the rage back in the day and, thankfully, they’ve returned. They might not be as technologically impressive as they once were, but they’re still just as much fun. And just as annoying.One thing I can guarantee is that whoever receives this gift will do so with a huge smile.Price: ~$20AmazonEver heard a story and idea so brilliant you were shocked it hadn’t been done before? ‘The Power’ is like that.In this sci-fi influenced, speculative tale, women mysteriously develop powers that allows them to ‘shock’ people. Told over the course of a decade, the book tracks the moment the powers are first developed to the point of the whole world changing.It’s a romping read that’ll stay with you long after you’ve finished it. A vital read.Price: ~$12AmazonYes, most data is stored in the cloud these days, but having a physical back-up is still important. Choosing a specific hard drive was tricky, but we eventually settled on this iStorage device.The inclusion of a keypad and military-grade encryption separates this hard drive from the rest. It means that your sensitive data will stay secure. On top of this, the embedded USB cable is also neat.If you’re looking for a well-built, advanced hard drive, you can’t do wrong with the iStorage.Price: ~$270NewEgg (US) | Currys (UK)Portable chargers aren’t sexy, but I love them. The idea of going out in the world without a way to give my phone, iPod, headphones, Switch, and other gadgets some juice is unthinkable. I won’t do it.But which one to choose? Anker. Choose Anker. The PowerCore 26800 in specific is brilliant. It has a huge capacity and three USB slots, so you can charge a trio of devices at once. Or you can let your friends have some juice, if you’re that way inclined.This is an essential tool for the gadget lover, make sure that person in your life has one.Price: ~$66Amazon | Anker | eBay Look at that beautiful case. You know why it’s so beat up? Because I’ve had it for over four years. Yep, that’s an iPhone 6 Plus underneath that genuine leather case. Somehow, over four years of daily use, abuse, and general battering, the Torro iPhone case has remained steadfast.And you know what else? The case has a selection of hand slots for all my cards. Does that make me an old man? Probably. But why should I care when the case is so good?To put it bluntly, when I finally cave and buy a new iPhone, the first thing I’ll purchase after will be a Torro case.Price: ~$35AmazonWe like some products. We don’t like others. Either way, if you buy something through our affiliate links, we get a small cut of the revenue. This isn’t a sponsored post, but for the sake of transparency, you deserve to know what’s up.\n                                    Published November 16, 2018 — 13:29 UTC\n                                \n                                        November 16, 2018 — 13:29 UTC\n                                    Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}