{"id": "Get more cats on your Instagram feed by cheating the algorithm", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Anne Felicitas\n            — \n                        in Contributors\nIf you’re anything like me, a blue-eyed tabby cat coquettishly peering at the camera from under its lashes makes you want to scream and explode like Keegan Michael Key and Jordan Peele in this skit. If you’re anything like me, you spend hours watching felines meow, pounce, and pose on Instagram, liking and commenting on every photo. If, like me, you want to fill your Instagram feed with cats, you must know the ways of the Instagram algorithm, the set of rules that determine what content appears on top of your feed and for how long. Like all social media companies, Instagram wants users to return to its app and consume content. Relevance, Instagram reasoned, is the key to doing that. It’s called Hard Fork DecentralizedLike an obsessed lover, Instagram knows all of your interest by keeping track of your behavioral history. It knows every like you make, every account you follow, and every post you comment on. Using that information, and keeping the three factors interest, recency, and relationship into consideration, Instagram chooses the content that will appear on top of your feed. If you want to see more cats in your feed (and who doesn’t, unless you’re a cold and heartless humanoid reptilian), you have to show Instagram which content you care about. Instagram places content it believes you’ll like at the top of your feed. In the eyes of Instagram, engagement indicates interest. After all, if you often like cat videos, it’s probably because you like cat videos. If you often scroll past pictures of food, it’s probably because you couldn’t care less about those. To show Instagram you love seeing cats on your feed, engage with cat-related content. Like and comment on every cat photo and video that appears on your screen. Share those posts to your friends in Direct. Don’t limit your engagement to posts on your feed. Show your interest on Stories, too, by responding to polls, sharing the Stories that mention you on your own Story, and playing with emoji sliders. Instagram will note your behavior as a show of interest. Because interest equals more time spent on the app, Instagram will show more cat posts on top of your feed.Showing your interest takes commitment, though. Instagram examines not only your current behaviors but also your past behaviors. If it sees that you’ve been engaging mostly with cat-related posts for the past three months (three years for me), it knows you will likely engage with cat content if it appeared on your feed now.If you work at a marketing agency like I do, you’d know that social media managers post content at the most popular times. Using an Instagram analytics tool, you can determine who your followers are, what content they like, and when they are most often online. The accounts you follow likely use the same strategy. If you notice that the accounts you follow post content at a certain time, make sure to visit Instagram at those times. Timing is important because Instagram also considers recency when showing you content. A video posted at 3 p.m. will appear before a photo posted at 7 p.m.How often do you interact with the accounts you follow? If your answer is never, you need to build up rapport with those accounts right now. As you would with a new crush or a current partner’s ex, obsessively look up the account on Search. Comment on every post, tagging (@accountname) the account so it notices yours above the hundreds of others. Reply to the account’s Stories. Use the account’s filter, if any. Share the account’s Stories. If you’re lucky, the account will notice your efforts and respond to you! Once you and the account you follow interact, Instagram will notice and conclude that you two have an unbreakable bond. As a result, that account will appear on top of your feed as soon as you open your app. I get it. You may find cats to be evil little fiends whose plans for world domination you don’t want to support or whose fur causes your sinuses to seize. You may be interested in other animals, like dogs, birds, or turtles. Hell, you may hate all cute animals altogether and would rather see posts related to humanoid reptilians. Whatever interests you, here’s the good news: this strategy I mentioned above works for any interest. And believe, me, it works. If you want a better Instagram feed filled with content you care about, remember these three elements: interest, recency, and relationship \nRead next:\n\n        These stylish sunglasses also capture HD video and photos    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}