{"id": "Facebook trims Messenger’s clutter with new update", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Rachel Kaser\n            — \n                        in Facebook\nFacebook today announced it was overhauling Messenger, updating the interface and cutting down on the embarrassing amount of clutter that has plagued the app for ages. And, from what we’ve seen, the changes are all positive.Stan Chudnovsky, VP of Messenger, describes Messenger 4 as a “new, simplified” version of the app. It’s shaving what has, up to now, been about eight or nine different tabs down to three. It’s called Hard Fork.It’s a much needed change, as Messenger has become ever more crowded over time. What started out as a dedicated app for Facebook‘s chat service has since become a behemoth in its own right, and it now offers games, bot integration, video calls, and Stories. As each new feature has been added, it’s essentially just been bolted onto the client with a new tab or bar.Between all of these features and the ads, it’s a task just finding a message I sent to a friend two weeks ago. It’s like trying to pull the rug from under a coffee table. So the news that the company is cleaning everything up comes as a relief.Under the new Messenger, all of your chats are in their own tab. Another tab is dedicated to “People,” i.e. Stories, a list of your friends currently active, and the ability to find further friends. The third is “Discover,” which is basically a dumping ground for both bot integration and games.Chudnovsky noted there are further developments in the works, and teased a beautiful Dark Mode that intrigued me more than any other item in the list. These features will also roll out with Messenger 4, but at later stages.Messenger 4 will roll out to everyone over the next few weeks.\n\nSay Hello to the New Messenger: Introducing Messenger 4\non Facebook\n\n\nRead next:\n\n        Alibaba wins copyright case against cryptocurrency knock-off    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}