{"id": "India’s plans to censor streaming services like Netflix are a mess", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Abhimanyu Ghoshal\n            — \n                        in India\nWhile India is home to the world’s largest film industry and one of the planet’s largest audiences for cinema, it’s also constantly struggling with the challenge of censoring movies. Things have gotten more complicated in the past few years with the rise of international streaming video platforms like Netflix and Amazon Prime Video.Streaming content produced locally and overseas isn’t regulated in India, which means they appeal to citizens looking for uncensored shows and movies. But many people in India’s largely conservative society take issue with the depiction of nudity, sex, violence, and messaging that criticizes the country and its leaders. Inconsistent measures and reporting on the actions taken by the government and these service providers have made it impossible to figure out just how far along we are in the censorship war – and who will come out on top.It’s in London from December 12-14India’s Central Board of Film Certification, a government body tasked with statutory censorship and classification for movies, is known for being tough on filmmakers who want to push the envelope with their messaging and imagery in India. Since its formation nearly 70 years ago, it has routinely taken its shears to innumerable films produced domestically and abroad, so as to protect the modesty of viewers nationwide by demanding that scenes depicting nudity, gore, and the reality of operating in politics be removed.That’s not entirely surprising. It’s a fairly common practice among among citizens and government agencies in India to attempt to enforce a code of morality with other people and institutions. Their actions are based on notions of upholding traditions, values, and religious beliefs, and they generally take the forms of attacks on freedom of expression and vigilantism.And in this climate, there’s no framework for censoring content on video-on-demand services. That’s a problem for the government, as well as for for people opposed to others viewing uncensored material in the privacy of their own homes. But it’s also one of the reasons why Indians are subscribing to streaming services in large numbers. So, how does all this affect international platforms like Netflix?Good luck finding out. Over the past couple of years, there have been numerous reports, legal cases filed in public interest, and actions taken by these services to address demands for censorship. And more recently, we’ve heard about these services considering self-regulation. This is where things get tricky.One report from the Economic Times noted in September that streaming services were considering a ‘voluntary censorship code.’ It sounded troubling, because these services would have to compromise on the uncensored content that attracted viewers in India in the first place.Another report from Medianama clarified that this self-regulation only pertained to a common standard for classifying content across streaming platforms to help viewers make informed choices about watching content with strong language, violence, and sex.An additional risk of self-censorship is for the content they’re producing locally. Enforcing a censorship code or self-censorship would curb the freedom of content creators in India.Yesterday, The Print published a story saying Netflix would begin self-regulating its content internationally, along with another service called Hotstar.But interestingly, the company issued a statement to TNW saying, “The information quoted is inaccurate and entirely false. Netflix was never in this meeting.” ¯\\_(ツ)_/¯Speaking to TNW, renowned film critic Raja Sen – who extensively reviews Bollywood and international film and TV for numerous publications in India – said that a unified ratings system that applies to locally available streaming platforms makes sense. But he cautioned against going beyond classification of content down the slippery slope of censorship.Sen opined about the arbitrary manner in which film censorship is currently carried out in India, and how it requires the difficult enforcement of bizarre, ever-changing standards for an incredibly diverse population.So why are streaming video companies even thinking about self-censorship in India? “It’s possible that they’ve heard something similar is in the works within the annals of the Indian government – or they may have been told, or warned, to clean up their act,” speculated Sen.It’s also not a new phenomenon. “When Amazon Prime launched in India, they started out self-censoring, by chopping a section of the car show The Grand Tour, so as not to upset people,” said Sen. He highlighted that last bit in a column published in December 2016:On the fourth episode of the series, Jeremy Clarkson drives a car made of animal carcasses, looking through a windshield made of a cow’s innards. The hour long episode has, absurdly enough, been shortened to half its length and there is no meat-car in sight.Amazon India responded soon after, saying it “will keep Indian cultural sensitivities in mind while offering this content to customers.” Apparently, you have to tread very lightly when you’re dealing with a country that believes the cow is a sacred animal.Similarly, Netflix ordered a censored version of the Indian film Angry Indian Goddesses back in 2015, delaying its online release by several weeks in the process.Sen worried that in today’s connected age, censoring content will push people to seek out uncensored material elsewhere, lead them to cancel subscriptions and encourage piracy. “You can’t censor the internet. If people want to look at something online, they’ll find a way.”The notion of voluntary censorship is particularly worrying at this point in time, when Amazon and Netflix have both begun actively producing original content in India – some of which is being made available to global audiences.In February, Netflix announced three original pieces of content from India, including the well received Hindi show Sacred Games, which features a number of prominent Bollywood stars, and a film Lust Stories, the “largest watched original in percentage terms” in its first month in June. CNN reported in July that several more are on the cards.Meanwhile, Amazon launched its third locally produced series, Comicstaan – a reality show featuring budding stand-up comedians learning from experienced pros – in July. It has three more in the pipeline for 2018, and hopes to launch 10 originals next year.There’s big money to be made: According to research firm Media Partners Asia, the online video market in India is currently worth $700 million, and is expected to balloon to $2.4 billion by 2023.But censorship could hurt these companies’ chances of raking in those big bucks – and have worse repercussions as well. Sen noted that it has the potential to cause the rest of the world to take Indian audiences and filmmakers less seriously:If distributors abroad see India producing unremarkable content, they may become uninterested in licensing locally created media for international audiences. By the same token, platforms and distributors targeting Indian viewers may stem the flow of material from overseas, if they know that it’ll hit roadblocks because of arbitrary censorship guidelines.Following an Indian non-profit’s complaint about “unregulated, uncertified, sexually explicit, vulgar, profane, and legally restricted content” on streaming platforms in the country, the Delhi high court has asked the government to comment on prevailing guidelines and licensing policies concerning the regulation of content on these services this week.Sen hopes these networks stand their ground and say no to censorship, particularly when they’re beginning to produce content of their own. Many viewers in India have been looking forward to these platforms’ ability to foster artists’ freedom of expression for a long time now, and it’d be a shame to see that curtailed.He concluded, “Go ahead and create more ways for viewers to find content that’s agreeable to them on your platforms, but let’s not start acting like even adults need parental supervision.”\nRead next:\n\n        TNW presents the greatest gift guide in the world... ever    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}