{"id": "This Day in Deals: 40% off NFL pyjamas to honor the sport’s first professional player", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Gadgets for humans\n            Comfort is paramountThis Day In Deals is our new section where we share a historical fact and the day’s best deal – and try to connect them. The aim? To enrich ourselves financially, and you spiritually.Sports are such big business these days, it’s hard to picture a time when they, well, weren’t.Think of American Football. These days, NFL players are rockstars. They own mansions, top-of-the-range cars, and can barely go anywhere without being mobbed.This level of success and professionalism didn’t just appear though. It had to start somewhere. And it did. Specifically, on this day back in 1892.And it involved this hunk:That, friends, is the (sorta) famous William Walter “Pudge” Heffelfinger. He was the first person paid to play American Football.Pudge was a Yale student and a star athlete, competing in rowing, baseball, and track. Oh, he also was the university’s heavyweight boxing champion.To cut a long story short, after Yale, Pudge played as an amateur footballer for the Chicago Athletic Association. But, for one game against Pittsburgh AC, he was paid $500. This made him the first ‘professional’ American Football player.So, to celebrate William Walter “Pudge” Heffelfinger’s achievement, we’re giving you 40 percent off a sleep set (read: pyjamas) of your favorite American football team.Don’t those look comfortable? Don’t they make you want to dream of [INSERT FAMOUS AMERICAN FOOTBALL PLAYER] doing a [INSERT AMERICAN FOOTBALL TERM] against [INSERT RIVAL AMERICAN FOOTBALL TEAM]? I know, right? It’s enough to bring a tear to the eye.Plus, when they’re reduced down from $49.99 to only $29.99, you’d be silly not to buy them.So, let’s all give some respect to the magnificent William Walter “Pudge” Heffelfinger 126 years after he was the first person paid to play American Football. And how should we do that? Easy: pay to get hold of some NFL sleeping gear.Pudge would be proud.We like some products. We don’t like others. Either way, if you buy something through our affiliate links, we get a small cut of the revenue. This isn’t a sponsored post, but for the sake of transparency, you deserve to know what’s up.\n                                    Published November 12, 2018 — 10:25 UTC\n                                \n                                        November 12, 2018 — 10:25 UTC\n                                    Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}