{"id": "Super Mario Bros. 3 — the greatest game ever — just turned 30", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Tristan Greene\n            — \n                        in distract\nSuper Mario Bros. 3 was launched in Japan on October 23rd 1988 (and every game since has been sub par). It’s incomprehensible that this isn’t a globally recognized holiday, but nonetheless, we’re here to help you celebrate this momentous occasion in gaming history.It doesn’t matter how old you are, Super Mario Bros. 3 is the greatest game ever made. That’s a fact. If you’re my age, it was the absolute peak of 1980s video game technology, and you were the perfect age to appreciate it. Nothing else was close. If you’re older than me: whatever ancient Atari game you’re thinking of isn’t better. It’s just not. And don’t even bring up coin-op arcade games. Stop it. It’s called Hard Fork.And if you’re younger: get off my lawn. Just because your games play on virtual reality headsets that were science-fiction plot devices in ours doesn’t make them better. Anything more than 8-bit graphics is a waste of … something. I forget and I need a nap. And it’s cold.But, don’t get me wrong, it’s not just a great game because critics named Tristan Greene, who work at The Next Web, universally agree that if they could travel back in time and either buy stock in Amazon or play Super Mario Bros. 3 again for the first time, they’d choose the latter. It was also the star of a great movie.My love affair with Super Mario Bros. 3 predates its 1989 US launch. In fact, like thousands of children at the time, I became interested in Nintendo‘s greatest game when it made its theatrical debut in the hit movie “The Wizard” starring Fred Savage.In a time long before the internet, there were still surprises in the world. And at 10-years-old, since I couldn’t afford Nintendo Power magazine, I managed to watch the movie without knowing what the “secret unreleased game” it was supposed to reveal was.I remember feeling sheer awe as I watched the end of the movie on my family’s 19-inch TV. The big reveal came and there it was: Super Mario Bros. 3! They were playing Super Mario Bros. 3! At the time, it was only available in Japan.Without YouTube or social media (neither had been invented yet) or gaming magazines to thumb through, I’d probably never lay eyes on so much as a screenshot until the game made its way to US shores. But there it was in defiance of expectation, in a movie, playing on my TV! The graphics looked other-worldly in glorious standard definition, and the gameplay looked like something from the future.Decades later my teenager spends hours a day watching other people play games on Twitch and YouTube, but “The Wizard” was the OG experience of watching influencers game.There’s never been another title that made me feel the same sense of anticipation and excitement as Super Mario Bros. 3 did, all thanks to Nintendo’s ingenious Hollywood marketing scheme. It’d be hard to keep something like that a secret from today’s kids though, due to instant, always-on news and updates.But it was a lot of fun being surprised by game makers when I was a kid, and Nintendo pulled off one of the greatest reveals in gaming history with Super Mario Bros. 3 — at least among 10-year-old poor kids in 1988.Happy Birthday to the greatest (your disagreements fall on deaf ears and blind eyes) video game ever made!\nRead next:\n\n        Dell's XPS 15 with 4K display is the laptop for people who want it all    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}