{"id": "Twitter’s privacy settings, explained", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Rachel Kaser\n            — \n                        in Basics\nTwitter is one of the most open social media platforms on the web, which is why it might be easier to ignore the privacy settings. Admittedly, Twitter doesn’t offer the level of granular control as, for example, Facebook. But it does have some decent options for controlling what other users can see and what level of access they have to you.Here’s a quick primer on your Twitter privacy settings, and what they mean. Note these will be sorted based on the browser version, rather than the mobile app, but the settings are the same across devices. It’s called Hard Fork.This is the obvious place to control your privacy, listed under “Privacy and safety” in Settings.The first and most obvious setting is “Tweet privacy.” This gives you the option of setting your whole account to private. If you do, then you must approve all new followers before they can see your tweets. Tweets from protected accounts can only be seen by followers, and won’t show up in third-party search engines like Google (barring shenanigans with third-party apps, but we’ll get back to that in a moment).The next is “tweet location” which varies between devices. On browsers, this means a general location will be attached to your tweet, indicating where you were when you tweeted. On mobile devices, the option is called “precise location,” and enabling it allows Twitter to access your GPS in order to, as the name suggests, use your exact location. In both cases, Twitter can use your location to serve you up local ads. You also have the option to “Delete location information” that Twitter has already collected.The next three settings, “Discoverability,” “Photo Tagging,” and “Twitter for Teams” can be taken as a whole, given that they do roughly the same thing; They allow you to control how much other users can involve you. “Discoverability” controls whether others can find you by searching for your email address or password. “Photo Tagging ” lets you list who can tag you in photos: anyone, people you follow, or no one. “Twitter for Teams” — which allows users to create groups of users who can access their account without a password — gives you the same choices.Finally, you’ll find your settings that control Direct Messages. From here, you can enable the option to “Receive from anyone” and to turn on Read Receipts. Both are essentially what they sound like, though we recommend leaving the former option disabled unless you have a good reason to enable it — Twitter DMs can be weird. On the mobile app, you also have the “Quality Filter” which allows Twitter to filter out messages it deems of lower quality, though it doesn’t specify how it deems DMs to be of low quality.These settings are more for controlling sensitive tweets, both the ones you create and the ones you see. “Sensitive” in this case, refers to those containing pictures or videos of graphic violence or adult content. Twitter allows such tweets, though “excessively gruesome media” and anything depicting the moment of a person’s death is subject to removal.Twitter allows users to both block sensitive media and mark something they’re about to post as sensitive from this section. For example, Safety is where you’ll find the option to exclude sensitive tweets, as well as blocked or muted accounts, from your searches — meaning these two options together constitute the closest thing Twitter has to a Safe Search.You also can enable the option to “Display sensitive content” which makes that kind of media visible by default. You can also “Mark media you Tweet as containing material that may be sensitive” if that’s the sort of thing you regularly tweet.This page, which is accessible from within the Privacy and Safety menu, allows you to control how much of your information Twitter itself is allowed to use. Most of the options are fairly self explanatory — personalized ads, or sharing your data with Twitter‘s business partners, for example.One option that’s less clear-cut is “Personalize based on your devices.” Essentially, this controls whether Twitter can use data it collects from one device to personalize another, and it incorporates data from third-party sites with Twitter integration. If you enable this option, Twitter can use this information to serve you up ads based on things you’ve done on other devices and sites. Here’s an example it gives:…if you commonly use Twitter for Android around the same time and from the same network where you browse sports websites with embedded Tweets on a computer, we may infer that your Android device and laptop are related and later suggest sports-related Tweets and serve sports-related advertising on your Android device.While not strictly related to privacy and security, there are a few other settings which you should always keep an eye on for your own safety.For example, you should check Apps & Data now and then. Apps, as the name implies, shows you which apps have access to your Twitter account, such as Instagram, Facebook, Buffer, or IFTTT. It also shows you the information to which each app has access. If you’re the type of person to grant those permissions willy-nilly (no judgement, we’ve all hit the “Allow” or “Yes” button without really reading the warning at least once), it can be helpful to do a spring cleaning of these apps every once in a while.Devices shows you all of the devices currently logged in to your account — including both smartphones and desktop browsers. You can log out of any of these sessions remotely from the device you’re using to view the settings.The other setting would be “Blocked accounts,” which is, again pretty self-explanatory. You’ll find a list of all the people you’ve blocked since you’ve been on Twitter, which can be helpful if you’re a serial blocker and want to keep track of such things.Any other steps you take to keep a handle on your Twitter account? Let us know in the comments.\nRead next:\n\n        Twitter is sorry about that whole 'Kill all Jews' thing    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}