{"id": "Dorsey says Twitter is thinking about an edit button to fix typos in tweets", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Ivan Mehta\n            — \n                        in Twitter\nFor the first time since the end of 2016, Twitter CEO Jack Dorsey shed some light on the company’s thoughts about building an edit button for tweets. Speaking at an event in India’s capital of New Delhi, he said that the company has to carefully consider use cases for the edit button before making it a reality – and it could potentially be tooled to help fix typos.“You have to pay attention to what are the use cases for the edit button. A lot of people want the edit button because they want to quickly fix a mistake they made. Like a misspelling or tweeting the wrong URL. That’s a lot more achievable than allowing people to edit any tweet all the way back in time,” Dorsey said.Hard Fork.He added that Twitter will ideally prevent unlimited editing, because then anyone could abuse the feature to alter their controversial or damning statements later on. Dorsey noted that the company wants to implement a solution that solves a problem and removes what “people see as friction in the service.”“We have been considering this for a while and we have to do in the right way. We can’t just rush it out. We can’t make something which is distracting or takes anything away from the public record,” said the Twitter CEO.People have been asking for the edit button for a while. Even Kim Kardashian got behind the cause recently, and asked Dorsey in person about it at her husband Kanye West’s birthday bash – so you know it’s a big deal.@jack Tweets, but editable? #PowerOf18— Ivan Mehta (@IndianIdle) November 12, 2018Feel* (tweets but editable)— Max Godin (@mxmgodin) November 10, 2018Tweets but editable @jack— Samuel Polay (@samuel_c137) November 11, 2018In 2016, Dorsey said that the company “has been thinking a lot” about an edit button for tweets, but nothing came to fruition.Give us the edit button already, Jack!\nRead next:\n\n        US and Israeli politicians hacked to promote ‘Elon Musk’ cryptocurrency scams    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}