{"id": "An entrepreneur’s guide to Mexico City’s tech scene", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Conrad Egusa\n            — \n                        in Contributors\nIn March of this year, Mexico was lauded by tech experts for becoming the first country in Latin America to pass a law regulating fintech, thus unlocking the potential of blockchain technologies to solve entrenched problems relating to political transparency and financial inclusion.For Mexico and its capital city of approximately 9 million, positive publicity can still feel like a novelty. But, in fact, the praiseworthy, forward-thinking commitment to innovation demonstrated by the bill is nothing new. Visit Hard Fork.While still struggling to shed an uglier reputation, Mexico City in particular has spent the last half-decade earning new fame as an emerging entrepreneurial-minded tech hub.In part catalyzed by ambitious government initiatives, a nascent tech ecosystem has grown up fast, feeding off an abundance of homegrown talent, multiplying funding opportunities, and a location whose advantages can’t easily be overstated. Not far from tech hubs like Austin and Los Angeles, Mexico City allows entrepreneurs to maintain close business ties with the States, and to enjoy access to the growing US Latino market. Moreover, it provides an ideal testing ground and entry point to the emerging economies of Latin America.   After some time away, I recently traveled back to Mexico City to explore its growing tech scene. Traffic is of course still bad, and the pollution isn’t great. But look past the city’s oft-mentioned ills and you’ll find a vibrant, dynamic ecosystem that can count a myriad of advantages. Here’s a guide my colleague Peter Andringa and I put together for entrepreneurs interested in taking a closer look at the tech scene of Mexico City.At least in part because moving around the city can be a nightmare, the majority of the capital’s 1200-plus startups and tech companies have congregated in the districts of Roma, Juarez, and Condesa.  Within these buzzing districts, startup activity is fueled by the synergies of local meetups, big name conferences, recognized accelerators and community of coworking spaces.More coworking locations continue to pop up across the city, with a few standouts worth mentioning. In addition to Startup Mexico, which was Mexico’s first innovation campus, WeWork now has seven impressive facilities spread across the city, each offering a long list of amenities. The Pool coworking space has two locations in Juarez and Polanco, providing meeting rooms, office spaces, and areas conducive to collaborating. COW Coworking spaces across the city offer workspaces, and even entire floors for accommodating anywhere from 4 to 100 people. The impressive Centraal, located in Condesa, can boast having welcomed members of Uber’s team in the company’s early days. And Capital Coworking, in Roma Norte, offers 8 floors, with particular levels dedicated to fintech, professional freelance, and high impact entrepreneurs.Many of these coworking spots host a wide range of meetup groups including Eventloop, a meetup for javascript developers; Hackers and Founders, which bills itself as the largest network of entrepreneurs; Google and Facebook Developer Circles; Node.js Community; and the healthtech meetup Hacking Health.And, helping give impetus to much of the scene’s ventures and collaborations are a number of key accelerator programs. Those of note include Startupbootcamp, Tec Lean, Telefonica-owned Wayra Mexico, and NXTP Labs, an accelerator program with offices in many Latam tech hubs. Numa has acceleration programs in 8 cities globally, and MassChallenge has a presence in the US, Switzerland, the UK, and Israel. Finally, 500 Startups continues to be a major player in Mexico City, having invested in over 150 startups in Latin America. According to Partner Santiago Zavalo, 500 Startups Latam startups have gone on to raise over $300M in funding. Some of its success stories include online lending platform Konfioc and mobile payment platform Clip. The rapid growth of Mexico City’s tech scene should also be attributed in no small part to three factors: government support, funding opportunities, and tech talent. Of these three resources available to entrepreneurs, the future of one is in doubt, while the other two are far from being tapped.On December 1, President-elect Andrés Manuel López Obrador will take office, leaving in question what has been an ambitious government commitment to fostering tech entrepreneurialism. Through the Instituto Nacional del Emprendedor (INADEM), the federal government has provided around US$658M to over 620,000 entrepreneurs to jumpstart the ecosystem. Led in part by former Managing Director Adriana Tortajada, INADEM reportedly helped create 6000 companies and 73,000 jobs.But if the new government deemphasizes investment in innovation, it will occur at a moment when VC investment in Mexico is truly taking off. Mexico received one-quarter of all VC investment in Latin America in 2017, raising a total of US$80M. Among the most notable early-stage venture capital funds are Angel Ventures Mexico, led by Hernan Fernandez; Jaguar Ventures, Adobe Capital, and Arkangeles, managed by Luis Barrios. Ignia Ventures is an early-to-late stage venture capital firm investing in innovative solutions for Mexico’s emerging middle class, while Dalus Capital, which was co-founded by Diego Serebrisky and Rogelio de los Santos, is a fund focused on innovative businesses operating in Mexico and Latin America. Their first fund, Alta Ventures, raised $70M in 2011, and their second fund, Dalus Capital, raised close to $100M in funding. The venture capitalists have led investments in Clip, Kubo Financiero, and Cultura Colectiva, among others.  Alta Ventures, which recently closed perhaps the largest VC fund in Mexico’s history at $70 million, invests mainly in Mexican startup companies and is managed by . Tech entrepreneurs hoping to make it in Mexico city will also continue to benefit from an abundance of tech talent. With university enrollment in the area tripling over the last few decades, and an extremely young population, Mexico produces an estimated 130,000 new engineers every year.In the past 20 years, Mexico City has committed itself to transformation. Drawing on its incredibly rich culture and the shared desire to distance itself from the drug war, the city is remaking its image. The past two decades have witnessed a cultural renaissance, as well as a major revamping of the city’s economy. And in the past 5 years this economic revolution has taken on greater focus, and kicked into hyper-drive, galvanized by a collective faith in the potential of a technology-driven economy. Major international corporations – from Boeing and Ford to HP – have taken notice, investing in high-tech manufacturing. Meanwhile, tech titans like Uber, Google, and Facebook have also set up shop, intent on using Mexico as an entry point into Latin America.And, from the buzzing CDMX tech scene, more and more startup success stories have emerged. From the field of fintech, leading online payments company Conekta closed $6.6 million in series A funding in 2016, the online lending platform for micro-business loans, Konfio, raised $80 million; and micro-loan startup Kueski raised $35 million. Merchant mobile parent company Clip has raised $42.3 million.Additionally, ride sharing app Aventones was acquired by Europe’s Blablacar, and on-demand grocery delivery service Cornershop raised $21M in 2017 before being acquired by Walmart. Yogome, a startup that creates educational apps for children, also recently raised a $26.9 million B round.Co-working spaces and accelerators, including the renowned Startup Mexico, continue to attract foreign entrepreneurs. The organization, founded by Shark Tank judge Marcus Dantus, is backed by both federal and local governments, and boasts multiple campuses, one of which is a 35,000 sq. ft facility that includes over 200 international entrepreneurs. It recently launched a landing program led by Ron Oliver that aims to help entrepreneurs expand into the country.After this period of profitable investments from local and international investors, the momentum looks likely to carry forward. And with this flow of capital, there’s no reason to think the tech scene in Mexico City can’t become one of the principal tech hubs of the world. Internet and banking penetration have risen rapidly, and experienced world-class Mexican entrepreneurs are collaborating with qualified engineers, developing software for these underserved markets. Solutions developed and market-tested in Mexico have unique potential to be scaled throughout Latin America’s emerging economies and/or marketed to their northern neighbor’s burgeoning Latino population, with their $1.7 trillion in purchasing power.For a big city that’s always had a big reputation, a new sort of renown might be on the horizon.    This article was Co-Authored by Peter AndringaThis post is part of our contributor series. The views expressed are the author's own and not necessarily shared by TNW.\nRead next:\n\n        Do cryptocurrencies need a company like Coinbase?    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}