{"id": "Gig workers are forced to educate themselves to survive", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Lan Snell\n            — \n                        in Contributors\nToday’s gig workers don’t just include your local Uber drivers or handymen on TaskRabbit. In fact, there’s a growing subset of knowledge workers who are looking to the gig economy as a viable alternative to full-time employment.Upwork’s 2017 Freelancing in America study predicts freelancers will become the majority of the US workforce in a decade, with younger generations primarily driving that acceleration in freelancing.  It’s called Hard Fork.That’s happening right now — the survey estimates nearly 50 percent of millennial workers in the US are currently freelancing.  The promise of freedom, flexibility and the chance to be their own boss is leading the next generation of workers to reimagine what they want from a career.But the reality is that separated from organizations where personal and professional growth can happen organically, independent knowledge workers will find themselves under increasing pressure to upskill and build new competencies across their specific areas of expertise as well as across business-centric subjects. Without organizational support and a predictable income, they are solely responsible for their own development and that means understanding the core tenets of things like marketing and finance as well as their core area of expertise if they want to be successful. “We will be free agents in the future, with our own personal brands, selling our skills to those who need them.” That’s where 47 percent of respondents in PwC’s 2017 Workforce of the Future Survey, believe we are headed.  But from the moment they decide to take the plunge, gig workers need a value proposition to market their strengths and services. As work finds them, they have to understand client requirements, but also know how to pitch their own ideas. They have to grow a network, build relationships, ensure repeat business, create a pipeline of opportunities as well as get a handle on things like finance and accounting. Despite the growing appetite among organizations to tap into the gig economy, success still depends on an individual’s ability to navigate these complexities and wear many professional hats.Take, for example, a freelance UX designer who has years of design experience and has built up loyal clients along the way. A change in personal circumstances such as a new family might be a catalyst for re-structuring work from full-time to becoming an independent contractor.So the need need to broaden skills and knowledge beyond the core technical domain of design now becomes critical to start up a new business.In Deloitte’s 2018 Global Human Capital Trends Survey, companies listed complex problem-solving, cognitive abilities, and social skills as the most needed capabilities for the future, with “businesses clamoring for workers with this blend of skills, not pure technical competency.” Context matters more than ever in the evolving labor market, along with a worker’s ability to connect the dots. To succeed, gig workers need to develop future-focused capabilities like strategic thinking, analyzing, influencing, and integration, combining these with soft skills like creativity and lateral thinking. Independent workers have to find the sweet spot in the ‘T intersection’, a framework developed by Heather McGowan, a consultant at Work to Learn. The basis of the framework is that in order to keep up with a changing world, professionals must evolve from “disciplinary” or “vertical” workers, to “multi-disciplinary” or “T-shaped” workers.The horizontal intersection, which determines their success, is how they are able to influence clients, manage stakeholders, think laterally and create value. In the examples shared above, a UX designer would need to learn client relationship skills, master new ways of communicating including how to develop and deliver a pitch, and how to build and leverage their networks.With technology accelerating change at the workplace, a college education is no longer enough to stay competitive. Learning has become a way of life, not a stage in life. The problem is compounded for independent workers. They have to constantly reinvent themselves and stay agile, but a 24/7 workday leaves no room for rigid or traditional classroom programs. Besides upskilling to stay relevant, they have to acquire a brand new set of skills to stand out in the dynamic labor market, where their competition spans the world. To stay ahead of the curve, every one of them needs 21st century skills – continuous learning, resilience, adaptability, and the capability to shift course and grow into other areas as professionals. Upwork’s survey found 65 percent of full time freelancers update their skills as jobs evolve, versus only 45 percent of full-time employees. The most successful gig workers constantly prepare for the future and have successfully made the transition to lifelong learners. They embrace formats like online learning which gives them the balance and flexibility to learn with unpredictable schedules. Learning online also gives them access to the in-demand content and future-ready competencies that are critical for their success in the gig economy.No one is as connected to the future of work as the independent worker. In The World is Flat, Thomas Friedman best framed the challenge every worker will face in this labor market of the future, “Today’s workers need to approach the workplace much like athletes preparing for the Olympics, with one difference. They have to prepare like someone who is training for the Olympics but doesn’t know what sport they are going to enter.” \nRead next:\n\n        Email on mobile sucks, but it’ll get better in the next 10 years    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}