{"id": "Why CEOs that say ‘no’ are good for growth", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Jeff Kupietzky\n            — \n                        in Contributors\nIt’s no surprise that life as a startup CEO can be brutally exhausting, with long, grueling workweeks, constant stress, and next to no sleep. And, forget having a personal life, right? In fact, many assume that tackling the role requires a certain amount of neurosis and perhaps just a tad of masochism. Pouring your heart and soul into making a business venture work is just part of the job. It’s called Hard Fork.While that might be true for some, it doesn’t have to be a foregone conclusion that as a startup CEO, you can expect to lose your mind. Having the fortitude to make tough decisions and buck the conventional system can be the secret to keeping your wits and not letting your role as a startup CEO ruin your life. Here are a few strategies.For most startups, funding is king. In the era of VC mega-rounds, unicorns, and sky-high valuations, VC funding is at an all-time high, so it’s easy to see how chasing the big money becomes the primary objective. The problem is that excess funding begets debt, as small companies strive for breakneck growth to satisfy investors, often drowning themselves in a debt-fueled downward spiral where they’re forced to chase even more investment just to stay afloat. Even big companies like Jawbone and the solar-power startup Solyndra, which raked in hundreds of millions in investment each, couldn’t be saved from “death by overfunding.”Just don’t do it. Sure, the prospect of extra-large investment sounds great. But, it also comes with tremendous pressure to grow in lieu of profitability, loss of control, and huge debt. There are plenty of extremely successful bootstrapped companies that prove chasing the money isn’t the only way to the top. Instead, focus on generating income with a basic product and invest those profits to fuel product-centric expansion. If you do accept funding, do small rounds to avoid dilution and too much liquidity.We get it: growth formulas help you to see the potential, but they’re not a guaranteed prediction. Too many startups get caught up in forecasts that seem logical enough — if we can make $10M in sales with two sales reps, adding six more reps should quadruple sales, right? It’s not that simple, so a good CEO needs to say ‘no’ to those ill-conceived predictions.  Building out sales capacity comes with a tremendous amount of overhead, including admin assistance, operating expenses and, of course, personnel benefits. That’s money that likely gets taken away from investments in innovation. And, let’s be honest: even the best and the brightest sales team in the business can’t sell a mediocre product.Instead, invest in building a better product and recruit your product team to pitch to customers. No one knows your product better than they do, and your customers will appreciate this hands-on approach to making sure their needs are met. Stick with the basics — a product you know your customers need — and give them a solution that they can’t live without, rather than one that’s so bloated they won’t know where to start. Get some wins under your belt and leverage those happy customers for referrals to drive new business.Another common mistake among VC-backed startup CEOs is to invest a pile of money in a glitzy headquarters in a swanky part of town. In an era where image is everything, the appearance of success projected through the cool office space with the snazzy espresso bar in the trendiest location is an alluring prospect. It’s also outrageously expensive, and mostly a complete waste of money.Overwhelming evidence shows that most employees would much rather work from home, and they’re more productive, happier, and healthier as a result. With today’s technology, remote work is a no-brainer, and it allows you to hire the absolute best talent to fill every role with zero relocation barriers or expense. Plus, this approach puts your team in the field, closer to your customers, which is where they belong anyway. That means you can invest profits in the talent you need to grow, rather than a box to put them all in.Speaking of boxes, say no to the hierarchical org chart, too. Don’t waste energy and money recruiting people for managerial positions. Instead, hire as needed and keep the hierarchy flat — there’s no need for an EVP, SVP, and VP when just one person can get the job done. Create a team that works well together and gets down to business regardless of fancy titles.Selling off business units or products has somehow become perceived as a signal of distress, that a company is shedding assets in order to stay afloat. And, while sometimes that’s entirely the case — cutting dead weight can provide an infusion of cash that can make or break a company on the verge of collapse — it’s not always a bad thing.In fact, divestiture can be an extremely smart strategic move by allowing a growing company to devote maximum resources to its core offerings or new opportunities for which their current portfolio isn’t well suited. Data shows that companies with focused divestment programs actually outperform their peers by about 15 percent over a 10-year period and see their market cap rise by nearly eight percent. Divestiture also doesn’t mean you’re admitting defeat. Selling to a company with more or better resources can be the best thing you can do for a product that you’ve grown and love and want to see succeed. As a CEO, making your way in the startup world can feel like navigating a field of landmines — everywhere you turn there’s a potential misstep that could prove disastrous. However, refusing to get caught up in the unrealistic expectations and follow the typical path can be not only extremely liberating and exhilarating but also the critical factor in making it out of the startup game with your sanity — and your business — intact.\nRead next:\n\n        Here's why black women's #MeToo experiences are different    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}