{"id": "Trump begs big tech for free labor to avoid federal hirings", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Tristan Greene\n            — \n                        in Google\nThe White House wants the nation’s big tech companies to make it easier for employees to do a civic “tour of duty” with the government. Another way of putting it: the President needs to bring in temps now that his plan to cheat Federal workers out of their promised 2019 pay raise fell apart.This latest assault on Federal employees by the White House comes in the form of a meeting held Monday between lawmakers and representatives from several technology companies. According to a report from The Washington Post, the purpose of the gathering was to convince big tech bosses to come up with policies making it easier for employees to take a leave of absence to temporarily work for the government.Hard Fork.According to The Post, White House deputy chief of staff for policy coordination Christopher Liddell said:The country benefits when patriotic citizens with technical expertise choose to serve at the federal, state or local level.This statement indicates the Trump administration is framing this as a voluntary civic duty, like picking up litter or voting. But is it really patriotic?On President Donald Trump‘s third day in office he signed an executive order freezing pay for Federal employees. It’s the kind of move you expect from a new CEO taking the reigns of a company running in the red. Unfortunately, as the President’s learned in the time since, the US isn’t a business.It’s part business, of course. Capitalism is a large part of what the US is made of, but it’s not the entire recipe. So the President’s plan, which we assume was simply to get a handle on spending, was effective from a fiscal standpoint (think in terms of quarterly reports). And the move likely motivated lawmakers to consider the country’s budgetary concerns under Trump differently, which is a political win.But, there’s an important distinction between the US government and a corporation. Just like the difference between angels and humans – in the Christian bible – only the latter has free will.If your company makes vodka with your name on it, for example, and your business acumen has led you to a point where you can no longer afford to make vodka with your name on it, you can pivot to another endeavor — like creating a university with your name on it.In the business world, the only thing holding you back is your imagination – some would argue this is especially true when it comes to dealing with government regulations.Because, if businesses are the free-willed humans in this analogy, then government represents the angels beholden to the will of their master: in this case, instead of God, the US Constitution.We can try to run the country like a business, but at the end of the day there are certain protections the people have in place which require the government to spend money, even if it doesn’t turn a profit. Just because the President finds a loophole, or a way around spending money on certain budget line-items, it doesn’t mean he’s doing our nation any favors.President Trump has a lot of wiggle room when it comes to the machinations of government, but he also has to contend with Federal hiring and pay practices that have evolved over centuries. And, while it may not be a law, he also has an obligation to ensure the government keeps certain promises it’s made to one of its most vulnerable populations: veterans.There have been times throughout our nation’s history when the popularity of veterans in the public eye has waxed and waned. Vets who served during the Vietnam conflict, for example, were ostracized by the public in many areas of the country. And there remains a stigma surrounding combat veterans: many people aren’t comfortable hiring someone who has been exposed to war for fear we’ll “snap.”The US government, however, disproportionately hires military veterans because it’s promised to do so. We’re told from the earliest days of our basic training that our service will always be remembered and honored by our leaders, and that we’ll receive support when its time to reenter the civilian workforce.Veterans make up more than 30 percent of the Federal workforce. And the Department of Defense employs more US veterans than any other entity, government or civilian, in the world. So, it’s not an exaggeration to say that any policies which affect Federal workers directly affect veterans today, and the future prospects for military service members currently on active duty or in the reserves.Borrowing people from Amazon, Google, or Microsoft is a tourniquet, not a solution. Especially considering that the most important question may be whether these temp workers are going to have access to classified information.This is an incredibly important question. If the answer is “no” it’s obvious this is an attempt to package lowered pay for Federal workers (and less jobs for veterans) as patriotic duty for high-payed tech experts. We already have computer experts working for the government. You don’t need a Microsoft employee on site to perform Office upgrades or other similar technology endeavors, for example.This wouldn’t be any different than threatening to replace workers with robots. The result is the same: people who rely on these jobs won’t be doing them. Instead, someone who has already won the job lottery by getting hired at one of the largest technology companies in the country gets the work.What if the answer is yes and it turns out these projects will involve classified information? Then we need to know who will pay for the lengthy background checks for the on-loan workers. Let’s assume the government won’t. Doing so would defeat the purpose of using temp workers instead of hiring a veteran or other qualified candidate from the job pool because it would cost more.That just leaves big tech to pay for those clearances. And that means there are going to be strings attached whether the government can see it or not. It’s like inviting a fox into your hen house because it knows more about eggs than you.The bottom line is that the White House needs to keep its promises, and protect our interests, even if that means it’ll have to find other ways to pay for Trump’s tax cuts.Bringing in experts on loan, instead of properly staffing the Federal government, won’t fix the gaping holes that already exist in this administration’s science and technology departments. But it will hurt veterans.\nRead next:\n\n        Super Mario Bros. 3 -- the greatest game ever -- just turned 30    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}