{"id": "Sorry to bother you, but I apologize too much over emailLiked this column? It’s part of our Big Spam daily newsletter. Subscribe down here:", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Cara Curtis\n            — \n                        in distract\nAfter clearing out my emails and private messages, I realized I’m never sorry — but every other thread or message I send starts with an apology. “Sorry to bug you!” “I was just wondering…” “…Totally fine if not.” Why do I apologize for existing in every email I send?I saw a tweet over the weekend, and it reminded me of a college class I once took — “how to write like a man,” a.k.a. with unapologetic confidence. As feminist advocate Lois Wyse once said: “Men are taught to apologize for their weaknesses, women for their strengths.”Every work email I send:Hey!\nSorry to bug you!\nWas just wondering\n(If it’s not too much trouble)\nWould it be possible to do thing you said you’d do?\nTotally fine if not!\nProb my fault anyway I’m an idiot :)\nSorry to bother you!\nSorry I exist!\nSo sorry!\nJust let me know!\nEmily— Emily Murnane (@emily_murnane) October 19, 2018It’s all about cryptocurrency and blockchainBesides for literal “sorry”‘s, there was one word I used just as much — “just.” I was always “just” wondering, “just” thinking, or “just” adding my opinion. I used “lady language” to undermine myself and I seemed to rely on emoji to “just” portray my real opinions and emotions.It’s difficult to break the habit of constantly apologizing — whether that’s for when someone else walks into you or you’re trying to chase someone via email.I found a Gmail plug-in offering a solution. Just Not Sorry warns you when you use words such as “just,” “I think,”“I’m sorry,” “I’m not expert,” and “actually” — basically, words that serve no purpose other than to undermine your authority or discredit your skills and knowledge.The plug-in will underline said phrases or words in red. When you hover over the underlined phrases, the tool offers pop-up pearls of wisdom as to why you should amplify, and not undermine, your message.Just Not Sorry is part of a broader effort to encourage women to make their voices heard in the workplace. The pop-up advice quotes experts experts including Sylvia Ann Hewlett, a labor economist specializing in gender, and Tara Sophia Mohr, author of Playing Big: Practical Wisdom for Women Who Want to Speak Up, Create, and Lead. Gender inequality has had its influence on both women’s and men’s speech for centuries. A Gmail plug-in won’t completely dismantle linguistic gender stereotypes, but pointing out simple words that unintentionally undermine certain voices is a step in the right direction.Sorry about this column, I’m no expert at writing confidently.SUBSCRIBE\nRead next:\n\n        Put the 90s (and 900 games!) in your hands with the throwback glee of the RetroMini    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}