{"id": "Become a six-figure salary tech project manager with this comprehensive management bundle", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by TNW Deals\n            — \n                        in Offers\nWhen you think of a project manager, you might think of the man or woman in your business tasked with “the big stuff.” You know, the giant, culture-changing, landscaping-shifting company initiatives.Actually, the most accomplished business leaders will tell you that every project, regardless of size or scope, needs a competent leader. Think about it…why even launch a project if you aren’t dedicated to helping it achieve its best chance at success?It’s in London from December 12-14From grand game changers to day-to-day little victories, knowing the steps to assess, manage and see a project to a positive end are practically universal — and the Complete Project Management Bundle ($29, over 90 percent off, from TNW Deals) can load you up with all the info you need.This package of 11 courses lay out how top-notch project managers assess risk, build teams, establish timelines, allocate resources and monitor progress, no matter how big (or small) the task.Once you’ve got the core principles of PMP, Agile Lean and Agile Scrum down, this training also includes four courses on how to use JIRA, the project tracking app that streamlines every facet of a project’s lifespan from start to finish. After learning the JIRA environment, you’ll be able to easily track how your people are doing on hitting your project milestones on time and on budget.This bundle even gives you Scrum certification testing to get you ready to pass and ace the official certification exam.With nearly 30 hours of material, this course usually costs interested students almost $2,200. But if you get in now before this offer runs out, the entire package is available for pennies on the dollar — just $29.\nRead next:\n\n        Get more cats on your Instagram feed by cheating the algorithm    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}