{"id": "Sony warns gamers could lose saves, progress, DLC access after changing PSN name", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Rachel Kaser\n            — \n                        in Gaming\nWhen Sony revealed earlier this year it was working on a way for PlayStation gamers to change their IDs after 12 years, most — including us — were excited about the prospect. Now, as more details surfaced this week about exactly how name changes will work, it’s got use more than a little nervous. From the sounds of the list of potential pitfalls, we’re suddenly not too keen on the idea.The amount of caveats to changing your name is a little galling — not because there are so many of them, but because each one represents having something important possibly being taken from you. According to ResetEra, side effects of changing your PSN name may include:Not here exactly, but on our new hardware site Plugged.Okay, we made those last three up, but you’d probably feel one or more of them if you were to lose trophies, saves, or DLC thanks to name change, and couldn’t even get them back by regressing to your previous name.We’d heard rumors this might be the case — or at the very least that the name change was complex and could cause a plethora of problems — but it’s still jarring to hear the company say just how much you could potentially lose if you change your PSN name. It almost doesn’t sound like it’s worth it. Not to mention that, after the first name change, it’ll cost you money to try it again.If you still want to attempt to change your name, the update should be coming to users sometime next year. But suffice to say, you’d better have a truly terrible name to want to brave that.\nRead next:\n\n        Mobvoi's TicWatch C2 is a classy Wear OS smartwatch for $200    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}