{"id": "Japan grants cryptocurrency industry self-regulatory statusExplore our decentralized future", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Blockchain, cryptocurrencies, and insider stories by TNW.\n            Powered byIt's not being left alone entirelyJapan has been wrestling the cryptocurrency beast for some time and it looks like the country’s government has finally found a way to end the skirmish.The Japanese Financial Services Agency (FSA) has today given the green light to let the industry regulate itself. The self-regulatory status allows the Japan Virtual Currency Exchange Association to police exchanges for any violations, Reuters reports.It appears the decision was made in response to the rapidly changing cryptocurrency market.“It’s a very fast moving industry. It’s better for experts to make rules in a timely manner than bureaucrats do,” a senior FSA official said in a briefing.The FSA’s approval will allow the industry association to define the rules and safeguards that local cryptocurrency exchanges must satisfy in order to operate legally. However, the association will also be responsible for enforcing and policing any rules it implements.The self-regulatory status allows the industry association to make and enforce regulations without needing government approval. So the cryptocurrency market isn’t being left entirely to its own devices.While this might allow the association to react quickly as the market develops, whether or not this approach will be successful remains to be seen.Japanese netizens have been some of the worst affected by cryptocurrency hacks, having lost over $540 million in the first half of this year. That’s without even mentioning the whole Mt. Gox saga.\n                                    Published October 24, 2018 — 15:43 UTC\n                                \n                                        October 24, 2018 — 15:43 UTC\n                                    12 - 14 DECEMBER - ALL OVER LONDON Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}