{"id": "Marshall Islands forges ahead with national cryptocurrencyExplore our decentralized future", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Blockchain, cryptocurrencies, and insider stories by TNW.\n            Powered byPresident Hilda Heine survives, and so does the SovereignThe Republic of Marshall Islands (RMI) president Hilda Heine has survived a vote of no confidence by just one vote, meaning her proposed national cryptocurrency is still on the cards.Heine’s opponents were unable to find the majority required to oust Heine over persistent plans to alleviate the nation’s reliance on the US dollar with a national cryptocurrency called “the Sovereign,” Nikkei Asian Review reports.RMI’s parliament ended split evenly over whether to remove Heine from her leadership, 16 to 16. Heine will continue to serve as the nation’s head of state.The decision to vote was realized after eight senators accused Heine of ruining the nation’s reputation with her idea of a state-backed cryptocurrency.Straight after the vote, RMI finance minister Brenson Wase reportedly confirmed the government’s intent to launching the Sovereign, pending it meets requirements set by regulators from the US, Europe, and the International Monetary Fund (IMF).The Sovereign was first revealed at the start of the year, when government ministers announced it would issue a new digital cryptocurrency via initial coin offering (ICO), intended to be used as legal tender.But just last month, the IMF warned Heine to ease off on launching the Sovereign, or face being cut off from the US dollar altogether, which RMI uses to access critical monetary meant to curtail spiralling inflation.To date there has been little evidence for Heine giving up on the idea of a sovereign cryptocurrency any time soon, and surviving today’s vote could only bolster her confidence – that is, until the IMF catches wind of these results.\n                                    Published November 12, 2018 — 16:42 UTC\n                                \n                                        November 12, 2018 — 16:42 UTC\n                                    12 - 14 DECEMBER - ALL OVER LONDON Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}