{"id": "Apple unveils new iPad Pro with tiny bezels, Face ID, and USB-C", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Gadgets for humans\n            It's a new era for the iPad ProThe iPad hasn’t changed its look much since its inception. It’s always been a tablet with a prominent home button, a proprietary port, sloping sides, and chunky bezels. That changes today.The new iPad Pro features an entirely different design to what we’ve seen before, looking a bit more like the MacBook Pro family with a flatter design and thinner bezels. Apple removed the Home button in favor of FaceID, and the company has switched from a Lightning connector to USB-C (finally!). The new port means you can use a whole new range of accessories – and can even use the iPad Pro as a makeshift battery pack for your phone.However, there is no headphone jack. Sighs.Apple also took a new approach to sizing the iPads. The smaller model gets an upgrade from 10.5-inches to 11 inches in the same footprint. The larger iPad, on the other hand, retains the same 12.9-inch screen size, but shrinks the body down significantly; Apple says its nearly the same size as an 8.5 x 11 sheet of paper. At 25 percent less volume, it should make it for a much more palatable size for those who need the extra screen real estate.Naturally, Apple says the iPad Pro has its best iPad Display yet. It’s Apple’s brighter and most color accurate iPad display, and still features True Tone color adjustments and that awesome 120hz refresh rate. Audio is better and louder too, now with a dedicated woofer and tweeter for each of the four speakers.And of course, the new Pros are more powerful. A lot more powerful, in fact. They use an A12X Bionic chip – and upgraded version of the A12 in the iPhone XS – with an 8 Core CPU and 7-core GPU. That means 35 percent faster single-core performance and up to 90 percent faster multi-core tasks. Apple says the tablets are faster than 92 percent of laptops shipped in the last year – including many Core i7 models.The company also took a bit of a dig at Microsoft: with 2x faster graphics performance, the new iPad Pro is about as powerful as an Xbox One S for gaming, but in a much smaller package.The company is also refreshing the Apple Pencil for the first time. Most notable is the inclusion of a double-tap feature that should at least partially make up for the Pencil’s lack of buttons. The new pencil also includes magnets to stick on the side of the iPad Pro – akin to Microsoft’s Surface Pen – but now charges wirelessly when attached. There’s also a new Smart Keyboard Folio that involves less origami to get into typing position.It all adds up the biggest update to the iPad ever. With USB-C compatibility and a lot more power, the iPad Pro is starting to look more like the PC alternative it was originally positioned as. The change of a port may not sound like a big deal, but it means you can connect monitors, hard drives, and other accessories a lot more easily than before, as well as share accessories with MacBooks and PCs.  It’s about time, and I hope Apple moves onto USB-C for its iPhones next year as well.The new 11 and 12.9-inch iPad Pros are available to order today, starting at$799 and $999, respectively. Configurations range from 64 GB of storage to 1 TB. Devices are expected to arrive next week on November 7.\n                                    Published October 30, 2018 — 15:24 UTC\n                                \n                                        October 30, 2018 — 15:24 UTC\n                                    Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}