{"id": "Here’s what a cryptocurrency ETF is (you’re welcome)Explore our decentralized future", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Blockchain, cryptocurrencies, and insider stories by TNW.\n            Powered byGet ready, ETFs are comingWelcome to Hard Fork Basics, a collection of tips, tricks, guides, and advice to keep you up to date in the cryptocurrency and blockchain world.If you’re into cryptocurrency trading you might have seen the acronym ETF bandied about from time to time. It’s becoming increasingly common as ETFs seek regulatory approval, but what exactly is an ETF and should you care about them?Before we get into the nitty gritty of what an ETF is, it might help to know that it stands for Exchange Traded Fund – I said it might help. The “fund” bit is important though, so listen up.ETFs are not a new invention. They have been traded on traditional stock exchanges for many years. Effectively an ETF packages up a commodity, index, or bundle of assets to create a fund. Shares in this fund are then traded on stock exchanges. As with all things traded on stock exchanges, prices will go up and prices will go down.The important thing with ETFs though is that when you buy one, you never actually own the underlying asset packaged in that individual fund. You just own a share of that fund. As a shareholder you have rights to any profits the fund generates, but if the market tanks so will the value of the shares you hold. An ETF won’t make you immune to the market.ETFs are a method financiers use to offer exposure to markets, while trying to reduce risk to investors.In principle a cryptocurrency ETF is not that different to a conventional ETF. Rather than packaging commodities or assets, a cryptocurrency ETF packages – you guessed it – one or more cryptocurrency.In a cryptocurrency ETF the fund would own the underlying assets it tracks and would sell shares of these assets. You should note, buying into an ETF means you’re not buying the assets it tracks, but you’re still being exposed to the market’s price fluctuations. Cool financiers call this “synthetic exposure” because it lets investors get into the market without actually buying into that market.In some ways, buying an ETF can be safer than buying individual cryptocurrencies or tokens. In the US, custodians of ETFs are regulated by the Commodity Futures Trading Commission (CFTC) and must provide certain levels of transparency. The Securities Act of 1933 and Securities Exchange Act of 1934 dictate that custodians must disclose the performance of ETFs in annual reports to allow investors to make informed decisions.Also, from a security point of view, it’s in the custodian’s interest to protect the assets held in that ETF, because without them their product is pointless.. When you hold coins yourself you’re always at risk of being hacked.Well, maybe.For some, cryptocurrency adoption, no matter what form it takes, is a good thing. Others prefer to stay true to Bitcoin’s crypto-libertarian roots. A cryptocurrency ETF is an undeniable deviation Bitcoin’s original objective of creating a form of digital cash that exists outside of regulation and governmental control.Whether cryptocurrency regulation is a good thing is another conversation, but it seems to gain the security of an ETF, you have to sacrifice some cryptocurrency-based freedom.Tough luck. At the time of writing there are no cryptocurrency ETFs in the US, but they are on their way. There are some products already on the market that are like ETFs, but differ in a couple of crucial ways.Abra, a cryptocurrency wallet and exchange provider, recently launched its “BIT10” bundle. This “ETF styled” token tracks the top 10 cryptocurrencies of the month by marketcap. Sounds like an ETF, but it’s not as it can only be bought and traded on Abra’s platform. It’s also, by the traditional ETF definition, unregulated.Coinbase also recently launched its “Bundles,” which have an air of ETF about them. A Coinbase bundle is a collection of the top five cryptocurrencies of the day, weighted by marketcap.But again, they are not an ETF, because in this case you do actually end up owning the cryptocurrency assets in the bundle. In this case, Coinbase is just doing the legwork to buy and store your coins for you.Others like ProShares, Direxion, and GraniteShares have all had their proposed cryptocurrency ETFs denied by the Securities and Exchange Commission (SEC) on the grounds that they could not satisfactorily demonstrate their ability to prevent fraudulent and manipulative acts and practices.While there might not be any cryptocurrency ETFs on the market yet, understanding what an ETF is kind of important.As cryptocurrency exchanges and platforms endeavor to grow their user base, being able to tell the difference between an ETF, a bundle, and market tracking tokens is crucial to making wise investments.We’ll be publishing explainers on all of these in the near future, so keep an eye on Hard Fork. And make sure to join us at our very first cryptocurrency and blockchain event in London this December. More info here. \n                                    Published October 30, 2018 — 16:39 UTC\n                                \n                                        October 30, 2018 — 16:39 UTC\n                                    12 - 14 DECEMBER - ALL OVER LONDON Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}