{"id": "Nintendo’s Switch just outsold the GameCube", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Rachel Kaser\n            — \n                        in Gaming\nThe growth of the Nintendo Switch has been nothing short of meteoric, easily surpassing those of the disappointing Wii U within months. Now, according to a new report from Nintendo, the Switch’s lifetime sales just surpassed those of the GameCube.The Switch’s lifetime sales, as of this writing, have reached over 22 million units, which surpasses not only the Wii U’s 13.6 million units, but the GameCube’s 21.7 million units. For reference, the next most successful Nintendo console was the Nintendo 64 at 33 million units and the most successful (in non-handhelds) is the Wii at 101 million units.It’s all about cryptocurrency and blockchainThis is significant not so much just because sales keep climbing — I could have told you that would eventually happen — but because of the differences between the Switch and the GameCube that highlight how Nintendo has changed and adapted to the changing market.We’ve pointed it out before, but the Switch hasn’t exactly put a lot of work into exclusive games. Yeah, it’s got a few killer titles — Super Mario Odyssey, Breath of the Wild, Mario Kart. But for the most part, when you hear news about Switch games, it’s a port of another game, such as Dark Souls, LIMBO, or most recently ARK: Survival Evolved. And every time, the unspoken implication is that Nintendo is to be commended for allowing outside games into its library, as that hasn’t always been the case.With the GameCube, for example, the games I remember the most from that console are the likes of Twilight Princess, or Mario Sunshine, or Fire Emblem: Path of Radiance. Of course there were popular non-Nintendo titles made for the GameCube — hello, Resident Evil franchise — but the most popular games for the console were almost invariably first-party.So it’s a bit of a surprise to see Nintendo put such an emphasis porting third-party games — and even more so because that appears to be working for them. The Switch’s sales figures don’t appear to be plateauing at the moment, though admittedly the console will have to do some pretty frantic holiday sales if it wants to meet its projected yearly goal.In the meantime, Nintendo is holding a Direct later this week to show off new details about the upcoming Super Smash Bros Ultimate. If any first-party Nintendo title in the world were to boost the Switch into Wii-like numbers, I think it’d be that one.\n\nNintendo Switch sales top 22.86 million, overtaking the GameCube\non VG247\n\n\nRead next:\n\n        Social media mobs are worse for society than the people they shame    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}