{"id": "The new space race is all about satellites: Pros and cons of each orbit", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Stewart Sanders\n            — \n                        in Contributors\nFor most people, satellites probably bring to mind things like weather forecasts, GPS, or satellite TV broadcasting. Other common satellite applications, such as extending cellular coverage, connecting ATM machines, and restoring communications infrastructure quickly, among others, often go unnoticed since they’re not visible to users. But with the FCC recently granting SpaceX, and OneWeb before it, a license to launch thousands of Low Earth Orbit (LEO) satellites into space to deliver consumer internet services, as well as Facebook’s confirmation of its own plans to deliver LEO broadband access, satellites in every orbit – including Medium Earth Orbit (MEO) and Geostationary Orbit (GEO) satellites — are now generating renewed attention for their potential to shape the oncoming digital era and unite people around the world with gigabit broadband connectivity… from space.  It’s called Hard Fork.While broadband needs have traditionally been met through technologies like fiber, copper, microwave, and 2G/3G/4G, satellites can now deliver connectivity with similar performance, including multi-gigabit speeds and low latency. It can work in tandem with, and in some cases completely replace these traditional internet transport methods. This “new space” industry is fueling strong market demand, along with ecosystem and technology innovation, leading venture capitalists to invest more than $1.8 billion in 2015, more than in the previous 15 years combined.Whether you’re a service provider, government agency, enterprise or consumer — an entire multi-orbit satellite ecosystem is opening up above us, driving new opportunities for gigabit connectivity and broadband services. Here’s what you need to know about each orbit and its role in the emerging satellite universe. The basics — GEO satellites have been in orbit for more than 50 years, with the first ones launched in the 1960s. These high-orbit satellites travel at the same angular velocity as the Earth, remaining stationary over the same spot (hence the name geostationary). A satellite antenna on the ground can therefore face a fixed point in the sky. There are hundreds of GEO satellites in orbit today, delivering services ranging from weather and mapping data to distribution of digital video-on-demand, streaming, and satellite TV channels globally. Pros — Because the antenna on the ground does not need to track the GEO satellite in the sky, its design can be quite simple. And by virtue of the geostationary altitude, broadband service can be started with just a single satellite since it can cover one third of the globe. GEO satellites can provide global coverage with far fewer satellites than MEO or LEO as their distance from Earth allows them to cast a wider beam. As a result, it only takes about three GEO satellites to provide coverage that spans the Earth.Cons — While their distance from Earth delivers coverage advantages, it can come at the cost of latency. GEO satellite beams travel the longest distance to their destination, making them less ideal for applications where low latency is critical – such as native 4G networks. The higher orbit also means greater signal power losses during transmission when compared to lower orbit; something that needs to be accommodated in the design of the system equipment.  The basics — Historically, MEO constellations have been used for GPS and navigation applications, but in the past five years, MEO satellites have been deployed to provide broadband connectivity to service providers, government agencies and enterprises –  ultimately connecting millions of end users. Current applications include delivering 4G LTE and broadband to rural, remote, and underdeveloped areas where laying fiber is either impossible or not cost effective – such as cruise or commercial ships, offshore drilling platforms, backhaul for cell towers, humanitarian relief camps and military sites, among others. In addition, service providers are using managed data services from these MEO satellites to quickly restore connectivity in regions where service has been lost due to undersea cable cuts or where major storms have occurred. Pros — Their close distance enables low latency broadband delivery, with levels comparable to the performance of fiber transmission. This kind of fiber-like performance will become even more important as satellite capacity growth is increasingly fueled by high-throughput, data-centric use cases like broadband connectivity — instead of traditional video-centric applications. In addition, MEO satellite constellations can cover the majority of Earth with about eight satellites.Cons — While MEO satellites already deliver very low latency compared to GEO, their higher orbit means they may not reach quite the same levels planned by the new LEO operators, although the difference may be negligible depending on the application. Also, because MEO (and LEO) satellites are not stationary, a constellation of satellites is required to provide continuous service. This means that antennas on the ground need to track the satellite across the sky, which requires ground infrastructure that is more complex in comparison to GEO. The basics — While there are several LEO constellations in operation today from companies like Iridium, Globalstar, and Orbcomm, they primarily serve low-throughput voice and data applications. The coming wave of LEO satellites intends to serve different markets, specifically those that require high-throughput connectivity like consumer broadband, mobile backhaul and enterprise VSAT for connecting remote sites and employees. Because these satellites operate closer to Earth than other orbits, their coverage area is smaller. This is why the emerging LEO operators plan to launch hundreds — or in some cases, thousands — of these satellites into orbit to achieve global, continuous coverage. LEO constellations will continuously hand off communications signals and traffic across their vast satellite network in order to provide wide-scale, seamless geographical coverage to users. Since this generation of LEO satellites has not yet launched, here’s a quick look at what’s being planned and discussed.Pros — LEO satellites are focused on delivering internet coverage that can span the globe, and with their close proximity to Earth, operators expect to offer the lowest latency levels of any of the satellite orbits. This proximity also means it is cheaper and requires much less fuel to launch a satellite into LEO than to launch into MEO or GEO.Cons — Due to the high number of satellites required in LEO constellations there are expected to be high initial manufacturing and launch costs and more expensive ground hardware compared to GEO. Since the LEO constellations have not launched yet, the availability of satellite spectrum for that many satellites and coordinating traffic across them without adding latency are also questions. Gone are the days when satellites were simply a “last resort option” for connecting remote areas. Like traditional, terrestrial connectivity services, satellites are fast becoming a standardized and mainstream connectivity option for delivering high-speed broadband services to people everywhere in the world, regardless of location — whether on land, or in the sea or air — and geographical conditions. And as this new satellite ecosystem takes shape, the potential applications won’t be constrained to one orbit. Constellations are already operating together across orbits today, and as we move forward, we’ll see even more value created by optimized routing of traffic over multi-orbit networks. For example, MEO constellations that use software-defined networking have the ability to automatically failover to GEO satellites for backup broadband services. And we are likely to see a convergence of LEO, MEO, GEO, and even terrestrial technologies, in order to meet the low latency and gigabit connectivity requirements of native 5G networks.One thing is clear — the developing multi-orbit satellite universe is set to play a crucial role in delivering broadband access to connect the world and enable the digital era. \nRead next:\n\n        Become a six-figure salary tech project manager with this comprehensive management bundle    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}