{"id": "Call of Duty: Black Ops 4 posts $500M sales and it’s still a disappointment", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Rachel Kaser\n            — \n                        in Gaming\nActivision’s latest entry in the venerable Call of Duty franchise is cleaning house and then some. After only a few days on the market, Call of Duty: Black Ops 4 has already made half-a-billion dollars — and yet apparently that’s still not enough to impress some of the company’s investors.According to Activision, the number of players over the opening week is a new record for the series, and it had more airtime on Twitch than any other game in the series. It was actually quite dizzying how many streamers were playing the game. Even seasoned Fortnite veterans in my follow list were taking up the BlOps banner. By all layman’s metrics, the game is a success.It’s called Hard Fork DecentralizedOne could argue the main reason for Black Ops 4‘s instant success is its timely leap onto the battle royale bandwagon. From what I’ve seen, the series’ distinctive brand of polished FPS combat mixed with the fast pace of the shrinking battleground. Honestly when I first heard the company was making the BR leap, I was not particularly enthused, but it seems to have worked out in CoD‘s favor.And yet…Activision Blizzard stocks are taking a bit of a tumble. It doesn’t look as though the market was particularly impressed with the sales. And though the numbers do sound impressive, it’s worth noting that last year’s Call of Duty: WWII also posted very similar numbers during its release window. Nasdaq noted the drop and speculated that other releases in the same timeframe might have chipped away at investors’ faith in the game’s success. But there might be another factor.It’s hard to imagine, given that it’s been such a gaming mainstay, but Call of Duty is a fifteen-year-old franchise. The first game released in 2003, and the series really hit its stride as a cultural touchstone with Modern Warfare. And it’s been a consistent bestseller ever since. I’ve known some gamers in my life who bought and played each year’s CoD iteration and nothing else. Each game has, to my knowledge, done such incredible sales that hearing that BlOps 4 has done the same isn’t terribly impressive.If investors were expecting the latest game to improve on the success of Call of Duty: WWII, then that might explain the stock drop. Even though the game is apparently smashing records all over the place, at least according to Activision, if it’s showing the same numbers as WWII, then it’s no surprise investors are reacting with a metaphorical yawn.Regardless, Activision isn’t done with the property yet. According to Rob Kostich, the series’ GM, “There’s much more to come, we’re just getting started.”\nRead next:\n\n        It's only a matter of time until terrorists use AI as a weapon    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}