{"id": "Everything Apple announced at their October 2018 hardware event", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Rachel Kaser\n            — \n                        in Apple\nApple‘s second hardware event of the year was basically to give some show time to its second string of devices. Most of the announcements we anticipated ahead of time, and it’s a bit of a disappointment we’re not going to get Airpower mats any time soon. But still, Apple delivered on some impressive-looking devices.Here’s everything Apple showed at today’s event.Those sweet cool gadgets?The company opened with an ode to the Mac. CEO Tim Cook revealed it’s reach an active install base of 100 million Mac users, 51 percent of which are new buyers. And, according to him, it’s time for a “new Macbook Air.”The new Air will come with a 13.3″ Retina display, with a 4 million-pixel resolution. The aluminum bezels are also being replaced with narrow black glass. It’ll also have a Touch ID sensor built into the keyboard, like Apple‘s handheld devices. Apple also promised the device will have better processor and storage options, along with a more stable keyboard and larger trackpad. Despite all of these new features, it’ll weigh only 2.75 pounds.The new Macbook Air will be available in three new finishes, starting at $1199. It’s available to order starting today, and to buy starting next week.Read more: Apple is finally updating the MacBook Air with a Retina displayCook, who looked like he’d had entirely too much coffee this morning, next revealed a “small but mighty” Mac device — the new Mac Mini, available in a sexy new space grey finish.The company touted the better processors, in particular quad-core and 6-core options, which apparently makes the new device five times faster than before. It will also be available with up to 64 GB of memory, and starts with 128 SSD in storage.Starts at $799. Like the Macbook Air, it can be ordered today, and will be available next week.Read more: Surprise – Apple’s Mac Mini has a new color and higher specsAs expected, the new iPad Pro was the darling of the event. Coming in both 11 and 12.9 inch variants, it’s 5.9 millimeters thin, a full 15 percent thinner and 25 percent smaller than its predecessor. And, as expected, it now has Face ID replacing the Home button.Due to the lack of a button, it uses the gestures from iPhone X. It runs on the A12X Bionic chip, with graphics apparently comparable to an Xbox One S. It’ll also come packed with magnets that allow users to attach their Apple Pencil and the new folio keyboard, which can also be charged wirelessly when attached.And, as expected, they’re moving to USB-C, making them the first Apple devices to do so. This means the iPad Pro can be hooked up to a number of new devices, and even used as a charge port for a phone.The 11-inch model is available starting at $799, and the 12.9-inch at $999. They’re both available to order today and will arrive in Apple stores on November 7.Read More: Apple unveils new iPad Pro with tiny bezels, Face ID, and USB-CIn addition to the hardware, Apple also announced it’d be adding 60 new sessions to its “Today at Apple” in-store teaching programs. According to Angela Ahrendts, head of retail, the sessions will include video and music editing, photo labs for kids, and special photo, video and music labs for teachers.In addition, the Apple Store app will now show users events at the Apple store closest to them, and can be tailored by which devices they own.Tim Cook also took a moment to introduce the latest iOS update, which will be released today. The most notable changes with the update are the new Group Facetime and 70 new emoji. The latter means we’re finally getting the emoji revealed back in July, which includes new emoji for red hair, grey hair, and no hair, along with a lettuce, a peacock, yarn, and a cupcake.That’s everything, aside from a performance by a nervous Lana Del Rey. Hopefully we’ll see more of the new iMac some time next year, since we got no teases this time around.\nRead next:\n\n        D'Angelo slipped a brand new song into Red Dead Redemption 2    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}