{"id": "Red Dead Redemption 2 has biggest opening weekend in entertainment history", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Callum Booth\n            — \n                        in Gaming\nRockstar’s Wild West adventure game, Red Dead Redemption 2 has achieved the biggest opening weekend in entertainment history. Yes, in entertainment history. Movies, music, books – everything.To be perfectly honest, this shouldn’t comes as much as a surprise – Rockstar games are incredibly popular. While Red Dead Redemption 2 had the biggest opening weekend in entertainment history, the studio’s previous game – Grand Theft Auto V – still holds the record for three-day retail sell-through.Those sweet cool gadgets?In other words, Red Dead Redemption 2 grossed $725 million over three days, while Grand Theft Auto V managed over $1 billion. Respectively making them the second and first highest grossing entertainment launches in history.Want some more facts? Well, luckily we’ve got some.Red Dead Redemption 2 had the:Those are some pretty impressive numbers and reflect the quality of the game. In our review of Red Dead Redemption 2, we referred to it as the Game of the Year – a sentiment that has been echoed across the press.While this success should be lauded – especially as video games are not held in the highest esteem by mainstream culture – we shouldn’t just blindly praise Rockstar without acknowledging the company’s recent controversy.It started in a Vulture profile of Rockstar founder, Dan Houser. He said that the team “were working 100-hour weeks” and this led to a huge backlash from staff, as well as the media.It’s been nearly a decade since I parted from Rockstar, but I can assure you that during the GTA IV era, it was like working with a gun to your head 7 days a week. “Be here Saturday & Sunday too, just in case Sam or Dan come in, they want to see everyone working as hard as them.” https://t.co/TaQS5LnaAa— Job J Stauffer (@jobjstauffer) October 16, 2018While not every post about Rockstar working conditions was negative, many were. And this shouldn’t be the case.With the company breaking sales records, they’re undoubtedly making enough money to look after their staff better.Basically, congratulations on Red Dead Redemption 2’s accomplishments, Rockstar. But treat your people better – you can afford it.\nRead next:\n\n        Here's what a cryptocurrency ETF is (you're welcome)    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}