{"id": "Do cryptocurrencies need a company like Coinbase?", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Gary Eastwood\n            — \n                        in Contributors\nAround the world, popular cryptocurrencies like Bitcoin and Ethereum are being embraced by wide swaths of investors and tech enthusiast alike, which has generated a surge in cryptocurrency-supporting technologies, platforms, and websites. One of these supporting companies, Coinbase, has itself garnered a global reputation thanks to how much of a staple it’s become in the broader cryptocurrency community. But does cryptocurrency really need a company like Coinbase to suceeed?As we’ll come to see, if cryptocurrencies ever really hope to become mainstream, some fundamental changes need to be made, and the widespread embracing of companies like Coinbase is a great place to start.Not here exactly, but on our new hardware site Plugged.Bitcoin’s historic rise drew global media attention for good reason; so many investors around the world are embracing cryptocurrencies that they’re starting to garner absolutely massive valuations, and some are even arguing that cryptocurrencies are becoming the new way of doing business before our very eyes. The cryptocurrency market as a whole is seeing some seriously explosive growth right now, and it’s unlikely to slow down anytime soon. Some crypto-investors still worry, however, that cryptocurrencies as we know them today may never be able to reach their full potential without the help of companies like Coinbase.This is because, despite its popularity with crypto-miners and investors views across the globe, cryptocurrencies as a whole remain relatively untrusted by today’s leading financial institutions and state governments. If you take a look at the way many central governments and financial institutions are starting to target leading cryptocurrencies like Bitcoin with more regulations, you’ll come to realize that the era of cryptocurrencies could very well be brought to an end by excessive regulations if these new digital currencies don’t adapt in order to survive.That’s where companies like Coinbase come in. Coinbase, one of the most popular cryptocurrency exchanges on the web today, is already beginning to attempt to woe over Wall Street titans by harking a new suite of products that could prove to be more alluring to established financial behemoths. Many leading banks and financial institutions harbor deep suspicions about today’s leading cryptocurrencies, often claiming that the success of such digital currencies as Bitcoin stems not from its value as a currency, but rather thanks to its nature as a highly speculative asset. If these barbs continue to be flung back and forth, cryptocurrencies may never become truly mainstream in the way that other, physical currencies are.But will Coinbase’s recent efforts to persuade institutional investors that cryptocurrencies are the way of the future change things? If Coinbase is successful in its efforts, it could radically revamp cryptocurrencies as we know and love them today. One of the primary reasons these digital currencies remain so popular with those who love them is that they’re largely decentralized and anonymous, however, which could prove to be an insurmountable obstacle for companies like Coinbase that hope to render these cryptocurrencies more legitimate in the eyes of the broader public.If companies like Coinbase are to ultimately succeed, they need to come up with innovative ways to make cryptocurrencies like Bitcoin and Ethereum more enticing to a broader audience of investors without sacrificing the fundamental traits that made these digital currencies so popular in the first place. This could mean educating more developers in the benefits of the Blockchain, which underlies cryptocurrency technology. There’s already software available that makes it easier, but this needs to be communicated to investors as a safe and viable way of doing business. After all, getting rid of your core financial constituency is a surefire way to tank any fledgling currency, be it digital or not.If professional financial gurus and established financial institutions are to adopt cryptocurrencies en masse, they’ll want certain sets of tools that help make these digital currencies more legitimate and secure. These established financial titans will demand more intense third-party auditing, to start with, not to mention better storage techniques for crypto-assets, which are designed to be traded frequently. If companies like Coinbase don’t persuade today’s economic leaders that these digital currencies can be revamped, they may never truly become mainstream.Luckily for lovers of cryptocurrency, Coinbase appears to be enjoying some early successes, and isn’t likely to halt its efforts to make digital currencies sounder anytime soon. Some critics of Coinbase have actually argued that the company will be incapable of mustering up the huge financial resources needed to make such assurances, but given that Coinbase is valued at a whopping $8 billion, it stands to reason the company has what it takes to at least put up a strong fight when it comes to mainstreaming cryptocurrencies.Whether or not companies like Coinbase succeed, however, could ultimately be up to the broader cryptocurrency community, which will have to okay such changes to the way it does business before they become more commonplace. You should expect big things from these companies, however; with such huge sums of capital at stake, crypto-exchanges like Coinbase aren’t likely to fail in their attempts to make cryptocurrencies more popular.This post is part of our contributor series. The views expressed are the author's own and not necessarily shared by TNW.\nRead next:\n\n        Battlefield V devs reveal how they recreate era-appropriate sounds    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}