{"id": "Even bankruptcy can’t keep Vertu from selling $4,000 phones", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Gadgets for humans\n            With inflation and technological degradation it makes it a worse proposition every day that passesUK-based brand Vertu made a name for itself handcrafting luxury phones that included premium materials, precious stones, and a global concierge service. It went under a year ago, because (shocker) not enough people were buying its $20,000 devices. But if that sounds like your idea of a daily driver, you’re in luck: Vertu’s back with a handset starting at just $4,200.The company is now hawking the Aster P, a 4.9-inch Android phone with 133-carat sapphire crystal glass, a titanium body, and a leather rear panel – you can choose from lizard or crocodile hide.It’s certainly eye-catching, with its polished metal accents, large bezels, and gull-wing doors on the rear for its SIM card trays.Under the hood, you’ll find a mid-level Snapdragon 660 processor paired with 6GB RAM and 128GB, a single 12-megapixel camera on the rear, a 20-megapixel selfie camera, and a 3,200mAh battery.Those specs aren’t terrible, but that’s certainly not the sort of hardware you’d expect to see in a phone that starts at $4,200 and goes up to $14,120 for the gold variant. If you’re not put off by those price tags, you can pre-order it in China from this page. It’s worth noting that it comes with the aforementioned concierge service, so you’ll probably need to ditch your existing one before switching phones.Via 9to5Google\n                                    Published October 19, 2018 — 12:51 UTC\n                                \n                                        October 19, 2018 — 12:51 UTC\n                                    Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}