{"id": "Email on mobile sucks, but it’ll get better in the next 10 years", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Olof Mathé\n            — \n                        in Contributors\nIt’s not the apps – they’ve got better. It’s not even the devices – they’re faster, slicker, with shortcuts and enhancements that make it easier, but not good.The problem is the medium itself – mobile communication has aspired to take over the entirety of our business communication, but the awkward way in which we type and the inconsistencies of a purely touch-based interface utterly shred precision and accuracy.Visit Hard Fork.I should also be clear that I’m talking about phone-based communication. Allegedly, Jack Dorsey, CEO of both Twitter and Square, doesn’t even use a laptop or computer.The article (and many others) have hinted that this may mean he only uses a phone, which I consider utterly preposterous – unless he has entire team members dedicated to tasks that are arduous on mobile – like writing long-form content.Accurate, detailed and well-formatted content simply doesn’t work on mobile. It’s not there, and on tablets is only just becoming viable, as they cross back into the realm of becoming, well, laptops.The issues with phone-based communication in business are obvious:The success of Gmail’s smart replies, though most commonly discussed on desktop, is a glimpse toward a future of automation that isn’t totally automated, but takes the awkwardness in constructing communication out of the equation.Here’s how I see this happening in the next 10 years.Templating is nothing new in business email, but the next logical step is natural language processing and machine learning that can create and customize the workflows for you.This isn’t something that’s going to be unique to mobile – on the contrary, it’ll have a huge effect on desktop communication – but it’s something that will be so common and necessary to making your phone that bit more effective in business.For example, once you finish a phone call with someone, your automated mobile inbox could create a follow-up template with line items to fill in, scheduled to send at the right time.A more complex system would understand your conversations with a prospect in advance, and at a particular time of day would prompt you to send a follow-up email at the right time.Another might be the simpler and more particular stuff – the creation of agendas before meetings handled automatically, with the right people in the “to:” and “CC” field, with the correct dates and formatting handled for you.Why this is so applicable to mobile is that you don’t have to handle the nitty gritty – it’s almost adjacent to a tinder experience of swiping left or right on what particular email to sent.While certain emails may be created based on certain factors, days and calls you’ve made, your mobile phone could actually be a far more efficient interface if AI was capable of creating the emails from scratch based on ones you’d sent before.This (in line with what I’ve said about chatbots previously) is where a chatbot connected to AI is necessary.The creation of an email would be a conversation with a bot that could understand the context of both what you’re saying, your current inbox, and your contacts, and say “okay, you want to put together a short (400-500) word summary of a financial document, sent to Bob, Sally and Barbara” based on a few things. It could then understand a document (after confirming what you’d just said) and produce an email based on it – free of grammatical and spelling errors, and with a quick review you’d have it out the door.This would work incredibly well on mobile – all you need is a quick glance versus a full-screen review. It’ll require trust, but once it works, it will be amazing.There are also smaller-scale yet wonderful ideas you could build from such a system based on more casual conversation. For example, you could direct the email assistant to reach out to someone to catch up, with a little bit of an update about how things have been, with some suggested dates to meet up, and perhaps a few questions to get them thinking on a reply.Finally, as a salesperson this is a natural solution to quick and efficient prospecting – the natural language processing of an AI could learn our particular personal touches, and the general parts of a personalized, thoughtful email can be researched by the AI based on more than just databases you populate, but on recent things in the news, financials from Crunchbase and beyond.One of those incredibly annoying feelings is getting an email when mobile that you’re not able to fully respond to before you get back to your desk.Our AI-based mobile future is one that has an inbox capable of reading itself and producing informed, accurate responses. If someone asks you if you’re able to make a call at 2PM PST, your inbox should be able to consider both your calendar and how many meetings you have booked that day. If you’re free, it produces a well-worded and grammatically sound “yes,” with an invitation prompt filled in with your Zoom conference link attached along with the right people invited. If you’re not free, it can intelligently see the rest of your calendar, and produce a response that’s empathetic and suggesting other answers.More interestingly, it could also respond with potential attachments or links to your Google Drive or other cloud storage. Someone requesting the latest version of a document is a cross-platform annoyance, but is particularly awkward when mobile – unless your inbox can see what it is, respond, suggest a document to you, and create a “here it is – let me know what you think!” reply.Intelligent replies that trigger entire other workflows already exist (we’ve already built some!), but your inbox should, with the right connections, be able to take care of these for you.When a contract’s requested, assuming the right boilerplate contract exists, your inbox could read the request, fill in the necessary details (or request them all on its own), create the signature boxes, send out the contract for signature, and when it’s completed send out a summary email internally to tell everyone the good news. The napkin math of doing that on mobile is headache-inducing – more than likely leading you to give up halfway and head back to the office.While many of these ideas can cross multiple platforms, your mobile device is an incredibly efficient interface for executing commands with those you trust.We’re used to turning on our lights, opening our cars and unlocking our doors with our phones because it’s a tap or two to make them happen – we swipe, we tap, and it’s done. If mobile email could be condensed and automated so that the repetitive, exhausting actions of email are taken away, the entire experience could be vastly preferable to the desktop.Better yet, your desktop emails could become more personal, more focused and more about what you want to do versus have to do.Stay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}