{"id": "Drone assassination attempts are a reminder that better legislation is needed", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Tim Bean\n            — \n                        in Contributors\nIn early August an assassination attempt on Venezuelan President Nicolas Maduro served as a jarring wake up call that the possibility of a drone attack against a public figure or civilian is real. To the security industry and United States Government, this attack was not surprising.Frighteningly, there has been little resolve within Congress to determine who or what security agencies have the authority to mitigate these threats.It’s our cool new gadget site.On June 6th, Senate Homeland Security Committee Chairman Ron Johnson said, “the federal government does not have the legal authorities it needs to protect the American public from these kinds of threats. The threats posed by malicious drones are too great to ignore.”And perhaps less shocking, but still concerning, the Federal Aviation Administration (FAA) reports hundreds of drone “near miss” accidents each year.Hobbyist drone users require no training whatsoever to purchase and operate a drone, meaning that it’s harder to acquire a driver’s license than it is to operate an airborne vehicle with the potential to bring down a 747 airplane.Back in August off the coast of Hollywood Florida, a drone nearly collided with a helicopter, and two weeks before that a drone nearly collided into an Emirates Airbus A380.There is consensus within the private and public sector that led to Congress passing the FAA Reauthorization bill which gives federal agencies or law enforcement the ability to prevent and remove threatening drones.Dangerous drone operators usually fall into one of three categories: clueless, careless, and criminal. However, this law still leaves a gray area for state and local authorities, which are not explicitly included. The first two are still problematic. As a nascent industry, drone hobbyists have not had the benefit of time to fully grasp the critical rules and boundaries to operating a drone.Literally anyone can buy an inexpensive drone, send it aloft and cause major harm if it gets into a no-fly zone or restricted area. But criminal and terrorist drone pilots are the most concerning.Evidence is mounting that terrorists and bad actors are emboldened by insufficient security or preparation for drone strikes. Places like the Gaza strip are fertile ground for these “test runs” where drones can fly at low altitudes, under the radar, if you will, and deposit explosives or nerve gas over the wall. And in June by way of alarming example, Greenpeace activists exposed the vulnerability of the EDF’s Bugey nuclear plant outside Lyon, France by crashing a simple, inexpensive drone into the spent fuel pool building.The events should make Americans questions whether this same kind of activity can happen on US territory.Now that the world has seen the vulnerability of public figures like Maduro, as well as civilians and public infrastructure, the race is on for the public and private sector to join together with a combination of security solutions and clear laws specifying the authority to mitigate threats. There’s a belief that government will solve for the clueless and careless operators by defining and enforcing laws that require drone manufacturers to implement preventative technologies into their drones.It will be up to the private sector, airspace security, and safety companies, to develop solutions that outwit and stop the criminal and terrorist threats with advanced solutions to protect our freedom.\nRead next:\n\n        Gig workers are forced to educate themselves to survive    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}