{"id": "Surprise – Apple’s Mac Mini has a new color and higher specs", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Gadgets for humans\n            It's 5 times faster than the last model (which was released 4 years ago)At today’s New York event, Apple has announced a new version of its Mac Mini. The desktop computer will now come in a Space Grey finish and comes with either four or six core processors.According to Apple, this will make the Mac Mini five times faster than previously – which shouldn’t be much of a surprise as the last version of the hardware was released four years ago.This is how Apple presented the speed upgrade at the keynote:The previous Mac Mini had 16GB of RAM. Now, it can be upgraded to 64GB of 2666 MHz memory. That’s quite a lot of memory, which is great news for designers and video editors.Apple has also increased the storage space of the device up to 2TB – double the previous capacity. These are up to four times faster than the old Mac mini. Again, something to be expected when the last version of the device was released so long ago.Probably the most interesting thing Apple has done with the Mac Mini is focus on connectivity. In fact, it might have actually listened to users. The device includes an ethernet slot, four Thunderbolt/USB-C ports, and two USB-A ports.Oh, and did we forget to say it has a headphone port too? Praise be.Have a look at all of the ports here and drool:Apple has also put its T2 security chip into the Mac mini. Some of its features include an SSD controller that provides your data with encryption as you work.Apple will make the new Mac mini with 100 percent recycled aluminium and 60 percent recycled plastic. Apple actually invented its own aluminum alloy, something it used in the Mac Mini.And, well, the more I think about it, the more badass this seems.The entry-level Mac Mini will come with 8GB of memory, a 3.6Ghz quad-core Core i3, and a 128GB SSD – it’ll retail for $799. It’ll be released on November 7 and pre-orders are open today.Stay tuned to Plugged for more updates.\n                                    Published October 30, 2018 — 14:45 UTC\n                                \n                                        October 30, 2018 — 14:45 UTC\n                                    Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}