{"id": "Cryptocurrency traders are shifting from stablecoins to BitcoinExplore our decentralized future", "paragraph": "\n                    TNW uses cookies to personalize content and ads to\n                    make our site easier for you to use.\n                    We do also share that information with third parties for\n                    advertising & analytics.\n                    \n                Blockchain, cryptocurrencies, and insider stories by TNW.\n            Powered byApparently, backdoors for Feds don't market wellThe second half of 2018 has seen Dollar-pegged cryptocurrencies (stablecoins) flood the market, but recent data suggests that Bitcoin BTC might become the one true stablecoin.The latest report from blockchain research group Diar shows while Tether still accounts for an overwhelming majority of the total stablecoin volume, cryptocurrency traders are actually starting to exchange with Bitcoin directly, rather than use new, regulated alternatives.The October graph below shows the overall trading volume of Tether markets is getting smaller, but the activity of Bitcoin markets has increased between 8 and 10 percent on cryptocurrency exchange OKEx, one of the largest in the world.A similar phenomenon is playing out on Binance. The trade volume of Tether-based pairs has hit new lows, with October’s data indicating the missing volume has actually flowed into Bitcoin pairs.“[…] Traders have now become more amenable to the volatility of Bitcoin rather than risk holding Tether,” Diar notes. “Trading volume of USDT pairs have dropped by a whopping 25 percent from the 15 October “peak crisis” and 17 percent down from the start of the month on Binance.”Whether or not this is a temporary trend is unclear – but it certainly goes against the narrative of a cryptocurrency community desperate for regulated stablecoins.Well, they’re here and they’re underwhelming.I can’t help but think the lacklustre reception has something to do with the outrageously unsettling backdoors built specifically for police that are present in regulated stablecoins.Last time I checked, Satoshi Nakamoto didn’t build a “god mode” for police in Bitcoin.\n                                    Published October 24, 2018 — 10:51 UTC\n                                \n                                        October 24, 2018 — 10:51 UTC\n                                    12 - 14 DECEMBER - ALL OVER LONDON Remarkable progress™Thank you!\nCopyright © 2006—2018.\nAll rights reserved.\nMade with ♥ in Amsterdam.\n"}