{"id": "Tim Cook supports EU’s strict privacy laws — but thinks taxes are ‘crap’", "paragraph": "\n                            TNW uses cookies to personalize content and ads to\n                            make our site easier for you to use.\n                            We do also share that information with third parties for\n                            advertising & analytics.\n                        \n            by Már Másson Maack\n            — \n                        in Apple\nApple‘s CEO, Tim Cook, just endorsed EU‘s push for stricter privacy regulation and defining privacy as a fundamental right, during his keynote address at a privacy conference in Brussels today — too bad corporate taxes weren’t part of the discussion.“Our own information, from the everyday to the deeply personal, is being weaponized against us with military efficiency,” Cook said in his speech.It’s called Hard Fork DecentralizedCook also called for greater action to rebuild trust in tech, to help it reach its full potential: “Users should always know what data is being collected and what it is being collected for. This is the only way to empower users to decide what collection is legitimate and what isn’t. Anything less is a sham.”GDPR has shown us all that good policy and political will can come together to protect the rights of everyone.— Tim Cook (@tim_cook) October 24, 2018Tim Cook has long been an advocate for better data protection standards and his support of GDPR in today’s talk — the EU‘s ambitious regulation which was introduced earlier this year — further cements his stance.Support for better data privacy from the leader of one of the world’s biggest companies is certainly move in the right direction as it could clear the way for similar legislation in the US — which Google and Facebook have been less keen on.Technology is capable of doing great things. But it doesn’t want to do great things. It doesn’t want anything. That part takes all of us. We are optimistic about technology’s awesome potential for good — but we know that it won’t happen on its own.— Tim Cook (@tim_cook) October 24, 2018However, I’d advise against viewing Tim Cook as some saint-like figure, stepping off his pedestal to shower the poor masses with better data privacy. Apple‘s business model is fundamentally different to that of the other tech giants, and that’s why it’s been able to stay on the sidelines while Cambridge Analytica-type storms hit its ‘competitors’.Facebook and Google are actually in the advertising business — turning personal data into money — while Apple makes its buck by selling hardware. It’s easy to see why Cook might then grab the chance to have him seen as a righteous tech leader, as it doesn’t cost him or his company much, and he gets the added benefit of seeing Zuckerberg and Pichai squirm when they speak later today at the conference via video.But what do all tech giants have in common with each other, but not so much with us persons? Not paying taxes.Tim Cook underscored the need for trust in tech to help it reach its full potential, but how can we trust tech giants when they don’t pay their fair share?Only two years ago, Cook wasn’t so zen about EU policy when the union ruled that Apple would need to pay a whopping €13 billion in owed taxes in Ireland, as the country had given illegal tax benefits to the company.Tim Cook had an elegant reply ready to go when he heard the news: He said the ruling was “total political crap.”I’ve argued before that in order to build trust in tech, we need to be certain that big tech plays by the same rules as others do; that’s why EU‘s Commissioner for Competition, Margrethe Vestager, who’s a great tax enforcer was my tech person of the year in 2017.Her motto is society needs to be served by technology and not the other way around — and she’s acted on it. During her term, the EU has repeatedly gone after seemingly untouchable companies and made sure innovation isn’t hurt by unfair competition — which roused the ire of Tim Cook and other tech leaders.Hopefully, Tim Cook will continue his streak of being a champion of the people by not only calling for better data privacy regulation, but also by advocating for better tax practices by big tech companies. Trust in tech can’t be built when companies abuse our personal data, nor can it when tech companies steal from the public by not paying taxes.I’ll salute you, Tim Cook, for taking the right stance on privacy — as soon as Apple stops avoiding taxes.\nRead next:\n\n        Spanish authorities want citizens to disclose all their hodlings    \nStay tuned with our weekly recap of what’s hot & cool by our CEO Boris.\n        Join over 260,000 subscribers!\n    \n                Sit back and let the hottest tech news come to you by the magic of electronic mail.\n            \n                Prefer to get the news as it happens? Follow us on social media.\n            \n1.76M followers\n                        \n1M likes\n                        \n                Got two minutes to spare? We'd love to know a bit more about our readers.\nStart!\n\n                All data collected in the survey is anonymous.\n            "}