{"id": "BTS are the big winners at the People’s Choice Awards as they scoop four of the top gongs", "paragraph": "135.6m sharesThe people have spoken and BTS have once again come out on top.The Korean boyband walked away four-time winners after Sunday night’s People’s Choice Awards 2018, therefore winning all categories in which they were nominated.BTS’ Army did the boys proud as the seven singers picked up the most awards of the night, including Group, Song, Music Video and Social Celebrity of 2018.Though the boys – V, Jungkook, Jimin, Suga, Jin, RM and J-Hope – were unable to attend, the fanbase were obviously thrilled with the quadruple win.To win Best Group, the boys received more votes than Twenty One Pilots, Panic! At the Disco, 5 Seconds of Summer and Super Junior.Accepting the top gong, a video message from the group said: ‘We had such a blast touring America this last month and we can’t wait to come back and see you guys. Shout out to the Army, thank you so much.’Of course, international hit Idol was recognised twice on the night, picking up Music Video and Best Song.And the Army spoke up to name BTS the Social Celebrity of the year too.Jade Thirlwall on how pregnancy rumours inspired the new Little Mix anthemJesy Nelson on the #MeToo movement: 'Little Mix are too intimidating to be harassed'Cheryl will quit pop if her music flops for the sake of son BearThe IDOL singers have topped the Billboard album charts twice – becoming the first Korean act to do so – sold out a world tour, and gained a whole new legion of fans worldwide.Their People’s Choice wins also come off the back of BTS’ MTV EMA win last week in Bilbao, Spain.They won the fan-voted award over Shawn Mendes, Taylor Swift, Selena Gomez and Camila Cabello.It was however recently revealed that the band is not eligible for Best New Artist Grammy because an act ‘must have released a minimum of five singles/tracks or one album, but no more than 30 singles/tracks or three albums in their career to date’ to be considered.Country Artist\nBlake SheltonAction Movie Star\nDanai GuriraFashion Icon\nVictoria BeckhamFemale Artist\nNicki MinajFemale Movie Star\nScarlett JohanssonReality Show\nKeeping Up with the KardashiansAction Movie\nAvengers: Infinity WarMovie\nAvengers: Infinity WarGroup \nBTSCompetition Show\nThe VoicePeople's Icon\nMelissa McCarthyComedy Movie\nThe Spy Who Dumped MeFamily Movie\nIncredibles 2Drama Movie\nFifty Shades FreedMale Movie Star\nChadwick Boseman, Black PantherDrama Movie Star\nJamie Dornan, Fifty Shades FreedComedy Movie Star\nMelissa McCarthy, Life of the PartyAction Movie Star\nDanai Gurira, Black PantherShow\nShadowhunters: The Mortal InstrumentsDrama Show\nRiverdaleComedy Show\nOrange Is the New BlackMale TV Star\nHarry Shum Jr., Shadowhunters: The Mortal InstrumentsFemale TV Star\nKatherine McNamara, Shadowhunters: The Moral InstrumentsDrama TV Star\nMariska Hargitay, Law & Order: Special Victims UnitComedy TV Star\nJim Parsons, The Big Bang TheoryDaytime Talk Show\nThe Ellen DeGeneres ShowNighttime Talk Show\nThe Tonight Show Starring Jimmy FallonReality TV Star\nKhloe Kardashian, Keeping Up With the KardashiansBingeworthy Show\nShadowhunters: The Mortal InstrumentsMale Artist\nShawn MendesAlbum\nNicki Minaj, QueenSong\nBTS, IdolMusic Video\nBTS, IdolConcert Tour\nTaylor Swift, Reputation TourSocial Celebrity\nBTSStyle Star\nHarry StylesComedy Act \nKevin HartGame Changer\nSerena WilliamsMORE: The Kardashians turn out in force for People’s Choice Awards as they urge fans to join relief effort for California wild firesMORE: Victoria Beckham goes ‘Solo Spice’ at People’s Choice Awards as she gives first interview since reunion snub \n\n\n\n\t\t\t\tGot a showbiz story?\t\t\t\n\nIf you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\n\nIf you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\n\n\n"}