{"id": "Swedish student who halted deportation of asylum seeker on flight will be prosecuted", "paragraph": "135.6m sharesA Swedish student who halted the deportation of an Afghan asylum seeker by refusing to sit down on a flight will be prosecuted for her protest, it has emerged.Elin Ersson, 21, filmed herself refusing to sit down on the flight from Landvetter airport in Gothenburg on July 23, despite numerous requests from the crew.She was protesting the deportation of a young Afghan who she thought would be on the flight but it turned out he was not on board.But she still decided to continue her protest to prevent the deportation of another Afghan on the flight, who it emerged had a criminal record.To view this video please enable JavaScript, and consider upgrading to a web\n\t\t\t\t\t\tbrowser that\n\t\t\t\t\t\tsupports HTML5\n\t\t\t\t\t\t\tvideoSeveral other passengers, including an entire football team, joined her protest and the asylum seeker was eventually removed from the plane.At the time, Elin said: ‘I knew I couldn’t back down – I had to do what I could.  I did it as an individual, activist and fellow human being.’‘My point of departure is that he is human and deserves to live. In Sweden we do not have the death penalty, but deportation to a country at war can mean death.‘If someone has committed a crime, they may be jailed and serve their sentence in Sweden.’But now Swedish prosecutors have said Elin will be prosecuted at Gothenburg district court ‘for crimes against the aviation law’ following the incident.They claim she had not complied with the captain’s request and had refused to sit down despite repeated requests from the crew.She faces a fine and up to six months in jail.Gudrun Romeborn, from the group Sittstrejken (Sitdown Strike) which Elin is active in, told The Guardian: ‘Elin’s bravery has inspired a lot of people. But it is important to understand why so many people in the community are working for justice for asylum seekers in Sweden.‘They are not criminals. We are trying to stop deportations to save lives. Europe gives a lot of money to create security in Afghanistan, but it is not working.’No date has yet been set for the trial.If you have a story for our news team, email us at webnews@metro.co.uk.You can also follow us on Facebook and Twitter."}