{"id": "Kim Kardashian hits back after being slammed for ‘ignorance’ over riding elephant in Bali despite it being deemed cruel", "paragraph": "135.6m sharesKim Kardashian has hit back after being blasted for her ‘ignorance’ over choosing to ride an elephant while in Bali.Downton Abbey actor Peter Egan, who played Hugh MacClare, took to Twitter to slam the star for posing for pictures on the back of an elephant despite the practice being deemed cruel with many UK holiday companies slowly banning the sale of tickets for it.He wrote: ‘Such ignorance and such a lack of care. Doesn’t she understand the cruelty inflicted on these poor elephants in order for her inane photo shoot.’Kim was also blasted online for the images, which saw her climb on the animal wearing a bikini during her holiday.Someone needs to educate #KimKardashian or she just doesn't give a F**k😡 Baby Elephants are abused and tortured so stupid Tourist can ride them #Phajaan #ElephantCrush #Bullhook #DontBuyATicket 🎫  #DontRideElephants 🐘@KimKardashian pic.twitter.com/QWLwd1PyA8— 🎸TeamZay🎸 (@zay_team) November 3, 2018Shame on you Kim. Elephants are stolen from their mothers and go through a torturous breaking in ritual to get them to become docile to carry people. They are threatened and beaten all the lives in captivity just so people can ride them for a few minutes. Educate yourself please.— MrsMapother (@MrsMapother) November 4, 2018It sure beats shooting them. Maybe she can bring awareness to preserving these endangered gifts. Please @KimKardashian #help #elephants and #rhinos! https://t.co/O8k4aK7a9m— Marilyn Schlitz, PhD (@MarilynSchlitz) November 4, 2018Kim was also slammed by Peta, who told Metro.co.uk: ‘All over the world, tourist traps offer the chance to climb onto an elephant’s back without divulging to the visitors what these animals endure in order to force them to allow this. Baby elephants’ spirits are broken through an egregiously cruel process in which still-nursing elephants are dragged away from their mothers, immobilised, and gouged with bullhooks and nails.‘These horrific, ritualised training sessions often leave elephants severely injured and traumatised, and some don’t survive. Riding elephants or visiting camps that force elephants to come into contact with humans directly supports this abuse.’However, the star has since responded to criticisms to say she had researched the sanctuary before visiting.She wrote: ‘We visited an elephant sanctuary that has rescued these elephants from Sumatra where they would have otherwise gone extinct. It is an organisation that is working to save these beautiful animals. We did full research before going.’Animal rights charities have been campaigning for the practice of elephant riding to be banned, with sanctuaries being created for elephants and their trainers to retire to.Many travel sites, including TripAdvisor and Intrepid Travel, have dropped selling tickets to tourists for wildlife experiences where they come into contact with wild animals. With the practice of riding of elephants, calves are often taken from their mothers and can be trained with sharp hooks, kept on chains, and ‘broken’ so that these hugely strong, wild animals will obey human command.However, it’s perhaps important to note that Kim is pictured climbing onto the elephant without the seat on its back, which are often incredibly heavy and very painful for the animals, with the contraptions often rubbing and digging into their skin.The 38-year-old was in Bali on holiday with her sisters where she was also filming Keeping Up With The Kardashians. After visiting the elephant sanctuary she is said to have returned to filming, along with son Saint and daughter North. Her husband Kanye West is said to have stayed home and missed the trip.If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.MORE: Zayn Malik shades record label for ‘holding back’ new musicMORE: Ariana Grande references Pete Davidson and ‘angel’ Mac Miller in new single Thank U, Next as singer reveals she’s moved on\n\n\n\n"}