{"id": "Jeremy Corbyn criticised for small poppy pin and ‘hoodie’ at Armistice Day service", "paragraph": "135.6m sharesJeremy Corbyn has faced criticism for wearing the ‘smallest poppy he could find’ to mark the centenary of the Armistice.The Labour leader united with Prime Minister Theresa May to lay a wreath at the foot of the Cenotaph.However, Mr Corbyn was criticised on social media for appearing ‘scruffy’ as politicians and Royals remembered fallen soldiers with a two-minute silence.What a disgrace of a man Corbyn is. Among other things, now at the cenotaph wearing the smallest poppy he could find.— PFCDepor (@PfcDepor) November 11, 2018Corbyn with his barely visible poppy and cheap anorak.— cat (@irnbrudreaming) November 11, 2018Whaaaat? A hoody at a funeral? #Corbyn #untidy.— Rob Charlton (@zeddarcee) November 11, 2018All the country's leaders, along with representatives of the commonwealth countries, all immaculately turned out to pay their respects.Except Jeremy Corbyn, who turned out in a scruffy grey anorak, not even wearing a visible poppy. What a disgrace.— Mr Neil (@kiliwizz) November 11, 2018Some even claimed Mr Corbyn was not wearing a poppy at all.He was in fact wearing a small pin on his jacket, but others took issue with the Labour leader’s ‘untidy’ appearance.The Queen led the tributes from a balcony overlooking the London war memorial.Prince Charles laid a wreath on her behalf for the second year in a row – while an equerry laid a wreath on behalf of the Duke of Edinburgh.For the first time, a German leader laid a wreath at the Cenotaph, with President Frank-Walter Steinmeier performing the duty on behalf of his nation in an historic act of reconciliation between the two countries.Other senior royals including the Duke of Cambridge, the Duke of Sussex and the Princess Royal also paid their respects at the Cenotaph.The Duchess of Cornwall, the Duchess of Cambridge, the Duchess of Sussex and other members of the Royal Family joined the Queen on the balcony.A cannon marked the end of the two-minute silence to remember the war dead.Meanwhile, world leaders including Donald Trump and Vladimir Putin gathered in Paris for a separate tribute to those who lost their lives.If you have a story for our news team, email us at webnews@metro.co.uk.You can also follow us on Facebook and Twitter."}