{"id": "Facebook ‘could collapse’ if election scandals keep coming, author warns", "paragraph": "135.6m sharesFacebook ‘could collapse’ if it keeps being dogged by scandals over misinformation and election hacking, says the author of a 2010 book on the company.David Kirkpatrick says advertisers could start to shun the platform if the scandals don’t stop – after a year of seemingly endless controversy over misinformation, privacy and ‘fake news’.Kirkpatrick said the election manipulation issue, ‘could get so terrifying that advertisers could start to back away. That’s nowhere near happening now, but it could happen.’Kirkpatrick said that if Facebook stops being a virtual watercooler for friendly conversation, but a lair for trolls and misinformation – advertisers might find the service too dangerous to showcase washing tablets and shoes.Research earlier this summer suggested that young people are deserting Facebook.A survey from the reliable Pew Foundation found that the top website among kids aged between 13 and 17 is YouTube, which was used by 85% of the teens involved in the study.In second place was Instagram (72%) followed by Snapchat (79%).Just 51% of teens are on Facebook, suggesting young people are turning away from a social network which was once a pivotal part of adolescent life.‘The social media environment among teens is quite different from what it was just three years ago,’ said research associate Monica Anderson, lead author of the report.Today, their habits revolve less around a single platform.At the same time we’ve seen this shift, teens are more digitally connected than ever – nearly all teens have access to a smartphone, and more than four-in-ten say they are online on a near-constant basis.’Smartphone use is now ‘nearly universal’ among teens with 95% owning or having access to a mobile. Some 45% reported being online ‘almost constantly’.The survey of 743 U.S. teens ages 13 to 17 was conducted between March 7 and April 10 2018.Facebook may be backing on other services that it owns – such as Instagram – in case its ‘main’ service fails, analysts told Associated Press.Analyst eMarketer estimates that Instagram will bring in 16 percent of Facebook’s advertising revenue this year and 25 percent by 2020.‘Advertisers love Instagram,’ eMarketer analyst Debra Aho Williamson said. ‘It has the appeal of being a generally positive environment.’Half of voters want Theresa May as prime minister - at least until after BrexitThree rushed to hospital after double shooting in London's latest violenceMum considers sterilisation after medics fail to warn about son's missing fingers"}