{"id": "World’s oldest shipwreck dating back 2,500 years to ancient Greece is found under the Black Sea", "paragraph": "135.6m sharesThe world’s oldest intact shipwreck has been discovered resting at the bottom of the Black Sea.After the most technologically advanced search ever, the ancient vessel was found in a part of the eastern European sea that has already revealed over 60 other shipwrecks.But carbon dating shows that this is the oldest yet discovered, and is believed to be a Greek trading vessel that’s over 2,500 years old.It was discovered in late 2017 as part of the Black Sea Maritime Archaeological Project. It bears a resemblance to the ship design displayed on the ‘Siren Vase’ – a piece of ancient Greek pottery currently on display at the British Museum.Dr Kroum Batchvarov, who was involved in the project, said: ‘We have complete vessel, with the masts still standing, with the quarter rudders in place.’‘It is an incredible find. The first of its kind ever.’It was found 1.3 miles beneath the surface of the Black Sea in waters that are known as anoxic due to the minimal amount of oxygen that exist there. The lack of oxygen is what’s contributed to the boat’s preservation. It’s so well preserved that monkfish bones were found on deck, showing what the sailors were eating at the time.‘We even have the coils of line, of rope still as the bosun left them in the stern when the ship went down,’ Dr Batchvarov said.‘This is unique.’Jon Adams, the project’s chief scientist, told the Times that the ship probably sank in a storm and the crew weren’t able to bail out the water in time.‘A ship, surviving intact, from the Classical world, lying in over 2km of water, is something I would never have believed possible,’ he said‘This will change our understanding of shipbuilding and seafaring in the ancient world.’The team from the Black Sea Maritime Archaeological Project can’t yet salvage the vessel because of the expense of doing so as well as the necessary work to take it apart and piece it back together without damaging it.The find is one of 67 wrecks found in the area.Previous finds were discovered dating back as far as 2,500 years, including galleys from the Roman, Byzantine and Ottoman empires.Scientists stumbled upon the graveyard while using underwater robots to survey the effects of climate change along the Bulgarian coast.The years-long Black Sea Maritime Archaeology Project involves an international team led by the University of Southampton’s Centre for Maritime Archaeology. It has so far cost around £15m.Ed Parker, CEO of Black Sea MAP, said: ‘Some of the ships we discovered had only been seen on murals and mosaics until this moment.’‘There’s one medieval trading vessel where the towers on the bow and stern are pretty much still there.‘It’s as if you are looking at a ship in a movie, with ropes still on the deck and carvings in the wood.‘When I saw that ship, the excitement really started to mount – what we have found is truly unrivalled.’Many of the other wrecks’ details and locations are being kept secret by the team to ensure they remain undisturbed."}