{"id": "Doctor Who fans can’t cope as ‘Stormzy’ saves the day in latest episode", "paragraph": "135.6m sharesDoctor Who viewers were left baffled as Stormzy managed to save the day – without ever appearing on screen.In what was branded the ‘scariest episode yet,’ the Doctor and co were plagued by a group of terrifying spiders in Arachnids in the UK.How exactly did Stormzy save the day instead of Jodie Whittaker, her sonic screwdriver and a Tardis, we hear you ask?Well it was his song, Know Me From, that was used to lure the spiders into a room and to their doom.And it is a banger.Viewers at home couldn’t quite believe the 25-year-old had made a quick appearance on the BBC show, and flocked to Twitter to rave about his ‘cameo’.‘Stormzy is currently saving the day on Dr. Who, without even being there. What a time to be alive lol #Stormzy #DrWho,’ one commented.‘Fuck off are they catching spiders with Stormzy music #DrWho,’ another joked.A third said: ‘When #Stormzy saves the day on #DrWho #DoctorWho.’Stormzy is currently saving the day on Dr. Who, without even being there. What a time to be alive lol  #Stormzy #DrWho— T R i N A (@Trinajc_) October 28, 2018Fuck off are they catching spiders with Stormzy music 😂😂😂😂😂😂 #DrWho— Laura Marie 🦖 (@LauraMarie1421) October 28, 2018YES STORMZY ON DR WHO!!! #WhereDoYaKnowMeFrom?! #DrWho pic.twitter.com/UrhR4eVKdz— Karene Horner-Hughes (@Karene_hh) October 28, 2018While a fourth added: ‘Stormzy saving the day is the best thing that’s ever happened on doctor who.’Stormzy’s ‘appearance’ comes just after he opened up about his horrific past, in a candid chat with the Sunday Times Style magazine.And the 25-year-old revealed he had been stabbed three times, including once in the head.The grime star revealed knife attacks had become ‘normalised’ during his London upbringing, and it took a trip out to the West Midlands to see what happened was anything but.‘In the room were 17 white kids. I had a scar on my head, and someone goes, “What happened?”. I said, “Oh, I got stabbed”,’ he told the publication.Two and a Half Men's Jon Cryer cast as Lex Luthor in CW's SupergirlI'm A Celebrity stars get soaked as their canoe capsizes during tricky taskKaren Clifton sobs as she gets her highest score so far on Strictly Come Dancing‘I will never forget. I was explaining, “I got stabbed here, there, there”. They had faces of horror — and that’s when it dawned on me.‘Where I come from is mad. Of course it’s shocking I’ve been stabbed. Of course it shouldn’t be.‘We live in this warped view of reality, and it’s not our fault.’Doctor Who continues on Sunday, on BBC1, at 7pm.If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.MORE: Stormzy and Fatboy Slim first headline acts announced for Snowbombing festival to celebrate 20th anniversaryMORE: Maya Jama says teenage sweetheart’s shooting has helped her appreciate boyfriend Stormzy\n\n\n\n"}