{"id": "How hard is it to get pregnant if you have polycystic ovary syndrome?", "paragraph": "135.6m sharesSo far for fertility month at Metro.co.uk, we’ve covered the joy and heartbreak of finding the perfect sperm donor, whether yoga can help with conceiving, how plastic affects parenting, among others.But there are things that stand in the way of conceiving, such as Polycystic ovary syndrome (PCOS) – a condition that may hinder getting pregnant as it affects a woman’s hormone levels.It causes irregular or no ovulation, which means the egg isn’t released and you can’t get pregnant.Affecting as many as one in ten women, PCOS is a worry for people who want to start a family, but there are still options for those wanting to have children.Professor Adam Balen, a spokesperson for the Royal College of Obstetricians and Gynaecologists told Metro.co.uk that PCOS is the most common hormonal disturbance to affect women.‘Treatment may depend on what the main concerns are for particular symptoms. Irregular and unpredictable periods can be unpleasant and an inconvenience. If a woman doesn’t want to conceive, she may be prescribed a low dose combined oral contraceptive pill. If ovulation occurs erratically, it may take longer than average for a woman to become pregnant.‘There are a number of treatment options available to stimulate regular ovulation including taking clomifene tablets, which encourages the monthly release of an egg from the ovaries. If medication isn’t successful, women may be offered hormone injections.‘Women who are overweight have a reduced chance of conception and are at increased risk of miscarriage and other pregnancy-related complications. They are encouraged to lose weight before trying to conceive, whether naturally or through fertility treatment. To actively maintain a healthy body weight, women are advised to eat a well-balanced, healthy diet and take part in regular exercise.’Though there’s no cure for PCOS, there are treatments you can try to help and some women with the condition, have been able to get pregnant completely naturally.Mum Tarryn Poulton, founder of PCOS Diet Support, was able to conceive naturally after being diagnosed ten years ago.She told Metro.co.uk how diet is a big part of the solution. ‘Many women are diagnosed with PCOS when they first start trying to conceive,’ she said. ‘The birth control pill masks many of the symptoms and when women with PCOS stop taking the pill, the symptoms of PCOS come to light.‘This was the case with me. When I was diagnosed with PCOS over 10 years ago, my doctor was very unhelpful. Her suggestion was to either go back on the pill (which is not an option when you are trying to conceive) or to be referred to a fertility clinic.‘Difficulties regulating insulin are part and parcel of PCOS. If women with PCOS are able to manage those insulin levels, they are more likely to see improvements in their androgens (a type of hormone) and levels of inflammation, which in turn improves ovulation and boosts fertility.’There are other options available such as IVF, which may be used by couples if the egg and sperm struggle to meet. While IVF has been used by many couples successfully to conceive, it can still be expensive if you don’t fall under the criteria to get it for free on the NHS.Other options include using ovulation drugs or injections which contain hormones that stimulate the ovaries to release one or more eggs. These drugs, when used with a healthy diet, weight, and exercise, can help you conceive.Fertility drugs can be taken together with metformin which helps to lower insulin levels and leads to more regular menstruation and ovulation cycles allowing women to get pregnant.According to the NHS, If you’re unable to get pregnant despite taking oral medications, a different type of medication called gonadotrophins may be recommended. These are given by injection and there’s a higher risk that they may overstimulate your ovaries and lead to multiple pregnancies.An alternative to this is a surgical procedure called ovarian drilling. This keyhole surgery can be equally effective but doesn’t increase your risk of multiple pregnancies.However, the effects of the procedure may only last a few months and it carries the risk of developing scar tissue between the fallopian tubes and ovary.It’s likely that a fertility specialist will check that your fallopian tubes aren’t blocked before most of these treatments are used.Going to the gym should never be about guiltHaving to admit that I can't cope with my daughter's cancer is the hardest thing I've doneWeightlifting protects against heart disease better than running or cyclingIf you have PCOS and you do become pregnant, you have a higher risk of complications, such as high blood pressure (hypertension), pre-eclampsia, gestational diabetes and miscarriage. These risks are particularly high if you’re obese.If you’re overweight or obese, you can lower your risk by losing weight before trying for a baby.If you have PCOS and want to get pregnant, talk to your doctor and assess each option to see what’s best for you.MORE: Pregnant mum says she was fat shamed by her midwife despite being size 12MORE: Woman ditches her secret shaving routine to grow a beard like her husbandMORE: Male fertility stories: I had lazy sperm and no one to talk to about it"}