{"id": "Eight children seriously injured after inflatable slide collapses at fireworks show", "paragraph": "135.6m sharesEight children were seriously injured after an inflatable slide collapsed at a fireworks show in Surrey. The children suffered ‘potentially serious injuries’ at the scene, and some reportedly have broken limbs as well as spinal and neck injuries.The South East Coast Ambulance service confirmed they had ‘multiple crews on scene’ to assist with the incident, and that the patients were transported to major trauma centres in London.Initial reports had suggested that it was a Helter Skelter that had collapsed, although the police later confirmed it was in fact an inflatable slide.Pictures from the scene showed emergency services treating patients next to the inflatable slide.An estimated 12,000 people were due to attend the event in Woking Park, Surrey but were evacuated following the incident.The park will remain closed on Sunday while police continue their investigations.Surrey Police said: ‘We’ve evacuated Woking Park this evening, where people were gathering for the fireworks celebrations, following the collapse of the Helter Skelter at the fairground.‘We are working with ambulance and emergency service colleagues.’To view this video please enable JavaScript, and consider upgrading to a web\n\t\t\t\t\t\tbrowser that\n\t\t\t\t\t\tsupports HTML5\n\t\t\t\t\t\t\tvideoThe entire fairground was evacuated in order to allow the air ambulance to land.Woking District Rotary Club, the event’s organisers said: ‘Really sorry but due to a major incident in the funfair area the police have asked us to evacuate the park.‘The fireworks display will therefore not take place tonight.‘We are all very shocked and distressed by events in the funfair this evening.’As organisers attempted to deal with the disaster, some people were trying to get their money back for the event.They replied: ‘We are focusing in assisting the emergency services in dealing with the injured children. If you’ll excuse us, we’ll turn our attention to dealing with ticketing issues etc when we can?’A family ticket on the night would have cost £15, while tickets for adults of aged 16 or over would cost £6.Andy Datson, 23, said he saw up to 40 children playing on slide, which he estimated was about 30-foot tall at its highest.‘We had been walking past the slide earlier in the night and said it looked unsafe. It looked pretty flimsy to say the least,’ he said.‘There were far too many kids on it.‘It didn’t look like it could hold that many people.’The journalist, who lives in Guildford, Surrey, said that he noticed the flashing lights of ambulances after walking off with friends.‘I immediately thought that’s going to be the slide,’ he said.‘It looked like there were too many children on it and the side area had given way,’ he said.‘If, heaven forbid, they fell from the top I would say it’s at least 25 to 30-ft tall.’Local musician Anna Neale said she was among the hundreds of people who evacuated the park, which had been packed with families with young children.The 36-year-old said: ‘We saw all the blue lights and saw the air ambulance arriving. We all evacuated very calmly. Everyone was just shocked.’She had planned to take her daughters, aged 10 and six, on the giant slide after the fireworks.She said: ‘I am very grateful my children didn’t go on it, let’s just put it that way.’In a formal statement, Surrey Police said: ‘We have declared a major incident following a number of people falling from an inflatable slide at the Woking Park fireworks display at around 7.30pm this evening.‘A number of children fell from the slide and were injured. Eight children have been taken to hospital by South East Coast Ambulance Service with potentially serious injuries.‘Surrey Police worked with the organisers of the event to evacuate the site, in order to allow the emergency services to do their work, and to allow the air ambulance to land.‘We are grateful to the public of Woking for their understanding and assistance in quickly evacuating the scene.‘The Health and Safety Executive have been informed.‘We are appealing for anyone who witnessed the incident, or has video or photographic footage of what happened, to make contact with Surrey Police via 101, or surrey.police.uk/ReportIt, quoting reference PR/P18262524.’If you have a story for our news team, email us at webnews@metro.co.uk.You can also follow us on Facebook and Twitter."}