{"id": "BTS release brand new English track Waste It On Me with Steve Aoki", "paragraph": "135.6m sharesYass Army! BTS have given us new music.They’re the group that keep on giving – the UK Army are still on a high from their visit to the capital where they performed two dates at London’s O2 – and absolutely smashed it, let’s face it – and now they’ve given us that little bit more, announcing a brand new track with Steve Aoki.To cap it off, they’ve made the unusual move of singing the entire track in English on the chilled dance track about trying to claw back a relationship after a break up.surpriseeee 😏we're back! got a new collab w/ my brothers @BTS_twt coming at u tomorrow!! who wants to hear it now?? Tweet #WasteItOnMe to unlock a preview!— Waste It On Me Aoki (@steveaoki) October 24, 2018The group have worked with Steve Aoki before on the hit song Mic Drop, as if we even need reminding, which has over 365 million views on YouTube and saw the lads performing in Korean.Waste It On Me features on Steve’s upcoming new album Neon Future III on 9 November.The record also features some incredible collaborations, to be announced in time.It comes just after RM released his solo venture titled Mono.It has seven tunes, the same as the number for J-Hope’s solo mixtape, Hope World. RM teased his fans by announcing the release of a mixtape just moments after he was voted best leader in K-pop on Friday.Jade Thirlwall on how pregnancy rumours inspired the new Little Mix anthemJesy Nelson on the #MeToo movement: 'Little Mix are too intimidating to be harassed'Cheryl will quit pop if her music flops for the sake of son BearIn the 20 minutes after it was released into real world, over 45,000 fans retweeted the iTunes link on BigHit Entertainment’s tweet, and over 73,000 (and climbing) people have liked the tweet.The songs showcase RM’s talent for singing, rapping and features both poppy numbers and slow jams.They include collaboration with other artists, too. The second track, Seoul is produced by HONNE, and the fourth track Bad Eye and sixth track Pass By are collaborations with eAeon and NELL respectively.MORE: John Mayer admits to singing his own songs during sexMORE: Scooter Braun claims Justin Bieber lived in US illegally at the start of music career\n\n\n\n"}