{"id": "BTS drop new trailer for Burn The Stage: The Movie right as they announce new single Waste It On Me", "paragraph": "135.6m sharesBTS have dropped the trailer for their new movie Burn The Stage and it’s pretty awesome.The movie takes fans behind the scenes of what it’s like to be part of the world’s biggest band, and follows on from their massively successful YouTube series of the same name.Fans feature heavily in the trailer, as do private moments between the band, and J-Hope playing with a puppy. ADORABLE.The full movie features moments from the band’s Wings tour last year, and an intimate look at members RM, V, Jimin, Jin, Jungkook, Suga and J-Hope in their most candid moments.An official poster has already been unveiled showing the outpouring of love from Armys to BTS as they take a bow on stage.Tickets will go on sale on 22 October from the official film website.Burn The Stage: The Movie is out 15 November.What timing they’ve chosen to drop the trailer, having just announced news of a new track with Steve Aoki. The group have recorded their first all English track called Waste It On Me, which will be fully released at 3pm on 25 October.The K-pop band have just finished two sold out shows at London’s O2.RM has also released his own solo venture.Jade Thirlwall on how pregnancy rumours inspired the new Little Mix anthemJesy Nelson on the #MeToo movement: 'Little Mix are too intimidating to be harassed'Cheryl will quit pop if her music flops for the sake of son BearIt comes just after RM released his solo venture titled Mono. It has seven tunes, the same as the number for J-Hope’s solo mixtape, Hope World. RM teased his fans by announcing the release of a mixtape just moments after he was voted best leader in K-pop on Friday.In the 20 minutes after it was released into real world, over 45,000 fans retweeted the iTunes link on BigHit Entertainment’s tweet, and over 73,000 (and climbing) people have liked the tweet. The songs showcase RM’s talent for singing, rapping and features both poppy numbers and slow jams.They include collaboration with other artists, too. The second track, Seoul is produced by HONNE, and the fourth track Bad Eye and sixth track Pass By are collaborations with eAeon and NELL respectively.MORE: Ray J has no time for Kanye West ‘feud’ as he brands Kim Kardashian sex tape a ‘positive’MORE: Drake is now co-owner of eSports team 100 Thieves\n\n\n\n"}