{"id": "The X Factor viewers confused as ‘sound issues’ ruin pre-recorded show: ‘Are they meant to sound like robots?’", "paragraph": "135.6m sharesThe X Factor was plunged into chaos during the pre-recorded Fright Night instalment – as sound issues plagued the show.As Ayda Field introduced Danny Tetley, a robotic, crackling sound took over the show.While viewers assumed it was part of the Halloween-style show, they were left confused as the sound issues carried over to Danny’s performance.‘Are they meant to sound like robots? #XFactor,’ one commented.Are they meant to sound like robots? #XFactor— 👑 𝒱𝒶𝑔𝑒𝓈𝓉𝒾𝒸 𝐻𝒾𝑔𝒽𝓃𝑒𝓈𝓈 👑 (@Quannoi) November 3, 2018Not just my sound got weird ?? 🤖#XFactor— just another directioner ◟̽◞̽ (@one_direcctioon) November 3, 2018What the shitting hell is going on with the shitting sound!! #XFactor— Aimee Haynes (@A1m33Hay1) November 3, 2018‘Is there a problem with the sound? #XFactor,’ another wrote.‘Well that sound problem is gonna be a nightmare ! #XFactor,’ a third said.A message from X Factor bosses popped up on screen, which read: ‘We are sorry for the temporary interference in sound.’However, others branded the mistake unfair on Danny.They’ve got to let poor Danny song again, this isn’t fair 😭 #xfactor— Keeley (@coolstorykeeley) November 3, 2018If the public is voting for this then Danny should sing again .. shitty sound fault and not fair at all #Xfactor— LYNN (@LYNNIELOU1966) November 3, 2018Okay I believe there is someone at ITV that doesn’t like @danny_tetley That guy has been done over once again. #XFactor— Iqbal Mohammed (@iQFilmmaker) November 3, 2018‘So angry at xfactor,’ a viewer posted. ‘If they knew there was a sound problem they shouldn’t let Danny sing whilst they’re having that issue!!!!! Not fair at all!! #XFactor.’‘Poor Danny, this interference is unfair and could potentially go against him when it comes to the vote! #XFactor,’ a ffith replied.While a sixth added: ‘They’ve got to let poor Danny song again, this isn’t fair #xfactor.’This isn’t the only awkward moment to hit this week’s X Factor, as it was previously revealed the normally live show would be pre-recorded for the first time, thanks to Robbie Williams’ hectic schedule.Two and a Half Men's Jon Cryer cast as Lex Luthor in CW's SupergirlI'm A Celebrity stars get soaked as their canoe capsizes during tricky taskKaren Clifton sobs as she gets her highest score so far on Strictly Come DancingThe Angels singer will be performing in South America for the next two weekends, and flew out to Chile on Saturday night.But show bosses rearranged the show so he could support his acts before jetting away.Nile Rodgers will be taking over for Gary Barlow’s pal in the results show – on Sunday – but the decision to film the show earlier in the day has reportedly left things ‘frantic’ behind the scenes.‘Everyone is frantic behind the scenes… it means the dress rehearsals will kick off at midday – several hours earlier,’ an insider claimed to the Mirror.‘The show itself will be filmed as live at 4.30pm. It’s stressful to say the least but everyone is rallying around to make it a success.’Everyone except for Louis, who decided to forego a Halloween costume on the night…If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.MORE: The X Factor’s Robbie Williams channels his inner Simon Cowell for epic Fright Night costumeMORE: X Factor’s Scarlett Lee thanks Simon Cowell for support following fire tragedy\n\n\n\n"}