{"id": "Jenna Dewan says she has ‘nothing but respect’ for Jessie J and it’s too sweet", "paragraph": "135.6m sharesAs much as we live for pettiness and drama, it’s pretty lovely to see two supposed rivals bonding.So kudos to Jenna Dewan and Jessie J, who are making friends despite Jessie dating the dancer’s ex-husband.The Domino singer has confirmed her romance with Channing Tatum – whose marriage to Jenna ended this year after nine years.And after Jessie, 30, hit out at comparisons between her and Jenna – who, it has to be said, look rather alike – the Step Up actress was totally there to support the singer.Writing on her Instagram story, the 37-year-old actress said: ‘Amen Jessie! Yes!!!! Women for women all the way. No need for negativity.‘Let’s live in a world where we support each other and raise each other up. Like I said before, positive vibes all the way. Nothing but respect.’Adorable.Jessie penned a note on Instagram urging others to ‘support all women’ after being compared to her new man’s ex.The Bang Bang songstress wrote: ‘There is a story that I have seen be rewritten over and over again in the past few weeks that talks about myself being compared directly to another beautiful woman regarding our looks and people picking who they think is prettier.‘I am here to talk about the headline and the way the story has been written, I have continuously tried to find something positive from this article… I am yet to.‘Who feels good from this story? I know I don’t. Who does this story inspire? …? Is picking who is prettier and then continuing to say why a good activity for women to participate in? No.’Channing, 38, confirmed his romance with Jessie as he praised her for her show at London’s Royal Albert Hall.Jenna Dewan and Steve Kazee continue to be smitten kittens and it's too cuteJessie J hits out at comparisons to Channing Tatum's ex Jenna Dewan in emotional postJenna Dewan responds to claims she looks like Channing Tatum's new girlfriend Jessie JThe Magic Mike star was spotted by Metro.co.uk at the concert, with the actor seen sitting just seats away from Jessie’s mother.Tatum met Dewan on the set of Step Up in 2006, with the couple marrying three years later.Their daughter Everly was born in 2013; however, in April this year, the pair issued a statement announcing that they were separating.If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.MORE: Will Smith calls ex ‘best baby mama ever’ and proves Jada is the chillest wife there isMORE: Michael Buble kisses his ‘hero’ wife as he receives star on Hollywood Walk Of Fame\n\n\n\n"}