{"id": "Ariana Grande’s brother Frankie is dating a married couple and they look cute AF", "paragraph": "135.6m sharesFrankie Grande, brother to Ariana, has revealed on Twitter that he’s been in a relationship with a married couple, Mike Pophis and Daniel Sinasohn, for three months.Frankie posted an Instagram snap of the three of them together to Instagram, although at the time didn’t reveal they’re together.Instead, he simply captioned it: ‘Gotta love a ring light.’He later told Us Weekly the truth about their relationship, explaining: ‘These are my boyfriends. [We’ve been dating for] almost three months, but in the gay world, it’s like five years.’Mike, a doctor and Daniel, a law clerk (power couple much?) have also been snapping cute photos of the three of them, including an incredible joint Halloween costume. I think we win HalloweenA post shared by  Daniel Adam (@daniel_adam_s) on Oct 29, 2018 at 3:44pm PDTSince the news, fans have been sending Frankie messages of support. ‘Wow! i hope you are well and your triad is a happy one!!!’ one fan commented.Over the past few days, Frankie has been tweeting celebratory messages about love and acceptance.‘Never let anyone make you feel ashamed of who you are. you are perfect. you are beautiful,’ he said.‘If someone is making you feel like you are different then thank them because DIFFERENT IS BEAUTIFUL. AUTHENTIC IS BEAUTIFUL! HAPPY IS BEAUTIFUL! live your truth, because it is BEAUTIFUL!’ the tweet continued. Preach.Big Brother’s Lewis Flanagan claims N-word was used repeatedly before his axeFirst Dates welcomes Big Brother legend Aisleyne Horgan-WallaceBig Brother’s Emma Willis confirms bosses are in 'talks' for returnAnother simply read: ‘#loveisloveislove.’However, the relationship doesn’t mean he’s been neglecting his supportive brother duties after Ariana’s split with comedian Pete Davidson.He’s been supporting her new song Thank U, Next all over social media, tweeting: ‘What a gorgeous, strong, beautiful song about growing from love lost… thank you @ArianaGrande for this INCREDIBLE anthem!! I am SO PROUD!!!!’If you have a story for our news team, email us at webnews@metro.co.uk.You can also follow us on Facebook and Twitter.MORE: Frankie Grande, Avril Lavigne and Adam Lambert have taken their Halloween costumes very seriouslyMORE: Ariana Grande covers up Pete Davidson tattoo as she moves on after shock split\n\n\n\n"}