{"id": "Leaked Avengers 4 behind the scenes finally shows Pepper Potts in Rescue armour", "paragraph": "135.6m sharesStill months out from any real Avengers news in the lead-up for the fourth instalment, new pictures have emerged of Gwyneth Paltrow in costume.Pepper Potts has remained relatively quiet on the Avengers front, not being part of any great big chatter or leak.Until now.As the costumes of characters are designed, tested, tried on, a photo of Gwyn as PP has emerged on social media and there is a lot to unpack here as it looks like the CEO of Start Industries will surface as Rescue in Avengers 4.A photo has been posted to account Uncanny Comic Quest that shows a recently-married Gwyneth in costume as Pepper, only she’s not sporting her usual business attire – she’s wearing the leather and armoured Rescue range, as she stands in front of a green screen. [follow @uncannycomicquest] yooooo does Tony die and Pepper takes her revenge out on Thanos?! Let us know in the comments below!👇🏻A post shared by  UNCANNY COMIC QUEST (@uncannycomicquest) on Oct 23, 2018 at 9:09am PDTIn the comic series, Pepper gets an Iron Man suit of her own known as Rescue, and while her role in Infinity War really didn’t amount to much, this is the biggest hint yet she’s going to get in on the action this time around.With half the universe obliterated by Thanos’ snap, we really could do with some more action heroes around now, too.Recent leaks showed toy designs with a purple armour that was pretty similar to Iron Man’s but for a female.Cue Pepper Potts, recently engaged to Tony Stark, too – is she out to avenge his honour should he come into any danger in the next movie?While we don’t know where the image originally came from and it hasn’t been confirmed as her legit costume by Marvel – it doesn’t appear to be doctored or fake and we have seen some random leaks of both Captain America and Captain Marvel’s outfits for the coming release. So it wouldn’t be weird for images of Pep to be floating about.It’s also not the craziest idea, having Pepper suit up to defeat Thanos in the next battle, after Marvel Studios head Kevin Feige claimed that the majority of superheroes in the MCU would soon be female.Who run the world? Girls.‘As the plan goes forward I think frankly we’ll be … you know, eventually I think we’re going to reach a time where it’s not just … listen, it would be amazing to see all of our female characters the way we have seen … most, never all male, but primarily male,’ he told CinemaBlend. ‘I think we’re getting to the point soon where we have so many great female characters that those are just our heroes as opposed to when are they all female, all male. It’s just the Marvel heroes, more than half of which will be women.’Gwyneth Paltrow's Stan Lee tribute has not gone down well at allGwyneth Paltrow 'slays' distracting new husband with her boobs in argumentChris Martin reveals he felt 'worthless' after Gwyneth Paltrow splitWhile it was a little rambly, sure, it’s a great step and Pepper’s potential costume for the next film only gets us even more amped for a little MCU shakeup.Avengers 4 is in cinemas 26 April 2019.If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.MORE: Avengers 4 theory suggests Tony Stark and Steve Rogers will reunite only in flashbackMORE: Chris Hemsworth, ultimate legend, picks up hitchhiker and takes him on helicopter ride\n\n\n\n"}