{"id": "Canada in winter: Visit Yukon to enjoy one of the world’s last wildernesses", "paragraph": "By Adam SmithAfter an hour of flying above snow-capped mountains and crystal-clear glaciers, I realised I haven’t seen a trace of human life since a few minutes after take off.We were in a six seater propeller plane, which our pilot Daniel called ‘a flying piece of tin’ above one of earth’s last true wildernesses – Kluane National Park.The mountain range is the natural border between Canada’s Yukon Territory and America’s Alaska and few people have stepped foot on these ranges according to Daniel.The peaks we saw included Canada’s tallest – Logan, at 19,000 feet – plus King George, Mary, Hubbard, and Lowell. But there are so many that haven’t even been named.Seeing a place that hasn’t been defaced by humans was wonderful.We flew a 300km loop into American airspace and then back again with Rocking Star Adventures. Seeing mountain tops so close was mind-blowing, but it was not for the faint-hearted – a few of my fellow passengers were a visible shade of green but I loved it.We plummeted 10,000km down to what seemed like touching distance from the glaciers, which stretched out before us like frozen super highways.Seeing the genesis of these majestic natural phenomenons brought those junior school geography lessons vividly to life.Rocking Star Adventures fly out of Haines Junction, a glorified crossroads with a hotel and a couple of shops. But it’s an important staging post to Dawson City, an abandoned gold rush town.The Yukon is only two hours away by plane from one of North America’s most modern metropolises, Vancouver, but is a world away.The giant wedge of northern Canada is bigger than Germany and breeds or attracts the type of people who wants to pit their wits against nature.Whitehorse is the capital of the Yukon. Its tiny airport and old-fashioned main street give it the feel of a frontier town. Fly posters across town boasted hip-hop challenges, battle of the bands and the most remote Pride in the world.There are more breweries (Winterlong Brewing Co and Yukon Brewery were outstanding) per person than most Canadian cities and the bars and pubs were lively.My favourite was the rough and ready Dirty Northern Bastard, which has a dead, petrified cat encased in the wall and the kind of patrons who had tales to tell from a life lived.The people living in Whitehorse do so knowing temperatures will regularly dip below -30C, but the upside is the Northern Lights, though they are so regular that locals are blasé about them.Laying on my back in the snow at 1am, looking at one of the natural wonders of world, I have never felt further away from civilisation.The black sky suddenly had green and pink shapes, which could morph into anything the imagination could create.A giant astronaut playing cricket, a bear waving at bigger bear with huge ears and an old school car stereo’s graphic equaliser hypnotically flashing – it was all there if I stared hard enough.The wildlife is a big draw for tourists, and every Canadian has a bear encounter story, though unfortunately I didn’t glimpse one.The majority of north Canada’s animals can be seen in one place, at Yukon Wildlife Reserve, where caribou roam across fields, vultures spy on you from trees, mountain goats stare into the distance as wolves watch in packs and arctic foxes play.But the animal that encapsulates the Yukon is the huskie, they really are man’s best friend in this most unforgivable of environments.It was wonderful seeing the dogs where they belong. When the dog mushing dogs saw their mates they went mental! #exploreyukon #dogsofinstagram #dogsofinsta #ArcticAdam #SnowboundSteve #explorecanada🍁A post shared by  Steve Zacharanda (@stevezacharanda) on Mar 21, 2018 at 4:43pm PDTAs we walked on the frozen lake, we could hear their yelps of delight and excitement at the prospect of a four-hour mush across ice and through forest.We were staying at the Southern Lakes Resort, which was so remote, the hotel’s entrance was a 30 minute drive.We stayed in log cabins on the edge of a giant frozen lake, where our dog sledders met us.Our sledders were part of Winter Olympic star Michelle Phillips’s team, who every year competes in the Iditarod endurance race.Two of us stood and one laid down while being pulled by Takoma, Twix, Floyd, Reiss, Stevie and Renee. It was not just a fun mush for our benefit, Vincent needed to know which dogs were good enough to be in the cross-country Iditarod. David Bowie Dog! Two different colour eyes.. She has just had kids so just ran along with the sledges #explorecanada🍁  #Exploreyukon #dogsofinsta #dogsofinstagramA post shared by  Steve Zacharanda (@stevezacharanda) on Mar 20, 2018 at 3:49pm PDTI was lying down for the ride out, just inches above the ice, as we reached 10mph on the lake.Our hotel, which nestled on the shore, was quickly enveloped in vast whiteness.After an hour of racing across the lake, one right turn and a 45 incline and we were in the forest and whizzing past trees with millimetres to spare.Before stopping at a clearing for lunch, we experienced traffic – Yukon style. Another sled from the same kennels passed us and the dogs went crazy with excitement at seeing their friends.When it was my time standing up, the exhilaration of being in control of the sled was breath-taking.However, when the dogs took a sharp turn, I went flying through the air and landed in the soft snow to the laughter of the sled team behind me. But that is the fun of snow, before I landed, I knew it would not hurt.Two hours later, we said goodbye to our dogs and played a quick game of ice hockey on the lake before heading to our cabins, which had no wifi to ensure our digital detox held firm.Our evening meals were a choice of two dishes, including caribou and salmon, which added to feeling of being away from the modern world and all its choices.A few days later, we got the chance to try our hand at driving snowmobiles.From the Inn On The Lake in Whitehorse, we snowmobiled for 40 minutes to another frozen lake, Lake Caribou, to go ice-fishing.Char can live for 60 years and swim underneath the various frozen, interconnected lakes for up to 120km, but we left without troubling any of them.The Whitehorse outdoor lido has been doing a roaring trade since it opened in the 1960s.An outdoor pool in one of the coldest places on the planet might sound strange, but the water is warm and atmosphere is great.Pictures displayed entrants to the annual frozen hair contest. Smiling faces stared at the camera surrounded by incredible bright white creations of frozen follicles.Canada’s first nation community are now finally getting a piece of the tourism pie, and seeing how tribes coped with the cold and lived off the land was captivating.At the Long Ago People’s Place, our guide Bob vividly brought to life how his predecessors trapped, fished and hunted while ensuring they could do the same the next year.Describing the cultural traditions of the local wolf and raven tribes, he demonstrated how various ingenious contraptions and traps would catch prey.We were all treated to a traditional Indian dinner of stew, bread and rare roes on toast, which the elder women had spent the day preparing.At Carcross, we visited world famous totem pole artist Keith Wolf Smarch, who waxed lyrical about his people’s love for their environment while chiselling away at another ornate wood creation.The town is also a tourist draw because of its frontier feel, and the world’s smallest desert is on its outskirts.Technically, it might not actually be a desert, but either way it was cool to roll down the sand-like dunes and shout across a deserted desert.And that will be my abiding memory of the Yukon – seeing incredible wilderness without humans cluttering up nature’s brilliance.Magnetic North Travel offers seven-night winter holidays from £1,625 per person, including flights from HeathrowIncluded in the package is an eight-day, mid-size car hire from Whitehorse, three nights at Edgewater Hotel Whitehorse, two nights at Southern Lakes Resort and two nights at Inn On The LakeFor more travel ideas, see Travel Yukon and Explore Canada.\nMORE: Beyond the holy sites: Where to go in Jerusalem if you love food and cultureMORE: An Italian spa break: Why Bagno Vignoni in Tuscany is the perfect place to destressMORE: What to expect when you sign up for Bear Grylls’ 24-hour survival course"}