{"id": "As a rugby player, I’m not ashamed to discuss my mental health. We can lead the way for men to open up more", "paragraph": "135.6m sharesPicture the classic image of the rugby players’ changing-room: large, grizzly blokes preparing for a game, the smell of sweat and muscle rub in the air.Some are shouting at the group, others are in quiet contemplation before the war to come, while one or two – overcome with nerves – might have disappeared to the toilets.Fast-forward a couple of hours and the same group is celebrating wildly or commiserating solemnly. Their bodies have just gone through the ringer.The physical aspects of rugby are well advertised, and without them little would be achieved on the field. If you are not fit, strong, powerful and resilient as an individual, and as a collective, then your successes will be limited.But what is not as openly discussed is the mental element associated with this type of team sport; when players – like myself – get injuries and fail to be selected, or face more unseen challenges such as anxiety, anger or problems away from the game.There is a stigma attached to mental weakness among men – especially for those who are seen as physically robust –  and there shouldn’t be.For professional athletes, there is a constant challenge of striking a balance between everyday life and a career in elite sport, and the sacrifices needed on all sides to make that work.That is why I am so proud to be a part of the ‘Man of More Words’ campaign, which urges men to speak up about their mental health.The Movember Foundation and Harlequins Foundation has united to stop men dying too young, and a big part of that is the acknowledgement that for many men, being open about their feelings is difficult.The effects of that inhibition can be tragic, with more than 800,000 deaths by suicide globally each year, of which 75% are men.I have friends in the game who have experienced suicide personally – but what is far more common is issues of anger, anxiety and fear.My own challenges came in the shape of dealing with serious injury when I was younger. Twice before the age of 21, I thought I might be facing the end of my career due to serious knee and head injuries.This really shook me, as I was just beginning a dream career and with friends away at university, it became a time of isolation and uncertainty.It was my family that helped pull me out of that low time, and I will always be grateful for that.More recently, at the other end of my career, I have faced the uncertainty of contract issues and the possibility of the game I love being taken away from me before I am ready to leave.Fortunately I have built a very strong support network around me, so I always have people I can talk to.The flip side is that if I can ever play that role for someone else, I am happy to do so.From personal experience, I can appreciate that the load can be lifted by sharing with someone. It is even more powerful when it’s men opening up to each other.Bonds formed in sports can be especially strong, because of the shared physical challenges that people go through together.Many of my closest friendships have been built through my time in rugby.What brought us together was the hard work we went through to build our team. What is really at the core of it though is that we genuinely care about each other.This is built through hours spent together on long coach trips or across dinner tables, playing cards and killing time in all the stupid ways you can imagine. That is when you really learn about people.Going to the gym should never be about guiltWhole Foods shares the healthy food trends we'll all be fans of in 2019Having to admit that I can't cope with my daughter's cancer is the hardest thing I've doneWe might all look like silverback gorillas but the basis of our relationships is emotion.My hope is that the surface level banter of the changing-room or in the bar can turn into conversations that have a really powerful impact on the mental health of men.I’ve already seen rugby players such as Joe Marler, Danny Care and Dave Ward open up in a film that we were involved in for World Suicide Prevention Day with Movember, and hopefully this will spread spread through the stands and among fans, so more people feel comfortable open up, too.So check in with your friends, listen to how they are doing and let them know you are there for them – you never know the power a conversation can have.Talking is something that rugby players, and men in general, tend to be pretty bad at – but it is time to end that stigma.I hope rugby can lead the way.You can watch members of the Harlequins take part in the Movember Foundation’s ‘Be a Man of More Words’ campaign here. For emotional support you can call the Samaritans 24-hour helpline on 116 123, email jo@samaritans.org, visit a Samaritans branch in person or go to the Samaritans website. MORE: When it comes to suicide prevention – we must be aiming for zero deathsMORE: 17 men explain why they were too afraid to seek help for their mental illnessMORE: We talk sport, mental health and Harlequins on this week’s Mentally Yours"}