{"id": "Richard Baker dead: The first reporter to introduce a news bulletin on the BBC has died aged 93", "paragraph": "135.6m sharesRichard Baker, the first person to ever introduce a news bulletin on the BBC, has died aged 93.His son James Baker confirmed his father passed away at John Radcliffe hospital in Oxford this morning.Many of the newsreaders who went on to follow in Richard’s footsteps have paid tribute to the star, with John Simpson hailing the trailblazer as ‘one of the finest newsreaders of modern times’.He tweeted: ‘Richard Baker, who has just died, was one of the finest newsreaders of modern times: highly intelligent, thoughtful, gentle, yet tough in defence of his principles.’Alastair Stewart followed: ‘A giant. Not a “journalist”, but that wasn’t the style in his day.‘Burnet, Day, Gall et al came along and changed all that. Richard “Dickie” Baker was also a master of the arts, especially music about which he wrote beautifully. A true gentleman.’BBC presenter Simon McCoy added: ‘Remembering Richard Baker- THE newsreader for a generation of us – and a huge influence on me. #RIP.’Richard Baker, who has just died, was one of the finest newsreaders of modern times: highly intelligent, thoughtful, gentle, yet tough in defence of his principles.— John Simpson (@JohnSimpsonNews) November 17, 2018Remembering Richard Baker- THE newsreader for a generation of us – and a huge influence on me. #RIP— Simon McCoy (@BBCSimonMcCoy) November 17, 2018BBC Director General, Tony Hall, said: ‘Richard Baker was at the forefront of the creation of the modern news presenter. He was a calm and assured presence who became the face of news for millions.‘Later, he became a great advocate for classical music, presenting many much loved programmes.  But more than that, he was quite simply a lovely and charming man. Our sympathies are with his many friends and family.’Richard’s credits spanned beyond the news room, however, as he also provided the narration to Peter and the Wolf, as well as voicing children’s classic Mary, Mungo and Midge.If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.MORE: Diddy pictured heading back to work after ‘devastating’ death of ex Kim Porter"}