{"id": "Wife vows to stand by husband who stabbed her 46 times", "paragraph": "135.6m sharesA young woman whose cheating husband was jailed for 20 years after stabbing her 46 times has vowed to stand by him, a court has heard.Shannon Barnard, 21, suffered 14 stab wounds to her chest and breasts alone, and had four penetrating her internal organs, and 10 to her abdomen when her husband Michael Barnard attacked her.Both her lungs collapsed and she has been left with multiple scars which may require skin grafts in the future.Mrs Barnard spent 17 days in hospital following the attack at their home in Hextable, Kent on January 11 this year.She later told police she felt ‘every blow’ and thought she would die and doctors said she was ‘extremely fortunate’ to have survived.But Maidstone Crown Court heard today that she has forgiven her 25-year-old husband and plans to start a family with him on his release from prison.Speaking during Barnard’s sentencing hearing for attempted murder, she replied when asked how she saw their future: ‘Just to be together and have the life that we both want with each other and have a family.’The court heard she had also been visiting Barnard in prison ‘on every occasion possible’, and plans to see him twice a week.When asked if she forgave him, Mrs Barnard replied: ‘Of course.’In a video interview recorded by police two weeks later as she recovered from her horrific wounds in hospital, Mrs Barnard said she felt the first strike to her stomach.She said: ‘I screamed and then somehow I was in the front room. After he stabbed me I dropped to the floor. His dad was still on the phone and I was screaming “He’s got a knife”,’ she told police.‘I was on my back on the floor and Mike was literally on top of me and was just stabbing me. He was on his knees and leant over me.‘I remember him trying to move my arms away and I was just screaming. He didn’t say anything apart from when I said “Stop. I’ve got to call my dad”.‘He said “No, you’ve got to die”. That was the only thing he said the whole time. He said it just once when I was on the floor. I was just thinking I was going to die, that I was dead.’Mrs Barnard said she felt every blow from the knife. He stopped when his parents and an uncle arrived at the caravan. She described how her eyes were rolling and she could hear her father-in-law shouting to his son ‘What have you done?’‘I was opening and closing my eyes. They were screaming at him. His mum said “What have you done?” and I said “He has killed me. I’m dying”,’ she added.The frenzied attack happened two weeks after she found out her husband had cheated on her during an evening of drinking and getting high on nitrous oxide.The court was told he was later accused of raping the other woman, a charge he was later cleared of, but he claimed the woman had consented to ‘passionate sex’.Mrs Barnard was said to have accepted he had simply cheated on her.But prosecutor Christopher May said in the following days there were ‘confrontations and conversations’ which led to tension.Just hours before she was knifed, Mrs Barnard, who is also known as Hamida, wrote a note in which she described how she felt her husband was ‘torturing’ her.Barnard also penned a similar note in which he spoke of never ‘cheating’ on his wife again and being ‘a good person’.But the court heard after Mrs Barnard went to sleep that night on the sofa, she woke early in the morning to find her husband armed with the knife.‘He said “You’ve got to die” and stabbed her repeatedly to her chest and abdomen, causing a large number of injuries, some of which were very serious indeed, including damage to her lungs, liver and bowels,’ said Mr May.‘The Crown say she was extremely fortunate to survive. She also sustained many wounds to her hands and arms, sometimes referred to as defensive-type injuries which the Crown say were caused as she tried to fight him off as she defended herself from the attack upon her.’Barnard himself suffered a ‘significant but self-inflicted’ wound to his chest.A jury convicted Barnard, of Lower Road, Hextable, Kent, of attempted murder.A psychiatrist concluded that he would have been suffering from a short-lived adjustment disorder at the time, known to cause extreme anxiety, paranoia, emotional thoughts, and aggressive outbursts, but the jury was told it would not have affected his ability to plan to kill her.Mrs Barnard said she had noticed changes in her husband’s personality and was so scared she kept a knife under their bed as they tried to reconcile.He is now on medication and a psychiatrist concluded he was ‘highly unlikely’ to suffer from such a mental disorder again.Jailing Barnard, Judge Philip Statman said: ‘Your wife was extraordinarily lucky to have survived this ordeal. The reason why she did so was down to the very quick medical response together with the extraordinary skill of the surgeons who undoubtedly in my judgment saved her life.Mum considers sterilisation after medics fail to warn about son's missing fingersThree rushed to hospital after double shooting in London's latest violenceHuge basking shark washes up on beach in Northern Ireland‘This was a relentless and horrifying assault upon her. It was ferocious, and looking at the photographs of her body and indeed of the scene, one can see the amount of blood that she lost, and significantly the scars that will accompany her throughout her life.‘Each day when your victim gets up in the morning and looks down at her body she can see, and will do for the rest of her life that which you did to her.‘I am completely satisfied that to set about your wife in the way which you did in the matrimonial home constitutes the gravest breach of trust that one could possibly imagine. This is a very serious case of attempted murder.’Barnard blew a kiss to his wife who was sitting with his family in the public gallery as he was convicted.Her family sat separately.If you have a story for our news team, email us at webnews@metro.co.uk.You can also follow us on Facebook and Twitter."}