{"id": "Cancer survivor who risked disease returning to try for a baby has had a little girl", "paragraph": "135.6m sharesA cancer survivor who risked her illness returning to try and get pregnant, has fulfilled her dream of becoming a mother.Meghan Koziel, 29, from Pennsylvania, chose to halt the hormone suppression medication she was taking for her cancer so that she could conceive and carry her baby.The drugs reduced the risk of Meghan’s cancer returning, without it, there was a 40% chance it would come back. But Meghan was desperate for a child and thought the risk was worth it.‘I always dreamed of being a mum, so we took a risky decision to try and hoped it all turned out well,’ explains Meghan.‘If not, we would be fighting the disease again. If the surgeon had left one cancer cell in the body, the hormones could have caused it to spread.’Meghan first discovered a lump when she was 25, but doctors dismissed it because she was so young and had no family history of cancer.When the lump continued to grow, she got a second opinion and following an ultrasound, mammogram and biopsy, it was confirmed that she had breast cancer.‘When I was diagnosed it felt like my life was falling from under my feet,’ says Meghan.‘I was told the bad news was that I had cancer, but the good that it could be treatable. Being diagnosed so young, you think you are going to die, but the reality is that there is a lot of science and tech that help many people survive.’It was this positive attitude that led Meghan to her decision to push on with her pregnancy, despite the risks. When her baby girl was born, Meghan says it was a dream come true.‘As soon as they placed her onto me, my husband and I were crying. I say all the time that she is our little miracle baby. We never thought we would have a child naturally and so are blessed.‘We are so thankful, as a many people are not granted this opportunity, it definitely makes all the sleepless nights worth it.’They named their daughter, Kendra Jane, after their oncologist, Dr. Jane Raymond. The couple say they are discussing the possibility of more kids in the future, if doctors say it’s possible.‘We had three embryos and seven eggs frozen, as chemotherapy can take away fertility,’ explains Meghan.‘The risk is that the ovaries can be so damaged that they can’t carry a child.‘My oncologist doesn’t believe that cancer should take away the option for a woman to become a mom, and from day one she encouraged me to follow my dreams.‘For me, ever since beginning my journey I didn’t want cancer to take anything else away from me.‘I would rather try for a child or any other goal, than feel like my life is being stopped waiting in fear of the cancer returning.’MORE: This is why exercise could help ease your PMSMORE: Woman tweets her journey from Northern Ireland to Liverpool to have an abortion after she was told her baby won’t surviveMORE: Our bodies need metal – this is how to make sure you’re getting enough"}