{"id": "The one where ‘Ross Geller’ stole some cans of lager in Blackpool", "paragraph": "135.6m sharesHas a 1990s global superstar fallen on hard times?Blackpool Police posted on Facebook a picture of a suspected crook who looks the spitting image of Friends star David Schwimmer in connection with a theft from a restaurant.After more than 360 comments within an hour the police posted a clarification the actor was in America on the day of the crime (September 20).Blackpool Police commented: ‘Thank you to everyone for your speedy responses. We have investigated this matter thoroughly and have confirmed that David Schwimmer was in America on this date. We’re so sorry it has to be this way.’Friends fans from across the world piled into the comments section of the ‘Do you recognise this man’ post trying to out do each other with references from the American sitcom.Lee Schofield said: ‘We should recognise him, he’s a bit of a JOEY, did he leave his MONICA on a receipt? I could go on but you get the idea.’And invoking The Rembrandts I’ll Be There For You theme tune Clare Fisher said: ‘His jobs a joke, he’s broke, his love life’s DOA, no wonder he’s resorted to stealing?!’Cat Vennessa added: ‘When it hasn’t been your day, week, month or even your year.’And Chris Allen said: ‘I heard his getaway driver was stuck in 2nd gear.’John Jones commented: ‘You would think someone would be there for him when the rain starts to fall.’Remembering that time when Ross strayed from Rachel after they had split, Chelsea Penny commented: ‘He was on a break.’Katie Power added: ‘Could he BE any more like Ross?’And Tamara Poli joked: ‘The One Where Ross Became a Thief.’Within two hours of the post there had been more than 700 comments and thousands of reactions, likes and shares. Almost all cracking Friends related jokes.Not everyone found it funny though, one Facebooker commented: ‘Can’t believe everyone is making a joke of this. It’s a serious matter…this man needs to be found, instead of making a joke of this please help. ‘Someone must no this man he must live on someone’s street, go in someone’s shop or something.’To which came the reply (which had 83 likes): ‘Ah come on, don’t be like that, I’ll be there for you….’If you have a story for our news team, email us at webnews@metro.co.uk.You can also follow us on Facebook and Twitter."}