{"id": "Rahul Mandal crowned winner of Great British Bake Off 2018", "paragraph": "135.6m sharesRahul Mandal has been crowned winner of the Great British Bake Off 2018.Speaking about winning the show, Rahul said: ‘This is probably first time I got anything like this, a trophy. I talk so much most of the time, I don’t know what to say now.’He added: ‘I don’t know what to say. I don’t know whether to laugh or to cry or what, I just feel like I need to talk with my mum.’Sorry, this video isn't available any more.Rahul proceeded to phone his mum who gave him a special prayer to honour his win.Rahul Mandal, Ruby Bhogal and Kim-Joy all competed in a heated final for baking glory, after being whittled down from 12 contestants over the series.The trio were first faced with a signature challenge to create a batch of doughnuts, before their technical saw the show mix things up by forcing them out the Bake Off tent.The Great British Bake Off winner Nadiya Hussain's husband has a large gay fanbaseNadiya Hussain 'couldn't breathe, move or wash' as she shares video following panic attackGreat British Bake Off's Rahul lands cooking gig on This Morning and viewers are loving itThey were challenged with creating pitta bread with three dips on an outside campfire, utilizing a slate to cook them to perfection.All the contestants then closed the final with three showstoppers, including one based around the lost city of Atlantis and another an edible rock garden.Sometimes you think it’s not your day, but it is your day. The key is to never give up. #GBBOFinal pic.twitter.com/wahEMIuRsZ— British Bake Off (@BritishBakeOff) October 30, 2018Disaster struck Rahul, however, after his storage jar randomly exploded from the heat forcing him to restart his bake. He was given 15 extra minutes due to the incident.This clearly didn’t distract Rahul, however, who sailed to victory securing a lovely batch of flowers along with some significant bragging rights.You can catch the Great British Bake Off on All4.MORE: Bohemian Rhapsody’s iconic Live Aid scene was filmed on day one of shootingMORE: How old is Bake Off finalist Kim-Joy and what is her job?\n\n\n\n"}