{"id": "Weekend Hot Topic, part 2: Next gen console predictions", "paragraph": "135.6m sharesGameCentral readers detail what they want to see from the PS5 and Xbox Two, from 60fps graphics to backwards compatibility.The subject for this week’s Hot Topic was suggested by reader gaz be rotten and asked what do you want from the next generation consoles? How much of an improvement do you expect from the graphics and what new features do you want to see?Most people agreed that a reveal was likely for the new machines next year, and there were a lot of common demands, including keeping a disc drive, better artificial intelligence, and improved VR headsets. I think the only thing I definitely want from the next gen consoles is a reason to exist. I don’t mean that in a super cynical way, but I’d like there to be an obvious reason why they had to be made now when I think most people would be perfectly happy with the current generation going on for several more years.Knowing how PCs are at the moment it’s very hard for me to imagine that the graphics are going to be that much better, which makes me worry that Sony and Microsoft are going to invent some nonsense, like 8K, and pretend that’s a good reason for the new consoles to be.Streaming is definitely something of interest to me but if the whole point is that it can run on any device then that’s definitely not a reason for a new generation, the opposite really. Of course I want the best graphics possible but what I don’t want to be doing is spending £400 every three or four years to get it. But we’ll have to see I guess, I hope Microsoft and Sony realise this would be a problem and will try to avoid it.Hammeriron\n I don’t know anything about hardware really but what I do hope becomes a standard in the next generation is games pass. So far it’s been excellent value and while I do worry whether Microsoft are only being generous because they’re behind I am very happy to pay the subscription and have easy access to the games.It has to be said though that it would be even better value if Microsoft actually had any first person games to put on it. So if Sony did the same thing that would be even better. Although I somehow get the feeling they’re not that keen on it, perhaps because their games sell perfectly well at the moment the normal way.Funnily enough Nintendo do seem interested and unless I’m misinterpreting things they seem to be implying that they want to build up their online service to be something similar, although perhaps only retro games for the first few years.TalkTalk\n Some of my favourite ever games have been on PlayStation 4 but I still can’t shake the feeling that the majority of them could’ve been done on PlayStation 3, albeit with lower resolution. It wasn’t until PlayStation VR that I got the first new gen jaw drop.As a result, for next gen I’d like to see consoles/games that look for advancements in artificial intelligence and world interactivity. Games that feel different, not just look shinier. You can’t easily advertise these features tho’ so I’m expecting 4K to still be the main buzzword.I’ve never considered backwards compatibility to be an important feature before but looking at how Microsoft have implemented it on Xbox One X with auto enhancements, etc. I think this will be included in all future consoles. And backwards compatibility would be a huge benefit for VR if there is a PlayStation VR 2 alongside the PlayStation 5.Please though, forget the idea of forwards compatibility. I don’t want an entire generation of basically cross-gen games and hate the idea that the only enhancements to gaming in the years to come is visual bells and whistles.As to when these new consoles will be released, my money is on early 2020 with hopefully an E3 2019 reveal.Adam\n E-mail your comments to: gamecentral@ukmetro.co.uk Every time the next generation talk starts up I always end up hoping for holograms but it never happens. I did see a demo of some kind of tablet like thing the other day but I still don’t think this is the gen when my dreams will come true. That would be the ultimate though.Mind you, I use to also always wish for good VR and that has actually happened to a degree. PlayStation VR has been great, with a really fantastic line-up of games now. So my real hope for the next gen is that we get a version 2 that’s higher quality, better resolution and the same or lower price.The future is slow catching up with my imagination but I think it’ll be the PlayStation 6 or 7 before it’s entirely there.Johnson\n I’d like to see some innovation in the controllers for the next generation. Microsoft and Sony always leave that up to Nintendo and I think the PlayStation in particular is in desperate need of a complete rethink. I’d like to see an end to the DualShock and its horrible analogue sticks once and for all.Getting slightly better every generation is not good enough, as it always means it’s at least two steps behind Microsoft. All these decades later we shouldn’t be using basically the same control system as we had for PS1 games.I’d particularly like to do away with the right analogue stick as I hate controlling the camera in games and I’ve noticed that with many people this is what puts them off playing more complicated games. I know that’s the case with my girlfriend in particular.I think the ideal solution would be to get the game itself to handle that stuff. You’d think artificial intelligence would have advanced enough by now to work out how to point the camera where you’re going, but apparently not. Or maybe eye-tracking could become standard. Although I’m not sure what happens with that when you glance at something other than the TV.Scooter\n For the next generation of consoles I want better enemies. Not better-looking enemies but smarter ones, so I guess they would need a lot of CPU power to process the artificial intelligence.Games look great as it is now so graphical improvements isn’t that necessary. VR isn’t what it could be so skip that as well as motion controls, as we tried that already.bobwallett\n Catch up on every previous Games Inbox here With the next gen nearly upon us, there are a few things I’d like to see from the next generation of consoles.Obviously graphics will be slightly shinier, and I hope they manage to reach a steady 60fps in each game, with 4K obviously going to be pushed for as well. While better graphics are welcome, I feel the artificial intelligence needs to improve a lot, as it hasn’t developed much over the past few console generations. I’d also like the ability to access my full PlayStation digital library on the PlayStation 5, as Microsoft are doing with the Xbox. I also hope they keep a physical media drive, as I still want the choice between buying a game as a download or a disc, and the ability to play my Blu-rays and DVDs.With PlayStation VR beginning to hit its stride, I’d like to see an improved headset that is smaller and lighter with less wires and a better resolution. I’d also like to see them redesign the Move controllers and make the glowing ping pong ball at least a bit smaller and include a thumbstick for movement.I’ve also used Remote Play a lot on the PS Vita, which frees the TV for the family to use, and I’d like to be able to use this feature on the next gen. Whether that means using streaming to a tablet or phone, or making the console more like the Switch it’s something that gives you the flexibility to play games when you don’t have access to the TV.I also hope that the diversity of games on offer increases, and we’re not sold as many sequels year on year. I’d much rather developers spent four or five years crafting an outstanding experience, than churning out yearly sequels that diminish in quality.Cubes (PSN ID)/SW-3654-9259-0500/Kevin M\n E-mail your comments to: gamecentral@ukmetro.co.uk The small printNew Inbox updates appear twice daily, every weekday morning and afternoon. Letters are used on merit and may be edited for length.You can also submit your own 500 to 600-word 4Player viewer features at any time, which if used will be shown in the next available weekend slot.If you need quick access to the GameCentral channel page please use www.metro.co.uk/games and don’t forget to follow us on Twitter."}