{"id": "Spice Girls tickets search is Ticketmaster’s ‘busiest sale ever’ as millions go on the hunt", "paragraph": "135.6m sharesThe search for Spice Girls tickets has smashed records like never before.A new batch of tickets for the Spice Girls reunion tour in 2019 went on sale today after the girl group announced a new set of dates due to popular demand.According to Ticketmaster, millions of fans flooded the site in their hunt to nab the golden tickets leading to the company’s ‘busiest sale ever’.Now that’s what you call girl power.Andrew Parsons, managing director at Ticketmaster was amazed by the response and said: ‘Demand for Spice Girls was off the chart. They have smashed through Ticketmaster UK’s records becoming the busiest ever sale.‘There were millions of people on our site searching for tickets, with a queue at one point of well over 700,000.’He continued: ‘Hundreds of thousands of tickets were sold to happy fans across the country within minutes. Congratulations to the girls. From what we saw, they could have played nearly every night for a year.’Among the additional dates added include two extra nights at London’s Wembley Arena in June, another night at the Manchester Etihad Stadium and one at the Ricoh Arena in Coventry.Mel C, who will be joined by Emma Bunton, Geri Horner and Mel B on tour, said earlier that she was ‘overwhelmed’ by the positive reaction to their comeback.The popstar tweeted: ‘I know you’ve been bombarded with promo stuff lately but I just wanted to say I’m completely overwhelmed with the response to our tour. Wow!‘I did not expect that. It’s going to be AMAZING!! Thank you so much! #SpiceUpYourLife.’More Spice Girls tickets going on sale as extra tour date is announced for 2019Spice Girls hail fans after selling out nine stadium showsPeople aren’t happy the Spice Girls are shunning girl power for people powerVictoria Beckham will be missing all the fun on tour as she has chosen to sit this one out and focus on her fashion business.Tickets are in such high demand that they’re selling on resale sites for as much as £1,000, infuriating fans who can’t afford the extreme prices.If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\n\n\n"}