{"id": "Suga from BTS’ definition of Kpop comes to light: I don’t like calling it a genre", "paragraph": "135.6m sharesBTS’ Suga says Kpop isn’t a genre – it’s something much more.The erudite South Korean singer, who the Army often praises for his intelligence, revealed that he’s thought quite hard about what Kpop does, and doesn’t mean for music.During their visit to the US, the multi-award-winning Korean band had a Q&A at the Grammy Museum with executive director Scott Goldman, which the museum recently uploaded on its Facebook page.There, they were asked about Kpop music as a genre. Is that an accurate categorisation of their music?After a moment of silence Suga picked up the mic and responded: ‘I’m a little careful to talk about Kpop as a genre because I don’t want to be defining Kpop as a genre,’ he told Goldman.‘I’m a little bit wary of that but I think rather than approach Kpop as a genre, a better approach would be “integrated content”.’Sorry, this video isn't available any more.‘Kpop includes not just the music, but the clothes, the makeup, the choreography…all these elements I think sort of amalgamate together in a visual and auditory content package, that I think sets it apart from other music or maybe other genres so again, as I said, rather than approach Kpop as it’s own genre I think approaching it as this integration of different content would be better.’The idea that Kpop is a form ‘integrated content’ was touched on earlier this week, when film festival director Hyejung Jeon exclusively told Metro.co.uk that BTS’ popularity lays with how versatile they are – and because they satisfy all our senses.‘They say BTS is like Beatles…,’ she said. ‘Well, they’re so popular because of social media. And they don’t just sing – it’s total culture: music, art, fashion…everything. We can show everything.’Golden maknae Jungkook also addressed the topic, saying that he enriches his musical knowledge by listening to lots of different genres – not just Kpop.Jessie J hasn't given up on hopes of becoming a mother naturally after refusing a hysterecJustin Bieber finally settles lawsuit for egging neighbour's houseJessica Chastain and husband Gian Luca 'welcome their first child by surrogate'‘I try not to categorise the music that I listen to. So I listen to a lot of Kpop, I listen to a lot of American pop or international music. I listen to the lyrics and I try not to set the lyrics apart.‘I listen to the English lyrics and sometimes that gives me inspiration.’‘So right now, for me, I’m trying to listen to as many genres of music as possible and as broadly as possible.’BTS are set to perform in Tokyo on 13 November for the next leg of their world tour.If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.MORE: Miss Baek review: The noir film explodes out of South Korea, with a riveting performance from Han Ji-minMORE: ‘Before BTS, we had B-Boys’: LEAFF festival creator Hyejung Jeon talks about Korean culture’s moment in the West\n\n\n\n"}