{"id": "Baby born with cleft palate smiles for the first time thanks to life-changing surgery", "paragraph": "135.6m sharesA baby who was born with a cleft palate can smile for the first time in his life after having life-changing surgery.Cam Martin was born two minutes after his twin brother Jack on April 3 to parents Matt and Sara Martin.But unlike his sibling, Cam had a cleft palate, meaning his upper lip, the bones of his upper jaw and his gum were split, which meant he was unable to breastfeed and had to be fed through a specially-designed bottle.Plastic surgeons told Matt, 29, and Sara, 27 that their little boy would need a number of operations to rebuild his mouth.On July 25, at just over three-months-old, Cam had the gruelling five-hour operation to repair his upper lip – and the results are absolutely incredible.Adorable photos show the youngster beaming widely just a few days after the surgery at Medical City Dallas Hospital.Matt, a filmmaker from Texas, said: ‘It was really hard to hand him over for surgery. When the nurses gave him back he was screaming.‘They had him on morphine and his face was swollen and bruised and bloody.‘It was like we had been given back a different baby.‘He cried the whole day. We had to feed him with a syringe after the operation.‘I hated knowing that something we had chosen, the operation, had caused so much pain for our son.’But a few days after the operation, as the swelling went down and the bruising healed, the worried parents were rewarded by seeing Cam smile for the first time with his full upper lip.Matt said: ‘Sara was changing his diaper and I was watching TV. She started screaming: “Come in here, he’s smiling!”‘I rushed in. I couldn’t believe it. In my darkest moments, I thought I’d never see him smile with a healed top lip but here he was beaming at me.‘It was a full face smile. He was giving the biggest grin he could.‘Sara and I cried because we were beginning to think we’d never see him smile.‘The beam was in his eyes and in his cheeks. He was saying: “I’m still here, I’m still the same baby, everything’s OK.”‘Although some ultrasounds can pick up a cleft palate before birth, Cam’s remained undetected.But Matt said that as soon as he was born, he and Sara, a dental assistant, knew something was wrong.He said: ‘No one said anything at first. I went over to see Cam and the nurses were all huddled together.‘I had never seen anything like his face before. I had no idea what I was looking at.‘A nurse told me he had a cleft lip and palate and that they needed to work out how he was going to eat and breathe.’After a few days on the neonatal intensive care unit, Cam was able to go home with his parents and brother.Cam had to be fitted with a mouthpiece, known as a NAM device, which covered the roof of his mouth to stretch out the area in preparation for the first operation.But although it was necessary, the device was painful for little Cam, and Matt said he and Sara would wonder if they were doing the right thing.Although the first operation has been a success, Cam faces a further two to fully heal his cleft palate.The second, which will happen when he is 18 months old, will repair the roof of his mouth.The final procedure, which will happen between the age of four and seven, will rebuild his gums with a bone graft.Matt and Sara now want to give hope to other parents who are struggling with a baby with a cleft palate.He said: ‘It is terrifying but the scariest part is before you go and talk to surgeons.‘Once you get your doctor and a solid team in place, it gets a lot less scary.‘You fall in love with your baby and it doesn’t matter whether they have a cleft palate or not.’If you have a story for our news team, email us at webnews@metro.co.uk.You can also follow us on Facebook and Twitter."}