{"id": "‘Racist’ passenger wore blackface Halloween costume on London Underground", "paragraph": "135.6m sharesA tube passenger spotted wearing ‘blackface’ on the tube told a woman who confronted him: ‘Why not?’The man, who wore a wig and a suit as well as dark face paint, defended himself when asked why he chose to do it.‘It’s a bit racist that you put black make-up on,’ a woman tells him as she tries to explain the problems with a Halloween costume like this.He appears to shrug and deny that there is a problem.To view this video please enable JavaScript, and consider upgrading to a web\n\t\t\t\t\t\tbrowser that\n\t\t\t\t\t\tsupports HTML5\n\t\t\t\t\t\t\tvideoIt’s 2018 ? How is this still happening ? pic.twitter.com/Iaifc7wDGx— Dolli (@DOkoriko) October 27, 2018Video of the incident, on the Central Line, was posted on Twitter by another woman, 24, who says she is a make-up artist and a mother of one.‘It’s 2018? How is this still happening?’ she asked.People said the man appeared to be attempting a costume as Samuel L Jackson’s character Jules Winnfield in Pulp Fiction.‘His shrug of the shoulders and utter nonchalance with the woman next to him looking bemused is probably the most scary thing about this video,’ one woman responded.His shrug of the shoulders and utter nonchalance with the woman next to him looking bemused is probably the most scary thing about this video #its2018 #WhitePrivilege https://t.co/vIXfREjusr— Sara (@SaraLoush) October 27, 2018*long heavy sigh* I just can't….. pic.twitter.com/bLBWZeTmsP— B B™ (@Barbs_B1) October 27, 2018Some defended him, with one person asking: ‘People dress in green on st Patrick’s day and act like leprechauns and you don’t get up in arms. If I want to be Jules Winnfield from pulp fiction why not. He’s badass, not cause I’m racist?’Another pointed out the flaw in this argument: ‘Leprechauns do face systemic prejudice and inequality simply because they’re green, you’re absolutely right.’When a white couple decide to dress up as 2 Pulp Fiction characters, but instead of the obvious choice of character the dickhead guy dresses up with blackface as Samuel L Jackson's character instead of John Travolta's.— Otaku Vegan (@HentaiVegan) October 27, 2018A woman calling herself Black Avalanche tried to explain: ‘It’s not the fact that he is dressed up as someone black, it’s the fact he painted his face black.‘Blackface was always used (by white people) as something negative. They would exaggerate our features and make fun of us. Dressing up, fine. Blackface, never acceptable.’Video of the man has been retweeted almost 4,000 times since it was shared on Twitter yesterday.If you have a story for our news team, email us at webnews@metro.co.uk.You can also follow us on Facebook and Twitter."}