{"id": "We’d fight for our children to have clean water – so where is the fight for clean air?", "paragraph": "135.6m sharesImagine this scenario: it is uncovered that one third of children in the UK are drinking dirty polluted water and are therefore at a very high risk of contracting disease.Hundreds of thousands of parents take to the streets calling for action, there is 24-hour news coverage on what is happening, and the front page of every newspaper and every editorial demands that the government take urgent steps to save our children from this terrible, polluted water.In response, the government declares a state of emergency and urgent legislation is drafted. A clean water act is rushed through parliament, and lives are saved.It’s not hard to imagine.However, substitute dirty polluted water for dirty polluted air and suddenly we don’t have hundreds of thousands of parents marching, there is no TV news channel reporting and there are very few articles demanding action.The crisis of air pollution in the UK is largely a silent emergency – even though it is estimated that the equivalent of 40,000 premature deaths are caused as a result.A recent report by Unicef found that one third of our children live in areas where levels of air pollution are above the World Health Organisation’s recommended limits.To make matters worse, 6,000 new school places have been approved in such areas in the lasts six years.The crisis of air pollution in the UK is largely a silent emergency – even though it is estimated that the equivalent of 40,000 premature deaths are caused as a result.This isn’t because parents don’t care about the poisoning of their children – it’s because they just don’t know it’s happening.Air pollution is hard to see. Many people wouldn’t know that the UK has regularly breached the legal limit for air pollution in the country.They wouldn’t know that these legal limits should have been met in 2010 either.But without further action, they are unlikely to be met until 2028 in London, and until as late as 2027 in other cities and towns including Bradford, Cardiff, Derby, Glasgow, Southampton, Nottingham, Leeds and Middlesbrough.Most people also are probably not aware that children are more likely to be affected because they breathe more air per minute than adults, and buggies and prams put them at the level of car exhausts.Dirty air is a danger to their health, from triggering asthma attacks and stunting lung growth, to causing problems in later life and increasing the chances of cancer and infections such as pneumonia.So although we have banned tobacco adverts from our children’s schools, we haven’t done anything to protect them from the poisonous air they are breathing while there.But here is a twist to cheer you up.Unlike so many of the apparently intractable problems we face today, this is absolutely fixable with a little bit of political will and a modest amount of investment.This is why I, along with former Conservative cabinet minister Maria Miller, helped to launch the Clean Air for Children Programme last week, which has been created by the Clean Air Parents’ Network, made up of mums and dads from across the country.The programme calls for emergency measures to protect childrens’ and babies’ lungs from illegal and harmful levels of air pollution at their schools and playgrounds.At the moment, national government doesn’t even collect data on which schools and children are at risk. We are demanding that the government identify all schools affected by harmful levels of air pollution.Parents rightly expect to know the exam results at a school, the quality of teaching and the policy on bullying. They also have a right to know whether their kids’ health is being put at risk.Going to the gym should never be about guiltWhole Foods shares the healthy food trends we'll all be fans of in 2019Having to admit that I can't cope with my daughter's cancer is the hardest thing I've doneThe next step is to support local authorities to have traffic exclusion zones – timed diversions – for those schools identified.  It’s already being done, and working, in some areas.We also need a halt to building new school places in areas that are polluted.Cash-strapped local authorities will have trouble affording this on their own. But just £150m from national government could roll out the emergency measures required that would tackle schools that are most affected.It seems a small price to pay in order to protect our children.So how do we make this happen?New laws on clean air have been promised next year as part of the upcoming environment bill, but despite support from MPs of all parties, it won’t happen without public pressure.Join the Clean Air parent’s network and even if you don’t have children, get involved in the campaign. Demand action from your local authority and from central government.Once inflicted, the damage that polluted air does to our children’s lungs is irreversible.We can’t afford to wait. It’s a public health emergency and there is a cross-party will to fix it.We need to make it happen.MORE: Extreme climate change could happen in just 12 years – and it’s the poor and vulnerable who will suffer mostMORE: Threat of developing dementia soars by 40% in areas of high air pollutionMORE: Climate change is causing ecoanxiety and damaging our mental health – what can we do?"}