{"id": "Miley Cyrus left ‘devastated’ after losing home to California wildfires: ‘I am one of the lucky ones’", "paragraph": "135.6m sharesMiley Cyrus has become the latest celebrity to lose her home in the California wildfires.The singer and actress took to Twitter on Sunday to confirm she and fiance Liam Hemsworth – and their beloved pets – had escaped the fires unharmed.However, she revealed her home ‘no longer stands’.‘Completely devestated [sic] by the fires affecting my community,’ she shared with her 40.4 million followers.‘I am one of the lucky ones. My animals and LOVE OF MY LIFE made it out safely & that’s all that matters right now. My house no longer stands but the memories shared with family & friends stand strong. I am grateful for all I have left.’Thanking the emergency services and calling on her fans to help support the relief efforts, she added: ‘Sending so much love and gratitude to the firefighters and LA country Sheriff’s department! If you are interested in getting involved see next tweet…. Donate $ , Time , Supplies I love you more than ever , Miley.’Completely devestated by the fires affecting my community. I am one of the lucky ones. My animals and LOVE OF MY LIFE made it out safely & that’s all that matters right now. My house no longer stands but the memories shared with family & friends stand strong. I am grateful for— Miley Ray Cyrus (@MileyCyrus) November 12, 2018Fans quickly flooded Miley’s post with well wishes and messages of support.‘I am so sorry for your loss, but glad you’re all safe. love you,’ one wrote, while another commented: ‘I’m so glad you & your babies are safe. I’ve been praying for the area, firefighters, & all those affected.’A third added: ‘I am very relieved to know that you and your animals are safe and well. I love you with all my heart. memories stay in the heart forever, all happy moments will be forever remembered.’Jessie J hasn't given up on hopes of becoming a mother naturally after refusing a hysterecJustin Bieber finally settles lawsuit for egging neighbour's houseJessica Chastain and husband Gian Luca 'welcome their first child by surrogate'Nearly 30 people have died from the wildfire in Northern California, with a further 230 people still unaccounted for, in what has been one of the most destructive fires on record in the state of California.Wildfires continue to rage on both ends of the state, with gusty winds expected overnight set to challenge firefighters further. The statewide death toll currently stands at 31 and appears certain to rise.Lady Gaga, Kim Kardashian West and Martin Sheen have all been forced to flee their Malibu homes, while Gerard Butler revealed on Sunday he too has had his house incinerated.The actor was one of the many people urged to evacuate in the midst of the wildfires, but on returning home, he discovered part of his property had been destroyed by the flames.‘Returned to my house in Malibu after evacuating,’ Gerard wrote on Twitter alongside an image of the remains of his truck and house.‘Heartbreaking time across California. Inspired as ever by the courage, spirit and sacrifice of firefighters. Thank you @LAFD. If you can, support these brave men and women at http://SupportLAFD.org’Meanwhile Robin Thicke and his pregnant girlfriend April Love Geary also returned over the weekend to find out their house ‘was gone’.If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.MORE: Nicki Minaj hits on Michael B Jordan as she accepts People’s Choice Award and fans definitely approveMORE: Piers Morgan ‘wants to see Kate Garraway in jungle shower’ as she denies I’m a Celeb offer\n\n\n\n"}