{"id": "LucidSound LS35X review: the best wireless headset for Xbox One? – Reader’s Feature", "paragraph": "135.6m sharesA reader takes a look at what should have been the first wireless headset for the Xbox One but encounters some troubling problems.Following on from my gaming headset comparison review comes the highly anticipated LucidSound LS35X. After several delays, does this completely wireless solution for Xbox One justify the long wait and earn the label of best gaming headset for Xbox? For the past week I have put the headset through its paces and, as is normally the case with these type of devices, to answer such a question is never cut and dry.CompatibilityWireless connectivity for Xbox One being the headline feature, despite technically being compatible with both PlayStation 4 and Switch via a 3.5mm input, a wired solution is a compromise. For owners of multiple formats including Xbox there is some merit to purchasing the LS35X, otherwise non-Xbox gamers are better served waiting for the LucidSound LS31 or LS41.On PC this headset will work wirelessly, but only with the addition of a wireless adapter (sold separately). Given Microsoft’s insistence on cross compatibility with PC and Play Anywhere initiative, it’s perhaps a missed opportunity to include the wireless dongle as standard. It does state ‘Xbox and Windows 10’ on the packaging after all, though logic dictates cost was the deciding factor.Build quality and comfortI don’t need to labour the point when it comes to build, LucidSound’s products are well made across their entire range. The LS35X is no exception, although it’s a case of refinement over redesign. The metallic materials from previous models remain prominent, which along with a black finish and white accents, help deliver a more premium feel than even its flagship predecessor, the LS40. The memory foam ear cushions are very comfortable, easily removable and mould to your head. Leatherette on the outer rim and fabric where the cushions touch the skin, the coolant gel infused material helps to avoid heat build-up. The reality is they only feel cold on initial contact, but despite this short-lived sensation they successfully avoid sweaty ears.The adjustable hinges appear more solid than the previous line of headsets and the move to oval earcups are more accommodating. The headset is deceptively comfortable to wear: they aren’t especially lightweight in the hand, but in practice there’s no pressure points to hinder extended play. It’s not the most comfortable headset I’ve ever worn, but more than adequate. In terms of design style, subjectively speaking I think they’re an attractive headset. There is an understated elegance to the design, which though distinctive avoids the over-fussy look associated with many gaming headsets. If you favour flashing lights or more elaborate aesthetics, then the LS35X may not be to your taste.Audio performanceAs a reference, the Arctis Pro Wireless is the best sounding headset I’ve encountered to date, which is still true, although it was let down slightly by a subdued bass. The LS35X is admirably close when it comes to clarity, with well defined lows, mids, and highs. The signature sound is not dissimilar, with orchestral music in particular coming across impressively detailed. The differentiation is at the lower end, with typical video game audio such as explosions and gunfire producing more of an impact. Audio is very robust with no unwanted signs of stress at the extremes, even on its highest volume. The LS35X is an extremely loud headset on maximum setting.Whilst they can’t compete with the high res audio of the Arctis for pin sharpness, where they arguably surpass its rival is overall balance, as there isn’t a noteworthy weakness to be found. Whereas the Arctis relied upon 40mm drivers, the LS35X utilises 50mm, which perhaps attributes to the fuller bass.In summary, an extremely balanced sound, with pristine clarity, thumping bass, and accurate positional awareness. I used both Windows Sonic and Dolby Atmos to test its virtual surround capabilities. To be honest it’s difficult to distinguish between the two technologies, both offer accomplished surround sound, with negligible differences. If anything, Windows Sonic offers a wider soundstage, but both provide great precision. This feature was especially useful whilst playing Blackout, providing a situational awareness that almost feels like cheating. Not that it enabled me to finish last man standing!Microphone qualityI have received no complaints from friends using the boom mic for wireless chat, which comes across as clear. I recommend placing the mic relatively close to your mouth for mic monitoring feedback however, which is on the subtle side. The internal mic is merely a fallback option, so unless you want to sound like you are in a cave, the boom mic is advisable for online situations.Set-up and featuresI had the headset up and working in seconds, which only requires a one-time synchronisation with the console. Then you simply select the appropriate audio profile. Dolby Atmos has a free trial (or one-off payment) should you prefer it to Microsoft’s free alternative.The main feature being completely wireless, the rest of the feature-set is somewhat sparse. There’s no alternate EQ settings to tinker with, which could be a major downside for some users. Not having access to additional modes to customise is a relatively minor irritation compared to the lack of Bluetooth support. The added versatility Bluetooth affords continues to be an oversight by the majority of manufacturers, which I feel should be standard on any modern gaming headset.Battery recharging is a simplistic set-up, with no base stations or swappable batteries to contend with. The battery life is quoted at 15 hours per charge, which is adequate, and has play and charge functionality via USB (note the supplied cable is very short). There is also the back-up option of using the 3.5mm audio cable (included) for mobile devices, or you can plug into the controller and not be concerned about power.The standout feature is undoubtedly the intuitive controls. Each earcup incorporates a large dial which you rotate to adjust game/voice audio independently. It is an ingenious system which requires no muscle memory to become accustomed to. As for muting game/chat audio, you simply press the relevant earcup, which couldn’t be any more straightforward.ConclusionEven without Bluetooth support, the LS35X presents a strong case for being amongst the best wireless headsets available for Xbox One. It’s a streamlined approach, with no superfluous devices and few supplementary features. The cost is exhibited by the headset alone, which shows in the build quality and audio performance, even if the overall package appears somewhat bare bones. The appeal is in its simplicity and excels where it counts.Now before you hastily place that pre-order, here is the part where I insert one huge caveat for any potential buyer…In terms of reliability, the initial performance was flawless with no instances of audio dropouts – which have been reported across the pond. Whether these occurrences are widespread is difficult to ascertain from Amazon reviews, but after several days usage my own experience has deteriorated significantly. Distorting audio in the form of crackling has been an intermittent, yet prominent issue, and remains unresolved at this time.Bearing in mind this isn’t a problem I can associate with any previous headset, it is a concern. A permanent remedy could require a firmware fix, which would be hugely disappointing given the deferred release date. This makes any sort of recommendation extremely difficult without determining whether this particular fault is inherent or random. And of course there are those US Amazon complaints to consider.Even if I take the assumption I am unlucky to have a faulty unit, unfortunately that’s not my only reservation. The pre-order price on Amazon UK (available November 20) is currently listed for an eye-watering £199.99. I had mine shipped from Amazon US ($179.99), which after shipping/import fees came to just over £180. Still an excessive amount, it appears there’s a premium charge for convenience.When the LS35X was originally due for release it was set to be the first on the market to offer complete wireless functionality for Xbox One. After numerous delays it was subsequently beaten to market by rival manufacturers. It may be amongst the best wireless headsets available for Xbox, but it has arrived belatedly, without a unique selling point and with a few notable drawbacks which tarnish what is an otherwise outstanding gaming headset.Fortunately, the official UK release is several weeks away, by which time some of the reported faults could be resolved – or at least explained. My advice would be to tread carefully and ensure the retailer has a good returns policy. It frustrates me when I open a headset box and I am greeted with a message from the manufacturer stating ‘don’t send back to the retailer’ followed by technical support information. Trouble-shooting should not be part of the buying experience.Pros:Excellent audio\nCompletely wireless\nPremium quality design and finish\nEasy set-up and use\nIntuitive controls\nDecent mic outputCons:Overly expensive\nPC owners are required to pay extra for wireless functionality\nLack of customisation\nNo Bluetooth support\nReported technical issuesOverall rating: *7/10*Add a point to the score if the technical problems are isolated incidents or subtract all 7 if they aren’t!By reader Up4BanterThe reader’s feature does not necessary represent the views of GameCentral or Metro.You can submit your own 500 to 600-word reader feature at any time, which if used will be published in the next appropriate weekend slot. As always, email gamecentral@ukmetro.co.uk and follow us on Twitter."}