{"id": "EXO’s Lay talks success of Namanana and working with Justin Bieber on Michael Jackson tribute", "paragraph": "135.6m sharesLay, member of K-pop idol group EXO, has successfully released his first US solo album Namanana, which showcases his talent as a singer, songwriter and producer. The 22-track album consists of 11 English and 11 Chinese songs, including the dance pop song Namanana and Give Me a Chance, an urban pop track in collaboration with Bazzi. Upon its release, the album topped iTunes in 16 countries and regions including Singapore, Malaysia, Colombia, Peru, Taiwan, Macau, United Arab Emirates and Greece. Speaking to Metro.co.uk, Lay told us that he’s happy with Namanana as it allowed him to present new material to the US audience.‘​I’m very happy to release Namanana in the US. I know hip-hop is hot in the US now and I can make music like that too. But I want to try to introduce a new sound in the market,’ he said.On Billboard, Lay landed at No. 10 on the Social 50 and No. 30 on Emerging Artists charts for the week of 20 October. He’s hoping that one of his songs in the album will chart on Billboard 100. He was the first Chinese artist to chart in the top 10 on iTunes world charts. ‘​I am very happy and really appreciate it, as we would hope to have worldwide recognition. I am also hoping that one of the singles will hit Billboard Hot 100 chart. I hope that I am lucky enough to have the chance to show the world my music,’ he said. Lay, real name Zhang Yixing, revealed that he will be visiting New York by the end of the year and plans to be more active in the US. ‘​I’m going to go to New York in December. I have a plan to do more in the US and I want to see my fans there,’ he said.BTS Jimin’s T-shirt controversy isn't the first K-pop-related historical blunder'There's no just being happy or just being sad': RAVI continues to break the mouldE'Dawn confirmed to leave Cube Entertainment as agency terminates contractBack in August, it was announced that Lay would be part of the Michael Jackson tribute project song Let’s Shut Up and Dance, which will be released on 16 November. The project is meant to commemorate Jackson’s 60th birthday this year. Lay said: ‘​It is my honour to join the Michael Jackson tribute and I really appreciate the chance to collaborate with great artists. It is my honour to get to collaborate with Jason Derulo and Justin Bieber.’This confirmed that Bieber will be part of the project. In the first announcement last August, his name was not included in the list of artists participating in the song.  Lay said he is working hard to meet the expectations of his fans. ‘I’m trying my best to make a good sound for my fans. If my fans miss me I’ll try my best to meet them all,’ he said.If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.MORE: BTS’ Suga defends fans over ‘prejudice’ against Kpop and the Army love him for itMORE: Rami Malek defends Bohemian Rhapsody over not telling ‘dark and seedy’ side of Freddie Mercury\n\n\n\n"}