{"id": "Coronation Street spoilers: A devastating revelation from Daniel Osbourne and Peter Barlow destroys Ken", "paragraph": "135.6m sharesThe Barlow family have had their fair share of revelations over the years but the one coming up might just rip them apart forever in Coronation Street as Ken is left reeling by words from his sons Peter and Daniel. At the moment, Ken is harbouring Sinead’s secret that she is battling cervical cancer as she doesn’t want Daniel to be broken by the tragic truth. But when she then collapses and is rushed to hospital, Ken finds that he can’t keep lying to his son.Daniel is shattered by the news and, in a special episode featuring only the characters Ken, Daniel, Peter and Sinead, he rounds on his dad and blames him for not keeping him in the picture. Peter defends Ken and then takes Daniel to one side, where he persuades him that he needs to focus on being there for Sinead.MORE: 25 soap spoilers: Emmerdale murder shock, Coronation Street death trauma, EastEnders baby twist, Hollyoaks fightDaniel calms down and holds Sinead close, telling her he loves her and will support her during every step on this arduous journey. But when Ken then overhears a conversation between Peter and Daniel about their upbringing and his skills as a father, he is broken hearted.Will this lead to a row or a valuable wake up call? And will Daniel and Peter realise that Ken knows what they have said?To view this video please enable JavaScript, and consider upgrading to a web\n\t\t\t\t\t\tbrowser that\n\t\t\t\t\t\tsupports HTML5\n\t\t\t\t\t\t\tvideoWilliam Roache said of the Barlow special: ‘When Daniel does find out Ken gets the full blast of all the pent up resentment that Daniel has lurking because he was an absent father. It’s a great episode, drawing on their history and bringing all those things together. One of the things I love in Coronation Street is how it draws on its own history, in this case the history of Ken being a bad father.‘I love it when we’re working in the Barlows, I’m very fond of them all in real life, I’m really enjoying having a full house again. A few years ago there was just Ken, Tracy and Amy. Now there’s Tracy, Amy, Daniel, Adam, Peter, Simon, Steve and Sinead as well, there are so many stories to tell.’Coronation Street airs this special episode on Monday 29th October at 8:30pm on ITV. MORE: 25 soap spoilers: Emmerdale murder shock, Coronation Street death trauma, EastEnders baby twist, Hollyoaks fightMORE: Coronation Street spoilers: Another new Roy Cropper and Evelyn Plummer twist after dogging arrest\n\n\n\n"}