{"id": "End to chemotherapy? Scientists discover cells can self-destruct if they become cancerous", "paragraph": "135.6m sharesEvery cell in the human body contains a ‘kill code’ which can be triggered to cause its own self-destruction if it becomes cancerous.As soon as the cell’s ‘inner bodyguards’ sense it is mutating into cancer, they have the ability to extinguish the rogue cell.Scientists at Northwestern University, Illinois, made the discovery and believe it could be utilised in the fight against cancer.They believe that malignant cells could be encouraged into the act of suicide without the need for gruelling rounds of chemotherapy.These kill codes are embedded in ribonucleic acids, which scientists estimate evolved more than 800,000,000 years ago in part to protect the body against cancer.They are already somewhat successful but cannot always compete with aggressive tumours.They are, however, triggered by rounds of chemotherapy, whereby toxic chemicals are pumped into the body.The hope is now that scientists can find a way to synthetically activate the ‘kill code’ without the need for these toxic drugs.Sorry, this video isn't available any more.Lead author Marcus E. Peter, the Tomas D. Spies Professor of Cancer Metabolism at Northwestern University Feinberg School of Medicine said: ‘Now that we know the kill code, we can trigger the mechanism without having to use chemotherapy and without messing with the genome.‘We can use these small RNAs directly, introduce them into cells and trigger the kill switch.’‘My goal was not to come up with a new artificial toxic substance,’ he added. ‘I wanted to follow nature’s lead. I want to utilize a mechanism that nature designed.’He added: ‘Based on what we have learned in these two studies, we can now design artificial microRNAs that are much more powerful in killing cancer cells than even the ones developed by nature.’Scientists have stressed that a potential therapy is still several years away.The paper describing the kill code and identifying how the cancer-fighting microRNAs use the code to kill tumor cells was published in the Nature Communications, today.If you have a story for our news team, email us at webnews@metro.co.uk.You can also follow us on Facebook and Twitter."}