{"id": "Boy, 17, stabbed to death outside Clapham tube station", "paragraph": "135.6m sharesA 17-year-old boy has died after being stabbed outside Clapham South Tube Station, south west London, this afternoon.Police were called to the station shortly after 4.30pm following reports of a stabbing outside the station.The teenager was found with stab wounds and was taken to hospital where he was pronounced dead.A murder investigation has now been launched and police are appealing for information.Charity director Robin Pritchard said he moved through a crowd and saw the victim lying in a pool of blood while someone provided CPR.The 47-year-old said: ‘I saw the guy on the floor, a pool of blood like he’d been stabbed in the stomach, his clothes were soaked.‘It was strangely calm and quiet. I think everyone was in shock. Lots of kids there from the local college.‘All I really registered were grey tracksuit bottoms which were soaked with a pool of blood coming from his waist like he’d been stabbed in the stomach.’Another witness who did not want to be named said he saw a man carrying a large knife in a ‘bunch of guys’ who were shouting and appeared agitated.He added that the area is usually noisy after students leave nearby Saint Francis Xavier College.He said: ‘I had no idea it was different to any other time the students get a bit noisy, until I saw the knife as I was literally passing them.’It comes the day after a 15-year-old, named locally as Jai Sewell, was stabbed to death in Bellingham, south east London.The killing marks the 115th homicide in the capital so far this year.To view this video please enable JavaScript, and consider upgrading to a web\n\t\t\t\t\t\tbrowser that\n\t\t\t\t\t\tsupports HTML5\n\t\t\t\t\t\t\tvideoHis family have not been informed and there have been no arrests so far, Scotland Yard said.Roads around the Tube station have been closed with police remaining on scene.A Scotland Yard spokesman said: ‘Police were called at approximately 16:35hrs on Friday, 2 November to reports of a stabbing outside Clapham South Tube Station.‘A 17-year-old male was found suffering from a stab wound. He was taken to a south London hospital where his life was pronounced extinct at 17:23 hours.‘Formal identification has not yet taken place and a post-mortem examination will be held in due course.’If you have a story for our news team, email us at webnews@metro.co.uk.You can also follow us on Facebook and Twitter."}