{"id": "Emmerdale spoilers: Cain and Debbie Dingle to be destroyed forever in new twist?", "paragraph": "135.6m sharesAs grief, guilt and despair weighs heavily upon them this winter, Cain and Debbie look set to be destroyed forever in Emmerdale – especially if Debbie finds out that Cain had a hand in leaving Joe Tate dead.For now, Debbie reckons that Joe has fled and left her in the lurch so her anger and upset is directed at him. But Graham Foster has a voicemail message from him which confirms that he was on his way back to the village to marry Debbie.Kim had ordered Joe’s death but Cain thinks that he killed him with a punch that knocked his head into a rock. Joe later stirred while Graham was disposing of him and this forced the secret agent/butler to finish him off. He has, however, kept this development quiet from Cain. Funny that.MORE: 25 soap spoilers: Emmerdale death trauma, Coronation Street murder twist, EastEnders discovery, Hollyoaks killer stormAs Debbie remains in agony over Joe’s disappearance, she will search for answers – and Charley Webb reckons that it will take her a lot to forgive her dad once she knows the truth.She told Metro.co.uk: ‘I think it could be the downfall for their relationship – it’ll be big. If she does eventually find out, it’s going to destroy them a little bit.’And show boss Jane Hudson appears to have confirmed that the pair are heading for the rocks where their close relationship is concerned as she has warned of one of the biggest ever Dingle divides to date.To view this video please enable JavaScript, and consider upgrading to a web\n\t\t\t\t\t\tbrowser that\n\t\t\t\t\t\tsupports HTML5\n\t\t\t\t\t\t\tvideoShe teased: ‘We have got huge rifts coming up in the Dingle clan that will blow apart two of our most loved characters and who knows if they will ever get back to where they used to be?’So is Debbie on course to finding out what Cain was involved in? And will this finally be the last straw between them?It’s going to be a rocky winter!MORE: 25 soap spoilers: Emmerdale death trauma, Coronation Street murder twist, EastEnders discovery, Hollyoaks killer stormMORE: 10 Emmerdale spoilers: Chas and Paddy’s new devastation, double exit and a huge shock for Debbie\n\n\n\n"}