{"id": "Amy Schumer isn’t finding it fun being pregnant at the same time as Meghan Markle", "paragraph": "135.6m sharesAmy Schumer has already joked about her first trimester being like something out of a horror movie.And now she’s off comparing her pregnancy to Meghan Markle’s – and it sounds like she’s not having a fun time.Chatting at her comedy show at Cosmopolitan in Las Vegas, the mum-to-be trolled herself over the royal baby and how she’s finding it difficult to even dress herself.She laughed: ‘You know who it’s not fun to be pregnant at the same time as? Meghan Markle!‘She’s walking around in heels and cradling her baby that’s not even there, and I’m barely wearing underwear.’The 37-year-old added: ‘I don’t like it. I’ve had a really tough pregnancy so far.’However, despite her hardship, she is still managing to see the funny side of her #FirstTrimesterProbs, as she opened up about the past three months to her Instagram followers.Sharing a picture of herself face-planting a bowl of food, the star recreated a scene out of the horror film Se7en.Slumped over a dinner table with her head buried in one of her many dishes, Amy posted a picture of herself next to a film still of the obese victim doing the same.‘First trimester had me like…’ she joked. And then she added: ‘So blessed.’ first trimester had me like #soblessedA post shared by @ amyschumer on Oct 28, 2018 at 10:38am PDTThe baby will be Amy’s first child with her hubby Chris Fischer, who she married in a secret wedding earlier this year.Taking to her gram, the star announced the news in a hilarious snap – again comparing herself to the royals.Editing her and her husband’s heads onto the bodies of the Duke and Duchess of Sussex, Amy wrote: ‘About to announce some exciting news on @jessicayellin insta page.‘Please follow her for up to the minute #newsnotnoise she breaks down what’s really going on. She agreed to post a lil noise today for me! Follow her and VOTE!!’Yellin, of the site NewsNotNoise.org, said in a video on her own Instagram page: ‘I wanted to share some news from our community, maybe it’s noise but it’s happy noise.Harry and Meghan 'might have to leave Kensington palace as minor royal won't move'Stella McCartney launches bridal collection including Meghan Markle's wedding gownMeghan's not the only royal who can cook as Will and Kate make soup for charity‘So I’m not in the business of making voting recommendations, but these are the recommendations of Amy Schumer, one of the most consistent and earliest supporters of News Not Noise.‘Now read all the way to the bottom, you’ll see there’s some news down there. Congratulations, Amy.’Yellin then shared a screen grab that included a note from Schumer saying ‘I’m pregnant’.If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.MORE: Little Mix hit with miming claims after ‘painful’ X Factor performance of Woman Like MeMORE: Pregnant Amy Schumer compares her first trimester to a scene from a horror film\n\n\n\n"}