{"id": "WWE’s Roman Reigns announces his leukaemia has returned and relinquishes championship title", "paragraph": "135.6m sharesRoman Reigns has announced his leukaemia has returned, ten years after his initial diagnosis.The wrestler, real name Joe Anoa’i, made the announcement during an episode of WWE Raw, where he told fans that he would be relinquishing his championship title.Speaking to the crowd, the 33-year-old said: ‘The reality is my name is Joe and I’ve been living with leukemia for 11 years and unfortunately it’s back. Because the leukemia is back, I can’t fulfill my role. I can’t be that fighting champion and I’m going to have to relinquish the universal championship.‘I’m not going to lie, I’ll take every prayer you can send my way but I’m not looking for sympathy, I’m not looking for you to feel bad for me because I have faith.’Here’s Roman Reigns announcing on Monday Night Raw that his leukemia has returned. pic.twitter.com/ucdWvgDmzd— Jimmy Traina (@JimmyTraina) October 23, 2018Speaking in Providence, Rhode Island, Roman continued: ‘Very quickly, I was able to put it in remission, but I’m not gonna lie: that was the hardest time of my life. I didn’t have a job, I didn’t have any money, I didn’t have a home and I had a baby on the way, and football was done with me.‘But you wanna know who gave me a chance? The team that gave me a chance was the WWE.’He concluded: ‘This is by no means a retirement speech. I will beat this, and I will be back, so you will see me very, very soon.’Following his emotional speech, wrestlers and fans began to share tweets with the hashtag #ThankYouRoman.‘Courage – strength in the face of pain or grief.’ You have given us your everything including a courageously vulnerable moment. We, your WWE family, give you all of our love and support. #ThankYouRoman #NeverGiveUp— John Cena (@JohnCena) October 23, 2018His real name is Joe & he’s a stand up guy! Inside the ring one of the best I’ve battled with. Outside the ring one of the most genuine people I have ever met & learned from. See you soon good brother #ThankYouRoman ( ..and he smells great)— Finn Bálor forEVERYone (@FinnBalor) October 23, 2018Roman Reigns exemplifies everything I believe a true leader should be. Proud to have shared a locker room with him, and I’ll be proud to share it with him again after he wins this battle.#ThankYouRoman— Chad Gable (@WWEGable) October 23, 2018Sending all the love to @WWERomanReigns he’s a Superman and one of the hardest workers in @WWE and a true leader. #ThankYouRoman— PAIGE (@RealPaigeWWE) October 23, 2018I’ve never seen the air sucked out of a locker room like it was tonight. Our thoughts and prayers are with Roman and his family. #ThankYouRoman— Daniel Bryan (@WWEDanielBryan) October 23, 2018.@WWERomanReigns you are the definition of what it means to be a leader and a champion and one of the toughest lads on the planet. We are all behind you and sending love. You will beat this. #ThankYouRoman— Rebecca Quin (@BeckyLynchWWE) October 23, 2018Finn Balor tweeted: ‘His real name is Joe & he’s a stand up guy! Inside the ring one of the best I’ve battled with. Outside the ring one of the most genuine people I have ever met & learned from. See you soon good brother #ThankYouRoman ( ..and he smells great).’And John Cena added: ‘‘Courage – strength in the face of pain or grief.’ You have given us your everything including a courageously vulnerable moment. We, your WWE family, give you all of our love and support. #ThankYouRoman #NeverGiveUp.’Daniel Bryan tweeted: ‘I’ve never seen the air sucked out of a locker room like it was tonight. Our thoughts and prayers are with Roman and his family’, while wrestler Paige wrote: ‘Sending all the love to @WWERomanReigns he’s a Superman and one of the hardest workers in @WWE and a true leader. #ThankYouRoman.’Daniel Bryan turns heel and beats AJ Styles to set up Brock Lesnar showdownA bloodied Becky Lynch became the internet's favourite wrestler last nightWWE star Alexa Bliss responds to retirement rumoursThe WWE Twitter account wrote: ‘DON’T call it a retirement speech. @WWERomanReigns WILL beat this, and we will see him again VERY, VERY SOON!’Roman made his WWE debut in 2010, and is a four-time world champion – holding the WWE World Heavyweight Championship three times as well as the Universal Championship.He married Galina Joelle Becker in 2014, with whom he has a daughter and twin sons.If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.MORE: Khabib Nurmagomedov has challenged Brock Lesnar to a WWE matchMORE: American Horror Story creator Ryan Murphy reveals son Ford’s cancer battle and the $10million donation he’s made to saving his life\n\n\n\n"}