{"id": "Having to admit that I can’t cope with my daughter’s cancer diagnosis is the hardest thing I’ve ever done", "paragraph": "135.6m sharesThere’s a tradition among young cancer patients that sees them ringing a special bell at the end of their treatment.When that gong sounds, everyone in the ward knows that another little boy or girl has finally had their last gruelling session of chemo or radiotherapy.Last month, at a clinic in Germany, it was the turn of my five year old daughter, Amelia, who was diagnosed with a rare brain tumour earlier this year.Except – true to form – Amelia didn’t want to ring her bell. If anything, she looked scared of it.And as her mum, I was terrified too.Yes, that bell marked the end of Amelia’s treatment, but what that bell also signified is that we now have to wait until January for a follow-up MRI scan, which will tell us if Amelia’s cancer has been kept at bay.Our journey is, then, only just beginning. And I’m sure it’s the same for lots of other families in our position.In the meantime we, as a family unit, have to find a new way of living, establishing new ‘normal’ routines. We always with one eye on what comes next, despite the fact that our lives have pretty much been exploded and then crudely pieced back together again.Our nightmare began in June this year, when Amelia suffered a seizure at school.You don’t naturally assume the worst. I remember thinking, ‘perhaps she overheated, or she might have epilepsy?’But Amelia didn’t have epilepsy. She actually had a ‘neuroepithelial’ tumour measuring 2cm in the upper part of her brain – one of only 30 known cases in Europe.She underwent a seven hour operation at Leeds General Infirmary to successfully remove it, amazing everyone with her courage and energy despite her extended stays in hospital.And seven weeks ago we flew to Essen, Germany, for Amelia to have something called proton beam therapy – a less damaging form of radiotherapy – to try and make sure her cancer doesn’t come back.We’re not alone in having this treatment. A recent Freedom of Information request undertaken by the Proton Therapy Center in Prague – another clinic who take patients from the UK – revealed how the NHS has approved 737 people to travel abroad for proton treatment since 2008, with almost three quarters of those being children.In Germany, there was an odd sense of detachment from the situation. We surrendered ourselves to the routine of treatment and put our faith in the healthcare professionals.But, the closer it came to coming home, the more reality started to creep back in.I had to go back to work to make sure we had money coming in, and I knew Amelia would have to start returning to school – something she’s beyond excited about.Yet how on earth would we just pick up our lives where we left off and continue as before?It didn’t help that when returned to the UK, it felt like events were conspiring against us.My washing machine broke down, my boiler broke down, my car broke down – things that just thrust us back into mundane, everyday life.What’s more, the situation has been particularly hard on my son, Amelia’s 11-year-old big brother Lewis.He’s always been quite slow to process information, and he’s always had a bit of a nervous tick, too.Going to the gym should never be about guiltWeightlifting protects against heart disease better than running or cyclingWoman says she can now leave the house thanks to CBD oil clearing her eczemaBut since we’ve been away, his tick has got much worse. I got him to the doctors, who said, ‘Let’s get him for an MRI, just to check everything out.’So now, on top of Amelia’s MRI scan in January, my son Lewis will also have one, as I worry that he might have a brain tumour, too.The doctors say it’s unlikely – his tick has probably just been exacerbated from the stress and anxiety caused by Amelia’s diagnosis – but it’s heaped on extra pressure, that’s for sure.Now it’s a case of admitting that I can’t do this on my own. I’ve had to fight off my natural instinct to withdraw into myself.I need help from family and I need support from the charities who are always there and offer invaluable assistance.I’d urge anyone in our position to do the same – because if you are affected, chances are you can’t do this on your own, either.We all need to reach out for help, even if it’s just someone to listen at the end of the phone.There are people out there who know what you’re going through, and life goes on – especially for a child fighting cancer.Vicky’s blog can be found here.MORE: Cancer survivor who risked disease returning to try for a baby has had a little girlMORE: Cancer treatments ravage your skin – these products are designed to helpMORE: New approach to anal cancer is ‘safer and more effective’"}