{"id": "Bohemian Rhapsody’s Lucy Boynton says sexual freedom is key message", "paragraph": "135.6m sharesActress Lucy Boynton thinks the key message behind the movie Bohemian Rhapsody is sexual freedom.The 24-year-old plays the love of Freddie Mercury’s life, Mary Austin, whom he came close to marrying and remained close to after he came out as gay.The new movie partly explores their relationship, as well as delving into Freddie’s other sexual encounters.Lucy has claimed that her character’s relationship Freddie was ‘indefinable’ and the movie shows the ‘transition throughout their relationship’.Speaking to HeyUGuys, she said: ‘I think that’s the most beautiful thing about it and I keep using the word indefinable, but how indefinable it is and how modern I suppose their attitudes were towards their relationship.‘I feel like we’re now in a headspace where everyone is trying to be somewhat open-minded and they’re finally waking up to the idea that sexuality doesn’t define you and is also a very fluid thing as are humans.’She added that the movie carefully shows how their relationship developed after Mary learned the truth about his sexuality.‘I think the way Freddie and Mary handled – I mean from a third-party perspective – the kind of transition throughout their relationship was because of a foundation. A very solid foundation of love and respect that allowed them to be so open and pragmatic but I think we could learn a lot from that,’ she said.Meanwhile, Rami Malek – who gave an incredible performance as the iconic musician – previously admitted that he felt ‘terrified’ playing Freddie in the film.Miranda Sings freaks out at first glimpse of herself in Wreck It Ralph 2Will Smith is 'terrified' to follow Robin Williams' performance as Genie in AladdinAlternate Thor plotline would have wiped Peter Dinklage from Avengers: Infinity WarHe confessed: ‘Every part of me was terrified. But then, what are you going to do? It’s an opportunity of a lifetime. I couldn’t pass it up.’Despite the pressure, Rami was determined to ensure that his on-screen performance was as natural as possible.The actor actually made a conscious decision not to imitate the Queen star, who died in 1991 from bronchial pneumonia resulting from AIDS.He said: ‘I was very cognisant of not wanting to imitate him or impersonate him at all.‘I started to think about how everything he did was spontaneous, in the moment. He is someone who lived every moment as if it was his last, I feel.’If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.MORE: X Factor’s Simon Cowell to get famous neighbour as he ‘buys £15million house near Pope Francis’MORE: Strictly’s Anton Du Beke literally shouts at judges for ‘under marking’ Kate Silverton for her Rumba\n\n\n\n"}