{"id": "Emmerdale spoilers: Is Joe Tate dead or alive as Debbie makes a shocking discovery?", "paragraph": "135.6m sharesEmmerdale fans have been pondering whether Joe Tate is dead or alive ever since he was dispatched by Graham Foster off-screen – after all, if there’s no body, there’s always a chance, right? And soon Debbie Dingle hears from him – or so she thinks. After he abandoned her on their wedding day, Debbie has been determined to get answers, despite Cain’s efforts to put her off. And when she breaks down over recent events and the fact that Joe isn’t around, Charity is there to support her.But Debbie is then given a shock when a message comes through from Joe’s number simply saying sorry. Given a fresh boost to try and find answers, Debbie is certain he is out there somewhere – although fans know that Graham has Joe’s phone.MORE: Emmerdale spoilers: Another death leaves Paddy Kirk devastatedTo view this video please enable JavaScript, and consider upgrading to a web\n\t\t\t\t\t\tbrowser that\n\t\t\t\t\t\tsupports HTML5\n\t\t\t\t\t\t\tvideoGraham is riddled with guilt and Andrew Scarborough recently revealed that his alter ego would soon hit rock bottom as he struggles to deal with what he did to the man he classes as a son.But will Debbie discover that Graham is behind the text and then get to the reason why? With Cain’s involvement in Joe’s death, Debbie would be unlikely to ever forgive her dad.As Emmerdale warns of a huge divide between two Dingles before long, it sounds as if Debbie’s discoveries will keep coming – and the ramifications will be huge.Meanwhile, fans continue to pin their hopes on another major twist that might see Joe return alive and well. But only time will tell – with Ned Porteous heading to crack the US, it is seeming unlikely that Joe’s story ended well.MORE: Emmerdale spoilers: Another death leaves Paddy Kirk devastatedMORE: Emmerdale spoilers: Moira Dingle keeps a huge secret from Cain – will it destroy them?\n\n\n\n"}