{"id": "Remarkable before and after photos show teenager’s recovery from massive tumour", "paragraph": "135.6m sharesBefore and after photographs reveal how a teenager is barely recognisable after extensive facial reconstruction surgery.When Kambou Sie was 10, a tumour began to develop on his cheek – eventually engulfing his face and causing him to be rejected by his community, including his own mother.In fact, the 18-year-old from Bondoukou in the Ivory Coast was suffering from Burkitt lymphoma, a rare type of cancer.However, surgeons in Italy were able to wipe out much of the tumour following six months of treatment.Kambou, known as Prosper, said: ‘My face has changed. It’s not finished, but it’s changed. I have also changed. I am not like before. Before leaving, I couldn’t see a thing.’He added: ‘I am very happy because when I go out I don’t cry. I am happy to meet people. I go out, I have fun, I play around. I have no problems. I am very happy.’Prosper’s face was untreated for years, with locals wrongly believing he was contagious.His father was the only person not to shun him as he lived with the illness for years.To view this video please enable JavaScript, and consider upgrading to a web\n\t\t\t\t\t\tbrowser that\n\t\t\t\t\t\tsupports HTML5\n\t\t\t\t\t\t\tvideoHe was only diagnosed with cancer when he underwent tests at Naples Pascale Hospital in Italy just over a year ago.Since then, chemotherapy and radiotherapy has removed the cancer, and his face has been reconstructed.Specialist Dr Franc Ionna said: ‘There’s a flaw in the development of the facial bones. He has an alteration of the facial bone.Man shot dead by hunter who mistook him for a deerPrisoner confesses to '90 unsolved murders in 14 US states over four decades'Over 1,000 feared dead with 71 confirmed killed by California wildfires‘There’s a dissymmetry the left side is different to the right. One side has too much bone on the other is a deficit.’Prosper is recovering from the operations at home in the Ivory Coast, but will return to Italy in the future for further treatment.Body Bizarre is on Saturdays at 10pm on TLC UK.If you have a story for our news team, email us at webnews@metro.co.uk.You can also follow us on Facebook and Twitter."}