{"id": "NASA wants to probe deep into Uranus in search of smelly gas", "paragraph": "135.6m sharesScientists stunned the world this year with the revelation that Uranus actually does smell like farts – and a NASA probe could soon actually ‘breathe in’ the fumes.Amy Simon of NASA’s Ice Giants Pre-Decadal Study group told the Gravity Assist podcast the next mission to Uranus should use an atmospheric probe.Amy Simon said, ‘I think the primary thing we’d add to any mission is an atmospheric probe, because we want to understand what the layers are in the atmosphere, what the temperatures are.’Simon told New Scientist last year that the space agency hoped to launch a probe to either Uranus or Neptune in the 2030s, A Science Enthusiast reports.One of the proposed missions includes a fly-by of Uranus, which would include a narrow-angle camera – and a probe which would drop into Uranus’s atmosphere to measure gas and heavy elements.Simon said that the mission could also use an orbiter, ‘ We have also looked at orbiters, and these are nice because it gives you a chance to explore that whole system – the rings, the moons, Triton in particular – to see what’s going on on all sides of those different moons.’NASA’s Voyager 2 spacecraft flew closely past distant Uranus, the seventh planet from the Sun, in January 1986.At its closest, the spacecraft came within 81,500 kilometres (50,600 miles) of Uranus’s cloudtops on January 24, 1986.Voyager 2 radioed thousands of images and voluminous amounts of other scientific data on the planet, its moons, rings, atmosphere, interior and the magnetic environment surrounding Uranus.\n\n\n\n\n\nA map of the outer solar system (Picture: AFP/Getty)Since launch on August 20, 1977, Voyager 2’s itinerary has taken the spacecraft to Jupiter in July 1979, Saturn in August 1981, and then Uranus. Voyager 2’s next encounter was with Neptune in August 1989. Both Voyager 2 and its twin, Voyager 1, will eventually leave our solar system and enter interstellar space.MORE: Sorry, you’ve probably been saying the word Uranus wrong your whole lifeVoyager 2’s images of the five largest moons around Uranus revealed complex surfaces indicative of varying geologic pasts. The cameras also detected 10 previously unseen moons.\n\n\n\n\n\nThe 11 rings of Uranus, opaque and a few kilometres wide each, are relatively young in space terms – not more than 600 million years old. They were probably formed by collisional fragmentation of several moons that once orbited the planet (Picture: BSIP/UIG Via Getty)Several instruments studied the ring system, uncovering the fine detail of the previously known rings and two newly detected rings.Voyager data showed that the planet’s rate of rotation is 17 hours, 14 minutes.The spacecraft also found a Uranian magnetic field that is both large and unusual. In addition, the temperature of the equatorial region, which receives less sunlight over a Uranian year, is nevertheless about the same as that at the poles.\n"}