{"id": "Coronation Street star Jennie McAlpine gives birth to a baby girl", "paragraph": "135.6m sharesCoronation Street star Jennie McAlpine has announced that she has given birth to a baby girl named Hilda. The actress, who recently left the show to go on maternity leave, revealed the news via Twitter, telling her followers that she, her husband Chris Farr and their three-year-old son Albert are all in love. The couple have named their newborn Hilda and fans have been sending love and well wishes to the family, who welcomed their new addition yesterday.Jennie plays Fiz in the soap and filmed her last scenes a few weeks ago but she will remain on screen until December when a storyline will see her feud with Evelyn Plummer drive her out of the Street.MORE: Coronation Street spoilers: New pictures reveal Christmas scenes including trouble for David and ShonaOur newest addition arrived yesterday. Mummy and Daddy very happy. Big brother very proud of his little sister Hilda. We’re all in love ❤️— Jennie McAlpine (@jenniemcalpine) October 30, 2018Fiz is struggling to deal with Evelyn’s presence in the house and over coming weeks, tension will increase between them as Evelyn’s unreasonable behaviour tests Fiz’s patience and makes her encourage Tyrone to find his nan somewhere else to live.But wily Evelyn will deliberately come between the couple, pushing them to the limit – and it has already been confirmed by Maureen Lipman that she will be the catalyst for Fiz packing her bags. So will Tyrone and Fiz hit the rocks – and what does mean for the kids?The departure is temporary to facilitate Jennie’s maternity leave from the show and she is expected to return sometime next year. Alan Halsall has remained filming. Having recently signed a new contract to remain on the cobbles, he was recently spotted working on scenes for the Christmas nativity.Jennie took part in last year’s I’m A Celebrity Get Me Out Of Here! and admitted that missing her husband and her son Albert were the hardest aspects.Jennie added in her Twitter message that she and Chris are ‘very happy’ after meeting Hilda – huge congratulations to them both.MORE: Coronation Street spoilers: Paddy Wallace confirms final exit for Jude AppletonMORE: Coronation Street spoilers: Bhavna Limbachia reveals what Kate and Rana’s wedding will be like – after crying over proposal"}