{"id": "John Bluthal, who played Frank in The Vicar of Dibley, dies aged 89", "paragraph": "135.6m sharesJohn Bluthal, best known for his role of Frank Pickle in The Vicar of Dibley, has died at the age of 89.The actor, born in August 1929, passed away on Thursday evening, it’s been confirmed.His agent wrote in a statement: ‘We’re sad to announce our wonderful client John Bluthal has passed away. Our thoughts are with his family at this time.‘John provided us all with years of laughter and entertainment. We will miss John hugely.’John will be remembered by most as the lovably hapless Frank Pickle on The Vicar of Dibley, who struggled with endlessly long and boring stories.In one touching scene, he came out as gay on the radio, only for no one but Geraldine to hear it because they all thought he would drone on too much.The actor has lived a long and colourful life. Born in Poland, he fled with his Jewish family to Australia to escape the Nazi regime in 1938.He moved to England permanently in 1956.John’s career covered both stage and screen, and he’s starred in a series of iconic movies and films, with his first major role being in the 1960s Sid James series, Citizen James.His big screen appearances include The Beatles’ films A Hard Day’s Night, and Help!; Labyrinth and The Fifth Element.We’re sad to announce our wonderful client John Bluthal has passed away. Our thoughts are with his family at this time. John provided us all with years of laughter and entertainment. We will miss John hugely.— Artists Partnership (@TheAPartnership) November 15, 2018Other roles include parts in Jonathan Creek, ‘Allo Allo, Casualty, Last of the Summer Wine and One Foot in the Grave – all landmark shows in British television history.John’s last professional engagement was in the Coen Brothers’ movie, Hail! Caesar, alongside Channing Tatum.His final appearance on screen was a short film written and directed by his daughter Lisa titled By Any Other Means – a comedy about a daughter dealing with her father’s Alzheimer’s.John’s cause of death is unknown. \n\n\n\n\t\t\t\tGot a showbiz story?\t\t\t\n\nIf you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\n\nIf you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\n\n\n"}