{"id": "Avril Lavigne spent ‘two f**king years in bed’ during Lyme Disease battle that made her feel close to death", "paragraph": "135.6m sharesAvril Lavigne had accepted she was dying from Lyme Disease while that imposter conspiracy kept going around the internet to explain her absence.The Complicated popstar says she ‘spent two fucking years in bed’ during her battle with Lyme and could barely keep her head above water.Now, in preparation for a big musical comeback – the one she’s been promising for some time – the musician spoke to Billboard about her arduous recovery.‘I was in bed for fucking two years,’ she told the magazine.Avril had started to feel ‘achy, fatigued and could not get the fuck out of bed’ during her 2014 tour and was diagnosed with Lyme Disease after speaking to a specialist.She began a course of antibiotics and antimalarials to kill the bug (spirochete) but it had morphed into a cystic form.‘It went undiagnosed for so long that I was kind of fucked,’ the popstar added.Avril tried to make a comeback in 2015 but admits she wasn’t ready.‘I put on a brave face because I didn’t want it to be a part of my identity. So the second I was up, I would take a picture and post it on Instagram and act like my life was fucking great.’While she was away from the spotlight, a theory that Avril had been replaced by an imposter named Melissa gained traction online in a bid to explain her absence from the limelight.But the musician is back with new music for 2019 and attended her first red carpet in two years this April.Jade Thirlwall on how pregnancy rumours inspired the new Little Mix anthemJesy Nelson on the #MeToo movement: 'Little Mix are too intimidating to be harassed'Cheryl will quit pop if her music flops for the sake of son BearLast month, Avril wrote an emotional letter to her fans in which she admitted that she had already come to terms with dying from the disease.The 33-year-old hasn’t released an album in over five years, but has now announced her upcoming single Head Above Water, while talking about the meaning behind the tune.She said: ‘I spent the last few years at home sick fighting Lyme Disease. Those were the worst years of my life as I went through both physical and emotional battles. I was able to turn that fight into music I’m really proud of.’‘I wrote songs in my bed and on the couch and recorded there mostly as well. Words and lyrics that were so true to my experience came pouring out of me effortlessly. Truly… by keeping my spirits up, having goals to reach and a purpose to live for, my music helped to heal me and keep me alive.’MORE: Sam Claflin joins the cast of Peaky Blinders Series 5 along with Brian Gleeson, Emmett Scanlan and moreMORE: Joe Alwyn isn’t concerned about the weight of expectation on being Mr Taylor Swift \n\n\n\n\t\t\t\tGot a showbiz story?\t\t\t\n\nIf you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\n\nIf you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\n\n\n"}