{"id": "Parents create bucket list for two-year-old daughter whose brain tumour means she has months left to live", "paragraph": "135.6m sharesAt two years old, Kalani has just a few months to live.Her parents want to give her best of her short life possible. They’ve created a bucket list of all the things they hope will bring their daughter some joy, and are now working their way through ticking off each one.Her parents were told Kalani’s condition was incurable following the relapse of a rare brain tumour.In August 2016 mum-of-three Charlene Ebbs gave birth to her third child, Kalani. In December of that year, when Kalani was four months old, Charlene and husband Justin noticed that their daughter struggled to control the movement of her neck and head.Kalani started to show other worrying symptoms – she would scream for hours on end and throw up, her vomiting becoming so serious that she was admitted to a hospital’s emergency room.It was in March 2017 that doctors discovered that Kalani had an atypical teratoid rhabdoid tumour, a rare brain tumour usually found in children. The tumour was blocking her cerebral spinal fluid from draining, causing a deadly build up of pressure on her brain.The little girl had to undergo multiple surgeries, a 51-week course of chemotherapy, and 27 fractions of radiotherapy.‘From the moment Kalani was born and I held her in our arms I made a promise to always protect her and keep her from any harm,’ said Kalani’s mum, Charlene.‘Kalani entered this world as an innocent, fragile, precious, perfect little baby and at only six-months-old we were told our baby had brain cancer, could die and there was absolutely nothing I could do stop it.‘We had no time to process the diagnosis, no time to breathe and I felt like my heart had been ripped out my chest and life was crushing it.‘We announced Kalani’s diagnosis about ten days post-surgery to inform our wider community, friends and family. It was just too hard and too painful to explain to everyone individually.’Kalani’s treatment finished in May, and her parents were told that she was in remission. They rang the end of treatment bell.Three months later, a routine MRI revealed a spot on Kalani’s brain stem. Five weeks after that a scan confirmed that her tumours had grown aggressively. She has now been declared incurable and has only a few months left to live.Charlene and Justin are staying strong. They’ve dedicated themselves to making the best of Kalani’s short life, creating a bucket list of things their daughter can do when she’s released from hospital.The bucket list includes trips to zoos and theme parks, photoshoots, movie nights, and making family hand prints.The family will be adopting a puppy for Christmas after being granted the wish by a foundation.Her parents refuse to let Kalani pass away in hospital, having spent so much of her life there, so have moved her to Bear Cottage in Sydney, a resort-style facility with nurses on site to attend to her needs.They will tell Kalani how much they love her every single day.‘We now only have a matter of a few months left with her and only one shot at a clinical trial to at least stabilise further growth of the cancer,’ said Charlene.‘If the clinical trial does not work now Kalani’s relapse may be too far advanced to stabilise with another trial. Within ten years only one cure has been uncovered for ATRT.‘Kalani will not last another ten years for another cure to become discovered. Right now, we are completely torn between two worlds’ hope of stabilisation, making palliative care arrangements and making memories.‘We have to now live day by day and it feels like we are constantly playing Russian Roulette; trying to find a cure for Kalani with every missed bullet only bringing her closer to death.‘We have received 10,000 dollars in travel vouchers from i98 Convoy which is going to be used on a holiday to the theme parks in Queensland like; Sea World, Movie World, Dream World.‘As much as Kalani loves rides she also loves animals, so we will travel to Dubbo Zoo and stay a few nights on location inside the Zoo.Going to the gym should never be about guiltWhole Foods shares the healthy food trends we'll all be fans of in 2019Having to admit that I can't cope with my daughter's cancer is the hardest thing I've done‘We have also been granted a wish from one of the foundations for a puppy for Christmas. Kalani loves puppies and we believe this is the connection her older siblings will have with her if she passes.‘The puppy is being organised through the hospital’s Star Light foundation. The children believe Santa is delivering them a puppy personally, so they will receive this over this upcoming Christmas.‘Always fight for what is right for your child. We must trust our medical professionals but ultimately parents know their child best.‘Question anything and everything you feel may not be right about your child’s treatment. If you think there is something wrong with your child demand answers and don’t take no for an answer as sometimes it may be too late.’MORE: Tributes paid to brave nurse who has died after crowdfunding cancer treatmentMORE: Fertility Month: Why we are talking about fertility this monthMORE: I found the perfect sperm donor – but I never got my happy ending"}