{"id": "EastEnders spoilers: Shirley Carter returns and takes her revenge on Linda and Stuart", "paragraph": "135.6m sharesOooh, it’s all about to kick off at the Queen Vic. Forget Phil Mitchell, the EastEnders badass with a terrifying glare and seriously scary temper that we have been missing most is the one and only Shirley Carter. But she’s back – and she means business. Shirley is aware that Linda has turned her back on her jailed husband Mick, who stands accused of shooting evil Stuart Highway. Stuart set him up for the whole thing but Linda seemingly doesn’t believe him and in Shirley’s absence, she has been meeting with Stuart, sacked Ritchie as Mick’s lawyer and even kicked Tina out!Well, Shirl is having none of it and she wages war on Linda when she returns to the Vic. Discovering that Stuart is making himself comfortable, Shirley has it out with Linda and when it’s clear that Linda’s mind isn’t for changing, Shirley takes drastic action.MORE: 25 soap spoilers: Shocking EastEnders violence, Emmerdale Joe Tate discovery, Coronation Street revenge, Hollyoaks hostage horrorCreating a very public scene, she lets rip at both Linda and Stuart, ordering them out of the pub – before she then launches Linda’s clothes and belongings over the bar. Linda points out that it’s her pub too but Shirley isn’t for arguing with and Stuart and Linda are forced out.However, don’t expect that to be the end of the matter – determined to fight fire with fire, Linda will strike back and take action that will make things even messier. Is this truly the end of the Carter family as they are ripped apart from within? And is Stuart’s wicked plan to devastate the clan paying off exactly as he had hoped?Some viewers reckon that Linda is playing the long game and trying to fool Stuart into tripping himself up but taking on Shirley as part of the process is a very risky business!Pictures from location filming recently showed a violent showdown between Mick and Stuart so it’s clear Mick will return from prison in time for some explosive Christmas scenes. But will he be heading straight back inside after killing Stuart?And can he and Linda ever repair their marriage?EastEnders airs Shirley and Linda’s bout on Tuesday 20th November at 7:30pm on BBC One.MORE: 25 soap spoilers: Shocking EastEnders violence, Emmerdale Joe Tate discovery, Coronation Street revenge, Hollyoaks hostage horrorMORE: EastEnders spoilers: Keegan Baker to turn to drugs after stabbing ordeal?\n\n\n\n"}