{"id": "Britain’s biggest family gets even larger as the Radfords welcome child number 21", "paragraph": "135.6m sharesBritain’s biggest family has just got even bigger after welcoming their 21st child.Sue Radford recently gave birth to little Bonnie Raye after a 12 minute labour.Her and husband Noel are adamant they will have no more children, although they admit that is something they have said before.Sue, 43, told the Sun: ‘We’ve both decided we don’t want any more. Bonnie has completed our family.’Noel, 46, added: ‘Some people decide to stop after two or three kids. We’ve made it after 21.’Bonnie, who was born weighing 8lb 4oz on Tuesday, is already settling in well to life at their 10-bed house in Morecambe, Lancashire.Their other children are thrilled to have another sister, who is three decades younger than oldest sibling Chris, now 29.Sue continued: ‘They were all fighting over the first cuddle. It’s such a lovely moment when you bring a newborn home and the others are all lined up ready to hold her.’The couple support themselves with their bakery and only claim child credit. Many of the children also help out in the bakery and the early starts mean that Noel can be home to help with the school run – in their own bus.Noel had a vasectomy after baby number nine but it was later reversed. The couple have told friends and family they are done, although they also made that vow after Archie, now 14 months, was born.Sue has spent over 800 weeks pregnant and said: ‘It has to come to an end at some point.‘The maternity clothes will be going in the bin shortly. I won’t miss being pregnant at all.‘All the midwives at the hospital were asking if they would see us again next year and we both said, “definitely not.”‘We’re just going to keep enjoying the children and enjoy our grandchildren.’The couple met when Sue was seven and had their first baby when she was just 14.They were determined to keep him having both been given up for adoption at birth.Their second child, Sophie, was born when Sue was 17, shortly after they married.The line-up of children at present is Chris, Sophie, Chloe, Jack, Daniel, Luke, Millie, Katie, James, Ellie, Aimee, Josh, Max, Tillie, Oscar, Caspar, Hallie, Phoebe and Archie. They had a stillborn baby boy in 2014.They are also grandparents through Sophie, 24, who has three children of her own.Despite their claim to have finished their family, some of Bonnie’s siblings are already doubtful.Sophie said: ‘They won’t stop on an odd number.’The Radford family get through an astonishing 18 pints of milk, four toilet rolls and three boxes of cereal a day.They also need to do nine loads of washing and it takes three hours in the evening to get them all bathed.If you have a story for our news team, email us at webnews@metro.co.uk.You can also follow us on Facebook and Twitter."}