{"id": "Sebastian Stan issues major Avengers 4 spoiler as he confirms return of dusted heroes", "paragraph": "135.6m sharesMarvel fans know that Tom Holland and Mark Holland can’t be trusted when it comes to spoilers – so we obviously love every interview they do.But it turns out Sebastian Stan may have been the cast member to spill the biggest possible Avengers 4 spoiler.An interview with the Bucky Barnes actor from earlier this year has resurfaced, in which he appears to confirm a whole lot of dusted characters will come back from the dead in Avengers 4.At the end of Infinity War, Thanos’s snap wiped out half the universe, including Bucky/Winter Soldier and Nick Fury (Samuel L Jackson), while in Ant-Man and The Wasp, we learned that Hank Pym and Janet (Michael Douglas and Michelle Pfeiffer) were also turned to dust.But according to Sebastian, all of these characters are going to be in Avengers 4.Speaking at Ace Comic-Con in April, the 36-year-old said: ‘There was one scene, I think, we had where everybody was there. I can’t really talk about that scene, but I knew it took them three months in planning this scene to have everyone there.‘You look around and you just saw everyone from Samuel L. Jackson to Michael Douglas to Michelle Pfeiffer. Everybody was there.’Hmmm… why would they all be filming a scene together if they weren’t resurrected?Sebastian later played down the spoileriffic content, telling Entertainment Tonight: ‘I don’t think I revealed anything crazy. Everyone’s going to be in this movie.‘Nobody crazy, that I mentioned, would not be in this film. Michael Douglas could come in and pour a tea for one scene, for all you know.’Of course, that was before we knew Pym had perished in the Thanos snap.Stan Lee laid to rest in private funeral as public tribute confirmed to be in the worksMarvel fans reckon Avengers 4 trailer is imminent after comic prelude gets release dateAvengers 4 trailer to premiere after Ralph Breaks The Internet hits cinemas?This adds more weight to the theory that the Thanos snap will be reversed with a bit of help from the Quantum Realm.Michael Douglas confirmed that this would be ‘the key’ to Avengers 4, saying: ‘The Quantum Realm plays an important part in all the next chapters, I think, of the Marvel films.’And it has been rumoured a scene in Thor: The Dark World, where the Soul Forge is discussed, could spell out how our heroes are brought back to life.If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.MORE: The trailer for Will Smith’s Spies In Disguise contains the greatest plot twist in movie historyMORE: Why MCM Comic Con is always worth going to – Reader’s Feature\n\n\n\n"}