{"id": "Meet the woman dedicated to making activewear for women of all sizes", "paragraph": "135.6m sharesStaying fit should be for everyone. Women of all sizes work out, play sport and stay active. You don’t have to be a size 8 Instagram model to hit the gym, but it seems a lot of fitness retailers haven’t got that memo.If you’re a size 16 or bigger, it can be damn near impossible to find supportive, comfortable activewear. Sweaty Betty’s largest size is an XL – which translates to a size 16. Lululemon pushes to a size 18, but not for every product.Nike and ASOS both have a plus-size range, reaching a size 32, and a size 30 respectively. But not enough brands have a plus-size range, and when so many people fall into this category – surely they shouldn’t have to have a separate range at all.We’re in the middle of a body-positivity revolution – so why are so many big brands still clinging on to archaic ideals about the female form? 45% of women in the UK are a size 16 or bigger – what message does it send to women if fitness brands are only catering for the smaller half of the population?Asics just released a new ad campaign featuring tiny Elite models – it sparked a conversation around the potentially damaging effects of this kind of imagery. Many women felt that by only using women who are no bigger than a size 6 as the face of a fitness brand, they were showing something that is dangerously unattainable.One woman battling to change the perception of active women is Lucy Arnold. She owns Lucy Locket Loves – an inclusive fitness brand dedicated to providing a larger range of sizes.Lucy has just launched an ad campaign featuring women of all sizes, as an alternative to Asics’.‘This year has been the year of a the woman, with campaigns including Time’s Up and #MeToo. But still, we are faced with unrealistic images and poor representation within marketing and advertising,’ Lucy tells Metro.co.uk.‘The new Asics campaign is part of this problem. Fitness is a real issue for many women, especially those who struggle to get fit, and having these “perfect” images thrust in our faces does a lot more harm than good.’Lucy thinks brands have created an intrinsic disconnect with their core customers – and they aren’t listening to what women actually want.‘So many of my customers tell me how hard it is to get activewear that fits properly when you are a size 16 and above, that it’s almost impossible. We live in a society that is constantly telling us that we need to be unhappy with our bodies – we need to be skinnier, but still have curves – it’s ridiculous.‘If we want people to learn to love themselves and create a love of exercise, they need to feel comfortable whilst exercising. They need to know that they can do a workout and feel great and have kit that fits properly. We want to help everybody, whatever the journey they are on and wherever they are.’Lucy is convinced that the way to help women boost their confidence is through accessibility and inclusivity – they need to see themselves reflected int eh images around them.‘We can build confidence by taking away this imperfect ideal we see in the media every single day. I’m a size 14 personal trainer and owner of a fitness brand, people tell me how much I have helped empower and support them through social media. How it made them realise they are perfectly normal and they should stop trying to be who the media tells them to be and learn to love themselves.‘Alone we are one drop but together we are an ocean. What we want to do is showcase every single size and represent the nation as a whole, not just a tiny part of it. If people thought it was normal to be different shapes and sizes, they would feel so much more confident about doing exercise and this is what I want to do.’The Asics advert sparked a furious response online as both men and women expressed their anger at the collaboration. Lucy thinks people are simply tired of outdated campaigns designed to make women feel bad about themselves.‘These adverts aren’t empowering,’ Lucy explains.‘They are not promoting that exercise is for everybody. They are not showcasing the size 18 lady who just completed a marathon. Or the size 8 and size 14 mum and daughter attending a class together. They aren’t showcasing what actually happens in gyms and running clubs around the world, and they are not encouraging anybody to start exercising.‘All they’re actually doing is leaving out so many of their own customers in their own campaigns – which is nonsensical.’Women face huge, systemic barriers to staying fit – the burden of childcare and taking on the bulk of domestic duties is one barrier, but another is fear of judgment and societal pressures to look a certain way.Inclusivity is key if we want to create a culture of genuine body positivity and acceptance. If a woman can walk into a shop and find a pair of gym leggings that fit her, support her and make her feel good – it could be the first step in changing attitudes and re-establishing body norms.MORE: Asics using Elite models in their latest campaign is a monumental step back for women’s sportsMORE: Staying fit could help you find loveMORE: It’s never too late to start running – I just ran my first half marathon at 65"}