{"id": "Donald Trump cancels visit to WW1 military cemetery because it’s raining", "paragraph": "135.6m sharesDonald Trump has cancelled a trip to a US military cemetery in France, claiming the weather is too bad.The US President called off his visit to the Belleau Wood battlefield and cemetery east of Paris because of ‘scheduling and logistical difficulties caused by the weather,’ the White House said.He is now free to relax in the French capital this afternoon and has instead dispatched another member of his team to pay tribute.Insiders within the French government claim the excuse doesn’t wash and he could have easily made the trip.Trump is in France to mark the 100th anniversary of the end of the First World War. Coincidentally, officials in November 1918 noted the Armistice came on a day where there was ‘chilled drizzle – the usual.’His visit got off to a rocky start when he offended his French counterpart Emmanuel Macron.The US leader had taken to Twitter moments after getting off the plane in the French capital to say Macron’s plan for a European military was ‘insulting.’The pair then came face to face and there was no hiding the awkward coolness in their meeting.Macron seemed eager to keep up a show of camaraderie, and when asked about the tweet, he reached out to pat Trump on the thigh. Trump was cordial – but sat stony-faced during the thigh tap.This was at odds with previous engagements between the two men, which have been much warmer. Indeed Macron has made much of the fact he is one European leader who has a good relationship with Trump.To view this video please enable JavaScript, and consider upgrading to a web\n\t\t\t\t\t\tbrowser that\n\t\t\t\t\t\tsupports HTML5\n\t\t\t\t\t\t\tvideoAfter his meeting with Macron, Trump and wife Melania were scheduled to head to the battlefield of Belleau Wood, 55 miles northeast of Paris.It was here that US troops had their breakthrough battle by stopping a German push for Paris shortly after entering the war in 1917.The battle of Belleau Wood proved America’s mettle to allies and foes alike, and by the time the war ended U.S. forces were at least an equal to any of the other major armies, which were exhausted and depleted.The Aisne-Marne American Cemetery at Belleau contains the graves of 2,289 servicemen and commemorates 1,060 others who fell at Bealleau Wood.However the Trumps’ trip was abandoned with the White House announcing that a US delegation led by Chief of Staff General John Kelly and Chairman of the Joint Chiefs of Staff General Joe Dunford would visit the cemetery instead.Officially, the helicopter – Marine I – was considered ill-equipped to make the short journey because of the clouds and drizzle.This has meant that instead, the Trumps have had some down time in Paris.Elysee Palace sources in France confirmed that the Trumps had been due to travel on Marine 1 after arriving by plane in the French capital on Friday night.One insider said that the idea that Marine 1 could not fly in wet weather was ‘preposterous’.He said: ‘The Trumps could easily have got to Beaulleau by road too – with a limousine escort it would take less than an hour.’Trump has been criticised before for failing to visit US troops in Afghanistan. It was also noted that his snub came as he was wishing the Marine Corps a happy 243rd birthday on Twitter.While Trump and Macron were in Paris, Canadian Prime Minister Justin Trudeau went to Vimy Ridge, the battlefield in northern France where Canada found its sense of self when it defeated German opposition against the odds.Standing amid the white headstones against an ashen sky, Trudeau addressed the fallen, saying what Canada has achieved in the past century has been ‘a history built on your sacrifice. You stand for the values on which Canada was built.’Trump and Trudeau will join other world leaders for dinner at the Musee d’Orsay art museum on Saturday evening.Trump is then set to visit another American cemetery that holds war dead, at Suresnes, in the Paris suburbs, on Sunday morning.Some 70 leaders will then gather at 11am local time on Sunday at the tomb of the Unknown Soldier at the Arc de Triomphe, in Paris, to mark the 100th anniversary of the end of the First World War.While Trump’s visit is diplomatic the tone he struck with Macron appears to suggest he is also on a personal mission.The nationalist and protectionist Trump has increasingly clashed with European allies over his America-first policies.And there are continuing arguments over the funding of Nato.Ahead of Trump’s visit, Macron had warned that Europeans can no longer rely on the US to defend themselves.He told French radio station Europe 1: ‘We have to protect ourselves with respect to China, Russia and even the United States of America.‘Who is the main victim? Europe and it’s security. I want to build a real security dialogue with Russia, which is a country I respect, a European country – but we must have a Europe that can defend itself on its own without relying only on the US.’Trump then took to Twitter, writing: ‘President Macron of France has just suggested that Europe build its own military in order to protect itself from the US, China and Russia.‘Very insulting, but perhaps Europe should first pay its fair share of Nato, which the US subsidizes greatly!’His use of Twitter also got Trump into trouble with the French organisers of the event. He tweeted: ‘ Is there anything better to celebrate than the end of a war, in particular that one, which was one of the bloodiest and worst of all time?’They pointed out that there would be no ‘celebrations’ only ‘commemorations’.I am in Paris getting ready to celebrate the end of World War One. Is there anything better to celebrate than the end of a war, in particular that one, which was one of the bloodiest and worst of all time?— Donald J. Trump (@realDonaldTrump) November 10, 2018Trump’s trip comes just days after congressional elections delivered results that will complicate his next two years.While Republicans slightly expanded their majority in the US Senate, they lost control of the US House of Representatives to Democrats who may use their newfound power to launch investigations into Trump and stymie his agenda.If you have a story for our news team, email us at webnews@metro.co.uk.You can also follow us on Facebook and Twitter."}