{"id": "Leicester City owner’s helicopter crashes outside King Power Stadium after game", "paragraph": "135.6m sharesThe helicopter of Leicester City owner Vichai Srivaddhanaprabha has crashed outside the King Power Stadium following the club’s Premier League game against West Ham.Witnesses say the helicopter took off as normal from the stadium and was hovering over the south east corner of the ground when it spiralled to the ground and burst into flames.Mr Srivaddhanaprabha was reportedly in the eight-seater helicopter on the way to London when it crashed in the club’s car park.Spoken to King Power, who will release a statement tomorrow. #LCFC owner Vichai Srivaddhanaprabha was on-board the eight-seater helicopter to London. Failure, upon take off, resulted in a fire prior to a crash in the car park. No news on casualties. Prayers with #LCFC family— Ben Jacobs (@JacobsBen) October 27, 2018Mr Srivaddhanaprabha often gets picked up by his helicopter on the pitch at the King Power after every Leicester home game.Tim Acott, a Leicester City season ticket holder, told MailOnline: ‘It just came out of the stadium already spinning then down to the ground.‘Just in a spiral. It hit the ground with a big bang then burst into flames. It’s over on the other side of the car park, I don’t think there were people there. I’m shaking like anything.’To view this video please enable JavaScript, and consider upgrading to a web\n\t\t\t\t\t\tbrowser that\n\t\t\t\t\t\tsupports HTML5\n\t\t\t\t\t\t\tvideoTheres a major incident by the King Power Stadium. Emergency services attending. pic.twitter.com/GtAbo6AHpD— Mr Geoff Peters (@mrgeoffpeters) October 27, 2018The stadium was evacuated and the area was closed off while emergency services investigated.Leicester police said in a statement: ‘We are dealing with an incident in the vicinity of the King Power Stadium. Emergency services are aware and dealing.’A Leicester City spokesman said: ‘We are assisting Leicestershire Police and the Emergency Services in dealing with a major incident at King Power Stadium.‘The Club will issue a more detailed statement once further information has been established.’Mr Srivaddhanaprabha purchased Leicester in August 2010 and was named chairman in February 2011.If you have a story for our news team, email us at webnews@metro.co.uk.You can also follow us on Facebook and Twitter."}