{"id": "Parents of albino black twins are sick of people asking if the kids are really theirs", "paragraph": "135.6m sharesAlbinism is the condition where people or animals are born without pigmentation in their skin and hair. This usually results in having pale hair, eyes, and skin.For people of colour it can mean being visibly different to the rest of their families which can be a difficult experience to navigate.Nolan and Savannah Lewis are two-year-old black twins born with the condition who clearly look different from their parents.That has meant mum Christin and dad Russell have been subject to a torrent of hurtful comments ranging from whether the twins are really theirs, if they used a surrogate, and the most offensive – whether Christin had an affair.Christin, 37, a travel agent from New Jersey, USA, said: ‘People think that I cheated on my husband to have white babies.‘An agent who was interested in the twins modelling said to my husband: “Did you have the babies with a white woman?”‘‘I want to make a public service announcement: we are faithful, we did not cheat on each other and we did not use surrogates.‘I carried these babies for nine months.’As a result of their albinism – which affects only one in 18,000 Americans and is even rarer in twins – Nolan and Savannah both have rapid eye movement and are sensitive to sunlight.Christin covers the twins with sunblock every time they leave the house as well as ensuring they wear sunglasses whenever they go outside.The hurtful comments are made by well-intentioned people as well as ‘rude strangers’, Christin says, which has left the parents wanting to homeschool the youngsters.‘We probably won’t put them in the system with regular children,’ she said.‘We think that they are very sensitive and people do stare at them on the street.‘We want to shield them from that and let them know they are beautiful and can do anything they set their minds to.’Though the parents are used to the unwanted attention, Nolan and Savannah are completely unaware.The couple is determined their children will love themselves just as they are.Dad Russell added: ‘In the beginning, I felt afraid for them and I worried that they would be bullied.‘But even though they are just two years old, I have developed a tough skin already.‘People look at them and they can’t believe they are black kids with white skin. But I shrug my shoulders.‘I think they are beautiful and I wouldn’t change them in any way. I want them to embrace their differences, not shy away from them.’MORE: Falling pregnant after the death of my son saved me from grief. His sister was the light in the darknessMORE: Apparently these are the names we’ll be giving our babies in 2028MORE: What happens if you’re disappointed about your baby’s gender?"}