{"id": "Why Eden Hazard is the biggest threat to Jose Mourinho’s Manchester United reign", "paragraph": "‘I sent him a message to say I was sorry he had gone and that I was sorry. We’d enjoyed all that success together, but this time we hadn’t. I felt a little bit guilty because I’d been player of the year. I’d been one of the most decisive players, and then I performed less.’Apologetic though he may have been, Eden Hazard was as relieved as any member of Chelsea’s title-winning squad that Jose Mourinho had been sacked during his second stint at Stamford Bridge.For all the problems that Mourinho found and indeed created for himself during the 2015-16 campaign, no issue has had such a prolonged effect on Mourinho’s career as the disintegration of his relationship with Hazard.The Belgian reluctantly adapted to Mourinho’s philosophy the previous season and was crowned PFA Player of the Year as Chelsea won their first title in five years. Within six months Mourinho was gone, sacked from Chelsea for a second time with the Blues hovering above the relegation zone.Quite how Mourinho allowed a title-winning team to drop off so quickly still haunts him and that sacking opened wounds that he is still attempting to heal. For the first time in his career Mourinho had genuinely failed.ShareMourinho had once been the modern manager able to deal with the egos of the dressing room. He’d convinced the likes of Samuel Eto’o to play out of position for the greater good of the team during his time at Inter Milan but Hazard got what he wanted when Mourinho was sacked. The dressing room had beaten the manager and Mourinho’s issues at Old Trafford indicate he is yet to come to terms with modern landscape of power.The sacking shattered an image of Mourinho that he had built up for nearly 15 years and the ‘Special One’ returns to Stamford Bridge on Saturday fighting for his Manchester United job.Ed Woodward blocking Jose Mourinho from reuniting with transfer guru who signed MbappeMan Utd star open to joining Premier League rivals if talks fall throughManchester United dealt fresh injury blow as Romelu Lukaku withdraws from Belgium squadJose Mourinho wants Man Utd to agree bargain transfer deal for Premier League starThe Red Devils are entering a crucial and difficult period where they’ll face the likes of Juventus and Manchester City, but stopping Hazard could prove their toughest test over the next six weeks.A late comeback against Newcastle showed the United squad – at the very least – are still fighting for Mourinho but his ability to counter Hazard at Stamford Bridge will be a litmus test of his tactics. Mourinho was so often a ‘big game specialist’ before his move to Old Trafford but new ideas have been thin on the ground at the Theatre of Dreams.One of Mourinho’s biggest victories at the club was the 2-0 win against Chelsea in the 2016-17 campaign. The Blues were en route to the Premier League title under Antonio Conte, something Mourinho found difficult to swallow given the pursuit was being led by so many players that had downed tools under him the previous season, primarily Hazard.Hazard was reinvigorated under the Italian but he was nullified that day as Ander Herrera man-marked him out of the game. The Spaniard was instructed to stay as close as possible to Hazard from the first minute with Mourinho convinced that Herrera’s sheer presence alone would be enough to put him off his natural game.The move caught Chelsea – and Hazard – cold.Zlatan Ibrahimovic was dropped to the bench in favour of the legs of Marcus Rashford and Jesse Lingard up front, while United played in an unorthodox 3-5-2 system to match Chelsea’s rampaging wing-backs.It was the type of tactical masterclass that we’d come to expect from Mourinho in the earlier parts of his career but they’ve been increasingly infrequent during his second stint in England.How Mourinho could do with producing another masterclass on Hazard this Saturday. The Belgian’s in the form of his life at Stamford Bridge and already has more goals this season [eight] then he managed throughout the entirety of the 15/16 campaign [six].Metro.co.uk understands Mourinho is contemplating playing a back three at Stamford Bridge and is unlikely to man-mark Hazard, despite his blistering start to the season. Instead the Red Devils will look to stop the supply line to Hazard by suffocating the space that Jorginho and Mateo Kovacic operate in in midfield.United chiefs maintain Mourinho’s future is not in ‘immediate’ danger but his selling point has long been his big game prowess. What value is Mourinho if he can no longer offer that?That’s why Saturday matters to Mourinho. It’s a chance for him to show he’s still relevant among Europe’s elite managers, that he is not yesterday’s man.Mourinho’s by and large failed to settle on a system at Old Trafford and wins against the top six have been more to do with individual inspiration than tactical innovation.It’s no exaggeration to suggest Mourinho could be sacked after a poor result this weekend. A failure to combat Hazard could see table-topping Chelsea run amok over United like they did in a 4-0 thrashing during Mourinho’s first season at the Theatre of Dreams.The difference now is that Mourinho is running out of credit. Like at Chelsea in 2015, it’s Hazard that poses the biggest threat to Mourinho, even if he’s now playing for the other team.MORE: Jack Wilshere urges Unai Emery to keep Aaron Ramsey at Arsenal\n\n\n\n"}