{"id": "Kerry Katona defends airport drinking on Good Morning Britain and urges government not to ‘ruin the fun’", "paragraph": "135.6m sharesSorry, this video isn't available any more.Kerry Katona had a lot to say about the potential ban on airport drinking on today’s Good Morning Britain.The 38-year-old Atomic Kitten singer joined Richard Madeley and Kate Garraway in the ITV studio to defend pre-holiday boozing just one day after the government unveiled plans to stop airport drinking before 10am.She began: ‘I don’t think anyone really should be drinking before 10 in the morning, I think you’d have serious issues if you did.‘But I think when you go to the airport, that’s when your holiday starts and I think it’s down to the ground staff and the bartenders not to serve anyone is drunk. It’s already the law not to serve people who are already drunk, just enforce that.‘Don’t ruin the fun for everyone else.’Richard, 62, then played devil’s advocate, saying: ‘Very often there’s a gap before the last drink at the bar and getting to the plane, and that last drink tipping you over. By the time you get to the plane it’s kicking in.’Kerry added: ‘It takes 20 minutes to get from the bar to the gate anyway, I think it’s down to ground staff. What are they doing anyway? They need to do something.’It wasn’t just the Whole Again songstress who weighed in on the debate though, as GMB fans at home also got involved on Twitter.One person suggested: ‘Instead of restricting times, limit the amount they can serve people. Only serve two pints per person. Easy to monitor, cause I enjoy a drink before I fly at whatever time it is.’‘Issue two tickets with boarding pass name on them and you have to show your passport with it like you do when buying in duty free you need ya boarding pass,’ another agreed.A third slammed: ‘ I totally agree to ban before 10am. Just because it’s the start of your holiday doesn’t mean you need to drink at stupid times in the morning. I have never drank before then and wouldn’t do just for the sake of it.’Good Morning Britain airs weekdays from 6am on ITV.If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.MORE: Why is Holly Willoughby not on This Morning and when is she back?MORE: Drunk pilot was 10 times over the limit before his flight out of Heathrow\n\n\n\n"}