{"id": "Funeral for ‘healthy girl’, 9, who never woke up after going for nap on the sofa", "paragraph": "135.6m sharesA family have said goodbye to their ‘happy and beautiful’ daughter who died without warning from an undetected brain condition after she fell asleep on the sofa one day.Jessica Woolhouse, from Walsall, West Midlands, had complained of a headache shortly before taking a nap on October 21.A short time later, her nan found the nine-year-old unconscious and she was rushed to hospital, where it was discovered she had an undiagnosed weak blood vessel in her brain, which burst and caused a haemorrhage.Medics battled to save her life during four-and-half-hours of emergency surgery, but her family were forced to make the heartbreaking decision to switch off Jessica’s life support machines the following day.Jessica, who had two brothers, Josh, 18, and Jake, 11, was described as ‘healthy and fun-loving’ and her family said there were no warning signs anything was wrong.Her mother Tracey Walerzak, 35, a shop supervisor, paid tribute to her ‘best friend’ during a pink and white-themed funeral held for Jessica on Thursday.She said: ‘Jessica was beautiful, and me and her dad were devoted to her. We had two boys so she was very much wanted.‘She was so happy and she loved telling me about her day at school, friends and her teachers.‘She would attend car shows and she made some very special friends through Ford Mania.‘She was happy and beautiful – she was such a joy to be around.‘She lived for the moment and she taught me that life is very precious.‘She was always friendly and she was loving. She was amazing and I am still so proud to have had such a wonderful daughter.‘I am proud to be her mother and will love her forever.’Tracey had taken her daughter to be looked after by her grandma Janet Walerzak, 61, thinking she was simply poorly.The family have been told that tragically there was very little that could have been done to save Jessica’s life.‘Doctors told us she had a very slim chance of survival – even if she had been on the doorstep of the hospital and it happened, it would have been too late,’ Tracey’s partner Ian Taylor.‘In the days leading up to her death Jess was enjoying a normal, happy life doing the sort of things any other child would. There were no signs she was ill.‘She was full of life, singing and dancing. She was a lover of music, she always had her headphones on doing little selfie videos.‘Then this happened – it’s absolutely tragic.’A white-horse drawn carriage carried her coffin to her funeral at St Emmanuel Church in Bentley yesterday with mourners wearing pink or displaying #TeamJess, the family’s fundraising hashtag.Tracey said: ‘The way the brain haemorrhage took my daughter so suddenly made me realise that we should never take life for granted.‘It has made me realise that life is short and to treasure what’s important in your life.‘The day was very emotional, but I wanted the best for her.’Weak brain blood vessels affect just one in 1,000 people and can burst at any time as a result of coughing, sneezing or straining.If you have a story for our news team, email us at webnews@metro.co.uk.You can also follow us on Facebook and Twitter."}