{"id": "Memory special: Do we even know what memory is for?", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Feature 24 October 2018                                Remembering the past is useful, but the real purposes of memory may be quite different – from planning for the future to learning to communicateMiguel Navarro/GettyBy Alison GeorgeAT FIRST, it seems obvious. Memory is about the past. It is your personal database of things you have experienced.In fact, this repository has a purpose that goes way beyond merely recalling information. Some of the best evidence of this came from studies of people with brain damage or amnesia.One iconic case was of a patient known as KC in the early 1980s. After a motorcycle accident, he was left with an impaired episodic memory: he could remember facts, but not personal experiences. The weird thing was, it also stopped him doing something else entirely. “By studying patients who have an impaired ability to recall the past, we find that they are also impaired at imagining the future,” says Eleanor Maguire at University College London.We now know there is a strong link between being able to remember past events and being able to plan for the future. Imaging studies, for example, show that similar patterns of brain activity underlie both. The key seems to be the ability to generate images of scenes in the mind’s eye. “If you think about it, recalling the past, imagining the future, and even spatial navigation, typically involve us constructing scene imagery,” says Maguire. It could be that being able to picture the past enabled us to imagine the future, and therefore plan – one of the complex cognitive feats that stands humans apart from many other species.If we can’t recall past …To continue reading this premium article, subscribe for unlimited access.Existing subscribers, please log in with your email address to link your account access.Quarterly by Direct DebitInclusive of applicable taxes (VAT)"}