{"id": "The psychedelic science behind dreamy new Netflix hit, Maniac", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Review 30 October 2018                                Emma Stone and Jonah Hill cavort in multiple roles in a show exploring the use of hallucinogenic drugs to treat mental trauma and psychological disordersBy Rowan HooperManiac, a Netflix ten-part series, is like one of those amazingly fun, epic dreams where you get to inhabit entirely different personas and go on wild adventures. And just as even fun dreams can have a deeply personal and sometimes disturbing edge, Maniac is about a method (more pharmacological than psychiatric) of exploring memory, sadness and trauma. It’s the latest in many recent shows and films – from Westworld to Inside Out and Inception – that draw heavily from science to bolster a complex, puzzle-box narrative.The show is set in an uncanny valley 21st-century New York City. We see robot dog-mess collectors trundling along the sidewalks, but people use dot-matrix printers and monochrome monitor displays from the 1980s. New York harbour is dominated by a huge, winged, Statue of Extra Liberty, and Blade Runner-esque neon ads are seen through apartment windows.Our heroes are Owen Milgrim (played by Jonah Hill), who is the depressed, neglected and possibly schizophrenic fifth son of a wealthy Manhattan family, and Annie Landsberg (Emma Stone), a penniless young woman who can’t move on from a terrible family tragedy. In an attempt to rid themselves of their psychological baggage, the two, who don’t know each other initially, sign up to a drug trial at the sinister Neberdine Pharmaceutical Biotech.There is more than a hint of Eternal Sunshine of the Spotless Mind here. Rather than simply erase memories, the Neberdine trial puts subjects into a deep dream state, then monitors and guides their dreams using a supercomputer. There is now good evidence that dreams may partly function to process emotionally powerful experiences, so we are off to a good start here. Unfortunately the computer in Maniac has been programmed to develop empathy, and subsequently becomes depressed.The result is basically a sequence of extended dreams where, mysteriously, Owen and Annie meet up and have adventures. Director Cary Joji Fukunaga and writer Patrick Somerville have obviously had a lot of fun, and Stone in particular relishes the actor’s dream of playing many different roles.In one hallucinated adventure, set in the 1980s, Owen and Annie are married and attempting to rescue a captured lemur. In another they are Bonnie and Clyde-like con artists attending a 1940s seance. In the most spliffed-out episode, Annie is a wood elf in a Lord of the Rings world. Seeing Emma Stone with pointed ears playing a world-weary elf with a booze problem and a British accent is one of the many highlights of this show.Maniac is fantasy, of course – and not just in the Lord of the Rings sense. But there are several ways that real-world drugs are being used to treat psychological disorders. Psychoactive medicine has a long history, but perhaps the most relevant to Maniac is the use of ibogaine.A highly psychoactive chemical derived from the central African rainforest tree Tabernanthe iboga, ibogaine is classed as an illegal drug in most countries, but there have been some clinical trials. As we reported a few years ago, there is good anecdotal evidence that even a single dose of ibogaine can reduce cravings for heroin and other drugs. Despite its legal status and not-scientifically-validated effects, the drug is used in guided hallucinatory therapy in many countries.Ibogaine, like the three different fictional drugs used in Maniac, brings on intense hallucinations. “Ibogaine can take you many places, causing you to experience a range of emotions, memories and visions,” says Jeff Israel, who runs a clinic in Baja California, Mexico, which administers the drug.Other trials have shown promising results for the use of psychoactive drugs such as LSD or psilocybin to treat depression, and there is evidence that the use of such drugs can lead to changes in personality.  Recent work has shown that psychedelic drugs can help the brain form new connections.Maniac is a kooky, clever and thoughtful piece of entertainment, lavishly funded by the Netflix purse. It doesn’t promote the use of psychedelic drugs to treat mental health issues, but I applaud it for taking seriously the idea that psychedelics have a role to play in medicine.More on these topics: "}