{"id": "The quest to build better cities", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.BASF We create chemistry10 October 2018                                Sponsored byThanks to clever chemistry and innovative engineering, the cities of the future are being fashioned from cleaner, greener concreteThe cities of the future will have to be bigger, better and smarter than anything built before. In some ways they are already under construction: think of London’s Shard tower, or Dubai’s Burj Khalifa – the world’s tallest building – or even the awe-inspiring complexity of hidden structures such as Crossrail’s 42-kilometre web of new rail tunnels under London.All of these are emblematic of the smart city revolution. And at the heart of this change is one of the proverbial building blocks of modern settlements: concrete, the material that these cities will be fashioned from.Clever chemistry is making concrete more advanced than ever. “We can build higher, we can build slimmer, we can build further underground, and we can build for longer,” says Ian Ellis at BASF, one of the world’s largest chemical companies. Ellis manages the concrete admixtures technical services that BASF offers in the UK, Ireland and Benelux.Ellis is part of a global BASF team that has developed an array of polymers and associated admixtures capable of changing concrete’s properties – increasing its strength, altering its workable lifetime, improving its rheology and even allowing it to be sprayed onto newly excavated earth.It is this last property that allowed the huge Crossrail tunnels to be built so quickly and efficiently. Every time the boring machines excavated a metre or so of the tunnel, robots sprayed a 400-millimetre layer of concrete onto the newly exposed London clay. As the concrete emerged from the spray nozzle, it mixed with a BASF accelerator that starts the setting process. “The millisecond the concrete is in the air, it starts to set,” says Richard Foord, project manager for BASF’s underground construction in the UK and Ireland.This newfound control over concrete’s setting time is proving a hit with engineers looking to create what would once have been seen as impossible builds. Even the process of getting concrete to the construction site is being transformed by chemical intervention. If a truck gets snarled up in traffic, the concrete might begin to set too early, but polymers in the admixture can prevent this.Building upwards can create problems too. Much of the concrete poured for the Burj Khalifa had to be pumped up to 600 metres above ground. “By the time it gets up there it’s already more than one hour old,” Ellis says. And the construction took place in the desert, with the structure exposed to Dubai’s blazing sun.All this is possible using polymers that help the particles of cement bind together when it is meant to set, or keep them apart when it is not. But getting the mixture exactly right is a difficult task.It’s this kind of challenge that Ellis and Foord relish. They liaise with polymer chemists at BASF laboratories around the world to meet the increasingly tough demands of construction engineers. “Tell us what you want the concrete to do, and we will do our utmost to make it happen,” Ellis says.These days, the engineers’ demands include ecological considerations. Tideway, London’s “supersewer” – a 25-kilometre tunnel 60 metres underground – provides a good example. The sewer will directly improve London’s environment, reducing sewage dumps into the river Thames by 95 percent, and even the materials used to build it are arriving on site in the most environmentally friendly way possible. “We’ve had to reinvent the way we move and supply concrete,” Foord says.BASF’s involvement in the building of the new Queensferry Crossing across the river Forth also tackled environmental issues: to minimise the project’s carbon footprint, the concrete relied on local materials. That in turn meant finding polymer add-ins and other chemical fixes that would transform the properties of those materials, giving the resulting concrete the strength, durability and workability required.Technological innovations also help temper concrete’s innate environmental impact. Making the cement used in concrete involves heating ground-up minerals to ultra-high temperatures in furnaces that burn fossil fuels and release enormous quantities of carbon dioxide and other greenhouse gases. Cement production is responsible for around 8 per cent of global CO2 emissions – as well as being increasingly expensive.That’s why BASF laboratories have developed products that replace much of the cement with materials such as limestone filler, fly ash, a by-product of coal-fuelled power plants, or powdered blast furnace slag from steel production.Despite all the challenges facing construction in the 21st century, modern concrete still looks good: it resists attack from pollutants in city air, and allows construction to be eco-efficient, faster and more cost-efficient. Perhaps most excitingly, though, it makes city life better.More at: www.wecreatechemistry.comPolymers make it possible to pour enormous volumes of concrete into a single structure. Building the basement of the Shard, for instance, took almost a whole weekend: over a 36-hour period, London Concrete poured 5400 cubic metres of concrete down from ground level. BASF polymers ensured that it set as one continuous structure. “The concrete poured first had to have a longer setting time than the concrete poured towards the end,” Ellis says.Another type of polymer, a superplasticiser, can improve the way concrete spreads by preventing cement particles from binding to each other. This makes the mixture less viscous (see “Diagram”) so that it spreads further when it is poured. BASF markets such admixtures under the MasterGlenium brand.This article appeared in print under the headline “Building better cities”Magazine issue 3199, published 13 October 2018Next articleThe future: lower carbon products"}