{"id": "LIGO to publish new paper in wake of New Scientist investigation", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 2 November 2018                                David Ryder/Bloomberg via Getty ImagesBy Joshua HowgegoThe LIGO Scientific Collaboration, which detected gravitational waves in 2015, has announced that it will publish a detailed explanation of how it analyses the noise in its detectors.The announcement, on 1 November, comes in the wake of an exclusive New Scientist investigation that exposed questions about the analysis underpinning the breakthrough discovery. The full investigation can be read here by subscribers.LIGO’s 2015 announcement of the discovery of gravitational waves was one of the most exciting findings in physics for decades. The discovery confirmed a prediction made by Einstein, that space-time itself can squeeze and stretch in rhythmic waves, when deformed by cataclysmic events, like the collision of black holes. The collaboration’s founders were awarded the Nobel prize in physics in 2017.But detecting gravitational waves is hugely challenging. LIGO’s detectors aim to measure a shortening of space equivalent to about a thousandth of the width of a proton. This sort of measurement is swamped by natural thermal vibrations, known as noise, that make picking out the signal from a gravitational wave tricky. To deal with this, the collaboration used sophisticated analysis techniques to remove this noise their data, but these analysis techniques are being questioned.The claims were first aired by a group of Danish researchers a few years ago. Since then, they have published their doubts in a peer reviewed journal. The LIGO collaboration has not yet published any papers clarifying their approach in response.That much was common knowledge in the physics community. But the New Scientist investigation uncovered a number of irregularities, including a published data plot drawn “by eye” rather than with real data.LIGO now says they are in the process of preparing their paper, which will provide more information about their analysis techniques, but has not stated when this is likely to be published.More on these topics: A shorter version of this article was published in New Scientist magazine on 10 November 2018"}