{"id": "New techniques may soon make designer babies a reality – are we ready?", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Leader 15 November 2018                                BURGER/PHANIE/Science Photo LibraryIT IS hard to think of an area of science more controversial than the genetics of intelligence. Now it is about to get exponentially more contentious.For a long time, DNA testing couldn’t tell us anything useful about someone’s IQ or any other traits affected by multiple genes, such as diabetes or cancer risk. But new “polygenic” techniques for analysing many genetic regions at once have begun to make this possible. This week, we report on the first company offering fertility clinics a test for screening IVF embryos for disease risk and low intelligence (see “Exclusive: A new test can predict IVF embryos’ risk of having a low IQ”).With this news, it is unlikely to be long before some clinic, somewhere, starts using a similar approach to offer prospective parents the ability to pick out embryos that look most genetically promising for a high IQ.As if this isn’t controversial enough, it may only be the beginning. As our understanding of traits governed by multiple genes grows, it may also become possible to screen for embryos that are more or less likely to have a range of other features, be it sexuality, autism or susceptibility to depression.We already live in a world where wealthy individuals are willing to cross borders to pay for procedures at the sharpest edge of fertility research. The first baby created using a particular three-parent technique was born two years ago to Jordanian parents helped by US scientists working in Mexico, for example.While many prospective parents won’t want to genetically fine-tune their children this way, the idea of a near-designer baby will undoubtedly appeal to some. The desire to maximise a future child’s intelligence, mental health or physical attractiveness could be enough to prompt couples with no fertility problems to seek IVF, just to have this opportunity.“It is unlikely to be long before a clinic offers the new test to parents to pick out high IQ embryos”It might sound unlikely, but reproductive technologies designed to avoid medical conditions are already being used to find out more about our future children. A different kind of test, used to detect Down’s syndrome during pregnancy, is being used in private clinics to discern the sex of a baby very early in pregnancy. Concerns have been raised that this practice gives people more of a chance to opt for abortions on the basis of gender, although we don’t yet know to what extent the test is being used in this way, if at all.All this means that politicians, regulators and the public need to begin debating the far-reaching implications of polygenic IVF screening. For so long, the mantra has been that DNA tests for individuals can’t tell us anything about complex traits so we haven’t yet decided what we should do when they can.There is much for this debate to consider. Is it ethical to screen for disease risk, but not for predicted personality? What about mental health problems or a predisposition to autism? Should prospective parents be allowed to decide for themselves, or should societies as a whole determine what is most ethical?It is a difficult conversation to have, but whether we like it or not, these technologies aren’t far from being a reality.This article appeared in print under the headline “Time to talk designer babies”More on these topics: Magazine issue 3204, published 17 November 2018Previous articleChina may have developed a quantum radar that can spot stealth planesNext articleExclusive: A new test can predict IVF embryos’ risk of having a low IQ"}