{"id": "The day a Siberian tiger nearly killed me", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Profile 7 November 2018                                Pavel Fomenko patrols the icy and dangerous forests of Russia’s far east to protect its big cats. But the worst happened when he least expected itAntonio Olmos / WWF-UKBy Graham Lawton“WE HAVE a saying here: if you see a tiger, you see your death. Death will be coming very soon.”Pavel Fomenko is living proof that this is just a saying – but only just. He has been working for 30 years to conserve Siberian tigers in Russia’s far east. But his most recent direct encounter was almost his last.In March, Fomenko was attending to a female tiger at a wildlife rehabilitation centre in Alekseevka, in Russia’s wild and remote Primorsky province. The tiger had been captured in a village after killing dogs to feed her cubs. It was what conservationists call a “conflict tiger” – one in danger of being killed by humans. “Such a tiger should be caught and put in a rehabilitation centre,” Fomenko tells me on the phone from WWF Russia’s office in Vladivostok, where he is head of rare species conservation. “This tiger was put in the centre and later she had to be vaccinated. During the vaccination, an accident took place.”That, it turns out as he continues his story, is an understatement. The tiger was in a wire enclosure. When Fomenko approached, it lunged at him. The wire fence was rusty and the tiger burst straight through. “It was three bites, one on the left shoulder and two on the face. I fell. She probably thought I was dead, I don’t know what was in her mind. She ran towards the opposite side of the enclosure, but I understood she might come back. So I found the strength to …To continue reading this premium article, subscribe for unlimited access.Existing subscribers, please log in with your email address to link your account access.Quarterly by Direct DebitInclusive of applicable taxes (VAT)"}