{"id": "Exclusive: A new test can predict IVF embryos’ risk of having a low IQ", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.This Week 15 November 2018                                A new genetic test that enables people having IVF to screen out embryos likely to have a low IQ or high disease risk could soon become available in the USERproductions Ltd/GettyBy Clare WilsonTHE prospect of creating intelligent designer babies has been the subject of ethical debate for decades, but we have lacked the ability to actually do it. That may now change, thanks to a new method of testing an embryo’s genes that could soon be available in some IVF clinics in the US, New Scientist can reveal.The firm Genomic Prediction says it has developed genetic screening tests that can assess complex traits, such as the risk of some diseases and low intelligence, in IVF embryos. The tests haven’t been used yet, but the firm began talks last month with several IVF clinics to provide them to customers.For intelligence, Genomic Prediction says that it will only offer the option of screening out embryos deemed likely to have “mental disability”. However, the same approach could in future be used to identify embryos with genes that make them more likely to have a high IQ. “I think people are going to demand that. If we don’t do it, some other company will,” says the firm’s co-founder Stephen Hsu.For many years, it has been possible to do simpler genetic tests on embryos as part of IVF. For example, parents at risk of having a child with cystic fibrosis have the option to undergo IVF and select an embryo that doesn’t carry the gene behind the condition. It is also possible to screen for several other conditions caused by a single gene, as well as those caused by chromosomal abnormalities, such as Down’s syndrome.However, most medical conditions are influenced by hundreds of genes, which has made it impossible to screen out embryos with a high risk of heart disease, for example, or select embryos with a low likelihood of experiencing depression. This is true for traits like intelligence too.In recent years, it has become possible to work out a person’s likelihood for having certain conditions or traits by analysing many DNA regions at once to calculate something called a polygenic risk score (see “Predicting an embryo’s future traits“).Genomic Prediction is the first company to offer polygenic risk scores for embryos rather than adults. The firm is mainly promoting its tests as a way of screening out embryos at high risk of certain medical conditions. But the company’s polygenic test for “mental disability” is more controversial. It isn’t accurate enough to predict IQ for each embryo, but it can indicate which ones are genetic outliers, giving prospective parents the option of avoiding embryos with a high chance of an IQ 25 points below average, says Hsu.“If we consider inclusion and diversity to be a measure of societal progress, then IQ screening proposals are unethical,” says Lynn Murray of Don’t Screen Us Out, a group that campaigns against prenatal testing for Down’s syndrome. “There must be wide consultation.”Information from the same test could be used to go one step further and select whichever embryo is most likely to have a high IQ. “What that corresponds to is way-above-average intellectual potential,” says Hsu.For ethical reasons, Genomic Prediction won’t help parents select high-IQ embryos in this way. Nevertheless, it seems likely that other firms will do so in future. “If it doesn’t happen in the US, it will happen in another country,” says Kevin Mitchell of Trinity College Dublin, Ireland.The idea of using such tests to select embryos predicted to have high intelligence is “repugnant, but technologically feasible”, says geneticist Peter Visscher at the University of Queensland, Australia.Intelligence is only one trait the firm can give a polygenic risk score for. Others on offer include heart disease, breast cancer, type 1 and type 2 diabetes, and inflammatory bowel disease.All the geneticists New Scientist spoke to agree that the principles behind polygenic testing are valid, but Mitchell says the service may be of limited use in practice, because many people using IVF have just a few embryos to choose from.“We don’t yet fully understand what other effects genes involved in intelligence may have”What’s more, if these embryos all share the same biological parents, they are unlikely to show much variation in their polygenic scores for various traits. Also, we don’t yet fully understand what other effects the many genes involved in traits like a higher intelligence or lower risk of heart disease might have. For example, some studies have suggested that people with higher polygenic scores for academic ability are also more likely to be autistic.“You don’t know what you’re selecting for and what comes with it,” says Visscher. “But there are people who pay hundreds of thousands of dollars to have their dead pet cloned. I’m sure there are people who would do this.”In the UK, screening embryos for polygenic conditions isn’t currently allowed – they can only be screened for simpler genetic conditions.But some IVF doctors want that to change. “I take my hat off to what they’re doing, it’s a potential revolution,” says Simon Fishel, president of the Care Fertility Group clinics in the UK.Genetic testing for complex traits used to be impossible. That’s because they are affected by hundreds of different genes, each with just a small influence, only a small fraction of which have been identified.But thanks to studies involving hundreds of thousands of people, more DNA regions implicated in these kinds of traits have been found. A study published in July found more than 1000 DNA regions that together accounted for 13 per cent of variation in academic achievement.And their influence can be higher in certain people. For example, a rare gene variant may only account for a tiny percentage of variation in intelligence across a population, but it may make a big difference to the IQ of those who have it.As it becomes possible to estimate the future intelligence of an embryo (see main story), some prospective parents will discover that some of their IVF embryos have a high chance of intellectual disability, while others may find that one of their embryos is likely to be especially clever.There are no certainties, but for a few this could make a big difference. The July study found that 60 per cent of those with a genetic score in the top fifth of the group got a university degree, compared with 10 per cent of those in the bottom fifth.This article appeared in print under the headline “Choose your child’s intelligence”Leader: “New techniques may soon make designer babies a reality – are we ready?”More on these topics: Magazine issue 3204, published 17 November 2018Previous articleNew techniques may soon make designer babies a reality – are we ready?Next articleMixed results for science in the US midterm elections"}