{"id": "A freak 1870s climate event caused drought across three continents", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 30 October 2018                                Illustrated London News Ltd/Mary EvansBy Michael MarshallIt’s not easy to forget the deaths of 50 million people, but we have managed it. A global drought in the 1870s caused mass starvation in South America, Africa and Asia, but the event doesn’t even have a Wikipedia page. Now it seems the drought was triggered by a never-before-seen combination of climate events. While rare, the drought was entirely natural so it could easily happen again.Between 1875 and 1878, severe droughts ravaged India, China and parts of Africa and South America. The result was a famine that struck three continents and lasted three years.“It is one of the worst humanitarian disasters in human history,” says Deepti Singh at Washington State University.In India the local manifestation of the event is known as the Great Famine. At the time India was controlled by the British Empire, and British policies exacerbated the drought’s effects. The British continued exporting grain for profit, leaving little for the local people to eat.The famine was described by Mike Davis at the University of California, Riverside in his 2001 book Late Victorian Holocausts. He estimated that 50 million people died. Like all historical death tolls, this figure is uncertain. Our World in Data puts it at 19 million, but excludes several countries. Either way, tens of millions died, putting the famine in the same ballpark as the 1918 influenza epidemic, the world wars, and perhaps even the Black Death of the 1300s.Now Singh and her colleagues, including Davis, have examined the drought in detail. “We knew there were droughts in these places, but we didn’t know how severe they were,” she says.The first step was gathering weather data from a time before weather forecasting. Fortunately, in India the British Empire helped set up a network of rain gauges. For other places, like China, the team used estimates of rainfall based on data from tree rings.“We find it’s the most severe event in the 800-year record in Asia,” says Singh. The information from South America and Africa was not good enough to make such a determination. In north China, the drought was the worst in the last 300 years.Several factors played a role. The most obvious was a big El Niño in 1877-78. During an El Niño, warm water spreads over the Pacific, releasing heat into the air. This affects weather all around the world, bringing storms to some places and drought to others.It has been clear since the 1980s that the 1877-78 El Niño was intense. “Now we have a lot more data,” says Singh. “This event was the strongest El Niño that has occurred since the 1850s.” Sea surface temperatures remained high for 16 months. That makes it bigger than the huge El Niños of 1997-98 and 2015-16.But that’s not all. In 1877 a second climate cycle, the Indian Ocean Dipole, was active – meaning the western Indian Ocean was warmer than the east. This typically weakens India’s monsoons. “It was the strongest Indian Ocean Dipole on record,” says Singh.The Atlantic Ocean was also unusually warm from 1877 to 1879. “Following the El Niño, it peaked to the most extreme temperatures on record,” says Singh.To determine which factors were significant, the team ran a climate model with the global sea surface temperatures, and with just the Pacific temperatures – simulating the El Niño alone. They found they could only explain the droughts using the global pattern, suggesting all three climate cycles were involved.“It’s pretty unusual to be able to go into this much detail on an event that far back,” says climatologist Isla Simpson of the National Center for Atmospheric Research in Colorado. “They’ve really done the best they can do with the observations that are available.”The drought happened before greenhouse gas emissions had affected the climate. “That’s why it is a cause for concern,” says Singh. If it happened once, it could happen again, and we don’t know how often.Furthermore, climate change is expected to make droughts more severe, and indeed it already has.The good news is the world is more resilient to droughts today, thanks to more resilient crops and extensive trade, says Olivier Rubin at Roskilde University in Denmark. “If we had a drought like this today, there would be devastating effects on hunger, devastating effects on poverty,” he says. But while more people would go hungry, it should be possible to avoid a deadly famine. “The contemporary famines we see are usually in very conflict-prone settings,” like South Sudan and Somalia, where governments are ineffectual and organisations struggle to enter.During a major drought, trade should compensate for local food shortages by redistributing supplies, says Paul Dorosh at the International Food Policy Research Institute in Washington, DC. However, food prices would rise, so safety nets become crucial. The poorest people, who cannot afford the higher prices, need hand-outs. Ethiopia has had such a safety net since the early 2000s, so the famines of the 1970s and 1980s have not recurred.Even a huge shortfall in food should not lead to a famine if properly managed, says Dorosh. “There is no excuse for a famine.”Journal reference: Journal of Climate , DOI: doi.org/cwb7 More on these topics: A shorter version of this article was published in New Scientist magazine on 3 November 2018"}