{"id": "The BepiColombo spacecraft is about to blast off to Mercury", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 18 October 2018                                ESABy Leah CraneMercury is not a particularly pleasant place, with extreme temperatures ranging from -170°C during the night to 430°C in the daytime, and constant blasts of intense radiation. Nevertheless, that’s where the BepiColombo spacecraft is going — it’s a joint mission by the European Space Agency and the Japan Aerospace Exploration Agency. The spacecraft will launch towards the hellish planet closest to the sun on 20 October.We have only sent two spacecraft to Mercury before: Mariner 10, which flew by three times in 1974 and 1975, and Messenger, which orbited the planet from 2011 to 2015. Those two missions taught us a great deal about the planet, but they also uncovered mysteries and left many more questions unanswered.Mariner found that Mercury has a magnetic field, which was unexpected — Venus, Mars, and the moon don’t have them. BepiColombo will measure the structure of this strange field and hopefully help us figure out how it got there.The planet’s surface is no less weird. Messenger spotted what seem to be pools of ice at the centres of craters near Mercury’s poles, which likely stay cool because sunlight never reaches the craters’ bottoms. But we don’t know how the ice got there in the first place. It also saw strange dips in the ground that don’t appear to be impact craters and do not appear on any other planets we know of.“Mercury has a few unexpected results from previous missions which bring into question our planet formation models,” says BepiColombo project scientist Johannes Benkhoff. “If we can follow on with BepiColumbo and find a solution, that for me would be the most exciting thing that we could do with this mission.”BepiColombo will carry with it two orbiters, one dedicated to studying the planet itself, from its iron core out to its tenuous atmosphere, and one to study its magnetosphere, the larger area of space within its magnetic field.But before BepiColombo can work on solving any of these mysteries, it has to get to Mercury – and that is a challenge in and of itself. “You need almost the same amount of energy to bring a spacecraft to Mercury as you need to go to Pluto, although Pluto is 50,000 times farther away from Earth,” says Benkhoff.To avoid flying right past Mercury and falling into the sun, the craft will take the scenic route, looping back around Earth once, Venus twice, and Mercury six times to get the energy it needs to get into orbit. If all goes well, BepiColombo will reach its final destination in December 2025.More on these topics: "}