{"id": "Your genes affect which university you go to but that’s no surprise", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 18 October 2018                                A large study of twins has found links between genes and which university people go to, but any behavioural traits in people arise from a complex interplay of nature and nurture.Albuquerque Journal/ZUMA Wire/Alamy Live NewsBy Clare WilsonI’ve heard there is a gene that gets you into Oxford – can it really be true?Hardly. A large study of 3000 pairs of UK twins has found that, like intelligence, your chance of getting into a good university is partly heritable. If your twin gets into the University of Oxford, for instance, you are more likely join them if they are your identical twin, with whom you share all your DNA, than if they are just your fraternal twin, where you share half. Doing this suggests that 57 per cent of the “quality” of your university is down to your genes, say Ziada Ayorech of King’s College London and colleagues in a study published today (Scientific Reports, DOI: 10.1038/s41598-018-32621-w).What does “university quality” mean?The team used existing university league tables as a measure of quality, although sceptics might argue this doesn’t take account of the possibility that different institutions could suit different people for reasons other than their academic prestige – or even that plenty of intelligent people choose not to go to university at all.So could a genetic test tell you which university your child could get in to?Fortunately not. The same team also looked at the DNA of a different 3000 people and could only identify up to 5 per cent of the genes that seemed to be linked to universities. Thanks to this “missing heritability” we’re a long way off from making genetic predictions about university acceptance, or any other complex behavioural traits.Do we know how much of a person’s intelligence is determined by their genes?Previous research has suggested between 50 and 80 per cent of the variation in people’s IQ is inherited. As intelligence affects school exam results and they in turn influence which university you go to, it’s unsurprising that genes may be linked to university destination too. But the team tried to remove the effects of intelligence from the analysis by removing the impact of exam results on university entrance using statistical techniques. When they did this, they found that genes were still behind 47 per cent of the variation in university quality, suggesting that they do affect university destination in ways other than shaping your intelligence.So is it case closed?Not necessarily. Intelligence genes might influence your university through other mechanisms than exam results, for instance by affecting how impressive an application form you write and how well you do at interview.Isn’t the whole concept of IQ falling into disrepute anyway?Not really. Certainly there is a shameful history of people using IQ tests to justify racist and sexist attitudes without taking societal inequalities into account. But that doesn’t mean the tests themselves are flawed. Countless studies have found that people with higher IQ on average do better at school, get better jobs, and earn more money in life. Whatever it measures, it’s something interesting, says Stuart Ritchie, also of Kings College London, who wasn’t involved in the research.So our fate is determined at birth after all?Not at all. If half the variation in intelligence – or university destination – comes down to our genes, the rest must be down to our surroundings. That could include how much encouragement children get from their family and friends, whether their parents went to university, family wealth, and the quality of teaching at their school. Governments can help level the playing field, for example by funding early-years education so children from poorer households don’t start school behind.So intelligence, like all complex behavioural traits, comes from an interplay of genetic and social factors?Go to the top of the class.More on these topics: A shorter version of this article was published in New Scientist magazine on 27 October 2018"}