{"id": "People who gave up smoking cannabis had a memory boost within a week", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 30 October 2018                                Westend61 GmbH / Alamy Stock PhotoBy Clare WilsonCannabis use really does weaken your memory. People who gave up smoking the drug saw their cognitive abilities improve after just a week.Though cannabis has a reputation for making people less mentally sharp, it’s hard to know if the drug causes the problems or if people who smoke it have a worse memory to begin with.The only definitive way to find out is a randomised trial, where some people who don’t normally smoke cannabis take it up for months, but this wouldn’t ever get past an ethics board.So Randi Schuster at Massachusetts General Hospital in Boston hit on the idea of a trial that asks existing users to stop and compares them with a control group who continue.Schuster’s team recruited 88 people aged between 16 and 25 who used cannabis at least once a week. Two-thirds of them, chosen at random, were incentivised with cash to quit for a month, with regular urine tests to keep everyone honest. At the start of the trial and once a week they took various mental tests.The quitters scored significantly better in memory tasks in the first week, and stayed at that level for the rest of the month. Those who continued using cannabis only improved their scores slightly over the month, probably because they were getting used to the tests, says Schuster.Brain-scanning studies have shown that regular cannabis users have lower amounts of a receptor in the brain that binds chemicals in the drug. This receptor is normally found at high levels in the hippocampus, part of the brain involved in memory, says Tom Freeman at the University of Bath, UK, who wasn’t involved in the study. “It makes sense that this is where we are going to see the impairments.”The brain scans found that cannabis receptor levels returned to normal within two or three days of quitting – tallying with the latest finding that memory recovery was  fast.Journal reference: Journal of Clinical Psychiatry, DOI: 10.4088/JCP.17m11977 More on these topics: A shorter version of this article was published in New Scientist magazine on 3 November 2018"}