{"id": "How lab-on-a-chip technology is turning smartphones into food sensors", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.BASF We create chemistry14 November 2018                                Sponsored byA lab-on-a-chip that fits inside a smartphone is set to change our relationship with food and the chemicals we use to make itAt the London Restaurant Festival, Sebastian Valouch is looking very slightly on edge. “I know the technology works,” he says. “But demonstrations always make you feel a little nervous.”He is talking about the latest innovation from his employer, the BASF subsidiary company trinamiX GmbH. It’s a prototype handheld spectrometer, a point-and-click device that can see, via infrared radiation, how apparently identical consumer products can differ in their chemical make up.Those worries prove unfounded: the technology works perfectly. BBC science presenter Michael Mosley puts the device through its paces, and the connected smartphone app displays the results. The scanner correctly differentiates between olive and sunflower oils, rye and wheat flour, sugar and the sweetener erythritol, and silk and polyester. Other people have a go too – no training required.Hertzstück is the name of the sensor inside this “lab for the pocket”. It’s the sensor that enables all the magic. When the spectrometer device comes to market, it will provide a fast and easy way to test a huge swathe of food products for potential allergens or unwanted contaminants – as well as testing medicines and chemicals for purity, and crops for signs of drought or readiness to harvest. “You don’t need access to a huge laboratory any more,” says Valouch, who is trinamiX’s group leader for sensor development. “What’s more, you can use this device while in a restaurant, or shop – or even while standing in a field of ripening maize.”BASF created trinamiX GmbH in 2015 as a spin-off company to exploit the discovery of its Managing Director, Ingmar Bruder. He spotted that a specific solar cell material had potential for use in 3D scanning technology.Part of the development involved miniaturising lead sulphide detectors of near-infrared radiation and shielding them with a nanometre-thick encapsulation layer to prevent degradation by oxygen and water. The 3D-scanning tech is still going full steam ahead, but the BASF researchers realised that in their miniature near-infrared detectors, they had inadvertently developed the perfect basis for a handheld spectrometer.Spectrometers are used around the world for analysing the chemical make-up of a vast range of materials. They work by exciting molecules with radiation, then examining the resulting emissions. Large near-infrared spectrometers are already available, but the tiny trinamiX version opens up a new swathe of applications – including being put into a smartphone. “The Hertzstück sensor with its encapsulation is only around half a millimetre thick, and that makes it possible to build a spectrometer that fits into a smartphone,” says Valouch.The prototype spectrometer uses four small incandescent lamps to fire low-intensity infrared radiation, with wavelengths between 1 and 3 micrometres, at the product under investigation. Different molecules respond to infrared radiation by vibrating at different frequencies, and with different harmonics. That means each kind of molecule in the sample has an individual infrared fingerprint. The Hertzstück device sends the detected fingerprint to a computer, which searches a database for materials with the same signature.The first commercial application of Hertzstück will probably be in that area of agriculture and will give farmers the ability to make better decisions, for example about the right time to harvest or the products they are using. “There’s a real need for determining whether the herbicides they buy are the real deal or inferior counterfeits,” Bruder says. “European companies lose a billion euros a year to fake herbicides, and the farmers can have their crops ruined because of it.” And that’s only the beginning: foodstuffs are also a common source of fraud (see “Seeing through the fakes”).It’s not just about fighting crime, though. Within a few years, trinamiX thinks you will be pointing your Hertzstück-equipped phone at supermarket food to see if it contains non-vegan ingredients, for instance. You might even raise your phone to your cheek to see if that new moisturiser you bought really is holding in moisture.Before then, supermarkets will be using Hertzstück to check product freshness on the shelves. This is already working, and it impressed Mosley at the London Restaurant Festival. “That means you can measure the fat or water content of a cheese without opening the packaging, and do the analysis right there in the supermarket,” he told the crowd.Indeed, the Hertzstück sensors are already used for industrial applications that depend on the reliable detection of infrared light, like flame detection.More at: www.BASF.com/hertzstueckCounterfeiting is a multibillion-dollar business worldwide. It’s not just about works of art, money or branded clothing, though. Counterfeited food is such a major issue that the US House of Representatives has expressed concern and called for better ways of sampling and testing foodstuffs. Investigators have found olive oil contaminated with seed oils, for instance, and peanuts that were deliberately mislabelled as more expensive pine nuts. These are dangerous practices that can kill people who are allergic to the hidden contaminants.One of trinamiX’s big hopes is that its Hertzstück device can overcome the growing problem with adulteration, in which valuable ingredients are mixed with cheaper, similar-looking chemicals. One example, particularly prevalent in Asian markets, is the adulteration of milk powder with melamine. Standard fraud detection equipment looks at the nitrogen content of the powder, but melamine is not different enough from milk in this respect – it still looks good. “But near-infrared spectroscopy can distinguish between pure milk powder and milk powder contaminated with melamine, so that’s something we can stop,” Valouch says.The Hertzstück device can also distinguish between saturated and unsaturated fatty acids. If the sensitivity can be tweaked sufficiently, it might even be possible for future versions of the detector to tell apart the various grades of olive oil, something that could halt the world’s most widespread food fraud in its tracks.Textiles importers will also be able to put the Hertzstück scanner to work. Near-infrared spectroscopy can tell the difference between a variety of fibres, sorting silk from cotton, and cotton from a polyester-cotton mix. Those equipped with the device will be able to tell whether manufacturers are using cheaper fibres than they claim.Shoppers should benefit too as and when the device is embedded in smartphones. “In a clothes shop you’ll be able to use your phone to determine what kind of fabric their clothing is made from,” says Valouch.This article appeared in print under the headline “Scanning the future of food”Magazine issue 3204, published 17 November 2018Previous articleIran’s imprisoned conservationists need scientists to speak upNext articleMystery “space cow” is a weird new type of powerful space explosion"}