{"id": "Dinosaur fossil may be a whole new species of the first birds", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 25 October 2018                                ESRF / Pascal GoetgheluckBy Michael MarshallA new species of Archaeopteryx, the famous “first bird”, has been identified. The discovery supports the idea that Archaeopteryx really is a transitional species between dinosaurs and their bird descendants, and not an evolutionary dead end as has been suggested.Archaeopteryx was first recognised as a species in the 1860s. It was immediately seized on as evidence for Darwin’s theory of evolution, because it appeared to be a bird with dinosaur-like traits. It had wings and feathers, but teeth instead of a beak. The obvious implication was that Archaeopteryx was a transitional fossil, showing how birds evolved from dinosaur ancestors.It was about the size of a raven and may have had black feathers. It’s been suggested that it only flew in short bursts like a pheasant, and hunted at night.However, over the last decade its position in the evolutionary tree of birds has been called into question, following the discovery of similar dino-birds in China. A 2011 study built a family tree and concluded that Archaeopteryx was a dinosaur, not a bird.Martin Kundrát at the University of Pavol Jozef Šafárik in Slovakia and his colleagues have now studied a hitherto-unexamined Archaeopteryx fossil.It was found in the early 1990s, apparently in a quarry near Daiting, Germany, and ended up with a private collector. For years it remained unknown and was nicknamed “the Phantom”, until in 2009 palaeontologist Raimund Albersdörfer bought it. It is now on long-term loan to the Bavarian State Collection of Paleontology and Geology in Munich.The fossil contains most of the skull, plus parts of the shoulders and left wing. It is encased in rock and has been squashed, but Kundrát scanned it using high-powered X-rays. “We can see every preserved bone,” says Kundrát. “Not only that, we can see these bones from inside.”The team found subtle differences in the bones and teeth not seen in the other known fossils of Archaeopteryx. Kundraat’s team has put the specimen in a new species, Archaeopteryx albersdoerferi.Some of the bones are hollow, which makes them lighter. Modern birds have similar bones to help them fly, implying the species could fly.When the team built a new family tree of birds and related dinosaurs, it placed the new species of Archaeopteryx at the base of the bird (or avian) line. “It’s in an important position to tell us about the early evolution of avian dinosaurs,” says Kundrát.“It looks more and more likely that Archaeopteryx really is somewhere on the lineage towards recent birds,” says Oliver Rauhut of the Bavarian State Collection of Paleontology and Geology in Germany. “It’s very unlikely that it is an ancestor to later birds,” he says, because the odds are against a direct ancestor being fossilised, but “it gives us a good idea what a very early bird might have looked like”.Flight arose “probably three times” and maybe more among bird-like dinosaurs, says Rauhut. He points to Microraptor, a dinosaur with flight feathers on its legs as well as its wings that probably glided. “It had nothing to do with the origin of birds.” Another dinosaur, Yi qi, had membranous wings like those of a bat. Journal reference: Historical Biology, DOI: 10.1080/08912963.2018.1518443More on these topics: A shorter version of this article was published in New Scientist magazine on 3 November 2018"}