{"id": "Fasting power: Can going without food really make you healthier?", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Feature 17 October 2018                                Fasting diets are getting ever more popular, amid promises of weight loss and better health, but does the science stand up? We put the latest one to the testVincent Besnault/GettyBy Caroline WilliamsAS I unpack my rations for the next five days, I start to question what I have signed up to. For years I have heard the hype about fasting diets and what they promise: smaller thighs, a clearer head, a lower risk of cancer, heart disease and diabetes and the promise of a generally longer, healthier life.But then there is the hunger. Hunger makes me angry, and tired, and generally not a very nice person. So I have always given fasting diets a miss: the 5:2 diet where you fast for two days a week and eat normally the others; the 16:8 where you eat within an 8 hour window, and fast for 16; the alternate day fasting. You name it, it seems someone has tried it.Then I heard about one of the latest trends, the fasting mimicking diet. If the marketing materials are to be believed, it is the holy grail: all the health benefits of fasting without the hunger. The company behind it has even become the first to be granted a patent for boosting human healthspan before the onset of disease. So can I really have my cake and eat it? I decided to give it a go – and try to get to the truth about fasting.We have known for decades that restricting calories can have beneficial effects – if not in humans, then in animals. Many studies have found that organisms from single-celled yeasts to rodents age more slowly and live longer when their calorie intake falls to 40 per cent of that consumed by a group of animals eating normally.Constant calorie restriction has never really caught on in people, however, not least because the results didn’t bear out in primates. Besides, people find it difficult to restrict their diet in this way for long enough to find out if it extends their lives.Fasting has been part of religious practice around the world for millennia, but it first made it into the consumer mainstream around five years ago, on the back of animal studies and research in overweight people suggesting that skipping meals could have numerous health benefits. There is growing evidence that periodically going without food puts our bodies into a kind of emergency mode, where they conserve energy, make repairs and prioritise mental clarity to solve the problem of finding food. “If we accept that the Palaeolithic was the environment in which most modern human adaptations were shaped, including dietary ones, the hunter-gatherers then were adapted to periods of feast and famine,” says Stanley Ulijaszek, a nutritional anthropologist at the University of Oxford. “This could well be a more natural state for us than ‘three meals a day’.”As well as weight loss, proponents claim that intermittent fasting could help protect against cancer, diabetes and disorders like Parkinson’s and Alzheimer’s disease.My own enthusiasm at the promise of a hunger-free fast diminishes somewhat as the kit arrives. I would be living off two packet soups a day, plus a few crackers, olives and the odd nut bar. It looked a lot like hunger to me.This particular diet is the brainchild of Valter Longo, a gerontologist at the University of Southern California in Los Angeles. The basic claim is that fasting just once a month – albeit for five days – can mimic the effects of fasting seen in animals, even reversing the effects of ageing. The website of Longo’s spin-off company, ProLon, says that the fasting mimicking diet is “clinically proven to induce the [body’s] protectionist and rejuvenation mode”, while providing enough calories that you don’t actually pass out.Anyone can benefit from this cellular spring clean, says Longo: “It doesn’t matter how good your diet is, it doesn’t matter how much exercise [you do], the body ages and the cells accumulate damage.”Thanks to animal studies, we know a fair amount about what happens in the body when food is scarce. A lack of nutrients kick-starts a process called autophagy, in which cells break down and damaged or dysfunctional parts are recycled and used as fuel. The thinking is that this system probably evolved to maximise the chances of surviving famine.“Our hunter-gatherer ancestors were adapted to periods of feast and famine”Autophagy happens at a low level in healthy cells but becomes less efficient as we age. Sluggish autophagy lets the inside of cells gunk up and has been linked to many age-related diseases including cancer, and to the ageing process itself. Some researchers believe that the rise in health problems like cancer and type 2 diabetes has a lot to do with the fact that many people no longer go hungry.Although the initial findings came from research in mice, last year Longo and his colleagues published a study in around 100 people who either did the fasting mimicking diet for five days a month over three months, or continued with their normal diet for three months. The second group then tried the fasting diet. When people did the diet, they dropped body weight and fat, and ended up with lower blood pressure and lower levels of a hormone called insulin-like growth factor-1 (IGF-1), which is thought to play a role in ageing and disease. They also had lower levels of inflammation markers and cholesterol, among other benefits.For my little experiment, before I started the diet I underwent some blood tests, measuring levels of IGF-1, cholesterol and C-reactive protein (CRP), a marker of inflammation. I also had a body composition scan to measure any effects on my body fat at the Oxford Centre for Diabetes, Endocrinology and Metabolism. Fredrik Karpe, who runs the centre, is sceptical to say the least. “It is very important to critically investigate health claims for interventions giving great promises,” he says.One crucial question is how long you need to fast to kick-start these processes. After all, we know that famines are seriously bad for our health. Unfortunately, the answer is unclear. In a recent review of the health effects of fasting, Benjamin Horne, at Intermountain Heart Institute in Salt Lake City, Utah, concluded that no research has yet identified a set line between fasting and starvation, and that it probably varies a lot depending on the body you have to start with.Another effect of fasting is that the body starts to run out of glucose in the blood and glycogen stores in the liver, which causes a metabolic switch: the liver starts converting fats into ketone bodies for the muscles and brain to use as fuel, a process called ketosis. This is why fasting almost always causes weight loss of somewhere between 2.5 and 8 per cent. But how long you need to fast before the switch to ketosis occurs is unknown. Longo says that it takes at least three days and that shorter fasts, such as the 5:2 diet, don’t last long enough to make it happen.Mark Mattson at Johns Hopkins University in Baltimore, Maryland, who studies the effects of fasting on the brain, disagrees. “The liver holds maybe 700 calories-worth of glycogen and people’s general daily activity around the house burns maybe 70 calories an hour,” he says. If you’re not eating during that time, “you do the math, it’s around 10 hours”.Add exercise into the equation and the switch can happen even faster, says Mattson. A vigorous run can burn 100 calories in 10 minutes. Get your sports shoes on a few hours after your last meal and it won’t take long to hit ketosis, he says, leaving me wondering why I am sticking out a five-day fast instead.DDP/Camera PressAnother claim about fasting that almost tempted me in the past was the cognitive effect. Fasters regularly boast about clearer thinking and improved focus. Ulijaszek observed something similar with modern-day hunter-gatherers. While foraging with the Wopkaimin of Papua New Guinea in the 1980s, he noted that they never started the day with breakfast because they preferred to be hungry while hunting. “They said it made them lighter on their feet, and more aware of their surroundings,” says Ulijaszek.So far, though, no controlled studies have been done to investigate the link between fasting and cognition in humans, and the only hints about what might be going on come from mice. Mattson’s group found that switching to ketosis gives the brain a boost, stimulating the release of a chemical called BDNF, which promotes new connections between neurons and stimulates neurons to make more mitochondria, which generate energy. This could be the ticket to the mental clarity reported by fasters.His team is conducting a randomised study in human volunteers to find out whether these brain changes and associated effects are seen in people, with results expected in early 2019.Mental clarity certainly wasn’t something I experienced. My brain hit the wall early on day two and on most days during the fast I gave up trying to work and went back to bed. After day three my legs ached like I had the flu, apparently a sign of ketosis.It was difficult to believe that something that made me feel so awful could possibly be doing me good, especially since my test results from before the fast showed that I was already metabolically healthy. I had low levels of “bad” cholesterol, healthy blood sugar and fat levels and very low amounts of visceral fat – the stuff that sticks to our organs and which can be a risk factor for cardiovascular disease and diabetes. The body scan showed a fair amount of body fat (30 per cent), but nearly all concentrated on my hips and thighs, a pattern that has been linked to a lower risk of heart disease and diabetes.After five days of fasting, none of this had shifted. The body composition scan revealed that I had lost just over 1 kilogram in weight, 584 grams of which came from a loss of lean mass and only 168 grams from body fat. This was a bit of a shock – one selling point of the fasting mimicking diet is that it is supposed to target visceral fat while protecting lean mass. According to Longo, ketosis doesn’t target the visible wobbly bits, only fat around the organs. As I started off with little visceral fat, it instead targeted my lean mass, he says.“From a global health perspective, I find it quite a negative outcome,” says Karpe. “Half of your change was muscle. The fat regions have not changed much at all. That’s not what you intended.”Could it be that the lean mass loss was the result of autophagy? Mice put on Longo’s diet in middle age certainly seemed to have some kind of clear-out: their liver, heart and kidneys all shrank during the fast and they had a temporary cull in the numbers of some kinds of blood cells. All went back to normal within a few days of normal eating, heralded by an increase in markers of liver regeneration and tentative signs of muscle regeneration. The assumption is that the decrepit cells that were removed were replaced by newer, shinier versions.The evidence for autophagy and regeneration in human trials, however, is purely circumstantial. And we don’t know whether any new cells are healthier than what was lost. Longo concedes that this is something his team is still working on.When it came to blood markers of health and longevity, my results were similarly unimpressive (see “Graph”). The only marked difference was to the hormone IGF-1.In the ProLon trials, volunteers saw a significant reduction in IGF-1, which Longo says was still there three months after going back to a normal diet.“When people did the diet they had lower body weight, fat and cholesterol”Whether this adds up to increased longevity, however, is less clear. Epidemiological studies have linked both low and high IGF-1 levels to early death, with high IGF-1 levels linked to increased cancer risk and low IGF-1 to cardiovascular disease.Of course, my experiment of one isn’t very scientific, but it did get me wondering: for those of us who are healthy to begin with, does fasting truly offer a benefit beyond the fact you inevitably cut a few calories and lose a bit of weight?Michelle Harvie, the researcher at Manchester University in the UK who came up with the 5:2 diet, told me that based on current research, we just don’t know. “Intermittent dieting is a proven method for weight loss… we don’t know benefits or harms for healthy weight or underweight people,” she says.Many of the original studies of fasting diets involved overweight volunteers. Even in Longo’s study of 100 healthy volunteers, two-thirds started with a BMI of over 25, making the vast majority overweight or obese. So, while their health markers such as body mass index, visceral fat and blood pressure were all significantly reduced after doing the fast three times over three months, it isn’t clear whether this can be explained by the simple fact that they lost weight. Fasting also tends to mean eating a lot less animal protein and fat, which have both been linked to cancer, so this might also be responsible for the effects seen in trials.When a person is a healthy weight, their bodily clear-out functions work fine on their own, says Karpe. “Any normal physiological system, in a healthy, lean human being, eating well, exercising, doing what the body likes to do, all these things work. That’s why healthy people, who exercise and eat normal things, live longer than overweight people.”Susan Jebb, a nutrition scientist at the University of Oxford, agrees: “I am not aware of any high-quality evidence relating to intermittent fasting among people who are not overweight.”Time will tell whether humans benefit from fasting beyond weight loss. So I can’t help thinking that the wording printed on the box of ProLon that Longo sent me, which promises “rejuvenation from within”, is premature. We aren’t yet sure that the body clears out damaged cells and replaces them with something better.For my money, armed with the knowledge that most of my body fat is stored away from my organs and my blood results are entirely within the healthy range, I think I will stick with my normal diet and take my chances. Yes, my body could probably handle less wine and chocolate, but going hungry in return for a payoff that may never materialise? Life’s too short.The evidence for the benefits of fasting in healthy people is controversial. But it may turn out to work best when the body is already struggling.Animal studies suggest that while healthy cells hunker down during starvation, cancer cells don’t, making them more susceptible to chemotherapy. The fasting mimicking diet (see main story) was designed in a bid to see if the same applies to humans. Doctors weren’t keen for their already thin patients to fast, so Valter Longo at the University of Southern California in Los Angeles came up with a very low calorie diet instead. It is early days but initial results suggest that fasting can reduce the side effects of chemotherapy, without reducing its power to shrink tumours.Longo is now trialling his diet in people with multiple sclerosis (MS) to see if it can prompt the body to clear out the immune cells responsible for the disease and replace them with healthy versions. Again, animal studies look promising, but it remains to be seen if it works in people too.The evidence around diabetes prevention is more unclear. Some studies suggest that fasting might reduce the risk of type 2 diabetes, while research presented at this year’s European Society of Endocrinology meeting warned that intermittent fasting might damage the pancreas and increase the risk of the disease. Either way, people who already have the disease and are taking insulin should steer well clear. “If you do insulin plus fasting or fast-mimicking diet, you could actually kill someone,” says Longo.If you are unwell, you should speak to your doctor before embarking on a diet.This article appeared in print under the headline “The fashion for fasting”More on these topics: Caroline Williams is a consultant for New ScientistMagazine issue 3200, published 20 October 2018Previous articleStill waters: The world’s most extraordinary freshwater environmentsNext articleSupercharged geothermal energy could power the planet"}