{"id": "Neanderthals may have powered their bigger bodies by breathing deeper", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 30 October 2018                                J. Trueba/Madrid Scientific FilmsBy Colin BarrasThe Neanderthal rib cage was subtly different in shape from our own – and that could help explain how the heavily built ancient humans grabbed enough oxygen from the air to survive.We now know a huge amount about Neanderthals – we’ve even gained some insights into their sex lives – but there are still gaps in our understanding.The precise shape of the Neanderthal chest (or thorax) is one of those gaps, says Asier Gómez-Olivencia at the University of the Basque Country, Spain. “Ribs and vertebrae are fragile and have a limited fossil record,” he says.But there is one Neanderthal specimen that does have most of its spine and rib cage preserved – a 60,000-year-old skeleton that belonged to an adult male. It is named “Kebara 2” and it was found in Israel in the 1980s. Gómez-Olivencia and his colleagues have now generated an accurate 3D reconstruction of the Neanderthal rib cage using Kebara 2 as a guide.We know that Neanderthals had bodies that were stockier than ours, which suggests that they burned more energy than we do. “Heavier bodies require a higher caloric intake and a higher oxygen consumption,” says Gómez-Olivencia.This has led researchers to assume Neanderthals had a bigger chest than we do, to hold larger lungs. But Kebara 2’s rib cage was the same size as ours. “This was one of the big surprises of the study,” says Gómez-Olivencia.The Neanderthal rib cage was, however, subtly different in shape. When viewed from the front, it is wider at the bottom than a typical modern human rib cage.This could be significant, says Gómez-Olivencia. The lower rib cage is where the diaphragm lies. This sheet of skeletal muscle contracts when we breathe. Gómez-Olivencia and his colleagues think that if Neanderthals had a wider – and larger – diaphragm, it could have sucked in stronger inhalations.This means the Neanderthals’ lungs could have expanded more with each breath, taking in more air – and more oxygen. “The wider and larger lower thorax would cope with [their] oxygen necessity without any problem,” says Gómez-Olivencia.Journal reference: Nature Communications, DOI: 10.1038/s41467-018-06803-z More on these topics: A shorter version of this article was published in New Scientist magazine on 10 November 2018"}