{"id": "Monkeys and dogs judge humans by how they treat others", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 10 February 2017                                SolStock/GettyBy Sam WongBe nice – or your dog may judge you. Both pets and monkeys show a preference for people who help others, and this might explain the origins of our sense of morality.Studies involving babies have previously shown that by the age of one, humans are already starting to judge people by how they interact. This has led to suggestions that children have a kind of innate morality that predates their being taught how to behave.Comparative psychologist James Anderson at Kyoto University and his colleagues wondered whether other species make social evaluations in a similar way.They began by testing whether capuchin monkeys would show a preference for people who help others. The capuchins watched an actor struggle to open a container with a toy inside.Then this actor presented the container to a second actor, who would either help or refuse to assist. Afterwards, both actors offered each capuchin food, and the monkey chose which offer to accept.When the companion was helpful, the monkey showed no preference between accepting the reward from the struggler or the helper. But when the companion refused to help, the monkey more often took food from the struggler.The team also investigated capuchins’ attitude to fairness. In this test, two actors began with three balls each. Actor A requested balls from actor B, who handed over three balls.Then actor B requested balls from A, and A either gave three balls back or no balls. Lastly, both actors offered the monkeys a reward as before.The monkeys had no preference when actor A gave back three balls, but chose actor B more often when A had not returned the balls.Finally, the researchers tested whether dogs preferred people who helped their owner. Each owner tried to open a container then presented it to one of two actors.This actor either helped or refused to do so, while the other actor was passive. Then the two actors offered the dog a reward and it chose between them.The dogs had no preference when the first actor had helped their owner, but were more likely to choose the passive actor if the first one had refused to help.Anderson thinks the results show that monkeys and dogs make social evaluations in a somewhat similar way to human infants. “If somebody is behaving antisocially, they probably end up with some sort of emotional reaction to it,” he says.Monkeys in the wild are likely to use similar processes to decide which members of their group they can cooperate with, says primatologist Frans de Waal of Emory University, Georgia, who has written about the origins of morality.“Chances are that if these animals can detect cooperative tendencies in human actors, they also can in their fellow primates,” he says.Dogs’ long relationship with humans means they’ve evolved to be extremely sensitive to our behaviour – not just to the dog, but also to other humans.And our own sense of morality may even have its roots in these sorts of primitive evaluations of others.“I think that in humans there may be this basic sensitivity towards antisocial behaviour in others. Then through growing up, inculturation and teaching, it develops into a full-blown sense of morality,” says Anderson.The capacity to make evaluations of others could help to stabilise complex social systems by enabling individuals to exclude bad social partners, says Kiley Hamlin at the University of British Columbia, Canada. “This exclusion not only means that individuals who make social evaluations can themselves avoid harmful social interactions, but it also could serve to discourage individuals from behaving badly in the first place, as presumably they do not wish to be excluded from the social system,” she says.De Waal sees a strong link between morality and reputation. “Human morality is very much based on reputation building, because why would you try to be good if no one cares?” he says. “I don’t think you can conclude that it makes the monkeys moral beings, but ‘image scoring’, as reputation building is sometimes called, provides an important key mechanism.”Journal reference: Neuroscience & Biobehavioral Reviews, DOI: 10.1016/j.neubiorev.2017.01.003Read more: Bonobos know when others are being treated unfairly – and react; Tracing the roots of human morality in animals; A Natural History of Human Morality: Why being good is a miracleMore on these topics: A shorter version of this article was published in New Scientist magazine on 18 February 2017"}