{"id": "Skin tans the most when spending every other day out of the sun", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 25 October 2018                                Graham Jepson/Alamy Stock PhotoBy Alice KleinSkin tans most when you spend every other day out of the sun, according to a new study. This has the added effect of reducing DNA damage and premature ageing.Sunlight contains ultraviolet (UV) rays that can damage DNA and lead to premature ageing and skin cancer. To protect against this, our skin produces melanin, a dark pigment that acts like a natural sunscreen. The pigment starts to form within hours of sunlight exposure and gives the skin a tanned look.Carmit Levy at Tel Aviv University in Israel and her colleagues measured how much melanin mice produced when they were exposed to UV light every day, every second day, or every third day.They assumed that melanin production would be highest in the mice exposed to the most frequent UV periods. “Similarly, you’d think that someone who went to the beach every day would tan more than someone who went every second day,” says Levy.However, to their surprise, they found that the mice that tanned the most were those exposed to UV light every second day. The extra pigmentation they produced meant their skin also suffered the least DNA damage.The researchers then repeated the experiment using human skin samples and found the same pattern.Together, the findings suggest that skin cells need 48 hours between sun exposure periods to build up their maximum defences, says Levy. “It’s like your muscles – you need to give them time between gym sessions to let them recover,” she says.Her team is now trying to work out the evolutionary reason behind the two-day melanin cycle. “It’s strange because ancient humans would have been exposed to sun most days, so we don’t know why it takes 48 hours to work,” she says.One possibility is that it is tied to vitamin D, which is also released after sunlight exposure and remains elevated in the blood for 48 hours. “We think the two systems might be linked,” says Levy.\nJournal reference: Molecular Cell, DOI: 10.1016/j.molcel.2018.09.022More on these topics: A shorter version of this article was published in New Scientist magazine on 3 November 2018"}