{"id": "A new DNA sequencing service wants to reward you for sharing your data", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 15 November 2018                                Deanne Fitzmaurice/NGS/AlamyBy Alice KleinA new company co-founded by Harvard geneticist George Church wants to let people learn about their genome for free. The blockchain-secured service will sequence people’s genomes without charging a fee, and offer rewards to those who let third parties access their data.Consumers can already get their DNA sequenced by companies like 23andMe and Helix, but it typically costs around $200. If a user consents, their results can be sold to third parties such as pharmaceutical firms, but users don’t receive any compensation or reward for this.Nebula Genomics, which launches today, is intended to connect consumers interested in exploring their genetics with researchers looking for large DNA datasets to assist with drug development. Co-founder George Church is a well-known pioneering geneticist at Harvard University, whose other ambitions include bringing back the woolly mammoth, editing our genes to fix diseases, and reversing ageing.The service offers to sequence your entire genome for free and secure it using a blockchain. You can then share your genomic data anonymously with companies or research institutes of your choosing, in return for “Nebula credits”.Users will also receive credits for sharing other health information, like whether they have diabetes or arthritis. This should help researchers identify patterns between certain gene variants and diseases, and potentially identify novel drug targets, says the company’s co-founder Dennis Grishin.The credits earned by users will allow them to access other services on the Nebula platform. For example, they could be used to purchase information about a user’s risks of developing certain diseases like breast cancer or Alzheimer’s disease based on their genomic data.For the time being, users won’t be able to convert the credits into hard cash. Pharmaceutical companies are currently prepared to pay upwards of $1000 for individual genomes, but Nebula hasn’t decided yet whether to allow cash transactions, says Grishin.Jacqueline Savard at Deakin University in Australia warns that some drug companies may use people’s data in ways they aren’t aware of or can’t foresee. “People should be free to do what they want with their genomic data,” she says. “But they need to be given clear information about how it will be used so they can make the right decisions.”More on these topics: "}