{"id": "Pluto’s weird ridges may be glacial landforms unlike any on Earth", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 12 November 2018                                NASA/Johns Hopkins University Applied Physics Laboratory/Southwest Research Institute/Alex ParkerBy Leah CraneStrange ridged landscapes on Pluto may have been left behind as ancient glaciers retreated. When the New Horizons spacecraft flew past the dwarf planet in 2015, it revealed an astonishing variety of terrains. Some of these weird textures probably came from ice debris left behind by receding glaciers.So-called washboard and fluted terrains consist of parallel ridges a few kilometres across and less than 100 metres tall. They are unlike anything we see on Earth, so Oliver White at the SETI Institute in California and his colleagues used maps and images from New Horizons to figure out how they came to be.They found that the ridged areas coincided with a fault on the surface from ancient tectonic activity. An analysis of the craters in the area revealed that the rolling hills were formed about four billion years ago, early in Pluto’s history and just after the formation of the basin of nearby Sputnik Planitia, the dwarf planet’s heart-shaped plains of nitrogen ice.Prior studies have found that before the formation of Sputnik Planitia, Pluto probably hosted glaciers of nitrogen ice that later sublimated away, turning from a solid into a gas and then condensing in the colder plains.These ridged areas are proof glaciers used to be spread across Pluto, says White. He and his colleagues suggest that washboard and fluted terrains are built up out chunks of water ice that broke off of Pluto’s crust because of tectonic activity. Because water ice is less dense than nitrogen, these chunks would float to the top of the glacier, then be left behind as the glaciers receded.The ridges have similar sizes and shapes to pitted terrains found elsewhere on Pluto, which form when nitrogen ice sublimates away, so the researchers say that these two alien landscapes may be connected.“A chunk of water ice would bob around until it reaches the wall of one of these pits, and it would slide down,” says White. “Eventually the nitrogen ice would sublimate away, so the water ice material filling the pits would be left behind, draped across the landscape.”Not all of the mysteries are hammered out quite yet — the team were unable to figure out why the ridges point in the direction that they do — but nevertheless it’s a step towards understanding Pluto’s past.Journal reference: Nature Astronomy, DOI: 10.1038/s41550-018-0592-zMore on these topics: A shorter version of this article was published in New Scientist magazine on 17 November 2018"}