{"id": "Smartwatches know you’re getting a cold days before you feel ill", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 12 January 2017                                WestEnd61/REX/ShutterstockBy Alice KleinOnce we had palm-reading, now we have smartwatches. Wearable tech can now detect when you’re about to fall ill, simply by tracking your vital signs.Michael Snyder at Stanford University in California experienced this first-hand last year. For over a year he had been wearing seven sensors to test their reliability, when suddenly they began to show abnormal readings. Even though he felt fine, the sensors showed that his heart was beating faster than normal, his skin temperature had risen, and the level of oxygen in his blood had dropped.“That’s what first alerted me that something wasn’t quite right,” says Snyder. He wondered whether he might have caught Lyme disease from a tick during a recent trip to rural Massachusetts.A mild fever soon followed, and Snyder asked a doctor for the antibiotic doxycycline, which can be used to treat Lyme disease. His symptoms cleared within a day. Subsequent tests confirmed his self-diagnosis.Snyder and his team have now demonstrated that smartwatches can be used to detect the first signs of illness. More than 40 volunteers wore the devices for up to two years, which continuously monitored their pulse and skin temperature.The team found the devices would record unusually high heart rates, and sometimes higher skin temperatures, up to three days before the volunteers had symptoms of a cold or other infection.“Once these wearables collect enough data to know what your normal baseline readings are, they can get very good at sensing when something’s amiss,” says Snyder. “We think that if your heart rate and skin temperature are elevated for about 2 hours, there’s a strong chance you’re getting sick.”Continuous tracking of your vital signs is more informative than having a doctor measure them once a year and comparing them with population averages, Snyder says. “Heart rate, for example, varies a lot so population averages don’t tell you much,” he says.Snyder’s team is now hoping to build algorithms that will enable smartwatches to notify wearers when they might be falling ill. “I’m predicting that your smartwatch will be able to alert you before you get sick, or confirm that you’re sick if you’re feeling a bit off,” he says. “If your watch says you’re getting something, you’ll know to go lie down instead of going out drinking and dancing.”“It’s really exciting to consider how much earlier we could intervene to prevent somebody becoming seriously ill,” says Meredith Makeham, chief medical adviser to the Australian Digital Health Agency. But she warns that patients and doctors should be aware of a device’s error rate, and whether it is being used in the recommended way.Nathan Pinskier, chair of the eHealth committee of the Royal Australian College of General Practitioners in Melbourne, says the technology could lead to unnecessary worry. “One of the major things we manage in general practice is anxiety – you get a lump or you feel a bit unwell, and you feel anxious about it,” he says. “There’s the risk that people will rush off to their GP because they have all these unexplained findings.”Moreover, in many cases, knowing you might be about to get sick does not help you avoid it, Pinskier says. “If you’re going to get the flu, you’re going to get the flu.”Journal reference: PLOS Biology, DOI: 10.1371/journal.pbio.2001402A shorter version of this article was published in New Scientist magazine on 21 January 2017"}