{"id": "Our best planet-hunting telescope has come to the end of its mission", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 30 October 2018                                NASABy Leah CraneThe Kepler Space Telescope’s planet-hunting days are over. NASA announced on 30 October that the spacecraft has run out of fuel and will soon be shut down completely.Since its launch in 2009, the observatory has found more than 2600 confirmed planets beyond our solar system and many more exoplanet candidates that have yet to be confirmed. Kepler worlds account for about 70 per cent of the total exoplanets we’ve confirmed.“Before Kepler, we didn’t know if planets were common or rare in our galaxy,” says NASA astrophysics division director Paul Hertz. Now we know that there is a diverse abundance of planets, both similar and different to those in our solar system. “Because of Kepler, what we think about our place in the universe has changed.”Its original mission was set to last only three and a half years, but despite the failure of two reaction wheels used for pointing the spacecraft in 2012 and 2013, it has been operating for more than nine and a half years.The end of Kepler is not unexpected – the craft has been intermittently in sleep mode since late September due to trouble pointing it accurately. These issues were probably related to the low levels of fuel that have now run out completely.“We collected every bit of possible science data and returned it all to the ground safely,” says Kepler system engineer Charlie Sobeck. “We didn’t have a drop of fuel left for anything else.” Now the team will power down Kepler and leave it to float in orbit around the sun, at a safe distance from Earth. Researchers will continue to comb through the data Kepler captured.The Transiting Exoplanet Survey Satellite (TESS) was launched in April 2018 and has already begun to take on the mantle of Earth’s planet-hunter. Over the course of its lifetime, TESS is expected to follow up on the Kepler planets that have not yet been confirmed and find more than 20,000 new worlds.More on these topics: "}