{"id": "Data suggests 60 per cent of babies aren’t breastfed after 6 weeks", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 24 October 2018                                onebluelight.com/Alamy Stock PhotoBy New Scientist staff and Press AssociationAs few as four in ten mothers still breastfeed their babies after they are 6 weeks old, according to new figures from Public Health England. This is in contrast to the the World Health Organisation’s recommendation that mothers should exclusively breastfeed their babies for the first six months of life.Rates for breastfeeding babies between 6 and 8 weeks old has stayed relatively stable in England for the last four years only varying by a couple of percent each year, according to data from NHS England. However, the rates vary significantly by region.Eight in 10 babies were being breastfed between 6 and 8 weeks old in Tower Hamlets, London compared to less than two in 10 in Knowsley, Merseyside.In many cases women are unable to continue breastfeeding even if they want to, and that so few are able to meet the guidelines suggests that in their current state they may be unrealistic for many women.The NHS Start for Life website says that there are many advantages of breastfeeding, including health benefits for both babies and mothers. Breast milk protects babies from infections and provides a “perfect balance” of vitamins and nutrition for infants, according to the website.Breastfed babies have a lower chance of cot death and childhood leukaemia, they also have a lower risk of allergies and are less likely to develop diabetes or become overweight when they are older. Benefits for women include reducing their risk of breast cancer, ovarian cancer, osteoporosis, diabetes and cardiovascular disease.More on these topics: A shorter version of this article was published in New Scientist magazine on 3 November 2018"}