{"id": "Why Earth’s water could be older than Earth itself", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Feature 31 October 2018                                How did water survive Earth's searingly hot birth? A radical new answer turns planetary history on its head – and could revolutionise the search for alien lifeVince Cavataio/plainpictureBy Natalie StarkeyMILTON KEYNES has the dubious distinction of being the town that supposedly has the most roundabouts in the UK. It is not the sort of place you might expect to be at the centre of a profound debate about Earth’s deep history.And yet, on its outskirts there is a lab housing a seemingly haphazard set of metal tubes, canisters, wires, cables and control boards, assembled into a piece of apparatus the size of a small car. My colleagues and I have used it to make the most precise measurements ever of rocks bearing traces of Earth’s earliest atmosphere. We believe that those measurements may put to bed a perplexing scientific mystery.This planet is a lush world of rivers, lakes and streams. But it shouldn’t be, according to our traditional interpretation of Earth’s past. Our measurements at the Open University in Milton Keynes provide a strong indication that this explanation is past its sell-by date. The true story of how Earth got its water looks to be far stranger. If we are right, it means water, and potentially life that thrives in it, is probably far more widespread in the universe than we dared dream.To understand why the presence of so much water on Earth is so unlikely, we need to go back more than 4.6 billion years. The young sun is shining, and encircling it is a maelstrom of gas and dust that will clump into the planets. Any water exists as ice in interstellar space. If any of that ice found itself in the inner part of the solar system, where …To continue reading this premium article, subscribe for unlimited access.Existing subscribers, please log in with your email address to link your account access.Quarterly by Direct DebitInclusive of applicable taxes (VAT)"}