{"id": "Mantis shrimps punch with the force of a bullet – and now we know how", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 18 October 2018                                Maryam Tadayon / Biological & Biomimetic Materials LaboratoryBy Leah CraneThe mantis shrimp packs a mean punch, smashing its victims’ shells with the force of a .22 caliber bullet. But that’s not because it has particularly powerful muscles – instead of big biceps, it has arms that are naturally spring-loaded, allowing it to swing its fistlike clubs to speeds up to 23 metres per second.We know that the key part of a mantis shrimp’s punch is a saddle-shaped structure on the arm just above the shrimp’s club. This shape works a bit like a bow and arrow, says Ali Miserez at Nanyang Technological University in Singapore: the muscles pull on the saddle to bend it like an archer’s bow, and when it is released that energy transfers into the club.Miserez and his colleagues used a series of tiny pokes and prods, as well as a computer model, to examine exactly how the shrimp’s saddle holds all that energy without snapping. They found that it works because of a two-layer structure. The top layer is made of a ceramic material similar to bone, and the bottom is made of mostly plastic-like biopolymers.When the saddle is bent, the top layer gets compressed and the bottom layer is stretched. The ceramic can hold a lot of energy when it is compressed, but is brittle when bent and stretched. The biopolymers are stronger and stretchier, so they hold the whole thing together.“It explains how the shrimps’ appendage breaks things without breaking itself,” says Foivos Koukouvinis at City University of London in the UK.The researchers also found that the saddle shape itself is important: a strip cut out of a mantis shrimp saddle could not store nearly as much energy, and the strain was concentrated in certain spots rather than spread out evenly. The saddle had a smooth distribution of strain, so no single spot was more likely to break.Materials designed based on our knowledge of these shrimp shapes may be useful in microrobots, says Ming Dao at the Massachusetts Institute of Technology. “It’s more or less like a spring,” he says. “But it should be able to be made smaller in dimension than a spring, because you don’t have any gaps, and it should have a much higher energy density than a spring.”Springy saddles could be used in tiny robots that can jump or act as tiny battering rams, breaking apart small obstacles just as mantis shrimps break the shells of their prey.Journal reference: iScience, DOI: 10.1016/j.isci.2018.08.022 More on these topics: A shorter version of this article was published in New Scientist magazine on 27 October 2018"}