{"id": "Your brain is like 100 billion mini-computers all working together", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 18 October 2018                                SPL/AlamyBy Clare WilsonEach of our brain cells could work like a mini-computer, according to the first recording of electrical activity in human cells at a super-fine level of detail.The study has revealed a key structural difference between human and mouse neurons that could help explain our superior powers of intelligence.Brain cells, or neurons, communicate by firing electrical impulses down their length, which researchers can detect and measure by putting microscopic electrodes inside them. Most such studies have been done on rodent neurons kept alive in a dish, where the cells can live for several hours. But Mark Harnett at the Massachusetts Institute of Technology in Cambridge wanted to see how human neurons compared with those of mice, so he used live tissue obtained from surgeons who were removing small chunks of brain from people with epilepsy.While people have recorded signals from inside human neurons before, it has always been inside the main “trunk” of their tree-like structure. Harnett’s team used thinner electrodes to record activity inside the fine branches, known as dendrites, at the end of the trunk.Each neuron may have about 50 dendrites, and each dendrite has hundreds of synapses, or connection points with other neurons. It’s signals running across these synapses and into the dendrite that make it more or less likely that the dendrite itself will fire an electrical signal along its length.Compared with mice, the dendrites of human neurons turn out to have fewer ion channels, molecules studded in the cell’s outer membrane that let electricity flow along the dendrite.While this might sound bad, it could give greater computing powers to each brain cell. Imagine a mouse neuron: if a signal starts down one dendrite, there are so many ion channels to conduct electricity that the signal will probably continue into the main trunk of the neuron. In a human neuron, by contrast, it’s less certain that the signal will conduct into the main trunk: whether it does will probably depend on activity in other dendrites, says Harnett.This lets the thousands of synapses on each neuron’s dendrites collectively determine the final “decision” on whether the main branch should fire. “They’re looking for specific patterns of input to come together to produce [a signal],” says Harnett.Journal reference: Cell, DOI: 10.1016/j.cell.2018.08.045More on these topics: A shorter version of this article was published in New Scientist magazine on 27 October 2018"}