{"id": "Supercharged geothermal energy could power the planet", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Feature 17 October 2018                                The next generation of geothermal plants will unlock more of Earth's bountiful, underground energy and could allow the technology to finally fulfil its promiseArctic-Images/GettyBy Julia RosenTHE Reykjanes peninsula juts out of the south-western tip of Iceland like a hitch-hiker’s thumb. Most visitors glimpse it from a plane, as they swoop down onto the runway at Keflavík airport, or through the mist at the Blue Lagoon – a popular hot spring. It is an otherworldly landscape of rumpled volcanic rocks and stout cinder cones. The most common signs of life: tenacious mosses in varying shades of green, and the odd wandering sheep.Here, the tectonic seam that runs along the bottom of the Atlantic, belching out new ocean crust between North America and Europe, runs aground. That’s what makes this place so attractive to people like Guðmundur Olaf Friðleifsson, chief geologist at Icelandic energy company HS Orka. Just a few kilometres beneath their feet, the staggering heat of a volcano bubbles away. All they have to do to harness its power is drill.Iceland already has plenty of geothermal energy, but this project is different. Friðleifsson and his team are tapping into temperatures and pressures higher than anything we have used before, and building on our growing ability to extract more of Earth’s heat. What they are doing could help revolutionise geothermal energy and boost this overlooked source of renewable power to a prominent place in the global energy system. It has the potential to unlock unprecedented amounts of energy, and make it accessible to places far from the volcanic fields of Iceland. It could make the dream of abundant geothermal power a reality.So far, geothermal energy hasn’t taken off like other renewables. More than a century after humans started using Earth’s hot water and steam to produce power, geothermal provides less than 1 per cent of global electricity. There is no problem with supply: the depths of our planet still smoulder from its violent accretion and the slow burn of radioactive decay. The core is a searing 6000°C, and the heat contained in the upper 3 kilometres of the crust would be enough to meet the world’s energy demand thousands of times over.Geothermal energy also sidesteps the problems that plague so many other clean sources of energy. It is always available, regardless of whether the wind blows or the sun shines. Alongside nuclear and hydropower, which have issues of their own, geothermal offers an attractive source of clean, reliable baseload electricity. But it has high start-up costs and has historically been restricted to Iceland and other hotspots. The challenge now is to increase the power and availability of geothermal energy so that it can truly compete.The world’s first geothermal power generator was Italian, built in the verdant hills of Tuscany in 1904. The seething, sulphurous hot springs of Larderello attracted Roman visitors millennia ago, and the Devil’s valley, as it is sometimes called, supposedly shaped Dante’s vision of hell. But others saw something else in the hissing steam: untamed energy. Today, 800 megawatts of power flow from the Larderello fields, supplying 10,000 residential and industrial consumers.Yet humans are still just scratching the surface. Conventional technologies can only exploit geothermal energy in spots like Larderello, where heated water runs through a natural plumbing system easily accessible from the surface. But the Geothermal Energy Association, a US trade group, estimates that countries have developed just 7 per cent of the world’s hydrothermal potential.Over the past few decades, however, researchers have been exploring ways to extract even more heat, including in regions not blessed with ideal geology. This new approach, known as enhanced, or engineered, geothermal systems (EGS), can mean adding fluid to dry rocks to transport heat to the surface and generate steam, or fracturing impermeable formations so that liquid can flow through the hot rocks, heating up along the way. “It’s taking what nature gives you and figuring out how to make it work,” says Jeff Tester, a geothermal expert at Cornell University in New York.EGS could crack open massive stores of geothermal heat. A 2006 report led by Tester found that, in the US alone, the technology could unlock 130,000 times as much energy as the country uses each year. Realistically, we will always need other sources of energy, and are likely to exploit just a fraction of geothermal’s potential. But, says Lauren Boyd at the US Department of Energy, EGS has another important advantage: it will make geothermal energy available outside existing hydrothermal systems. “It’s feasible everywhere,” she says.The basic elements of EGS were first tested at an experimental site in New Mexico in the 1970s. Since those early days, “we have made leaps and bounds”, says Boyd. We know more about what’s going on underground, and have better drilling technology, some borrowed from advances in the oil and gas industry. But even so, engineers still face significant hurdles, says Boyd, and only a handful of commercial EGS sites operate today.For one thing, creating fractures in controlled and predictable ways remains a practical challenge, says Gioia Falcone, an engineer at the University of Glasgow, UK. Sometimes the cracks close up again under the immense pressure of the overlying rock. At other times, the rock cracks too much, and water flows too fast to heat up, she says.EGS can also have more serious consequences. In 2006, a commercial project in Basel, Switzerland, triggered a magnitude-3.4 earthquake that rattled the city. No one was hurt, but it made many residents nervous – they knew a magnitude-6 quake had levelled the city in the Middle Ages. It isn’t the only case, either. In 2017, an EGS project in Pohang, South Korea, was the likely source of a magnitude-5.5 earthquake that caused $52 million in damage. Both projects were eventually shuttered.There is no doubt that EGS, like mining, fracking for oil and gas, and disposing of waste water, can cause earthquakes, says Corinne Layland-Bachmann, an engineer at Lawrence Berkeley National Laboratory in California who studied the Basel case. However, Layland-Bachmann says the risk of a serious quake from geothermal production is low. She thinks incidents like those at Basel and Pohang can be avoided if developers choose EGS sites wisely and reduce injection rates if tremors begin.But perhaps the biggest barrier to the approach has been economic. Since Tester’s report came out, the price of solar and wind energy has dropped, and cheap natural gas has flooded the market, making it hard for geothermal to expand, says Trenton Cladouhos at AltaRock Energy, a Seattle-based geothermal developer. “I’ve been working on EGS now for 10 years,” he says. “The market for geothermal just has been flat.”So AltaRock and others have focused their efforts on a supercharged version of geothermal instead. The idea they are pursuing has its roots in a series of accidents from the 1980s, when geothermal engineers unexpectedly encountered super-hot conditions. The first incident happened at Larderello, where a well struck 380°C water just shy of 4 kilometres down. The drillers were totally unprepared for this heat, as were the materials they had used to make their well. They abandoned it when it became clear the casing wouldn’t hold. Another hole, drilled nearby a few years later, hit the same reservoir and blew out in a massive explosion of steam.In 1988, something similar happened in Iceland. But Friðleifsson, who had recently completed his PhD on another Icelandic volcano, wasn’t surprised by the find. He also realised that, if researchers could figure out how to manage these fluids, they could capitalise on a geothermal bonanza.That is because, above 374°C and 221 bars of pressure, water transforms into a supercritical fluid. As the temperature and pressure rise, says Friðleifsson, water gets lighter and steam gets heavier until they become one phase. And it’s a totally different beast.Supercritical water at 400°C contains five times as much energy as water at 200°C in a typical geothermal well. It also transfers energy twice as efficiently and has a lower viscosity, flowing out of the ground more easily. In 2003, Friðleifsson and Wilfred Elders, now an emeritus professor at the University of California, Riverside, who together lead the geothermal project at Reykjanes, calculated that a well producing supercritical fluid could generate ten times more energy than a conventional one.Cladouhos says that could make the economics of geothermal work out for companies like his. It costs more to drill to supercritical depths, but the increased energy production should more than compensate, he says. “EGS is really difficult to do, so you might as well do it in an area where you know the economics are going to be helpful.”Johann S. Karlsson/GettyNo one has been able to demonstrate the increased payout of supercritical geothermal so far, but in Iceland they are getting close. In 2009, Friðleifsson and Elders’s team reached supercritical conditions when it accidentally drilled into a magma chamber at the Krafla volcano. For two years, that well produced a jet of superheated steam, but then a valve failed and it had to be sealed.The Icelandic group then began the project at Reykjanes, where they drilled a well 4.6 kilometres down to access fluids as hot as 600°C. For the past year, engineers have been pouring cold water down the well, which cracks the rocks and is sometimes used in EGS to increase a reservoir’s permeability. Now, the team is just waiting for the well to heat up again before they start testing it.Meanwhile, a new supercritical well has been completed at Larderello. “The first time, we met supercritical conditions by chance,” says Sandra Scalari, at Enel Green Power, which runs the Larderello site. But this time, she says, “it was intentional”. There are also supercritical projects planned in Japan, Mexico and New Zealand, and AltaRock is looking for funding to deepen an existing well at Newberry volcano in Oregon. The rest of the world is catching up, says Friðleifsson. “The only difference between us and them is that Iceland is in the lead.”Like at Reykjanes, these projects will probably use EGS, and share the same risks and challenges – plus others associated with working in extreme conditions. “The drill bits basically just start to deform and melt,” says Cladouhos. After that, engineers must figure out how to line the wells. Standard casing materials aren’t designed for such high temperatures, or for the corrosive fluids that bubble up from the depths. These eat away at valves and cement coatings, which expand and contract in the changing temperatures, risking blowouts. Finally, the standard electronics used to measure conditions in the well just get fried. “The equipment is usually made for the oil and gas industry,” says Enel’s Massimo Luchini, and it was never designed to handle such intense heat.There are geological uncertainties too, says Thomas Reinsch, an engineer at the Delft University of Technology in the Netherlands. The tools usually used to probe Earth’s depths – like tracking how seismic waves move through the crust – have not been calibrated for rocks at extreme temperatures and pressures, because it is hard to recreate such conditions in the lab. That means the results can be hard to interpret. “We don’t know what kind of geology is down there,” says Reinsch. “We are drilling basically into the dark.” All in all, developing supercritical geothermal is a monumental challenge. But Friðleifsson is optimistic the teams will ultimately prevail. “You can send a rocket to the moon,” he says. “Compared to that, it’s a piece of cake to drill into the ground.”For now, scientists and energy companies are mostly pursuing EGS and supercritical geothermal in places where it is relatively easy to reach the temperatures they need – like Iceland, Italy and the American West. But eventually, many hope these techniques will allow geothermal energy to spread.For the right price, EGS could make geothermal energy available across much of the world. Even in places with cooler crust, it could be used to extract heat for buildings, says Tester. And supercritical geothermal could unleash enormous energy reserves in volcanic areas around the world, says Luchini. “There is a big potential.”Ample supercritical resources in one place could even be enough to power surrounding countries, says Falcone. There has been talk, for instance, of Iceland supplying power to 1.6 million homes in the UK. “Electricity is transportable,” she says.But could high-powered supercritical projects ever be feasible in all areas? Reaching such conditions in places with cooler, thick crust, like the US Midwest or eastern Europe, would require boring through more than 15 kilometres of crust, 3 kilometres deeper than any drill has previously gone. “I wouldn’t say that we’re going to see supercritical geothermal developed in Kansas in the near future unless you have some magical way of really reducing the cost of really deep drilling,” says Elders.But Cladouhos never says never. Engineers are exploring novel drilling methods, using energy waves, high-pressure fluid jets or lasers instead of metal drill bits. He is holding out hope that a breakthrough will make supercritical geothermal ubiquitous. “Maybe the 20-year plan would be supercritical EGS anywhere,” he says.Even if Cladouhos’s dream doesn’t come to pass, the potential benefits of supercritical wells could still help geothermal become a major global player, says Falcone.That future may not be so far off. Friðleifsson’s team plans to get the Reykjanes well flowing in early 2019, eventually linking it to a nearby power plant to make the first commercial supercritical site in the world. Even if someone beats them to it, says Friðleifsson, a geothermal revolution is coming. “It is not a question of if, but when.”This article appeared in print under the headline “Full steam ahead”More on these topics: Julia Rosen is a journalist in Portland, OregonMagazine issue 3200, published 20 October 2018Previous articleFasting power: Can going without food really make you healthier?Next articleAI alchemists spit out the recipe for any molecule you want to make"}