{"id": "Memory FAQ: Answers to the common questions that baffle us all", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Feature 24 October 2018                                Why can’t we remember being babies? Does closing your eyes help you recall? Why can’t I remember what I did 5 seconds ago? What is photographic memory? And moreHans Neleman/GettyBy Yvaine Ye and Tiffany O'CallaghanHang, on – you just left the house, but did you lock the door? When it comes to these habitual behaviours, your body knows what to do without the need for conscious thought. The brain no longer encodes the details of a repeated behaviour, so while you remember how to lock the door, there’s no specific memory of when you last did it.This ability to autopilot can be beneficial, freeing up attention for more important things. The danger comes when this “habit memory” takes over when it isn’t supposed to, which can lead to mistakes like forgetting to drop a child off and leaving them in the car instead. Yvaine YeInfants are constantly learning, but only a handful of people have memories from before the age of 2. That’s because parts of the brain critical for longer-term memory are still immature. So babies can form memories – a 6-month-old can recall how to do certain tasks for up to three weeks – but holding onto them is tricky.As the brain begins to mature, that neural machinery gets more efficient and memories start to stick – until the age of 7, when there’s a sudden dip. Children recall far more about earlier events in their lives when asked before they are 7 than just a year later. This sudden erasure, known as …To continue reading this premium article, subscribe for unlimited access.Existing subscribers, please log in with your email address to link your account access.Quarterly by Direct DebitInclusive of applicable taxes (VAT)"}