{"id": "An extinct monkey evolved to live like a sloth in the Caribbean", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 12 November 2018                                Minden Pictures / Alamy Stock PhotoBy Michael MarshallAbout 11 million years ago, monkeys somehow crossed the sea from South America to the island of Jamaica in the Caribbean. There they evolved into a new species that was unlike any other known monkey. It’s a striking example of how living on an island can transform a species. The details have been revealed by preserved DNA.The first remains of Xenothrix mcgregori were discovered in Long Mile Cave, Jamaica in 1920. The few bones found reveal a highly unusual monkey, with relatively few teeth and leg bones similar to those of a rodent.“What they suggest is a very slow-moving, perhaps even sloth-like lifestyle, which is perhaps not unexpected in an animal living on an island with few predators other than large birds,” says Ross MacPhee of the American Museum of Natural History in New York. Some extinct Madagascan lemurs also evolved a similar slow-moving lifestyle.Ever since it was described in 1952, X. mcgregori has been an enigma. It was related to South American monkeys, but it was unclear which group it belonged to or when its ancestors reached Jamaica. Several suggestions had been made based on the bones, but the monkey was so unusual it was impossible to be sure. “It’s been all over the place,” says MacPhee.Lorraine Meeker (American Museum of Natural History, New York)To clear up the mystery, MacPhee and his colleagues obtained DNA from two preserved X. mcgregori bones. They recovered the entire mitochondrial genome – which animals only inherit from their mothers – and seven chunks of the nuclear genome.The team compared these samples of DNA with the equivalent sequences from 15 different groups of South American primate. They found that X. mcgregori belonged to a group called the titi monkeys. These monkeys live in forests, eat fruit and do not have prehensile tails.X. mcgregori does not look like a typical titi monkey, though, so arriving on the island evidently forced its ancestors to evolve. “The selective pressures on them must have been just extreme,” says MacPhee. “It looks like it got thrown into the mixer.” Island species often evolve rapidly, because there are few large predators but also little fresh water.Xenothrix split from its closest South American relatives roughly 11 million years ago, suggesting that is when its ancestors reached Jamaica. They must have somehow crossed the sea, perhaps on a raft of vegetation.Other primates were present in the Caribbean rather earlier, from about 18 million years ago. It seems several groups made the crossing at the different times, establishing a unique ecosystem. Unfortunately, most of the Caribbean’s native species died out when humans first arrived on the islands, so are only known from preserved remains.X. mcgregori died out about 900 years ago. There is no hard evidence as to why. “What we think but cannot demonstrate is that Xenothrix, like hundreds of other species, was a victim of either direct or indirect impacts by the first humans who got there,” says MacPhee.Journal reference: PNAS, DOI: 10.1073/pnas.1808603115More on these topics: A shorter version of this article was published in New Scientist magazine on 17 November 2018"}