{"id": "Memory special: How can two people recall an event so differently?", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Feature 24 October 2018                                We each have a personal memory style determined by the brain, so next time you argue with someone about what really happened, remember that you may both be rightNaila Ruechel/GettyBy Catherine de LangeIT IS the day after a blazing row and you are determined to clear the air. But the more you talk about the argument with your partner, the more you struggle to hide your incredulity. How can their recollection be so, well, wrong? It’s as if you are reading from different scripts.In some ways, you are. To understand how people can experience the same event but recall it so differently, we need to forget our assumptions about how memories work, says Signy Sheldon at McGill University in Canada.We tend to think of memories as information stored in the filing cabinet of the brain for future use. In fact, they are only built when we retrieve them. All the information you were bombarded with during that argument – what was said, the scene, your feelings and reactions – was just sitting there gathering dust. It wasn’t until you called the event to mind the next day that you created a mental representation of what happened. And of all the details you could have picked out, you can bet you didn’t focus on the same ones as your sparring partner.One reason for this is very basic. “We are now understanding that there are strong individual differences in how people remember,” says Sheldon. What’s more, these differences are etched in our brains. Hints at what is going on come from people who have aphantasia, the inability to form mental images in the mind’s eye. Unsurprisingly, such people’s memories also lack a visual component, even though they can recall facts. Sheldon and her colleagues wondered whether this might help in understanding the different ways other people remember things.Exploring this possibility, they asked people to complete a questionnaire about how they tend to remember, before having their brain scanned. The team found that people’s memory style was reflected in their brain connectivity. Those who were better at remembering facts had more physical links between the hippocampus, and the prefrontal cortex, which is involved in reasoning. Those with richly detailed “autobiographical memories”, by contrast, had more connectivity between the hippocampus and areas involved in visual processing. “People’s brains are wired differently depending on how they naturally approach the act of retrieval,” says Sheldon.“We now understand that there are strong individual differences in how people remember”Beyond individual brain differences, there are other reasons why two people might have conflicting memories of the same event. Their emotional response to it is one. “Emotional events can be recalled much more naturally, almost like they are stamped in our minds,” says Sheldon. It is as if we shine a spotlight on the things that really matter to us. What we remember will also be affected by whether we consider it useful. And there are benefits to that too. It can help us learn lessons and bond with others. The malleability of memory is often seen as something that’s broken, says Sheldon, “but it’s really very adaptive”.This article appeared in print under the headline “How can two people remember the same event differently?”More on these topics: Magazine issue 3201, published 27 October 2018Previous articleMemory special: What happens to memories over time?Next articleForget quantum laptops, our quantum computing future is in the cloud"}