{"id": "Your old, unwanted clothes can be turned into building materials", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 3 November 2018                                Richard Levine/Alamy Stock PhotoBy Alice KleinUsed and unwanted clothes could be converted into building materials instead of winding up in landfill. This is using a technique whereby last season’s must-haves are shredded and turned into solid panels for floors or walls.Today’s abundance of cheap clothes and short-lived fashion trends mean that most garments are thrown out after a few seasons, generating 10 million tonnes of landfill in the US alone each year. As they gradually decompose, they release toxic chemicals and greenhouse gases.Not only is this bad for the environment, it also misses the opportunity to turn valuable clothing fibres into new products, says Veena Sahajwalla at the University of New South Wales in Australia.To create new building materials, Sahajwalla and her team collected a random assortment of garments from charity bins. After manually removing zippers, buttons, buckles and other solid bits, they passed the leftover mix of cotton, polyester, nylon and other fabrics through a fine-grained shredder.They then treated the resulting fleece with a chemical to help the different fibre components stick together, then compressed it under heat to form solid panels.Veena Sahajwalla, University of New South WalesIn a series of tests, the panels proved to be strong, water-resistant and minimally-flammable. Their properties could also be fine-tuned by mixing the fleece with other waste products like sawdust filler from old couches.The panels had different textures and colours resembling wood, ceramic or stone — depending on their mix of components — making them suitable for use as floor tiles, wall panels or other interior finishes, says Sahajwalla. Their strength could also make them suitable for load-bearing applications.The team are now building a small factory in the basement of their university building to see if the recycling process can be scaled up and commercialised.One challenge they face is how to convert mixtures of different clothes into building materials with consistent properties. “It might just be a case of needing to mix in more of a particular component if you want to adjust the properties,” says Sahajwalla.The group is the first to turn old clothes into solid building materials, but researchers in Europe are also working on recycling them into soft mats for use as heat and noise insulators inside floors, walls and ceilings.Journal reference: Journal of Cleaner Production, DOI: 10.1016/j.jclepro.2018.10.227More on these topics: A shorter version of this article was published in New Scientist magazine on 10 November 2018"}