{"id": "Kilogram to be defined by Planck constant instead of a lump of metal", "paragraph": "Sign up to our daily email newsletterActivate subscription|Educational accessA selection of top articles hand-picked by our editors available only to registered users.Check your subscription package, update your details, renew or upgrade.Daily news 16 November 2018                                Reuters/Benoit TessierBy Leah CraneThere’s a new kilogram in town. Scientists from around the world met today at the General Conference on Weights and Measures in Versailles, France, and unanimously voted for a new definition of the kilogram – one based on fundamental physical constants rather than a lump of metal held in a vault in France.The change will go into effect on 20 May 2019, and when this happens, it will mean all of our standard units are now defined using unchanging, universal numbers, instead of physical objects.Since 1879, we have officially defined the kilogram using a cylinder of platinum and iridium called Le Grand K or the International Prototype Kilogram. If Le Grand K were to get scratched and lose a little weight, the value of a kilogram would officially go down. Other measures of weight, like pounds and ounces, have also been defined by the weight of Le Grand K for the last 139 years.Copies have been distributed around the world so that more people could calibrate weights and measures. But because there are discrepancies between Le Grand K and its copies, we know that our official definition of the kilogram has been slowly changing despite stringent measures to keep the reference weights safe from the elements.All of that is to change. From May, the official kilogram will be defined by the Planck constant, which describes the size of the smallest possible packet of energy. The Planck constant is incredibly small, so it’s measured with a specialised piece of equipment called a Kibble balance. So far, only two labs have managed to make Kibble balances, but the hope is that eventually anyone will be able to accurately weigh anything without having to fly it to France to compare it with Le Grand K."}