{"id": "A Progressive Foreign Policy Should Revolve Around Climate ChangeGet breaking news alerts", "paragraph": "For all the momentum that left-of-center candidates have gained this election cycle, a compelling foreign policy remains as elusive for progressives now as it was for Bernie Sanders in 2016.This is largely by design: skeptical of interventionism abroad, the American left has historically prioritized issues meant to resonate more with voters at home. As political theorist Michael Walzer noted in an essay describing the paltry internationalism of American progressives, “the default position of the left” is that “the best foreign policy is a good domestic policy.”Precisely because of this wariness of exercising hegemony abroad, the left’s foreign policy has been characterized by reaction ― against the invasion of Iraq, against the ravages of free trade, against the withdrawal from the Paris climate agreement. But protests do not a politics make.Abjuring global leadership has mostly amounted to an abdication of institution building. While the right has for decades injected neoconservatism into the mainstream by converting think tank staffers into State Department bureaucrats, no such pipeline exists on the left. The result is a Democratic Party happy to bloat the Pentagon with excessive budgets, while shrugging at the biggest challenge the globe has ever faced: the climate crisis.Meanwhile, the recent rise of ethno-fascism in countries around the world will only worsen as hurricanes and droughts trigger more mass migrations. The United States could soon find itself negotiating with ecological authoritarians, those tyrants who exploit rampant fear and chaos in the aftermath of fossil fuel disasters to shore up political power. Brazil’s new president Jair Bolsonaro is perhaps the most urgent example, and it is far from inconceivable that he will weaponize his threat to sell off the Amazon, one of the world’s biggest carbon sinks, for concessions from the globe.Absent immediate and expansive action from the international community, these strongmen will only leverage this crisis as countries compete for vanishing resources. An American foreign policy that refuses to center climate change sufficiently is one that sets itself up to careen from one disaster to the next, leaving victims to be picked apart by dictators and the vultures of capital.The ascendant left in this country needs to step into this void. We need to articulate a comprehensive worldview that centers climate change as the defining crisis of our century; we need to hold the globe’s fossil fuel oligarchs responsible for their policies. And we need to do it soon.If America’s foreign policy elite sees global hegemony as a battle, from the Cold War to the war on terror, then let the most recent United Nations climate report offer its assessment in more familiar terms: We’re now in a fight against time.The staggering failures of the bipartisan foreign policy consensus are a potent weapon for insurgent federal candidates. Both Barack Obama and Donald Trump campaigned on messages that bucked foreign policy orthodoxy, only to succumb in office to the influence of the architects of the global recession, the engineers of the Iraq War and the executives of the fossil fuel industry. Americans clearly pine for an alternative to the foreign policy establishment, but we have been let down by administrations of both parties who serve the wealthiest at the expense of the rest of us.The biggest difference between the Obama Doctrine and the burgeoning Trump Doctrine lies not in who benefits (it’s still the Davos class), but in who is scapegoated. Obama was never willing to name the perpetrators of the crises he inherited from George W. Bush, bending over backward to describe rampant inequality as a “trend” rather than the intended result of years of ideological campaigning for tax cuts and deregulation financed by the ruling class. Trump, obviously, suffers no such compunction. He understands that rhetorical villains are necessary to mobilize popular opinion. The foundational vileness of Trump’s racist campaign strategy hung on deflecting popular discontent away from the elite towards society’s most powerless.The left must now redirect that blame back to where it belongs. For a foreign policy that seriously confronts the climate crisis, our villains are the world’s self-dealing oligarchs and the governments that abet them.What would this foreign policy look like? A strong domestic program to curb emissions and rein in the political power of our own oligarchs is a necessary first step. Such a program, thankfully, is beginning to emerge under the aegis of a Green New Deal: Pass an infrastructure stimulus to invest in our cities’ decaying railways, bridges and mass transit projects. Break up the energy monopolies that stifle development of clean energy. Put Americans to work with a green jobs guarantee that weatherizes homes and constructs seawalls. Place a tax on polluters to disincentivize carbon use. Prosecute white-collar crime like the Trump family’s inheritance scheme and former Trump campaign manager Paul Manafort’s tax havening and fund renewable energy projects with the seized assets.Not only are these policies moral necessities in the age of hurricanes like Florence and Michael, but they are also popular among voters. Polling commissioned by the organization I work for, Sunrise, and analyzed by Data for Progress shows that candidates who run on a green jobs guarantee and transitioning to 100 percent renewable energy enjoy support across a wide array of constituencies. The data suggests this anti-oligarchic vision for combating climate change could mobilize voters disenchanted by establishment politics and put the U.S. on a path to cutting emissions. Only when the rest of the world sees the United States taking these necessary drastic measures to clean up its carbon and its corruption can we claim global leadership.Another avenue to demonstrate the seriousness of the U.S. in confronting fossil fuel oligarchy could be a Marshall Plan for the climate crisis. Droughts, rising seas, forest fires and storms threaten some of the world’s poorest nations. The United States ought to provide foreign aid to these countries to mitigate the consequences of climate disasters and to help them adapt to the new world we have created.Once the United States regains moral standing by taking responsibility for our historic emissions and is on track to exceed the targets set by the Paris Accords, we must call for other countries to do the same. With enough countries bought in, we should push for an even more aggressive agreement that includes meaningful sanctions on rampant carbon use from the wealthiest nations or potential malefactors like Bolsonaro. A more stringent global accord would reduce demand for fossil fuels, but a climate realist approach demands that we soon go beyond that and freeze global oil production at its source. While the American fossil fuel industry eventually should be nationalized, the spheres of influence that carbon reserves afford aristocratic petro-states like Saudi Arabia and Russia must also be shrunk. We can do this by financing and building the capacity to export renewable technology to nations dependent on cheap gas and oil.To be sure, we must be certain not to export such tech with ulterior motives of nation-building, playing savior where we do not belong. Whenever possible, the United States can cheer from afar, supporting emissions reduction through local means, like indigenous sovereignty against corporate consolidation.Climate change is not the left’s fault, but it is our problem. Thankfully, the looming storms provide an opportunity for the left to articulate its international vision. Because as vast and harrowing as they are, the all-encompassing challenges presented by climate change provide a framework for a coherent message that unites the left’s global priorities. Fossil fuel emissions leave no part of the globe untouched, posing problems related to national sovereignty, resource scarcity, energy availability, poverty and security. Already, climate change is the throughline between oligarchic excess, the international rise of ethno-fascism, refugee crises and forever war. Of necessity, foreign policy is climate policy.The sooner we recognize this, the sooner we can craft an international agenda worthy of the name.Matthew Miles Goodrich is a writer and organizer in Brooklyn, New York. He serves as digital editor for Guernica and works with the populist climate movement Sunrise. He tweets at @mmilesgoodrich."}