{"id": "Trans Teen Jazz Jennings Refuses To Let The Trump Administration Tell Her Who She IsGet breaking news alerts", "paragraph": "When a recent memo was revealed exposing the Trump administration’s proposal to begin strictly defining gender, LGBTQ advocates and allies around the country decried its apparent intent to erase transgender people.But for activists like Jazz Jennings, the 18-year-old star of TLC’s reality show “I Am Jazz,” the threat of erasure is far from new. Long before networks began chronicling her life and tracing her every step, Jennings, a trans woman, was a relatively obscure trailblazer at her elementary school in South Florida.Jennings began living as her authentic self at age 5, and with the aid of her parents, she asserted her identity as a girl while demanding her school treat her as one. Jennings has since ascended into a role as one of the nation’s foremost trans activists, and in a recent video posted to her popular YouTube channel, she defiantly criticized the Trump administration’s memo.Jennings discussed the memo and its implications further in a follow-up interview with HuffPost. She also spoke of her beginnings as an activist, her approach to trans activism under the Trump administration and whether there is room for optimism in such a bleak period for the trans community.You’ve long been politically inclined and politically active. What was your first instinct when hearing about the Trump administration’s anti-trans memo? How do you craft a response to someone who’s literally making a claim that you don’t exist?I just sighed right away. It feels like the Trump administration keeps saying one thing after another, and this was a tipping point for me. I was over it, you know? My community — the transgender community — has already experienced victimization and been vulnerable in so many ways, and now the government is here trying to come after us directly. We don’t need that extra discrimination; we don’t need the government going against us when we already have society telling us we can’t be who we are. So if anything, we need more support — more administrative and legal action on our side ― and the opposite is happening. It’s annoying.Has your method of engagement as an activist changed under the Trump administration, which carries more outright disdain for the trans community than the previous administration?My only focus is on love and support. I’m not gonna give my attention to the Trump administration and people who are not supportive of the transgender community. Instead, I’m trying to speak with others out there and tell them not to be afraid of being who they are. I tell them not to worry. The government doesn’t have power over you ― people have power over the government. And you’re the people. So you be you, and be free, and be who you are, and don’t let anyone undermine that, even if the government isn’t on your side. So that’s the focus of my advocacy: the love and the uplift.This does seem to be a particular type of discrimination. I’m a black man, for example, and when I speak on my own behalf, it’s not usually in response to people who don’t believe black people exist. Do you think the playbook for trans activism is different because of the particular difficulty you face in being recognized for who you are?Yeah, I just think people don’t really listen. They’re so affirmed in their own beliefs that they won’t hear anyone else out. And I think so many individuals don’t understand the difference between biological sex and gender. They think because you’re born a certain way that your biological sex determines who you are, but I and so many others are saying, “No, you’re not just what’s between your legs. Your chromosomes don’t think and feel. Your heart, your mind, your body thinks and feels.” I’m saying I’m a girl — I’ve been a girl my entire life, and even though I was born biologically male, that doesn’t mean anything when I’m declaring that my happiness would be by identifying as a woman. People should allow me to be happy, and people should allow other transgender and gender-nonconforming individuals to be happy, and it shouldn’t be a matter of concern.I saw that you recently celebrated your 18th birthday. How did you celebrate? Did you find yourself reflecting, at all, on the things you’ve accomplished during your brief but eventful time on this earth?Well, 18 is obviously a big number, so even though it’s just another year, it kind of isn’t, because now I’m officially an adult. And that’s definitely changed my perspective in many ways. Now I feel as if I’m coming into my own and stepping into my power, but I think everyone else is helping me realize my strength also. So it’s been amazing because I’ve been getting more freedom and independence as I’ve approached adulthood. My family has been supporting me and allowing me to do more and more for myself in my life, so it’s been a big number for me. And I can vote!We’re often told that the millennial generation is the most progressive, and that when millennials come into power politically, all these divisions we see along racial lines and the gender lines we’ve created will disappear. As a millennial activist, do you think that optimism is warranted?Yes, [I] definitely think it is. I think as time goes by, things always get better. I don’t even think it’s just going to be millennials, though. I think we’re going to show the world a different way of thinking about what it means to be a human being, which means you can be whoever you are regardless of the color of your skin, your religion, gender identity, sexual orientation — any of those things. You’re just a person. And I’m hoping that we can kind of adopt a new collective consciousness where we’re here to help one another, and uplift one another, and focus on diversity and inclusion rather than separating each other and creating all these divisions and lines among us.I have faith that my generation will bring some of that to light, and the rest of the world is going to be on board with it. I think older generations are gonna be like, “Yeah, it should be this way.” I think they’ll be supportive of us, and I think that’s happening right now.You’ve been immersed in this battle for years, and I wonder whether you ever feel any fatigue.I mean, definitely. I’ve been doing it for a long time and it’s hard being in the spotlight. It’s hard saying the same message over and over again, because you just wonder when people are gonna open their minds and hear it. And I think people are hearing it, and that’s what motivates me to continue sharing my story, because I know that with each and every project I work on, at least one person is going to hear it and it’s going to affect their life in some way. And they’re going to use that knowledge to change their life and the lives of people around them. Having that impact has been such a powerful thing, and I’ve been blessed to have this position and platform to be able to share my story.Who are some of your inspirations when it comes to activism? Are there any people you model yourself after?There are so many incredible activists and leaders throughout history. I think the one that pertains to me most is Laverne Cox. She’s obviously such an incredible and powerful leader. I was watching her on the news, thinking, “Wow, if I can help people the way Laverne helps people, that’d be incredible.” She’s been doing it for so many years and I’ve been doing it for so many years. Seeing her grow and seeing myself grow, and seeing us able to create some change in this world, has been amazing.What do you think advocates of the trans community can do to help in response to the memo?Speaking out and using your voice is the most important thing — in any format possible. Whether it’s a simple thing and you’re speaking to a small group of people, or you’re speaking to a large audience, you sharing your story makes a difference. I really want this to be a community effort. Advocates can continue to do things, appear in the news, speak to news outlets, post on social media — so many things. And I think everyone has to play a role in their own special way.“I Am Jazz” is set to air its fifth season on TLC in 2019. "}