{"id": "White Women Who Vote GOP Aren't 'Voting Against Their Own Interests'Get breaking news alerts", "paragraph": "“If he invited me to a public hanging, I’d be on the front row.” That’s what Cindy Hyde-Smith, the GOP senator from Mississippi, said of one of her supporters during a campaign event. Hyde-Smith, who is white, faces a runoff later this month against Democrat Mike Espy, who is black. She represents the state that saw the most lynchings during the Jim Crow era, and her remarks have reminded many of the power white women held during that reign of terror. In 1955, when Carolyn Bryant lied and said that a 14-year-old Emmett Till had whistled at her, Till was murdered by her husband and brother-in-law.Hyde-Smith has doubled down on her comment and refused to apologize. Her remarks do not merely reflect the excesses of partisanship in the U.S. midterm elections, nor are they the result of mere tribalism or polarization. This is white supremacy, upheld with the help of the actual and threatened violence of white women. This white supremacy exists in mainstream political elections, in extremist movements, and in more soft-core white savior configurations that are no less deadly. The image that most people conjure when they think of “white supremacy” is of a man in a Klan robe or marching at Charlottesville carrying a Tiki torch. And if we think of women upholding white supremacy at all, it is in the angry faces of women who opposed integration in the 1950s and busing in the 1970s.But the truth is that white women have always been ardent proponents of violent white supremacy, and they continue to be some of its most vocal advocates.The current faces of white supremacy are women like YouTube stars Lana Lokteff and Faith Goldy. Lokteff creates videos that are meant to appeal to white women and push forward a violent white supremacy. Her videos feature titles such as “Pro White is Pro-Woman. Feminism is Anti-White” and “Women and the Alt-Right: The Awakened White Female.” Her message about the fall of “white civilization” and the urgent need to establish a white ethnostate reaches some 145,000 subscribers in the U.S. and beyond.Goldy, whose channel has more than 82,000 subscribers, came in third in a recent race for mayor of Toronto. She describes herself as a “white nationalist,” and she sees a bright electoral future for those who share her views. “In the next five to 10 years, probably closer to five, we will have alt-right men and women running for political office,” Goldy recently told a cheering audience of neo-Nazis. Although she is Canadian, her views resonate with white nationalists in the U.S. and have earned her the endorsement of the recently re-elected member of U.S. Congress, Steve King (R-Iowa). While it may be easy to dismiss the YouTube rants of white women like Goldy and Lokteff, it is harder to discount the institutional violence that white women can deploy. When women who believe in establishing a white ethnostate get the opportunity to wield state power, it means the destruction of actual people’s lives.For example, Kirstjen Nielsen is the white woman currently presiding over prison camps of children whose families have fled brutal violence in Central America. While Nielsen is rumored to be on her way out of the administration, she continues to hold power over the fate of children who are experiencing an extreme version of institutionalized racism that is also a form of child abuse.The American College of Physicians issued a statement strongly objecting to family separation, noting the kind of psychological and emotional distress it inflicts on the very young. “Childhood trauma and adverse childhood experiences create negative health impacts that will last an individual’s entire lifespan. Separating a child from his or her parents triggers a level of stress consistent with trauma.” The time children spend in these camps will affect them for the rest of their lives, and the administrative office doing this violence is led by a white woman. Camps for children, YouTube videos and threats of “public hangings” by sitting senators are not the only forms of violence perpetrated by white women. This violence comes in more subtle, suburban forms, too.  In April, 2018 Jennifer Hart drove her wife and her adoptive children, who were black, off a cliff in Northern California, killing them. While the crime shocked most people, and a handful of accounts at the time urged people to not ignore the role of race in the story, few connected Hart’s actions to the broader violence of white women’s supremacy. But the entire story of Hart’s family’s annihilation is riddled with it.When Hannah Hart, then 16, ran to a neighbor’s house in the middle of the night in 2017 a year before the tragedy, she pleaded with them. “You gotta help,” she begged. “Please protect me! Don’t make me go back! They’re racists, and they abuse us!” She was referring to Jen and Sarah Hart, her adoptive parents. Despite repeated calls for help to neighbors, strangers and social service agencies, no one did anything to protect Hannah and her siblings because, as one representative of child protective services explained, “the problem is these women look normal.” In other words, because they were white, the reports of abuse were dismissed. The white savior impulse of “I want to help you” can lead white parents to adopt black children, and films like ”The Blind Side” reinforce this as a feel-good solution to racial inequality. But the reality is that transracial adoption is entangled with the violence of ownership and annihilation, and there is a long history of it in the U.S. The Indian Adoption Project was a federal program that meant that as many as one-third of Native American children were separated from their families and sent to live with white families between 1941 and 1967. In 1972, the National Association of Black Social Workers issued a statement declaring transracial adoption of black children a form of ”cultural and racial genocide.” And today, there is grave concern that the children currently detained by the U.S. government and separated from their parents are at risk of being permanently stolen from their true families via adoption by white families. While draped in the language of care for children, it is an efficient means of depriving children of their culture.Although the violence of white women’s supremacy is perhaps easiest to see in Sen. Hyde-Smith’s reference to a public hanging or in the YouTube videos of people like Faith Goldy and Lana Lokteff, who both manage to put a thin, conventionally feminine face on their ugly beliefs, it also resides in the Harts’ adoption and abuse of six black children and the failure of Minnesota child protective services. And white women’s violent supremacy is riven through Jen Hart’s decision to speed her SUV over a cliff at nearly 100 miles an hour, killing her entire family. As pundits sift through the detritus of the midterms, we’ve learned that a majority of white women voted Republican in crucial races in Texas, Georgia and Florida. The hot takes that claim these women are voting against their own interests miss the fact that upholding white supremacy does, in fact, serve white women’s interest in whiteness. While some observers will offer soft-focused reactions to white women’s voting records as our collective ”sisterhood problem,” we have to face up to the hard-edged reality of the violence of white women’s supremacy. White women’s violent supremacy has deep roots in the American landscape, and it is a violence they have enacted shoulder-to-shoulder with their white brothers, husbands and sons. If we are to be able to grapple with white supremacy, let alone dismantle it, we must recognize that when white women vote or wield political power in ways that support white supremacy, or post racist YouTube videos, or acquire, abuse and then annihilate black children, they are in fact, upholding white supremacy. If we are to end white supremacy, we must contend with its violent, feminine forms.Jessie Daniels is a Professor at The City University Of New York, and the author of the forthcoming book Tweetstorm: The Rise of the “Alt-Right” and the Mainstreaming of White Nationalism."}