{"id": "There Were Zero Things Better This Week Than The Ratio On Eddie Scarry's Trash TweetGet breaking news alerts", "paragraph": "What a spectacular week for owns. I have three moments of sheer online beauty that I’d like to present to y’all, in no particular order. They’re all magnificent in their own way. Honestly, truly.1. New Yorker columnist Jelani Cobb told Van Jones to cease his public blow job of President Donald Trump. Cobb’s tweet was coy and included a real good reference to a viral Jill Scott video. It’s a spectacular sight, really.This was more entertaining when Jill Scott did it. https://t.co/GJA8AL0numFor comparison purposes, here’s video of Allen Iverson stepping over Tyronn Lue. Cobb’s tweet is quite similar in cultural magnitude.2. D.C.-based creep Eddie Scarry tweeted some weird stalker shit about Rep.-elect Alexandria Ocasio-Cortez’s outfit. And the timeline, in a moment of breathtaking solidarity unlike anything we’ve seen since Kony 2012, got him the fuck out of here with an Omega-level ratio. Scarry ended up deleting the tweet instead of his account (I’m very disappointed that he didn’t choose to remove himself from Twitter entirely). But I performed my civic duty as a reporter and live-tweeted the ratio before New York Times reporter Dave Itzkoff swooped in with the final results.i feel like i'm watching a murder. pic.twitter.com/Esll07D0i2wowza. pic.twitter.com/V7GDLmzZCtfor posterity pic.twitter.com/TGNT0Kzw133. Scarry tried to walk back his original tweet and got ratio’d AGAIN.ATTN! I posted a tweet earlier suggesting the incoming congresswoman looked well put together -- ELEGANT even -- despite suggestions she’s struggled. The tweet was taken as something else, so I’ve deleted it!Fuck, I love Beyonce’s internet. ― Julia Craven“Widows” poses many questions. How deep can political corruption run? How does a person overcome tragedy alone? And what should you do with your dog before the big heist?Viola Davis answers all three, playing a Chicago lobbyist named Veronica whose career-criminal husband (Liam Neeson) dies on the job. Two menacing mobsters (Brian Tyree Henry and Daniel Kaluuya) demand she settle his $2 million debt, leaving Veronica and her fellow widows scrambling to execute the heist their spouses could not. Suddenly without a family and finding herself face to face with crooked lawmakers, Veronica has one comfort left: her fluffy dog.Despite her no-frills moxie, Veronica loves little Olivia, a cute West Highland White Terrier that becomes a vestige of the days before everything went to shambles. Olivia, a role brought to life by the same talented thespian that played Jesse Plemons’ pup in “Game Night,” humanizes Veronica as she sinks further into the crime world. She cares for the dog so much that she thinks to take it to a kennel on the night of the heist, just in case she doesn’t make it out alive. Action movies don’t usually let us consider such logistics, preferring to focus on the wham-bam of it all, but “Widows” pauses to treat Olivia as the one constant amid Veronica’s trauma. (“It softens her,” director Steve McQueen recently told me.) The pooch gets some good laughs, but she’s also an important narrative fulcrum, playing a key part in the film’s biggest twist. And that, my friends, is the work of a very good girl. ― Matthew JacobsYou might have noticed, East Coasters, that it got really fucking cold all of a sudden, making the already daunting task of getting out of bed in the morning exponentially more agonizing. But on the other hand, soup. Morning soup. It’s here to help.Just think of it: the warm feeling you get from that first sip of coffee, combined with the savory surprise of vegetables, lentils, chicken stock, beef, or whatever else you fancy. I’ve been opting for miso soup this week, simply mixing miso paste in hot water and sprinkling in some scallions if I feel crazy. Sip it from a mug and you’re having tea and food at the same time. Do you know how warm and full I feel before 8 a.m.?While I haven’t yet experimented with very many morning soup options, the cold, sad times ahead promise plenty of opportunities for soup play. Sweet breakfast is a scam and we’d all be better off if we loosened up a bit and drank more meat before sunrise.Bone broth is for assholes. Soup is the liquid food of the people. ― Priscilla FrankThe season 13 finale of “It’s Always Sunny In Philadelphia” is more than a week old now, but I still can’t get past the episode’s deeply emotional five-minute dance number performed by Rob McElhenney’s character Mac and professional ballerina Kylie Shea.The dance is an interpretation of Mac’s complicated feelings about his sexuality, and serves as a way for Mac to come out to his father Luther (Gregory Scott Cummins). As he says in the episode, “There’s like this storm inside of me and it’s been raging my whole life, and I’m down on my knees, and I’m looking for answers, and then God comes down to me and it’s a very hot chick and she pulls me up and we start dancing.” In an interview with Vulture, McElhenney said Mac’s explanation for the dance was meant to be funny in that it’s “intensely confusing.” That’s a pretty standard “Sunny” move (see: almost any reason Charlie Kelly [Charlie Day] gives for anything he does, ever). But the manifestation of that vision was something completely refreshing to longtime fans of the show. There is no shtick or gimmick behind the choreographed piece, a stunning pas de deux set to Sigur Rós’ “Varúð” that McElhenney says took him seven months to train for. Even a non-dance expert can tell it was physically and emotionally strenuous. McElhenny executes it beautifully, capping a years-long story arc that has seen Mac struggling with body image, sexuality and his interactions with others as a gay man. There’s a tangible weight to the moment; as a viewer, you feel an emotional release in tandem with Mac, who sheds a rare sincere tear during the dance. It evokes a baptism, an image amplified by the rain-soaked stage on which McElhenny and Shea perform. There’s extreme intimacy in watching Mac finally embrace his identity, finding his place among his family, friends and gay culture, even as some ― namely, his dad ― reject him. It was more than a singularly impressive event in the show; it was a sharp departure for the series, which tends to make progressive statements through a cast of characters who are lovable but terrible. Even the first 20 minutes of “Mac Finds His Pride” are typical “Sunny” fare, giving no real indication the show will take a serious turn. But the minute Mac steps on stage, a palpable shift occurs. The earnestness of it is almost breathtaking, a jarring moment after 13 years of dark humor that has explored the worst of society.The episode has been widely praised, which makes sense. McElhenney said there was an “overwhelming emotional response from the LGBTQ community” when Mac came out as gay, which he took to heart, aiming for a “much more emotionally resonant end to the season.” Mac’s dance will certainly rank as one of the most memorable scenes in “Sunny’s” history. Those cathartic five minutes of television might even change the tone of “Sunny” going forward. (The show has already been renewed for a 14th season.) Mac’s surrogate father Frank (Danny DeVito), who begins the episode admitting he doesn’t get Mac’s sexuality, even achieves some clarity in what’s perhaps the most touching line in the show’s 13 seasons.“Oh my god, I get it,” Frank says, teary-eyed. “I get it.” ― Paige LavenderA post shared by Lauren Burnham (@laureneburnham) on Nov 14, 2018 at 6:20am PSTI’m 30, so I feel like everyone is having a baby right now, which is probably not true. Two people who are having a baby, though, are Arie Luyendyk Jr. and his runner-up fiancée, Lauren Burnham! Less than a year ago, he was engaged to her “Bachelor” competitor Becca Kufrin, and now, just one horrific on-camera dumping later, look at them: a Hawaii wedding planned for January, and a little Luyendyk-Burnham on the way.Anyway, this is not what I’m excited about, though I fully support babies. What brought me joy this week was the couple’s influencer-chic announcement photo shoot with Us Weekly, which they shared on their own Instagram accounts. The photo Lauren posted, in particular, was like Insta-couple bingo. The couple kissing, check; the ultrasound photos, check; her gigantor rock dangling oh-so-casually in the center of the photo, check. (Her engagement ring appears to be the only thing actually in focus in the picture.) They’re sharing a loving clinch with her hand clutching the sheet of ultrasound images, as if the photographer caught the moment when she shyly showed her partner the proof of their impending bundle of joy. It’s all transparently stage-managed to appear un-managed, natural, and enviable.I love these basic bitches, and I love that they have refused to stop being influencers even though the entirety of the “Bachelor” fan base views them as sort of the opposite of goals. If they can dream it, they can become it. ― Claire FallonWhat you call an icon livin’? I call it Michael B. Jordan’s Adonis Creed walking out to Jaden Smith’s “Icon” for one of his matches in “Creed II.”Sure, the reviews say quippy things like “Creed II” doesn’t “pack the same punch” or isn’t as much of a “knockout.” I can only guess these reviewers fell asleep. Because there’s nothing more iconic than seeing Jordan, aka Killmonger, walking to the ring to the beat of Smith, who once told me he believes a real place like Wakanda actually exists. ― Bill BradleyKacey Musgraves pulled off a surprising upset Wednesday night when she won the Country Music Association’s Album of the Year award for “Golden Hour,” the “galactic country” collection she released in March. On paper, “Golden Hour” should have been considered a favorite even in a category packed with big names. It was a fantastic album that topped sales charts and managed to be both quintessentially Musgraves and an evolutionary work that twisted and bent the country genre in new ways. But it wasn’t the favorite, in part because of who Musgraves was up against, and in part because of who Musgraves is. Or rather, what she is, and what her opponents are: a woman in a genre that doesn’t appreciate its women, going up against a bunch of dudes in a genre that over-appreciates its dudes.That’s not to say Chris Stapleton, Dierks Bentley, Keith Urban and Thomas Rhett didn’t produce work deserving of acclaim. It’s just that every corner of the country music world trips over itself constantly to dish out love to the guys, while it rarely finds time to do the same for women. Musgraves’ win made her just the sixth solo woman to grab the CMA Album of the Year award in its 52-year history. Solo male artists have won 37 times. That Musgraves did so with an album that failed to break through on country radio, despite the critical love it received and the sheer quality of its work, makes the victory an even bigger deal.The country music world shouldn’t pat itself on the back for making a rather obvious decision. “Golden Hour” getting its due on the big stage doesn’t make up for the fact that its best offerings, including singles “Space Cowboy” and “Butterflies,” predictably (if undeservedly) bombed on the radio, or that Musgraves and other women like her have to constantly overcome barriers to get a modicum of praise from the industry. That a victory for an album as good as “Golden Hour” is remarkable is itself a statement on the state of country music. But in a genre where women are creating most, if not all, of the best and most interesting work, it’s about time someone beyond Miranda Lambert (who also doesn’t get enough acclaim) finally got something resembling her due.It’s probably too optimistic to believe that victory will cause a seismic shift in an industry that would still rather spin the latest formulaic dude hit than try something new, especially when the fresh take comes from a woman. But the manner of the announcement itself was proof that “Golden Hour” had, and will continue to have, an impact on other women inside country and beyond. “And the CMA Award for album of the year goes to,” Little Big Town’s Karen Fairchild said as she announced the winner, “for all the little girls writing songs out there, ‘Golden Hour,’ Kacey Musgraves!” ― Travis WaldronA post shared by bachelorabc (@bachelorabc) on Nov 15, 2018 at 10:23am PSTClaire already shined a spotlight on the joy and pain of former Bachelor Arie Luyendyk Jr. and his fiancée Lauren Burnham’s recently announced forthcoming baby. But the other big news in ~*Bachelor Nation*~ is that the poster for new Bachelor Colton Underwood has finally arrived! Complete with the most deeply terrible and thus perfect tag line: “What does he have to lose?”If you’re not an avid viewer of “The Bachelor” and “The Bachelorette,” you may not know that Underwood is ― gasp! ― a virgin, one of the most desired and mercilessly tokenized figures in the “Bachelor” franchise. In case viewers thought they’d be getting a break from in-depth dissection of this man’s sexual history (or lack thereof), this tag line tells us loudly and clearly: no. Underwood’s virginity will be at the center of his love story. At least we’ll have some rich material for the fantasy suites. ― Emma GrayFacebook in 2018 is a strange creature — a wasteland of Minion memes, questionable political leanings and Mark Zuckerberg’s attempts to prove his humanity. But crack the lid on the social media platform and you’ll find that the best stuff is a bit hidden. Yeah, I’m talking about groups ― in particular, a group of 125,000-plus people who gather to gush about public transit in the language of the internet.New Urbanist Memes for Transit-Oriented Teens marries urban planning and public policy lingo with the stupid-good imagery of internet memes, creating a place on the information superhighway for transit lovers and Jane Jacobs superfans. It started with a simple Robert Moses meme shared among geography students with a bit of Weird Internet sprinkled in, and it blossomed from there. You don’t actually need to be a teen or have a degree in the topic to get the jokes — just an appreciation for cute buses and trains. And, OK, maybe a copy of The Power Broker to keep on hand while you browse. ― Jillian CapewellRead last week’s Good Stuff."}