{"id": "Planning My Wedding Is Making Me Feel Like I've Stepped Back 50 YearsGet breaking news alerts", "paragraph": "When I got engaged last year, I expected wedding planning to be fun, if a little stressful in parts, and mostly very expensive. What I didn’t expect was how uncomfortable it would make me feel, and how outdated the wedding industry is.It started immediately upon announcing our engagement. My fiancé proposed at Disney World, and I went back to work to find a queue of women at my desk. The questions started. “Did you know he was going to ask? Were you surprised? Did you cry?” I admitted that yes, I knew he was going to ask, and no, I didn’t cry. At all. In fact, I had a fit of the giggles. My answers were met with polite but disappointed faces. After all, as these women told me, I’d just experienced “every girl’s dream.” My Mum found that people wished to congratulate her, too, as though she had done an excellent job in selecting for her only daughter a single man of good fortune, who was in want of a wife. In reality, my Mum is as unromantic as I am, and was pleased but not especially overwhelmed.When the novelty of my new status wore off, I was relieved. Maybe I’d be left alone now to get on with planning my wedding in peace. Not so. The whole process seemed to be set 50 years in the past. Having a ring on a particular finger apparently told people things about me, and those people expected me to be a woman I am very much not. The sort of woman who was interested in napkins, silverware and making my husband’s dinner. Some highlights of venue hunting included wedding coordinators who spoke only to me as though my fiancé wasn’t even there (because as a man, he doesn’t actually care, apparently), one woman who advised me to “make sure he attends his suit appointments,” and venue staff who were truly baffled by my lack of interest in chair sashes. They seemed to feel that my whole life had been leading up to this moment.  Every time I meet new people, the round of wedding quizzes begins again. Was I disappointed he hadn’t dressed smartly to propose? Am I going to lose weight for the big day? Someone tells me on average once a week that they “can’t believe I’m not stressed.” My wedding is over a year away, and people seem to be astonished that I can think of anything else. Wedding planning is not anywhere near as much as fun as I had hoped. Instead, I feel like I’m bad at it, the wrong sort of bride, because I don’t want a particularly traditional wedding. But I’m also not planning a pagan handfasting in the woods. I’ve booked a nice hotel wedding venue, and my Dad will walk me down the aisle. But I’m also comfortably ditching any tradition that doesn’t appeal to me. I won’t be throwing the bouquet, and the idea of me promising to honor and obey made my fiancé laugh so much he nearly hyperventilated. This choice seems to confuse well-meaning acquaintances immensely, and somehow my wedding is “incorrect.” I’ve felt this from the start, with reactions to my purple sapphire engagement ring, which is often declared “unusual,” or my personal favorite from my Nan, “very large.” I’ve been told they “can’t picture me getting married in a hotel,” which is very comforting to hear when that’s the venue I’ve booked. The groom is incorrect, too, because he has an opinion about his own wedding.My feelings of inadequacy at this bridal business are helped along by the fact my entire identity seems to revolve around it now. People refer me to as “the future Mrs. Whitney,” which makes me want to jab them in the eyes with a fork, especially as I’m going to combine our names and be Elsmere-Whitney. I’ll also keep using Ms. My fiancé is also planning to use both names, but that’s a whole other story of baffled reactions. People ask me how wedding planning is going before they ask me how I am. They look pitying when I don’t have anything new to tell them.Thank God for sensible friends and family who ask how it’s going, but don’t forget I have a personality outside of “bride,” or I think I’d have gone on a murdering spree. I can’t wait to be married to my best friend, and make our team official. But also, I can’t wait to be married so I can stop feeling like a crap bride, or as though I’ve accidentally time-traveled to 1955. I’ll be gritting my teeth until it’s over. And then after that, I expect I can look forward to being interviewed about my breeding plans.Do you have a compelling personal story you’d like to see published on HuffPost? Find out what we’re looking for here and send us a pitch!"}