{"id": "Speaker Of The House Race Continues As Nancy Pelosi Remains ConfidentGet breaking news alerts", "paragraph": "WASHINGTON (AP) — Democrats won the majority. Now they just need a speaker of the House.The standoff over Nancy Pelosi’s bid to regain the gavel intensified as Democrats left Washington for the Thanksgiving break in what has turned out to be an unsettling finish to an otherwise triumphant week that saw them welcome a historic class of newcomers to Capitol Hill and prepare to take control from Republicans.President Donald Trump is jumping in to offer some help, saying Saturday that he could “perform a wonderful service” by rounding up Republican votes for Pelosi’s candidacy. Trump says he genuinely likes Pelosi and looks forward to working with her, but it’s an almost unheard of proposition for the party that relied on the California Democrat as a chief villain on the campaign trail.“I would help Nancy Pelosi if she needs some votes,” Trump told reporters as he left the White House for a trip to survey the devastation from the California wildfires. “I like her, can you believe it? I like Nancy Pelosi. She’s tough and she’s smart, but she deserves to be speaker, and now they’re playing games with her, just like they’ll be playing with me.”Pelosi, who was the first woman to become speaker and served from 2007 to 2011, was certain that she will hold that post again. Last week she dismissed a suggestion that she could rely on Republican support to help amass the House majority needed in January when Democrats take control of the chamber after this month’s election victory.“Oh, please, no, never, never, never,” she said.Trump went so far Saturday to tweet the name of one Republican congressman, Rep. Tom Reed of New York, who has said he could be open to backing Pelosi if she committed to changes that would shift some power from the House leadership. Reed is a part of the Problem Solvers Caucus, whose members have broached the idea as a show of bipartisanship to help reform Congress. Reed welcomed Trump’s tweet Saturday even though GOP lawmakers considering endorsing Pelosi would open themselves up criticism in their 2020 re-election bids for daring to support someone their base has reviled.“The president understands Congress is broken,” said Reed’s spokesman Will, Reinert. Reed has said for months “he’s open to voting for anyone who promises to reform the House of Representatives for the American people.”Pelosi met with the group last week, but not with Reed or other Republicans.“Leader Pelosi will win the speakership with Democratic votes,” her spokesman Drew Hammill said Saturday.Pelosi was expected to work the phones from California during the break after meeting privately with newly elected Democrats who could be crucial to her bid. Her foes were equally confident they have the votes to stop her ascension.For now, it’s a band of disgruntled Democrats, led mostly by men, in the forefront of the opposition. With a test vote looming in late November, and at least one potential Pelosi challenger stepping forward, Democrats are facing the uncomfortable prospect of the internal squabble that the speaker’s vote Jan. 3 could drag on for weeks.“I think chaos is good if it’s productive. I think chaos is bad if it is too disruptive and it divides us too much,” said Rep. Pramila Jayapal, D-Wash., a co-chair of the Congressional Progressive Caucus, whose leaders were upbeat after meeting with Pelosi this past week.Newly elected lawmakers indicated they were having good meetings with the leader, though few said the talks had changed their minds.“It isn’t about her, it’s about wanting new leadership,” said Rep.-elect Abigail Spanberger of Virginia, a former CIA operative who defeated tea party Republican Rep. Dave Brat in suburban Richmond. “There isn’t anything she could say, because the decision isn’t about her.”Rep.-elect Jeff Van Drew of New Jersey said he had a “pleasant” meeting, but remains a “no” on Pelosi. He is among 17 Democrats who have signed on to a letter opposing her. Van Drew said they discussed his districts and which committees he’d like to serve on. “I don’t feel under pressure,” he said.Pelosi also has met with Rep. Marcia Fudge, D-Ohio, a potential rival for the speakership who said the two had “a very open and frank discussion.”Fudge said she would probably decide after Thanksgiving break whether she will run.“To her credit, she wanted to know what my concerns were,” Fudge said. “What she asked me was, basically, how we could get to a point where I’m supportive.”One question for some Democrats is what, exactly, Pelosi means when she says she intends to be a transitional leader, a bridge to a new generation. She has led the party for 15 years.If it were up to most of the Democratic Party, Pelosi easily would win. They see her as a skilled and tested leader prepared to confront Trump and deliver on priorities.Pelosi, 78, first became speaker after Democrats took control of the House in midterm elections during former President George W. Bush’s second term. With President Barack Obama, she was pivotal in passage of the Affordable Care Act in 2010.With a narrow Democratic majority, now at 231 seats in the 435-member House, Pelosi does not have much cushion to secure the 218 votes needed, assuming all Republicans vote against her, as expected. Some House races remain undecided and the Democratic majority could grow slightly.There is a chance the math could shift in Pelosi’s favor if lawmakers are absent or simply vote “present,” meaning she would need fewer than 218 votes for an absolute majority.___Associated Press writers Alan Fram, Matthew Daly and Mary Clare Jalonick contributed to this report.Do you have information you want to share with HuffPost? Here’s how."}