{"id": "Republicans' George Soros Conspiracy Theory Is An Attack On DemocracyGet breaking news alerts", "paragraph": "Another day, another George Soros conspiracy theory. Earlier this week, right-wing outlets like the Daily Caller and Breitbart accused a “Soros operative” of assaulting a GOP campaign manager in Nevada, the latest in a line of recent stories from conservative outlets about how Soros-backed thugs are roughing up Republicans.Imagining Soros, the billionaire financier who funds progressive causes around the world, as the mastermind behind a sinister and often violent plot against conservatives has long been a paranoid fantasy of the fringe right. But for a time, respectable Republicans generally avoided the Soros conspiracy talk, rightly understanding that seeing the Jewish banker as a globalist “puppet master” smacked of the worst kind of anti-Semitism.Thanks to Donald Trump, there’s not a lot of respectability left in the Republican Party these days. And what was once the fringe right has been thoroughly mainstreamed, with conspiratorial thinking and reactionary politics taking center stage in the Oval Office.In this context, the conservative focus on Soros has gone into overdrive, with Fox News running regular features on Soros’ supposed manipulation of American democracy. It’s no wonder then that Trump, perhaps Fox News’ most loyal viewer and certainly its greatest parrot, has taken the bait. When several women confronted Sens. Jeff Flake and Orrin Hatch about their experiences of sexual assault during the Judge Brett Kavanaugh confirmation hearings earlier this month, Trump lashed out on Twitter that the women carried signs that were “paid for by Soros.”Among all the wild theories about Soros ― including that he is the “anti-Christ,” an accusation that Trump lawyer Rudy Giuliani recently found worth retweeting ― the idea that Soros is personally paying protesters to show up at the Kavanaugh hearings, the women’s march and #BlackLivesMatter events, has become conventional wisdom among conservatives.That shouldn’t be surprising in the Trump era, but it’s also in keeping with a long history of the right’s attacks on the left and the American tradition of protest. Yet most troubling for our current moment, the accusation that paid actors are behind some of the most powerful protests of late helps to destabilize American democracy, especially when it comes from the president. Far more than an effective political smear against George Soros, the right’s normalization of the idea that paid protesters are at work across the nation represents yet another way that Trumpism is actively undermining the American system.From the nation’s beginnings, Americans have recognized protest as a hallmark of democracy and freedom. Protest had been at the heart of the American Revolution, so the nation’s founders made sure to protect the right to dissent, enshrining “the right of the people peaceably to assemble” in the First Amendment of the Constitution.Since then, Americans of all political stripes have embraced the tradition of protest. But for the left, protest and demonstration have been especially effective tools in advancing progressive causes, including women’s suffrage, civil rights and LGBTQ rights.In response, conservatives have often sought to diminish those causes by attacking the legitimacy of the protesters themselves. In the civil rights movement, white Southerners demonized Northern student activists as “outside agitators” who had come to the South just to stir up trouble rather than help the cause of racial justice. During the AIDS crisis, conservatives blasted organizations like ACT UP for their “inappropriate” protest tactics, including storming St. Patrick’s Cathedral during a service in protest of the Catholic Church’s stance against homosexuality and its opposition to condom distribution.Questioning the tactics and even the authenticity of protesters allowed opponents of progress to distract from the debate over civil rights or gay rights and instead raise the question of whether the protests were even genuine.That same insidious spirit is at work in the conspiracy theory that Soros is personally paying Americans to march and rally on his behalf. The dangerous difference now is that this thinking is being touted by the president himself against the millions of Americans who have risen up to resist his administration. That civic surge may soon spell electoral disaster for the GOP, but in the meantime, Republicans have worked overtime to devalue it by insisting the vibrant civil expressions are financed hoaxes rather than real grassroots activism.It’s worth noting that plenty of those on the left see similarly sinister motives in the Koch brothers’ philanthropic giving to conservative causes and candidates, although it should be said there’s no equal liberal conspiratorial fantasy that imagines the Kochs paying average Americans to, say, show up at Trump rallies. The fact is that the costs of American politics have never been higher, and Americans are right to worry about the role of “big money” in their nation’s politics.Still, Trump and other Republicans’ insistence that George Soros is paying people from Ferguson, Missouri, to Capitol Hill to protest does nothing to protect against the oversized influence of money in politics. Trump has little concern for that. Instead, Trump and his cohorts are weakening the foundations of the American system by their constant claim that any protest against him has been bought by one billionaire.Americans may not always agree with the protests and marches they see in their communities and on their televisions, but they must recognize that their existence demonstrates the health and vitality of American democracy. The durability of that democracy also depends on Americans believing that those marchers and protesters do so out of their own will and conscience and not for any paycheck.Trump may not understand someone acting out of conscience rather than financial interest, but the radical experiment of American democracy has counted on millions of Americans doing exactly that for over two centuries. When Trump and his Republican enablers scoff that today’s protesters are Soros-paid puppets, they are doing far more than scoring cheap political points against their adversaries. Dangerously, they are sowing the kind of division and distrust among Americans that threatens our entire democracy.Vladimir Putin couldn’t ask for anything more.Neil J. Young is a historian and the author of We Gather Together: The Religious Right and the Problem of Interfaith Politics. He hosts the history podcast “Past Present.” "}