{"id": "Super Typhoon Yutu Slams Into Northern Mariana Islands With ‘Horrifying’ WindsGet breaking news alerts", "paragraph": "HONOLULU (AP) — Super Typhoon Yutu crossed over the U.S. commonwealth of the Northern Mariana Islands early Thursday as the equivalent of a Category 5 hurricane, making it the strongest storm to hit any part of the U.S. this year, the National Weather Service said.Gregorio Kilili Camacho Sablan, the Commonwealth of the Northern Marina Islands’ delegate to U.S. Congress, said the territory will need significant help to recover from the storm, which he said injured several people.In a telephone interview with The Associated Press from Saipan, Sablan said he has heard reports of injuries and that people are waiting at the island’s hospital to be treated. He could not provide further details or official estimates of casualties.“There’s a lot of damage and destruction,” Sablan said. “It’s like a small war just passed through.”Sablan said the entire island sustained damage, but there are areas that are worse than others. He has not been able to reach officials on the territory’s neighbor islands of Tinian and Rota because phones and electricity are out.“It’s going to take weeks probably to get electricity back to everybody,” he said.Sablan says colleagues in Congress have reached out to offer help. He expects there will be a presidential disaster declaration put in place.“We’re surviving, we’ll get through this — we are a resilient people — but it’s just huge,” he said. “We need America’s prayers, and we need help, and I don’t doubt that we will get help. Thank you, America, for always being there for us.”The Governor’s team is working to open additional shelters as most of the existing shelters are either at capacity or sustained damage which prevents them from taking in more residents.#SuperTyphoonYutu #TyphoonYutu #Yutu #Marianas #CNMI.@fema was asked to bring in commodities to support ongoing shelter operations and it appears they will arrive tomorrow.#SuperTyphoonYutu #TyphoonYutu #Yutu #Marianas #CNMINearly 200 federal emergency workers were in the Marianas to assist, Sablan said.Maximum sustained winds of 180 mph (290 kph) were recorded around the eye of the storm, which passed over Tinian and Saipan early Thursday local time, said Brandon Aydlett, a meteorologist with the National Weather Service.Tinian suffered a direct hit. Saipan and Tinian will be unrecognizable, Aydlett said, adding that the weather service received reports that Yutu’s catastrophic winds ripped roofs from homes and blew out windows.“Any debris becomes shrapnel and deadly,” he said.Northern Marianas brace for slow recovery after typhoon - Super Typhoon Yutu crossed over the U.S. Commonwealth of the Northern Mariana Islands early Thursday in what the National Weather Service said was the strongest storm to hit any part of the United States this year... pic.twitter.com/SgzcirG9xUFallen trees could isolate residents, and power and water outages could last weeks, the weather service warned.“At its peak, the wind was constant and the sound horrifying,” Glen Hunter wrote in a Facebook message to The Associated Press. Hunter lives on Saipan, the largest island in the commonwealth, which is a U.S. territory about 3,800 miles west of Hawaii.“Gonna be quite a scene when the sun comes up,” Hunter wrote to the AP early Thursday.It was still quite dark when he peeked outside and saw his neighbor’s house, made of wood and tin, completely gone. A palm tree was uprooted.Hunter, 45, has lived on Saipan since childhood and is accustomed to strong storms. “We are in typhoon alley,” he wrote, but added this is the worst he has experienced.Check out the eye of Super Typhoon #Yutu in the western Pacific, seen today from #Himawari-8. The ferocious Category 5 storm is packing 180 mph winds and quickly approaching the U.S. territories of Saipan, Tinian and Rota. More imagery: https://t.co/naIsWtiBev pic.twitter.com/mo7PW10PaPPower went out the previous afternoon, and Hunter was bracing for months without electricity or running water. All government offices and schools shut down two days ago. A few gas stations ran out of gas by Tuesday evening, he said.“We knew it was going to be big,” he said, “but wow.”The roof flew off the second floor of Del Benson’s Saipan home.“We didn’t sleep much,” he wrote to the AP in a Facebook message. “I went upstairs and the skylight blew out. Then the roof started to go. We got the kids downstairs.”Recovery efforts on Saipan and Tinian will be slow, Aydlett said. “This is the worst-case scenario. This is why the building codes in the Marianas are so tough,” he said. “This is going to be the storm which sets the scale for which future storms are compared to.”Six of Saipan’s 10 shelters were full, he wrote, and Tinian’s shelter was full.All ports were closed, and flights into the Northern Marianas were canceled, he wrote.“The Tinian Medical Center sustained extensive damage. Fortunately, no patients were present,” he wrote in a post that also said the Commonwealth Healthcare Center and Rota Medical Center were running on generator power.The emergency operations center was having phone connectivity issues, Sablan tweeted later in the day. Cellphone and landline service was spotty in Saipan.Dean Sensui, vice chair for Hawaii on the Western Pacific Regional Fishery Management Council, was in Saipan for a council meeting. He hunkered down in his hotel room, where guests were told to remain indoors because winds were still strong Thursday morning.“From around midnight the wind could be heard whipping by,” he said in a Facebook message. “Down at the restaurant it sounded like a Hollywood soundtrack with the intense rain and howling wind.”Because he’s in a solid hotel, it wasn’t as scary as living through Hurricane Iniki in 1992, which left the Hawaiian island of Kauai badly damaged, he said. “The fact that we still have Internet access proves how solid their infrastructure is,” he said. “Hawaii and others should study the Marianas to understand how to design and build communication grids that can withstand a storm.”The Northern Marianas have a population of about 55,000 people.Waves of 25 to 40 feet were expected around the eye of the storm, and flooding is likely, forecasters said.A typhoon warning was in effect for Saipan, Tinian and Rota. A tropical storm warning was in place for Guam and other southern islands."}