{"id": "What It Means To Vote Like A ChristianGet breaking news alerts", "paragraph": "For the entirety of Donald Trump’s presidency, it has been clear that American Christians, evangelicals in particular, are willing to overlook all sorts of moral violations in order to hold onto political power. People who claim to be Christian, wholeheartedly practicing their politics “in the name of God,” have wholly abandoned the way of Jesus who tells us from the beginning to care first for the poor, marginalized and downtrodden. The question posed by this week’s midterm elections is yet again: Will Christians continue to compromise the way of Jesus in favor of perpetuating a Christian subculture obsessed with power ― and the delusion that Trump’s presidency is a direct result of God’s will? Or will they break free of that trap?As of 2017, 91 percent of Congress identified as Christian, and while this is a vague moniker in many ways, it is notably both unrepresentative of the total population (where three-fourths identify as Christian) and consistent with Christianity’s overrepresentation in politics throughout the history of United States.Christians frequently call on the history of Christianity of the “founding fathers” to back-up the authority of their politics in the U.S. without recognizing the inherently unchristian values that some of those founders held. From having affairs and using violence as a primary tool (most of them) to literally cutting and pasting the scriptures to create a religious ideology (Jefferson), the foundation of U.S. politics was laid on compromising the ways of Jesus in exchange for power. This same compromise was made to justify slavery, genocide of indigenous people and massive land theft and is the foundation of how Christians interact with the political system.The equation is actually quite simple: Christians’ (particularly Christian leaders) perception of moral authority, plus a contextual and universalized interpretation of the Bible, and the false notion that God ordained the U.S. to be a Christian nation, manifests in a spiritual rhetoric that backs up all power and violence as a means to an end for a Christian reality. This is a dangerous pattern present in American Christianity where those in power, believing that God is in control, create realities where their way is done and then call it God’s plan. God’s plan somehow always seems to agree with political agendas in this logical tail chasing. It shouldn’t be this way.As Christians align ourselves with political parties, the key question becomes, “Who and what would Jesus align himself with?” Even a quick look at just the first few chapters of each of the gospels reveals a God that is less interested in moral purity or political power (which in the story Satan offers), and more interested in both embodying the experience of the marginalized and calling the poor, meek, hungry, merciful, pure in heart, persecuted and peacemakers to follow him in an upside down way of being. In Jesus’ way, God’s closeness has nothing to do with power and everything to do with alleviating suffering and siding with the concerns of the downtrodden.Christians in the U.S. would rather talk about a fallacious war on Christianity in order to recast themselves as the persecuted. The spiritual gymnastics required to fit ourselves into the role of the people who Jesus sided with his asinine.There is not a lot in scripture that is clear ― and it only ends up clear if we make a ton of assumptions. One thing that is clear, however, is that Jesus, when summing up the law, says that it’s about loving God and loving people ― not institutionalizing God and subjugating people.It turns out, what Christians often perceive as a commitment to scripture is more specifically a commitment to Christian power. If the lens of politics comes first, it is not hard to justify a whole range of positions with scripture. It is how people like Attorney General Jeff Sessions can use scripture out of context one day to justify separating migrant children from their parents, but then ignore and kick out pastors who quote scripture back to him.The psychology of victimhood allows them to claim that any critique of their Christianity is part of the effort to “erode our great tradition of religious freedom.” Theirs is a Christianity that, putting itself at the center, cannot see how its policies impact those who don’t share its interests.Christian political rhetoric, and by extension voting, largely centers on “taking a stand” against things that seem unchristian, but seem inherently disinterested in living out the way of Jesus. In the modern Republican party, this is most clear around abortion, where it is notable that anti-choice policy, while seen as “taking a stand,” doesn’t actually decrease abortions. The issue functions purely as a source of performative moral outrage that eliminates Christians’ capacity for nuanced, educated, responsible and holistic voting. Morality and ethics are not absolute and scripture doesn’t treat them like they are ― the Bible is full of God not telling people what to do specifically, them doing super messed up stuff and scripture seemingly remaining indifferent. What is notable are the things that do seem to be constants ― love for God and sacrificial love for others regardless of identity.At the end of the day, if we opt into politics that deeply humanize people regardless of identity, we enter into the story of the people Jesus aligned himself with.History doesn’t typically look back fondly on those who attempt to “conserve” traditional ways, and scripture doesn’t expect that culture will always look the same. The cultural values of Jesus’ time do not line up with ours, so the values must be understood contextually, not just at face value. In the choice in partisan politics between flawed candidates on all sides, Christians’ engagement with politics ought not just mean unquestioningly supporting candidates like Trump who promise them seats at the table of power, but to call all politicians to higher standards of the common good. We must be educated voters and political actors, choosing not based on single issues or partisan politics, but by looking at candidates and their overall impacts more consciously.  It is our responsibility to emulate Christ and not the people who have distorted him to their own purpose.Jesus didn’t use his name to gain political power. We ought to be careful with our own temptation to do so.Brandi Miller is a campus minister and justice program director from the Pacific Northwest. "}