{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nThreat of violence at home spurs LGBT migrants on to the border Threat of violence at home spurs LGBT migrants on to the border  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Trump says he should have gone to Arlington on Veterans Day  Smoke blankets Bay Area as residents forced to don masks to breathe  Migrants won't see armed US soldiers on border  Slain journalist Khashoggi remembered in funeral service as controversy continues  At least 7 dead as snow wreaks havoc on East Coast  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  Teen accused of killing mom over bad grade charged with murder as adult  Oscar winner for 'Butch Cassidy' has died  Court filing hints at charges for WikiLeaks founder  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\nA group of LGBT migrants was among the first members of the so-called caravan to arrive in Tijuana this week, seeking asylum from some of the most violent countries in the world where gay and trans people are particularly targeted, according to Amnesty International.\n\n\"We came with the caravan, and the caravan continues,\" Cesar Mejia told reporters in Tijuana earlier this week.\n\n\n\n\n\nMejia said their group included about 80 people, including children, from Honduras, Nicaragua, El Salvador and Guatemala. As the week continued, hundreds of more migrants arrived in Tijuana, the Associated Press reported, although the majority of the caravan still appears to be more than 1,000 miles away.\n\n\n\n\nFrom the outside, many don't understand why people -- including families with small children -- would risk their lives to get to a country that has explicitly said it will not let them in. Secretary of State Mike Pompeo has said that people in the caravan will not be able to enter the U.S. illegally \"no matter what,\" and many members of the Trump administration, including the president himself, have accused members of the caravan of being terrorists or gang members.\n\n\n\n\n\nMany migrants have said that what spurs them on are the terrible conditions at home: Central America is wracked with violence and poverty, corruption and impunity.\n\nBut for LGBT migrants, the threat of violence is, in many cases, even greater, a 2017 Amnesty International report found, and \"gay men and trans women are exposed to gender-based violence at every point on their journey in search of protection.\" Amnesty listed Mexico and Honduras among seven countries it finds as being deadly and discriminatory for LGBT people.\n\n\n\nMejia, 23, told reporters in Tijuana that the LGBT members of the caravan gravitated toward one another in search of support. For his part, Mejia was easy to find in the crowd. When ABC News spoke to him last month in the tiny town of Huixtla, Mexico, he was wearing a rainbow flag around his shoulders.\n\n\n\n\"At first I was afraid to wear the flag. I didn’t know how people would react,\" Mejia told ABC News in Spanish. \"In Guatemala, people were asking me what country the flag was and I told them it was the flag of the world.\"\n\n\n\nBut in his hometown of San Pedro Sula, Honduras, it was not viewed that way, he said.\n\n\"I was discriminated and beat up so it was time to go,\" Mejia explained.\n\nHe chose to join the caravan of thousands of other people, the majority of whom were also from Honduras, making their way to the U.S. border in the hopes of a better life.\n\nMejia said if he is able to make it to the border, he could make the case for political asylum.\n\n\"If I had the opportunity to make it to the border, I could show my representation of the community and ask for asylum, because [in the U.S.], there is a lot less discrimination than Honduras,\" he said.\n\n\nRaul Valdivia, a gay man and human rights activist who still lives in Honduras, said he understands that discrimination firsthand.\n\n\"I've suffered many instances of discrimination based on my sexual orientation, but I remember the most violent came from state forces,\" Valdivia told ABC News. \"I was abused by police while on one of my very first dates. They took me and the other guy to a dark secluded area in a park and forced us to simulate sex. They also beat us with a belt. These are police who patrol downtown Tegucigalpa and I have seen them after, but I'm unable to speak out for fear of repercussions.\"\n\nValdivia said LGBT people in his country face \"assassinations, political attacks, legal discrimination and targeted street violence.\"\n\n\n\nThe country also has one of the highest homicide rates in the world outside of a war zone, according to the Overseas Security Advisory Council (OSAC). Authorities sometimes use gang violence as a cover for political and gender-based violence.\n\nNearly two thirds of Hondurans live in poverty, according to the World Bank. Corruption is a major issue, prompting the government to establish the Mission to Support the Fight against Corruption and Impunity in Honduras (MACCIH) in 2016 through an agreement with the Organization of American States, but much remains to be done.\n\n\"Marred by corruption and abuse, the judiciary and police remain largely ineffective. Impunity for crime and human rights abuses is the norm,\" a 2018 Human Rights Watch report found.\n\nThose who choose to speak out face harsh reprisals. In 2016, U.N. experts called it \"one of the most hostile and dangerous countries for human rights defenders.\" Human rights defenders routinely \"suffer threats, attacks, and killings,\" Human Rights Watch found.\n\n\n\n\nIn November 2017, the country held a presidential election with widespread reports of fraud and violence. Thousands took to the streets to protest the re-election of Juan Orlando Hernandez, who changed the constitution to allow himself to run again.\n\n\n\nThe government's \"response to the post-electoral protests led to serious human rights violations,\" according to the U.N., and dozens were killed and more than 1,000 were arrested.\n\n\n\nUnable to change their country at the ballot box, many Hondurans chose to flee. And experts say that although the size of this caravan has grabbed headlines, many more Hondurans quietly flee the country every year, leaving conditions that have dramatically worsened since the 2009 military coup, especially for LGBTQ people, journalists and human rights activists.\n\nIn 2009, gay human rights activist Walter Trochez, 25, was killed in Tegucigalpa after trying to draw attention to anti-LGBT violence by security forces.\n\nIn July 2017, David Valle, project coordinator of the Center for LGBTI Cooperation and Development, was stabbed in his home after receiving threats, Human Rights Watch reported. He survived the attack, but it highlighted the deadly violence LGBT people face in the country.\n\n\n\n\n\nIt is this environment that has prompted Hondurans to risk their lives on the journey north, both in caravans and on their own, experts say.\n\n\"As impressive in size as this caravan may be, it still represents a minute proportion of Central Americans -- today primarily Hondurans -- that are fleeing their communities,\" Alex Main, the director of international policy at the Center for Economic and Policy Research, told ABC News.\n\n\nBut LGBT migrants and asylum seekers face dangers along the way, the Amnesty International report found, and often face discrimination and neglect in detention facilities as well. In May, Roxana Hernandez, a 33-year-old trans woman from Honduras, died while in ICE custody in New Mexico, the Associated Press reported.\n\nActivists said she had traveled in a migrant caravan to the U.S. border. Hernandez had been admitted to the hospital after showing symptoms of pneumonia, dehydration and complications associated with HIV, the AP reported.\n\n\n\nBut even facing extreme dangers along the way and an uncertain future in a country whose president says it does not want them, people have continued to flee Honduras. That will continue until there are real policy changes, Main said.\n\n\"This mass exodus will only abate when the rampant violence in Hondurans abates, and when real economic development begins to take hold. This will require a profound revision of current economic models promoted by the U.S. and multilateral financial institutions and the displacement of a corrupt economic elite that retains power through repression and electoral shenanigans,\" Main added.\n\n\n\n\n\nUntil then, migrants, including those in the LGBT community, will continue to trek to the U.S., as this recent caravan has.\n\nMore than 2,600 migrants made it Tijuana Saturday, according to the Associated Press.\n\nMejia said he hopes his group's early arrival will give them an advantage with border officials.\n\n\"We wanted to avoid what always happens, which is that if we arrive last, the LGBT community is always the last to be taken into account in everything,\" he said at a press conference Sunday. \"So what we wanted to do is change that, and to be among the first, God willing, and request asylum.\""}