{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\n\n\tHealth News\n\n\t\t\t\t\t\t\t\tCalifornia wildfires: The best smoke masks that protect against poor air quality \n\t\t\t\t\t\t\t\n\n26-year-old's incredible face transplant journey\n\nThese jobs have the highest suicide rates \n\nFace transplant recipient thanks his donor’s mom\n\nWomen react to Michelle Obama's miscarriage reveal\n\nNew cholesterol guidelines for heart health \n\nPancreatic cancer, a silent killer?\n\nCDC investigating 90 confirmed cases of AFM\n\n\n\t                                        91,000 pounds of ground turkey recalled due to possible Salmonella\n\t                                    \n\n\n\t                                        Top tips for Thanksgiving food safety\n\t                                    \n\n\n\t                                        Juul to temporarily stop selling most flavored nicotine in stores\n\t                                    \n\n\n\t                                        What is AFM?\n\t                                    \n\n\n\t                                        New AHA guidelines for battling high cholesterol and heart disease \n\t                                    \n\n\n\t                                        What to know about the new cholesterol guidelines for heart health \n\t                                    \n\n\n\t                                        Cigarette smoking in the US hits record low, but it's not all good news\n\t                                    \n\n\n\t                                        How to fight off the 'winter blues'\n\t                                    \n\n\n\t                                        New study shows actual force backpacks put on your spine\n\t                                    \n\n\n\t                                        'This is the future': How a mirror could transform working out\n\t                                    \n\n\n\t                                        FDA approved new opioid drug called Dsuvia\n\t                                    \n\n\n\t                                        FDA approves powerful, controversial new painkiller \n\t                                    \n\nThese jobs have the highest risk for suicide\nMen who work in construction and women in creative fields face the highest risk.\n\nNov 17\n\n\nLawsuit: Yale removed depressed student from campus\nA Yale University graduate is suing the Ivy League school over allegations she was wrongly removed from campus after she sought counseling for...\n\nNov 17\n\n\nCriminal case as pollution surges in Russian river\nSharp rise in pollution of Russian river sparks criminal investigation\n\nNov 17\n\n\nNew Mexico woman sues hospital for resuscitating her\nA New Mexico woman who was brought back to life is suing the hospital for violating her rights\n\nNov 17\n\n\nTexas hospital system accused of holding patients illegally\nA Texas corporation that runs behavioral health hospitals is accused of illegally holding four patients\n\nNov 16\n\n\nMichelle Obama's memoir highlights long-time scars of miscarriage \nMiscarriage is “lonely, painful, and demoralizing,” Obama wrote in her book.\n\nNov 16\n\n\nFace transplant recipient thanks his donor's mother in tear-jerking moment\nCam Underwood met Sally Fisher 10 months after his surgery.\n\nNov 16\n\n\nNorth Korea running low on TB meds, experts fear epidemic\nHealth experts: North Korea is facing shortage of tuberculosis medications that could accelerate spread of more deadly strain, putting hundreds of...\n\nNov 16\n\n\nFerocious fires spark concern over major health consequences\nRecurring wildfires are sparking concern among medical experts about potentially major health consequences\n\nNov 15\n\n\nMeditation helps vets with post-traumatic stress disorder\nMeditation worked as well as traditional therapy for military veterans with PTSD in a small experiment\n\nNov 15\n\n\n'Batkid' is cancer free 5 years after his 'wish'\nMiles Scott is now a 10-year-old who loves little league and science.\nNov 15\n\nFDA to crack down on menthol cigarettes, flavored vapes\nFDA pushes for ban on menthol in cigarettes, tighter rules to prevent sale of flavored e-cigarettes to kids\n\nNov 15\n\n\nCalifornia recommends restrictions for popular pesticide\nCalifornia regulators are recommending new restrictions on a widely used pesticide blamed for harming babies brains\n\nNov 15\n\n\nThanksgiving turkey: 5 food safety tips to remember before you start cooking\nImproperly prepared turkey can make you sick. \n\nNov 15\n\n\nCalifornia wildfires: The best smoke masks that protect against poor air quality \nThe type of mask matters if you don’t want to inhale harmful pollutants. \n\nNov 15\n\n\nNurse's kidney donation triggers bi-state transplant chain\nA nurse's decision to donate a kidney to a patient triggered a series of events that led to three people getting new organs at two Kansas City-area...\n\nNov 15\n\n\nPancreatic cancer, a silent killer?\nThursday is pancreatic awareness day. \n\nNov 15\n\n\nTop tips for Thanksgiving food safety\nAfter eating, be sure to refrigerate leftovers within two hours to prevent bacteria from growing on the food.\nNov 15\n\n26-year-old's incredible face transplant journey: 'I see me'\nCam Underwood, the son of a California pastor, underwent the complicated surgery\n\nNov 15\n\n\nBrazil ex-minister: Loss of Cuban doctors will hurt millions\nA former Brazilian health minister who helped create a program that brought Cuban doctors to underserved areas is warning that millions could be left...\n\nNov 15\n\n\nCorrected study: Building, mining have high suicide rates\nCDC corrects study of highest job-related suicides, now putting construction and extraction at the top\n\nNov 15\n\n\nThe Latest: Environmentalist blasts new pesticide guidelines\nAn environmental group is blasting new recommendations by California regulators to curb a widely used pesticide blamed for harming the brains of...\n\nNov 15\n\n\nDiabetes Awareness Month: The past, present and future of diabetes treatment \nNew advances in diabetes treatment are making the disease easier to live with.\n\nNov 15\n\n\nExperts seek ways to boost extreme wildfire survival rates\nWith wildfires growing deadlier across the U.S. West, experts are suggesting ways to help people survive\n\nNov 15\n\n\n'Batkid' is cancer free 5 years after his 'wish'\nMiles Scott is now a 10-year-old who loves little league and science.\n\nNov 15\n\n\nTwins separated by surgery are healing, sticking together\nDoctors say that conjoined twins from Bhutan who were separated at an Australian hospital last week have been moving about, eating and otherwise...\n\nNov 15\n\n\nDraft EPA study finds newer nonstick compound may be harmful\nDraft report by the Environmental Protection Agency says long-term exposure to a chemical compound currently used for making nonstick coatings appears...\n\nNov 14\n\n\nUSDA urged to name turkey brands linked to salmonella outbreak\nOne person has died. \n\nNov 14\n\n\nFood safety officials stress safe handling of raw turkey\nWith Thanksgiving approaching, food safety officials are stressing the importance of proper handling and cooking practices as a nationwide outbreak of...\n\nNov 14\n\n\nMan whose wife died after collapse at hospital gets apology\nA Massachusetts man whose wife collapsed outside a locked hospital emergency room door and later died has received a face-to-face apology from the...\n\nNov 14\n\n\nChildbirth in the age of addiction: A new mom worries about maintaining sobriety\nAfter the birth of her son, doctors sent Nicole home with a bottle of Percocet. \n\nNov 14\n\n\nUS officials report a record number of tick diseases\nHealth officials say a record number of tick-borne diseases _ more than 59,000 _ were reported last year.\n\nNov 14\n\n\nJuul halts store sales of some flavored e-cigarettes\nNation's leading e-cigarette maker halts store sales of some flavors to deter use by kids\n\nNov 13\n\n\nHawaii retirement home clarifies assisted suicide rules\nA Hawaii retirement home says residents in its independent living wing may take advantage of the state's new medically assisted suicide law if they...\n\nNov 13\n\n\nNurses give breast milk to mom with breast cancer\nA pay it forward chain that began with two nurses in an Indianapolis has allowed a mother of three battling breast cancer to feed her 10-month-old...\nNov 13\n\nCambodia accuses 11 pregnant women of breaking surrogacy law\nA Cambodian court has charged 11 pregnant women and seven other people with violating laws against surrogate births; Cambodia outlawed surrogacy in...\n\nNov 13\n\n\nOfficials investigating 252 possible cases of polio-like illness AFM\nThere have been 90 confirmed cases in 27 states, the CDC said. \n\nNov 13\n\n\nWhat is AFM?\nAcute flaccid myelitis (AFM) is a rare, debilitating disease with symptoms that mimic polio.\nNov 13\n\nNurses donate breast milk to mom with breast cancer\nKata Carter was diagnosed when her youngest daughter was three-months-old.\n\nNov 13\n\n\nMore US kids get paralyzing illness, cause is still unknown\nMore children have been diagnosed with a mysterious paralyzing illness, and U.S. health officials still aren't sure what's causing it\n\nNov 13\n\n\n'Make-a-Wish' wishes decrease trips to hospital for sick children: Study\n\"Wishes make life better for kids with critical illnesses.”\n\nNov 13\n\n\nMayo Clinic receives record $200M gift from Michigan donor\nA corporate strategist from Michigan has given Mayo Clinic its largest gift ever _ $200 million\n\nNov 13\n\n\nMore leeway for states to expand inpatient mental health\nTrump administration allowing states to seek Medicaid funds to expand inpatient mental health care\n\nNov 13\n\n\nWHO official predicts 6 more months battling Ebola in Congo\nThe emergencies chief for the World Health Organization says he expects Congo's Ebola outbreak will last at least another six months, and says...\n\nNov 13\n\n\nTo curb STD rise, doctors treat patients' partners without an office visit \nSTD rates have hit an all-time high, according to the CDC. \n\nNov 13\n\n\nAmid drug crisis, spiritual first responders hit the streets\nClergy members have become spiritual first responders in the opioid crisis, often leaving the pulpit to minister on the streets\n\nNov 13\n\n\nGermany: Male nurse suspected of killing 6 elderly patients\nGerman authorities say a male nurse is suspected of killing six elderly patients, and attempting to kill at least three more over a period of almost a...\n\nNov 13\n\n\nAP Interview: US VP's wife champions art therapy in Japan\nVP Pence's wife announced a $54,000 grant to a teacher at a Japanese university for the study of art therapy, the profession Pence has chosen as her...\n\nNov 13\n\n\nNew cholesterol guidelines for heart health: What you need to know\nThe guidelines advocate for more aggressive treatment with statin therapy.\n\nNov 12\n\n\nNew physical fitness guidelines start at age 3: Here's how to get your kids moving\nOnly one in five teenagers meet the government's physical fitness guidelines.\n\nNov 12\n\n\n\n\t\t\t\t\t\t\t\tIn Minnesota's worst measles outbreak, a battle of beliefs over vaccines\n\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tWhat patients need to know about new recommendations for prostate cancer screening\n\t\t\t\t\t\t\t\n", "paragraph": ""}