{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nProgressive Christine Hallquist could be the nation's 1st transgender governor Progressive Christine Hallquist could be the nation's 1st transgender governor  Andrew Gillum concedes Florida governor's race to Republican Ron DeSantis  Betsy DeVos pitches new protections for students accused of sexual assault  Controversies hamper candidates in Mississippi Senate race   The sisterhood of congressional 'firsts': Diverse group of newly elected women bond   Family of immigrant WWI soldier receives his Purple Heart 100 years after death  Sunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Papadopoulos launches late bid to delay looming prison term  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Fraternity suspended after member critically injured in fall  Trump says he finished answering questions from special counsel  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\n\n\nVermont is poised to make history for the LGBTQ community if voters in the Green Mountain State oust their current governor in favor of first-time candidate Christine Hallquist.\n\nThe Democrat running in Vermont’s gubernatorial election, will be the first transgender governor in the nation if elected on Tuesday.\n\nAfter securing her party’s nomination in August, Hallquist is up against Republican incumbent Gov. Phil Scott, who is running for a second term in the historically blue state. Scott is facing a tough challenge since his approval ratings with his GOP base have tumbled following recent efforts to tighten gun control in Vermont.\n\nDespite being a liberal stronghold, particularly in presidential elections, Vermont residents are staunch supporters of gun rights -- with the state scoring an \"F\" according to the Giffords Law Center.\n\n\n\nAdvancing a progressive platform focused on economic and social justice, including a $15 minimum wage, environmentally sustainable rural development and expanding access to internet services, the Democratic hopeful edged out challengers in a crowded primary.\n\n\"I am so proud to be the face of the Democrats tonight,\" Hallquist said during her primary victory party.\n\n\n\nAlong with Vermont Sen. Bernie Sanders, an Independent who caucuses with Democrats, former President Barack Obama and former Vice President Joe Biden endorsed Hallquist. During her primary race, she received the backing of Justice Democrats, a progressive political action committee founded by former Sanders campaign leaders, including Cenk Uygur of \"The Young Turks,\" which helped propel leftist superstar Alexandria Ocasio-Cortez to her victory over longtime New York 14th Congressional District incumbent Joe Crowley earlier this summer.\n\n\n\nHallquist joins three other openly LGBTQ candidates for governor this year -- a historically high number -- including Lupe Valdez of Texas, Kate Brown of Oregon and Jared Polis of Colorado, all Democrats.\n\nBefore making a bid for governor, Hallquist was the chief executive of the Vermont Electric Cooperative for 12 years. She transitioned from male to female in 2015, and became the first business leader in the country to transition while in office.\n\n\n\nABC News partner FiveThirtyEight lists the race as likely electing the Republican candidate and forecasts a 11.6 point lead for Scott, as of Nov. 4.\n\nABC News’ Lee Harris contributed to this report."}