{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\n\n\tInternational News\n\n\t\t\t\t\t\t\t\tTrump says reports that CIA has tied Saudi prince to Khashoggi murder are 'premature'\n\t\t\t\t\t\t\t\n\nArgentine sub found after going missing last year\n\nThreat of violence at home spurs LGBT migrants on\n\nMigrants get cool reception in Mexican border town\n\nCrossing ends American dream for migrant\n\nMigrants won't see armed US soldiers on border\n\nAudio said to shed new light on Khashoggi murder\n\nAs new Egypt capital built, what becomes of Cairo?\n\nGreece: Police, anarchists mark 1973 uprising with clashes\n\nSpat over WWII brothels shows Japan's trouble in facing past\n\nFree speech threat seen in prosecuting WikiLeaks' Assange\n\n\n\t                                        CIA reportedly links Crown Prince to journalist's death\n\t                                    \n\n\n\t                                        Assange secretly charged by US authorities: Document\n\t                                    \n\n\n\t                                        Wildfires rage, soccer players fly, royals remember: World in Photos \n\t                                    \n\n\n\t                                        Prince William calls out tech companies during UK's anti-bullying week\n\t                                    \n\n\n\t                                        FBI, Aruba authorities investigate woman's cruise ship death\n\t                                    \n\n\n\t                                        North Korea releases American, announces new weapon\n\t                                    \n\n\n\t                                        'The Boys in the Cave': How 12 boys, coach escaped a cave in Thailand\n\t                                    \n\n\n\t                                        FBI investigating the death of a woman falling to her death on a cruise ship\n\t                                    \n\n\n\t                                        American tourist missing in Mexico\n\t                                    \n\n\n\t                                        South Koreans sing along to 'Bohemian Rhapsody' in special film screenings\n\t                                    \n\n\n\t                                        Theresa May defends draft plan on Brexit\n\t                                    \n\n\n\t                                        First snowfall, a foggy forest, migrants view the US: World in Photos\n\t                                    \n\nThe Latest: US signs up to bring power to Papua New Guinea\nFour countries including the U.S. have signed up to an effort to bring electricity to 70 percent of Papua New Guinea's people by 2030\n\n1h ago\n\n\nCyclone kills 33 in India with thousands in relief camps\nThe death toll from a cyclone that hit the coast of southern India has risen to 33\n\n1h ago\n\n\nActivists detained after boarding palm oil tanker off Spain\nGreenpeace says six of its activists boarded a tanker transporting Indonesian palm oil in the Gulf of Cadiz and were detained by its captain\n\n2h ago\n\n\nMigrants get cool reception in Mexican border town\nMany of the nearly 3,000 migrants who have reached the border with California say they do not feel welcome in the Mexican city of Tijuana\n\nNov 17\n\n\nGreece: Police, anarchists mark 1973 uprising with clashes\nGreek police say clashes have broken out between police and anarchists in Athens and Thessaloniki on the anniversary of a 1973 student uprising...\n\nNov 17\n\n\nArgentina minister says country without means to rescue sub\nThe Argentine government acknowledged on Saturday that it lacked the proper technology to rescue the submarine found deep in the Atlantic that...\n\nNov 17\n\n\nJudge frees Somali immigrant who was detained 9 months\nA federal judge has freed a Somali immigrant who was held for nine months in a New Hampshire jail\n\nNov 17\n\n\nTrump says reports that CIA has tied Saudi prince to Khashoggi murder are 'premature'\nPresident Trump promised a complete report on the killing by Tuesday. \n\nNov 17\n\n\nC. African Republic militia leader turned over to tribunal\nThe International Criminal Court says a commander in a Central African Republic militia has been arrested and turned over to the court to face charges...\n\nNov 17\n\n\nThreat of violence at home spurs LGBT migrants on to the border\nA group of LGBT people arrived in Tijuana and said they will seek asylum. \n\nNov 17\n\n\nChechen official says only bomber dies in checkpoint attack\nChechen official says woman detonated explosive vest outside capital, no one else killed or injured\n\nNov 17\n\n\nDeath toll from cyclone that hit coast of southern India has risen to 33; authorities rush help to evacuees\nDeath toll from cyclone that hit coast of southern India has risen to 33; authorities rush help to evacuees\n\nNov 17\n\n\nPakistani Taliban kill former police officer in Quetta\nPakistani police say gunmen have shot dead a former senior police officer in a drive-by shooting in the southwestern city of Quetta\n\nNov 17\n\n\nUS military chief says tech giants should work with Pentagon\nThe top U.S. military officer says it's problematic that American tech companies don't want to work with the Pentagon but are willing to engage with...\n\nNov 17\n\n\nSupporters, opponents clash over Dutch character Black Pete\nScattered confrontations break out between supporters and opponents of the controversial helper of the Dutch version of Santa Claus amid a fierce and...\n\nNov 17\n\n\nReport: US-led airstrikes kill 40 in IS-held area of Syria\nA Syria war monitor and state media are reporting that at least 40 people, mostly civilians, have been killed by U.S.-led airstrikes on the last...\n\nNov 17\n\n\nSearch on for 8 missing Algerian migrants near Sardinia\nItaly's coast guard is searching for eight Algerian migrants who apparently tried to swim to shore when the motor of their boat failed off Sardinia's...\n\nNov 17\n\n\nCzechs rally against PM on Velvet Revolution anniversary\nThousands of Czechs have used the anniversary of their country's 1989 anti-communist Velvet Revolution to rally against Prime Minister Andrej Babis\n\nNov 17\n\n\nIraq's president visits Iran weeks after US renews sanctions\nIraq's president is visiting Iran less than two weeks after the United States restored oil sanctions that had been lifted under the 2015 nuclear deal\n\nNov 17\n\n\nDeadly crossing ends American dream for Guatemalan migrant\nMisael Paiz, 25, tried to cross the U.S. border earlier this year.\n\nNov 17\n\n\nCongo rebels attack, burn homes near UN base in east\nCongo's army spokesman says rebels have burned homes and a car in a neighborhood in the country's east where U.N. peacekeeping forces have a base\n\nNov 17\n\n\nThailand recovers boat that sank in July, killing 47 Chinese\nOfficials have recovered a boat that sank in rough weather off Thailand's southern resort island of Phuket in July, killing 47 Chinese tourists\n\nNov 17\n\n\nAzerbaijan opposition leaders arrested in capital\nAuthorities in Azerbaijan have arrested two opposition leaders in the capital for attempting to organize a procession, including the laying of...\n\nNov 17\n\n\nTurkey: 8 activists held over anti-govt protests released\nMedia reports say Turkish authorities have released from custody eight activists who were detained over allegations they supported mass...\n\nNov 17\n\n\nNew president replaces autocratic leader in the Maldives\nIbrahim Mohamed Solih has taken over as president of the Maldives following a fierce political discord caused by the autocratic rule of outgoing...\n\nNov 17\n\n\nAfrican leaders applaud Ethiopia prime minister for reforms\nAfrica's leaders applauded Ethiopia's Prime Minister Abiy Ahmed for making substantial reforms in his country as they met to consider improvements to...\n\nNov 17\n\n\nAfghan official: Taliban target police checkpoint, killing 5\nAn Afghan official says that at least five police officers have been killed when their checkpoint came under attack by insurgents in the northwestern...\n\nNov 17\n\n\nArgentine submarine found at bottom of Atlantic after year of searching\nThe submarine was lost on Nov. 15, 2017.\n\nNov 17\n\n\nEgyptian sentenced to death for killing Christian doctor\nEgypt has sentenced an alleged Islamic State supporter to death for stabbing and killing an 82-year-old Christian doctor in Cairo\n\nNov 17\n\n\nFacebook says steep rise in data requests from Indian gov't\nFacebook says there was a steep rise in data requests from India's government in the first half of this year as compared to the previous two years\n\nNov 17\n\n\nExperts weigh the record of Cambodia's Khmer Rouge tribunal\nExperts consider the costs and benefits of Cambodia's Khmer Rouge tribunal, which has tried and convicted a total of three defendants over nine years...\n\nNov 17\n\n\nAbe visits Darwin shrine to Japanese war dead\nJapanese Prime Minister Shinzo Abe has visited a shrine in Darwin, Australia, commemorating the deaths of 80 Japanese submariners in waters near the...\n\nNov 17\n\n\nMigrants won't see armed US soldiers on border\nAs thousands of migrants in caravan of Central American asylum-seekers converge on doorstep of US, they won't find armed soldiers standing guard\n\nNov 16\n\n\nArgentina's navy says submarine missing for year found 800 meters (2,625 feet) down in Atlantic\nArgentina's navy says submarine missing for year found 800 meters (2,625 feet) down in Atlantic\n\nNov 16\n\n\nChina's Xi: World faces choice of confrontation, cooperation\nChina's president says the world faces a choice of cooperation or confrontation in a speech to a summit of leaders that is divided by tensions...\n\nNov 16\n\n\nA look at Americans who have been detained in North Korea\nA look at Americans who have been detained in North Korea\n\nNov 16\n\n\nNorth Korea's stable exchange rates confound economists\nSign of stability? Evidence of a great sell-off? Amid harsh sanctions and massive trade imbalance, North Korea's stable exchange rates confound...\n\nNov 16\n\n\nArms dealer convicted in LA of trying to buy, sell missiles\nAuthorities say a black-market arms dealer who tried to buy anti-aircraft missiles and sell them to clients in the Middle East has been convicted of...\n\nNov 16\n\n\nAlleged Khashoggi killers discussed plot minutes before he arrived: Turkish officials\nSaudi officials continue to claim the murder wasn't sanctioned. \n\nNov 16\n\n\nTijuana mayor: Caravan influx to last at least 6 months\nWith about 3,000 Central American migrants now in the Mexican city of Tijuana, across from California, and thousands more expected, the city's mayor...\n\nNov 16\n\n\nAssange secretly charged by US authorities: Document\nA spokesman acknowledged the error on the court filing that brought the charges to light.\nNov 16\n\nUN chief reports significant results against rebels in Congo\nThe U.N. peacekeeping chief says a joint military operation by U.N. and Congolese forces to rout rebels from their strongholds in the Ebola-hit...\n\nNov 16\n\n\nGroups protest plans for possible lease sale in Beaufort\nEnvironmental groups are protesting federal plans for a possible offshore petroleum lease sale in Alaska's Beaufort Sea\n\nNov 16\n\n\nKey facts about APEC host Papua New Guinea\nPapua New Guinea hosts leaders from Pacific Rim countries, including the United States, Russia and China, this weekend in a coming-out party for the...\n\nNov 16\n\n\nColombia president snagged by protests, congressional revolt\nThe early weeks for Colombia's new president have been beset by street protests and an unruly congress that has blocked some of his flagship...\n\nNov 16\n\n\nAt Ibero-American summit, calls to address migration\nLeaders at a summit of Ibero-American nations are calling for development to alleviate waves of migrants fleeing poverty, violence, instability and...\n\nNov 16\n\n\nSocial media eases worries for migrants, families back home\nThousands of migrants in the caravan traveling through Mexico have relied on social media, text messages and brief phone calls to connect with worried...\n\nNov 16\n\n\nFree speech threat seen in prosecuting WikiLeaks' Assange\nAcademics, civil rights lawyers and journalists are worried an attempt by the United States to put WikiLeaks founder Julian Assange behind bars could...\n\nNov 16\n\n\nThe Latest: US official: American on plane from North Korea\nA U.S. official says an American citizen detained last month by North Korea has been deported and is on a flight back to the United States\n\nNov 16\n\n\nNorth Korea deports American even as it boasts of new weapon\nNorth Korea to deport American detained as it boasts of new weapon\n\nNov 16\n\n\n\n\t\t\t\t\t\t\t\tThis Week in Pictures\n\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tHumanitarian crisis in Syria\n\t\t\t\t\t\t\t\n", "paragraph": ""}