{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nUtah mayor, guard member killed by trainee in Afghanistan Utah mayor, guard member killed by trainee in Afghanistan  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Trump says he should have gone to Arlington on Veterans Day  Smoke blankets Bay Area as residents forced to don masks to breathe  Migrants won't see armed US soldiers on border  Slain journalist Khashoggi remembered in funeral service as controversy continues  At least 7 dead as snow wreaks havoc on East Coast  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  Teen accused of killing mom over bad grade charged with murder as adult  Oscar winner for 'Butch Cassidy' has died  Court filing hints at charges for WikiLeaks founder  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\n\nA Utah mayor who was also a Utah Army National Guard major training commandos in Afghanistan was fatally shot by one of his Afghan trainees, officials said Sunday.\nBrent Taylor, 39, had taken a yearlong leave of absence as mayor of North Ogden north of Salt Lake City for his deployment to Afghanistan.\nHe was a military intelligence officer with Joint Force Headquarters and was expected to return to his mayoral job in January. Another U.S. military member whose name was not immediately made public was wounded in Saturday's attack that killed Taylor, who died from wounds from small arms fire, military officials said.\nMaj. Gen. Jefferson S. Burton, the adjutant general of the Utah National Guard, told reporters that Taylor's mission was to help train and build the capacity of the Afghan national army.\n\"He was with folks he was helping and training. That's what's so painful about this. It's bitter,\" Burton said. \"I do believe that Major Taylor felt he was among friends, with people he was working with.\"\nUtah media outlets cited a statement from NATO saying that Taylor was shot by one of the commandos being trained and that the attacker was killed by Afghan forces.\nTaylor leaves behind a wife and seven children. His remains are scheduled to arrive at Dover Air Force Base in Delaware on Monday evening.\nUtah Gov. Gary Herbert said Taylor \"was there to help. He was a leader. He loved the people of Afghanistan... This is a sad day for Utah, for America.\"\n\"Brent was a hero, a patriot, a wonderful father, and a dear friend,\" U.S. Sen. Orrin Hatch of Utah said on Twitter. \"News of his death in Afghanistan is devastating. My prayers and love are with Jennie and his seven young children. His service will always be remembered.\"\nTaylor served two tours in Iraq and was on his second tour in Afghanistan.\nTaylor in January when he was being deployed told local media that he was assigned to serve on an advisory team training the staff of an Afghan commando battalion.\nHundreds of residents of North Ogden lined the street to see him off as police escorted him and his family around North Ogden, a community of about 17,000.\nTaylor became the city's mayor in 2013."}