{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\n4 bombs explode in Baghdad, killing 4, wounding about 20 4 bombs explode in Baghdad, killing 4, wounding about 20  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Trump says he should have gone to Arlington on Veterans Day  Smoke blankets Bay Area as residents forced to don masks to breathe  Migrants won't see armed US soldiers on border  Slain journalist Khashoggi remembered in funeral service as controversy continues  At least 7 dead as snow wreaks havoc on East Coast  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  Teen accused of killing mom over bad grade charged with murder as adult  Oscar winner for 'Butch Cassidy' has died  Court filing hints at charges for WikiLeaks founder  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\n\nBaghdad police say four people have been killed in four bomb blasts in the Iraqi capital, including two inside commuter minivans.\nThe blasts occurred after Sunday's evening rush hour and appeared to target Shiite districts around Baghdad, including Sadr City and Kadhimiya.\nPolice officials say the individual blasts were relatively small. They say about 20 people were wounded. The officials spoke on condition of anonymity, in line with police regulations.\nThe Islamic State group claimed responsibility in a statement posted by its Amaq News Agency and circulated on social media.\nThe militant group continues to terrorize Iraqis with kidnappings and bombings despite losing nearly all its territories to Iraqi forces last year. The group promotes violence against Shiites across the Islamic world."}