{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nNew cholesterol guidelines for heart health: What you need to know New cholesterol guidelines for heart health: What you need to know  Formerly Conjoined Twins Get Send-Off at Hospital Where They Were Separated  CDC Issues New Vaccine Guidelines for Adults  Facebook Post Helps Toddler Get Kidney From Parents' Former HS Classmate  Flu Takes a Toll in NYC, With 4 Children Reported Dead  Mumps Outbreak Reaches 367 Cases in Washington State  Girl Surprised With Super Bowl Tickets After Being Treated for Rare Cancer  In Chicago, Witnesses to Violence Turn to First Aid to Save Lives  6-Year-Old Girls Link Intelligence to Men Over Women, Study Says  Avian Flu Outbreaks Raise Concerns About Possible Pandemic   Seoul Virus Spread by Pet Rats Under Investigation in Multiple States  Teacher Aide Accused of Faking Cancer to Hide Criminal Past  More Chronically Ill Patients Have Health Insurance After ACA, Study Finds  11-Year-Old Boy Is One of the Youngest to Get Artificial Heart  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\nHeart disease is the leading cause of death in the U.S.\n\nThe American Heart Association and the American College of Cardiology, who have medical experts from around the nation on the writing committee, have released updated guidelines on managing cholesterol to minimize the risk of heart attack, stroke, and death. The new guidelines advocate for more aggressive treatment with statin therapy and getting LDL cholesterol counts, commonly referred to as “bad cholesterol” to your target level –- in general, less than 100mg/dL; for those with risk factors, less than 70mg/dL.\n\n\n\nWhat is cholesterol?\n\nCholesterol is a type of fat found in blood and cells. It travels in bundles called lipoproteins. Cholesterol itself isn’t bad -- the body needs it to make hormones, vitamin D and digestive fluids, and it helps organs function properly. But having too much cholesterol can be a problem.\n\nThere are two forms of cholesterol:\n\n- LDL (low-density lipoprotein): “bad,” unhealthy cholesterol. It builds up in arteries forming plaques, which can block the flow of oxygen-carrying blood to major organs including the heart, and has been shown to be associated with cardiovascular events including heart attacks and stroke. LDL levels are influenced by the food you eat, genetics, liver function and other factors.\n\n- HDL (high-density lipoprotein): “good,” healthy cholesterol. It takes extra cholesterol out of arteries and delivers it to the liver, removing it from the body.\n\nHow do I know if I need to lower my cholesterol?\n\nThere are three tests to talk about with your doctor:\n\n- Non-fasting blood test to measure LDL cholesterol\n\n- Coronary artery calcium score\n\n- Atherosclerotic Cardiovascular Disease (ASCVD) Risk Estimator -- an equation to calculate the 10-year future risk of a heart attack\n\nBased on these tests, your doctor will decide if you should be on a statin.\n\n\n\nWhat can I do to lower my cholesterol?\n\nLifestyle changes including exercise, a healthy diet, and quitting smoking can prevent 80 percent of heart disease. Diet has been shown to be vitally important and effective in preventing heart attacks and reducing the risk of subsequent cardiovascular events in those who have already had a heart attack. Plant-based and Mediterranean diets are effective but you must find a diet that works for you. However, lifestyle changes may not be enough; you may need to take a statin to lower your LDL further.\n\n\n\nWhat are statins?\n\nStatins prevent heart attacks by lowering LDL and reducing inflammation, among other mechanisms. They can be used to prevent a heart attack or stroke before it occurs, or prevent a second heart attack or stroke.\n\nWhat are the side effects of statins?\n\nThe risk of serious side effects range from one in 500 to one in 1,000, which is considered very low. Muscle aches are a possible side effect, but are not considered serious. An increase in the dose of statins is not associated with an increase in side effects.\n\nWhat is the bottom line of the new recommendations?\n\nTalk to your doctor about what LDL level is right for you, and use the highest dose of statin tolerated to get to that target LDL level. And, as always, continue with lifestyle modifications, including exercise, a healthy diet, and quitting smoking.\n\nJohanna Kreafle, M.D. is an emergency medicine physician at the Carolinas Medical Center in Charlotte, North Carolina, and a member of the ABC News Medical Unit.\n"}