{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\n\n\tPolitical News\n\n\t\t\t\t\t\t\t\tControversies hamper candidates in Mississippi Senate race \n\t\t\t\t\t\t\t\n\nNew rules for colleges on sexual assault\n\nTrump says he should have gone to Arlington\n\nGillum ends race, DeSantis to become FL governor\n\nGovernor: Official who said whites are 'master race' must go\n\nSaudi prince ordered Khashoggi's killing: US intel\n\nThe sisterhood of congressional 'firsts'\n\n100 years later family gets soldier's Purple Heart\n\nNancy Pelosi meets with possible rival for speaker\n\nTrump tours Paradise area, calls wildfire a 'really bad one'\n\nHouse passes bill to drop legal protections for gray wolves\n\n\n\t                                        Trump insists he, not his attorneys, wrote responses to special counsel\n\t                                    \n\n\n\t                                        Trump says he has written answers to questions from special counsel \n\t                                    \n\n\n\t                                        Retired Justice Alan Page: The White House 'is the people's house'\n\t                                    \n\n\n\t                                        Stacey Abrams calls Brian Kemp the 'victor' in Georgia's governor's race\n\t                                    \n\n\n\t                                        Who is Andrew Wheeler?\n\t                                    \n\n\n\t                                        Trump says he's finished answering Mueller's questions in Russia probe\n\t                                    \n\n\n\t                                        Trump says he's finished answering Mueller's questions, but hasn't submitted them yet\n\t                                    \n\n\n\t                                        Controversy over comments about Ocasio-Cortez's outfit\n\t                                    \n\n\n\t                                        White House restores Jim Acosta's press pass\n\t                                    \n\n\n\t                                        Judge sides with reporter, reinstates White House press credential\n\t                                    \n\n\n\t                                        CNN's Jim Acosta speaks out after his White House press pass is reinstated\n\t                                    \n\n\n\t                                        Julian Assange appears to have 'been charged' in federal court\n\t                                    \n\nAndrew Gillum concedes Florida governor's race to Republican Ron DeSantis\nAndrew Gillum conceded the race on Saturday on Facebook.\n\n3h ago\n\n\nBetsy DeVos pitches new protections for students accused of sexual assault\nNew rules expected to ensure greater 'due process' for the accused\n\nNov 17\n\n\nControversies hamper candidates in Mississippi Senate race \nMike Espy and Cindy Hyde-Smith are in a special election runoff. \n\nNov 17\n\n\nThe sisterhood of congressional 'firsts': Diverse group of newly elected women bond \nAlexandria Ocasio-Cortez posted an Instagram photo of the group dubbed “Squad.\" \n\nNov 17\n\n\nFamily of immigrant WWI soldier receives his Purple Heart 100 years after death\nThe family of Pvt. Michael Walsh has waited 100 years to honor their loved one.\n\nNov 17\n\n\nTrump says he has written answers to questions from special counsel \nABC News has learned the president objected to some of the questions from Robert Mueller; Trump said he hadn't submitted the answers yet.\nNov 16\n\nRetired Justice Alan Page: The White House 'is the people's house'\nFormer Minnesota Viking and state Justice Alan Page receives Medal of Freedom.\nNov 16\n\n\n                                                            Stacey Abrams calls Brian Kemp the 'victor' in Georgia's governor's race\n                                                        \n\nSunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt\nRep. Schiff and Sen. Blunt will be on \"This Week\" Sunday, Nov. 18.\n\nNov 16\n\n\nStacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race\nAbrams would have been the state's first African-American chief executive. \n\nNov 16\n\n\nPapadopoulos launches late bid to delay looming prison term\nThe former Trump campaign official was sentenced to 14 days in prison. \n\nNov 16\n\n\n\n                                                            Who is Andrew Wheeler?\n                                                        \n\nTrump says he's finished answering Mueller's questions in Russia probe\nEducation Secretary Betsy DeVos proposes new campus sexual assault guidelines.\nNov 16\n\nNancy Pelosi, potential challenger have 'candid' discussion on speaker's race\nRep. Marcia Fudge is considering challenging Pelosi. \n\nNov 16\n\n\nTrump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley \nThe nation's highest civilian honor went to seven Americans. \n\nNov 16\n\n\nThe DC docket shows dozens of sealed criminal indictments. Are they from Mueller?\nThe number of sealed cases awaiting action is unusual, legal experts said.\n\nNov 16\n\n\nTrump says he'll nominate acting EPA chief Andrew Wheeler to be permanent\nTrump praised Wheeler's time at EPA at a White House event Friday. \n\nNov 16\n\n\nThis day in history: Nov. 26, 2017\nAl Franken speaks out for the first time since sexual misconduct allegations.\nNov 16\n\n'The View' reacts to criticism of Alexandria Ocasio-Cortez's outfit: 'Hush boy'\nA male journalist was the center of backlash for a tweet he had posted. \n\nNov 16\n\n\n\n                                                            Trump says he's finished answering Mueller's questions, but hasn't submitted them yet\n                                                        \n\nTrump says he finished answering questions from special counsel\nTrump says he has not yet submitted the answers to Mueller's office. \n\nNov 16\n\n\nWhite House must restore CNN reporter's press pass, judge rules\nThe judge said CNN's Jim Acosta was denied his right to due process.\n\nNov 16\n\n\nTwitter lights up after journalist comments on Alexandria Ocasio-Cortez's outfit\nAlexandria Ocasio-Cortez, 29, is the center of some Twitter tussles. \n\nNov 16\n\n\n\n                                                            Judge sides with reporter, reinstates White House press credential\n                                                        \n\nNorth Korea announces weapons test; will release detained American\nKim Jong Un called the test  “successful” and “highly significant”.\n\nNov 16\n\n\nCNN's Jim Acosta speaks out after his White House press pass is reinstated\n\"Let's get back to work,\" he said after thanking the judge and his colleagues in the press.\nNov 16\n\nCourt filing hints at charges for WikiLeaks founder\nJulian Assange is famous for publishing government secrets.\n\nNov 16\n\n\n\n                                                            Julian Assange appears to have 'been charged' in federal court\n                                                        \n\nThe Note: Uneasy questions settle over post-election Washington\nThe first full week after the midterm elections come to an uneasy close. \n\nNov 16\n\n\nTrump to meet California wildfire victims\nIt will be Trump's first trip to California following a natural disaster.\n\nNov 16\n\n\nUS sanctions 17 Saudis allegedly implicated in journalist's murder\nThe men are said to be part of the hit squad that ambushed Khashoggi in Turkey. \n\nNov 16\n\n\nNavy SEALs, Marines charged with murder in death of Green Beret\nStaff Sgt. Logan Melgar was strangled to death in Mali. \n\nNov 16\n\n\nTrump met with legal team over 3 days to discuss responses to Mueller's questions\nThe president met with his legal team to discuss his written responses.\n\nNov 15\n\n\nAs deadline looms, Florida Senate race moves to a manual recount\nFlorida Senate race now moves into a manual recount.\n\nNov 15\n\n\nGraham says acting AG Whitaker will 'honor regular order' in Mueller probe\n\"Nothing I’ve seen would require him to be recused,\" Graham says.\n\nNov 15\n\n\nFlying over the Thanksgiving holiday? You could help set a record\nU.S. carriers are expecting a million more passengers compared to last year. \n\nNov 15\n\n\nUS sanctions 17 Saudi officials for role in Khashoggi's killing\nSaudi Arabia seeks death penalty for 5 suspects in journalist's killing, Palm Beach County misses FL machine recount deadline, Pelosi welcomes...\nNov 15\n\nFlorida statewide machine recount nears Thursday deadline\nPalm Beach county says it may not be able to make Florida's 3 p.m. Thursday deadline for statewide machine recount.\nNov 15\n\nPelosi taunts critics, says she still has support to be elected speaker\n\"Come on in, the water's warm,\" she said in a press conference when asked about her possible challengers.\nNov 15\n\nForest Service chief testifies before congressional committee on workplace sex abuse\nWomen wrote Vicki Christiansen to complain of ongoing harassment at work.\n\nNov 15\n\n\nJudge: Mueller case against Russian firm linked to alleged troll farm can proceed\nIt was the second time the judge denied a motion to dismiss from the firm.\n\nNov 15\n\n\nPelosi taunts critics, says she still has support to be elected speaker\nAn increasing number of Democrats question her leadership. \n\nNov 15\n\n\nScientists call on VA to study Agent Orange impact in Vietnam veterans' kids\nSome Vietnam veterans' kids say they suffer from the impact of exposure.\n\nNov 15\n\n\nJudge expected to rule whether White House must restore Jim Acosta's press pass\nThe White House argued the move does not violate the First Amendment.\n\nNov 15\n\n\nReversals in vote recounts like Florida's are very rare, experts say\nThe margins in Florida's races may be too wide for a recount to reverse. \n\nNov 15\n\n\nPresident Trump again calls Mueller probe a 'witch hunt' in tweet\nPresident Trump speaks out against Mueller probe amid incoming Dem Congress,  U.S. Treasury sanctions 17 Saudi officials for role in journalist Jamal...\nNov 15\n\nWho is Kevin McCarthy?\nRepublican Kevin McCarthy serves as Representative for California's 23rd Congressional District in the U.S. House of Representatives.\nNov 15\n\nImmigration arrests on public lands skyrocket under Trump\nThe Interior Dept. says officers have made thousands more arrests than in 2016.\n\nNov 15\n\n\nFDA looks to ban menthol cigarettes, restrict flavored e-cigarettes amid ‘epidemic'\nA leading e-cig manufacturer tried to fend off regulation this week.\n\nNov 15\n\n\nFlorida law on matching ballot signatures being applied unconstitutionally: Judge\nThe ruling complicates when the race will be officially decided. \n\nNov 15\n\n\n\n\t\t\t\t\t\t\t\tThe Note: Uneasy questions settle over post-election Washington\n\t\t\t\t\t\t\t\n", "paragraph": ""}