{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nMan sets home on fire after using blowtorch to kill spiders Man sets home on fire after using blowtorch to kill spiders  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Trump says he should have gone to Arlington on Veterans Day  Smoke blankets Bay Area as residents forced to don masks to breathe  Migrants won't see armed US soldiers on border  Slain journalist Khashoggi remembered in funeral service as controversy continues  At least 7 dead as snow wreaks havoc on East Coast  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  Teen accused of killing mom over bad grade charged with murder as adult  Oscar winner for 'Butch Cassidy' has died  Court filing hints at charges for WikiLeaks founder  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\nA man who was house-sitting for his parents set their home on fire when he used a blowtorch to kill spiders, according to authorities.\n\nFire fighters responded to a 911 call about a fire Tuesday night at a home in Fresno, California.\n\nThe tenant of a two-story residential house “just made a bad decision to use fire instead of insecticides to kill the spiders,” Lee Wilding, deputy fire marshal with the Fresno Fire Department, told ABC News.\n\n\"The tenant used a torch like a handheld propane torch to kill the spiders that were around the base of the residential structure, and in doing so some flame from the torch went in between some of the cracks and the siding and into the interior of the wall,\" Wilding said. \"It started a small fire within the wall that then traveled up into the attic through the wall space and into the attic to cause a larger fire.\"\n\n\n\n\n\nMore than 25 firefighters and two trucks were sent to the scene, according to Wilding, and it took about five minutes to put out the fire.\n\nThe fire destroyed part of the house, but the man who started the fire was not hurt.\n\n\"He was still outside when the smoke become visible,\" Wilding said.\n\n\n\n\n\n\"The occupant was cooperative and did give a full statement as to his action at the time the fire was ignited,\" said Wilding.\n\nFresno Fire Battalion Chief Tony Escobedo told ABC News Fresno affiliate KFSN-TV that the man could have used insect repellent to get rid of the spiders rather than a blowtorch.\n\n\"We don't ever recommend using some type of heating device like that to get rid of any vermin or spiders,” Escobedo told KFSN. “This probably was a bad idea.\"\n\n\n"}