{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nSupergirl's Mehcad Brooks discusses his series and new comedy 'Nobody's Fool'", "paragraph": "Coming up in the next {{countdown}} {{countdownlbl}}Coming up next:{{nextVideo.title}}{{nextVideo.description}}Skip to this video now RelatedNow Playing:{{currentVideo.title}}Play Video This transcript has been automatically generated and may not be 100% accurate.Tyler Perry opens up about 'Nobody's Fool' The filmmaker and actor discusses working with Tiffany Haddish. Now Playing: Tyler Perry opens up about 'Nobody's Fool' Now Playing: Tika Sumpter and Amber Riley open up about 'Nobody's Fool' Now Playing: Justin Bieber and Hailey Baldwin confirm marriageNow Playing: Oscar-winning writer William Goldman has died at the age of 87Now Playing: Top 10 STEM toys for the holidaysNow Playing: 'Widows' cast discuss how their characters in the movie empowered themNow Playing: Viral 'Thank You Being a Friend' star sings for 'GMA Day'Now Playing: 'Scandal' star Tony Goldwyn is playing another president in his new Broadway showNow Playing: Sara Haines met Jude Law when she was an intern and it didn't go as plannedNow Playing: Cynthia Erivo on 'Widows' and how fitness training helps balance her lifeNow Playing: Amy Schumer hospitalized with hyperemesis during second trimester of pregnancyNow Playing: Tessa Thompson shares secrets from behind the scenes of the Marvel universeNow Playing: Maddie Poppe reveals 1st contestant to make it to Hollywood on new season of 'Idol'Now Playing: Insomniac Theater: 'Fantastic Beasts: The Crimes of Grindelwald' and 'Instant Family'Now Playing: Roy Clark passes awayNow Playing: Viral superstar 'Side-Eye Chloe' is inducted into 'GMA Day' Hall of FameNow Playing: 'Sons of Anarchy' star Ron Perlman hilariously shows off his soap opera skills Now Playing: Brian Tyree Henry discusses his role in new thriller 'Widows'Now Playing: 'Real Housewives of Atlanta' star Kandi Burruss visits Times SquareNow Playing: Mahershala Ali on how his movie 'Green Book' details a part of civil rights historyNow Playing: {{itm.title}}"}