{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nBusiness Highlights Business Highlights  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Trump says he should have gone to Arlington on Veterans Day  Smoke blankets Bay Area as residents forced to don masks to breathe  Migrants won't see armed US soldiers on border  Slain journalist Khashoggi remembered in funeral service as controversy continues  At least 7 dead as snow wreaks havoc on East Coast  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  Teen accused of killing mom over bad grade charged with murder as adult  Oscar winner for 'Butch Cassidy' has died  Court filing hints at charges for WikiLeaks founder  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\n\n___\nAmazon HQ favorites: Similar basics but different vibes\nNEW YORK (AP) — The communities said to be favored for new bases for Amazon are both riverfront stretches of major metro areas with ample transportation and space for workers. But there are plenty of differences between New York's Long Island City and Crystal City in northern Virginia. Crystal City is a thicket of 1980s-era office towers trying to plug into new economic energy. Long Island City is an old manufacturing area already being reinvented as a hub for industry, creativity and urbane living.\n———\nTech giants slide, pulling US stock market sharply lower\nNEW YORK (AP) — A broad sell-off in technology companies pulled U.S. stocks sharply lower Monday, knocking more than 600 points off the Dow Jones Industrial Average. The wave of selling ensnared a number of big names, including Apple, Amazon and Goldman Sachs. Banks, consumer-focused companies, and media and communications stocks all took heavy losses. Crude oil prices fell, erasing early gains. The jittery trading followed two weeks of mostly steady gains.\n———\nEU, UK inch closer to a deal as Brexit hangs in the balance\nBRUSSELS (AP) — Britain and the European Union appear to be inching inched toward agreement on a Brexit deal, but British Prime Minister Theresa May faces intensifying pressure from feuding pro-EU and pro-Brexit factions of her divided Conservative government. Britain leaves the EU on March 29 — the first country ever to do so — but a deal must be sealed in the coming weeks to leave enough time for the U.K. Parliament and European Parliament to sign off.\n———\nAbu Dhabi summit: Oil production cuts may be necessary\nABU DHABI, United Arab Emirates (AP) — Saudi Arabia's energy minister says OPEC and allied oil-producing countries will likely need to cut crude supplies, perhaps by as much as 1 million barrels of oil a day, to rebalance the market after U.S. sanctions on Iran failed to cut Tehran's output. His comments show the balancing act U.S. allies face in dealing with President Donald Trump's actions related to the oil industry.\n———\nPocket money apps aim to help kids in cashless world\nLONDON (AP) — For kids growing up in today's cashless society, the piggy bank is going virtual. A wave of digital pocket money apps that come with prepaid cards are new tools for financial education as money increasingly goes digital, in a shift that's raising uncertainty about how cashless transactions affect youngsters' view of money.\n———\nOptions limited, North Korea lit by flashlights, creaky grid\nPYONGYANG, North Korea (AP) — Twenty-plus years ago, North Korea's then-leader almost bargained away nuclear weapons for a pair of reactors. The country today has its weapons — and chronic power blackouts. Despite years of sanctions that limited its energy options, Kim Jong Un's North Korea has cobbled together a creative smorgasbord of alternative resources, some off the official grid and some flat-out illegal.\n———\nSmall businesses band together for Small Business Saturday\nNEW YORK (AP) — Many small and independent retailers who are holding Small Business Saturday shopping events Thanksgiving weekend are banding together with others, believing here's strength in numbers. Small Business Saturday, started in 2010 to encourage consumers to shop in small local stores rather than national chains, has become an event in neighborhoods, towns, even cities as retailers recognize they can draw more customers as a cohesive group than by offering discounts and promotions on their own.\n———\nTrump complains about allies' spending after France trip\nWASHINGTON (AP) — Fresh from a trip to France where his brand of \"nationalism\" drew rebuke from his hosts, President Donald Trump says \"much was accomplished\" in his meetings. But he's raising a familiar complaint about U.S. allies' spending on defense. Trump tweeted Monday that the U.S. pays billions \"protecting other countries, and we get nothing but Trade Deficits and Losses.\"\n———\n50 countries vow to fight cybercrime - US and Russia don't\nPARIS (AP) — Fifty nations and over 150 tech companies are pledging to do more to fight criminal activity on the internet, including interference in elections and hate speech. But the United States, Russia and China are not among them.\n———\nTurkish Cypriot leader: mix region's gas, send via Turkey\nNICOSIA, Cyprus (AP) — The leader of Cyprus' breakaway Turkish Cypriots says an accord reunifying the ethnically split island nation could unlock a deal to convey gas discovered in fields off Israel, Egypt and Cyprus to markets through neighboring Turkey's pipeline network. Mustafa Akinci has told a news conference that Turkey is the \"logical\" route to markets for east Mediterranean gas, but that a Cyprus peace deal must precede any such plans.\n———\nThe S&P 500 index dropped 54.79 points, or 2 percent, to 2,726.22. The Dow fell 602.12 points, or 2.3 percent, to 25,387.18. The Nasdaq composite slid 206.03 points, or 2.8 percent, to 7,200.87. The Russell 2000 index of smaller companies gave up 30.70 points, or 2 percent, to 1,518.79.\nBenchmark U.S. crude fell 0.4 percent to settle at $59.93 per barrel in New York. Brent crude, used to price international oils, dipped 0.1 percent to close at $70.12 per barrel in London. Heating oil fell 0.8 percent to $2.16 a gallon and wholesale gasoline gained 0.9 percent to $1.64 a gallon. Natural gas rose 1.9 percent to $3.79 per 1,000 cubic feet."}