{"id": "First Look: Disney Skyliner Gondola at Walt Disney World Resort", "paragraph": "by Thomas Smith, Editorial Content Director, Disney ParksEarlier this week, we shared the exciting update that our new Disney Skyliner gondola system will be operating at the Walt Disney World Resort in fall of 2019.  Today, we’ve got more to share – a first look at one of the actual gondolas! Disney Parks, Experiences and Consumer Products Chairman Bob Chapek unveiled the gondola to Disney fans during D23’s Destination D: Celebrating Mickey Mouse event. And as you can see, Disney Skyliner will be fun and offer a new way to experience Walt Disney World Resort with amazing views only available from the sky.       Once operating, the gondola system will connect Disney’s Hollywood Studios and Epcot to four resort hotels- Disney’s Art of Animation Resort, Disney’s Pop Century Resort and Disney’s Caribbean Beach Resort as well as the proposed 15th Disney Vacation Club property, Disney’s Riviera Resort.And select gondolas will have iconic Disney characters incorporated into their exterior design to give the appearance that a Disney pal is riding along with guests, such as characters from the ‘Fab Five,’ figures from Disney attractions, fan favorites from movies, and more.Keep checking the Disney Parks Blog for more exciting details on Disney Skyliner.Can you cofirm if the Skyliner will have airconditioning in each gondola. There are rumors swirling that they will not have A/C.Food & Beverage Content Relations Coordinatorby Thomas Smith, Editorial Content Director, Disney Parks\n\r\n      Start planning your dream Disney Vacation\r\n      View Videos\n© Disney, All Rights Reserved\nSign Up\nBy submitting this form, you are granting Disney Parks Blog permission to email you. You can revoke permission to mail your email address at any time using the unsubscribe link, found at the bottom of every email. We take your privacy seriously. For more information on our data collection and use practices, please read our Privacy Policy.By providing my email address I'd like to receive updates, special offers, and other information via electronic messages and postal mail from Disney Destinations, LLC and other members of The Walt Disney Family of Companies.You can withdraw your consent for these messages at any time. For more information on our data collection and use practices, and managing your preferences, please read our privacy policy."}