{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\n\n\tEntertainment News\n\n\t\t\t\t\t\t\t\tMan apologies for shouting 'Heil Hitler' at show\n\t\t\t\t\t\t\t\n\n'Instant Family' uses laughter to shine a light on adoption\n\nAPNewsBreak: Obama's memoir sells more than 725,000 copies\n\nRoy Clark, country guitar virtuoso, has died\n\nCreed II' goes more than the distance: Review\n\nOscar winner for 'Butch Cassidy' has died\n\nPrivate funeral held for Stan Lee, more memorials in works\n\nDisney's new 'Star Wars: Galaxy's Edge' attraction\n\n\n\t                                        Justin Bieber and Hailey Baldwin confirm marriage\n\t                                    \n\n\n\t                                        Oscar-winning writer William Goldman has died at the age of 87\n\t                                    \n\n\n\t                                        Top 10 STEM toys for the holidays\n\t                                    \n\n\n\t                                        'Widows' cast discuss how their characters in the movie empowered them\n\t                                    \n\n\n\t                                        Viral 'Thank You Being a Friend' star sings for 'GMA Day'\n\t                                    \n\n\n\t                                        'Scandal' star Tony Goldwyn is playing another president in his new Broadway show\n\t                                    \n\n\n\t                                        Sara Haines met Jude Law when she was an intern and it didn't go as planned\n\t                                    \n\n\n\t                                        Cynthia Erivo on 'Widows' and how fitness training helps balance her life\n\t                                    \n\n\n\t                                        Amy Schumer hospitalized with hyperemesis during second trimester of pregnancy\n\t                                    \n\n\n\t                                        Tessa Thompson shares secrets from behind the scenes of the Marvel universe\n\t                                    \n\n\n\t                                        Maddie Poppe reveals 1st contestant to make it to Hollywood on new season of 'Idol'\n\t                                    \n\n\n\t                                        Insomniac Theater: 'Fantastic Beasts: The Crimes of Grindelwald' and 'Instant Family'\n\t                                    \n\nMichael Buble on how his son's fight with cancer changed him \nSinger Michael Buble opened up on son's battle with cancer.\n\nNov 16\n\n\nWhat we know  so far about Kate Upton's life as a new mom\nKate Upton shared an adorable photo of her husband holding their newborn. \n\nNov 16\n\n\n'Widows' actress on how fitness training helps balance her life\nTry and wrap your head around this one.  \n\nNov 16\n\n\nMariah Carey celebrates first snow of the season with her holiday anthem\nMariah Carey is already in the Christmas spirit.\n\nNov 16\n\n\nHow Serena Williams learned to love her body\n\"You're never going to be as thin as [Venus] and that's OK,\" she was told.\n\nNov 16\n\n\nTamera Mowry-Housley's niece Alaina laid to rest after Thousand Oaks mass shooting\nAlaina was a victim in the Thousand Oaks shooting last week.\n\nNov 16\n\n\nHow Michael B. Jordan is changing the game in front of and behind the camera\nThe 31-year-old actor is starring in and producing diverse roles.\n\nNov 16\n\n\nWhy you need to meet the 2 young stars of 'Haunting of Hill House'\nGet to know breakout stars Julian Hilliard and Violet McGraw.\n\nNov 16\n\n\nDior and Jennifer Lawrence face claims of cultural appropriation over new campaign \nDior and actress Jennifer Lawrence are facing cultural appropriation backlash.\n\nNov 15\n\n\nPrince William delivers powerful speech on cyberbullying\nWilliam and Kate visited the BBC during Anti-Bullying Week.\n\nNov 15\n\n\nAmy Schumer hospitalized with hyperemesis during second trimester of pregnancy\n\"Everyone who says the 2nd trimester is better is not telling the full story.\"\n\nNov 15\n\n\nJessie J reveals to fans during concert that she's infertile\nJessie J told fans that four years ago she learned she cannot have children. \n\nNov 15\n\n\nOscar winner responds to backlash over co-star's use of 'N' word\nThe 'Green Book' star said he absolutely loves and adores Viggo Mortensen.\n\nNov 15\n\n\nA film is being made about the youngest female trader ever at the stock exchange\nShe's just 23 years old, get to know her!\n\nNov 15\n\n\nNew host of Project Runway, supermodel Karlie Kloss, gives a first look at the show\nSupermodel Karlie Kloss shares a first look of the new \"Project Runway\" season.\n\nNov 15\n\n\nSam Elliott on 'A Star is Born' and the telltale sign that he'd snagged the role\nSam Elliott's supporting role in the new romantic drama \n\nNov 15\n\n\n'Dumbo' live-action trailer is so adorable, you'll cry\nWait till you see our little hero fly!\n\nNov 15\n\n\nCarrie Underwood reveals she's having a boy at CMA Awards\nThe singer shared the news onstage while hosting the awards show.\n\nNov 15\n\n\n'Green Book' star Mahershala Ali reveals he's been 'working on' a new music project \nThe Oscar-winning actor has a music project specifically tied to the film. \n\nNov 15\n\n\nKeith Urban, Carrie Underwood big winners at CMA Awards\nKeith Urban also performed on the show, co-hosted by Carrie Underwood.\n\nNov 15\n\n\nSupermodel Karlie Kloss turns coding passion into a summer coding camps for girls\nThe supermodel has been hooked on the skill of coding for years.\n\nNov 14\n\n\n'The View' weighs in on Melania Trump's public denouncement of White House adviser\n\"The View\" weighed in on headlines that the normally very private first lady publicly called for the deputy national security adviser to be...\n\nNov 14\n\n\nArie Luyendyk Jr. and Lauren Burnham are expecting their first child\nThere’s a baby coming to Bachelor Nation.\n\nNov 14\n\n\nHow Lady Gaga rallied her fan base to help California wildfire evacuees\nLady Gaga visited shelters in California to lend support to wildfire evacuees. \n\nNov 14\n\n\n'Journeys of Faith with Paula Faris': How faith has helped guide Luke Bryan\n'Journeys of Faith with Paula Faris': How faith has helped guide Luke Bryan\n\nNov 14\n\n\nJohn Legend's speech praising Chrissy Teigen is making all of us swoon\nJohn Legend praised his wife Glamour's 2018 Women of the Year Awards.\n\nNov 13\n\n\nNew royal family photos released for Prince Charles' 70th birthday\nPrince Harry and Meghan Markle are also part of the newly-released family photos\n\nNov 13\n\n\nHugh Jackman defends longtime friendship with Ivanka Trump and Jared Kushner\nHugh Jackman defended his longtime friendship with Ivanka Trump and Jared Kushner on “The View” Tuesday.\n\nThe couple, who Jackman told “The View” he’s...\n\nNov 13\n\n\nLorde to Kanye West and Kid Cudi: 'Don't steal -- not from women'\nLorde was not playing around. \n\nNov 13\n\n\nViola Davis reveals the most epic life lesson given by her 8-year-old daughter\nViola Davis is taking on her latest role in the upcoming film, \"Widows.\"\n\nNov 13\n\n\nMichelle Obama says her brother is still their mother's favorite\nThe former first lady's memoir, \"Becoming,\" was released on Nov. 13.\n\nNov 13\n\n\n'Game of Thrones' is coming back sooner than you think!\nHBO revealed Monday that April will bring the final season.\n\nNov 13\n\n\nMichelle Obama thanks Bush sisters, Chelsea Clinton for defending Malia and Sasha\nObama writes about her family and her time in the White House in \"Becoming.\"\n\nNov 13\n\n\nCeline Dion teases 'grand unveiling' of gender-neutral children's clothing line\nThe singer posted a satirical video on social media.\n\nNov 13\n\n\nMichelle Obama on historic midterms and whether Hillary Clinton should run in 2020\nThe former first lady speaks about her time in the White House in \"Becoming.\"\n\nNov 13\n\n\n'Dancing With the Stars' semi-finals recap: A jaw-dropping double elimination\nGet the whole story!\n\nNov 13\n\n\nGuy Fieri fed first responders fighting California wildfires \nGuy Fieri served dinner to law enforcement battling the wildfires in California.\n\nNov 12\n\n\nBruno Mars wraps up tour by treating 24,000 Hawaiians to Thanksgiving dinner\nGet the full story!\n\nNov 12\n\n\nChris Evans, Hugh Jackman, more mourn the passing of Stan Lee\nThe legend died Monday at the age of 95.\n\nNov 12\n\n\nMarvel Comics legend Stan Lee dies at 95\nLee created beloved characters including Spider-Man, Iron Man, and the Hulk.\n\nNov 12\n\n\nVictoria Beckham delivers acceptance speech 'Spice Girls' fans will love\nVictoria Beckham accepted the Fashion Icon Award at the People's Choice Awards.\n\nNov 12\n\n\nEverything we know so far about 'Toy Story 4'\nA new teaser trailer dropped today!\n\nNov 12\n\n\n2018 People's Choice Awards: Complete winners list\n\"Avengers,\" \"Shadowhunters\" won big!\n\nNov 12\n\n\nWoods, Witherspoon, others use social media to help those displaced in CA wildfires\nThe celebrities have started quite a movement online.\n\nNov 12\n\n\nMichelle Obama surprises a dance class at her former high school and it's amazing \nObama visited Chicago with Robin Roberts ahead of the release of \"Becoming.\"\n\nNov 12\n\n\nHoliday movies to stream on Netflix this season!\nCheck out the list!\n\nNov 12\n\n\nTRANSCRIPT: 'GMA' co-anchor Robin Roberts interviews former first lady Michelle Obama\nFormer first lady shares journey from Chicago's south side to the White House.\n\nNov 11\n\n\nMichelle Obama on what she wants others to know about her marriage: 'We work on' it\nMichelle Obama delves into her marriage in her new memoir \"Becoming.\"\n\nNov 11\n\n\nMichelle Obama on her legacy and her reaction to Donald Trump winning the presidency\nMichelle Obama shares deeply personal issues in her new memoir, \"Becoming.\"\n\nNov 11\n\n\nHollywood strikes back after Trump's fire tweet\nA raft of celebrities took to Twitter Saturday to slam the U.S. president. \n\nNov 11\n\n\n\n\t\t\t\t\t\t\t\tStan Lee, Paul Allen, Gary Kurtz and other notable people lost in 2018\n\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tCynthia Erivo on 'Widows' and how fitness training helps balance her life\n\t\t\t\t\t\t\t\n", "paragraph": ""}