{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nSpecial counsel witness says he expects to be charged in Mueller probe Special counsel witness says he expects to be charged in Mueller probe  Andrew Gillum concedes Florida governor's race to Republican Ron DeSantis  Betsy DeVos pitches new protections for students accused of sexual assault  Controversies hamper candidates in Mississippi Senate race   The sisterhood of congressional 'firsts': Diverse group of newly elected women bond   Family of immigrant WWI soldier receives his Purple Heart 100 years after death  Sunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Papadopoulos launches late bid to delay looming prison term  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Fraternity suspended after member critically injured in fall  Trump says he finished answering questions from special counsel  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\nThe former Infowars Washington bureau chief, who recently testified before a federal grand jury in special counsel Robert Mueller’s probe into Russian interference in the 2016 U.S. presidential election, tells ABC News that after two months of closed-door talks with investigators, the special counsel has now indicated he will be charged within a matter of days.\n\n“I don’t know what they’re going to charge me with,” said Jerome Corsi in an interview with ABC News on Monday. “I think my only crime was that I support Donald Trump. That's my crime, and now I'm going to go to prison for the rest of my life for cooperating with them,” he later added.\n\nCorsi is one of more than a dozen individuals associated with political operative Roger Stone -- a longtime and close ally of President Donald Trump -- who have been contacted by the special counsel. The witnesses, many of whom have appeared before the grand jury impaneled by Mueller’s team, have told ABC News they were asked about Stone’s dealings during the 2016 election and what if any contact he may have had with Wikileaks founder Julian Assange through an intermediary, which Stone denies.\n\nMuch remains unknown about Mueller’s interest in Stone. But Corsi has emerged as a central figure of interest to Mueller as he builds his case, sources confirm to ABC News. Corsi, who Stone told ABC News he has known for years, has frequently appeared with Stone on-air for Infowars, where Stone currently serves as a contributor.\n\nCorsi described his experience with the investigation as “a horror show” and “a nightmare,” telling ABC News the special counsel’s probe, “Is an inquisition worthy of the KGB or the Gestapo. I feel like I've been through an interrogation session in North Korea in the Korean war.”\n\n\n\nThe special counsel’s office declined to comment on Corsi’s remarks to ABC News.\n\nIn recent weeks, ABC News reported that Corsi returned to Washington, D.C., again for more closed-door meetings with special counsel investigators, and was scheduled to make a second appearance before the federal grand jury in the probe. However, Corsi’s second grand jury testimony was ultimately canceled, and Corsi says prosecutors with the special counsel’s office told his attorney to expect forthcoming charges.\n\nReached by ABC News on Monday, Corsi's lawyer, David Gray, declined to comment on the matter.\n\nShortly after his interview with ABC News, Corsi hosted a live stream on his YouTube page in which he reiterated his expectation to be indicted, telling supporters; “I fully anticipate in the next few days to be indicted by Mueller.”\n\nMueller’s interest in Corsi is believed to stem from his alleged early discussions about efforts to unearth then-candidate Hillary Clinton’s emails. The special counsel has evidence that suggests Corsi may have had advance knowledge that the email account of Clinton’s campaign manager, John Podesta, had been hacked and that WikiLeaks had obtained a trove of damning emails from it, two sources with direct knowledge of the matter told ABC News.\n\nCorsi’s account to ABC News of his time spent with investigators also identifies Wikileaks’ release of Podesta’s hacked emails as key to the special counsel’s inquiry of him.\n\nIn response to ABC News’ interview with Corsi, Stone defended Corsi as “a man who has been squeezed hard but refuses to do anything but tell the truth,” and called into question both his and Corsi’s alleged connections to Wikileaks.\n\n“They seem to think you know that I knew in advance what Assange was going to do; I'm not going to go into details at this point, but that was the basis of it,” said Corsi. “And as far as I can recall, I had no contact with Assange. And that didn't seem to satisfy them.”\n\nCorsi said he was first approached in late August by FBI agents at his home in New Jersey, who presented him with a subpoena to testify before Mueller’s grand jury. Corsi added that over the last two months, he’s spent 40 hours with investigators over the course of six meetings, which he says have included special counsel prosecutors and an FBI agent.\n\nAfter the subpoena was served, Corsi said that he decided to cooperate with the special counsel’s office.\n\n“I had two computers that I used, I handed them both over, a time machine that recorded all the emails in my computer in a contemporaneous state 2016 -- completely unaltered,” he said. “I worked with the FBI at Quantico so that they could easily recover all my tweets and my Google account. My Google account they could see every place I've been, every click I've made, everything Google records.”\n\nAfter the FBI’s visit, Corsi said, he and his attorney agreed to cooperate with the special counsel’s office and proffered to meet with special counsel investigators to answer their questions. “They have everything: Electronic surveillance -- everything electronic probably that I ever did in my life if they wanted -- every credit card, every phone call, every email, and I turned it all over to them as well,” he added.\n\nDeclining to give specific details on the matter until Corsi learns what he’s potentially charged with, he said the special counsel initially wanted him as a witness and told him he had not committed any crimes.\n\n“And then it blows apart...at the end of two months...this deteriorates, and after a while, my mind became mush,” he said. “And every time I'm scared to death.”\n\nCorsi said that from there, after two months of questioning, things deteriorated between him and investigators.\n\n“They make it sound like it all fell apart and they were constantly pressing me on did I have a contact with Assange, and -- to the best of my knowledge -- I never had a contact with Assange,” Corsi said to ABC News. “And they just couldn't believe that because they said I seemed to know too much about what Assange was going to do. And I said you know that's what I do in my business: I try to connect the dots.”\n\nWhile Corsi is not a widely-recognized figure, his handiwork in the political arena has at times become very well known. He has served as the pioneer of several enduring political smear campaigns during national campaigns throughout the 2000s.\n\nCorsi’s most penetrating smear campaign is the same one that helped forge his bond with Trump. He is widely considered one of the early promoters of the so-called “birther” movement, which pursued the idea that former President Barack Obama was born in Kenya, not in America. The theory was debunked and widely denounced as baseless, racist vitriol. Corsi and Trump have long been blasted for not walking back their claims even after Obama produced his long-form birth certificate. In fact, it was only in the final stretch of his successful 2016 presidential bid that Trump finally acknowledged that Obama was born in the U.S.\n\nCorsi has also been cited as one of the architects of a 2004 effort to bring then-Democratic presidential candidate Sen. John Kerry’s war record into question through a 527 political organization called Swift Boat Veterans for Truth. The group attempted to cast doubt on Kerry’s Vietnam War record and question the injuries he sustained when he earned decorations that include a Bronze Star, a Silver Star, and three Purple Hearts.\n\nCorsi claims that his work is part of the reason he believes investigators are probing him.\n\n“My conclusion was as much as they say they want only the truth, I believe that they have a narrative and they’re looking for fast facts to fit their narrative,” he said. “I've written 20 books since 2004 and I have reason to believe...that this is payback for those books.”\n\nShortly after Trump’s inauguration, when Corsi joined the controversial conspiracy theorist Alex Jones’ right-wing outlet, Infowars, Jones reportedly boasted that Corsi “had a history” with Trump, and that the two had been acquainted for “40-plus years.”\n\nWhen ABC News asked if he would be open to making a plea deal with the special counsel’s office should they charge him in coming days, Corsi replied, “What’s there to be a plea deal with?” and expressed his suspicions about the possible charges investigators may claim against him.\n\n“They said I didn't commit any crimes. I can't remember all my emails I can't remember all my phone calls, [and] I tell them that. It's impossible; it's a perjury trap from the moment you get going,” Corsi said.\n\n“My crime is that I didn't tell them what they wanted to hear. They won't believe it, but this is the most frightening experience of my lifetime. I'm being punished for trying to cooperate with them in a game that I was set to lose,” he added. “I couldn't win this game...it wasn't a game; I was trying to tell them the truth. But you forget that somebody was in a meeting and you lied to them.”"}