{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nFlorida Democrat Andrew Gillum targeted by second racist robocall  Florida Democrat Andrew Gillum targeted by second racist robocall  Andrew Gillum concedes Florida governor's race to Republican Ron DeSantis  Betsy DeVos pitches new protections for students accused of sexual assault  Controversies hamper candidates in Mississippi Senate race   The sisterhood of congressional 'firsts': Diverse group of newly elected women bond   Family of immigrant WWI soldier receives his Purple Heart 100 years after death  Sunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Papadopoulos launches late bid to delay looming prison term  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Fraternity suspended after member critically injured in fall  Trump says he finished answering questions from special counsel  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\n\n\nAndrew Gillum, the Democratic nominee for Florida governor, has now been targeted a second time by racist robocalls to Florida voters.\n\nThe robocall on Tuesday came after a white supremacist group reportedly ran robocalls impersonating the African-American mayor of Tallahassee in August.\n\nThe voice on the newest robocall voice impersonates Gillum in an exaggerated accent and refers to the Democratic candidate as a \"negro\" and a \"monkey.\"\n\n\"Well, hello there. I is the negro Andrew Gillum and I'll be askin’ you to make me governor of this here state of Florida,\" the voice says.\n\n\n\nIf Gillum wins the race against Republican and Trump-supported Rep. Ron DeSantis, he would be the state's first black governor.\n\n\n\nDeSantis denounced the latest calls at an Orlando campaign event on Tuesday, saying \"It's disgusting,\" and that the media should “investigate who’s doing that. I want to know who’s doing that. I can tell you, we’re not doing it. And I think the people who are doing it I think are doing it because they’re trying to create division and I want to know who’s doing it.”\n\n\n\nGillum responded Wednesday by accusing DeSantis of \"making excuses.\"\n\nHe cited a white nationalist video podcast, Road to Power, based in Idaho, reportedly behind other racist robocalls mocking California Democratic Sen. Dianne Feinstein. At the end of the robocall, a voice says Road to Power paid for it.\n\n\"Yesterday, Ron DeSantis and his campaign tried to make excuses for disgusting robocalls from an Idaho white supremacist group,\" Gillum said in a statement. \"Despite Road to Power being clearly identified in the call and widely identified in the press since August, DeSantis said he didn’t know who the callers were, but that he thought “there’s a method behind it” and they were “trying to distract.”"}