{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nDisney details new 'Star Wars: Galaxy's Edge' attractions Disney details new 'Star Wars: Galaxy's Edge' attractions  Michael Buble on how his son's fight with cancer changed him   What we know so far about Kate Upton's life as a new mom  'Widows' actress on how fitness training helps balance her life  Mariah Carey celebrates first snow of the season with her holiday anthem  How Serena Williams learned to love her body  Tamera Mowry-Housley's niece Alaina laid to rest after Thousand Oaks mass shooting  How Michael B. Jordan is changing the game in front of and behind the camera  Why you need to meet the 2 young stars of 'Haunting of Hill House'  Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\n\n\"Star Wars\" fans will soon be able to pilot the Millennium Falcon and face off against Kylo Ren in battle.\nDisney on Saturday announced some details of the new \"Star Wars: Galaxy's Edge\" lands, opening in 2019. It also announced that composer John Williams, creator of the classic \"Star Wars\" themes, is writing new music for the \"Galaxy's Edge\" attractions, and shared a sneak preview.\nThe two signature attractions of the \"lands\" now under construction will be \"Millennium Falcon: Smuggler's Run,\" in which guests can take the controls in three different roles, and \"Star Wars: Rise of the Resistance,\" offering an \"epic battle\" between the First Order and the Resistance.\nThe attractions are to open at Disneyland Resort in summer 2019 and at Walt Disney World Resort in the fall."}