{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nAndrew Gillum could be poised to make history in gubernatorial bid Andrew Gillum could be poised to make history in gubernatorial bid  Andrew Gillum concedes Florida governor's race to Republican Ron DeSantis  Betsy DeVos pitches new protections for students accused of sexual assault  Controversies hamper candidates in Mississippi Senate race   The sisterhood of congressional 'firsts': Diverse group of newly elected women bond   Family of immigrant WWI soldier receives his Purple Heart 100 years after death  Sunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Papadopoulos launches late bid to delay looming prison term  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Fraternity suspended after member critically injured in fall  Trump says he finished answering questions from special counsel  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\n\n\nDemocrat Andrew Gillum hopes to make history in his bid to become Florida's first black governor.\n\nThe Tallahassee mayor faces Trump-backed Republican former Rep. Ron DeSantis and is a member of an ever-growing class of progressives aligning themselves with the agenda of Sen. Bernie Sanders.\n\nGillum won the Democratic primary by only a few points against Gwen Graham. That election wasn’t supposed to be easy for Gillum, because Graham’s father was once the state’s governor and a U.S. senator. She took on the role of centrist to appeal to voters, but in the final weeks leading up to the primaries, her lead started to fade and Gillum was able to inch to a three-point victory.\n\n\n\nHe’s staked his platform in single-payer health care and tax reform. He’s advocated for restructuring ICE and impeaching President Donald Trump.\n\nHis progressive campaign has allowed him to amass support from the largest left-wing donors, including Democratic financier George Soros. Between Soros and his sons, Gillum has raised $1.3 million alone, according to Politico.\n\n\n\nThe race has gotten increasingly testy between DeSantis and Gillum. DeSantis recently said at a rally that Gillum would appoint “Soros-backed activists” to statehouse positions if he were appointed. He has also urged FOX News viewers not to “monkey this up” by voting for Gillum in November.\n\n\n\nGillum has also been a target of racist robocalls paid for by a white nationalist group from Idaho.\n\n\n\n\"Well, hello there. I is the negro Andrew Gillum and I'll be askin' you to make me governor of this here state of Florida,\" the call says.\n\nDeSantis denounced the calls and said he didn't know who was making them, although the group made similar robocalls mocking California Democratic Sen. Dianne Feinstein.\n\n\n\nGillum hasn’t shied away from President Trump’s attacks toward him online. On Monday, Trump posted a tweet calling for the support of DeSantis, in which he called Gillum a “thief,” likely in regards to the FBI investigation.\n\nIn Florida there is a choice between a Harvard/Yale educated man named @RonDeSantisFL who has been a great Congressman and will be a great Governor - and a Dem who is a thief and who is Mayor of poorly run Tallahassee, said to be one of the most corrupt cities in the Country!\n\nGillum fired back the same way he did when Trump attacked him in August, by telling him to tag him directly in the tweet and urging Floridians to vote.\n\nOn Twitter there is a choice between having the courage to @ the person you are trash talking, or not. @realDonaldTrump is howling because he's weak. Florida, go vote today. https://t.co/I8uOokptJA\n\nOn Tuesday, Gillum talked with ABC News Live in response to Trump's attacks against him.\n\nAndrew Gillum responds to Trump's attacks: \"I think it's pretty pitiful ... but I will tell you this much, he's met his match. I don't believe in backing down and certainly won't when it comes to standing up for the things we believe,\" he tells @devindwyer https://t.co/FAD5CxCZCA pic.twitter.com/awHP4gvktF\n\n\"I think its pretty pitiful the president of the United States is engaged in this way. But I will tell you this much, he's met his match,\" Gillum said. \"I don't believe in backing down and certainly won't when it comes to standing up for the things we believe.\"\n\n\"I would encourage the president, instead of tweeting about me, to convene leaders in this hemisphere around what we're going to do with the thousands of individuals fleeing their homeland,\" Gillum said.\n\nTrump at a rally last week condemned the attacks coming from candidates on both sides of the aisle, saying \"those engaged in the political arena must stop treating political opponents as being morally defective -- have to do that. The language of moral condemnation and destructive routine, these are the arguments and disagreements that have to stop.\"\n\nWhen asked by @devindwyer about the caravan, Andrew Gillum says President Trump \"should consider what steps we’re taking that are leading to people needing to leave their own homelands, and figure out what a humanitarian solution might be to this problem” https://t.co/FAD5CxCZCA pic.twitter.com/YA0J8D5TGO\n\nGillum called the president out for just that.\n\n\"Instead of tamping down on that kind of rhetoric, he's sitting around here stoking it. That isn't leadership. I would recommend that the president be the president. Let us run this race here in Florida. His candidate is doing so well,\" Gillum said. \"I get that they've got anxiety about that but there's enough differences between me and Mr. DeSantis on the issues that we don't have to resort to name calling.\"\n\nBorn in Miami, his mother drove a school bus and his father was a construction worker. He’s one of seven children and the first in his family to graduate high school and go to college, according to the Sun Sentinel. He was the youngest person elected to the Tallahassee City Commission at 23.\n\n\n\nGillum boasts economic development and a focus on the underrepresented worker. Under his mayorship, Tallahassee was selected for Obama’s TechHire program, which provides resources to underrepresented workers in the tech field, according to the Tallahassee Democrat.\n\nHis campaign has run into some trouble with the FBI, after agents subpoenaed “thousands of pages of documents from key players in city government,” according to the Tampa Bay Times. Gillum accepted a ticket to the award-winning Broadway musical “Hamilton” in New York from an undercover FBI agent who was investigating corruption in Tallahassee.\n\n\n\nGillum in the governor’s debate said that although he is not the direct subject of the investigation, he has “zero tolerance for corruption.” He also said that he should have asked more questions about where the ticket came from before accepting it.\n\n\"I’m running for governor, in the state of Florida we got a lot of issues, in fact we have 99 issues and 'Hamilton' ain’t one of them,\" Gillum said.\n\n\n\n\n\nDespite the cloud of a federal investigation over his head and the unlikely odds of his victory over Graham in the primaries, ABC News partner FiveThirtyEight forecasts Gillum with a three in four chance of taking the governor’s mansion."}