{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\n\n    U.S. News\n\n\n\t\t\t\t\t\t\t\tTrump visits California as wildfires leave 74 dead, more than 1,000 others missing\n\t\t\t\t\t\t\t\n\nMidwest, Northeast brace for arctic cold\n\nKanye donates to GoFundMe for man shot by police\n\nFormer Vice President Joe Biden adopts new dog\n\nTrump tours wildfire damage in California\n\nSmoke blankets Bay Area as residents wear masks\n\nFrat suspended after member critically injured\n\nGoFundMe suspect says she was also duped: Attorney\n\nSearch continues for kidnapped 13-year-old\n\n74 dead, over 1,000 missing in Calif. wildfires\n\nPrison inmate death ruled homicide\n\n1st pot shops in eastern US get OK to open in Massachusetts\n\n\n\t                                        Dangerous air quality continues to be a health concern for California residents\n\t                                    \n\n\n\t                                        Chilling 911 call released after terrifying home invasion \n\t                                    \n\n\n\t                                        Attorney claims woman in GoFundMe alleged scam didn't know about a conspiracy\n\t                                    \n\n\n\t                                        Man cleared of charges by his mom's Facebook post\n\t                                    \n\n\n\t                                        Parents outraged over school bus incident\n\t                                    \n\n\n\t                                        Search continues in suspicious disappearance of man at 49ers game \n\t                                    \n\n\n\t                                        26-year-old face transplant recipient: 'I see me': Part 1\n\t                                    \n\n\n\t                                        Face transplant recipient's mom learns about renowned reconstructive surgeon: Part 2\n\t                                    \n\n\n\t                                        Surgeon meets potential face transplant recipient before agreeing to operate: Part 3\n\t                                    \n\n\n\t                                        Face transplant donor's mother's difficult decision: Part 4\n\t                                    \n\n\n\t                                        How surgeons performed 26-year-old man's face transplant procedure: Part 5\n\t                                    \n\n\n\t                                        Face transplant recipient thanks donor's mother: Part 6\n\t                                    \n\nPolice ask residents to check properties amid search for 13-year-old Hania Aguilar\nPolice asked residents to check their properties for \"anything unusual.\"\n\nNov 17\n\n\nFraternity suspended after member critically injured in fall\nDavid Rusko was injured in a fall at the frat house on Nov. 10.\n\nNov 17\n\n\nKanye West seems to donate $150,000 to Chicago security guard shot by police \nJemel Roberson was fatally shot by police in Kanye West's hometown, Chicago.\n\nNov 17\n\n\nTrump visits California as wildfires leave 74 dead, more than 1,000 others missing\nThe Camp Fire is the deadliest, most destructive in California's history.\n\nNov 17\n\n\nTrump tours wildfire damage in California, meets with firefighters\nPresident Trump is expected to discuss forest management during the trip.\n\nNov 17\n\n\nSnow moves into Northern Plains as Midwest, Northeast brace for arctic cold\nWind chills will be in the 20s and 30s in the Midwest and Northeast Sunday.\n\nNov 17\n\n\nSmoke blankets Bay Area as residents forced to don masks to breathe\nThe Camp Fire has sent record-bad air into the Bay Area.\n\nNov 17\n\n\nMore than 1,000 missing, 74 dead in California wildfires: 'It's going to get worse'\nA public health emergency has been declared in California amid deadly wildfires.\n\nNov 17\n\n\nFraternity member critically injured after falling down stairs\nDavid Rusko is in critical condition after the Sigma Alpha Epsilon member fell down a flight of stairs in the frat house at West Virginia University -...\nNov 17\n\nLawyer: Woman in alleged GoFundMe scheme was 'trying to help' \nKate McClure's lawyer said it was her boyfriend and the homeless veteran who pushed the alleged scheme and told the viral tale.\nNov 16\n\nPolice baffled by Army veteran's disappearance during 49ers game\nIan Powers was last seen on surveillance video leaving the game alone; police say he has been missing for four days.\nNov 16\n\nAttorney for female GoFundMe suspect claims she, too, was duped \nAn attorney for Kate McClure said she was also a victim of the alleged scam. \n\nNov 16\n\n\nCalifornia's 'Tent City'\nFire victims seek refuge in store parking lots.\nNov 16\n\nNew definition of kilogram ditches old metal object for natural constants \nScientists voted on Friday to redefine it based on electric currents. \n\nNov 16\n\n\nTrump awards the Presidential Medal of Freedom to Elvis Presley, Babe Ruth and more\nPresident Donald Trump awarded the Presidential Medal of Freedom award - the nation's highest civilian honor - to seven Americans in a ceremony at the...\nNov 16\n\nAt least 7 dead as snow wreaks havoc on East Coast\nMore than 300,000 people were without power Friday morning.\n\nNov 16\n\n\nCamel spotted on the side of the highway\nDrivers on Route 309 in Philadelphia were in for quite a surprise when they spotted a camel tethered to a parked van on the side of the road during a...\nNov 16\n\nTeen accused of killing mom over bad grade charged with murder as adult\nThe Florida teen allegedly confessed to the crime.\n\nNov 16\n\n\nMan still missing after disappearing from NFL game\nIan Powers was last seen leaving Levi's stadium. \n\nNov 16\n\n\nSocial media makes light of heavy snowstorm and nightmare commute\nIt was a nightmare commute for many.\n\nNov 16\n\n\nWeather conditions improving but critical fire conditions still exist in California \nMore than 600 people are missing as historic fires burn on both ends of the state.\nNov 16\n\nToxic Bay Area air quality is among worst in world right now\nSchools across the Bay Area in California are closed due to bad air quality.\nNov 16\n\nJudge orders Trump administration to restore Jim Acosta's press credentials\nThe judge said Acosta was denied his right to due process. \nNov 16\n\n\n                                                            California wildfires leave at least 66 dead with more than 600 still missing\n                                                        \n\nChris Watts, who killed wife and daughters, 'lied about everything,' mistress says\nChris Watts pleaded guilty in the deaths of his wife and young daughters.\n\nNov 16\n\n\nFireball lights up skies over Texas\nMultiple videos show a meteor adding dazzle to the skies over central Texas.\nNov 16\n\nSanta Rosa rebuilds one year after Tubbs fire tore through town\n'We're stronger together now than we were a year ago,' one resident said.\n\nNov 16\n\n\n\n                                                            Painting fetches $90M in record-setting auction\n                                                        \n\nAlabama district attorney shot after ambush by former state trooper: Police\nGreg Griggers, the district attorney for the 17th judicial circuit, suffered non-life threatening injuries, authorities said.\nNov 16\n\nNor'easter leaves some students stranded at schools overnight\nSome students in New Jersey were forced to sleep in their schools overnight.\n\nNov 16\n\n\nCNN's Jim Acosta arrives at District Court to appeal for White House press pass\nThe reporter had his press credentials revoked after a tense exchange with President Trump.\nNov 16\n\nCalifornia wildfires by the numbers\nThe Camp Fire has claimed 63 lives in Northern California.\n\nNov 16\n\n\nNor'easter leaves kids stranded at school overnight \nSome students never made it home and found shelter at a middle school in West Orange, New Jersey.\nNov 16\n\nNews headlines today: Nov. 16, 2018\nCatch up on the developing stories making headlines.\nNov 16\n\nShooter who allegedly killed 2 at Kentucky Kroger charged with hate crime\nGregory Bush, 51, is alleged to have killed two people based on their race.\nNov 16\n\n\n                                                            Navy SEALs, Marines charged in Green Beret murder\n                                                        \n\n'Start Here': Florida recount, Dartmouth, Khashoggi. What you need to know today.\nFlorida's Senate race has moved into a hand recount of votes.\n\nNov 16\n\n\nWinter weather causes chaos\nCities from the Carolinas to New England were slammed by the early blast that caused traffic delays and treacherous conditions. ABC News' Kenneth...\nNov 16\n\nKroger shooter charged with hate crime in alleged murder of black shoppers\nGregory Bush, 51, is alleged to have killed two people based on their race.\n\nNov 16\n\n\nPlaintiffs in lawsuit against Dartmouth describe 'systemic' sexual harassment \nStudents were allegedly made to socialize with professors to receive advising.\n\nNov 16\n\n\nMan shouted 'Hail Hitler, hail Trump' during intermission at 'Fiddler on the Roof'\nThe man was not charged and left the scene. \n\nNov 16\n\n\nSelfie exonerates man from burglary charge, attorney says\nThe man's high school girlfrind accused him of slicing an \"X\" into her chest.\n\nNov 15\n\n\nAlabama DA shot after ambush by former state trooper: Police\nThe suspect has died, authorities said. \n\nNov 15\n\n\nWhy the link between veterans and mass shootings is more complicated than you think\nComes after the latest instance where a shooter was a veteran. \n\nNov 15\n\n\nPersonal valuables stolen from patients at VA hospital in Cleveland\nA nurse assistant took patients' wedding rings, cash and medical devices, VA police said.\nNov 15\n\nSchool lockdown prompts boy to write goodbye letter to his parents\nFearing for his life, a boy poured his heart out to his parents. \n\nNov 15\n\n\nFBI investigating after American woman dies on cruise ship\nThe death of the woman, 52, is still being investigated. \n\nNov 15\n\n\nGoFundMe campaign to help homeless vet was 'predicated on a lie,' prosecutor says\nProsecutors have been investigating the trio.\n\nNov 15\n\n\nCesar Sayoc pleads not guilty in political pipe bombs case\nSayoc entered the plea through his lawyers during his appearance in Manhattan federal court.\nNov 15\n\nSchool lockdown prompts 12-year-old to write goodbye letter to family\nAjani Dartiguenave thought someone had brought a gun to school when his school was on lockdown.\nNov 15\n\n\n\t\t\t\t\t\t\t\tMassive wildfires engulf California\n\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\tAnheuser-Busch delivering drinking water to Florida, Georgia\n\t\t\t\t\t\t\t\n", "paragraph": ""}