{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nSuicide rates highest among American men in construction, women in creative fields: Report  Men in construction, women creatives most at risk for suicide: Report   Formerly Conjoined Twins Get Send-Off at Hospital Where They Were Separated  CDC Issues New Vaccine Guidelines for Adults  Facebook Post Helps Toddler Get Kidney From Parents' Former HS Classmate  Flu Takes a Toll in NYC, With 4 Children Reported Dead  Mumps Outbreak Reaches 367 Cases in Washington State  Girl Surprised With Super Bowl Tickets After Being Treated for Rare Cancer  In Chicago, Witnesses to Violence Turn to First Aid to Save Lives  6-Year-Old Girls Link Intelligence to Men Over Women, Study Says  Avian Flu Outbreaks Raise Concerns About Possible Pandemic   Seoul Virus Spread by Pet Rats Under Investigation in Multiple States  Teacher Aide Accused of Faking Cancer to Hide Criminal Past  More Chronically Ill Patients Have Health Insurance After ACA, Study Finds  11-Year-Old Boy Is One of the Youngest to Get Artificial Heart  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\nWith suicide rates rising across the country, a new report from the Centers for Disease Control and Prevention (CDC) finds that certain occupations are associated with a higher risk of suicide.\n\nSuicide rates were highest among men who worked in construction or extraction (oil rigging, mining) jobs and women who worked in arts, design, entertainment, sports and media, the report found.\n\nFollowing construction and extraction jobs, the jobs with the highest risk of suicide for men were those in the arts, design, entertainment, sports and media, as well as installation, maintenance and repair. For women, arts, design, entertainment, sports and media were followed by protective service and health care support.\n\nThe study, published in the CDC’s Morbidity and Mortality Weekly, looked at suicide rates by occupation within a group of 22,053 people, ages 16 to 64, in 17 participating states between 2012 and 2015. The authors note in their summary that the results are not nationally representative.\n\n\n\nDuring that time, suicide rates rose the sharpest among men working in arts, design, entertainment, sports and media, and among women working in food preparation and service-related occupations, the CDC study found.\n\n“Increasing suicide rates in the U.S. are a concerning trend that represent a tragedy for families and communities, and impact the American workforce,” said Dr. Deb Houry, director of the CDC's National Center for Injury Prevention and Control, in a press release.\n\n\n\n\nThe study noted that suicide rates increased across many occupational groups in the four years that were studied, and said that factors that contribute to suicide aren’t limited exclusively to problems a person may have with his or her job.\n\n\n\n\n\n“Usually stressful situations converge with decreased ability to tolerate distress, which leads a person to feel hopeless,” psychiatrist Dr. Colette Poole-Boykin told ABC News.\n\nThe relationship between suicide and occupation might also be “confounded by access to lethal means on the job and socioeconomic factors such as lower income and education,” the study's authors reported. The study did not, however, look deeper into these factors.\n\nThe CDC said that the new information may help workplace leaders better focus their prevention programs and policies. For high-stress jobs, these efforts may already be in place, Poole-Boykin said, noting that “it would be wise to seek professional help when discontentment causes problems with [someone’s] mood.”\n\n“People who are contemplating suicide often have changes in their mood, as well as the way they talk and behave,” Poole-Boykin said.\n\n\n\nCommon signs, in addition to verbally expressing suicidal thoughts, include a person expressing feelings of being trapped or of being a burden to others, Poole-Boykin said. A person might also feel depressed, anxious, irritable -- or all three at once. He or she may lose interest in their usual hobbies or isolate themselves.\n\n“When these warning signs are present, a person should seek mental health care as soon as possible,” Poole-Boykin said, “as it may be too difficult for the person to will themselves into a better mental state.”\n\nIf you are in crisis, please call the National Suicide Prevention Lifeline at 1-800-273-TALK (8255) or contact the Crisis Text Line by texting TALK to 741-741."}