{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\n5 things to know about California's and other wildfires\n 5 things to know about California's and other wildfires +'It's just a recipe for destruction,' fire chief says of California wildfires  +More than 1,000 missing, 74 dead in California wildfires: 'It's going to get worse'  Andrew Gillum concedes Florida governor's race to Republican Ron DeSantis  Betsy DeVos pitches new protections for students accused of sexual assault  Controversies hamper candidates in Mississippi Senate race   The sisterhood of congressional 'firsts': Diverse group of newly elected women bond   Family of immigrant WWI soldier receives his Purple Heart 100 years after death  Sunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Papadopoulos launches late bid to delay looming prison term  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Fraternity suspended after member critically injured in fall  Trump says he finished answering questions from special counsel  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\nThe last few years have been some of the worst in the country's history for wildfires, especially in California.\n\nAs the country began to see first-person videos of terrified residents evacuating, the president posted a tweet that placed blame on poor policies related to forests, saying there is \"no reason\" for the massive fires except poor forest management.\n\nBut experts say the situation is more complicated and that there are multiple factors that influence how much fires spread and how dangerous they are.\n\nHere are five things to know about wildfires.\n\n\nForest management refers to how states and federal agencies take care of forests to keep them healthy, including when to remove dead or dying trees or use small, controlled fires to remove fuel and keep wildfires from spreading.\n\nThere has been some debate over how proactive forest managers should be in clearing dead or dying trees or dead brush, which can serve as fuel for fires.\n\nThe Trump administration recently adopted a new strategy empowering managers to more aggressively clean out these areas, but environmental groups have said that approach could limit habitat for endangered species or drastically reduce forests.\n\nTrump's tweet makes a connection between forest management and the wildfires in California, but not all wildfires happen in forests. Many of the fires in California are fueled by dry grass, brush, and trees, but are not only happening in forested areas.\n\nThe U.S. Forest Service received more funding to manage forests in the most recent spending bill earlier this year, after warning Congress for years that fighting fires was using up more and more of the agency's budget.\n\n\n\n\n\n\nWind conditions and temperature are a big factor in whether wildfires spread and what areas are at risk, but broader trends in the climate play a big role as well.\n\nWarmer temperatures alone don't cause fires, but drought and insect outbreaks that kill trees and plants create more fuel that helps fires spread, adding to wildfire risk in California and other western states, according to the National Climate Assessment published in 2014.\n\n\n\nCalifornia Gov. Jerry Brown has been vocal about the impact of climate change on fires in the state, saying the conditions have created a \"new abnormal\" where the fire season lasts all year.\n\nThe Trump administration has denied the connection between climate change and wildfires this year and continued to say that forest management is the biggest factor.\n\n\nMany of the largest and most destructive wildfires in California's recorded history have been in the past 20 years but fires a not a recent phenomenon in the state.\n\nOne reason the more recent fires are more destructive and deadly is that there's been more development in parts of California where there have been fires before, putting more families and homes at risk and making it more complicated and costly to fight fires.\n\nThe U.S. Forest Service reported this year that a third of homes in the U.S. now touch forests or other wilderness, a more than 40 percent increase between 1990 to 2010. That study found that \"growth often results in more wildfire ignitions, putting more lives and houses at risk.\"\n\nBrock Long, head of the Federal Emergency Management Agency, has warned that communities need to be aware of the risks of building in areas prone to natural disasters.\n\nSpeaking during Hurricane Michael in Florida, a month before the California wildfires began, he said: “I love the beach. I love the mountains. I grew up in the mountains of North Carolina. But if you want to live in these areas, you’ve got to do it in a more resilient fashion.”\n\n“What I’m afraid of is hurricane amnesia,” he added. “Ten years is going to go by and we’re going to forget what happened in Mexico beach. So how do we build a culture of preparedness? … FEMA tries to do it every year, but a lot of people don’t pay attention to anything that we do or say when it’s a blue sky day and nothing is happening.”\n\n\n\n\nRemember Smokey Bear's slogan \"only you can prevent forest fires?\" In many cases that's true.\n\nIt usually isn't until months after a devastating wildfire that officials can confirm how it started. Some researchers say humans are playing a bigger role in starting fires in areas that don't normally burn.\n\nA study published in 2016 found that humans accounted for 84 percent of all wildfires in the U.S. between 1992 and 2012.\n\nSome human-caused fires have been blamed on arson or negligence, like a teenager who was accused of starting the Eagle Creek Fire in Oregon after throwing fireworks into a bush while hiking.\n\nBut wildfires can start with much smaller actions by people, like leaving embers from a campfire, tossing a cigarette into the grass, or even sparks from a vehicle on the road.\n\nABC News' Anne Flaherty contributed to this report."}