{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nReliably red district in New Mexico a 'toss-up' between candidates vying to be its 1st female representative Reliably red New Mexico district a 'toss-up' between 2 candidates  Andrew Gillum concedes Florida governor's race to Republican Ron DeSantis  Betsy DeVos pitches new protections for students accused of sexual assault  Controversies hamper candidates in Mississippi Senate race   The sisterhood of congressional 'firsts': Diverse group of newly elected women bond   Family of immigrant WWI soldier receives his Purple Heart 100 years after death  Sunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Papadopoulos launches late bid to delay looming prison term  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Fraternity suspended after member critically injured in fall  Trump says he finished answering questions from special counsel  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\n\n\nTo some, Xochitl Torres Small might seem a study in contradictions.\n\nShe is a moderate, pro-gun Democrat and a water rights attorney who has supported the oil and gas industry, according to the Las Cruses Sun-News.\n\nAnd, seeking to represent a district that sits on the U.S. border with Mexico, the granddaughter of Mexican immigrants has come out against building a wall.\n\nThe Democratic hopeful is running for New Mexico’s 2nd Congressional district -- long considered a Republican stronghold -- yet the race is garnering national attention because of the razor-thin margin in polling data.\n\nIn 2016, the congressional district went to President Donald Trump by 10 points. Republican Rep. Steve Pearce, who is running for governor, won his last bid for reelection by almost 30 points.\n\nDespite the district’s political history, ABC News partner FiveThirtyEight forecasts the race between Torres Small and Republican Yyvette Herrell as a toss-up. Torres Small has also raised nearly $3 million through September 30, nearly double that of Herrell.\n\n¡Sólo quedan dos días para votar temprano! Debemos ejercer nuestro derecho de votar y así efectuar un cambio positivo en nuestras comunidades. Yo ya voté ¿y tu? pic.twitter.com/WjVO8zwsZO\n\nKOAT political analyst Brian Sanderoff said the race is indicative of the nation’s mood.\n\n\"Because of the mood in the state and the nation, because the Democrats have an excellent candidate, this time, they have a shot at it,\" he told the Albuquerque news station.\n\nThe energy tonight at our Get Out The Vote rally in Ruidoso was tremendous! A special thanks to Kellyanne Conway for joining us this evening. Lincoln County, it’s time to get out to the polls so we can win this thing! #nmpol pic.twitter.com/mW9GOyTaFi\n\nSeveral of the first-time candidate’s issues focus on the challenges residents in rural communities face. As a water rights attorney, many of her cases involved protecting water for farmers in the state. As a field representative for U.S. Sen. Tom Udall, D-N.M., she worked to increase cellphone service and broadband. And she has said in Congress she’d like to make improvements in the state’s public education system because so many people in the district face unique challenges in obtaining a quality public education.\n\nIn a crowded Republican primary, Herrell distinguished herself with vocal support for Trump and a reliably conservative voting record, according to the Las Cruces Sun-News.\n\nNo matter which candidate wins on Tuesday, the 2nd Congressional district will be sending its first woman to Washington represent it."}