{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nHouse and Senate face long to-do list in lame duck session House and Senate face long to-do list in lame duck session  Andrew Gillum concedes Florida governor's race to Republican Ron DeSantis  Betsy DeVos pitches new protections for students accused of sexual assault  Controversies hamper candidates in Mississippi Senate race   The sisterhood of congressional 'firsts': Diverse group of newly elected women bond   Family of immigrant WWI soldier receives his Purple Heart 100 years after death  Sunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Papadopoulos launches late bid to delay looming prison term  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Fraternity suspended after member critically injured in fall  Trump says he finished answering questions from special counsel  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\nThe House and Senate return to Washington Tuesday for the first time since well before Election Day.\n\nWhile this is a lame duck session of Congress, there is still plenty of work to get through. Here are a few of the issues that lawmakers will try to tackle in 19 legislative days over the next two months.\n\nCONFIRMING A NEW ATTORNEY GENERAL\n\nPresident Donald Trump’s firing of Attorney General Jeff Sessions and subsequent installation of Matthew Whitaker as acting attorney general has set off a chain reaction on Capitol Hill, primarily in relation to special counsel Robert Mueller’s investigation into Russian meddling in the 2016 U.S. elections.\n\nIn his new role, Whitaker takes Deputy Attorney General Rod Rosenstein’s place as the lead overseer of the probe. Sessions had recused himself of all Justice Department activity related to the investigation into Russian meddling and now lawmakers are raising concerns that Whitaker’s objectivity is compromised because of his vocal criticism before joining the administration.\n\n\n\nIncoming House Judiciary Committee chairman Jerry Nadler told ABC News Chief Anchor George Stephanopoulos on \"This Week\" Sunday that if Whitaker is still the acting attorney general in January, he will be called as his first witness to discuss his views on the special counsel. Democrats in both chambers have also asked the Justice Department’s ethics office to review Whitaker’s past statements on the special counsel and weigh in on whether he should recuse himself from overseeing the Mueller probe.\n\n\n\nSenior Democrats are also calling on the Justice Department to reveal whether the agency’s top ethics official advised Whitaker to recuse himself from supervising Mueller’s investigation, arguing in a letter Monday that “serious ethical considerations” require him to step aside from managing the probe.\n\nIn their letter to DOJ ethics officer Lee Lofthus, Democrats cited Whitaker’s “history of hostile statements” toward the investigation in his capacity as a conservative pundit before his hiring as chief of staff for Sessions.\n\nWhitaker can serve for 210 days without being confirmed by the Senate, but Senate Majority Leader Mitch McConnell, whose chamber will be in control of confirming Sessions’ permanent successor, has said he expects Trump to announce a nomination soon.\n\n“I think this will be an interim, a very interim AG. I expect we’ll get a new nominee very quickly for the job,” McConnell said.\n\n\n\nPROTECTING THE SPECIAL COUNSEL\n\nThe Sessions firing – which took the Mueller investigation out of Rosenstein’s purview – has also reignited talk on Capitol Hill of legislation to prevent the dismissal of Mueller, or any future special counsel, without cause.\n\nThe Senate Judiciary Committee approved such a bill, co-sponsored by Sens. Thom Tillis, R-N.C., Lindsey Graham, R-S.C., Cory Booker, D-N.J. and Chris Coons, D-Del., in April. Last week, several other lawmakers joined those senators in calling for a floor vote on the bill, which would put in place restrictions on how a special counsel could be fired.\n\n\n\n“Senate debate and passage of this bill would send a powerful message that Mr. Mueller must be able to complete his work unimpeded,” Sen. Susan Collins, R-Maine, said in a statement Friday.\n\nBut McConnell has so far been categorical in saying he would not bring the bill to the floor for a vote. \"It’s not going to come up because it isn’t necessary,\" McConnell said Friday at a news conference in his home state of Kentucky.\n\nBORDER WALL FUNDING\n\nCongress succeeded in funding most of the federal government for the rest of the fiscal year, but they put off some decisions until after the election. Agencies, including Homeland Security, had their current funding levels extended until Dec. 7 and that means when legislators return on Tuesday, they’ll have two weeks to come up with an agreement on things like a longer-term border funding package, which includes the controversial border wall.\n\nTrump has demanded $5 billion. Sen. Shelley Moore Capito, R-W.Va., the chairwoman of the appropriations committee in charge of wall funding, has previously said the request is reasonable. But Democrats are sure to object and may try to extract concessions in exchange for wall funding, such as passage of the special counsel protection bill mentioned above.\n\n\n\nCONGRESSIONAL LEADERSHIP ELECTIONS\n\nWith Democrats returning to the majority in January, House Minority Leader Nancy Pelosi has already kicked off her second run as Speaker of the House.\n\n\n\nWhile many incoming Democrats pledged that they would not support the veteran California Democrat, nobody else has thrown their hat into the ring. Instead, junior Democratic legislators are vying for lower-level posts, including leadership of the Democratic Congressional Campaign Committee for the 2020 cycle.\n\nMeanwhile, House Republicans will hold their elections for minority leadership on Wednesday.\n\nABC News' Benjamin Siegel contributed to this report."}