{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nAP source: Kansas, Miles working on deal to coach Jayhawks AP source: Kansas, Miles working on deal to coach Jayhawks  Aaron Donald fined for going after Justin Britt, vows to control temper  UNC's Manny Miles throws first TD pass with father Les looking on  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\n\nLes Miles could be back in the Big 12 soon.\nThe former Oklahoma State coach, who led LSU to the 2007 national championship before getting fired four games into the 2016 season, is in negotiations with Kansas to take over the down-trodden Jayhawks, a person with knowledge of the discussions told The Associated Press on Saturday.\nThe person spoke to the AP on condition of anonymity because the deal was not complete. There are numerous details to work out, though those are expected to be finalized in the coming days.\nMiles would take over for David Beaty, who was fired two weeks ago. Beaty agreed to finish out his fourth season, and is 6-30 heading into Saturday night's game at sixth-ranked Oklahoma.\nMiles has long been considered the front-runner for the job because of his close relationship with new Kansas athletic director Jeff Long. The two worked together at Michigan and stayed in touch over the years. Long tried to hire Miles when he was the AD at Arkansas.\nSports Illustrated first reported Friday that Long and Miles were in negotiations.\nMiles, who turned 65 last week, turned around Oklahoma State over the course of four years before leaving for LSU, where he inherited Nick Saban's powerhouse. He won a national title three years later, then lost to Saban and Alabama in the national championship game following the 2011 season.\nBut Tiger fans began to grow frustrated with Miles' reluctance to adapt to the air-it-out offenses that began to sweep through college football. And despite reaching a bowl game every season during his tenure in Baton Rouge, he was let go after a 2-2 start to the 2016 season.\nAnything close to that level of success would be welcome at Kansas.\nThe Jayhawks haven't had a winning season or reached a bowl game since 2008, their penultimate season under Mark Mangino. After he was forced out, the school churned through Turner Gill and Charlie Weis before hiring Beaty, a nondescript assistant with ties to the program.\nBeaty did well in restoring scholarship numbers and generating fan interest, fixing many of the problems created by Gill's and Weis's failed tenures. He landed better prospects, including several from Louisiana that will no doubt be familiar with Miles, and brought an unceasing energy that served him well as he tried to turn around the Jayhawks' moribund program.\nThe only thing missing was the wins. Beaty has beaten just two Big 12 opponents, both of them at home, and his inability to get the Jayhawks close to a bowl game led to his ouster.\nNow, it appears Miles is close to getting the next shot.\n———\nMore AP college football: https://apnews.com/tag/Collegefootball and https://twitter.com/AP—Top25"}