{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nAndrew Gillum concedes Florida governor's race to Republican Ron DeSantis Andrew Gillum concedes Florida governor's race to Republican Ron DeSantis  Betsy DeVos pitches new protections for students accused of sexual assault  Controversies hamper candidates in Mississippi Senate race   The sisterhood of congressional 'firsts': Diverse group of newly elected women bond   Family of immigrant WWI soldier receives his Purple Heart 100 years after death  Sunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Papadopoulos launches late bid to delay looming prison term  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Fraternity suspended after member critically injured in fall  Trump says he finished answering questions from special counsel  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\nAndrew Gillum, whose bid to become the first black governor of Florida extended more than a week after Election Day, conceded the race Saturday, effectively making Republican Ron DeSantis the winner in the tight, hotly contested race.\n\nGillum, a Democrat who is mayor of Tallahassee, announced live on Facebook shortly before 5 p.m. that he was formally ending his candidacy.\n\n\n\n\"I want to take a moment to congratulate Mr. DeSantis on becoming the next governor of the great state of Florida,\" said Gillum, who was accompanied by his wife, R. Jai Gillum.\n\n\n\n\n\n\n\"This has been the journey of our lives,\" he said in the video. “Although nobody wanted to be governor more than me, this was not just about an election cycle. This was about creating the kind of change in this state that really allows the voices of everyday people to show up again in our government.”\n\n\n\nThe deadline for a manual recount was set for noon on Sunday.\n\n\nA few hours before Gillum conceded, President Trump congratulated Gillum for running a \"really tough and competitive race for Governor of the Great State of Florida.\"\n\nCongratulations to Andrew Gillum on having run a really tough and competitive race for Governor of the Great State of Florida. He will be a strong Democrat warrior long into the future - a force to reckon with!\n\n\"He will be a strong Democrat warrior long into the future - a force to reckon with!\"\n\nGillum said he waited until the \"last vote was counted.\"\n\n\"We wanted to make sure every single vote ... as long as it was a legally cast vote, we wanted it to be counted,\" he said.\n\nThe concession for Gillum brought an end to a bitter and contentious battle with DeSantis.\n\n\n\n\n\n\nThe Trump-backed Republican said at a rally during the campaign that Gillum would appoint \"Soros-backed activists\" to the statehouse if he had won. And DeSantis was criticized after saying during an interview on FOX News that voters should not \"monkey this up\" by voting for Gillum -- a remark believed by many to be racist.\n\nGillum was also the target of racist robocalls paid for by a white nationalist group from Idaho, which impersonated Gillum in an exaggerated accent and referred to the Democratic Tallahassee mayor as a \"negro\" and a \"monkey.\"\n\n\n\n\"Well, hello there. I is the negro Andrew Gillum and I'll be askin' you to make me governor of this here state of Flordia,\" the call says. DeSantis denounced the calls and said he didn't know who was making them, although the group from Idaho made similar robocalls mocking California Democratic Sen. Diane Feinstein.\n\nOn election night, Gillum had conceded when DeSantis' lead seemed insurmountable. He withdrew the concession a few day later.\n\nGillum made his announcement on Facebook as most Florida counties were winding down their hand recount in the state’s contentious U.S. Senate race, according to the Associated Press.\n\nThe smattering of results publicly posted Saturday showed that Democratic U.S. Sen. Bill Nelson was only gaining a few hundred votes in his bitter contest with outgoing Gov. Rick Scott, a Republican, the AP reported on Saturday.\n\nState officials ordered a manual recount earlier in the week after a legally required machine recount showed that Scott led incumbent Democrat Bill Nelson by about 12,600 votes. More than 8 million voters cast ballots in the race."}