{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nC. African Republic militia leader turned over to tribunal C. African Republic militia leader turned over to tribunal  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Trump says he should have gone to Arlington on Veterans Day  Smoke blankets Bay Area as residents forced to don masks to breathe  Migrants won't see armed US soldiers on border  Slain journalist Khashoggi remembered in funeral service as controversy continues  At least 7 dead as snow wreaks havoc on East Coast  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  Teen accused of killing mom over bad grade charged with murder as adult  Oscar winner for 'Butch Cassidy' has died  Court filing hints at charges for WikiLeaks founder  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\n\nA commander in a Central African Republic militia has been arrested and turned over to the International Criminal Court to face charges that include murder and torture, the court announced Saturday.\nThe court, established to prosecute atrocities such as war crimes, said Central African Republic authorities surrendered Alfred Yekatom on Saturday. Court spokesman Fadi El Abdallah would not say if Yekatom already had been sent to the court's headquarters in The Hague.\nThe Central African Republic has been plagued by interreligious and intercommunal fighting since 2013, when predominantly Muslim Seleka rebels seized power in the capital and mainly Christian anti-Balaka militias fought back. The violence left thousands of people dead and displaced hundreds of thousands more.\nThe court alleges that Yekatom commanded some 3,000 anti-Balaka fighters responsible for atrocities committed between December 2013 and August 2014 in the capital, Bangui, and other locations.\n\"Now, he must answer in court for his actions,\" the court's chief prosecutor, Fatou Bensouda, said in a statement .\nBensouda paid tribute to witnesses who helped her build the case against Yekatom, saying \"justice would not be possible\" without them.\n\"We cannot undo the suffering that has been inflicted on victims, but we remain committed to doing our part ... to advance justice and accountability in the Central African Republic,\" Bensouda added.\nThe court said Yekatom would make his first appearance before judges \"in due course,\" when he will be asked if he understands the charges and his rights.\nThe International Federation for Human Rights welcomed Yekatom's transfer to ICC custody.\nThe move \"confirms the authorities' commitment to cooperate with the ICC when they are unable to pursue those most responsible for war crimes,\" said Drissa Traore, a vice president of the federation.\nThe government of the Central African Republic asked the ICC in May 2014 to investigate crimes allegedly committed by both the Seleka and the anti-Balaka.\nTraore urged the court to follow up the charges against Yekatom with a case against Seleka leaders \"so that the ICC can target the perpetrators of these crimes and better reflect the totality of abuses suffered by victims.\"\nIn June, ICC appeals judges overturned the conviction of former Congolese Vice President Jean-Pierre Bemba for atrocities committed by his forces in Central African Republic in 2002-2003."}