{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nUber announces 21 categories of sexual misconduct to report Uber announces 21 categories of sexual misconduct to report  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Trump says he should have gone to Arlington on Veterans Day  Smoke blankets Bay Area as residents forced to don masks to breathe  Migrants won't see armed US soldiers on border  Slain journalist Khashoggi remembered in funeral service as controversy continues  At least 7 dead as snow wreaks havoc on East Coast  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  Teen accused of killing mom over bad grade charged with murder as adult  Oscar winner for 'Butch Cassidy' has died  Court filing hints at charges for WikiLeaks founder  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\nUber announced a new system to identify sexual misconduct on its platform -- introducing 21 categories from staring and leering to non-consensual sexual penetration -- in a step toward transparency with customers and rehabilitating its public image.\n\n\"You've probably heard 'Do the right thing,' which we've really made an organizing principal for everything in the company,\" Uber's chief legal officer Tony West told a handful of reporters at a private event on Monday in New York City. \"I've talked about the importance of acting with transparency, integrity and accountability in everything that we do.\"\n\n\n\n\"We believe if we improve the safety of the platform for women, we can do it for everybody,\" West said.\n\nThe company is preparing a \"transparency report\" for 2019, in which it will publicly detail incidents of sexual assault and harassment for riders and drivers.\n\nThe move deals with one pervasive problem with preventing sexual misconduct: data collection can be tricky because bad behavior is under-reported and can be loosely defined.\n\n\n\n\"People want to go down the rabbit hole of which statistics are accurate, if you don't have the same definitions to use, it can be challenge,\" said Kristen Houser, the chief public affairs officer for the National Sexual Violence Resource Center, who, along with the Urban Institute, worked with Uber to create the new taxonomy, or classification system.\n\n\"When we talk about sexual assault, words really matter. This is based in descriptive behavior,\" Houser said.\n\n\"Differences in definitions and methodology make statistics about sexual violence from different sources even harder to compare. There is no common definition of criminal sexual assault across the 50 states or in federal crime statistics, and there is no shared understanding of misconduct that may not be criminal in nature,\" West wrote in a Medium post with Houser.\n\nThe 21 categories range from the \"non-criminal, non-touch behavior such as leering or flirting or inappropriate comments, all the way up to things that fall under state statutes for criminal sexual assault,\" Houser added.\n\n\n\n\n\nUber has faced a spate of bad publicity in the past few years, leading to the resignation of its founder Travis Kalanick from the CEO position last year. Former Expedia CEO Dara Khosrowshahi was brought in to turn the company's culture around, and West is part of that effort.\n\nIn joining Uber, West, a former Obama administration associate attorney general, rejoined former Attorney General Eric Holder and Obama campaign manager David Plouffe in Uber's upper executive ranks. As the company looks to recast its image, it has taken initiatives to confront its critics and present a sustainable corporate culture.\n\nIn May, Uber became one of the first companies to drop forced arbitration and confidentiality requirements for sexual harassment and assault cases. Last week, Google and Facebook also announced they would drop forced arbitration and allow victims to file lawsuits that become part of the public record.\n\n\n\nMonday's Uber announcement was met with mixed responses by victims' advocates.\n\n\"I love what Uber is doing and saying here. We have to move beyond the usual employer 'training' about sexual harassment having to be 'severe or pervasive,'\" Nancy Erika Smith, an employment lawyer who represented Gretchen Carlson and other women in their sexual harassment suits against Fox News Channel's Roger Ailes and Bill O'Reilly, wrote ABC News in an email. \"That phrase was made up by judges who effectively amended the law to say that 'some' sexual harassment is okay. We haven’t lessened harassment in the workplace by what we’ve been doing so far –- so I appreciate this effort to improve on the communication regarding unacceptable workplace behavior.\"\n\nBut the others say taxonomy is not enough.\n\n\"While classifying and ultimately reporting types of sexual misconduct is important, taking strong steps to prevent sexual misconduct ought to be the primary focus,\" said Doug Wigdor, a lawyer who represented women who had been raped by their Uber driver. \"There are steps they could be taking to eradicate any definition of sexual misconduct that would be far more worthwhile -- panic buttons in cars, tamper-proof video cameras in cars, better background checks, interviews before hiring drivers.\"\n\n\"We all know when a woman is raped or touched inappropriately, it's a bad thing,\" Wigdor added. \"The effort should be preventing these things in the first place, instead of focusing on what bucket it goes into.\""}