{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nJudge chases inmates who tried escaping from courtroom, catches 1 Judge chases inmates who tried escaping from courtroom, catches 1  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Trump says he should have gone to Arlington on Veterans Day  Smoke blankets Bay Area as residents forced to don masks to breathe  Migrants won't see armed US soldiers on border  Slain journalist Khashoggi remembered in funeral service as controversy continues  At least 7 dead as snow wreaks havoc on East Coast  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  Teen accused of killing mom over bad grade charged with murder as adult  Oscar winner for 'Butch Cassidy' has died  Court filing hints at charges for WikiLeaks founder  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\nA judge took matters into his own his hands after two inmates attempted to escape from his Washington courtroom.\n\nIn a video obtained by The Daily Chronicle, District Court Judge R.W. Buzzard can be seen removing his robe and running after Tanner Jacobson, 22, and Kodey Howard, 28, after they attempted to flee his courtroom in the city of Chehalis, about 85 miles southwest of Seattle.\n\nThe two men can be seen in the video from Oct. 16 still in handcuffs, trying to escape down a stairwell, with Jacobson in the lead.\n\n\n\n\n\n\"I was shocked at first. I didn't know what to think,\" Buzzard told ABC affiliate KOMO. \"By the time they hit the door, I'm like, 'There's nobody between them and the street.' So I wanted at least to find out where they were going.”\n\nBoth inmates made it down four flights of stairs before Buzzard could grab Howard. Jacobson only made it a few blocks before being caught by authorities, according to KOMO.\n\n\"Once I got to the stairwell, I knew I was going to be able to catch the one that was just in front of me because I immediately started gaining on him,” Buzzard continued. “I was yelling at them all the way down the stairs to 'stop, you're making things worse.’”\n\n\n\n\n\nChief Deputy Dusty Breen of the Lewis County Sheriff's Department said that Buzzard “definitely was a help to us getting [Howard] in custody.”\n\nThis is not the first time Buzzard has found himself in the middle of an incident. In April, it involved a civil case, he said.\n\n\"I had the unfortunate circumstance of having to wrestle a litigant to the floor who had attacked an attorney,\" Buzzard said.\n\n\n\n\n\nHe then revealed why he ditched his robe in the video. \"I found out [in April] that grappling in a robe is very restrictive. I couldn't imagine running down the stairs and being in a robe, so I got it off as soon as I could and went after him.\"\n\nJacobson and Howard have been charged with second-degree escape.\n\nBuzzard added that they are working on making the courtrooms more secure, but said that finding the budget for more staff is a challenge."}