{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nUNC's Manny Miles throws first TD pass with father Les looking on UNC's Manny Miles throws first TD pass with father Les looking on  Villanova drops back-to-back games for first time since 2012-13 season  Aaron Donald fined for going after Justin Britt, vows to control temper  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\nIt's shaping up to be a big football weekend for the Miles family.\n\nNorth Carolina senior quarterback Manny Miles, the son of former LSU and Oklahoma State coach Les Miles, threw a 38-yard touchdown pass on the final play of the first half of North Carolina's game against FCS school Western Carolina on Saturday. The Hail Mary to tight end Jake Bargas marked the first collegiate touchdown pass for Miles, a walk-on who has mostly served as North Carolina's holder on field goals.\n\n\nLes Miles, who ESPN and other outlets reported is closing in on a deal to become the next coach at Kansas, was in attendance for Senior Day in Chapel Hill, North Carolina. Kansas could introduce Miles as its next coach early next week. Miles has not coached since he was fired in September 2016. He is 141-55 as a college head coach, including winning the 2007 national championship at LSU and two SEC titles.\nBefore Saturday's scoring strike, Manny Miles completed a 5-yard pass Oct. 28 against Miami on a fake field goal and recorded a two-point conversion on a rush in UNC's win over Old Dominion.\nLes Miles has another son, Ben, who plays fullback for Texas A&M."}