{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nWisconsin town mourns 3 Girl Scouts, 1 adult killed in crash Wisconsin town mourns 3 Girl Scouts, 1 adult killed in crash  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Trump says he should have gone to Arlington on Veterans Day  Smoke blankets Bay Area as residents forced to don masks to breathe  Migrants won't see armed US soldiers on border  Slain journalist Khashoggi remembered in funeral service as controversy continues  At least 7 dead as snow wreaks havoc on East Coast  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  Teen accused of killing mom over bad grade charged with murder as adult  Oscar winner for 'Butch Cassidy' has died  Court filing hints at charges for WikiLeaks founder  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\n\nA western Wisconsin community on Sunday was grieving the deaths of three Girl Scouts and a parent who were collecting trash along a rural highway when police say a pickup truck veered off the road and hit them before speeding away.\nAuthorities have not released the names of the girls or the woman who were struck by the truck Saturday in Lake Hallie, or the name of a fourth girl who survived but was in critical condition at a Minnesota hospital. The girls were fourth-graders and members of Troop 3055 in nearby Chippewa Falls, about 90 miles (145 kilometers) east of Minneapolis.\n\"Our hearts are broken for the girls and families of the Girl Scouts of the Northwestern Great Lakes,\" CEO Sylvia Acevedo of Girl Scouts of the USA said in a statement Sunday. \"The Girl Scout Movement everywhere stands with our sister Girl Scouts in Wisconsin to grieve and comfort one another in the wake of this terrible tragedy.\"\nHundreds of community members gathered in 40-degree weather Sunday evening for a vigil outside Halmstad Elementary School, where some of the girls were students. Many in the crowd held candles and umbrellas in the light rain. Several Girl Scouts sang songs in memory of the victims.\nEarlier Sunday, teddy bears, balloons and candles sat on two wooden benches in front of Halmstad Elementary while dozens of families met inside with faith leaders and counselors. Families did the same at Southview Elementary School, the other school the girls attended, the Minneapolis Star Tribune reported.\n\"It's been very nice. There's been a lot of people — it's been a very supportive environment,\" said Michelle Golden, human resources director for Chippewa Falls School District.\nIn a message to parents, Superintendent Heidi Eliopoulos said: \"This is a difficult time for our students, families and staff. We will be providing ongoing support for both students (and) families and staff for as long as needed.\"\nLake Hallie police Sgt. Daniel Sokup said the pickup, a black Ford F-150, crossed a lane and veered into a roadside ditch, striking the victims. Other members of the troop were picking up trash from the opposite shoulder.\nThe 21-year-old driver, Colten Treu of Chippewa Falls, sped off but later surrendered. He will be charged with four counts of homicide, Sokup said. It was unclear Sunday if Treu had an attorney who could speak for him. Police misspelled Treu's first name as \"Colton\" in initial news releases.\nSokup said it was not immediately known if there were other factors that might have led the driver to leave the road. The Star Tribune reported that the crash happened before a hill and there were no blind spots, and Sokup said it was \"not an unsafe area.\"\nBut Cecily Spallees, a personal care attendant at a group home near the crash site, told the newspaper that drivers regularly speed on that stretch of road, which quickly changes from a 55-mph to a 35-mph zone.\n\"I'm always telling one of my residents that he shouldn't walk this strip at night,\" Spallees said. \"It's not safe.\""}