{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nIllinois woman has 'miracle baby' after overcoming breast cancer, family tragedy Illinois woman has 'miracle baby' after overcoming breast cancer, family tragedy  Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Trump says he should have gone to Arlington on Veterans Day  Smoke blankets Bay Area as residents forced to don masks to breathe  Migrants won't see armed US soldiers on border  Slain journalist Khashoggi remembered in funeral service as controversy continues  At least 7 dead as snow wreaks havoc on East Coast  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  Teen accused of killing mom over bad grade charged with murder as adult  Oscar winner for 'Butch Cassidy' has died  Court filing hints at charges for WikiLeaks founder  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\nMost married couples have what they call a \"Honeymoon\" period after they get married; a few months to a few years after the wedding where everything in the world is romantic, idealistic and possible.\n\nBut when Jennifer Lowright was diagnosed with an aggressive form of breast cancer just six weeks after her wedding in 2008, all of their future dreams came crashing to a stop, according to ABC Owned Station WLS-TV.\n\nInstead of making a home together, they were making doctor’s visits. Instead of building a family, they were scheduling chemo appointments. But through it all, Lowright never lost hope.\n\n\"This is not gonna take me,\" Lowright recalled telling herself when she received the news.\n\n\"I’m gonna fight this. I’m not gonna die from cancer,\" she told ABC News.\n\n\n\nA few years prior, Lowright had been told by her doctor to start getting yearly mammograms at the age of 31 due to her dense breast tissue makeup. In 2007 at the age of 33, she went in for her regular yearly appointment. Everything was clear. Not a hint of a tumor or a whisper of a cancer cell.\n\n\n\nOne year later, she was in Arizona on vacation when she received a recorded message from her doctor's office, reminding her to come in for her annual checkup. With a clean history, she didn’t feel the need to rush home; she'd \"get it done\" when she was back. She scheduled her appointment after returning to Illinois and after donning the dressing gown and pressing herself up against the machine, she waited to hear from the doctor, expecting another clean bill of health.\n\nBut there was something on the scan. A tumor in the left breast.\n\nThe doctor ordered an ultrasound. Then a biopsy.\n\nAnd then the news Lowright's family feared the most: the cells were malignant.\n\n\"You don’t really tune in when you hear that diagnosis,\" said Lowright. \"It’s the ultimate devastation.\"\n\nShe refused to crawl into a corner and cry. Within a day, she was back sitting in front of the doctor’s office, this time with her parents, her husband and her husband’s parents.\n\n\"As a patient, you’re not gonna remember every question to ask,\" Lowright said, who encourages others to bring family or friends, as they will likely ask questions the patient might forget to ask.\n\nSurgery was scheduled for December 2008, and Lowright elected to have both her breasts removed due to her age, the size of the tumor and the likelihood of the cancer returning.\n\nAlong the journey of second opinions and multiple meetings, one of her doctors recommended she speak with a reproductive doctor.\n\n\"I would never have thought about that,\" admitted Lowright.\n\nSome cancer treatments, like the one Lowright faced, can leave cancer victims without the ability to conceive or can launch young women into menopause early. But her army of doctors only had a short window after surgery – she needed to start chemo as fast as possible.\n\n\n\nThree to four weeks later, Lowright and her husband, who had met in high school and reconnected years later in their 30s, had nine embryos successfully frozen, ready and waiting for when Lowright would be cancer-free.\n\nShe thought losing her breasts would be hard, but that was nothing compared to when she started chemo. Within days, her hair was falling out.\n\n\"Emotionally, when you go to take a shower and you have no hair to wash and no body to shave, it’s like, 'What do I do with myself?' One minute shower and I’m done,\" said Lowright, laughing.\n\n\"The chemo took it all,\" she began, more reserved now.\n\n\"It wasn’t like I had a lavish hairstyle, but it’s how you identify yourself,\" she said.\n\nRadiation came next, following by a regiment of chemo in pill form and five years of another cancer drug. Meanwhile, her sister-in-law and mother were both diagnosed with breast cancer, something Lowright to this day still can’t believe.\n\nFinally, in 2015, her doctors gave her the all-clear to start building a family.\n\n\n\n\"Jennifer is an incredibly strong and resilient woman that endured a nine year journey to motherhood,\" Dr. Allison Rodgers, Jennifer’s reproductive endocrinologist from Fertility Centers of Illinois, told ABC News.\n\n\"By being proactive and preserving her fertility before undergoing breast cancer treatment she was able to ensure a chance at motherhood after her recovery. She is truly a survivor and an inspiration to those who want to have a family.\"\n\n\n\nIt took four treatments and all nine embryos, but in 2017, two weeks after Mothers’ Day and at 42 years old, Lowright became pregnant.\n\n\"It’s really tough to keep a positive outlook,\" said Lowright, noting that every woman who’s pregnant faces anxiety.\n\n\"Every bloodwork, and then you wait for the call. Every ultrasound, and then [you listen for] a heartbeat,\" she added, remembering the anxiety-filled days of pregnancy vividly. To battle them, she went to a chiropractor, an acupuncturist, a massage therapist. Anything to keep herself calm.\n\nAnd then her husband Chris passed away unexpectedly, just months before their \"miracle\" daughter was born in January. Throughout it all, though, she kept up her positive outlook on life, knowing her late husband was particularly excited about having a girl.\n\n\"She’s my little piece of heaven,\" explained Lowright.\n\n\"She’s also identical [to him] ... the spitting image of him. She’s all Chris,\" she added.\n\nLowright hopes that her story will speak to women and encourage them to realize they not only have options, but there’s a light at the end of the tunnel too.\n\n\"You gotta believe its gonna work and you gotta believe you’re gonna come through it,\" she said.\n\n\"You cannot go in with a negative attitude. It’s not gonna work if you do that… Positive mental attitude is an essential ingredient in the formula.\"\n\n\n"}