{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nKanye West seemingly donates $150,000 to GoFundMe page for Chicago security guard fatally shot by police Kanye West seems to donate $150,000 to Chicago security guard shot by police   Trump visits California as wildfires leave 74 dead, more than 1,000 others missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Trump says he should have gone to Arlington on Veterans Day  Smoke blankets Bay Area as residents forced to don masks to breathe  Migrants won't see armed US soldiers on border  Slain journalist Khashoggi remembered in funeral service as controversy continues  At least 7 dead as snow wreaks havoc on East Coast  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  Teen accused of killing mom over bad grade charged with murder as adult  Oscar winner for 'Butch Cassidy' has died  Court filing hints at charges for WikiLeaks founder  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\nA GoFundMe campaign set up for the family of a black security guard who was fatally shot by an Illinois police officer has raised more than double its $150,000 goal, in large part thanks to apparent donations by rapper and Chicago native Kanye West.\n\nJemel Roberson, 26, was an armed security guard at Manny’s Blue Room Bar in Midlothian, a southwestern Chicago suburb.\n\nRoberson was shot to death on Sunday, Nov. 11, while trying to restrain a suspected gunman in the bar’s parking lot. He was wearing “plain black clothing with no markings readily identifying him as a security guard,” Illinois State Police said in a preliminary investigation report released Tuesday.\n\n\n\nThe GoFundMe campaign was created on the day Roberson died with a goal of $150,000. But as of Saturday afternoon, it had raised more than $305,000. The largest donation came in 10 increments of $15,000 each by a user under the name of Kanye West.\n\nWest and his representatives did not immediately respond to requests to confirm the donations.\n\n\n\nMidlothian police were responding to calls of a shooting at the bar when they found Roberson in the parking lot. In a statement released on Tuesday, Illinois State Police said that Roberson ignored commands to drop his gun.\n\n\n\nGreg Kulis, attorney for the Roberson family, said witnesses were yelling at the officers, telling them that Roberson was a security guard, when the officer aimed his gun and shot Roberson.\n\nMidlothian police called the incident “the equivalent of a ‘blue-on-blue,’ a friendly fire incident.”\n\nThe officer’s name has not been released, and he is currently on paid administrative leave. Kulis and a local pastor are calling for the officer to resign or be terminated."}