{"id": "These animals’ screams will chill your blood", "paragraph": "The cries of the red fox can sound surprisingly similar to a human in distress. Males give a short \"scream\" in aggression, and females \"shriek\" as a mating call.The spookiest sounds on Halloween are made by creatures of the night.National GeographicPUBLISHED October 19, 2018For a real scare on Halloween, try listening to the wildlife at night.The red fox (Vulpes vulpes) has a call like Jack the Ripper is roaming the streets. The screams of this wild city-dweller can seem disturbingly human.“Occasionally, someone thinks they are the sounds made by someone in distress or being attacked and the police are called,” says Stephen Harris, a biologist at the University of Bristol, U.K.In a past study of urban foxes in Bristol, Harris described two types of piercing fox call that are mostly heard during the winter mating season. The short and explosive “scream” is an aggressive male warning to rivals, he found. The “shriek,” on the other hand, is a more complex and interactive call used by both sexes, but especially by females to attract mates. (Learn about the Sierra Nevada red fox.)“The noises are very much a feature of urban nights in winter,” says Harris, and not just because foxes are more vocal during that time of year. “The cold air and lack of vegetation means that [their screams] travel further.”Harris had his own fox scare story when one night, he found himself alone in a cemetery while radio-tracking a vixen. Unable to locate the female, he rested against a gravestone.Young barn owls save their screams for right around Halloween, when they first start looking for mates.“She crept behind me, sat down about six feet away and let out an almighty scream,” Harris recalls. “I have never jumped so high in my life. To have that noise so close to you on a pitch black night in a graveyard was, briefly, terrifying.”The same spooky setting is associated with the night screams of the barn owl (Tyto alba). English naturalist Gilbert White, writing in the 1780s, said the owl’s cries had whole villages “imagining the church-yard to be full of goblins and spectres.” “The thing with barn owls is that they fly silently so you have no idea when they’re flying towards you,” says Jo Plant of The Barn Owl Trust, a U.K. conservation non-profit based in Ashburton, England. “The scream will come out of nowhere.”“I have had people say to me they thought it was a woman screaming,” she adds.The ghostly bird’s sudden, chilling presence helps explain why the barn owl was believed to be an animal of bad omen in the past. A species that hardly utters a sound for most of the year, its screams are also perfectly timed for Halloween.You’ll start hearing the screams around now, Plant says, because at this time of year juvenile barn owls start seeking a mate for the first time. While barn owls, which have a worldwide distribution, often mate for life, singletons can be pretty noisy, she adds. Males also scream when guarding females during the spring. And if the nest or chicks are threatened by humans or predators, barn owls emit a loud, scary hiss. (Watch a mother barn owl protect her babies from a snake.)Like barn owls, bobcats (Lynx rufus) and cougars (Puma concolor) rarely vocalize, but when they do, anyone listening could be forgiven for calling 911.The noise of screeching bobcats has been likened to a child wailing in distress. Typically a sound made by competing males in winter during the mating season, it can be heard in many regions of North America. (See pictures of cats you've never heard of.)Even so, many people wouldn’t guess it was bobcats that woke them up. Elusive and naturally cautious, particularly around humans, the felines are almost wholly nocturnal in urban areas, so few are ever seen. While cougars (also called pumas or mountain lions) are unlikely to be heard caterwauling in people’s backyards, it’s a sound that makes a deep impression. Former U.S. President Theodore Roosevelt, who hunted cougar, described “a loud, wailing scream through the impenetrable gloom.” “No man,” he stated, “could well listen to a stranger and wilder sound.”In his book The Quest for the Eastern Cougar: Extinction or Survival?, Robert Tougias writes: “The most common analogy of the puma’s vocalization is that of an adult woman screaming in terror for her life.” (Learn how a Los Angeles cougar known for crossing freeways died.)Geckos give a frightening gape-mouthed holler when alarmed.Tougias adds that “although the scream of the cat is thought to be a way that males and females find one another, the scientific evidence is not conclusive.”Even small animals can produce unnerving screams, usually to deter predators. Some tropical frog species, for example, “are very well known for it,” says Andrew Gray, curator of herpetology at the Manchester Museum in the U.K.He says the smoky jungle frog (Leptodactylus pentadactylus) from South America lets out a wail that scares the daylights out of anybody or anything that grabs hold of it. “It’s so loud it’s incredible,” Gray adds. “It screams like a baby.” (Read about seven newly discovered mini frogs.)Various lizards also scream when alarmed. Some geckos add to the fright effect by hollering with a gaping mouth and then biting. For owners of the nocturnal leopard gecko (Eublepharis macularius), a species popular with reptile enthusiasts, it can seem like their pet is possessed. (Learn whether lizards are as silent as they seem.)Just the animal, in fact, for seeing off overzealous trick-or-treaters on Halloween night.© 1996-2018 National Geographic Society."}