{"id": "These wild monkeys thrive in Florida—and carry a deadly virus", "paragraph": "Wildlife managers in Florida say they want to remove roaming monkeys, like this one on the Silver River, from Silver Spring State Park in light of a new study that finds some of the animals carry a virus that can be dangerous to humans.PUBLISHED November 9, 2018In the heart of central Florida lies Silver Spring State Park—a large patchwork of forests and wetlands with a spring-fed river flowing through it. One of Florida’s first tourist attractions, the park was once known for its scenic vistas and native wildlife. But for the last 80 years, the park’s biggest draw has been its monkeys.That’s right—Silver Spring State Park is home to at least 300 rhesus macaques, a monkey native to south and southeast Asia. The animals are breeding rapidly, and a new study estimates that the monkey population will double by 2022 unless state agencies take steps to control it.The study, published October 26 in the journal Wildlife Management, claims that such an increase could put the health of the park and its visitors in serious jeopardy—because, among other problems, the monkeys carry a rare and deadly form of herpes virus called herpes B. It’s extremely, extremely rare for herpes B to spread from a monkey to a human, but when it does, it can be fatal.Monkey MuddleAn introduced population of rhesus macaques proven to be carrying the dangerous herpes B virus resides in Silver Springs State Park, a popular tourist destination.UNITED STATESALABAMAGEORGIAAtlantic OceanTallahasseeSilver SpringsState ParkFloridaOrlandoState parkOther protectedarea100 miLake Okeechobee100 kmMiamiNative Rhesus RangeThe small monkey is endemic to South and Southeast Asia.EUROPEASIARhesusmacaquerangeAFRICAINDIANOCEANMATTHEW W. CHWASTYK, NG STAFF SOURCES: FLORIDA PARK SERVICE; USGS; IUCNFlorida’s primate problem began in 1938 when a tour boat operator known as \"Colonel Tooey\" released six rhesus macaques onto a small island within what is now the state park. He procured the monkeys from a primate dealer in New York City with the intention to create a Tarzan-themed attraction on the island, but his plans quickly unraveled.Unbeknownst to Tooey, rhesus macaques are strong swimmers. Within hours of arriving on the island, the pink-faced monkeys began escaping into the woods. Six more macaques were brought in to replace them, but they escaped as well. By the 1980s, hundreds had spread out across the 5,000-acre park.Between 1984 and 2012, Florida wildlife officials authorized the removal of more than 1,000 monkeys in an effort to slow population growth and prevent conflict with humans. Officials also sterilized 20 female macaques during that time. (Read: Monkey clones created in the lab. Now what?)But the population continues to expand, perhaps with increasing speed. It's now growing around 11 percent annually, says Jane Anderson, wildlife ecologist and assistant professor of research at Texas A&M University-Kingsville, who led the study team. The population could be reduced to a third of its current size if half the females are sterilized annually.To completely eradicate them, the most viable option would be to remove half of the adults and those nearing adulthood every two years for at least 16 years, Anderson adds. But many locals don’t support such a move.Both sterilization and removal ended abruptly around 2012 when the public discovered the monkeys were being taken from the park and sold. By that time, trappers with permits from the state had delivered more than 1,000 monkeys into the hands of biomedical researchers, much to the dismay of animal rights groups. One trapper alone caught and sold 700 of the creatures.Rhesus Macaques are particularly problematic primates, says anthropologist Erin Riley, who studies human-animal interactions at San Diego State University. “They aren’t as afraid of humans as other animals, and they can be pretty nasty,” she says.Several aggressive monkey displays have led to two partial park closures since 2016, including one last summer, which was implemented after a monkey charged a family along one of the park’s boardwalks.Troops of Silver Springs macaques have caused mischief outside the park as well. One large group of rhesus monkeys recently raided a deer-feeder behind a house in Ocala—and yes, there are photographs. Although the town is just outside the park, stray males will occasionally venture within city limits and have ranged over 100 miles from their home colony, turning up in outlying cities such as Sarasota and Tallahassee. The colony within Silver Springs State Park has already spread into the Ocklawaha River and could easily establish new colonies in other parts of the state, experts warn.These monkeys are mostly herbivorous but may also eat insects, small invertebrates, and bird eggs. Having such a diverse diet means these monkeys can survive almost anywhere, Riley says. Outside their native range they’ve established populations in areas including the Florida Keys and Puerto Rico.A young rhesus monkey learns a lesson about sharing.In 2013, Riley received a grant from the National Geographic Society to investigate how rhesus macaques had adapted to Florida life. She found that, in addition to feeding on ash trees and other native vegetation, the monkeys were occasionally fed by humans: Around one-tenth of the boats that traverse the park via the Silver River illegally offer food to the monkeys, she found. Riley says this type of behavior habituates the monkeys to humans, a recipe for trouble.The monkeys “aren’t really that aggressive unless you get right up to 'em and try to feed them,” says Debbie Walters, a guide with a local tour boat outfit, Captain Tom's Custom Charters.Between 1977 to 1984, when the population consisted of roughly 400 animals, the Florida Fish and Wildlife Conservation Commission received 23 reports of primate-inflicted human injury; since that time, the agency has quit keeping records.Getting attacked by a monkey the size of a miniature poodle is a frightening enough prospect. But that's not all. Earlier this year, scientists from the U.S. Centers for Disease Control and Prevention discovered that around 30 percent of these monkeys carry herpes B, a rare and highly virulent virus that can be deadly to humans. Only about 50 human cases of herpes B have ever been documented, though as far as we know none of these derived from wild macaques. In 1997, one 22-year-old research assistant died after accidentally getting bodily fluids from a captive monkey in her eye and contracting the disease.In humans, herpes B—which is closely related to the more well-known human variety, herpes simplex virus—can cause inflammation of the brain and spinal cord leading to severe brain damage or death.The odds of catching herpes from a wild rhesus macaque are “really, really low, but the consequence is really, really high—sort of like the lottery,” says Steve Johnson, associate professor of wildlife ecology at the University of Florida. Macaques spread the virus through their urine, saliva, and feces—the last of which they’ve been known to throw at humans. But typically, the animals only shed the virus when they are under stress, like during their breeding season. Regardless, many locals appreciate the animals and want them to stay.“These monkeys have been here 80 years, and they didn’t choose to come here, so I don't think it’s fair for us to get rid of them because we don't like them anymore,” Walters says. “A lot of other animals cause disease, and we don't kill them.”Walters says she would support efforts to sterilize or relocate the monkeys, but would oppose a management plan that used lethal measures or sold monkeys for use in biomedical research.Though the environmental impact of this small population is unclear, studies elsewhere hint at a cause for concern. Research in Puerto Rico and parts of the Florida Keys, for example, shows the monkeys can have detrimental environmental effects such as destroying mangrove trees, polluting the water, and killing native birds.Johnson, who helped conduct Silver Spring’s recent primate population assessment, says that “they're cute and furry, and they invoke a lot of emotions, but [they’re] a non-native species in Florida, like feral pigs or Burmese pythons.” While the state encourages hunters to kill the latter two animals, which wreak havoc on native wildlife, the monkeys cannot be harmed.In January of this year, the Florida Fish and Wildlife Conservation Commission called on the Florida Department of Environmental Protection, which recently took over management of the park, to put a population-management plan in place.“Without management action, the presence and continued expansion of non-native rhesus macaques in Florida can result in serious human health and safety risks including human injury and transmission of disease,” Thomas Eason, assistant executive director of the commission, said in a recent statement.But nobody has decided yet what to do. These kinds of choices “have to be based on a lot of different things including public sentiment, money, and the political climate,” says Anderson.“Frankly, I'm really grateful that it's not my decision.”© 1996-2018 National Geographic Society."}