{"id": "Inside the disturbing world of illegal wildlife trade", "paragraph": "PUBLISHED November 9, 2018A recent report by the World Wildlife Fund for Nature showed that between 1970 and 2014 the vertebrate population declined by an average of 60 percent. While this was mostly due to habitat loss, the illegal trade in wildlife—whether rhino horn, tiger bone, or animals captured for the exotic pet market—poses a growing threat to many species’ survival. But as National Geographic contributor Rachel Love Nuwer writes in her new book Poached: Inside the Dark World of Wildlife Trafficking, many brave individuals and organizations are battling to expose the criminals—and save the animals.Speaking from her apartment in Brooklyn, New York, Nuwer explained how superstitious beliefs in China and Southeast Asia are a driving force of the trade; how wildlife trafficking needs to be tackled by law enforcement, not conservationists; and how she disguised herself as a prostitute to go undercover at a tiger farm in Laos.The global wildlife trafficking trade is worth an estimated $7 to $23 billion. Who runs it? Where are the hotspots? Who profits? What are the most affected animals?The most obviously affected animals are the big, charismatic megafauna, like rhinos, elephants, tigers, and even bears. In reality, though, we’re talking about millions of individual animals of thousands of species. It spans poaching for jewelry, pets, traditional medicines, trophies, or wild meat, which some cultures consider a luxury item. This is a global trade. However, much of the demand for illegal wildlife products is in Asia, especially in China and Vietnam. That’s predominantly because wealth in those places has been increasing over the past decades, so people who previously could not afford things like ivory jewelry or rhino horn carvings now can do so. There’s more demand than there is supply.There’s a misconception, especially in the media, that there are these Pablo Escobar-like kingpins controlling everything. While there is some evidence that a few people like that do exist, much of this illegal trade is made up of disorganized, opportunistic criminals. The guy in Zimbabwe killing an elephant and running its tusks to the nearby village won’t know the guy in the town, who then sells those tusks to the corrupt airport official who, in turn, doesn’t know who exactly the tusks are going to in Malaysia or Hong Kong.That’s one of the reasons that it’s so hard to tackle this thing. It’s not like you can just knock out a couple of big guys at the top and you’ve solved it. Even when you do make arrests of so-called kingpins, they’re oftentimes readily replaced by their colleagues.Most of us could draw an elephant or a rhino. But fewer could say what a pangolin looks like. Introduce us to this shy animal and explain why it is so highly prized that it now faces possible extinction.Pangolins are definitely my new favorite animal since writing this book. They are better known here in the U.S. and the U.K. as scaly anteaters, which is funny because they’re not that closely related to anteaters. They’re more closely related to cats and dogs. They look like walking pinecones with feet, or tiny, odd-looking dragons.There are four species of pangolins in Asia and four in Africa. Unfortunately, because they look so strange, people tend to attribute magical or medicinal properties to them. Traditional societies all over the world have different uses for pangolins, especially their scales. The biggest source of demand is traditional Chinese medicine, a version of which is also practiced in Vietnam. Their scales are boiled, dried, then ground up into a powder and served to women who are having trouble lactating, for example. In Vietnam their meat is also considered a delicacy. You call up a wild meat restaurant in advance and then it will either be prepared for you, or its throat will be slit on the spot.Tigers worldwide are also facing particularly vexing challenges. Give us a picture of the illegal trade and the ancient superstitions, often driven by male sexual insecurity, that fuel it. Is there enough being done to combat these primitive beliefs?Definitely not! There are an estimated 4,000 tigers left in the wild today. There’s many more than that in captivity. When I say captivity, I mean in people’s backyards in the U.S. and elsewhere, which is a completely different issue­—and then on so-called tiger farms in China and Southeast Asia. The tigers are bred, then slaughtered for their bones, meat, fur, teeth, and claws. Particularly sought after are the penises and bones, which are soaked in an awful-tasting rice wine and served, usually to men. They’re supposed to imbue men with the prowess and sexual energy of the tiger.The Chinese have been really good about making a show of shutting down the ivory trade recently, but other than that there’s nothing going on to combat the illegal wildlife trade. President Xi has been cutting back on corruption, which means closing wild meat restaurants. But there’s no re-education campaign to discourage tiger use. In fact, investigations by conservation groups show that government officials are some of the most common purchasers of tiger bone wine in China and other Asian countries. They have no intention of closing this down.Nearly a hundred elephants are slaughtered each day in the wild, most for their ivory tusks. This killing of elephants by humans could wipe out the animals in the wild within a generation.  You visited a tiger farm in the Golden Triangle Economic Zone, in Laos, disguised as a prostitute. Tell us about that story and whether farms could be a solution to tiger trafficking.[Laughs] I was quite nervous about visiting this place. It’s supposed to be a hotbed of crime, drugs, prostitution and yes, illegal wildlife trade. I had spoken with a woman named Debbie Banks, an excellent wildlife investigator working at the Environmental Investigation Agency in London, and she told me the only people who go there who are not Chinese, Vietnamese, or Thai are Russian or Ukrainian prostitutes, or else backpackers. I thought, okay, the former sounds a little bit more fun and I own some scanty clothes anyway, so I’ll go with that. I brought a friend and my husband from New York because I was nervous about going by myself. We wore ridiculous clothes and nobody seemed to notice or care about us, which was great. We could browse through these shops and look at huge quantities of ivory, rhino horn, and tiger products openly for sale, and we dropped by the Kings Romans casino where ivory and rhino horn were also openly displayed. We visited the tiger farm on the premises, where I was told clients can essentially go to shop for what animal they want to have for dinner at one of the on-site restaurants. This was an especially difficult experience for me; there were tigers pacing in small cages yowling mournfully, and a number of bears that were clearly suffering from cage-induced mania.There’s definitely a constituency of people, especially in China and South Asian countries, who argue for what is called “sustainable use of wildlife products,” whether that’s selling ivory or raising tigers and rhinos for their body parts. But tiger farms have been closely linked with laundering of tigers illegally caught in the wild, then passed off as products. So tiger farms pose a critical threat to wild tigers. That’s not even to touch on the humane animal advocacy side of things. These animals live miserable lives.It is estimated that 144,000 elephants were killed between 2007 and 2014 for their ivory, a drop in the overall population of 30 percent in just seven years. You attended an ivory burn in Kenya. Set the scene for us and explain the thinking behind this idea. Does it lower trafficking?The first huge ivory burn took place in 1989. It was organized in Kenya by the paleontologist Richard Leaky. His idea was to create a spectacle that the world could not ignore. And it worked. A few months later it led to nations voting to give elephants the highest degree of international protection, which effectively banned commercial trade of ivory, which was an amazing accomplishment!Whether the burns lower trafficking is not proven. But it’s not the primary goal of ivory burns; it’s an awareness-raising method to spread the word about the illegal wildlife trade. Another important purpose is to simply get the ivory out of circulation because a lot of the storehouses, particularly in developing countries, are notorious for leaking ivory and rhino horn out. You have 50 tons of ivory that you seize from some criminal and then a few weeks or months later that 50 tons has been reduced to 25, because of corruption. The big message is that ivory should never be traded. It has no purpose at all except for elephant tusks on elephants.One of the many inspiring activists you met is a British woman named Jill Robinson. Tell us about her and the appalling trade in bear bile.Jill is amazing. She was living in Hong Kong doing work on cats and dogs, when someone mentioned to her a bear farm for this bear bile trade, and her interest was piqued. She took a tour to a bear farm in mainland China and left the tour group at one point because she heard noises in the basement. She crept down these stairs to a dark room where she found cages and cages of bears in horrific condition, with open wounds. Jill had this moment of connection and wound up dedicating her life to ending bear farming for bile. Her organization, Animals Asia, has saved hundreds of bears from these farms and brought them to rehabilitation sites.The thing about bear bile is that it’s one of the few traditional Chinese medicines that is efficacious. However, the active component, ursodeoxycholic acid, can be synthesized in a lab so you do not need bears to be put in these awful situations or kept in captivity. The problem is, users in China and Vietnam want this to be a wild, free animal, so they think they are absorbing the essence of this pure, strong thing.At a conference in London earlier this month, it was suggested that the best way to curb wildlife trafficking, like the drugs trade, was to follow the money not, as is usual, the animal. What’s your view on this? Is enough being done to intercept these illicit funds?That’s a great point! Definitely not enough is being done because virtually nothing is being done in terms of investigating the financial crime side of things. The problem with the illegal wildlife trade is that it’s so often seen as something in the purview of conservationists, biologists or ecologists. But that’s like giving botanists the job of tackling the cocaine and heroin trade. We need to get criminal experts involved, including money-laundering experts, because a lot of times the punishments that go with breaking wildlife laws are really weak. It’s a $100 fine for trafficking a rhino horn that might be worth $30,000! Money laundering laws would be much stronger. So I think crime is where we should be focusing. We need criminal experts, not wildlife experts, and we need to treat this like any other type of crime, not something special just because it involves wildlife.There are bright spots in this story. Tell us about the Zakouma National Park in Chad, and what you think the future holds for trafficked animals.The Zakouma National Park in Chad had an elephant population of around 4,000, one of the biggest herds in Central Africa, but in less than a decade that population fell to around 450. It was being absolutely hammered by Janjaweed poachers riding down from Sudan for this killing spree and taking the ivory back to sell. Everybody had resigned themselves to saying goodbye to those elephants. However, a spectacular non-profit organization called African Parks negotiated with the President of Chad to take over the park. Thanks to their efforts, poaching is virtually at zero, and the elephant population is once again growing. They’re even having new babies, which is huge!There are other people who are giving it their all to save their countries’ wildlife. Thai Van Nguyen, the founder of Save Vietnam’s Wildlife, is a great example. He’s Vietnamese, his organization is entirely run by Vietnamese and he is the only person in Vietnam equipped to rehabilitate pangolins rescued from the illegal wildlife trade. Thai brings them back to his facility, rehabilitates them, and when they’re strong enough he and his colleagues take the pangolins to secret locations and release them.People like Thai are buying time for the rest of us as we get our acts together and decide this is something we want to stop. And that animals are worth saving.This interview was edited for length and clarity.Simon Worrall curates Book Talk. Follow him on Twitter or at simonworrallauthor.com.© 1996-2018 National Geographic Society."}