{"id": "Ancient Black Sea shipwreck is unprecedented discovery", "paragraph": "A Remote Operated Vehicle (ROV) captures images of the 2,400-year-old merchant ship, which rests some 1.2 miles beneath the surface of the Black Sea. PUBLISHED October 23, 2018Archaeologists are heralding the discovery of an unusually intact ancient shipwreck, found more than a mile below the surface of the Black Sea off of the Bulgarian coast. The 2,400-year-old wooden vessel features elements of ship construction, including the mast and rowing benches, that until now have not been preserved on ships of this age.An announcement of the discovery, made by the Black Sea Maritime Archaeology Project (MAP), first appeared in the Guardian. MAP has discovered more than 60 historic shipwrecks during a three-year survey of the Black Sea.The 75-foot-long ship, documented by a Remote Operated Vehicle (ROV) equipped with cameras, appears similar to merchant vessels depicted on ancient Greek vases. A small piece of the wreck was raised and radiocarbon dated to around the fifth century B.C., a time when Greek city-states were frequently trading between the Mediterranean and their colonies along the Black Sea coast. (Read more about the Black Sea Maritime Archaeology Project.)While older intact sailing vessels have been recovered from Egyptian burial sites on land, it is unusual for submerged ancient wrecks to be preserved so well. The unique preservation of the 2,400-year-old ship is due to the unusual water chemistry of the Black Sea and the lack of oxygen below 600 feet. This anoxic layer, which makes up nearly 90 percent of the sea’s volume, prevents physical and chemical processes that cause organic decay to take place. (See more shipwrecks discovered by the Black Sea Maritime Archaeology Project.)National Geographic Archaeologist-in-Residence Fredrik Hiebert, who has searched for Black Sea shipwrecks on an earlier National Geographic-sponsored expedition, says the new discovery reinforces the idea that the anoxic waters of the Black Sea “are an incredibly rich museum of human history.”“This wreck shows the unprecedented potential for preservation in the Black Sea, which has been a critical crossroads of world cultures for thousands of years,” Hiebert says.“It’s an incredible find.”© 1996-2018 National Geographic Society."}