{"id": "Inside the daring plan to map every coral reef from space", "paragraph": "An aerial view of the Great Barrier Reef, Australia.PUBLISHED October 29, 2018Coral reefs are the rain forests of the ocean. They are beacons of biodiversity that house a quarter of all marine species and provide food and livelihoods to more than half a billion people worldwide.But these aquatic havens now face existential threats: overfishing, coastal development, and heat stress brought on by climate change. If humankind's actions continue to warm Earth more than two degrees Celsius (3.6 degrees Fahrenheit) above preindustrial levels, coral reefs as we know them could almost completely vanish. As reefs face this impending crisis, the need to monitor them has intensified. But coral researchers face a mammoth problem: They don't know precisely where all of Earth's reefs even are, and only a small fraction of those are actively monitored. How can conservationists protect what they can't locate?Now, researchers are using data from Planet Labs, which operates the world's largest fleet of Earth-observing satellites, to make the first global, high-resolution map of all coral reefs—a project called the Allen Coral Atlas.Conceived of slightly more than a year ago, the atlas is coming together with urgency. On Monday at the Our Ocean conference in Bali, Indonesia, the team behind the atlas unveiled a global photomosaic of Earth's coral reefs, with a resolution of about 12 feet per pixel—far more detailed than existing global coral maps. They have also released the first detailed maps of five coral reefs, where they are testing automated processes for classifying the satellite images.Armed with high-powered computer algorithms, researchers transform satellite images from the company Planet (left) into detailed maps of coral reefs (right). This photograph and map depict Australia's Heron Island, a coral cay at the southern end of the Great Barrier Reef.The goal is that by sometime next year, the team's algorithms will be able to identify and map entire regions worth of reefs far more quickly and accurately than otherwise would be possible. And by the end of 2020, researchers hope to have every coral reef mapped in detail, which would provide a baseline for monitoring bleaching events and other short-term changes.The project takes on new meaning since the recent deaths of its two driving forces: Microsoft co-founder and philanthropist Paul Allen, who funded its creation, and Hawai'i Institute of Marine Biology director Ruth Gates, one of the project's lead scientists. Allen died suddenly on October 15 from non-Hodgkin lymphoma, and Gates died on October 26 from brain cancer.“Ruth Gates was one of the world’s most visionary, passionate and committed voices for science, conservation and coral reefs,” said Andrew Zolli, the vice president of global impact initiatives at Planet Labs, in an email. “Her spirit animated our shared work from the outset ... Even in grief, we are energized by her example and her fierce urgency, and doubly committed to seeing her vision realized.”In her own words, Ruth Gates describes her work to identify and breed \"super corals\" that are naturally more resilient to heat and acidity, the stressors that climate change brings to reefs.So, too, with Allen. “It has been really hard, but the important thing is how we deliver on the mission that Paul set out for us,” says Lauren Kickham, the director of project management at Vulcan, the company that oversees Allen's business and philanthropic ventures. An experienced technologist and a passionate philanthropist, Allen's mantra may well have been to move fast and fix things. Allen regularly tasked his staff with lofty, relentlessly impact-driven goals, such as counting every single elephant on the African savanna or tracking illegal fishing from space.Allen—an avid SCUBA diver—was already funding coral research, but his concern intensified in 2017 when Allen found his favorite reef dive sites sickened and bleached. “He was lamenting that some reefs he saw weren't doing so well. And then he looked at me and said something funny, like: 'In fact, your job should be to save all the world's coral reefs,'” says Art Min, Vulcan's vice president of impact. “And I was like, 'OK, challenge accepted!'”Dominant benthic covers on Heron ReefCoral and algaeMicroalgae matsRockRubbleSandLand1 mi1 kmHERON ISLANDHERON REEFPACIFICOCEANHeron Reef AUSTRALIANG STAFF.SOURCE: VULCANDominant benthic covers on Heron ReefPACIFICOCEANHeron Reef AUSTRALIACoral and algaeMicroalgae matsLandRockRubbleSandHERON ISLANDHERON REEF1 mi1 kmNG STAFF.SOURCE: VULCANDominant benthic covers on Heron ReefCoral and algaeCoral and algaeMicroalgae matsLandRockRubbleSandPACIFICOCEANHeron Reef HERON ISLANDAUSTRALIAHERON REEF1 mi1 kmNG STAFF.SOURCE: VULCANDominant benthic covers on Heron ReefPACIFICOCEANCoral and algaeMicroalgae matsLandRockRubbleSand Heron ReefAUSTRALIAHERON ISLANDHERON REEF1 mi1 kmNG STAFF.SOURCE: VULCANGates, whose research Allen funded, helped bring together the project's brain trust. In the summer of 2017, Gates met Zolli. The pair realized that they knew the same researchers at the Carnegie Institution for Science and invited them to join the project. In short order, the University of Queensland, too, came on board.“It's a little bit like the universe wanted this to happen,” says Zolli, a former National Geographic Emerging Explorer. “Suddenly, we had the makings of a dream team.”The team's audacious mapping plan starts with Planet Labs' more than 150 Earth-observing satellites, the largest fleet of its kind ever launched into space. Most of these tiny satellites orbit around the planet's poles. As Earth rotates beneath them, the fleet acts like a line scanner, capturing images of the planet's surface strip by strip. Every day, they photograph Earth's entire surface in incredible detail, with just 12 feet per pixel.To make Planet Labs' raw images more suitable for mapping corals, the Allen Coral Atlas brought on ecologist Greg Asner of the Carnegie Institution for Science. For months, Asner's team has worked with Planet Labs to computationally strip the images of visual elements that obscure the reefs: the atmosphere, the clouds, the sun's reflection off the sea, and the seawater itself. Asner's team also had to make sure that when each of Planet Labs' satellites passed over the same coral reef, they all got the same measurements—a crucial, and difficult, calibration.“At one of our test sites, we had 132 different Planet satellites pass over, and it hit me like, 'Oh my god!'” Asner says. “How do you make 132 different satellites behave?”Once Asner's team and Planet Labs clean up the images, they pass the photographs off to the University of Queensland. There, a team led by Stuart Phinn and Chris Roelfsema uses algorithms to classify each pixel of each image as coral, rock, algae, sand, or other materials. Phinn notes that satellite monitoring of the oceans has lagged decades behind land, and the massive satellite networks needed for this mapping project only recently came online. “It is just mind-blowing that we’re able to now do this,” Phinn says.So far, Phinn and Roelfsema's team has mapped five test reefs around the world. Now, the team needs to verify these maps in the field. They're also working with local conservation groups to make sure the Allen Coral Atlas will be useful for their work.Take Blue Resources Trust, a marine conservation non-profit in Sri Lanka, for example. Nishan Perera, the trust's co-founder, says that the new data could help Sri Lanka craft marine protected areas and conduct better-targeted reef surveys. “The Coral Atlas really takes it to another level,” Perera says. “It helps you to focus your work and maximize your resources.”Gates was initially tapped to lead this verification and outreach effort, but in June 2018, she told her colleagues of her cancer diagnosis. Gates asked her friend and colleague Helen Fox, a senior director at the National Geographic Society, to step in and help. The two had been close since 2003, when they met at the Hawai'i Institute of Marine Biology.“She used to say, 'If you're not having fun, why do it?,' which to me is amazing, considering her professional legacy of sounding the alarm on the dire situation facing coral reefs,” said Fox in an email. “I hope the Allen Coral Atlas will flourish and achieve its potential to improve management and policy to help save coral reefs. Nothing would be a better way to honor the amazing legacy of Dr. Ruth Gates.”Once the Allen Coral Atlas has mapped Earth's reefs, its goal will be to monitor these reefs for flashes of short-term change, acting as a global coral alarm system.The idea is to scan Planet Labs' images for sudden changes in brightness within the pixels that correspond to live coral reefs. If a patch of coral quickly lightens, the coral may have bleached, or perhaps blast fishing has shattered a reef and exposed the corals' white skeletons. If corals quickly darken, it can be a sign of algae, either growing over the corals themselves or blooming in the water nearby.Asner, the Carnegie ecologist, says that as the world races to lower its carbon footprint, the Allen Coral Atlas could help find the patches of coral that are naturally resistant to climate change's slings and arrows: “Those are key, not just because they're sitting there now alive, but that's the future genetic base for what is going to survive in frequently warmer seas.” The project could buoy efforts to find naturally resilient “super corals,” a key focus of Gates's research.In the meantime, the team is racing forward, spurred both by the grim countdown of climate change and the drive to honor Paul Allen's and Ruth Gates's legacies.“Ruth and I shared a deep wonder for coral reefs, and we made a pact to bring our scientific worlds together to enhance the effort to save them,” said Asner in an email. “We laughed a lot. I'm going to miss her dearly.”“It's an astounding group of individuals and institutions...and that brings me a lot of hope,” adds Kickham, the Vulcan director. “We've got all the tools we need to make this possible. So bring it on.”© 1996-2018 National Geographic Society."}