{"id": "Under poaching pressure, elephants are evolving to lose their tusks", "paragraph": "Elephants with a rare “tuskless” genetic trait had a better chance of surviving Mozambique’s long civil war, financed in part by poached ivory. About a third of surviving elephants’ daughters have no tusks.PUBLISHED November 9, 2018The oldest elephants wandering Mozambique’s Gorongosa National Park bear the indelible markings of the civil war that gripped the country for 15 years: Many are tuskless. They’re the lone survivors of a conflict that killed about 90 percent of these beleaguered animals, slaughtered for ivory to finance weapons and for meat to feed the fighters.Hunting gave elephants that didn’t grow tusks a biological advantage in Gorongosa. Recent figures suggest that about a third of younger females—the generation born after the war ended in 1992—never developed tusks. Normally, tusklessness would occur only in about 2 to 4 percent of female African elephants.Decades ago, some 4,000 elephants lived in Gorongosa, says Joyce Poole—an elephant behavior expert and National Geographic Explorer who studies the park’s pachyderms. But those numbers dwindled to triple digits following the civil war. New, as yet unpublished, research she’s compiled indicates that of the 200 known adult females, 51 percent of those that survived the war—animals 25 years or older—are tuskless. And 32 percent of the female elephants born since the war are tuskless.A male elephant’s tusks are bigger and heavier than those of a female of the same age, says Poole, who serves as scientific director of a nonprofit called ElephantVoices. “But once there’s been heavy poaching pressure on a population, then the poachers start to focus on the older females as well,” she explains. “Over time, with the older age population, you start to get this really higher proportion of tuskless females.”This tuskless trend isn’t limited to Mozambique, either. Other countries with a history of substantial ivory poaching also see similar shifts among female survivors and their daughters. In South Africa, the effect has been particularly extreme—fully 98 percent of the 174 females in Addo Elephant National Park were reportedly tuskless in the early 2000s.This tuskless matriarch moves with her herd across Gorongosa’s floodplain.“The prevalence of tusklessness in Addo is truly remarkable and underscores the fact that high levels of poaching pressure can do more than just remove individuals from a population,” says Ryan Long, a behavioral ecologist at the University of Idaho and a National Geographic Explorer. The “consequences of such dramatic changes in elephant populations are only just beginning to be explored.”Josephine Smit, who studies elephant behavior as a researcher with the Southern Tanzania Elephant Program, says that among the female elephants she tracks at Ruaha National Park, an area that was heavily poached in the 1970s and 1980s, 21 percent of females older than five are tuskless. As in Gorongosa, the numbers are highest among older females. About 35 percent of females older than 25 are tuskless, she says. And among elephants ages five to 25, 13 percent of females are tuskless. (Smit, a doctoral candidate at the University of Stirling, in Scotland, says the data have not yet been published, though she presented the findings at a scientific wildlife conference last December.)Tusklessness is TrendingTusked femaleTuskless femaleNaturally Occuring in AfricaOnly 2 to 4 percent of female African elephants never develop tusks in the wild.4%Unpoached populationsMozambique: Gorongosa National ParkTuskless elephants eluded poaching during the civil war and passed this trait to many of their daughters. 51%25 years or older(civil war survivors)32%24 years or younger Tanzania: Ruaha National ParkPoaching in the 1970s and 80s gave tuskless elephants here a similar biological advantage.35%25 years or older13%5 to 25 years oldTaylor Maggiacomo, NG STAFF. SOURCES: Joyce Poole, ElephantVoices Online; Josephine Smit, University of Stirling, ScotlandTusklessness is TrendingNaturally Occurring in AfricaMozambique: Gorongosa National  Park  Tanzania: Ruaha National ParkOnly 2 to 4 percent of female African elephants never develop tusks in the wild.Tuskless elephants eluded poaching during the civil war and passed this trait to many of their daughters. Poaching in the 1970s and ’80s gave tuskless elephants here a similar biological advantage.4%35%51%25 years or older(civil war survivors)25 years or olderUnpoached populationsTusked female32%13%Tuskless femaleTaylor Maggiacomo, NG STAFF SOURCES: Joyce Poole, ElephantVoices Online; Josephine Smit, University of Stirling, Scotland24 years or younger 5 to 25 years oldPoaching has also pushed tusk sizes down in some heavily hunted areas, such as southern Kenya. A 2015 study conducted by Duke University and the Kenya Wildlife Service compared the tusks of elephants captured there between 2005 and 2013 with those of elephants culled between 1966 and 1968 (that is, before significant poaching took place in the late 1970s and early 1980s) and found significant differences. Survivors of that period of intense poaching had much smaller tusks—they were about a fifth smaller in males and more than a third smaller in females.The pattern repeated in their offspring. On average, male elephants born after 1995 had tusks 21 percent smaller than the males from the 1960s, and 27 percent smaller than the females from that period. According to the study’s authors, “although our evidence for the role of genetics on tusk size is indirect,” studies of mice, baboons, and humans have similarly established that incisor size—homologous to a tusk in elephants—is heritable and has “substantial genetic influence.”A tuskless adult female elephant in the Gorongosa National Park woodlands has been fitted with a GPS collar so researchers can track her movements and better understand her behavior.Despite the wave of human-influenced tusklessness in recent decades, elephants missing their tusks are surviving and appear healthy, according to Poole. Scientists say that the significant proportion of elephants with this handicap may be altering how individuals and their broader communities behave, and they want to find out if, for example, these animals have larger home ranges than other elephants because they might need to cover more ground to find recoverable foods.Tusks are essentially overgrown teeth. Yet they’re typically used for most tasks of daily living: digging for water or vital minerals in the ground, debarking trees to secure fibrous food, and helping males compete for females.The work elephants do with their tusks is vital for other animals too. Elephants’ “role as a keystone species to topple trees and dig holes to access water is important for a variety of lower species that depend on them,” Long says. Tusk action also helps create habitats. Certain lizards, for example, prefer to make their homes in trees roughed up or knocked over by browsing elephants.If elephants are changing where they live, how quickly they move, or where they go, it could have larger implications for the ecosystems around them. “Any or all of these changes in behavior could result in changes to the distribution of elephants across the landscape, and it’s those broad-scale changes that are most likely to have consequences for the rest of the ecosystem,” Long says.Now, Long and a team of ecology and genetic researchers are starting to study how tuskless elephants are navigating their lives. In June, the team started tracking six adult females in Gorongosa—half with tusks, half not—from three different breeding herds. They fitted them with GPS collars, took blood and dung samples, and plan to monitor them for a couple of years—or until the battery life in each of the collars gives out—periodically taking more fecal samples to analyze the elephants’ diet.Their goal is to uncover more information about how these animals move, eat, and what their genomes look like. Long hopes to detail how elephants without the benefit of tusks as tools may alter their behavior to get access to nutrients. Rob Pringle, at Princeton University, plans to look at dung samples for insights about both diet and the army of microbes and parasites that live inside each elephant’s gut. Another collaborator, Shane Campbell-Staton, an evolutionary biologist at the University of California Los Angeles, will study blood, searching for answers about how genetics influences the phenomenon of tusklessness.Exactly how this trait is inherited is “puzzling,” Campbell-Staton says. Tusklessness does seem to occur disproportionately among females. It makes sense that tuskless males wouldn’t be able to compete for breeding access to female elephants, he says. But if this trait was traditionally X-linked—passed down along the X chromosome, which helps determine sex and carries genes for various inherited traits—we would think that because males always get their X chromosome from their mothers that you’d have a really large population of males that are tuskless. “But we don’t see that. Tuskless males are extremely rare in African elephants,” he says.Joyce Poole corroborates this. She says that in her entire career she’s seen only three or four tuskless males—none of them in Gorongosa.Although tuskless elephants’ nutritional and behavioral characteristics haven’t yet been formally compared to those of tusked elephants in any herd, Smit says anecdotally that in her research she’s seen that elephants without tusks appear to have found work-arounds.“I’ve observed tuskless elephants feeding on bark, and they’re able to strip bark with their trunks, and sometimes they use their teeth.” They may also be relying on other elephants’ inadvertent help, she says. Perhaps the elephants are targeting different kinds of trees that are easier to strip, or trees that have already had some stripping by other elephants—giving them a prepared leverage point for tearing off bark.Recent bans on the ivory trade in China and the U.S. may help reduce demand for tusks, but exactly how long it could take a population with a high proportion of tusklessness to recover some of its numbers—and its tuskedness—varies. Among Asian elephants, for example, a long history of hunting for ivory—as well as removing tusked elephants from the wild for labor—likely helped contribute to higher tuskless numbers there.“If you look at Asian elephants, females don’t have tusks at all, and depending on which population you look at in which country, most males are also often tuskless,” Poole explains. Exactly why the Asian and African elephant populations have such different rates of tusklessness remains unexplained.Yet Poole and others note that in areas in Asia that historically have been targeted for ivory hunts, tuskless levels are high—just as in Africa—underscoring that humans are leaving a lasting mark on Earth’s largest land mammal.© 1996-2018 National Geographic Society."}