{"id": "World's largest deep-sea octopus nursery discoveredWorld's largest deep-sea octopus nursery discovered", "paragraph": "PUBLISHED October 29, 2018Off the coast of Monterey, California, and some two miles below the surface of the Pacific Ocean, scientists piloting a remotely-operated submersible saw something no one has ever seen before.Octopuses. Hundreds of them. Huddled on a rocky outcrop at the base of an underwater mountain.“We went down the eastern flank of this small hill, and that’s when—boom—we just started seeing pockets of dozens here, dozens there, dozens everywhere,” says Chad King, chief scientist on the Exploration Vessel Nautilus.All in all, King estimates that more than 1,000 octopuses known as Muusoctopus robustus were nestled among the rocks, most of which appeared to be inverted, or turned inside out. For this species, that inside-out pose is common among females that are brooding, or protecting their growing young. In some cases, the submersible’s camera could even spot tiny embryos cradled within their mothers’ arms.“Out of that 1,000, we might have seen two or three octopuses that were just swimming around,” says King, who is also a marine biologist at the Monterey Bay National Marine Sanctuary. “So I’d say almost 99 percent were brooding.”What’s more, the scientists noticed that the water appeared to shimmer in multiple places where the octopuses were concentrated—“kind of like an oasis or a heat wave off the pavement,” says King.This suggests that warm water may be seeping out of the seamount in places, and the octopuses are huddled in those spots. Though the submersible was not equipped with temperature probes on this dive, if the finding is verified, it could mean the octopuses are seeking out such warmth to help incubate their eggs.“It definitely looked like the octopuses wanted to be there,” says King.Amazingly, the discovery comes just months after scientists reported the only other deep-sea octopus nursery on record — an aggregation of around 100 octopuses along the Dorado Outcrop off Costa Rica. They may even be the same species as those discovered off of California, but no one can say for sure yet.(Related: “Deepest Octopus Nursery Discovered, Holds Dark Secret”)“I've been working on octopuses since 1982, and I would have sworn that our observations at Dorado Outcrop were a once-in-a-lifetime opportunity,” writes Janet Voight, a marine biologist at the Field Museum in Chicago, in an email. “To see these videos 10 months after our paper came out makes me think there are a lot more places like this down there than I ever dared imagine.”There are key differences between the octopus sightings, however.For starters, the Costa Rican sighting involved far fewer octopuses. Also, Voight and lead author Anne Hartwell were able to confirm that the Costa Rica site did, indeed, have warm fluid billowing up from the seafloor. However, in that case, it appears to have been a bad thing, because none of the eggs the octopuses were incubating seemed to be growing. It may be that the water was actually too hot.In the new video captured by the Nautilus team, though, Voight sees signs of life. If you look closely at one of the egg cases, you can just make out the eye of a developing embryo.“Which means that these eggs are developing well,” says Voight, “or at least that one is.”While the new footage offers an exciting glimpse into the lives of these creatures, it also reveals how little we know about these octopuses and the environment they inhabit.For instance, not everyone is convinced that the shimmer means warmth.According to senior scientist Bruce Robison of the Monterey Bay Aquarium Research Institute, the geologists who study this region say it’s been inactive for millions of years. “Thus it's very unlikely that there is any heat involved,” he writes in an email.(Related: “Octopus Cares For Her Eggs For 53 Months, Then Dies”)If anything, Robison guesses the shimmer could be caused by a seepage of methane gas.King, however, says they didn’t see any of the bacterial mats, clams and other species you’d expect to see with a methane seep. Furthermore, it may not even be the heat the octopuses are attracted to. “Maybe it’s just because that’s the best rock available,” says King.Adds Voight: “This observation is just further proof that we have no idea of what is going on in the deep sea.”© 1996-2018 National Geographic Society."}