{"id": "Halloween: costumes, history, myths, and more", "paragraph": "Photograph by Transcendental Graphics, Getty ImagesA coven of costumed \"witches\" line up for a Halloween portrait around 1910.Photograph by Transcendental Graphics, Getty ImagesNational GeographicPUBLISHED October 19, 2018Today's mix of parties, pranks, and profit is a far cry from Halloween's ancient origins. Over the centuries the celebration has seen a lot of changes, and we've summed them up here for you.Halloween's origins date back more than 2,000 years. On what we consider November 1, Europe's Celtic peoples celebrated their New Year's Day, called Samhain (SAH-win).On Samhain eve—what we know as Halloween—spirits were thought to walk the Earth as they traveled to the afterlife. Fairies, demons, and other creatures were also said to be abroad. (See pictures of crypts and catacombs.)In addition to sacrificing animals to the gods and gathering around bonfires, Celts often wore costumes—probably animal skins—to confuse spirits, perhaps to avoid being possessed, according to the American Folklife Center at the U.S. Library of Congress.By wearing masks or blackening their faces, Celts are also thought to have impersonated dead ancestors.Young men may have dressed as women and vice versa, marking a temporary breakdown of normal social divisions.In an early form of trick-or-treating, Celts costumed as spirits are believed to have gone from house to house engaging in silly acts in exchange for food and drink—a practice inspired perhaps by an earlier custom of leaving food and drink outdoors as offerings to supernatural beings.Samhain was later transformed as Christian leaders co-opted pagan holidays. In the seventh century Pope Boniface IV decreed November 1 All Saints' Day, or All Hallows' Day.The night before Samhain continued to be observed with bonfires, costumes, and parades, though under a new name: All Hallows' Eve—later \"Halloween.\"European immigrants brought Halloween to the United States, and the celebration really gathered steam in the 1800s, when Irish-American immigration exploded.Anoka, Minnesota, may be home to the United States' oldest official Halloween celebration. Beginning in 1920, the city began staging a parade and bonfire.Anoka historians say townsfolk wanted to curb Halloween pranks that loosed cows on Main Street and upended outhouses.More than a third of Americans say they believe in ghosts, according to an AP-Ipsos poll conducted before Halloween 2007. Twenty-three percent claimed to have seen a ghost or sensed one's presence.About one in five people believe that spells or witchcraft are real, according to the poll.Some Halloween spook stories just won't die—even if there's little substance behind the scare.For example, satanic cults—far more common in fiction than in fact—have been said to sacrifice black cats on Halloween.But experts say that there is little evidence for such fears, and that the few isolated incidents involving abused black cats were the work of disturbed—often adolescent—loners.Candy tainted by poisons, needles, or razor blades is another Halloween hobgoblin.But sociologist Joel Best said in 2010 that dangerous-candy rumors might be manifestations of fears and anxieties about the future. In a world where so many threats—terrorism, crashing stock markets—seem uncontrollable, it may be comforting for parents to focus on preventable calamities, such as a child biting into a spiked apple, said Best, of the University of Delaware.Best conducted a study of alleged tainted Halloween candy incidents.\"I have been unable to find a substantiated report of a child being killed or seriously injured by a contaminated treat picked up in the course of trick-or-treating,\" he wrote.© 1996-2018 National Geographic Society."}