{"id": "'Biggest case on the planet' pits kids vs. climate change", "paragraph": "These young people are among the group suing for the right to a stable climate. Left to right they are Aji Piper, Levi Draheim, Journey Zephier, Jayden Foytlin, Miko Vergun, and Nathan Baring.PUBLISHED November 9, 2018Levi Draheim is a nine-year-old science geek. He founded an environmental club as a fourth grader and gives talks about climate change to audiences of grown-ups. His home is on a slender barrier island on Florida’s Atlantic coast, 21 miles south of Cape Canaveral and a five-minute walk from the beach. By mid-century, his sandy childhood playground could be submerged by rising seas. He will be just 42.Nathan Baring is 17 and a high school junior in Fairbanks, Alaska—120 miles south of the Arctic Circle. He loves cold weather and skis. The Arctic is warming twice as fast as the rest of the planet. Now winter snows that Baring once celebrated as early as August in Fairbanks can hold off until November.By 2050, Arctic sea ice will have virtually disappeared, and temperatures in the interior, surrounding Fairbanks, will have risen by an additional 2 to 4 degrees Fahrenheit, altering the boreal forest ecosystem. Nathan will be 50.“I can deal with a few days of rain in February when it’s supposed to be 40 below,” he says. “But I can’t deal with the idea that what my parents experienced and what I have experienced will not exist for my children. I am a winter person. I won’t sit idly by and watch winter vanish.”Baring and Draheim so lack confidence that they will inherit a healthy planet that they are suing the United States government for failing to adequately protect the Earth from the effects of climate change. They are among a group of 21 youths who claim the federal government’s promotion of fossil fuel production and its indifference to the risks posed by greenhouse gas emissions have resulted in “a dangerous destabilizing climate system” that threatens the survival of future generations. That lapse violates, the court papers argue, their fundamental constitutional rights to life, liberty, and property. The lawsuit also argues that the government violated the public trust doctrine, a legal concept grounded in ancient law that holds the government is responsible for protecting public resources, such as land and water—or in this case, the climate system—for public use.The kids’ lawsuit was joined by acclaimed NASA climate scientist James Hansen, who began studying climate change in the 1970s and whose granddaughter, Sophie, is among the 21 young plaintiffs.“In my opinion, this lawsuit is made necessary by the at-best schizophrenic, if not suicidal nature of U.S. climate and energy policy,” he told the court.Last fall, U.S. District Court Judge Anne Aiken agreed with the youths’ claim. Her sweeping 54-page opinion laid the foundation for what looks to be a groundbreaking trial later this year. In her ruling, Aiken established, in effect, a new right for these children and teens: a right to expect they could live in a stable climate.“I have no doubt that the right to a climate system capable of sustaining human life is fundamental to a free and ordered society,” Aiken wrote. “Just as marriage is the foundation of the family, a stable climate system is quite literally the foundation of society, without which there would be neither civilization nor progress.”She made clear that “this lawsuit is not about proving that climate change is happening or that human activity is driving it. For purposes of this motion, those facts are undisputed.”And Aikens added: “Federal courts too often have been cautious and overly deferential in the arena of environmental law and the world has suffered for it.”Mary Wood, a University of Oregon environmental law professor who pioneered the concept that the atmosphere should be treated as part of the public trust, calls the lawsuit “the biggest case on the planet.”“This claim challenges the government’s entire fossil-fuel philosophy. The whole thing,” Wood says. “The scientists, on the other hand, are saying if we continue on our path without drastic cuts in carbon dioxide emissions, we are going to leave a barren planet that will not support broad human survival. You could not get claims more grave than that.”The lawsuit originally was filed against the Obama administration, which sought to have the case dismissed because the courts are “ill-suited” to oversee “a phenomenon that spans the globe,” according to court papers.“Climate change is a very serious problem,” Sean Duffy, a Justice Department lawyer told the court last September. “We do not question the science. Climate change threatens our environment and our ecosystems. It alters our climate systems and it will only worsen over time. It is the result of man-made emissions. Now where (the parties) disagree is as to who determines how to address climate change in the first instance. Our position is that Congress and the Executive Branch should address climate change in the first instance and should do so by coordinating with other nations.”Several groups representing the fossil-fuel industry, including the American Petroleum Institute, joined the lawsuit as intervenors, but disagreed “to the extent of climate change, to the emissions that cause it, and to other scientific principles,” Quin Sorenson, a lawyer representing the industry, argued in court.The case could prove even more consequential with the change of administration because of President Trump’s efforts to roll back climate regulations put in place by his predecessor. Last week, the Trump administration shifted course on the case and asked that a federal appeals court review Judge Aiken’s decision to proceed to trial.“Whatever happens next, this is a case to watch,” says Michael Burger, a Columbia University law professor and specialist in climate law. “It’s out there, ahead of the curve. And given the change in administration and President Trump’s views on climate change, this may be a potential hook to keep things moving along the climate change front. It may be the opening salvo in what will be an increasing number of lawsuits that take a rights-based approach to climate change in the United States.”In challenging the government’s role in climate change on constitutional grounds Julia Olson, the plaintiffs’ lead lawyer, harkens to the realm of historic Supreme Court cases that established new constitutional protections in situations when Congress failed to act. Those cases include the 1954 Brown v. Board of Education decision that banned segregation in public schools and the 2015 Obergefell v. Hodges decision that legalized same-sex marriage.The climate change lawsuit makes essentially a straightforward request. It asks a federal judge to order the government to write a recovery plan to reduce carbon emissions to 350 parts per million by 2100 (down from 400 parts per million) and stabilize the climate system.The courts are needed to step in, Olson argued, because the government has not—despite knowing for more than 50 years that the burning of fossil fuels causes global warming.Olson first tuned in to the climate change threat when, eight months pregnant with her youngest child, she watched An Inconvenient Truth, former Vice President Al Gore’s 2006 Oscar-winning climate change documentary at her local moviehouse.“There is something about carrying life inside your body that is transformative and gives you a different kind of perspective on the world,” she says.She founded Our Children’s Trust, a nonprofit with a mission to protect children from climate change, and now serves as executive director. The trust is assisting in the case. Olson has also filed climate change lawsuits in each of the 50 states, which are proceeding separately. She has won cases in Washington, Massachusetts, and New Mexico.Similar lawsuits, brought by other lawyers, are playing out in other nations, including Belgium and New Zealand, and have been won in Pakistan, Austria and South Africa. Last year, a Dutch court ordered the government to reduce carbon emissions by a quarter within the next five years.Olson’s clients in the federal suit range in age from nine to 20. They are media savvy environmental activists who understand the power of connecting the future effects of climate change to the people who will have to live with them.Kiran Oommen, 19, a student at Seattle University, says he joined the lawsuit because it gives voice to his generation.“We have little or no representation in the government, yet the effects of climate change will affect us more than anyone else,” he says. “This is a way we can speak for ourselves and stand up for our future.”Aji Piper, 16, is a high school student in Seattle who plants trees around the city and is an avid letter-writer to the state’s polluting industries. He adds: “Once you start involving children, people start listening more. My role in the case is to sit there in court.”The climate kids, as the group is known, also are living the full menu of drought, deluge, heat, and extreme weather events that are rapidly becoming the unnerving norm. Not only has sea-level rise killed any long-term future Levi Draheim might have envisioned on Florida’s Space Coast, but he has to cope with toxic algae blooms like the outbreak that befouled beaches last July and monster storms, such as Hurricane Matthew, which barreled up the Florida coast last October and eroded away much of the sand on his beach.Journey Zephier, 16, lives in Kauai, Hawaii, where ocean acidification is killing coral reefs and coastal fisheries. Miko Vergun, 16, who lives in the Portland, Oregon, suburb of Beaverton, fears she may never be able to visit her native Marshall Islands in the remote Pacific Ocean before they disappear beneath the swells. Tidal flooding, she says in court papers, is so frequent now that a fifth of the population has already moved away.Last August, Jayden Foytlin, 13, awoke one morning to flood waters seeping into her bedroom in Rayne, Louisiana, as a rainstorm that lasted two weeks flooded more than 60,000 homes and killed 13 people. Foytlin’s home was soon awash in sewage. The Foytlins do not live in the flood plain, yet the raging waters destroyed their home and all of their belongings.“This flood has been called a thousand-year event,” Foytlin told the court. “Yet within the last two years, I have read about eight ‘500-year’ events. In less than two years, there have been nine flood events that are not even supposed to happen in my lifetime. My family and I feel very vulnerable.”Despite winning a trial, prevailing ultimately remains an uphill climb. Columbia’s Burger says Judge Aiken’s unprecedented order that the case go to trial “is a great opinion for environmental law.”But, he warns: “As it moves up on appeal and ultimately to the Supreme Court, the chances get less and less that that opinion survives in its current form.”To date, courts have never recognized a constitutional right to even a natural environment free of pollutants, let alone to a stable climate.After Judge Aiken ruled, proponents urged Obama to settle the case before Trump took office. Obama declined. The government also declined to ask for an appellate review of her order; government lawyers instead proceeded toward trial. Seven days before Trump was sworn in as president, government lawyers added a routine brief to the court file that may complicate the Trump administration’s effort to argue the science and halt the trial.In the brief, government lawyers conceded nearly every point on which the plaintiffs’ case against the government was constructed. These admissions include the government’s role in promoting the development of fossil fuels and its belief that greenhouse gases are at “unprecedentedly high levels compared to the past 800,000 years ... and pose risks to human health and welfare.”The government went so far as to point out where the plaintiffs had understated the evidence against the government in court papers. They then corrected the figures, raising them upwards.“They recognized the importance of this case and tried to make sure when the Obama administration left, that the government’s position was clear and the court shouldn’t spend time in trial worrying about facts that should not be contested,” says Phil Gregory, the plaintiffs’ co-counsel.Now, the Trump administration appears to have reversed course. Last week, government lawyers asked Judge Aiken to grant their request that the Ninth Circuit Court of Appeals review her order. Halting the trial, the lawyers wrote, could avoid litigation that “is unprecedented in its scope, in its potential to be protracted, expensive and disruptive to the continuing operation of the United States Government.”The appellate review is unlikely to be granted, because the decision is up to Judge Aiken, the judge who ordered the trial to proceed. In common practice, appeals courts decline to consider appeals until a trial concludes.In a separate motion, government lawyers are also fighting a request by the youth’s lawyers that the Justice Department preserve all documents relevant to the lawsuit, including information on climate change, energy, and emissions.Even if a review is granted, it may be difficult for the Trump administration to reverse the government’s statements and acknowledgements about climate change that are already part of the record. Still, the new administration’s position on the subject is becoming increasingly clear. Two days after the government’s motions were filed, EPA Administrator Scott Pruitt swept aside established science on the connection between carbon dioxide emissions and global warming and declared that “carbon dioxide is not a primary contributor to the global warming that we see.”© 1996-2018 National Geographic Society."}