{"id": "Microplastics found in 90 percent of table salt", "paragraph": "Salt is produced on Madura Island, Indonesia, by evaporating seawater, an ancient technique. A new study found that salt made in this region contains some of the highest microplastics sampled.PUBLISHED October 17, 2018Microplastics were found in sea salt several years ago. But how extensively plastic bits are spread throughout the most commonly used seasoning remained unclear. Now, new research shows microplastics in 90 percent of the table salt brands sampled worldwide.Of 39 salt brands tested, 36 had microplastics in them, according to a new analysis by researchers in South Korea and Greenpeace East Asia. Using prior salt studies, this new effort is the first of its scale to look at the geographical spread of microplastics in table salt and their correlation to where plastic pollution is found in the environment.“The findings suggest that human ingestion of microplastics via marine products is strongly related to emissions in a given region,” said Seung-Kyu Kim, a marine science professor at Incheon National University in South Korea.Salt samples from 21 countries in Europe, North and South America, Africa, and Asia were analyzed. The three brands that did not contain microplastics are from Taiwan (refined sea salt), China (refined rock salt), and France (unrefined sea salt produced by solar evaporation). The study was published this month in the journal Environmental Science & Technology. The density of microplastics found in salt varied dramatically among different brands, but those from Asian brands were especially high, the study found. The highest quantities of microplastics were found in salt sold in Indonesia. Asia is a hot spot for plastic pollution, and Indonesia—with 34,000 miles (54,720 km) of coastline—ranked in an unrelated 2015 study as suffering the second-worst level of plastic pollution in the world.In another indicator of the geographic density of plastic pollution, microplastics levels were highest in sea salt, followed by lake salt and then rock salt.The new study is the fifth on salt published in recent years. Others have been done in Spain, China, the United States, and by a group from France, Britain, and Malaysia.Sherri Mason, a professor at the State University of New York in Fredonia, who partnered with researchers at the University of Minnesota on a separate salt study, said in an interview the new findings add “another piece to the puzzle” to assessing the impact of microplastics.“That fact that they found higher counts in Asia is interesting. While not surprising, you still have to have the data,” she says. “The earlier studies found traces of microplastics in salt products sold in those countries, but we haven’t known how much.”The new study, she says, “shows us that microplastics are ubiquitous. It’s not a matter of if you are buying sea salt in England, you are safe.”The new study estimates that the average adult consumes approximately 2,000 microplastics per year through salt. What that means remains a mystery.A separate study by the University of York in Britain that sought to assess the risks of microplastics to the environment, published Wednesday, concluded not enough is known to determine if microplastics cause harm.The review of 320 existing studies found “major knowledge gaps” in scientific understanding of the impact of microplastics. The studies examined different types of microplastics, including microbeads, fragments, and fibers, leading to a “mismatch” of data that makes comparisons akin to comparing “apples to pears,” Alistair Boxall, a University of York geography professor and co-author of the study, said in a statement.“Based on our analysis, there is currently limited evidence to suggest microplastics are causing significant adverse impacts,” he said. “There is an urgent need for better quality and more holistic monitoring studies alongside more environmentally realistic effects studies on the particle sizes and material types that are actually in the environment.”That new study, funded by the Personal Care Products Council, an industry trade group, was published in the journal Environmental Toxicology and Chemistry.Boxall added that the focus on microplastics may divert attention from worse environmental (and more easily identifiable) pollution problems, such as small particles released from car tires.© 1996-2018 National Geographic Society."}