{"id": "A bubbling pool of mud is on the move, and no one knows why", "paragraph": "Steam rises from geothermal mud pots near the banks of the Salton Sea in California in 2015.PUBLISHED November 9, 2018When it comes to matters of geology and rumbling earth in California, the San Andreas Fault is usually the star of the show. But this time around, the area near the infamous fault has caught people’s attention due to a mysterious pot of bubbling mud.Refusing to stay in place, a roiling mass of carbon dioxide and slurry-like soil is migrating across the state at a pace of 20 feet a year. So far, it’s carved a 24,000-square-foot basin out of the earth, and it’s set to continue its crusade until whatever’s driving it dies out. Scientists currently have no real idea why it’s moving or if it can be stopped.So, what do we know about it?Researchers may have discovered why a mud eruption on the Indonesian island of Java has continued spewing since May 2006.This curiosity appeared in the Salton Trough, an area of California that’s being stretched apart by a tectonic battle between the forces of the San Andreas Fault and the East Pacific Rise, a mid-ocean ridge. This unique environment is where the Colorado River dumps plenty of its sediment, which gets packed up so that the lower layers a few miles down get heated up and squashed a little. (Find out how a powerful earthquake snapped a tectonic plate in two.)This low-grade metamorphic action transforms the sediment into new rock types, and in the process, CO2 gets emitted. Escaping up to the soggy surface through pre-existing cracks and faults, this gas fuels features known as mud pots or—if they’re protruding from the ground—mud volcanoes.Mud pots and volcanoes are common but normally stationary objects. That’s why scientists sat up and took notice when this mud pot began to move sometime between 2015 and 2016.Currently located just north of Niland, the mud pot is moving toward Union Pacific Railroad tracks and giving engineers there a headache. A well dug to depressurize the source of the gas had no effect. Steel walls driven 80 feet into the ground were also nonchalantly circumvented; the mud pot simply ducked under them and continued its freakishly linear path of destruction.“No one has seen a moving mud pot before,” says David Lynch, a consulting physicist who has long studied the area’s geothermal features. Mud pots and mud volcanoes also generally don’t emit much water, but this one is extremely vigorous, producing somewhere around 40,000 gallons of water a day. Lynch and other experts have taken to calling it a “mud spring.”So, why is it moving? “That is the big question, and I don't know the answer,” Lynch says. It isn’t accelerating, as some news outlets have reported, and it certainly didn’t move 60 feet in a single day. Contrary to a handful of reports, there is no link between seismic changes in the area and the mud pot’s road show.“This mud spring’s movement has no relation whatsoever to any variation in seismicity,” says Ken Hudnut, a research geophysicist working with the U.S. Geological Survey. “The two are unrelated.” The San Andreas Fault is one of the most heavily monitored seismic zones on the planet, he adds, so people can rest assured that the muddy monster isn’t in any way a harbinger of a massive earthquake.In a similar vein, the traveling mud pot is not related to volcanic activity, despite the inadvertent implication when the County of Imperial recently described it as a geyser. Geothermal systems driven by magmatic heat can feature their own mud pots and mud volcanoes, as Yellowstone National Park beautifully demonstrates.But in this case, “it’s been thousands of years since any volcanic activity occurred down there,” Hudnut says. The Salton Buttes, five volcanic domes that formed within the last 12,000 years, hint at the region’s magmatic past, but they are showing no signs of eruptive activity. Also, the mud spring itself isn’t at all hot or boiling, despite its appearance; rather, it’s at an ambient temperature. (Here are the most dangerous U.S. volcanoes, according to the USGS.)The spring also smells of rotten eggs, a sure sign that hydrogen sulfide is being emitted. Although frequently linked to volcanic activity, in this case, bacteria may be to blame. The area contains a saline lake called the Salton Sea. Formed by the explosion of an irrigation canal in 1905, today it’s kept filled by agricultural runoff water, and fertilizers can cause algae populations in the lake to soar. When the algae die, bacteria feast upon them, excreting plenty of hydrogen sulfide.It’s possible that the mud spring is tapping a similarly stinky reservoir. Alternatively, the smell could have a purely geologic origin, Lynch says.Aside from the fact that it’s moving, the mud pot has only deepened the mystery of whether the area’s geothermal protuberances can actually be tied to the San Andreas Fault. Previous research by Lynch and Hudnut had suggested that they may be related, but a link has yet to be established.This mud spring is close to—but not on—the Wister Fault, a southeastern extension of the San Andreas. However, it appears to be tracing a path that’s at right angles to the region’s major faults. It may be following another fault crossing through the area, but then it’s unclear why the mud pot hasn’t turned into a fissure-like opening, so that the escaping gas could take advantage of one long crack in the ground.It looks like the muddy mystery will persist for some time. Neither the USGS nor the California Geological Survey is actively studying the phenomenon; research is costly, and they have to pick their battles. Lynch says he’s working on a model to explain it, but it’s “not ready for primetime yet.”In the meantime, the mud pot’s path threatens to undercut existing railroad tracks, so Union Pacific is using a shoofly—a track detour—as a contingency plan. At present, it seems the best anyone can do is simply step out of its way.© 1996-2018 National Geographic Society."}