{"id": "Salty waters on Mars could host Earth-like life", "paragraph": "A new look at Mars' chemistry suggests that oxygen-loving microbes and, in some cases, even simple animals like sponges could thrive in any potential brines on the red planet's surface.PUBLISHED October 22, 2018Mars is an unlikely place for life as we know it to thrive. The surface is bombarded by DNA-damaging radiation. Water has only been confirmed on the frigid landscape in the form of ice and hydrated minerals. And there's barely even a wisp of oxygen in its paltry atmosphere.But the case for life on the red planet just got a little stronger with a new study that suggests salty waters thought to potentially exist near the surface could hold enough dissolved oxygen to support familiar forms of microbial life. In some special cases, there would even be enough of the element to harbor basic oxygen-loving animals like sponges.This certainly doesn't mean there is life on Mars—scientists aren't even sure if liquid water flows on or near its surface. However, the surprising research, published today in Nature Geoscience, hints that perhaps the modern Mars environment is not quite as inhospitable as we once thought.“That's the thing of habitability; we never thought that environment could have that much oxygen,” says the study's lead author Vlada Stamenković, a planetary scientist and physicist at NASA's Jet Propulsion Laboratory. “It completely changes our understanding of the potential for life on current-day Mars.”The thin atmosphere that blankets the red Martian landscape is mostly made of carbon dioxide, with traces of nitrogen and argon gas. Measurements from rovers and orbiting spacecraft suggest that a mere 0.145 percent of the air is oxygen, which thought to be released as sunlight breaks apart some of the carbon dioxide molecules.Although this is a pitifully low amount of oxygen compared to the nearly 21 percent in modern Earth's atmosphere, there are hints something strange has been going on with the life-giving gas on the red planet.In 2014, researchers were excited to discover manganese oxide on Mars' surface. Manganese is tough to oxidize, and unlike the oxidized iron that gives the rusty red planet its signature look, forming manganese oxide requires the presence of either oxygen or microbes, explains Kirsten Siebach, a planetary geologist at Rice University who was not involved in the work.Researchers have previously suggested that this compound points to an ancient Martian atmosphere flush with oxygen. But Stamenković and his colleagues thought there just might be another way.With an average surface temperature of -81 degrees Fahrenheit, Mars doesn't readily sport vast flows of liquid water. To date, there are no confirmed discoveries of Martian puddles—only hints of water deep underground. But scientists believe that water might exist near the surface as a brine, which is essentially very salty water.When you add salts to water, it slightly lowers the point at which the water freezes. So the addition of salts to Martian ice—including the magnesium and calcium perchlorate salts widespread in Martian dust—will let that frozen water turn fluid.But then salts pose another problem: The more salt that's present, the less oxygen the water can hold. At the same time, the colder the water, the more oxygen it can dissolve. It's a game of oxygen tug-of-war, with salts pushing out the dissolved gas and the cold temperatures pulling it in. To figure out which effect might win, the researchers turned to mathematical modeling.They crafted a model that tests out this idea for six salts at concentrations high enough to keep the water liquid at temperatures from -208 degrees Fahrenheit to 80 degrees Fahrenheit. The model also included the average Martian air pressure at various locations across the red planet. (Explore what Mars was like across billions of years with our interactive planet.)According to their results, hypothetical brines that are colder than the freezing point of pure water offer much more oxygen than what's needed for aerobic microbes to thrive. What's more, their best estimates with perchlorate salts suggest that the water would have enough oxygen to support more complex life like sponges. (Similarly, the under-ice waters of Jupiter's moon Europa may hold enough oxygen to support fish-size life.)The team also calculated a “worst case” scenario, providing a little wiggle room for error in their model's calculated factors. Even then, the salty solutions all harbored enough oxygen to support basic microbial life.“We were absolutely flabbergasted,” Stamenković says of the team's initial reaction. “I went back to recalculate everything like five different times to make sure it's a real thing.”The concentrations now possible on Mars are even higher than what was likely present in Earth’s waters prior to 2.35 billion years ago, when microbes breathed oxygen into the atmosphere and Earthlings proliferated. And these concentrations of oxygen on Mars could have persisted for millions of years.Such briny solutions would be \"really good soup for organisms to grow in,” says the University of Washington's Jodi Young, a biological oceanographer who was not involved in the study. On Earth, she explains, chilly oxygenated brines exist in the network of fissures in sea ice, where a diversity of life can be found.And the dissolved oxygen in the water could have caused Mars’ manganese oxides to form even without an oxygen-flush atmosphere. “Our explanation doesn't need any special magic—it works on Mars today,” says Stamenković.Siebach praises the idea behind the research as clever, but she also cautions that similar concentrations of oxygen would need to have been present in the Martian atmosphere billions of years ago to create some of the ancient oxides seen today.“It's tricky to say how far back in time this would go,” she notes.Of course, before getting too excited about modern Mars microbes, scientists first need to confirm whether pockets of liquid water actually exist on the planet today.“We go back and forth a lot as a scientific community on that,” Siebach says with a laugh. Any such puddles would be small and possibly only present during parts of the day or during certain seasons, she says.If scientists do identify potentially habitable environments, they also can't rush straight to them, she notes. The most oxygen-flush liquids would be present in the coldest water at the poles, where it's a challenge for even rovers to stay warm enough to function. And researchers will have to be methodical in preventing contamination of Mars with earthly microbes.“If we think that Earth life can survive in that brine, that's exactly when we have to be most careful about approaching it,” Siebach says. Still, the new work offers the tantalizing possibility that we may discover something alive on Mars in the near future.“On the Earth, oxygen was a big driver for evolution,” Stamenković says, so perhaps its presence on Mars could have given life a boost in an otherwise inhospitable place.“We have no clue,\" he says, \"but it gives me hope to go and explore.”© 1996-2018 National Geographic Society."}