{"id": "Epic flood sends cavers scrambling for their lives", "paragraph": "Half an hour after receiving a warning call from two teammates at a high camp, eight cavers stationed at the bottom of the world’s deepest cave heard the roar of floodwaters.The rumble grew, like a freight train hurtling through a tunnel. The entire cave began to shake as if by earthquake.“It got louder and louder,” says Robbie Shone, a National Geographic cave photographer. “I will never forget that sound.”Shone had just started breakfast, a pasta-and-meat dish prepared in advance with vacuum-sealed ingredients by Pavel Demidov, the expedition leader, world-class Russian caver, and culinary enthusiast.Hearing the thunder of the flood pulse coming, Shone and the other cavers rushed out of their group tent. Like his teammates, Shone was dressed in fleece under-gear, his breakfast bowl still in his hands. As he turned his headlamp toward the noise, the food nearly fell out of his mouth.“The most enormous torrent of white water appeared out of this hole, and I just stood opened-mouthed at the sight of this huge white wall of water entering our little home,” he says.Photographer Robbie Shone joined a team of Russian cave explorers and scientists on an expedition through Veryovkina, the world's deepest cave.\nVideo by Petr LyubimovIn September, Shone and his photo assistant Jeff Wade, both Brits who live abroad—Austria and France, respectively—joined a Russian expedition to explore and photograph Veryovkina, the deepest-known cave on Earth.Veryovkina is located in the Arabika Massif in Abkhazia, a Russian-supported separatist territory once governed by Georgia.The Russians were all members of the Perovo-Speleo caving team, an official group of world-class cavers from Moscow that has been pushing exploration in Veryovkina and other astonishingly deep caves in this mountainous region—notably home to the four deepest caves in the world.In addition to Pavel Demidov, the team included Petr Lyubimov, Konstantin Zverev, Andrey Shuvalov, Evgeniy Rybka, and Andrey Zyznikov. (Andrey Sizikov, Roman Zverev, and Natalia Sizikova were also part of the expedition, but they had gone up before the flood.)Veryovkina had only recently been named the world’s deepest cave. During an expedition in March 2018, Demidov and his comrades had reached a terminal sump at the water table—a depth of 7,257 feet (2,212 meters). The low point was a new record, knocking the neighboring Krubera cave, at 7,208 feet (2,197 meters), into second place.Veryovkina CaveAbkhazia, GeorgiaRUSSIAVeryovkinaOCaveABKHAZIAGEORGIABlackSeaARMENIATURKEYReaching the bottomUsing a series of camps, it took expedition members more than four days to reach the terminal sump. CaveFeet below entrancethe surface0Camp-1,969 ft-2000Camp-3,281 ftCamp-4,000-4,429 ftCamp-6,234 ft-6,000Camp-6,890 ftTerminal sumpCave passage-7,257 ftFlooded cave passageRising waterAfter quickly evacuating the deepest camp, expedition members waited for 16 hours at the next camp, between an impassable waterfall and the potential for rising floodwaters. DAVID L. LAMBERT, NG STAFFSOURCE: PAVEL DEMIDOV, THE PEROVO-SPELEO TEAMVeryovkina CaveRUSSIAAbkhazia, GeorgiaVeryovkinaOCaveABKHAZIAGEORGIACampBlackImpassable waterfallCave-6,234 ftSeaentrance0Expedition members waited for 16 hours at the higher camp, between TURKEYARMENIAan impassable waterfall and the Rising waterpotential for rising floodwaters. Floodwaters quickly rose 100 feet higher than the camp where expedition members were just Campminutes before escape.-6,890 ftdepthCave passageTerminal sumpFlooded cave passage-7,257 ftArea enlargedat rightFirst-ever photoThe photo of the terminal sump, -7,257 ftthe deepest point in the deepest cave on earth, was taken only a few DAVID L. LAMBERT, NG STAFFdays prior to flooding. SOURCE: PAVEL DEMIDOV, PEROVO-SPELEOAfter achieving this record, the Perovo-Speleo team returned in September to explore a number of promising horizontal leads at the bottom of Veryovkina; collect samples of rare, possibly new species of shrimp and scorpion; and leverage Shone’s photographic skills to create a series of still images documenting the entire cave, including its extraordinary terminus.“A beautiful turquoise lake, about 15 meters long and 8 meters wide, surrounded by jet-black limestone,” Shone says, describing Veryovkina’s terminal siphon. “It's such a beautiful—but at the same time, eerie—location.”Reaching Veryovkina’s low point took four days. The cavers had descended thousands of feet of ropes, crawled through water- and mud-choked siphons, and squeezed themselves and heavy packs of gear through the most tortuous, improbable cracks.The 2,200-meter camp—the cave’s lowest camp—is a flat, sandy spot in a horizontal tunnel. The team had already spend three days bivied here, launching explorations into new corridors, collecting invertebrate specimens, and creating photographs.“The real reason of this expedition was to continue the exploration of the world’s deepest cave,” says Shone. “The flood was just something that happened at the end.”Roman Zverev leads Natalia Sizikova along a traverse above a small pool of water inside Veryovkina. The only usable handholds on the route are small ledges in the limestone and, during the flood, water completely filled the tunnel.Roman Zverev and Natalia Sizikova had left early to catch a flight home. On the way out, they had reached a camp halfway up the cave, at 1,300 meters below the surface, when they saw the flood pulse. They tapped into the cable wire the Russians had installed for these very purposes and sent a warning to their friends below.When the flood pulse struck, the cavers had been underground for seven days total—a long time to be in such an extreme environment.Cavers deal with flood pulses all the time. Heavy rains can cause water to collect, then, because of the volume, suddenly burst through cave openings. The ensuing flood pulse can last a few minutes, even a few hours, but it eventually subsides.Shone wasn’t initially very concerned about the flood pulse, despite its scary thunder. Their camp was safely adjacent to the main vertical shaft that was currently spewing an unfathomable volume of water. Their camp was well protected and staying dry. They figured they were in the safest spot possible.Then Petr Lyubimov happened to notice a gurgling sound coming out of a small hole in the ground adjacent to their tent. He couldn’t see any water, but given that the flood pulse had already been raging for over two hours with no signs of abating, it presented enough of a concern that he told team leader Pavel Demidov about the noise.Demidov agreed with Lyubimov's concern and enlisted the assistance of several others to join him in checking on a nearby siphon. They hoped to gauge how high the water table had actually risen.No more than five minutes after Demidov had left, Lyubimov went back to look down into the small hole near the tent. This time, he saw water rising up so fast it was jostling off the walls.“When Petr turned and looked at me, his face was white,” says Shone. “And I just thought, ‘Oh my goodness. We have to leave right now. We cannot wait. If we just hang around, we’re all going to die.’”The freight-train of floodwaters continued to tear through the dark chasm. The roar was almost deafening.No one had expected to be moving from camp that day, but now everyone was scrambling. As Shone says, “All hell broke loose.”Shone rushed to don his latex suit, which goes over the fleece baselayer. The latex suit must be twisted shut at the neck, wrist, and ankle cuffs in order to remain waterproof. Wade helped Shone seal his latex suit, then Shone helped Wade with his.Finally, after what felt like forever to Shone, both photographers slipped into their abrasion-resistant nylon shells then donned their harnesses, helmets, and rope-ascending gear.Shone made a calculated decision to leave all of his camera and personal gear behind—tens of thousands of dollars of equipment. There was over a mile of vertical ropes to climb above him. Taking a heavy pack might slow him down. It might cost lives.He did, however, take his camera’s flash cards, as they contained the only photographs ever captured of Veryovkina’s terminus. He placed them in a Ziplock bag that he slipped inside his latex suit.Wade was suddenly nowhere to be seen and Shone shouted for his colleague. “Jeff, come on! Jeff, we have to leave now!”“I’m coming, I’m coming!” Wade called back through the dark. Wade turned and yelled to Petr Lyubimov, “We’re going! We’re getting out of here now!”“Go! I’ll wait for Pavel!” Lyubimov responded.That was the last interaction Shone and Wade had with the Russians at the low camp. Shone and Wade were off.Jeff Wade follows Zverev and Sizikova down a ramp and into a grotto near the entrance to the lowest levels of the cave system. This portion of the cave lies below the water table and it was completely engulfed during the flood.Shone headed toward the ropes that led up and out. He reached a precarious traverse, which had formerly been above an airy shaft, eight meters wide and 20 meters deep.That shaft was now completely filled with water.At the end of the traverse, Shone reached the vertical ropes. He looked up and saw the raging waterfall of the flood pouring over them. He clipped his ascenders into the rope, took a deep breath, put his head down, and started climbing.The tremendous weight of the water pummeled Shone. It barreled down with a crushing, suffocating force. “It felt like my head was being squashed into my shoulders,” he says. He tucked his chin and breathed from a pocket of air formed by the space created beneath his helmet brim.He moved as fast as he could. He’d learned the rote technique of pushing a mechanical ascender up a rope, transitioning past belays and knots, years ago when he worked as a high-rise window washer—a gig that paid the bills while photography was still just a hobby. Washing windows had honed skills that might now be saving his life.“All I could see was the white rope in front of me,” says Shone. “And I just kept moving the ascender up a little bit at a time. I was saying to myself, ‘Just keep going. Just keep doing this.’”Shone reached a point where he could step to the side of the torrent. He looked up to see where the rope was running. It led into a body-sized chimney of rock, through which the flood furiously pumped.“I just thought, ‘You’re joking. I physically can't get through that,’” says Shone. “Where am I going to go? There’s no air space, there’s nothing.“But I also knew I hadn't gone far enough yet. I hadn’t climbed high enough to be safe. And I was the lead guy. I couldn’t just stop here because Jeff and everyone else was coming up behind me. I needed to keep going.”The team of Russian explorers stop for a discussion past a large chamber. The sand on the floor is rippled from past flowing water.Shone climbed into the chimney, forcing his way up through the narrow shaft. The driving water was punishing. Shone could only push his ascender up a few inches at a time. He took sips of air as he struggled to crawl up through the barrage.“As I finally got past that section, I remember thinking, ‘Oh my god, I really hope Jeff can do that,’” says Shone. “‘Because he's got to do that.’”Shone was nearly panicking. All he could think to do was to keep climbing, as fast and as high as possible. Having passed through the narrow space, he found himself ascending in a relatively dry section, where the flood had taken a different path. He heard Wade yelling at him below.“Robbie, Robbie! Slow down! We’re safe now, just slow down!” Wade yelled angrily.Shone reached an anchor and stopped to wait for Wade.“Jeff’s face was white and he had massive eyes,” says Shone. “And he just said, ‘Bloody hell, we’re alive.’”That’s when they realized they had no idea if the same could be said for the Russians.Shone and Wade climbed to a camp at 1,900 meters where there was a tent stocked with some food and medical supplies. The rumble of the flood continued to shake the floor beneath them.They looked down into the abyss and saw a single headlamp appear, coming up the ropes. It was Andrey Zyznikov and soon he joined Shone and Wade at the camp.“Have you seen the others?” Wade asked.Zyznikov shook his head. “No.” The three sat in silence, worried that the worst had happened.Fifteen minutes later, more headlamps appeared. One by one, each of the five remaining Russians came up the rope.“I could not believe it,” Shone says. “These guys are so strong and so capable. Kostia had even carried up a pack with sleeping bags, a stove, and a brew kit. Whereas I had almost selfishly only thought about my photos, Kostia had brought four sleeping bags.”The Russians had escaped in the nick of time. By the time Pavel Demidov had returned from scoping the siphon, the traverse that was just above water when Shone escaped was completely submerged. The Russians had to swim to access the vertical ropes going through the waterfall. Demidov got caught in an eddy that sent him spinning, as if he were being flushed down a giant toilet bowl. He fought the current and swam hard to reach the line.“In hindsight, I'm so glad it was almost like the weakest one went first and Pavel, the strongest one, came last,” says Shone. “This was at my limit of what I could possibly deal with.”Zverev and Sizikova climb around a deep pool of water in one of the cave's side passages.The team, now reunited, spent the next 16 hours at the camp. It didn’t take long for the Russians to enter the tent, fire up some coffee, and start laughing.Shone, however, was still freaked. He kept all his caving gear on, couldn’t sleep, and kept peering over into the abyss to see if the water was rising. The entire time, the flood continued to rumble.Shone was concerned about a pseudo-siphon 70 meters above them. The long horizontal tunnel was normally half-filled with water, and, under typical circumstances, the only way to get through it is to crawl. With this flood, that pseudo-siphon would’ve been completely choked with water. As long as the flood continued, they were trapped.“If the water had risen high enough to reach us, it would’ve been game over,” says Shone. After a few hours of pacing, however, Shone relaxed somewhat. He joined his comrades in the tent, stripped down to his fleece, and warmed himself up.“Pavel said, ‘Let’s just give it till morning,” says Shone. “And he was right. At some point it started to die down, which was just music to my ears. Hearing the water get less powerful and not as loud was the most amazing sound.”Two cavers make their way through the shaft where, approximately a week later, water suddenly plummeted into the chambers below.The flood pulse had ultimately lasted nearly 20 straight hours. It was the result of a week of rain, including a single storm cell that had unleashed rain drops the size of fingernails for an entire day, as a local taxi driver later described to the team. The ground was completely saturated, and somewhere in the Earth, something had cracked that had unleashed that ungodly volume of water.The Russians had been operating under the presumption that Veryovkina only flooded in the winter, which they've now learned is not true. The experience, harrowing as it may have been, was ultimately educational for the cavers. There are plans underway to improve surface monitoring, including using special radios to improve communications. They’re also installing a new camp in the lowest chamber that would provide another escape spot in the event of another flood.Despite the flood pulse cutting the trip short by a day, the expedition was successful. New passages were mapped and explored, several cave invertebrates were taken for analysis, and a number of climbs were completed to check potential high-level passages.In fact, this team of cavers has only scratched the surface of what secrets the world’s deepest cave might hold.“This is the pinnacle of human endeavor in the caving world,” says Shone.Shone had originally planned to photograph much of the cave on his way back up and out. Between his narrow escape and the loss of his equipment, that didn’t happen. Demidov, however, did go back down after the flood subsided and retrieved Shone’s camera—which was completely ruined. Demidov had used Shone’s extended tripod to fish clothing and other belongings out of the water. The flood smashed one of Shone’s light cases high into the cave’s roof—creating a signal, perhaps, to future explorers about how high a flood can get.While Shone recognizes the luck in their survival, the experience was also an affirmation for him about the importance of skill and strength in each member of a caving team.“With caving, you need to save energy to be able to get yourself out two kilometers of ropes,” Shone says. “This team had the strength, the reserves, mentally and physically, to deal with the worst situation. That’s not only why they're exploring the deepest cave in the world so successfully, but why we all survived.“For me, these people are in a league of being the world’s greatest explorers.”Shone is planning to return to Veryovkina with the Russians next June. There are photos he still needs to get.PUBLISHED October 18, 2018© 1996-2018 National Geographic Society."}