{"id": "Meet 5 \"zombie\" parasites that mind-control their hosts", "paragraph": "Photograph by Anand Varma, National GeographicUnder manipulation by a parasitic wasp larva, a Leucauge argyra spider builds a special \"cocoon web\" that will house the larval wasp until it grows up.Photograph by Anand Varma, National Geographicfor National GeographicPUBLISHED October 22, 2018Zombies may still be a thing of fiction, but some parasites more or less turn their hosts into the walking dead.These masters of mind control manipulate their hosts from within, causing them to act in self-destructive ways that ultimately benefit the parasite. (Read \"Mindsuckers\" in National Geographic magazine.)\"Some parasites can alter the behavior of their host in ways that give the parasite a better home, or provide more nutrients, or cause the host to move to a different environment,\" said Janice Moore, a biologist at Colorado State University in Fort Collins.This strategy seems to work, she added: \"A parasite that can alter the behavior of its host, and in doing so improve its own transmission, is going to be favored by natural selection,\" she said. (See \"World War Z: Could a Zombie Virus Happen?\")In honor of Halloween, here's a selection of a few zombie parasites.Read on—if you dare.Females of the Costa Rican wasp Hymenoepimecis argyraphaga lay their eggs on the abdomens of unlucky orb spiders called Plesiometa argyra.After living off its host for a few weeks, the wasp larva injects a chemical into the spider that makes it build a strange, new kind of web, unlike anything it's built before. (See photos of the world's biggest, strongest webs.)But this new web isn't for the spider: It's meant to support the cocoon that the wasp larva will build after finally killing and eating the spider.When the female jewel wasp is ready to procreate, she finds a cockroach to serve as a living nursery for her young. (See a video of the graphic novella \"Sting of Doom\" from November 2014 National Geographic magazine.)The jewel wasp (Ampulex compressa) hunts cockroaches and takes over their decision-making processes.Photograph by Anand Varma; Frederic Libersat Lab, Ben Gurion UniversityFirst she injects a toxin into the roach that paralyzes its front legs. Then the wasp strikes again in the roach's head. Frederic Libersat of Ben-Gurion University in Israel and colleagues discovered that the venom targets a specific area of the brain responsible for initiating movement.Stripped of its ability to move of its own free will, the cockroach can be grabbed by the antenna and guided to a burrow, where the wasp will lay her egg on the victim and entomb them together.The wasp larva slowly consumes the cockroach for several days before pupating in its abdomen, emerging as an adult about a month later.As an adult, the lancet liver fluke—a type of flatworm—resides in the livers of grazing mammals such as cows.Its eggs are excreted in the host's feces, which are then eaten by snails. After the eggs hatch inside the snail, the snail creates protective cysts around the parasites and coughs them up in balls of mucus.These fluke-laden slime balls are then consumed by ants. When the flukes wiggle their way into an ant's brain, they cause the insect to climb to the tip of a blade of grass and sit motionless, where it's most likely to be eaten by a grazing mammal. That way, the liver fluke can complete its life cycle. (Read about fungi that zombify ants.)The fluke Euhaplorchis californiensis begins its life in an ocean-dwelling horn snail, where it produces larvae that then seek their next host, a killifish. (See \"The Puppet Master's Medicine Chest.\")Once it finds a fish, the parasite latches on to its gills and makes its way to the brain. But this isn't its final stop.The fluke needs to get inside the gut of a water bird in order to reproduce. So inside the killifish's brain, the fluke releases chemicals that cause the fish to shimmy, jerk, and jump.Jenny Shaw, then at the University of California, Santa Barbara, and colleagues found that the parasite decreases serotonin and increases dopamine levels in the fish's brain. The switch in this brain chemistry stimulates the fish to swim and behave more aggressively.A horsehair worm (Paragordius varius) infects a house cricket and then causes it to commit suicide by jumping into a body of water. The worm emerges to make its home in the water.Photograph by Anand Varma; Ben Hanelt, University of MexicoThese moves attract the attention of birds, which may eat the fish—and the flukes. The flukes mate, and their eggs are released back into the water in the bird's droppings to be eaten by horn snails and start the cycle anew.Hairworms have a perpetual challenge: They infect landlubbing insects like crickets, but the parasites must make their way to an aquatic habitat in order to reproduce.Researchers at France's Centre National de la Recherche Scientifique figured out how they accomplish this feat. Hairworms produce mind-controlling chemicals that cause their cricket host to move toward light. Because water bodies reflect moonlight, this often sends crickets toward lakes and streams.The crickets jump in and drown, and the hairworms emerge, ready to find their next victim.Follow Mary Bates on Twitter and Facebook.© 1996-2018 National Geographic Society."}