{"id": "How World War I launched mapmaking at National Geographic", "paragraph": "National Geographic’s first general reference world map, published in December 1922, shows the world's political boundaries established following World War I. This Veterans Day marks the 100th anniversary of the end of World War I and the birth of mapmaking at National Geographic.PUBLISHED November 9, 2018In the summer of 1914, Americans began reading news accounts of a conflict that would soon be called the Great War—and that would draw the United States in three years later. (See also: The United States Enters World War I).But it was National Geographic's maps that quickly helped Americans grasp the sweep of a conflict so vast that it would later become known as the First World War.\"People who followed the war at all followed it by reading newspapers...and maps were a very important way to make sense of these faraway places [and] strange names,\" says Robert Poole, a former executive editor at National Geographic magazine and author of a book on the history of the magazine.National Geographic revamped its August 1914 issue to include a map of \"New Balkan States and Central Europe,\" which featured the names of the places where fighting was most severe. The maps were popular, boosting the organization's visibility. By year's end, membership in the Society had grown 50 percent, to more than 336,000.In August 1914, National Geographic magazine published a map of Europe and the Balkan States, subsequently to be the scene of one of the bloodiest conflicts in history—World War I. Editor in Chief Gilbert H. Grosvenor sensed the looming conflict and had the maps printed, stored in the basement, and ready to go. The Balkans map was ready to go because the magazine's editor, Gilbert H. Grosvenor, had anticipated heightened conflict after visiting Great Britain, France, and Russia in the summer of 1913, during the Second Balkan War, and had commissioned a map of the area.By early 1914 the finished copies were delivered to the Society's Washington, D.C. headquarters. Waiting for the moment when tensions were sufficiently high to pique reader interest, Grosvenor stored the maps in the Society's basement until war broke out that summer.\"A map is the greatest of all epic poems,\" said National Geographic magazine editor Gilbert H. Grosvenor, shown here in his office in 1914. \"Its lines and colors show the realization of great dreams.\"PHOTOGRAPH BY LEET BROTHERS\"He had a sixth sense for what readers were interested in,\" Poole says. \"He could tell that something important was happening in Europe, that Europe was changing very quickly, that people needed this sort of information that they weren't getting anywhere else.\"\"There was this niche that National Geographic could fit that no one else was fitting,\" Poole says. \"He began to get favorable responses not only from the public, but [also] from the White House, the Navy.\" (See also: President Wilson's World War I Message in National Geographic.)Although National Geographic is well known today for its maps and atlases, the magazine did not actually create its own maps during the first 27 years of its existence. (See also: 100 Years of National Geographic Pull-Out Maps.)\"Before 1915, the magazine had always gotten whatever map supplements that it published from government agencies, especially the USGS [U.S. Geological Survey],\" says Mark Jenkins, a former National Geographic archivist. \"Whenever they had money to produce a map, [Grosvenor] had to get his maps done through an outside firm.\"Grosvenor commissioned outside companies to produce both the Balkans map and a 1915 follow-up map of the expanding war front. However, Grosvenor's disappointment with the initial drafts of the war-front map, combined with the magazine's increasing revenue, led him to establish the map department in 1915—the first in-house cartographic division at National Geographic.France's 92nd Infantry Regiment fights in the trenches in 1916. National Geographic's maps of the war front helped people make sense of faraway battles they read about in news reports.PHOTOGRAPH BY ADOC-PHOTOS/CORBIS \"He thought [the outside companies] weren't producing what he wanted, and they weren't doing it fast enough,\" Poole says. \"He wanted to have quality control, and he wanted to get maps when he needed them.\"\"WWI was an impetus for the creation of a cartographic division here at National Geographic,\" says Juan Valdes, the Society's geographer and director of editorial and research. \"We started using different map projections to portray the world in various ways. We introduced page maps to the magazine to accompany the articles, so that people would know the exact places that were being addressed in the text. It was the building block for our 10th edition atlas [and] our world atlas app.\"In the beginning, the maps department was, as Jenkins says, \"pretty much a one-man show.\" Albert Bumstead, the map department's first chief cartographer, was also its only cartographer.The department's first map supplement was the 1918 \"Map of the Western Theatre of War,\" which provided readers with the name and location of every town or hamlet that they would likely encounter in reports from the front—a valuable resource to readers unfamiliar with the vast territory covered by the war. (See also: World War I Soldiers Create Art in the Trenches.)The map's place names were so comprehensive that the secretary of the Geographic Society of France called it the most complete map of the Western Front.According to Valdes, the Western Theatre map \"started the tradition of that detailed mapping that we became known for.\"\"That map set the tone for our cartographic standards,\" Valdes says. \"What National Geographic could offer would be these detailed supplement maps that weren't that readily available to the public. What [the public] would normally see would be these small newspaper maps that wouldn't have a lot of detail.\"Those war years marked a turning point for the Society—and for the cartography field. \"The mapmaking became much more professional during and as a result of WWI,\" Poole says. \"People began to associate Nat Geo with cartographic authenticity. They knew that they could go to National Geographic for reliable info.\"Published in the February 1921 issue, this map of Europe depicts countries as established by the Paris Peace Conference (1919-1920). Boundaries of countries as they existed before the war are shown in yellow, new political boundaries are shown in red, and undecided political boundaries are shown with dashed red lines. The development of mapmaking expertise during WWI laid the foundation for the role that National Geographic would play in WWII, when, as the New York Times wrote in 1945, the Society's maps were \"to be found at the front, in the air, in our embassies and consulates.\" Two weeks after the bombing of Pearl Harbor, Franklin Delano Roosevelt's office requested a National Geographic map showing where the Japanese had attacked in Southeast Asia.Grosvenor sent U.S. President Franklin Delano Roosevelt a map cabinet after the U.S. entered World War II. One of the cabinet's maps is pulled down behind Soviet Commissar Vyacheslav Molotov in this 1942 picture.PHOTOGRAPH BY U.S. NAVY\"National Geographic supplied the White House with National Geographic maps for the White House map room,\" Poole says. \"[FDR] would go over the maps with his chief advisers, keep track of the action, what was happening in the war, by following those maps.\"As the United States, the Soviet Union, and Britain were deciding to carve up Europe, they used a National Geographic map showing which parts of Germany would be the American sector, which would be the British sector, which would be the Soviet sector. They were actually using a National Geographic map to decide what post-war Europe would look like.\"© 1996-2018 National Geographic Society."}