{"id": "Angkor Wat’s Collapse From Climate Change Has Lessons for TodayAngkor Wat’s Collapse From Climate Change Has Lessons for Today", "paragraph": "PUBLISHED April 5, 2017Next to the road leading into Angkor Thom—one of the walled cities that make up Angkor, the ancient Khmer empire in Cambodia—stands a solitary but crumbling bridge with corbeled arches made out of recycled sandstone blocks. The bridge seems to be of little significance; no water runs beneath it. Few, if any, of the tour buses shuttling visitors to the temple grounds every day stop for tourists to have a look.But to Dan Penny, an expert in environmental history who has studied the Angkor civilization for many years, the bridge tells an intriguing story. Its damage in the recent past, he says, is a reminder that while it was water—or the control of it—that built the city of Angkor, it was also water that helped destroy it.The cause of the Angkor empire’s demise in the early 15th century long remained a mystery. But researchers have now shown that intense monsoon rains that followed a prolonged drought in the region caused widespread damage to the city’s infrastructure, leading to its collapse.“The destruction of this bridge is suggestive of a huge flow of water, far more than the canal could cope with, coming down through the middle of the city,” said Penny, who is a researcher in the geosciences department at the University of Sydney.“It did a huge amount of damage to infrastructure that people who were living here at the time simply couldn’t repair.”The Angkor Wat temples in Siem Reap, Cambodia, were unknown to the West until the 19th century.The Angkor period is said to have begun in the year 802 when, from a location in the Kulen Mountains overlooking the future city plain, Jayavarman II proclaimed himself chakravartin, or “god king,” of the Khmer empire. Over the next few centuries, a vast urban complex with nearly one million inhabitants emerged as Angkor grew into the biggest city of the pre-industrial world.From the beginning, water was central to the development of Angkor, which is often described as a “hydraulic city.” Channels and reservoirs were constructed to collect and store water coming from the hills, both for flood control and for distribution for agriculture. A system of overflows and bypasses carried surplus water to the Tonle Sap Lake to the south of the city.“It was a water management infrastructure that had no equal on Earth,” said Penny.Water, and the control of it, also played a religious role in Angkor society.“Water was not only a resource that had to be managed in terms of agriculture and flooding,” said Penny. “It was also tied up with the power of the king.”The canal network had a history of additions and modifications. Earlier channels both distributed and disposed of water. From the 12th century onwards—around the time the most famous temple, Angkor Wat, was built and the empire reached its apogee—the large new channels primarily disposed of water to the lake.Over the next couple of centuries, the system seems to have functioned pretty well as the city continued to flourish. But then, in the mid to late 1300s, Angkor began suffering from a persistent drought. This was followed by several years of unusually strong monsoon rains, producing extensive flooding with which the city’s infrastructure seemed to have been unable to cope.The flooding caused serious erosion in the system, with links in it being systematically severed. To the south of the city, canals were choked with material eroded from the center of Angkor.The bridge at Angkor Thom was built from reused stone blocks from temples, with many of them carved in intricate ways.“That they would take apart a temple and use it for something as mundane as a bridge suggests there is something seriously going wrong,” said Penny.“It has long been thought that the damage to the water management system put an end to a long period of decline at Angkor.”Judging by the damage done to the bridge, which had its eastern end destroyed, the efforts to control the floodwaters were ultimately unsuccessful. In the end, the Siem Reap River, which was supposed to run under it, carved a way around the bridge. Today, the river runs about 25 feet below its original course.As the flooding destroyed the infrastructure, the city of Angkor collapsed. In 1431, it was taken by the Siamese army. Many of the temples were later overgrown by jungle, while others remained important religious sites for the Khmer. The ruins were unknown to the West until French explorers were taken there in the 1860s. (Watch video of the site.)Researchers working on the sustainable development of the Lower Mekong River Basin as part of a USAID-funded project called “The Wonders of the Mekong” say there are important lessons to learn from what happened to Angkor.\"One thing is clear: culture and climate are connected,” said Sudeep Chandra, director of the University of Nevada Global Water Center, which is leading the research.“We see communities around the world struggle with understanding how to respond to the increased variability from a changing climate,” he added.In the efforts to control water flow, the Angkorian engineers diverted water from existing river systems, which resulted in the creation of new catchments. But this may have had adverse environmental consequences, destabilizing the city and eventually leading to its demise.“The medieval Khmer were confronted with a period of climatic instability that they had no experience of, and which fully changed the rules of the game that they had been playing for hundreds of years,” said Penny.“A similar scale of challenge is now confronting contemporary communities, as the climate begins to change.”© 1996-2018 National Geographic Society."}