{"id": "New crocodile species found hiding in plain sight", "paragraph": "PUBLISHED October 24, 2018It’s not every day that you find a new crocodile species. For the first time in more than 80 years, researchers have fully described and named a new species—the Central African slender-snouted crocodile—which is found in a broad swathe of the continent from Cameroon to Tanzania.This species has been dubbed Mecistops leptorhynchus, and characterized in a study published on October 24 in the journal Zootaxa.The animal was, until now, considered to be the same species as its West African counterpart, Mecistops cataphractus, which will retain its original scientific name. The new designation brings the total population of the West African species down enough that it is now considered critically endangered. There are only about 500 individuals left in the wild, estimates Matt Shirley, study lead author and a researcher at Florida International University. Specimens ExaminedSpecies BoundariesCataphractusCataphractusLeptorhynchusLeptorhynchusCentral African slender-snouted crocs have softer, smoother appearance than their West African cousins, which have larger, heavier scales and rougher skin, Shirley explains. The newly-described croc also lacks the bony crests on its skull found on its counterpart.But the main differences lie in the genes—and these differences are significant. The paper shows the animals’ genetics first diverged more than eight million years ago, as volcanos arose in and around what is now Cameroon. This volcanic activity created impassable mountains that split the range of the reptiles in two, cutting off gene flow, and the two populations haven’t exchanged genes since, says Shirley, a National Geographic Explorer.This isolation allowed the two species to diverge, and now the base pairs that make up certain important genes differ by more than five percent, he explains.Scientist have, of course, described other new species of crocodiles in recent years. For example, research by George Amato, at the American Museum of Natural History has shown that dwarf crocodiles are not one but three species. Shirley, Amato, and colleagues also discovered that there are actually two different species of Nile crocodiles.But M. leptorhynchus is the first species since 1935 to go through the full formal descriptive and naming process, Shirley says. This involved sifting through scores of museum samples from around the world with assistance from colleagues at the University of Iowa and the University of Florida. Shirley himself also did intensive field work in 14 African countries, and got malaria more than a dozen times in the course of the research, he says.Their job was complicated by the fact that the “type” specimen, the original museum animal used to officially identify any given species, was nowhere to be found for M. cataphractus. That’s the Nazis’ fault: It was likely destroyed when German planes bombed London’s Natural History Museum in World War II, Shirley says. So the researchers had to designate a new one. What’s more, the type specimen for M. leptorhynchus is a juvenile, which muddled the effort, since young crocs are more difficult to identify.  The study is “a continuing, repeated story about under-described diversity of African crocodiles,” says Amato, the director of conservation genomics at the Sackler Institute for Comparative Genomics, who wasn’t involved in this paper.The study should help spur conservation work for both types of crocodiles, but especially the West African species. Shirley and colleagues are collaborating with the governments of Côte d'Ivoire and Ghana as well as a number of NGOs to breed the animals in captivity and eventually release them to the wild. The largest such effort is taking place at a zoo in Côte d'Ivoire where more than 30 of the animals currently reside.Habitat loss and poaching affect both species, although there are so few West African slender-snouted crocodiles left, they are almost impossible to find, says Shirley, who spent “months and years” of his life looking for them. In the end, he collected DNA samples from a mere 15 to 20.The work is more urgent now than ever. “These are genuinely critically endangered,” Shirley says, “and [could] blink out at any moment.”© 1996-2018 National Geographic Society."}