{"id": "What Jean Pigozzi Can’t Live Without", "paragraph": "If you’re like us, you’ve probably wondered what famous people add to their carts. Not the JAR brooch and Louis XV chair, but the hand sanitizer and the electric toothbrush. We asked designer, photographer, and collector Jean Pigozzi, whose new book Charles and Saatchi is out now, about the camera, ice cream, and beverage he can’t live without.This is the only ice cream that I eat. If I can’t find Häagen-Dazs coffee ice cream, I’ll abstain, but if I find it, I eat a lot of it. I’m actually not a coffee drinker, but I think they got the taste really right. I like the consistency, too. It’s not too sugary. I think it’s a masterpiece.I’m addicted to UGGs, but I don’t wear them outside. I’ve never been seen in public wearing them, but as soon as it gets cold, I wear them all around the house. They’re not the slippers though. They’re the outdoor shoes that I wear indoors. I have three pairs of the classic ones that go up to the mid-calf.I’ve been wearing these shirts for the last 25 years. I find them incredibly comfortable. They’re the only thing I can sleep in. I actually just bought five more yesterday. I’m always scared they’re going to discontinue them, so I hoard them. They only get better and better after you wash them hundreds of times. I have about 40 of them.I’m glued to it. About 90 percent of what I do is on the iPad Mini. I’ll read the papers, do my emails; I even have my music on it. Sometimes I’ll take photographs, too. Not for my work, but if I’m explaining a chair or a piece of plumbing or something, that’s how I’ll use it. It also fits in the pocket of some of my suits. I like that it’s a bigger screen than the iPhone, and I like the convenience of all my apps, which you don’t have on the laptop. They just came out with a new one, so I’m running to the Apple store to get it.I have never shaved with a blade in my life because this razor is good and fast and does the job.It’s the most modern, new Leica, so the camera’s not too big, but it’s very fast and easy to use. I bring it around everywhere, though I don’t really print out my pictures. Most of them just sit on my computer. When I do a book, I’ll print them out just to see how they’ll look, but otherwise they’re just digital.I can’t start the morning if I haven’t read “Page Six.” It’s hard because in Europe it doesn’t come out until 10 in the morning, and sometimes 10:05 or 10:06. Half the time, I don’t know who the people they’re talking about are. I know Nicki Minaj, but some of the rappers or TV people, I don’t know them at all, but I think it’s fun to know what’s happening in New York, especially if you’re in Europe.This is the smell I like. I was at a Jesuit school when I was young, so it reminds me of church.Pellegrino has the best bubbles. Perrier is too aggressive, but San Pellegrino gets the number of bubbles right. I’ll drink seltzer, too, but I like Pellegrino better. I never take it with lime, though. You don’t want to spoil it.I don’t know if you want this on the list, but it’s like a toothpick with a brush that my dentist recommended for cleaning between your teeth. I highly recommend it. If you get it, get the No. 3, which is the best size. I feel most comfortable with it. I keep one in my back pocket at all times.My dogs Charles and Saatchi are the subject of my new book. Charles is the girl and Saatchi’s a boy. Saatchi’s very energetic, but Charles’s absolutely lazy.The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}