{"id": "I Used Only Australian Products for Two Weeks and Looked Glowier Than Ever", "paragraph": "Beauty obsessives have been talking about Australian beauty. Editors at all the big glossies have spent the last year raving about Aussie products’ short ingredient lists and clear, K-Beauty-level results. The power of Australian beauty companies lies in their access to unique indigenous botanics and nutrients that make their products particularly potent, like Kakadu Plum, a native and incredibly potent source of Vitamin C, and Caviar Lime, an AHA-rich, non-irritating natural exfoliant. These natural ingredients allow Australian beauty companies to create powerful products that aren’t clogged up with parabens or phthalates.A few months ago, my interest piqued by companies like the Vogue-approved Dr. Roebuck and the Byrdie-beloved Red Earth, I binge-purchased a ton of Aussie beauty products. Typically when I try out new products, I’ll integrate one new product at a time by slowly slipping it into my routine. But this time, I decided to do an experiment: for two weeks I swapped out every single one of my day-to-day products and went full Aussie, from my cleanser to my oils to my SPF. As you can imagine, I was nervous that the change would break me out.But I needn’t have been: with this new regimen, my skin looked bright, super hydrated, and soft even as the temperatures began to drop into the mid 40s. The products felt so different on my skin — my usual products bring intense tingling and chemical-y smells; these felt gentle and soothing and, for the most part, smelled fresh and earthy. Plus, I just felt good about what I was slapping on my skin twice a day: My traditional K-beauty face mask lists about 50 ingredients, most of the products I subbed in for these two weeks had half that or less. In short: these are game changing products for your skin’s health and will make you feel like Margot Robbie. I’m excited to share with you my favorites.This brand’s all-natural, “minimal ingredients, maximum results” philosophy seemed reason enough to give it a try. I bought their hydrating cleanser when my Beautypie one ran out — I wanted something gentle yet cleansing that could get me through the winter. It’s since become my everything. Using soothing ingredients such as Arnica and calendula (ingredients my mom actually used to put on my eczema when I was a kid), this cleanser will calm and hydrate even the most pissed off skin. I’ve found that it’s especially helpful on days when I’ve picked at my skin, and need to take my face’s redness down three to one hundred notches. I will repurchase this over and over again. It also has a cap on it so it’s super easy to toss in your gym bag.This isn’t as intense of an exfoliant as say, P50 or Drunk Elephant’s Babyfacial, but it sure gets the job done when it comes to gently yet effectively removing all the gross stuff you want off of your skin. And though it’s gentle, you’ll notice a change in the texture of your skin after just a few uses of this. Infused with indigenous ingredients such as AHA-rich Caviar Lime and Vitamin C-rich Kakadu Plum, this mask will leave your skin looking smooth, bright, and ultra clean. I now tend to use this twice a week right after cleansing.I started investigating this brand after receiving their extremely cute and well-packaged lipsticks as a gift from a friend, and very quickly fell in love with their Vitamin C oil. A hydrating, brightening double whammy product (I’ve never owned a Vitamin C oil, only serums), this will leave your skin looking super plump and radiant. I’m also obsessed with the way it smells. I use this before or mixed in with my moisturizer and my skin looks so glowy afterwards.I found endless rave reviews for this product’s repairative and hydrating properties on Sephora, plus the brand itself was created by Australian beauty editor Zoe Foster Blake. This oil is kind of an all around wonder product — it incorporates fatty acids, vitamins, and antioxidants, as well as anti-inflammatory and nourishing ingredients, which means that it makes your skin look and feel super soft and supple. It also really helps mellow out dry patches and scabby zits. It’s similar in a lot of ways to my beloved Drunk Elephant Marula Oil — but half the price. A winner, in other words.As a dry-skinned girl, I usually stay the hell away from anything that resembles a clay mask because they tend to dehydrate me. But I was going through a particularly brutal breakout and read that this mask — which uses purifying red and white Australian clay for combating inflammation, aloe vera for soothing, kakadu plum for brightening, and sunflower seed oil for replenishing, was incredible at sucking impurities out of the skin. And it was. The mask managed to unclog and tightens my pores, all while calming down the surrounding inflammation. It basically kicked my breakouts’ ass. It’s certainly not hydrating — I’d recommend applying an oil or moisturizer after using it — but it’s not terribly drying, either.This is a pricey little day cream, but it fulfills my number one criteria when it comes to creams in general: it’ll never, ever leave you looking even the slightest bit greasy. A lot of times I equate richness with efficiency when it comes to moisturizing my insanely dry skin, but despite the fact that this feels quite light, it keeps me moisturized all day long without any tightness. It also has a semi-matte finish, which means that makeup looks flawless over it.A few Aussie pals of mine raved about this sunscreen, so I knew it was going to be good. Not only will the high SPF protect you from the gnarliest of surf day suns, this sunscreen also includes hyaluronic acid for hydrating, Vitamin E to help neutralize harmful free radicals, and the formula is non-whitening. It’s so nourishing on the skin that I wore it several times this summer as a straight-up moisturizer. For any dry skin folks out there, this SPF is a must.This balm is a purse must have for lips, cuticles, and any dryness you might have throughout the winter. For me, this has become really important for sealing any of the little eczema patches I find on my face and body throughout the day. It protects and shields my flaky skin so that I don’t ever feel scaly when I’m out and about.This was another recommendation from an Aussie pal of mine who explained that this brand was one of the first all natural beauty brands to pop up in the the country in the ’80s — it’s what her mom uses and loves. Of course there are a lot of rosewater sprays out there, but this scent is especially pleasant and the spray distributes perfectly on your skin. It sets makeup beautifully, but it also works wonders as a desk side pick-me-up throughout the day.When we’re talking about beloved Aussie primers, almost everyone will tell you that Becca’s Shimmering Skin Perfector is the one. Mixed into foundations, or alone, the Shimmering Skin Perfector is well known for “high-impact glow.” And full disclosure, I do really adore that product. But I’ve recently been trying out something different — an illuminating primer from Luma that promises to make your skin look radiant, bright, and healthy, like you’ve just left a spa. I have to say, I’m pretty obsessed with it. It just creates the most beautiful base for your makeup, giving you that super lit from within, healthy glow that my skin is really in desperate need of this fall. It also really does make my makeup stay put all day long.The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}