{"id": "The Best Men’s Parkas on Amazon, According to Hyperenthusiastic Reviewers", "paragraph": "Here at the Strategist, we like to think of ourselves as crazy (in the good way) about the stuff we buy, but as much as we’d like to, we can’t try everything. Which is why we have People’s Choice, in which we find the best-reviewed (that’s four-to-five-star reviews and lots of ’em) products and single out the most convincing. We’ve covered cold-weather essentials like infrared heaters, men’s winter gloves, and lotion for dry skin, and here we’ve rounded up the best men’s parkas available on Amazon. (Note that reviews have been edited for length and clarity.)“This is not a coat that you need to layer under. I wore it yesterday in 25 degrees Fahrenheit with ten-mile-an-hour winds with only an ‘Elementex merino wool’ mid-weight base layer. Prior to that, I wore this coat in 35 degrees Fahrenheit weather down near Lake Michigan where it was really windy. I wore a coat with only a T-shirt underneath and nylon pants. The coat kept me more than comfortably warm.”“I just got this coat, so this may be a bit early. It’s 8 degrees Fahrenheit (-13 Celsius) today, and I’m toasty warm. I’ve inspected every stitch of this coat and it appears to be the real deal. I’d say it runs a little big, so be sure to use the Canada Goose sizing chart. If you’re in between sizes, get the smaller. It’s actually lighter than I expected. I can’t see how you could get any better quality.”“On my way to Minnesota, so I felt I needed a good parka to keep me warm in those frigid temperatures. I was born and raised in Hawaii and have lived in L.A. for the past 15 years. I am not afraid of the cold; it’s just that I’m not used to it. I’ve purchased a bomber jacket from A.I. before and it’s my go-to coat when it gets a li’l chilly here. I knew I could rely on the quality, build, and comfort that would come with the parka.”“Bought this for a trip to NYC in December to January. It holds up for warmth and good style. I am into men’s style and such things, so I know to buy quality items. Considering that I typically live in warmer climes in the southwest part of the U.S., I did not feel the need to invest in higher-level parkas like N.F. and Canada Goose. This will get you through some below-zero temperatures trust me, and it looks quite good.”“As of this review I have enjoyed having this coat through two Michigan winters, and I highly recommend it. I’d buy it again. The coat is much warmer than it looks from the product photos, with plenty of insulation to keep you warm on extremely cold days. The hood does a great job of extending that warmth to your head as well.”“I needed a new winter jacket, and all I can say right off the bat is pockets, pockets, pockets. You’ll find pockets in places you would never expect. If you like pockets, or if you feel you haven’t had enough pockets in your life, this jacket is for you. I ordered a medium, and my previous winter coat was also a medium, and this jacket fits perfectly. It keeps me nice and toasty in this harsh Minnesota weather.”“Super warm! So good for the price. The hood is a bit large. I’m five-foot-five and 150 pounds. I bought a small. Still a little big, but not by much. Totally worth it. My new standard winter coat.”“It has been a few years since I purchased snow gear, but I knew you cannot go wrong with Burton. As the season comes to an end, I can say this is one of the best jackets I have owned. I never felt wet after a long day riding and do not remember a time I actually felt cold when wearing it. Even during the periodic blizzards while riding, I never wore more than one layer under the jacket. I would highly recommend.”“Bought this for my tall husband, so am always looking to find things in a tall size. He really liked this! Bought a size up just to have a little extra room for wearing a sweater, etc. Nice and warm, casual winter coat. He said it was very comfortable!”“Great parka! Fits well, definitely windproof. Not too thick, not too thin.”“I’m five-foot-nine 145 pounds, slim. It fit nicely, not baggy, tight around the shoulder area. The hood is detachable. Must’ve been a really awesome coat because someone stole it from me at the bar I went to within the first six hours of me owning it … Still got the hood though.”The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}