{"id": "The 11 Men’s Gifts to Buy Before They Sell Out, According to a Trend Forecaster", "paragraph": "We realize that shopping for holiday gifts before Halloween probably seems crazy. But if you’re looking to get something really good — something that might just sell out before the Black Friday/Cyber Monday stampede — getting started right now is our best advice.To help you find the best gifts for the man in your life (or yourself), we spoke with Brian Trunzo, senior menswear editor at trend-forecasting agency WGSN, about the men’s gifts to buy right now before they’re gone. Be sure to check our guide to the soon-to-sell-out holiday tech gifts, too, as many of those would be good for men. And because this stuff is bound to sell out lightning quick, we’ll be updating our list as the season goes on.“For me, it’s all about limited-run products and collaborations. First on that list is Ralph Lauren’s recently announced collaboration with British skate brand Palace. This collaboration checks off all the boxes: surprising, intriguing, and guaranteed to sell out in seconds.” In the meantime, anything from Palace is also bound to sell out fast. Trunzo recommends “something fleece or Thinsulate, as that’s trending pretty hard right now in the market generally.”“The great prep revival is continuing to take hold of men’s fashion, and in line with last year’s picks, the rugby returns as a must-have item. This time, it’s a little more streetwear-inspired. Slightly oversize, patched together, and in bold colors. This year’s version will appeal to the preppiest and most hypebeast-y of anyone’s friends and family. Rowing Blazers has a wide selection of heritage-inspired rugbies, and its limited collaboration with downtown skate-inspired men’s brand Noah is something truly special.”For another rugby shirt in the patched-together style that Trunzo mentioned, we like this updated prep classic from Guess — a prep-heavy brand that came to fame in the ’90s, checking two major trend boxes.“Pretty much any colorway of the Nike React Element 87 will be covetable this season. It appears to have been a little unexpected for Nike (the success of the React series), as much of its marketing attention in early 2018 was focused on the Air Max 270 — but from the market, it appears that the React is the true winner.”The Air Max 270s are still a hot sneaker this season, not to mention significantly more wallet-friendly.“L.L. Bean’s 10” Shearling-Lined Boot sells out each and every holiday season. Cozy and truly waterproof, this is a must-have each and every holiday season — just a slam-dunk gift.”It’s not just the shearling-lined boots though. Bean Boots of every shape and size sell out year after year, so any pair is guaranteed to make men happy. And if your guy’s feet run too hot for shearling, or you’re just looking for a pair of duck boots that’ll work in more temperate climates, go for these.“For a little bit more style, I’d look to Salomon’s X style if you’re looking for something sleek and lightweight — a true performance boot.” [Editor’s note: These are Ralph Lauren’s go-to footwear.]Speaking of brand collaborations, American heritage brand Eastpak made a special limited collection of bags for J.Crew. This gunmetal-gray backpack is a riff on its most iconic design and has plenty of room for a laptop.“When it comes to tech, Amazon continues to build on its fleet of Alexa-powered objects. Its newest item, the Echo Show, is already sold out through November 5. If you can get your hands on the next batch, you’re destined to make someone close to you a very happy person this holiday season.”“Sony took a page from the Nintendo playbook and is releasing a PlayStation Classic. Much like the Nintendo Mini, the PlayStation Classic is a miniature version of the original mid-’90s model. Preloaded with 20 classic hits, this little item is jam-packed with nostalgia and hours of playability.” The PlayStation Classic is set to be released on December 3, but it’s available for preorder now. And if you want to pick yours up from Amazon, you can sign up for email alerts today.The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best women’s jeans, rolling luggage, pillows for side sleepers, ultra-flattering pants, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}