{"id": "Ask the Strategist: Who Makes Maya Rudolph’s Clogs on Forever?", "paragraph": "In our advice column, Ask the Strategist, we take your most burning shopping questions and scour friends, call up experts, and draw from personal experience to answer them. As always, please comment with one of your own — we’re here to help.Question: I am in desperate need of your sleuthing skills. Maya Rudolph wears several pairs of (the same?) clogs throughout season one of Forever — and I need them. I also don’t want to blow hundreds on some random Swedish brand without the Strat stamp of approval. Help me hunt down these wooden-soled wonders?On the Amazon show Forever, Maya Rudolph’s character June leads a really boring life and an even more boring afterlife, but one glint of brightness (aside from the very nice ceramics she makes) is her penchant for really good clogs.We called Forever’s costume designer Kirston Mann, who told us the blue braided clogs Rudolph wears are (as we suspected) No. 6, a favorite of artsy moms from Boerum Hill to Silver Lake. “Both Maya and I are big clog wearers, we’ve been huge fans of No. 6 for many years, and in our real lives we have almost every color and every style. I’ve worked with her before on The Good Place and Brooklyn Nine-Nine, but this was the first time we got to do dream clothes that we would want to actually wear,” Mann said.We also reached out to No. 6 owner Karin Bereson for more information on the two styles that Rudolph wears in Forever, who told us that Rudolph also wears the five-inch Buckle Boot clog.“She also wears our Heidi Woven Clog on Mid Heel in navy, which is a very recent past style. We are doing it this season without the weave; it’s called the Old School Clog on Mid Heel and has become one of our best sellers. We can, however, make older styles for customers upon request.” —Bereson This suede green pair is pretty great, too.But if you’re dead set on a pair with the braided top detail, you can pick up a pair from this season, though they’re wedge heels rather than ordinary clogs. Or look through a few similar styles that you don’t have to wait for the No. 6 sample sale to find.For clog rookies, this pair of light-brown 2.7-inch-heel clogs is a great pair to start with — just remember that they take a few wears to break in and get used to.For a pair with braided detailing not so unlike No. 6, check out these MIA Elsa clogs.If you’re really looking for comfort or have a slightly wider foot, these are a good and inexpensive bet.This two-inch heel is perfect for everyday wear with jeans or dressier occasions with dresses or skirts.For fans of higher heels, Swedish Hasbeens are well-loved and come in a broad range of colors and styles.If you’re looking to go even higher, check out these caramel-colored babies from Free People.Finally, if you already own a pair of No. 6 or any of the above, you might want to try the pair we dubbed the “new status clog” in bright aqua blue.The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}