{"id": "The Best Christmas Tree Decorations on Amazon, According to Hyperenthusiastic Reviewers", "paragraph": "Here at the Strategist, we like to think of ourselves as crazy (in the good way) about the stuff we buy (like pillows), but as much as we’d like to, we can’t try everything. Which is why we have People’s Choice, in which we find the best-reviewed (that’s four-to-five-star reviews and lots of ’em) products and single out the most convincing. While we’ve written about the best artificial Christmas trees before — as well as tree stands and toppers — here we’ve rounded up the best-reviewed tree decorations, lights, and ornaments on Amazon. (Note that reviews have been edited for length and clarity.)“I absolutely love these lights. I bought them for Christmas, and I put a string in a basket of flowers, another string in a tabletop Christmas tree, another string in a vase of flowers — you can use them anywhere because they’re battery operated. They are quite bright for such small lights, and they are just wonderful. I couldn’t be happier. They’re an excellent addition to my Christmas decorations. I definitely intend to buy some more sets of these lights because once I started putting them around the house, I just wanted more and more of them!”“Just received these lights and so far they are awesome. I use them year-round on a artificial tree in my house. They are lightweight and look beautiful. I would purchase again.”“I love this thing! The tree was literally lit up in ten minutes. Really looks nice, and gives you a lot of options for patterns. We have a pre-lit tree with white lights, and it has those ‘snow-covered’ branches. The light colors bounce nicely around the tree this way. I love being able to change the colors and patterns. Our 5-year-old grandson also loves helping choose the color and pattern combo.”“We couldn’t find these in stores, so we were grateful we could order them online. Hubby and I both grew up with these on our Christmas trees, so this bit of nostalgia was appreciated. Our tree was so sparkly and pretty that we were sad to take it down. We preserved most of the icicles, though, so they’ll be used again next Christmas!”“I cannot believe how wonderful these garlands turned out to be! I was concerned about the price, but when I got the garlands out of their bag, they were just as advertised — thick and full!! They are so well-made that they almost feel like a feather boa in your hands. The colors (I ordered blue) were so vibrant that they just pop on the tree. I had ordered two packages of these for the tree and just ordered another two for decorating my fireplace mantel and entertainment center to match the tree.”“I have a new kitten this year, and she is untrustworthy around shiny things. I did not want to put my antique and vintage ornaments on my tree this year, so I ordered these shatterproof ornaments. I was surprised how beautiful they are. They look so great on my tree, and they really look very expensive. They are larger than the average round ornament, but I am so happy I bought them. And, wouldn’t you know, the kitten leaves them alone! I highly recommend these ornaments.”“I ordered one set to fill in some empty spots on the tree, and as soon as I opened these I ordered a second set. They are made very well, they are beautiful, and are even prettier than the picture. The delivery was very fast and they are in perfect condition. They look very expensive.”“These are perfect for a small Christmas tree. They have a nice variety of patterns to break up the repetitiveness of solid color ornaments. If you’re trying to decorate a small tree on a budget but want something better than the $5 bucket of plastic ornaments from the drugstore, these are a nice place to start.”“Since I didn’t have time for a big tree this year I purchased a small one. I ordered several packages of these bulbs and they were perfect. They shine like glass, have rich color, and reflect light from the tree’s lights and tinsel. And when dropped to the floor they don’t break or take any damage. When I do have a large tree again I’ll also use these bulbs to fit into those small areas on it. Great purchase!”“I love these ornaments! They were given as Christmas gifts to some co-workers, and everyone loved them. I love the country design. They were a good size, and light enough to hang on the tree. Some ornaments are just too heavy to sit on the tree; these were perfect. I would absolutely get more.”“In anticipation of the holidays, I searched and purchased a two-foot Christmas tree that I hope will bring cheer to the workplace. I was in search of mini-decorations that would compliment the tree. When I saw these, I loved the variety of designs of the ornaments. Surely, whoever looks at the tree will admire the delicately painted wooden ornaments and their character. The ornaments are tiny, but I feel that I might be able to use most, if not all, of them on the tree. Also, children are often around, and I think they are going to really enjoy the different ornaments.”“Great set of nutcracker ornaments. Excellent color, shape, and detail. They are a great addition to my “Nutcracker Suite” collection and a value sold as a set. They’re fragile, but better than the glass pieces in my collection. Save the box for storage after Christmas.”“Purchased this ornament as a gift for my wife who loves golden retrievers. The colors on the dog are vibrant and nice — they certainly aren’t dull, and the dog doesn’t get lost on the tree like some ornaments can because on their colors. The dog also actually looks like a golden retriever — a lot of times, you see ornaments and such that just don’t really look like a golden or a Lab, but I definitely think this puppy does. The ornament also feels nice and solid, and doesn’t feel like a cheap, flimsy ornament that you could easily crush with your fingers.”Note: Other breeds, including cockapoos, spaniels, and Yorkies, are also available. “Adorable representations of the wonderful wildlife that visits my yard, woods, and gardens. They are so lightweight that they are perfect for those hard-to-decorate areas on the tree that can’t support heavier ornaments. So glad I purchased these!”“I got this ornament as a present for my Doctor Who–loving husband (and admittedly, for myself as well), and I can’t tell you how pleased I was with it. This ornament is stunning. It’s the most beautiful ornament on our tree, all thanks to the gorgeous blue paint. I can’t get over how beautiful the paint is — it almost glows. The details, like the police box notice and the windows, are so tiny and precise. My husband was thrilled to put this on our tree, and I can’t wait to have it on our tree again next year!”“I’m very happy with the Downton Abbey ornament! It is exactly as I expected it to be. I purchased two to give as gifts, but am very tempted to buy a third for myself. The picture is very accurate, except that the paint (on the lettering and windows) is a tiny bit more crisp on the picture than on the actual ornament. I’m amazed at the detail on all the Gothic architectural features!”“I purchased five of these as senior-night gifts for the seniors on my daughter’s volleyball team. Overall, I’m pleased with them for the price. They are beautiful ornaments with nice details. The silver sparkle against the pearly white is a nice touch that gives them a very elegant look. They are very pretty and delicate, and I think the girls are going to love them.”Note: These are available for fans of other sports like basketball, soccer, and tennis.“This is the cutest ornament ever. You wouldn’t think that there would be much attention paid to the case, but it’s amazing with the details — just like a regular guitar case that was shrunk down. It is a quality case, which is very sturdy and protective of the little guitar, and the miniature clasps open and close. My son was amazed!”The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}