{"id": "The Best Ugly Christmas Sweaters on Amazon, According to Hyperenthusiastic Reviewers", "paragraph": "Here at the Strategist, we like to think of ourselves as crazy (in the good way) about the stuff we buy, but as much as we’d like to, we can’t try everything. Which is why we have People’s Choice, in which we find the best-reviewed products and single out the most convincing. We’ve covered the best artificial Christmas trees, Christmas tree toppers, Christmas lights, and wreaths, and now we’re zeroing in on the best ugly Christmas sweaters on Amazon. (Note that reviews have been edited for length and clarity.)“I love Christmas and I love being able show my Christmas spirit in my fashion choices! The sweater is very thick (which is good for when the weather gets colder because I’ve found that a lot of Christmas sweaters that I buy from other stores are very thin and not very warm at all). The styles available are all very cute and stylish. The sweaters are great for ugly sweater parties and are a great way to spread holiday cheer. Overall, it has quickly become one of my favorite sweaters!”“This is really a very nice sweater. I wanted something cute, and maybe a bit ‘dorky’ that I could actually wear for Ugly Sweater Days at work over the holiday season, and this fills the bill perfectly. It isn’t too heavy or bulky, but still heavy enough to ‘take the chill off.’ It seems to be quite well made. I ordered an XL, and it actually fits more like a L. This is fine for me, but if you really need an XL it might be a bit small for you. Over all, I’m quite pleased with this sweater.”“It’s hideous–but it’s supposed to be. Big hit at Xmas shows I played. Only reason for losing a star: since the LED’s are motion-sensitive, if it’s hanging on my bedroom clothes rack (aka treadmill), every little breeze in the room (or brush-past by my cat) lights it up in the dark.”“The pictures don’t really do this sweater justice. It’s really nice quality, thick and warm and the infinity scarf is an added bonus. I wore this to an ‘ugly sweater’ party, but it’s just too cute to be considered ugly! One thing to note, I’d normally wear an XS but they didn’t offer that size. I opted for the small which fits but is a tad bigger. For someone who normally wears small, this would fit as expected.”“I ordered this sweater as a cheap, fun thing to wear around the holidays. The quality exceeded my expectations for the price since it is thick. The large size, however, was much larger than expected. I’m five-foot-five and 160 pounds and probably should’ve ordered a small. Will still look okay with boots and leggings for an ugly sweater party.”“This sweater is going to be great for my husband to wear to the family ‘Ugly Christmas Sweater’ party! He laughed out loud when he saw it. I ordered one size up just in case it shrank in the wash. I turned it inside out and washed it on the gentle cycle in cold water and then dried it on low heat. It may have shrunk just ever so slightly, but it came out of the washer soft and fluffy and the colors didn’t fade any.”“Absolutely fantastic! I bought this as a tacky Christmas sweater then just never took it off!!! I can simultaneously anger my girlfriend and scare my dog. I didn’t think this was even possible! For any fans of sloths, sweaters, or Christmas in general this is a must have.”“Absolutely amazing. Nice material. Great design. I’m a bigger guy so I ordered as big as I could, and I REALLY got what I paid for. I usually wear hanes XL T shirts, and this thing will need to shrink just once in the wash and will be perfect. Best $30 I ever spent. I can’t go ANYWHERE without getting compliment.”“Good material and excellent craftsmanship. I needed a sweater for a work function and this is a classic cut and will last for many December’s to come.”“This is a great holiday sweater, got loads of compliments on it. Quite slim fitting IMO. Relatively soft, fingers crossed that keeps after a wash but frankly at this price you cant expect too much on a rarely worn holiday sweater.”“So adorable! Needed a Christmas sweater for my son for a Christmas party and this was perfect. The colors are nice, the sweater is not too thick but warm enough. The reindeer design is so cute. We got a lot of comments from this sweater.”“This sweater is awesome and was the talk of my son’s school. Both of my daughters would wear it the days after he’d worn it. What’s not to love about a llama staring at you on a Christmas sweater?”“Pretty true to size. It is so cute and ugly at the same time. My son is in love with it and has worn it so many times. Washes very well.”“Bought this for my 10-year-old son for Ugly Sweater Day. I bought a medium. He wears a boys’ size 12. Sometimes I don’t know if I should get him a Medium or a Large. Other shoppers said that this sweater runs large. It does. It is wide. A large would have been much too big. Even though the sweater in our opinion is horrendously ugly (which he LOVES), it is well made. The dinosaurs are constructed of a heavy felt material and are sewn onto the sweater very nicely. If you are looking for a loud and obnoxious sweater, this is it!”“GET THIS SWEATER FOR YOUR KID!!!! This is high-end quality for a fraction of the price. This sweater is well made and lovely. This was a perfect choice for dresses-up holiday gatherings, family photos, and even church! I am so pleased with the look, fit, coziness, and quality in relation to the price! Get it!”“Our granddaughter looks adorable in this sweater! She wore it for her preschool concert–it was perfect.”“Great quality, perfect thickness. I have purchased a lot of different brand sweaters for my 15-pound Westie and this one fits him the best! A perfect fit in large. He did not want to take it off.”“This is a great dog sweater. Cuter in person. As others have said, not too thick nor thin. The only problem we have is my short fat dog has thick arms and a broad chest (schnauzer mix). I went with a medium based on the length. I may have to stretch the arms out a bit to make it more comfy for him.”“It was hilarious to watch my puppy wearing this cute costume. She is such a joy and we had a full dose of happiness during Christmas when we watched her reaction to this shirt. Lighting worked very well.”“Super cute sweater! High quality - someone put some effort into making this sweater warm and adorable. Only nine bucks! Great deal!! I got my 16-pound terrier a size medium and it fits well. Maybe a little too big on him. Hope that helps!”The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}