{"id": "The Best Body Serums for Moisturizing Dry Winter Skin, According to Dermatologists", "paragraph": "As seasons change and central heating returns, now’s the time everyone is scrambling for new ways to moisturize reptilian skin. Recently, we’ve been hearing some buzz around body serums, which are similar to serums for the face, only they’re meant to moisturize and even exfoliate the dry bits on your legs, arms, and back.“Just like serums for the face, serums for the body offer a great way to deliver more active ingredients to the skin,” explains New York dermatologist Hadley King, a clinical instructor of dermatology at the Weill Medical College of Cornell University. The extra skin-care step is helpful, she says, because though “some body lotions also contain active ingredients, body serums often have higher concentrations of these ingredients.” But the two aren’t interchangeable, and for best results should be used one after the other, layered lightest to heaviest (the serum before the lotion). Here, we asked dermatologists to help us sort through which ones are worth buying.We’ve covered One Love Organics before for their cult-y cleansing oil, but their body serum is another good one to know if you don’t want to spend too much money, or time applying it. This one’s unique in that it comes in a spray bottle, so dermatologist Noelani Gonzalez, the director of Cosmetic Dermatology at Mount Sinai West, says it’s fast and easy to use, ideal for someone who’s short on time. “It also has pumpkin seed oil, a natural source of salicylic acid which helps exfoliate,” and she adds that generally essential oils are a must for those looking to plump and hydrate their skin.If you want a body serum that exfoliates, Gonzalez and King like this Ren body serum which contains alpha-hydroxy acids (like lactic acid) and essential oils. “Gentle chemical exfoliation helps to slough off dry dead skin cells, leaving the skin softer and smoother,” King says, and “the lactic acid in this gently gets rid of dead skin cells without any scrubbing.”For someone looking for something a bit cheaper, we have options for you, too. You can find this Vaseline deep repair serum in your local drugstore, and Gonzalez says it works because for hydrating because “it has elastomers which help smooth skin and the vaseline jelly creates a protective layer for your skin.”Speaking of hydration, it wouldn’t hurt to double down with some hyaluronic acid, which both experts said was an important humectant for plumping skin and retaining moisture. One hyaluronic acid product King likes is this luxurious serum–slash–body milk from French pharmacy brand Vichy that contains ten essential oils.“Depending on what your concerns are, you can look for ingredients like Vitamin C and E, which are anti-aging and act as antioxidants,” says Gonzalez. “They help protect your skin from UV radiation and pollution — these environmental stressors can speed up the aging process.” In that vein, we’d suggest this Moroccanoil that contains vitamin C, plus antioxidant-rich argan oil. And if it’s anything like Moroccanoil’s hair products, it’s going to smell delightfully fragrant.And though this one has a steep price point, Gonzalez says it’s very promising for people hoping to lighten up dark spots and melasma. “It has tranexamic acid in it, an ingredient that has been shown to improve melasma and dark spots in a few clinical studies.”And this is the body serum we’ve been using from Lily de Mai. It’s unscented and specifically catered to sensitive skin, so it might be a good one to try if you’re prone to body breakouts and rashes. We like that it contains a blend of omega-3 oils and antioxidant-rich plant oils (which feels decadent after a hot shower) plus ceramides (which derms tend to love for restoring the skin barrier).The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}