{"id": "The Best SAD Lamps on Amazon, According to Hyperenthusiastic Reviewers", "paragraph": "Here at the Strategist, we like to think of ourselves as crazy (in the good way) about the stuff we buy, but as much as we’d like to, we can’t try everything. Which is why we have People’s Choice, in which we find the best-reviewed (that’s four-to-five-star reviews and lots of ‘em) products and single out the most convincing. While we’ve found the best floor lamps and the best desk lamps before, here we’ve found the best SAD lamps on Amazon, according to hyperenthusiastic reviewers. (Note that reviews have been edited for length and clarity.)“After moving from the southern U.S., where I’ve lived my whole life, to the upper Midwest, the lack of intense, direct sunlight that I was accustomed to was more than I could handle. There’s a slow-growing depression that sets in and the darkness creeps into your soul. The day I got this light, I set it up and sat directly in front of it for a full hour. The light starts at an almost overwhelming brightness. But you get used to it quickly. Then you get a slightly warm sensation, just like being in actual sunlight. Since I’ve started using the light first thing in the morning for about 30 minutes or so, I start my day off in a better mood and with more energy. I also sleep much deeper. I don’t like the ozone smell, so I can’t speak to the benefits of the ‘negative ion generator.’ If you’re buying this unit to combat sun withdrawal or issues sleeping, I cannot recommend this one enough!”“If I could give this ten stars I would!! I was struggling so much with energy levels, I was irritable, I had to talk myself into doing the smallest of tasks, and everything seemed like such a hard chore. This winter has been very cloudy where I live. It was such a gradual thing that I didn’t realize just how BAD I had gotten. So I looked into the happy lights. Even then I was skeptical. I mean, who would think a simple light could fix ALL of those problems? Well, it has been a week, and I’m like a new person. All kinds of energy, a much better mental state of mind, my sleep isn’t disrupted … I’m a true believer, and I wish I had gotten it sooner!! So if you have any doubts … just stop … press buy NOW! You won’t regret it!”“This is the BEST thing I have bought myself in forever! No more winter blues. I use it an hour a day as soon as I get home from work. Mood has improved so much that I find myself singing all of the time! Highly recommend to all!”“I love this light. It makes me feel way better when it’s grim and dark and wintry. It’s very bright, and just what I was looking for. I guess my cat missed the sun, too, because she makes a point of lying in front of it when it’s on, and it makes her less grumpy. Light therapy for elderly cats: highly recommended. Light therapy for people: also recommended.”“I have severe SAD and was told by my physician that I needed to get a light-therapy lamp. After an exhausting and exhaustive search, here’s what I’ve found. Now, if there’s one thing I’m not, it’s unfastidious (is that a word?) when it comes to my health and wellness. If I’m buying a product that’s going to shoot massive amounts of light into my eyes for an hour a day, you better be sure I’d have done my due diligence. So, what I did was buy the lamps that I thought looked like they provided the best form and function. I then tested them for brightness, light quality, size, type of bulb, and design. Finally, I was able to make an informed decision. For me, the Circadian Optics Lumos was the best lamp out of the eight I tested. It is one of the brightest, is small and compact, emits a nice white light, used LED bulbs, and had a great-looking design. The only two other lamps that were also acceptable were the Aura Daylight Therapy and Verilux HappyLight VT10. But since I didn’t have to sacrifice brightness for size, I’m still glad I picked the Lumos.”“This lamp is amazing. I study inside all day long, and this has helped me with my seasonal affective disorder. It keeps me sane!!! If you’re prone to depression, spend a lot of time indoors, etc., DEFINITELY get this!! I bought one for my sister as well, and she loves it. Please take care of your mental health!”“Great lamp overall. I regularly use it and have had no problems. I have sensitive eyes and fluorescent lights are harsh; however, my eyes have been fine with this bright lamp. I am on a night schedule, and this lamp helps when I need to wake up while it is dark outside. I generally feel that it has been having a positive effect on my circadian rhythm. It is conveniently sized to place next to your desk or couch. You’ll have to keep your own health journal to determine if you feel it has the effect you are seeking. Overall, I personally recommend it.”The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}