{"id": "I Tried 19 Pairs of Wide-Fit Ankle Boots to Find 11 That I Love", "paragraph": "Every year around the time Marshalls starts putting out Halloween decorations, I search for wide-fit ankle boots to wear all fall. It’s difficult, as ankle boots are almost engineered to look best when narrower, but as someone with wide feet who loves the look, I’m always determined to find good candidates.Last year, I wore ASOS low-heeled black leather Chelsea boots until a hole wore in the bottom of the heel. This set the bar for the comfort and versatility I seek in an ankle boot, and I set out to find this season’s pick. I called in samples of 19 different styles, colors, and heel heights, and wore them all for weeks. No reviewers on shopping sites normally go into detail about how much their feet were aching after ten hours of commuting, running to meetings, and going on bad dates, so I challenged myself to wear each pair for at least two days, knowing they wouldn’t break in fully in that amount of time, but sacrificing my comfort to share the experience of shoes right out of the box. Here are my 11 favorites (plus a few extras tacked on here and there that didn’t make the cut).As soon as I put these on, they felt broken in, and were by far the most accommodating for wide feet. (ASOS says they are EE, so double-wide.) They worked with tights or medium-thick socks, and although they weren’t as cushioned at the bottom as some of my favorites, they had a low heel (a little over one inch) and slipped on and off with elastic rather than dealing with zippers or buckles. They’re definitely my favorite for everyday wear, even when walking a lot, and I am wearing them right now as I write this. I might even buy a second pair for next season.I searched high and low for colorful, printed ankle boots in wide widths, and these were one of the few I found on Zappos. They got six compliments at dinner, on the train, and walking to my apartment within the span of a few hours. Definitely go up a half or full size in these because they are a C width, a.k.a. the least wide of wide-width shoes, and can squeeze at the toe. But the metallic block heel and beautiful coral-blue floral embroidery make them a top pick. Once I went up a half size, they were much more comfortable, but are best worn with tights.These are the boots that I leave at my desk for times that I wear rain (or snow) boots to work and need to change into something less clunky. They have raised foam bumps at the ball of the foot, like stick-on candy dots, that gently massage your foot with every step. It’s subtle, but effective. There is also more arch support in these boots than others I’ve tried, and the stacked heel (at 1.65 inches) is high enough to look nice but low enough to walk for a while. There’s also stretchy side gores and pull-on tabs in addition to the zipper, and a bit of sheen in the leather that shimmers when you walk. They run a little narrow at the toe, so I recommend going half a size up.These were the last pair that I tried, and by far my favorite aesthetically. Lavender may not be the first color you think of when you think of fall, but maybe it should be. These suede boots are nice and wide at the toe, but I still sized up a full size (Eloquii doesn’t do half-sizes) to make sure I could wear a slightly thicker sock with them and my toes weren’t compressed. The block heel is curved, which doesn’t really do much for the fit but looks nice and adds a bit to the design. The padded footbed got me through a long day, and the stretchy gore at the ankle can accommodate larger ankles and calves — they hit a few inches above my ankle. They also come in tan and plaid, but I think everyone looks good in purple.I bet this shoe is called Peaches because it is soft and a little fuzzy. It isn’t labeled as a sock boot, but it is one of the only sock boots I’ve seen for wide widths. The microsuede is incredibly soft, and the boot’s lightweight overall. It’s stretchy in the ankle but not super wide in the front, so definitely go up half or a full size so your toes don’t get squeezed. They’re best worn with tights or superthin nylon socks. I also liked their Jasmina wine-colored boot with accent buckles, which had a superwide opening at the ankle. Great for people with larger calves or who wear wider-cut jeans. They weren’t very soft in the sole, but manageable.These Clarks boots have been heavy in my rotation, even past my testing period, but even at half a size up, they do run a bit narrow in the front and cause pinky toe pinching. Why do I keep wearing them then? I think the trade-off of a sore toe for a comfortable two-inch heel and nice ankle support while I walked was worth it. These also looked dressier and more expensive than many of the boots tested.I’ve long avoided kitten heels because I always end up teetering over and losing my balance because it’s such a small heel, but this bootie is sturdy, and I wore these and wore them for nine hours running around CurvyCon, a plus-size convention, catching compliments left and right. “Where did you get those? Are you tripping over yourself?” people asked me during the Loft fashion show. Nope. Felt great without a breaking-in period, and the shoes had great distribution of weight, too. The pointed toe does squeeze a little bit, but they only run in full sizes, so I wouldn’t recommend sizing up.Wedges are my favorite style of heel, but they were tough to track down in wide width, especially in lace-ups. These have a memory-foam insole and a flexible rubberized sole that kept me comfortable and not slipping all day. They note in the details online that they run half a size small, so this is one you definitely have to go a half or full size up for length and width. Dr. Scholl’s also makes the Dakota, a more feminine version with tassels. I found it fit the same.These white square-toed boots did get a little scuffed the first time I wore them, but I took an Eraser Daddy to it and it cleaned right up. The two-inch block heel is enough height to feel polished, but not so high that your foot slides forward and gets totally squished. These are more comfortable than Lane Bryant studded strap booties, which had a pointed toe that was more toe-squishy.The 3.5-inch cone heel on these boots should not have been comfortable, but the interior of the shoe really molded and supported my arch and did not feel like it was a higher heel. The slouchy part of the boot was roomy (it hits at the start of my calf), so you could tuck pants or leggings in. I loved that my foot didn’t slide around — even though I specifically ordered half a size up, knowing that sometimes heels make your toes get squished at the front of a shoe. It didn’t, and the width at the front of the boot was perfect. No bulging, no discomfort. After a long day wearing them, my feet did hurt a bit, but that is to be expected from a higher heel.When I first started testing boots, the weather was transitioning from summer to fall, so leather boots were hot. But these have perforated side panels for breathability, allowing a little wind to circulate around my feet. The cushioned interior, stacked heel, and rubber outsole on these made me feel incredibly comfortable and secure walking up and down slippery stairs after a rainstorm, and I liked that these had a back zipper.The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}