{"id": "What Happens If Americans Stop Trusting the System?", "paragraph": "It’s been quite a while now that the phrase “cold civil war” has been bandied about. And it’s useful, so far as it goes. Polarization has now become tribalism, and tribe is now so powerful a force it is beginning to eclipse national loyalty. The two nations, to borrow Benjamin Disraeli’s description of 19th-century Britain, stand facing each other, without blinking, faces flush, equally matched, on trigger alert for offense or another set battle. What we don’t quite know is if this tenuous, balanced equilibrium is sustainable indefinitely, the system careening from one party’s bitterly contested rule to gridlock and back again, until our tribal tensions are somehow exhausted. Or whether the cold civil war could at some point get a little warmer, or even, shall we say, hot.What we don’t know, in other words, is when the legitimacy of the entire political system could come into doubt, across the ideological spectrum, in a way that might sanction undemocratic responses. By legitimacy, I don’t mean having deep differences in policy with a president or his party; I don’t mean contempt for, or even mere opposition, to the powers that be; I mean denial of the core validity of the key institutions and players in our system. It’s one thing, after all, to disagree profoundly with an administration’s policies; and another thing entirely to believe an administration, or a congressional majority, or a Supreme Court majority, is fundamentally unjust, and its decisions therefore nonbinding.We currently, for example, have an acting attorney general, the appointment of whom was almost certainly unconstitutional. The last time anyone checked, the AG reports directly to the president, is a “principal officer” in the Cabinet, and wields extraordinary power over our entire system of justice. Installing him as acting attorney general without the advice and consent of the Senate breaks a fundamental principle of liberal democracy and American constitutionalism: No single person should have complete control of all those in the Executive branch, without some severe risk of corruption.And corruption is, of course, the entire alpha and omega of Whitaker’s appointment. He is a partisan hack, far out of the legal mainstream (he once opined that Marbury v. Madison was wrongly decided, for Pete’s sake), and seemingly has been installed to shut down or neuter an independent investigation into the president’s campaign. That very possibility is why the Founders wanted the Senate to have a role in this level of appointment. Without such involvement, Whitaker is, in a word, illegitimate. And when the chief law enforcement officer in the country has no constitutional authority, the entire rule of law comes into question.And this is no longer an abstract question. It’s happening right now.Then there’s the Supreme Court. Its broad legitimacy is critical for the survival of a deeply divided republic, because there are times when only the Court can resolve a destabilizing conflict, as it was forced to do in Bush v. Gore. But it has involved itself in recent decades with profoundly emotive questions — such as abortion — that split the country. Each time it does this, and sides with one tribe over another in a question as fundamental as when life begins, or who the president is, it loses a little institutional luster. It starts to fail the neutrality test — which is to say it loses part of its very legitimacy.But with the abolition of the judicial filibuster, even at the Supreme Court level, and the GOP’s nakedly partisan refusal to give a hearing to the last president’s nominee, Merrick Garland, we are in a new zone of tenuousness. Gorsuch wasn’t ideal after Garland — but the addition of the rigid partisan Kavanaugh in the place of the quirky libertarian Kennedy has only further weakened the legitimacy of the Court. Kavanaugh revealed himself in the hearings as a Republican activist, dedicated to upholding the Executive branch’s immunity from prosecution (as Newt Gingrich made clear). In those circumstances, how much legitimacy would a 5-4 vote protecting Trump from Mueller have, if Kavanaugh was the deciding justice? And what would be left of the Court’s broader legitimacy then?The legitimacy of elections themselves is also increasingly in doubt. For some on the left, the skew in the House, because of gerrymandering and the concentration of Democrats in urban areas, is undermining faith in the system. And it is indeed crazy that an opposition party needs to be around seven points ahead in the national polling to take back the majority (the gerrymandering of state legislatures is even worse). And think about the possible ramifications: If some of the close races last Tuesday had gone the other way, and the GOP had kept control of the House even though it lost the popular vote, where would our politics now be? In acute crisis, I think.Similarly, the Senate’s structural tilt toward the less populous, rural, and heartland states further disadvantages one party alone, the Democrats, and looks set to do so for the indefinite future. That takes one branch of government (along with the judiciary via the Senate’s role) and keeps it indefinitely out of the hands of one of the parties — a legitimacy problem if ever there was one. Then there’s the Electoral College’s occasional preference for the losing presidential candidate in terms of the popular vote. This is not a black-swan event any more. In the 21st century, it could be said of the initial election of two out of three presidents, both Republicans. Two out of three. If that were to repeat itself going forward, a crisis of presidential legitimacy would be perfectly understandable.Trump, meanwhile, has been hard at work delegitimizing any institution, office, or officeholder that stands in the way of his whims and temper, including the Department of Justice, the FBI, and the special counsel investigation — which he impugned yet again this week as the rigged work of Democratic partisans, rather than a lawful, independent inquiry, led by a Republican. By co-opting the military in a campaign stunt to halt the caravan, by staffing his administration with military figures, and by talking of the service members as somehow his, rather than the country’s, Trump has also risked the legitimacy of the military as a force utterly removed from party politics.His entire political career is based, after all, on questioning the legitimacy of the Obama presidency. And that’s what birtherism was. It was not an argument against the policies or the character of the 44th president; it was a bid to erase his very eligibility to be president at all. If the conspiracy theory were proven, it would have repealed an entire presidency. And Trump was very happy to go there.In the third presidential debate, Trump pushed the envelope again and refused to say that he would abide by the results of the 2016 election in advance: “I will keep you in suspense.” After he actually won the election, he nonetheless claimed that several million votes had been cast for Hillary Clinton illegally, and that he had, if not for these fraudulent ballots, won the popular vote. He has never withdrawn this fantastic, destabilizing lie. It sits ominously in the air, its toxins slowly dissipating.Trump subsequently set up a commission to investigate and eradicate “fraud” in the electoral system (which collapsed upon encountering reality) and still has not disavowed his suspicion of the integrity of the vote. This past week, he insisted that there was foul play in the vote count in Florida, and that the only valid result was the one reached on Tuesday night, before many Democratic votes had been counted.This is what the man ultimately tasked with the enforcement of the law tweeted: “The Florida Election should be called in favor of Rick Scott and Ron DeSantis in that large numbers of new ballots showed up out of nowhere, and many ballots are missing or forged. An honest vote count is no longer possible - ballots massively infected.” Note the hyperbole: “ballots showing up out of nowhere … massively infected.” No room for ambiguity there. He even detailed how he thinks the fraud happens: “Sometimes the [fraudulent voters] go to their car, put on a different hat, put on a different shirt, come in and vote again.” What Trump is claiming is that if Bill Nelson were to win the ongoing recount (which he probably won’t), he would not be a legitimate senator. Does that mean his vote should not be counted in Washington? Who else’s could be called suspect?The rhetoric of illegitimacy is spreading. Even the solid Ohio senator Sherrod Brown went there this week. “In America we will never give up the hallowed ground of patriotism to the extremists … and the extremists in this White House,” he said. “We also will never give in on voting rights … if Stacey Abrams doesn’t win in Georgia, they stole it, it’s clear. It’s clear. I say that publicly.” Stole it? Cory Booker agreed that the “election is being stolen” from Stacey Abrams. Now it’s perfectly fair to protest voter suppression, and indeed the role of Brian Kemp in overseeing an election he took part in. But to declare an election stolen takes everything up another rhetorical — and constitutional — notch. It renders the victor of such an election a fraud.The more pressing source of illegitimacy, of course, could well be the president himself. It is perfectly possible that the various investigations under way will find evidence, and possibly quite soon, that his campaign conspired with a foreign power to tilt an election decided by only some tens of thousands of votes in a few midwestern states. In other words, it could be argued that he won the election, by unfair and even criminal means, and is thereby not a legitimate president. It’s also highly possible that prosecutors will discover money laundering, bribes, shakedowns, scams, and other crimes in the history of his own company, rendering him a de facto corporate criminal in the Oval Office.If Kavanaugh’s swing vote lets Trump off the hook on these legal challenges, especially if Mueller comes up with substantive evidence of wrongdoing, the opposition could lose it. He may be impeached in the House but there’s no chance, barring a massive surprise from Mueller, that he would be convicted by a supermajority of the Senate. He’d be sitting there — an emperor with no clothes, but still perched on the throne.Which brings me to the ultimate legitimacy worry: Could Trump refuse to accept the results of the next presidential election? For many, even considering this possibility is a function of Trump Derangement Syndrome. But I ask you: If Trump has denied the validity of the results of elections in 2016 and 2018, why would he not deny the validity of the results in 2020? He would have a lot at stake — his entire legacy of always “winning,” about as deep a psychological need as he has. (It’s noteworthy, it seems to me, that he declared the midterm election as a “big victory.” That’s how hard it is for him to concede defeat in any way.)The margins in 2020 could be close. Several states could have narrow majorities for his opponent that could be challenged in the courts. Trump could yet again claim that millions of illegal immigrants had voted. He could blame … China. Or he could caricature the vote-counting process — just as he currently is in the Florida recount — in a way that discredits the result, and tears the country apart.Here is what he has said so far about Florida’s vote: “Bad things have gone on in Broward County, really bad things. [Brenda Snipes]’s been to court. She’s had a lot of problems … I say this: He [Scott] easily won. But every hour it seems to be going down … What’s happening in Florida is a disgrace … Go down and see what happened over the last period of time, ten years. Take a look at Broward County. Take a look at the total dishonesty of what happened with respect to Broward County.” Now imagine him saying that about the certified results of a state in a presidential power struggle.I remember the disturbing end of the presidential election of 2000. Its role is underestimated, it seems to me, in the history of American division. We had a situation in which we really did not know who was going to be president of the United States for weeks. The procedures for resolving this failed … until the Supreme Court stepped in. I felt a tension in the atmosphere back then that I haven’t since: It was a crisis of authority and legitimacy. And it scared me.In the end, it took Al Gore’s character and patriotism to defuse the constitutional crisis, when he accepted the Court decision (which was effectively arbitrary). The same, in fact, could be said of the very close presidential contest of 1960, when Nixon also demonstrated a deeper loyalty to the system as a whole than to his own short-term interests.But Trump is no Gore; he doesn’t even have the character of Nixon, who retained, even in his disgrace, a sense of shame and understanding of democracy’s norms. Trump has no shame and no such understanding. In a crisis, he would break this democratic system, not save it.Who’s Rooting for Theresa May?Nevertheless, she persisted.I don’t know how else to describe Theresa May’s grueling slog toward the least worst Brexit possible. It was yet another tenderizing day for her yesterday as the Commons beat her up again and again and again on her proposed deal with the E.U., as yet more ministers resigned (including her second Brexit secretary!) and as a handful of ferocious Europhobes — led by Jacob Rees-Mogg, a parody of an upper-class twit — launched a formal bid to oust her from the leadership of the Tory Party. Good times.The awkward prime minister is still standing upright, though maybe not for much longer. In this respect, I’m surprised more feminists haven’t come to May’s defense. May’s bourgeois Toryism, like Margaret Thatcher’s, doubtless disqualifies her from any respect from the left. But her tenacity in the midst of male obloquy is emblematic of many themes American feminists focus on.May, after all, is taking responsibility while her male colleagues posture and preen and complain or resign; she gets almost no credit for negotiating one of the more complex international deals in British history for two demoralizing years; she works harder than anyone else in her government; and the deal she has struck is almost certainly the only one the E.U. will ever accept. A woman, in other words, got the toughest job in government in decades, did the best that could be done, has been pilloried for it, but still plowed on, and even now, won’t surrender. Her pragmatism and resilience — along with remarkably good cheer in public — are a wonder to behold. I guess May’s feminism, like Thatcher’s, requires no labeling.There are three core options in front of the U.K. with May’s compromise: a no-deal Brexit, with huge economic trauma; Theresa May’s deal for a soft Brexit, which would unfold over the next few years; and calling the whole thing off and remaining in the E.U. after all. A while back now, I predicted that May would get the kind of Brexit that someone who didn’t really believe in it wanted (May voted to stay in the E.U., after all). This deal largely confirms that. Yes, the U.K. will leave the E.U. next March. But the agreement May has come up with keeps a great deal of Britain’s trading relationship with the E.U. intact (the U.K. remains in the customs union and partly stays in what’s called the single market); the border in Ireland is kept open (to be figured out at some later date); and in a few respects Britain is still subject to some rulings of the European Court. So you have the letter of Brexit but none of the spirit.As such, it pleases almost no one. The leave camp regards it as a betrayal, turning the U.K. into a vassal state, because it is subject to rules it has no say over. The remain camp gets no second referendum and says good-bye to the E.U. forever. And what, therefore, are the chances that Parliament will approve it next month? Who knows? Right now, the deal seems dead on arrival. There are at least 80 Conservative members of Parliament who will vote against it; almost all the Labour Party will oppose; May’s coalition partners — the Northern Irish Democratic Union Party — have already denounced it. The Guardian suggests the vote would be 415-228 against the deal. I can’t see a scenario right now where she can get even a tiny majority.The consequences of such a defeat would surely be the end of May’s tenure in No. 10 — but other than that, who knows? We could have an early election, which Labour could win, and then we’d have another negotiation; there could possibly be an extension of Article 50 to give everyone more time; there could be a second referendum; or Britain could simply crash out of the E.U., with all the economic chaos that would unleash (and not just on Britain).Of all these options, a second referendum based on the three choices — leave entirely, remain entirely, or take May’s deal — might be the least worst for a critical number. But the trouble with a second referendum is that the first one was described as a once-and-for-all decision, and reneging on that would be a violation of a core democratic principle. More to the point, the fury of the leave faction would poison British politics even more deeply than it already is. “It’s a stitch-up!” the Brexiteers will exclaim. And the populist revolt against the elites could deepen and destabilize the country.So we are where we are. If I had to predict, I’d bet on a no-deal Brexit. There simply isn’t a majority for anything else, and it’s the default option. And May, for all her resilience, cannot survive that.Amazon’s Wasted OpportunityI was in Crystal City — I’m sorry, I mean National Landing — a week ago. What a gray, dreary, soul-sapping, concrete maze of boring low-slung office buildings, chain stores, and malls. Think of the architecture of your average multistory parking lot in an airport, and remove any trace of character. Bingo! Despite Crystal City’s name, there appears to be little meth around, although, given the environment, I can see why it might be a temptation. The place has two Marriotts and three Hiltons, although you’d be hard-pressed to tell any of them apart. It’s also quite densely built, and I have yet to see actual plans for remaking it into something airy or spacious or beautiful. And it would surely need a massive makeover to appeal to the woke, wealthy, and whiny iGen-ers to move in.And on top of the indefensible bribes from taxpayers, it’s also, it seems to me, a symbol of how corporate America has largely seceded from concerning itself with the political and social health of America as a whole. I mean: Why did Amazon pick two urban, coastal, liberal, already established enclaves … rather than somewhere in the heartland which desperately needs the kind of economic and social boost the new Amazon HQ would provide?Yes, I know the urban coasts are where the future nerds and business whizzes want to live (and increasingly do). But that’s part of our problem, is it not? We’re geographically sorting — and the left-behinds are getting more left behind in the middle of the country. And if there’s something we really don’t need in D.C. right now is more of the cognitive elite! The place is crawling with irritating young white people who go to CrossFit, ride those creepy scooters, and never look up from their phones. A company like Amazon could actually have had the clout to bring those types back to the heartland and do some small thing to rebalance the country. Wages would be effectively higher given the lower cost of housing. The millennial migrants could even help turn Texas blue! The cultural shift and economic boost might even lure a few opioid users toward an ounce of hope and a middle-class salary in Indiana or Ohio or West Virginia.This matters. As the country becomes increasingly culturally, economically, and socially bifurcated, we need responsible corporate actors to help bridge this gap. Amazon — one of the most trusted brands in America — is perfectly poised to pull this off. Its decisions could be a critical help in keeping this country from the kind of yawning divisions and vast inequalities which are fast hardening into permanent social chasms.For Amazon to double down on the red-blue divide instead, and place all its bets on the blue, is a sign, it seems to me, that the elites have really learned little from the last couple of decades. We are one nation in the end — a nation that is not simply a GDP statistic, but a place and a home that requires responsibility for the whole. Amazon had an opportunity to display that sense of patriotism this week. And they blew it.See you next Friday.First responders have brought thousands of pets rescued from the Camp fire to California animal shelters (including many that suffered burns) — but this dog is still with his personStacey Abrams’s plan to fight for Georgia’s democracy in courtAbrams said the [new federal] lawsuit, which will fall under the umbrella of a new organization called Fair Fight Georgia, will look toward improving the state’s election system prior to municipal elections in 2019 and the 2020 presidential election. Fair Fight may also push for legislative changes at the Capitol, and Abrams said it will hold the state accountable for running elections fairly.“We have to consider all the pieces that go into voter suppression and diminishing the ability of voters to cast their ballots,” she said. “And that means looking at the staffing and sourcing of polling stations, making sure that there are an adequate number of machines, making certain that poll workers who are often volunteers aren’t judging whether or not someone gets to vote based on how many pieces of paper they have left.”As for whether she will challenge U.S. Sen. David Perdue in 2020 or seek another bid for governor in four years, Abrams is mum. But she is confident her legal challenges will help continue to expand Georgia’s electorate.“We know that over the next two years there will be new people who will find themselves energized by politics,” she said. “And I think what we can do in 2020 is absolutely complete the transformation that started this year. It won’t only be at the top of the ticket, but also down the ticket.”Newly discovered emails link pro-Brexit campaign with Cambridge Analytica, Steve Bannon, and the Mercer familyThe possibility that both Brexit and the Trump campaign simultaneously relied upon the same social-media company and its transgressive tactics, as well as some of the same advisers, to further far-right nationalist campaigns, set off alarm bells on both sides of the Atlantic. Damian Collins, a member of Parliament, and chair of its Digital, Culture, Media and Sport Committee, which held an inquiry into fake news, told the Observer, which has broken much of the news about Cambridge Analytica in the U.K., that the new e-mails “suggest that the role of Bannon and Mercer is far deeper and more complex than we realised. There’s a big question about whether Mercer’s money was used in the Brexit campaign and it absolutely underscores why Britain needs a proper Mueller-style investigation. There are direct links between the political movements behind Brexit and Trump. We’ve got to recognise the bigger picture here. This is being coordinated across national borders by very wealthy people in a way we haven’t seen before.”The American investigations into foreign interference in Trump’s election, and British probes into Brexit, have increasingly become interwoven. The role of the Russian Ambassador to the U.K., Alexander Yakovenko, has reportedly been the subject of interest both to Mueller’s investigators and to those in the U.K., who have examined his relationship to Banks. The role of Nigel Farage, the former leader of the far-right, Euroskeptic U.K. Independence Party, who has been an ally of Bannon and Trump, has also reportedly stirred the interest of investigators in both countries, especially after he was spotted in 2017 leaving the Ecuadorian Embassy in London, in which Julian Assange has taken refuge. Assange’s media platform, WikiLeaks, published many of the e-mails stolen by Russia from the Hillary Clinton campaign during the 2016 election season.How and whether all of these pieces fit together is the subject of Mueller’s investigation, but the lack of a similar single, overarching investigation in the U.K. has led critics to call for one.Reminder: Forest floor raking or not, last summer was really bad for wildfires in EuropeThroughout the Northern Hemisphere this summer, heat waves have been shattering records and sustaining wildfires of unprecedented fury. In Greece [on July 24th], ninety-one people died in a hellish fire—Europe’s deadliest since 1900—that broke out eighteen miles east of Athens and, powered by unusually dry vegetation and strong winds, blazed across a resort town on the Aegean Sea. On July 17th, in Sodankylä, Finland, more than fifty miles north of the Arctic Circle, the thermometer read a previously unseen ninety degrees; in Sweden, wildfires swept across Lapland; in Norway, there have been three times more wildfires this summer than normal. In much of Germany, drought conditions have persisted since May, the Rhine [was] dangerously low, and authorities in the city of Potsdam, outside Berlin, were afraid [in late July] that a wildfire burning around the nearby small town of Fichtenwalde would set off Second World War–era ammunition that remains buried in the area’s forest and meadows.The link between the California fires and the changing climateFinns seize long-awaited opportunity to debunk/dunk on President Trump over his raking comment@Akihheikkinen:“Finland has ~73% forest coverage = 222,180 square kilometers of forests (world bank study). Our forests are densest in the world, averaging 72,000 trees in sq km. That’s 22 billion trees or 4,500 for every Finn (yale university study). Please send help. Must bring own rakes.”@Mallahadley:“I grew up in Finland. a) it rains all year round. b) we have a lengthy and cold winter. c) Finland is a sparsely populated country with just over 5mil ppl, with land size ~3/4 of CA and most of it forests and lakes. d) no friggin body is raking the forests.”@Lahavu:“We have had pretty much the warmest year ever. It has been +5-7C here in the east this week. The summer was one of the driest and hottest ever and that’s why we had quite many fires. On an average year fires are a non-issue. I didn’t complain about the heat myself (I love warm weather). It’s just that it tells you how climate change is changes our climate and that is certainly not good.”NSC member in charge of U.S. Saudi policy has resignedThe official, Kirsten Fontenrose, had pushed for tough measures against the Saudi government, and had been in Riyadh to discuss a raft of sanctions that the American government imposed in recent days against those identified as responsible for the killing, according to two people familiar with the conversations. Specifically, she advocated that Saud al-Qahtani, a top adviser to Crown Prince Mohammed bin Salman, be added to the list, and he ultimately was.The exact circumstances of her departure are murky, and it is unclear whether her advocacy for a hawkish response to the killing angered some in the White House. When she returned to Washington, according to the two people, she had a dispute with her bosses at the National Security Council, where she had served as the director for the Persian Gulf region.The unknown long-term harm of inhaling wildfire smokeMost research has focused on how smoke exposure affects firefighters or how air pollution, not wildfire smoke specifically, affects people’s health. Many large studies have linked air pollution to heart and lung diseases; one 2012 study found that pregnant women who were exposed to smoke during the 2003 wildfires in Southern California delivered babies with slightly lower birth weight than normal. …There are similarities between particles found in air pollution from fossil fuels and those found in wildfire smoke. Both contain toxic particles that are invisible to the naked eye that can penetrate into lung tissue and get into the bloodstream. These particles are 2.5 micrometers in size — about one-fortieth the width of a strand of hair. There are also differences, though, that scientists don’t fully understand.When residential areas burn, they release chemicals into the atmosphere that aren’t emitted when wooded or grassy areas burn. Plastics, household cleaning products, metals from vaporized stoves and washing machines, and synthetic materials from carpets add to poor air conditions. Researchers don’t know what kind of long-term health conditions could be caused or exacerbated by exposure to these compounds.Stranded in Chico’s “Wallywood” and other places of refuge for Camp fire evacueesHundreds of evacuees are squatting at camp in a Walmart parking lot — a ramshackle village some inhabitants call Wallywood, a sardonic mash-up of their location and reduced circumstances. …“Big picture, we have 6,000, possibly 7,000 households who have been displaced and who realistically don’t stand a chance of finding housing again in Butte County,” county housing official Mayer said. “I don’t even know if these households can be absorbed in California.”The county has the capacity to place 800 to 1,000 households in permanent housing, Mayer said. Housing was already scarce in Butte County before the Camp Fire. The housing vacancy rate was less than 2 percent, which “is considered a crisis state,” Mayer said. Unlike wealthier Sonoma County, where fires destroyed thousands of homes last year, many residents of Paradise don’t have the financial means to rebuild their homes quickly.Closing in on the biggest midterm (popular vote) wave in three decadesAssuming [the Democrats’ national lead in House votes] gets up into the ~8.5[%] range, Democrats are also on track to have the largest House popular vote margin by either party in a midterm since 1986, when they it by 9.9 points. D’s did win it by 10.6 points in 2008, but that was a presidential year.Andrew Gillum concedes Florida governor’s race, againWaiting for the president to passTrump visiting what’s left of ParadiseHe also promised to put $500 million “in the farm bill for management and maintenance of forests”Make America Rake AgainWe’re all committed — I’m committed to make sure that we’ve got all of this cleaned out, and protected. Gotta take care of the floors, you know, the floors of the forest. It’s very important. You look at other countries where they do it differently, and, it’s a whole different story. I was with the president of Finland, and he said, “We have a, much different — we’re a forest nation.” He called it “a forest nation.” And they spent a lot of time on raking and cleaning and doing things, and they don’t have any problem. And when it is, it’s a very small problem. So, uh, I know everybody’s looking at that. To that end. And it’s gonna work out. It’s gonna work out well.The Bystander in Chief[S]hortly after becoming commander in chief, President Trump asked so few questions in a briefing at MacDill Air Force Base in Tampa, Fla., that top military commanders cut the number of prepared PowerPoint slides to three — they had initially planned 18 — said two officials with knowledge of the visit. The commanders had slotted two hours for the meeting, but it lasted less than one.Rhetorically, Mr. Trump has embraced the United States’ 1.3 million active-duty troops as “my military” and “my generals” and has posted on Twitter that under his leadership, the American armed forces will be “the finest that our Country has ever had.” But top Defense Department officials say that Mr. Trump has not fully grasped the role of the troops he commands, nor the responsibility that he has to lead them and protect them from politics.“There was the belief that over time, he would better understand, but I don’t know that that’s the case,” said Col. David Lapan, a retired Marine who served in the Trump administration in 2017 as a spokesman for the Department of Homeland Security. “I don’t think that he understands the proper use and role of the military and what we can, and can’t, do.”MeanwhileTranslation: “We still want to believe the Saudis”“While Facebook surely does exhibit liberal bias in some ways, they have also dramatically — and, in the end, devastatingly — overcorrected for that bias.”Facebook didn’t tiptoe to avoid poking the bear on the left. They went right up to the bear and stabbed it repeatedly. And then goaded the right’s bear to join in the stabbing.The power of leftist outrage mobs has been well-discussed. The power of conservative outrage mobs to affect corporate and political policy, even from left-leaning organizations, is arguably less acknowledged.In no small part to placate the right, the liberal company Facebook misled the nation again and again about the nature of Russian interference in the election. They repeatedly fed right wing conspiracies while waving away criticism from the left. It’s hard to see how an ardently Trumpist company could do much better.Historians claim 2018 is not the worst year to be aliveAsk medieval historian Michael McCormick what year was the worst to be alive, and he’s got an answer: “536.” Not 1349, when the Black Death wiped out half of Europe. Not 1918, when the flu killed 50 million to 100 million people, mostly young adults. But 536. In Europe, “It was the beginning of one of the worst periods to be alive, if not the worst year,” says McCormick, a historian and archaeologist who chairs the Harvard University Initiative for the Science of the Human Past.A mysterious fog plunged Europe, the Middle East, and parts of Asia into darkness, day and night—for 18 months. “For the sun gave forth its light without brightness, like the moon, during the whole year,” wrote Byzantine historian Procopius. Temperatures in the summer of 536 fell 1.5°C to 2.5°C, initiating the coldest decade in the past 2300 years. Snow fell that summer in China; crops failed; people starved. The Irish chronicles record “a failure of bread from the years 536–539.” Then, in 541, bubonic plague struck the Roman port of Pelusium, in Egypt. What came to be called the Plague of Justinian spread rapidly, wiping out one-third to one-half of the population of the eastern Roman Empire and hastening its collapse, McCormick says.A television viewer who does not understand forests, science, firefighting, or management continues to share his opinions about the use of forest management in fire preventionPresident Trump, to Fox News in a new interview:“I was watching the firemen the other day, and they were raking areas — they were raking areas. When the fire is right over there and they are raking trees, little trees like this, that are, not trees — little bushes. That you could see are totally dry. Weeds. And they are raking them — they are on fire. That should have been all raked out — you wouldn’t have the fires. … Maybe [climate change] contributes a little bit. The big problem we have is management. … You need forest management. I’m not saying that in a negative way, a positive — I’m just saying the facts.”And to reporters before heading to California on Saturday to have a firsthand look at the wildfire crisis:“[California officials and I] will be talking about forest management. I’ve been saying that for a long time. It should have been a lot different situation. But the one thing is that everybody now knows that this is what we have to be doing, and there’s no question about it. It should have been done many years ago. But I think everybody’s on the right side. It’s a big issue, it’s a big issue, a very expensive issue, but very, very inexpensive when you compare it to even one of these horrible fires. And we’ll save a lot of lives.”The logging industry stands with Trump, per the Washington Times:“There is truth to statements he has made,” said Daniel Dructor, executive vice president of the American Loggers Council, a coalition of state and regional associations that represents independent contract loggers. “It’s time to rise above political posturing and recognize that active forest management — including logging, thinning, grazing and controlled burning — are tools that can and must be used to reduce fire risks and help mitigate the impacts to landscapes,” Mr. Dructor said in a statement.Pesky science, via the AP:One reason that scientists know that management isn’t to blame is that some areas now burning had fires in 2005 and 2008, so they aren’t “fuel-choked closed-canopy forests,” [Utah fire scientist Philip] Dennison said. In those earlier fires, Paradise was threatened but escaped major damage, he said. In the current blazes, it was virtually destroyed.The other major fire, in Southern California, burned through shrub land, not forest, Dennison said. “It’s not about forest management. These aren’t forests,” he said.The dean of the University of Michigan’s environmental school, Jonathan Overpeck, said Western fires are getting bigger and more severe. He said it “is much less due to bad management and is instead the result of our baking of our forests, woodlands and grasslands with ever-worsening climate change.”The socioeconomics of saving your home from wildfires[T]he fire department’s capacity crunch in the face of devastating and erratic fires has showcased a growing social divide. In areas where some residents felt the need to put their lives on the line, celebrities and affluent homeowners filled the gap with private firefighters to protect their mansions from burning.In an article published last spring, NBC highlighted that the insurance giant AIG offers wealthy homeowners access to their Wildfire Protection Unit, certified through authorities to respond to fires that threaten million-dollar homes.TMZ reported this week that Kim Kardashian and Kanye West hired private firefighters to protect their $50m mansion in the hills of Calabasas. It narrowly survived the fire, but critics began wondering if the destruction-fueled “new normal” meant the affluent, yet again, could save themselves while others suffered.Designer districtsPartisan gerrymandering has been carried out by both Democrats and Republicans throughout U.S. history. But an Associated Press statistical analysis based on 2016 election data found that more states had Republican-tilted districts than Democratic ones. Some of the largest GOP congressional advantages were in North Carolina and Pennsylvania, where Republicans fully controlled redistricting after the 2010 Census. One of the Democrats’ biggest edges was in Maryland, where they were in charge of the last redistricting.A follow-up AP analysis using preliminary 2018 election data shows the Republican statistical edge was cut in half under Pennsylvania’s new court-ordered congressional map but grew even larger in North Carolina.Though an increasing number of states have adopted independent commissions, many states still rely on lawmakers and governors to draw legislative and congressional districts. Republicans controlled that process in far more states than Democrats because of their electoral success nationwide in 2010. Those maps were in place for the Nov. 6 elections, except in places where courts ordered them redrawn, and will be again in 2020.Florida, the jammed paperclip perpetually short circuiting America’s democracyIn one of the most serious cases, Palm Beach County found “dozens of precincts missing a significant number” of votes during the machine recount, according to the supervisor of elections, Susan Bucher, causing the county to conclude that entire boxes of ballots may not have been counted.Ms. Bucher blamed an overheated and outdated ballot-scanning machine. But the manufacturer of the high-speed scanner used in Palm Beach said its technicians had witnessed Palm Beach County elections workers, apparently worried that one of the machines was running too fast, jam a paper clip into the scanner’s “enter” button in an effort to slow it down. That, in turn, caused a short circuit that cut off the power, a company spokeswoman said.The president who is permanently “at odds” with the conclusions of his nation’s intelligence community (and yes, he has been briefed on this)[T]he CIA [has] assessed with high confidence that the Saudi leader [Mohammed bin Salman] ordered the killing [of journalist Jamal Khashoggi], based on multiple sources of intelligence. “We haven’t been briefed yet. The CIA will be speaking to me today,” Trump told reporters on the South Lawn of the White House before leaving to survey damage from wildfires in California. But the president has already been shown evidence of the prince’s alleged involvement in the killing, and privately he remains skeptical, Trump aides said. He has also looked for ways to avoid pinning the blame on Mohammed, the aides said. The president’s most recent comments put him at odds with the findings of the CIA and senior intelligence officials. “It’s dead.”When the vote-counting is finished, the GOP may not even have enough lawmakers in California’s 53-member House delegation to field a nine-person softball team.“It’s dead,” Mike Madrid, a former political director of the California Republican Party, said of the state GOP. “It exists in small regional pockets, where there are enough white, non-college-educated working-class communities for there to be a Republican Party. But that’s not much.”Other states tilt lopsidedly in favor of one party or the other. But never before has a state with California’s huge populous and enormous import — socially, culturally, economically — been so dominated by a single political party. The implications will take years to fully comprehend.Analysis from our own California politics mavenAnd in urban areas and Western states, minorities make up the majority of their generation, according to PewDon’t miss the major political implications of this [Pew study]: 48% of Post-Millennials (now aged 6 to 21) are members of racial or ethnic minorities–far above the 39% in the Millennial generation (which itself was the prior record-holder). They are just starting to join the electorate..The better educated, more diverse generation to comeA new Pew Research Center analysis of Census Bureau data finds that the “post-Millennial” generation is already the most racially and ethnically diverse generation, as a bare majority of 6- to 21-year-olds (52%) are non-Hispanic whites. And while most are still pursuing their K-12 education, the oldest post-Millennials are enrolling in college at a significantly higher rate than Millennials were at a comparable age.The parents of post-Millennials are more well educated than the parents of Millennials and those of previous generations, and this pattern most likely contributes to the relative affluence of the households in which post-Millennials live. … The high school dropout rate for the oldest post-Millennials (ages 18 to 20 in 2017) is significantly lower than that of similarly aged Millennials in 2002. And among those who were no longer in high school in 2017, 59% were enrolled in college – higher than the enrollment rate for 18- to 20-year-old Millennials in 2002 (53%) and Gen Xers in 1986 (44%).The changing patterns in educational attainment are driven in part by the shifting origins of young Hispanics. Post-Millennial Hispanics are less likely than Millennial Hispanics to be immigrants – 12% of post-Millennial Hispanics were born outside the U.S., compared with 24% of Millennial Hispanics in 2002. Previous research has shown that second-generation Hispanic youth tend to go further in school than foreign-born Hispanic youth. That is borne out in this analysis, as 61% of second-generation Hispanics ages 18 to 20 who were no longer in high school were enrolled in college in 2017, compared with 40% of their foreign-born counterparts.The hazardous air quality in northern California is not expected to improve until the middle of next week at the earliestThere have been widespread school and university closures. Many businesses have urged employees to work from home. Some public transit in San Francisco has been made free, in an effort to keep people inside as much as possible if they must commute. In a region whose weather is usually pretty temperate, smoke days have become the Bay Area’s version of snow days. But instead of a joyful respite from work, wildfire smoke mixes a blizzard’s large-scale logistical nightmares with the anxiety of worsening climate change and a class divide that plagues American public health. Three of the five largest fires on record in California have occurred in the past three years, all in the northern part of the state. For the region’s residents, smoke days won’t go away once the Camp Fire is contained.The risk posed by wildfire smoke is significant, and it goes far beyond a few days of coughing or headaches. According to Kristie Ebie, a professor of global public health at the University of Washington, the consequences of breathing wildfire smoke extend to other parts of the body because of the noxious nature of the tiny debris the smoke carries with it. “That affects not only people’s lungs, but it gets absorbed into people’s systems,” she says. Recent research shows that absorption can lead to cardiac arrest, stroke, and other deadly outcomes.With kids home from school, people working from home, and few safe ways to leave the house, Northern Californians are looking for any outlet available to find some relief.The ongoing search for remainsAs many as 7,000 households have been displaced by the Camp fire in Butte County , CaliforniaCamp fire missing persons list now over 1,000, confirmed death toll up to 71Searchers combing through the ruins of the deadliest wildfire in California history found eight more bodies Friday, bringing the number of dead in the Camp Fire to 71 as more than 1,000 people remained unaccounted for.Seven of the eight bodies were found in the town of Paradise, which was all but destroyed in the fire that broke out Nov. 8, and the other was in Magalia, north of Paradise, said Butte County Sheriff-Coroner Kory L. Honea said. All were found inside structures.Honea cautioned that the number of unaccounted for — 1,011 as of Friday night — could include names that are duplicates or have different spelling variations, and that investigators were working to verify them. …The Camp Fire has displaced thousands of people and led to the evacuation of some 52,000 at the fire’s peak. About 47,200 remained evacuated Friday, officials said. The fire has burned 146,000 acres and was 50 percent contained Friday. … [It] has destroyed at least 9,700 single-family residences, 144 multi-family residences and 336 commercial buildings, according to Cal Fire."}