{"id": "What Are the Best Silk Pajamas for Women?", "paragraph": "\n                    Welcome to Sleep Week, which we’re devoting to all the things that help us get better shut-eye. We’re talking to experts and testing products ourselves to get those precious eight hours a night.\n                  \n                            Welcome to Sleep Week, which we’re devoting to all the things that help us get better shut-eye. We’re talking to experts and testing products ourselves to get those precious eight hours a night.\n                          There’s something so glamorous — and comfortable — about the idea of slipping into silk just to go to bed. But for most people, an old T-shirt and ratty (but beloved) soft pants do the job of pajamas just fine, and venturing into the world of matching silk sets can be intimidating. To help you dip your toes into what is definitely a luxury market, we spoke to lingerie experts, boutique owners, and all-around stylish women about their favorites.Gabriella Pelletier, buyer at Lisa Says Gah, loves the silk sleepwear from the Sleeper, a new brand based in Kiev, Ukraine. “They are so whimsical and aspirational yet also extremely practical as separates in daily life when you’re not dreaming,” says Pelletier. “Sleeper provides ultrafeminine cuts with practicality if you decide to pair your silk pajama shirt with your favorite pair of vintage Levi’s and a blazer.”Try this highly rated, 100 percent silk set available on Amazon in “barely pink” for a similar vibe and a fraction of the price.Pelletier also recommends Sleeper’s nightgowns: “They can double as everyday casual dresses with a chunky cardigan and an ankle boot.”According to Cora Harrington of the Lingerie Addict, “U.K. luxury loungewear label Violent & Wren creates some of the best prints, and their silk is incredibly lush — plush, sumptuous, and soft to the touch — just like what you’d expect from silk PJs.” Julie McConnell, senior buyer at Journelle, agrees: “When you can’t travel someplace warm, these tropical PJs are the next best thing.”Equally as swingy — and just a tad less loud — are these charmeuse silk pants we’d love to slip on to spend a snowy weekend curled up with a good book.According to industry expert Ellen Lewis of Lingerie Briefs, British brands are making some of her favorite silk sleepwear: “I think the British acumen with print and their expertise in tailoring set them apart, particularly in the luxury market. I love the kitschy British vibe.” In addition to Violet and Wren, Lewis likes Asceno for its use of classic stripes and geometrics. McConnell is also a fan of Asceno’s menswear-inspired pieces.Andy Spade’s sleepwear line Sleepy Jones is a Strategist favorite (having been recommended by the likes of Karlie Kloss, writer Hermione Hoby, and designer Casey Larkin Blond of Mr. Larkin), and their silk offerings are just as cozy. Try (another) menswear-inspired top that can do double duty as a regular shirt.Or this short-sleeved number that’s over 50 percent off.If you’ve seen Julian Schnabel around town sporting PJs, chances are he’s wearing Olatz, which happens to be his ex-wife Olatz López Garmendia’s  brand. You, too, can cop his look, as these silk pajamas are truly unisex.Another British favorite of Lewis’s is Olivia von Halle for the brand’s “larger- than-life chic motifs.” This chartreuse set printed with tigers certainly makes a statement.For something a bit more understated (and affordable), try this sweet floral-printed set from Macy’s.Natori’s floral PJ set seems like a steal at $90.Owner of Minneapolis-based boutique Mille Michelle LeBlanc loves the silk PJs from the Glad Hours: “I love their 1920s inspired take on classic silk pajamas. The wide-leg pant and acid hue feels extra chic.” This oversize set is made from 100 percent crepe de chine silk.“The one element I find emerging of great interest is washed silk,” says Lewis. “Of note here is Lunya, an American sleepwear brand that develops its own fabrics, including a silk that’s machine washable. Ever consider wearing a silk jumpsuit to bed?This dotted one-piece hardly looks like sleepwear.Lewis also recommends Italian brand F.R.S. For Restless Sleepers for its innovative shapes and prints: “One questions if these designs are silk sculpture.”We love the stripes on this Art Deco-inspired silk robe by Morgan Lane that’s a fraction of the price.Another brand that Lewis likes is Canadian company Christine Lingerie. “These are classic cuts, again in extraordinary prints as well as solids,” she says. Here’s an elegant robe that will never go out of style.For something a little more affordable, Lewis recommends Australian company Ginia. This sweet lace-trimmed cami, paired with a leather moto jacket, would work outside of the bedroom as well.This flirty camisole-and-tap-short set (sold separately) is 60 percent off.Lewis also likes Skin for its silk offerings. This midi-length chemise can just as easily be worn to bed or out.Cindy Kahng, owner of the East Village boutique Azaleas, loves this vintage-inspired washed georgette-silk slip from Araks that’s great for “indoor sports as well as pairing with an oversized cardigan for a night on the town.” The delicate pin tucks make all the difference.Khang is also a fan of the silk sleepwear from Maison Du Jour. This crepe de chine top is over half off.Pair with these sporty shorts, also on sale.The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}