{"id": "The 7 Best Books for Understanding Sleep", "paragraph": "\n                    Welcome to Sleep Week, which we’re devoting to all the things that help us get better shut-eye. We’re talking to experts and testing products ourselves to get those precious eight hours a night.\n                  \n                            Welcome to Sleep Week, which we’re devoting to all the things that help us get better shut-eye. We’re talking to experts and testing products ourselves to get those precious eight hours a night.\n                          It’s likely you’re not getting much sleep. Twenty percent of Americans have a sleep disorder (one in four people are afflicted with insomnia; 22 million have sleep apnea), and the average non-disordered sleeper is only getting 6.8 hours a night, which we all know by now is not enough. The situation is dire enough that sleep disorders were declared an actual public health epidemic in 2016.But, as they (who, I don’t know) say, the more you know, the less you fear. So we polled 14 doctors, scientists, and authors on the books they recommend for demystifying the most mysterious 6.8 hours of the day. The Reading List includes writing on sleep disorders, sleeplessness in children, and sleep in general. Though it’s a large field, every single one of our picks were recommended by at least two experts.Four of our experts recommended Why We Sleep by Matthew Walker, the director of UC Berkeley’s Sleep and Neuroimaging Lab, making it the top suggestion on this list. The book answers important and often-asked questions about sleep (how do caffeine and alcohol affect how much we get? What happens during REM? How do common sleep aids affect us, and can they do long term damage?) with easy-to-read scientific evidence.“I recommend Walker’s new international best seller to all of my friends and family curious about sleep,” says Dr. Jordan Stern, founder of the BlueSleep clinic. “It’s a page-turner that simply explains what sleep is, why we need it, and what happens in our brain when we sleep and dream.” Dr. Michelle Zeidler, a professor of clinical medicine at the David Geffen School of Medicine, agreed. “It’s an in-depth look,” she said, “at the effects sleep has on cognition, immune function, and metabolism.” Dr. Philip Gehrman, an associate professor of clinical psychology at UPenn, and Dr. Rebecca Robbins, of NYU Langone Health, also recommended it. “The best thing is how easy it is read,” says Robbins.Two of our experts recommended The Promise of Sleep: A Pioneer in Sleep Medicine Explores the Vital Connection Between Health, Happiness, and a Good Night’s Sleep. This title explores the price we’ve paid for ignoring sleep: an epidemic of heart disease, 33 percent of traffic-fatigue-related accidents, and mental and psychological disadvantages. He also includes self-tests to help readers determine how much sleep they really need. “The author, William Dement, is like the Godfather of sleep medicine,” says Dr. Jinyoung Kim, an assistant professor at the University of Pennsylvania. “This book had a major impact on my decision to study sleep patterns in humans,” said Dr. Maja Bucan, a Professor at the Perelman School of Medicine. “Dement explains why sleep problems are linked to many medical conditions, and what those conditions are.”“Insomnia is tough to deal with,” says Stern, “and becoming much more prevalent thanks (not) to social media and electronic devices.” To better understand it, two of our experts recommended The Sleep Solution: Why Your Sleep Is Broken and How to Fix It, by W. Chris Winters. This book bills itself as a guide for anyone looking to achieve healthy sleep without pills, pain, or fatigue. It’s about how sleep works (and the ways food, light, and computers hinder the process), why sleeping pills are often used incorrectly, and helps readers understand the different ways they can tackle insomnia, sleep apnea, and even restless leg syndrome. Kutscher agrees with Stern on this recommendation: “Dr. Winter is among the most unique voices in sleep medicine, and his ability to engage his patients in order to make tangible improvements to their sleep comes through successfully in his writing as well.”This book, recommended by two of our experts (Zeidler and Kutscher), takes readers through a six-week, drug-free program based in cognitive-behavior therapy and developed at Harvard Medical School. The program has been shown to improve sleep in the long term in 80 percent of patients, making it, as Jacobs says, the “gold standard for sleep treatment.”The updated edition of the all-time best-selling book on children’s sleep problems came at the recommendation of two experts. “That book is the gold standard for helping children sleep,” says Stern. “It’s all about behavior, especially the behavior of the parents. This how-to guide is required reading for all parents with small children.” Zeidler agreed: “I read it cover to cover when my kids were small.”“There are many, many books available to parents struggling to help their young children get a good night’s sleep,” says Christopher Cielo, attending pulmonologist in the Division of Pulmonary Medicine at Children’s Hospital of Philadelphia. “But this evidence-based, easy-to-read book by one of the leading experts in behavioral sleep disorders in children has saved countless sleepless nights for innumerable patients, colleagues, and friends.” Mary Carskadon, a sleep researcher at Brown University, and Dr. Sigrid Veasey of the University of Pennsylvania, both agreed. “It’s delightful,” said Carskadon.And for a bit of comedic reprieve: “This is therapy for the parents,” says Zeidler. “When my kids were little, I read this and laughed so hard I cried.” “This is a bedtime book, not a sleep science book,” said Gehrman. “But it’s hysterical, so I included it anyhow.”The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}