{"id": "The Best Stemless Wine Glasses, According to Restaurant Owners and Frequent Party Hosts", "paragraph": "Stemless wine glasses can be divisive: “I think elitists still believe it is somewhat gauche to carry stemless glasses versus ‘proper’ wine glasses in a restaurant,” says Zach Jones, wine director at Chicago restaurant Pacific Standard Time. “That’s kind of a silly way to think, but it is true that, at least in a restaurant, stemmed wine glasses are easier to store and transport because they can be hung upside down.” But then, the opposite is true for klutzy people at home with small kitchens: “When shelf space is limited, they’re a real lifesaver, without having to deal with giant racks or having to make space for tall glassware,” says Roman Tartakovsky, beverage manager at Hudson’s in New York. Plus, as many experts pointed out: a stemless wine glass works equally well for Aperol spritzs, Sangria, a nightcap of something brown, or even just water. So as a way to praise the stemless wine glass, here are over a dozen wine experts, restaurant owners, beverage directors, and frequent party hosts who’ve chosen their favorites.Austrian glassware company Riedel, which has been around since 1756, is the perennial favorite wine glass, but its “O” series of stemless glasses — around half of the pros interviewed for this story raved about them — didn’t come about until 2004. Introduced initially as tumbler glasses, this particular style is technically intended for Cabernet and Merlot red wines. Cedric Nicaise, wine director at Eleven Madison Park, likes these because there are relatively few compromises compared to a traditional stemmed style. “It still provides great aromatics and the glass is very thin, so smelling and drinking wine are great experiences,” Nicaise says. (Although he warns about using them for cocktails: “the glass is delicate, so be careful when putting in ice.”)Tartakovsky’s favorite Riedel stemless style is the curvaceous, undulating silhouette of the Swirl, because of its “unique shape for swirling the wine,” he says.Vanessa von Bismarck, co-founder and partner of PR firm BPCM, is a self-described traditionalist when it comes to wine glasses, usually opting for stemmed styles, but she’s also a fan of the wide, ultra-rounded Pinot/Nebbiolo style in the O series. “The shape and the hand feel is more comforting than the more traditional long-stem wine glass,” she says. Von Bismarck also likes to serve white wine or gin and tonics in stemless glassware when she’s entertaining at home.“What makes a great glass is similar to what makes a great wine: you like how it feels; for a wine, when drinking it, for a glass, when it’s in your hand,” explains Andrew Bell, wine director and sommelier at Playboy Club New York, who likes Riedel but also recommends the Aero style from Luigi Bormioli. “There is the weight of the bowl, and how the glass or crystal feels when you drink; the key in high-end glassware is the provenance of the sand, and the purer the sand, the greater the opportunity for the glass to be flawless.”Victoria James, beverage director at New York Korean steakhouse Cote, suggests this sturdy style for at-home drinking, saying they feel French. “This tumbler brings me back to brasseries and vineyards in France, where these are used for a simple casse-croûte,” she says. “The thickness of the glass allows you to grip it and not heat up the wine too much, which is an issue with thin, stemless tumblers; they are dishwasher safe, stackable, and last forever,” James says. She says to use these for a casual Tuesday-night bottle: “They’re meant to be used for everyday, glou-glou wine, something that you would gulp alongside a sandwich.”Or, opt for a slightly more squat style. “This glass is classic and elegant, while still looking modern, and it feels comfortable in your hand,” says Thom Neil, beverage director at Ribbon Midtown, opening this fall. Neil discovered the style while researching glassware and “spotted a brand I didn’t know made glasses, which piqued my interest,” he says. “The glass fits the hand nicely, with a very balanced weight, and they are sturdy enough to handle a dishwasher.”These angular glasses, intended for wine or cocktails, won’t chip or break, and have a nice, thick base. “I’ve always been a big fan of Schott Zwiesel’s products: They’re not the most inexpensive wine glasses out there, but they’re aesthetically beautiful, functional, and generally more durable than their closest competitors,” Jones says. Although there are different versions available for red or white wine, Jones suggests using these for any grape. “It’s wide enough at the base to be considered proper for Chardonnay and Pinot Noir, but the overall shape is sleek and vertical, like a Bordeaux glass, so it’s perfectly suitable for Sauvignon Blanc or rich reds like Cabernet Sauvignon or Zinfandel.”Yvette Leeper-Bueno, owner of Harlem restaurant Vinateria, only uses stemmed glasses at the restaurant, but loves these short bodega-style glasses for at-home drinking. “When I was traveling in Spain I saw them everywhere in Barcelona,” she says. “The culture of drinking there is so casual and fun,” which goes with the informality of these flat-bottomed glasses. They’re not technically perfect for wine, as they don’t let it breathe. “So anything too special might not be a good fit for these glasses,” Leeper-Bueno says. “But they are easy to hold, stackable, and super to easy to throw in the dishwasher; they are just casual and fun,” Leeper-Bueno says. [Editor’s note: These are also one size smaller than the favorite of our own deputy editor Jason Chen, who likes the slightly larger ones for wine, too.]Pottery Barn also stocks a bodega glass, which Ariel Arce, owner and restaurateur of Air’s Champagne Parlor and Tokyo Record Bar, likes for the short, stout shape, “so you can’t knock them over,” she says.Arce was tipped off to the beauty of the bodega glass by friends who went to Spain and started drinking txakolina, the sparkling white wine that comes from the Basque region. “They had a dinner party where they served wine in these glasses, and I fell in love.”Yes, there are stem-free ways to drink bubbles that aren’t a traditional flute, like this clever inverse design from MoMA. Eric Smith, co-owner of Baltimore’s Atlas Restaurant Group, keeps a couple of these in his bar cart at home. While drinking whites or sparkling wines out of most stemless glassware presents the problem of warming the drink with your body heat when sipping, that’s not an issue here: “These solve that problem in an innovative, visually stunning way that doesn’t compromise the sparkling liquid within,” he says. He also says that they’re delicate and not easy to clean, so, they don’t exactly go in the dishwasher.Govino is “the only stemless ‘glass’ I tend to use,” says Steven Grubbs, wine director at Atlanta restaurants Empire State South and Five & Ten, who uses them for “casual, rugged, and outdoor portable drinking,” he says. “I believe if you’re in a scenario where stems are too precious or dainty, then actual glass is probably a liability there, too; enter good, smart, effective plastic wine cups.” Thomas Pastuszak, wine director at the NoMad (and founder of Empire Estate, a winery in the Finger Lakes region) uses the 12-ounce ones too: “It’s a super-versatile size, great for sparkling, white, or red wine, and it also nicely fits cocktails on ice, too, like an Aperol spritz,” he says. “There’s also a really convenient dimple on the bottom and side of the glass, for an even more stable grip.”Andy Maturana, chef and owner of RAPT, an NYC-based catering company, goes through approximately 3,000 Govino stemless styles at his company’s events each year; he likes the slightly larger 16-ounce versions.“These glasses are pretty and are a no-brainer: They can’t break, and look nice on the table,” says Arce. Her earliest encounters with indestructible drinkware is quite relatable: “Plastic glassware was a big thing in college; you didn’t have to worry about breaking anything.” These days, she likes using them for outdoor parties.Philanthropist Jean Shafiroff frequently hosts dinner parties (in addition to many charity galas), and when entertaining at home, she opts for glassware that looks as fancy as possible. “I love Saint Louis wine glasses; they make whatever you are drinking look expensive,” she says. This handcrafted crystal tumbler is from the French brand that dates back to the 16th century.Or, there’s this more modern, clean-edged version that’s just slightly more affordable.Another work of art masquerading as a stemless wine glass: this gorgeous, hand-blown Murano glass style, which Jenny Vorhoff, of design studio Studio Riga, uses at home. “I have a few sets of six in various colors, and they look even more chic and collected when mixed together,” she says. “They are actually quite sturdy and feel heavy in the hand, like crystal,” Vorhoff says. Using stemless wine glasses has a subtle but important purpose when entertaining at home, as it “tells my guests that dinner is going to be relaxed, and relaxed dinners are the most fun.”The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}