{"id": "The Best Coffee Beans, According to Writers and Novelists (Who Drink a Lot of Coffee)", "paragraph": "There’s no shortage of coffee-obsessed writers. Tom Wolfe, for instance, would drink “awesome quantities” of coffee at midnight before launching into long stretches of late-night writing, while L. Frank Baum, author of The Wizard of Oz and dozens of other fantasy books, would drink four or five coffees with breakfast (all of this according to Mason Currey’s Daily Rituals). So when we started looking for the best coffee beans, we figured writers and authors would be some of the most qualified people to make recommendations — and we were not disappointed by their picks. Here, nine writers and authors on their must-have, all-time-favorite coffee beans, ranging from readily-available, grocery store beans to seasonal roasts that are hoarded for later.“My favorite brand is Café Bustelo. I’m 100 percent Colombian, so of course I’m a coffee drinker. When I was younger, I had it the Colombian way my mom made it: hot milk poured into Nescafé instant, with lots of sugar. Now, I make espresso, add a little milk, a touch of sugar, and I’m good to go.” — R.J. Palacio, author of Wonder“I have tried everything: small-batch, breeze-cooled brews from Bolinas; I brought home beans from Beirut. But after years of searching, I realized it’s been in front of me all along: Lavazza Dark Roast. You can get it at Eataly. It’s bold, and it scoops me out of my caffeine deficit and places me in the chair like the Jolly Bean Giant. I brew it in a Cuisinart machine that turned up at my house one day and hasn’t broken yet. Does the trick.” — John Freeman, writer, literary critic and editor of Freeman’s“As a writer of dark fantasy novels, I naturally drink the Green Mountain Coffee roasters’ Dark Magic coffee, an espresso-like brew that comes from my home state of Vermont and has a flavor reminiscent of dark chocolate. Its tasting notes are described as, ‘Spellbinding complexity. Deep, dark, and intense’ — qualities I love in both my cup of coffee and in my books.” — Laurie Forest, author of The Black Witch ChroniclesEditor’s Note: Forest uses a Keurig to make her coffee, but if you don’t have a single-serve coffee machine, or just prefer another brewing method, this roast of Green Mountain Coffee also comes as a bag of beans.“Coffee is one of my favorite topics. Actually, coffee is one of my favorite things. For a while I was addicted to Handsome Coffee’s Dandy Espresso, but then they got acquired by Blue Bottle, who got acquired by Nestlé. So I went on a tasting expedition. I’ve tried beans from most of the independent west coast coffee roasters, and while many of them are tasty, there is one that is my absolute favorite. It’s the Myanmar Lay Ywar single-origin beans from Portola Coffee Lab. (In a pinch, I use their Nkonge Lot 41 beans from Burundi or their Terra Incognita Espresso roast.) It’s a fairly light roast with a nice berry, lemongrass note on top of a dark cacao funk. It’s got layers of flavor and it is delicious. I’ve never tasted a coffee like it.” — Mark Haskell Smith, author and novelist, most recently of Blown“I haven’t always been a coffee drinker. In fact, I used to depend on diet sodas to fuel my writing process. It started out with one soda in the morning and that led to three by the end of the day. Encouraged (forced) by my husband to read about how potentially horrible diet sodas were for me, feet dragging, I made the switch to coffee. Peet’s Coffee’s Major Dickason’s Blend, to be specific — rich, smooth, and complex, with a very full body and a multi-layered character. While I (really) miss the bubbles, I’m now a true convert. Two cups in the morning with a dash of vanilla soy creamer and I can actually feel my brain tighten, thoughts begin to buzz, caffeine soldiers march through my body, and I’m off on a writing jag that lasts the entire day.” — Nancy Richardson Fischer, author of When Elephants Fly“Every year, October brings three of my favorite things: Halloween, candy, and Peet’s Holiday Blend coffee. To create its famous roast, Peet’s uses the best beans of the season, then layers in chocolate and just a touch of citrus. Think: the Mexican hot chocolate you drank once at a street fair and have never since forgotten. Think: a coffee aroma rich enough to get a Minnesotan like me out of bed on even our coldest days. Think: two months of coffee bliss. Tempted? Act now. January comes quickly.” — Gretchen Anthony, author of Evergreen Tidings from the Baumgartners“I get my coffee from the Algerian Coffee Store on Old Compton Street in London’s Soho because they do the best water-processed decaf Colombian, and my brain whirs too fast if too caffeinated. I also love Jamaican Blue Mountain coffee. I only tend to have one cup a day and I definitely savor it as a moment to settle down and start work.” — Elizabeth Foley, co-author of What Would Cleopatra Do?: Life Lessons From 50 of History’s Most Extraordinary Women“Every time I am in New York, I buy a bag of coffee beans from Zibetto on 6th Avenue, which is always a big hit when I bring it home.” — Markus Zusak, author of Bridge of Clay“I buy beans at Cafe Mogador and grind them and drink it at home. I think their coffee’s sweet and I jack up the sweetness by shaking some cinnamon in before I do a pour-over in a Chemex pot. Sometimes the only happy thought I have is that tomorrow, I can wake up and drink coffee.” — Eileen Myles, poet, novelist, public talker, art journalist, and author of 21 books including, most recently, evolution and Afterglow (a dog memoir)The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}