{"id": "My Mega-Portable Power Station Can Charge 11 Devices at the Same Time", "paragraph": "My first reaction to the River solar generator was skepticism. About the size and weight of a 12-pack of beer, the River claimed to be able to run 11 full-size electrical devices at the same time. Having used lots of charging products over the years, including solar backpacks, hand-crank chargers, and battery packs, I didn’t believe it. How could it outperform so much hardware that it wasn’t much bigger than?So I put it to the test. I plugged in my paper shredder, switched it on, and sent a piece of paper toward the blades. Next I connected my phone, which of course immediately began to charge, then shredded more. No drop off of function. I plugged in my MacBook, a speaker, and charged a smaller battery pack, just for good measure, and still the River’s output was completely steady.In one swoop, the EcoFlow River rendered all of the battery packs I usually bring camping obsolete. I typically lug all manner of chargers — a bunch of little guys for phones, a slightly bigger one for larger devices, plus a generator in case of a storm. But the River takes the place of all those. Once charged, it can hold its juice for a year, allowing it to charge the average phone 30 or more times, or keep a mini-fridge humming for more than ten hours. Under the right conditions, you can even fully charge it with a 50-watt solar panel in 10 to 15 hours — or just use a car’s DC battery or wall outlet, which would take six. It’s not as powerful as a gas generator, but those are noisy and can’t be used indoors (for obvious reasons).All of the River’s 11 outlets — two AC ports, four USB ports, two Type-C ports, two DC 12V ports, and a vehicle 12V output — can also be used at the same time. That means you can connect two phones, two tablets, two laptops, a small lamp, a battery pack, a projector, a speaker, and a camera all at the same time. And while you can’t use it to run power-hungry devices like a large fridge, an electric hybrid car, or a hair dryer (which actually runs above 500W), it’s about the only thing I’m ever going to need for camping or outdoor parties (and less fun stuff like blackouts and hurricane season).“It performed beyond my wildest dreams. I never once had a shortage of power. It ran my CPAP every night without fail, and it charged my cell phone. During the day, the 100-watt solar panel charged it quickly on even cloudy days, and I was able to charge other people’s cell phones during the day while keeping it 100 percent charged. The worst night, I charged two cell phones from 0 percent battery at night, and ran my CPAP for nine hours, and I still had 35 percent battery left. Most nights I still had 70 percent of the battery left in the morning.”“When I received the UPS the charge level was 100 percent and the instructions say to run the battery all the way down the first time. I plugged the refrigerator in estimating it would run for 10 minutes per hour. The battery ran the refrigerator for 19 hours before the battery reached 0 percent and started beeping. Awesome! Just what I was looking for. I plugged in the UPS to 110V and it very quickly charged up to over 50 percent. Charges very fast. Then I tested a 14-watt solar panel I have to see if the voltage was correct to charge the battery. The solar charge LED came on so I know that if I buy a bigger PowerFilm solar panel, it will work.”“Got the portable battery mainly for camping, turns out it can be used for more than that! So far so good, quite a few ports to keep all my devices charged while out for a long day. I do a lot of work on my laptop, and I prefer to do it outside. The problem is my laptop dies after a few hours, but that’s a problem of the past! I brought the charger with me to the park along with my laptop. Not only did it keep my laptop fully charged for the whole day, it also kept my phone and vape fully charged, talk about convenience on the go. Indicator showed over 83 percent after a full seven hours! Left this baby in the car to charge on the drive home, wasn’t as fast as charging with the AC input, but still did a decent job. I can see this being super useful on a road trip, charge while I drive, it doesn’t get easier than that.”The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}