{"id": "For First Act in Power, Democrats Consider Making Their Own Agenda Impossible to Pass", "paragraph": "This week, Minority Leader Nancy Pelosi unveiled a list of new procedural rules that her caucus intends to implement when the next Congress is seated. Most of these measures are unobjectionable “good government” reforms. But one of them would create a new — and all-but-insurmountable — obstacle to the passage of many of the policies that the Democratic Party claims to support.The rule, proposed by Pelosi and Massachusetts representative Richard Neal, would “require a three-fifths supermajority to raise individual income taxes on the lowest-earning 80 percent of taxpayers.”This proposal is, in effect, a progressive revision of an existing House rule: Under Paul Ryan’s leadership, the current Republican majority established a supermajority requirement to raise income taxes on anyone. Thus, Pelosi’s decision to retain the supermajority threshold on tax hikes – but restrict it to the bottom 80 percent – might look commendable on first glance. After all, in recent decades, America’s richest citizens have seen their tax rates plummet, even as their share of income gains soared – so why not take measures to restrict future tax increases to the top 20 percent of earners? A spokesman for the minority leader’s office, Henry Connelly, describes the proposal as a populist measure, aimed at repealing “a Republican rule rigged to permanently lock in the massive tax giveaways…[to] wealthiest 1 percent and big corporations,” while “affirming Democrats’ commitment to protect hard-working Americans.”Alas, there are several problems with this argument. For one thing, while progressives are committed to increasing the discretionary income of the bottom 80 percent, that does not necessarily mean keeping their tax rates frozen at historically low levels. Currently, for much of the American middle class, health-insurance premiums function as a steadily rising tax. A bill that required those households to pay a new, smaller monthly sum to the government — so as to fund a single-payer system that would actually reduce their cost of living by delivering radically cheaper health-care services — could hardly be called regressive. And the same can be said for legislation establishing universal child care, paid family leave, or any other program aimed at easing the middle class’s financial burdens by dramatically expanding the public sector’s ambitions. Equating support for middle-class families — with opposition to increasing their tax rates — is a conservative project, which Democrats have no business advancing. If the party wishes to establish structural barriers to policies that would hurt the middle class, why not require a three-fifths majority to cut Medicaid, Medicare, or Social Security?To be sure, in the present context, with Mitch McConnell leading the Senate and Donald Trump in the White House, the supermajority requirement is of no real consequence. The Republican Party is not going to sign off on middle-class tax hikes — or at least not to finance new social spending. Once procedural rules are established, however, they can be difficult to eliminate. There are plenty of Democrats in the House who don’t want to be forced to chose (publicly) between voting for higher taxes on the middle class and against a priority of the progressive base. Such lawmakers are sure to value (and thus, insist on the preservation of) a procedural obstacle that allows them to forgo voting on legislation that forces them to make such hard choices by rendering such bills impossible to pass without GOP buy-in (which is to say, impossible to pass).All this would be a bit less problematic if the Democratic Party had overcome its allergy to deficit spending (and/or accepted Modern Monetary Theory as its personal truth). But it hasn’t: In addition to forbidding tax increases on the bottom 80 percent, Pelosi has vowed to honor the “pay as you go” rule, which requires the House to fully finance any and all new government spending.Taken together, these two requirements could make Medicare for All impossible to pass out of the House. It is true that the supermajority rule is specifically worded to bar increases in individual income taxes, as opposed to payroll taxes (the primary funding mechanism for Bernie Sanders’s single-payer bill). But it seems unlikely that this distinction will be honored in practice: As a political matter, it will be difficult to insist that a rule titled “Protect the Middle Class From Tax Increases” does not apply to payroll-tax hikes, given that such hikes increase taxes on the middle class. And if the distinction between income and payroll taxes doesn’t stick, then the super-majority rule would render a whole host of Democratic policies nonviable. For example, Kirsten Gillibrand’s FAMILY Act finances an expansion of paid family and medical leave with a 0.4 percent increase in the payroll tax (split between employees and employers). Her law would make life much easier for many caretakers in the bottom 80 percent, while increasing their tax bills by a near-indiscernible amount. And yet, in the name of helping the middle class, the new Democratic House majority wants to give their Republican colleagues the power to veto such legislation.Although Pelosi officially proposed retaining the GOP’s supermajority rule, in restricted form, it is unclear whether the idea originated with her. At present, a group of House Democrats from the caucus’s moderate wing is pushing to oust Pelosi from leadership. Generally speaking, those leading the charge to deny Pelosi the speakership have made opposition to tax hikes a far more prominent part of their political brands than she ever has. And according to the Washington Post, many of the rule changes endorsed by Pelosi had been “ demanded by some members in return for their speaker votes.” Thus, it is neither clear that Pelosi is the driving force behind the supermajority rule, nor that denying her the speakership would prevent its implementation.After all, there are other forces that could be pulling the caucus in a more conservative direction: Republican gerrymandering proved insufficient for preventing Democrats from winning back the House — but, by systematically underrepresenting liberal constituencies, it did manage to ensure that the new Democratic majority would be unusually beholden to swing (and/or right-leaning) voters. Katie Porter, an Elizabeth Warren acolyte, did just win election in a historically Republican district in California’s Orange County— but she ultimately felt that she needed to air ads like this in order to do so.Regardless, the supermajority requirement’s origin matters less than its defeat. Between now and January, the progressive forces within Team Blue’s tent must work to nip this rule in the bud. When voters went to the polls earlier this month, 123 House Democrats, and many of the party’s House candidates, had pledged to support Medicare for All. If the new Democratic majority decides to make that goal more difficult to achieve — as its first act upon taking office — then it will recklessly betray many of the people whose votes, dollars, phone calls, and door-knocking put them into power.This article has been updated to reflect the fact that the current Congress has already established a supermajority requirement for tax increases, and that the proposed rule would only apply to income tax rates, not to the elimination of tax deductions used by the bottom 80 percent of income-earners.First responders have brought thousands of pets rescued from the Camp fire to California animal shelters (including many that suffered burns) — but this dog is still with his personStacey Abrams’s plan to fight for Georgia’s democracy in courtAbrams said the [new federal] lawsuit, which will fall under the umbrella of a new organization called Fair Fight Georgia, will look toward improving the state’s election system prior to municipal elections in 2019 and the 2020 presidential election. Fair Fight may also push for legislative changes at the Capitol, and Abrams said it will hold the state accountable for running elections fairly.“We have to consider all the pieces that go into voter suppression and diminishing the ability of voters to cast their ballots,” she said. “And that means looking at the staffing and sourcing of polling stations, making sure that there are an adequate number of machines, making certain that poll workers who are often volunteers aren’t judging whether or not someone gets to vote based on how many pieces of paper they have left.”As for whether she will challenge U.S. Sen. David Perdue in 2020 or seek another bid for governor in four years, Abrams is mum. But she is confident her legal challenges will help continue to expand Georgia’s electorate.“We know that over the next two years there will be new people who will find themselves energized by politics,” she said. “And I think what we can do in 2020 is absolutely complete the transformation that started this year. It won’t only be at the top of the ticket, but also down the ticket.”Newly discovered emails link pro-Brexit campaign with Cambridge Analytica, Steve Bannon, and the Mercer familyThe possibility that both Brexit and the Trump campaign simultaneously relied upon the same social-media company and its transgressive tactics, as well as some of the same advisers, to further far-right nationalist campaigns, set off alarm bells on both sides of the Atlantic. Damian Collins, a member of Parliament, and chair of its Digital, Culture, Media and Sport Committee, which held an inquiry into fake news, told the Observer, which has broken much of the news about Cambridge Analytica in the U.K., that the new e-mails “suggest that the role of Bannon and Mercer is far deeper and more complex than we realised. There’s a big question about whether Mercer’s money was used in the Brexit campaign and it absolutely underscores why Britain needs a proper Mueller-style investigation. There are direct links between the political movements behind Brexit and Trump. We’ve got to recognise the bigger picture here. This is being coordinated across national borders by very wealthy people in a way we haven’t seen before.”The American investigations into foreign interference in Trump’s election, and British probes into Brexit, have increasingly become interwoven. The role of the Russian Ambassador to the U.K., Alexander Yakovenko, has reportedly been the subject of interest both to Mueller’s investigators and to those in the U.K., who have examined his relationship to Banks. The role of Nigel Farage, the former leader of the far-right, Euroskeptic U.K. Independence Party, who has been an ally of Bannon and Trump, has also reportedly stirred the interest of investigators in both countries, especially after he was spotted in 2017 leaving the Ecuadorian Embassy in London, in which Julian Assange has taken refuge. Assange’s media platform, WikiLeaks, published many of the e-mails stolen by Russia from the Hillary Clinton campaign during the 2016 election season.How and whether all of these pieces fit together is the subject of Mueller’s investigation, but the lack of a similar single, overarching investigation in the U.K. has led critics to call for one.Reminder: Forest floor raking or not, last summer was really bad for wildfires in EuropeThroughout the Northern Hemisphere this summer, heat waves have been shattering records and sustaining wildfires of unprecedented fury. In Greece [on July 24th], ninety-one people died in a hellish fire—Europe’s deadliest since 1900—that broke out eighteen miles east of Athens and, powered by unusually dry vegetation and strong winds, blazed across a resort town on the Aegean Sea. On July 17th, in Sodankylä, Finland, more than fifty miles north of the Arctic Circle, the thermometer read a previously unseen ninety degrees; in Sweden, wildfires swept across Lapland; in Norway, there have been three times more wildfires this summer than normal. In much of Germany, drought conditions have persisted since May, the Rhine [was] dangerously low, and authorities in the city of Potsdam, outside Berlin, were afraid [in late July] that a wildfire burning around the nearby small town of Fichtenwalde would set off Second World War–era ammunition that remains buried in the area’s forest and meadows.The link between the California fires and the changing climateFinns seize long-awaited opportunity to debunk/dunk on President Trump over his raking comment@Akihheikkinen:“Finland has ~73% forest coverage = 222,180 square kilometers of forests (world bank study). Our forests are densest in the world, averaging 72,000 trees in sq km. That’s 22 billion trees or 4,500 for every Finn (yale university study). Please send help. Must bring own rakes.”@Mallahadley:“I grew up in Finland. a) it rains all year round. b) we have a lengthy and cold winter. c) Finland is a sparsely populated country with just over 5mil ppl, with land size ~3/4 of CA and most of it forests and lakes. d) no friggin body is raking the forests.”@Lahavu:“We have had pretty much the warmest year ever. It has been +5-7C here in the east this week. The summer was one of the driest and hottest ever and that’s why we had quite many fires. On an average year fires are a non-issue. I didn’t complain about the heat myself (I love warm weather). It’s just that it tells you how climate change is changes our climate and that is certainly not good.”NSC member in charge of U.S. Saudi policy has resignedThe official, Kirsten Fontenrose, had pushed for tough measures against the Saudi government, and had been in Riyadh to discuss a raft of sanctions that the American government imposed in recent days against those identified as responsible for the killing, according to two people familiar with the conversations. Specifically, she advocated that Saud al-Qahtani, a top adviser to Crown Prince Mohammed bin Salman, be added to the list, and he ultimately was.The exact circumstances of her departure are murky, and it is unclear whether her advocacy for a hawkish response to the killing angered some in the White House. When she returned to Washington, according to the two people, she had a dispute with her bosses at the National Security Council, where she had served as the director for the Persian Gulf region.The unknown long-term harm of inhaling wildfire smokeMost research has focused on how smoke exposure affects firefighters or how air pollution, not wildfire smoke specifically, affects people’s health. Many large studies have linked air pollution to heart and lung diseases; one 2012 study found that pregnant women who were exposed to smoke during the 2003 wildfires in Southern California delivered babies with slightly lower birth weight than normal. …There are similarities between particles found in air pollution from fossil fuels and those found in wildfire smoke. Both contain toxic particles that are invisible to the naked eye that can penetrate into lung tissue and get into the bloodstream. These particles are 2.5 micrometers in size — about one-fortieth the width of a strand of hair. There are also differences, though, that scientists don’t fully understand.When residential areas burn, they release chemicals into the atmosphere that aren’t emitted when wooded or grassy areas burn. Plastics, household cleaning products, metals from vaporized stoves and washing machines, and synthetic materials from carpets add to poor air conditions. Researchers don’t know what kind of long-term health conditions could be caused or exacerbated by exposure to these compounds.Stranded in Chico’s “Wallywood” and other places of refuge for Camp fire evacueesHundreds of evacuees are squatting at camp in a Walmart parking lot — a ramshackle village some inhabitants call Wallywood, a sardonic mash-up of their location and reduced circumstances. …“Big picture, we have 6,000, possibly 7,000 households who have been displaced and who realistically don’t stand a chance of finding housing again in Butte County,” county housing official Mayer said. “I don’t even know if these households can be absorbed in California.”The county has the capacity to place 800 to 1,000 households in permanent housing, Mayer said. Housing was already scarce in Butte County before the Camp Fire. The housing vacancy rate was less than 2 percent, which “is considered a crisis state,” Mayer said. Unlike wealthier Sonoma County, where fires destroyed thousands of homes last year, many residents of Paradise don’t have the financial means to rebuild their homes quickly.Closing in on the biggest midterm (popular vote) wave in three decadesAssuming [the Democrats’ national lead in House votes] gets up into the ~8.5[%] range, Democrats are also on track to have the largest House popular vote margin by either party in a midterm since 1986, when they it by 9.9 points. D’s did win it by 10.6 points in 2008, but that was a presidential year.Andrew Gillum concedes Florida governor’s race, againWaiting for the president to passTrump visiting what’s left of ParadiseHe also promised to put $500 million “in the farm bill for management and maintenance of forests”Make America Rake AgainWe’re all committed — I’m committed to make sure that we’ve got all of this cleaned out, and protected. Gotta take care of the floors, you know, the floors of the forest. It’s very important. You look at other countries where they do it differently, and, it’s a whole different story. I was with the president of Finland, and he said, “We have a, much different — we’re a forest nation.” He called it “a forest nation.” And they spent a lot of time on raking and cleaning and doing things, and they don’t have any problem. And when it is, it’s a very small problem. So, uh, I know everybody’s looking at that. To that end. And it’s gonna work out. It’s gonna work out well.The Bystander in Chief[S]hortly after becoming commander in chief, President Trump asked so few questions in a briefing at MacDill Air Force Base in Tampa, Fla., that top military commanders cut the number of prepared PowerPoint slides to three — they had initially planned 18 — said two officials with knowledge of the visit. The commanders had slotted two hours for the meeting, but it lasted less than one.Rhetorically, Mr. Trump has embraced the United States’ 1.3 million active-duty troops as “my military” and “my generals” and has posted on Twitter that under his leadership, the American armed forces will be “the finest that our Country has ever had.” But top Defense Department officials say that Mr. Trump has not fully grasped the role of the troops he commands, nor the responsibility that he has to lead them and protect them from politics.“There was the belief that over time, he would better understand, but I don’t know that that’s the case,” said Col. David Lapan, a retired Marine who served in the Trump administration in 2017 as a spokesman for the Department of Homeland Security. “I don’t think that he understands the proper use and role of the military and what we can, and can’t, do.”MeanwhileTranslation: “We still want to believe the Saudis”“While Facebook surely does exhibit liberal bias in some ways, they have also dramatically — and, in the end, devastatingly — overcorrected for that bias.”Facebook didn’t tiptoe to avoid poking the bear on the left. They went right up to the bear and stabbed it repeatedly. And then goaded the right’s bear to join in the stabbing.The power of leftist outrage mobs has been well-discussed. The power of conservative outrage mobs to affect corporate and political policy, even from left-leaning organizations, is arguably less acknowledged.In no small part to placate the right, the liberal company Facebook misled the nation again and again about the nature of Russian interference in the election. They repeatedly fed right wing conspiracies while waving away criticism from the left. It’s hard to see how an ardently Trumpist company could do much better.Historians claim 2018 is not the worst year to be aliveAsk medieval historian Michael McCormick what year was the worst to be alive, and he’s got an answer: “536.” Not 1349, when the Black Death wiped out half of Europe. Not 1918, when the flu killed 50 million to 100 million people, mostly young adults. But 536. In Europe, “It was the beginning of one of the worst periods to be alive, if not the worst year,” says McCormick, a historian and archaeologist who chairs the Harvard University Initiative for the Science of the Human Past.A mysterious fog plunged Europe, the Middle East, and parts of Asia into darkness, day and night—for 18 months. “For the sun gave forth its light without brightness, like the moon, during the whole year,” wrote Byzantine historian Procopius. Temperatures in the summer of 536 fell 1.5°C to 2.5°C, initiating the coldest decade in the past 2300 years. Snow fell that summer in China; crops failed; people starved. The Irish chronicles record “a failure of bread from the years 536–539.” Then, in 541, bubonic plague struck the Roman port of Pelusium, in Egypt. What came to be called the Plague of Justinian spread rapidly, wiping out one-third to one-half of the population of the eastern Roman Empire and hastening its collapse, McCormick says.A television viewer who does not understand forests, science, firefighting, or management continues to share his opinions about the use of forest management in fire preventionPresident Trump, to Fox News in a new interview:“I was watching the firemen the other day, and they were raking areas — they were raking areas. When the fire is right over there and they are raking trees, little trees like this, that are, not trees — little bushes. That you could see are totally dry. Weeds. And they are raking them — they are on fire. That should have been all raked out — you wouldn’t have the fires. … Maybe [climate change] contributes a little bit. The big problem we have is management. … You need forest management. I’m not saying that in a negative way, a positive — I’m just saying the facts.”And to reporters before heading to California on Saturday to have a firsthand look at the wildfire crisis:“[California officials and I] will be talking about forest management. I’ve been saying that for a long time. It should have been a lot different situation. But the one thing is that everybody now knows that this is what we have to be doing, and there’s no question about it. It should have been done many years ago. But I think everybody’s on the right side. It’s a big issue, it’s a big issue, a very expensive issue, but very, very inexpensive when you compare it to even one of these horrible fires. And we’ll save a lot of lives.”The logging industry stands with Trump, per the Washington Times:“There is truth to statements he has made,” said Daniel Dructor, executive vice president of the American Loggers Council, a coalition of state and regional associations that represents independent contract loggers. “It’s time to rise above political posturing and recognize that active forest management — including logging, thinning, grazing and controlled burning — are tools that can and must be used to reduce fire risks and help mitigate the impacts to landscapes,” Mr. Dructor said in a statement.Pesky science, via the AP:One reason that scientists know that management isn’t to blame is that some areas now burning had fires in 2005 and 2008, so they aren’t “fuel-choked closed-canopy forests,” [Utah fire scientist Philip] Dennison said. In those earlier fires, Paradise was threatened but escaped major damage, he said. In the current blazes, it was virtually destroyed.The other major fire, in Southern California, burned through shrub land, not forest, Dennison said. “It’s not about forest management. These aren’t forests,” he said.The dean of the University of Michigan’s environmental school, Jonathan Overpeck, said Western fires are getting bigger and more severe. He said it “is much less due to bad management and is instead the result of our baking of our forests, woodlands and grasslands with ever-worsening climate change.”The socioeconomics of saving your home from wildfires[T]he fire department’s capacity crunch in the face of devastating and erratic fires has showcased a growing social divide. In areas where some residents felt the need to put their lives on the line, celebrities and affluent homeowners filled the gap with private firefighters to protect their mansions from burning.In an article published last spring, NBC highlighted that the insurance giant AIG offers wealthy homeowners access to their Wildfire Protection Unit, certified through authorities to respond to fires that threaten million-dollar homes.TMZ reported this week that Kim Kardashian and Kanye West hired private firefighters to protect their $50m mansion in the hills of Calabasas. It narrowly survived the fire, but critics began wondering if the destruction-fueled “new normal” meant the affluent, yet again, could save themselves while others suffered.Designer districtsPartisan gerrymandering has been carried out by both Democrats and Republicans throughout U.S. history. But an Associated Press statistical analysis based on 2016 election data found that more states had Republican-tilted districts than Democratic ones. Some of the largest GOP congressional advantages were in North Carolina and Pennsylvania, where Republicans fully controlled redistricting after the 2010 Census. One of the Democrats’ biggest edges was in Maryland, where they were in charge of the last redistricting.A follow-up AP analysis using preliminary 2018 election data shows the Republican statistical edge was cut in half under Pennsylvania’s new court-ordered congressional map but grew even larger in North Carolina.Though an increasing number of states have adopted independent commissions, many states still rely on lawmakers and governors to draw legislative and congressional districts. Republicans controlled that process in far more states than Democrats because of their electoral success nationwide in 2010. Those maps were in place for the Nov. 6 elections, except in places where courts ordered them redrawn, and will be again in 2020.Florida, the jammed paperclip perpetually short circuiting America’s democracyIn one of the most serious cases, Palm Beach County found “dozens of precincts missing a significant number” of votes during the machine recount, according to the supervisor of elections, Susan Bucher, causing the county to conclude that entire boxes of ballots may not have been counted.Ms. Bucher blamed an overheated and outdated ballot-scanning machine. But the manufacturer of the high-speed scanner used in Palm Beach said its technicians had witnessed Palm Beach County elections workers, apparently worried that one of the machines was running too fast, jam a paper clip into the scanner’s “enter” button in an effort to slow it down. That, in turn, caused a short circuit that cut off the power, a company spokeswoman said.The president who is permanently “at odds” with the conclusions of his nation’s intelligence community (and yes, he has been briefed on this)[T]he CIA [has] assessed with high confidence that the Saudi leader [Mohammed bin Salman] ordered the killing [of journalist Jamal Khashoggi], based on multiple sources of intelligence. “We haven’t been briefed yet. The CIA will be speaking to me today,” Trump told reporters on the South Lawn of the White House before leaving to survey damage from wildfires in California. But the president has already been shown evidence of the prince’s alleged involvement in the killing, and privately he remains skeptical, Trump aides said. He has also looked for ways to avoid pinning the blame on Mohammed, the aides said. The president’s most recent comments put him at odds with the findings of the CIA and senior intelligence officials. “It’s dead.”When the vote-counting is finished, the GOP may not even have enough lawmakers in California’s 53-member House delegation to field a nine-person softball team.“It’s dead,” Mike Madrid, a former political director of the California Republican Party, said of the state GOP. “It exists in small regional pockets, where there are enough white, non-college-educated working-class communities for there to be a Republican Party. But that’s not much.”Other states tilt lopsidedly in favor of one party or the other. But never before has a state with California’s huge populous and enormous import — socially, culturally, economically — been so dominated by a single political party. The implications will take years to fully comprehend.Analysis from our own California politics mavenAnd in urban areas and Western states, minorities make up the majority of their generation, according to PewDon’t miss the major political implications of this [Pew study]: 48% of Post-Millennials (now aged 6 to 21) are members of racial or ethnic minorities–far above the 39% in the Millennial generation (which itself was the prior record-holder). They are just starting to join the electorate..The better educated, more diverse generation to comeA new Pew Research Center analysis of Census Bureau data finds that the “post-Millennial” generation is already the most racially and ethnically diverse generation, as a bare majority of 6- to 21-year-olds (52%) are non-Hispanic whites. And while most are still pursuing their K-12 education, the oldest post-Millennials are enrolling in college at a significantly higher rate than Millennials were at a comparable age.The parents of post-Millennials are more well educated than the parents of Millennials and those of previous generations, and this pattern most likely contributes to the relative affluence of the households in which post-Millennials live. … The high school dropout rate for the oldest post-Millennials (ages 18 to 20 in 2017) is significantly lower than that of similarly aged Millennials in 2002. And among those who were no longer in high school in 2017, 59% were enrolled in college – higher than the enrollment rate for 18- to 20-year-old Millennials in 2002 (53%) and Gen Xers in 1986 (44%).The changing patterns in educational attainment are driven in part by the shifting origins of young Hispanics. Post-Millennial Hispanics are less likely than Millennial Hispanics to be immigrants – 12% of post-Millennial Hispanics were born outside the U.S., compared with 24% of Millennial Hispanics in 2002. Previous research has shown that second-generation Hispanic youth tend to go further in school than foreign-born Hispanic youth. That is borne out in this analysis, as 61% of second-generation Hispanics ages 18 to 20 who were no longer in high school were enrolled in college in 2017, compared with 40% of their foreign-born counterparts.The hazardous air quality in northern California is not expected to improve until the middle of next week at the earliestThere have been widespread school and university closures. Many businesses have urged employees to work from home. Some public transit in San Francisco has been made free, in an effort to keep people inside as much as possible if they must commute. In a region whose weather is usually pretty temperate, smoke days have become the Bay Area’s version of snow days. But instead of a joyful respite from work, wildfire smoke mixes a blizzard’s large-scale logistical nightmares with the anxiety of worsening climate change and a class divide that plagues American public health. Three of the five largest fires on record in California have occurred in the past three years, all in the northern part of the state. For the region’s residents, smoke days won’t go away once the Camp Fire is contained.The risk posed by wildfire smoke is significant, and it goes far beyond a few days of coughing or headaches. According to Kristie Ebie, a professor of global public health at the University of Washington, the consequences of breathing wildfire smoke extend to other parts of the body because of the noxious nature of the tiny debris the smoke carries with it. “That affects not only people’s lungs, but it gets absorbed into people’s systems,” she says. Recent research shows that absorption can lead to cardiac arrest, stroke, and other deadly outcomes.With kids home from school, people working from home, and few safe ways to leave the house, Northern Californians are looking for any outlet available to find some relief.The ongoing search for remainsAs many as 7,000 households have been displaced by the Camp fire in Butte County , CaliforniaCamp fire missing persons list now over 1,000, confirmed death toll up to 71Searchers combing through the ruins of the deadliest wildfire in California history found eight more bodies Friday, bringing the number of dead in the Camp Fire to 71 as more than 1,000 people remained unaccounted for.Seven of the eight bodies were found in the town of Paradise, which was all but destroyed in the fire that broke out Nov. 8, and the other was in Magalia, north of Paradise, said Butte County Sheriff-Coroner Kory L. Honea said. All were found inside structures.Honea cautioned that the number of unaccounted for — 1,011 as of Friday night — could include names that are duplicates or have different spelling variations, and that investigators were working to verify them. …The Camp Fire has displaced thousands of people and led to the evacuation of some 52,000 at the fire’s peak. About 47,200 remained evacuated Friday, officials said. The fire has burned 146,000 acres and was 50 percent contained Friday. … [It] has destroyed at least 9,700 single-family residences, 144 multi-family residences and 336 commercial buildings, according to Cal Fire."}