{"id": "Why Are Gardeners So Crazy About the Haws Watering Can?", "paragraph": "Let’s start with this: A $98 watering can is totally indulgent. I get it. But the copper Haws is not your average watering can. I first saw the Haws a few years ago, when it was decidedly out of my budget. I quickly became obsessed. I watched YouTube videos of the manufacturing plant (basically watering-can porn). I admired the patina on old cans while scrolling U.K. eBay. My restraint only broke a few weeks ago, when I found an old clip of Martha Stewart, giving an indoor-plant-care demonstration, WITH THE COPPER HAWS. I caved and bought it.I was struck right away by how natural it felt to use — it fit comfortably in my hand, and water streamed forth with just the slightest tip of my wrist. Its design felt intentional. Horticultural historian Bill Laws describes in his book A History of the Garden in Fifty Tools how John Haws patented his watering can in 1886. He’d created it as an answer to the large and cumbersome options of the era, making a watering can that, in his words, was “much easier to carry and tip, and … much cleaner … than any other put before the public.”The 19th-century ergonomics hold up today. It’s actually become a problem for me: I enjoy the Haws so much I’ve been overwatering my plants. Whenever I mention the Haws to gardeners and plant people, their eyes light up. Bill Laws told me in an email, “As anyone who owns one knows, the Haws is a delight to fill, carry and pour.”The can’s defining characteristic is the brass “rose” at the end, which works like a showerhead for plants. Brooklyn-based interior plant designer Lisa Muñoz says, “The rose piece is ideal for plants in larger pots and allows you to provide an even spread of water over the soil, mimicking rainfall. It can also be utilized to wet the foliage, which is good for humidity-loving plants like ferns.” Position the rose upward and you get a gentle and dispersed rainfall effect; pointing it downward makes for something more focused, like a handheld European showerhead.And then there’s the copper finish. It’s gleaming when you first get it, like a new leather jacket, but it soon starts to develop its signature patina. “A watering can should look as good as possible, and it’s so much easier when you don’t have to hide it all the time,” says Judith de Graaff, who, along with Igor Josifovic, is the author of Urban Jungle: Living and Styling With Plants. De Graaff uses the copper Haws in her own home daily, as does Josifovic. I also spoke with Mark Morrison, a landscape architect whose collection of antique garden tools was recently featured at the Met. Morrison counts about a dozen Haws cans in his inventory, including a copper Haws from the 1950s “that still works perfectly.”And sure, it works well and is nice-looking, but more than that, it’s a bit of a secret handshake. While I couldn’t confirm it with Martha Stewart (at press time, she hadn’t responded), I suspect she was drawn to the Haws for the same reasons I was — a distinct heritage, a price tag that’s high but not prohibitive, and an immediately recognizable shape to those in the know. Like Mauviel pans casually hanging above a stove, they’re for insiders.I had a really hard time deciding between this painted metal version and the copper one. Obviously I went with the copper, but the painted metal is beautiful too, and comes in a few other vibrant colors. It’s the exact same size and shape as the copper one, a nice compact one-liter capacity perfect for indoor plants. It’s a much better price and just as well-built.A great, large-capacity, plastic option if you need a watering can for watering an actual garden outside.If you want that #iconic Haws silhouette on a budget!The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}