{"id": "What Rebel Wilson Can’t Live Without", "paragraph": "If you’re like us, you’ve probably wondered what famous people add to their carts. Not the JAR brooch and Louis XV chair, but the hand sanitizer and the electric toothbrush. We asked actress Rebel Wilson, who has a new collaboration called Rebel Wilson x Angels, about the bubble bath, sunglasses, and comfortable but fancy flats she can’t live without.I am obsessed with bubble baths. I’m always thinking of new ways to end the day that aren’t ice cream or brownies. I love this oil because it’s got valerian and hops in it, so it’s a nice way to tell your body that it’s time to unwind and go to sleep. I’ll also put some Epsom salts in the bath with it for detoxing. But more about this blue stuff. I don’t even know how to say it! Neep? Kin-neep? Something else that’s great about it is that it turns the water blue. How great is that?I used to wear the big, chunky ones that went over your head, but those hurt my ears after a long time, so I switched to the wireless buds, and it’s so much more comfortable. I’m always listening to something in an Uber or on a flight, especially podcasts. Right now, I’m very into Scriptnotes, which is a podcast about script-writing and the process of creating plot and dialogue. I’m writing myself, so it’s nice to be able to hear about how people do it just because it can be so solitary. I actually just bought a new pair of these headphones though. I left my original ones in a car, accidentally, and I tried to contact the driver, but he never answered. Aren’t they supposed to let you know? Like, “Hey, I have your headphones, come get them.” Thankfully, I used an alias, so some random person’s not walking around going, “I have Rebel Wilson’s headphones!”If you ever see me in a paparazzi picture, I am wearing these sunglasses. They’re so lightweight, and you can wear them anywhere. I learned about them from Paul Feig of all people. I hate heavy sunglasses that put pressure on your nose, but these are so stylish and lightweight at the same time. Everyone who sees them asks, “Where did you get them?”Have you heard of this? I do this on the weekend when I’m sun-baking outside to strengthen my hair. It’s always getting styled for work, which can be so damaging. Last year, I filmed three movies back-to-back, and my hair was like a third of what it was. In the past, I’ve tried to use a wig, but they can get so hot, so I was looking for other things, and someone told me about this protein treatment that you put in your hair to strengthen it, and I figured, why not? It’s apparently a big thing in London, which is where I got it (and good for guys and girls). Anyway, I leave it on my scalp for 20 to 30 minutes — or even four hours if I’m just hanging around all afternoon, and it helps with everything. It’s thickened my hair and stopped it from breaking as much. My hairdresser, unprompted, said to me, “Wow, whatever you’re doing’s made a huge difference.”My family is so cute. For Christmas, this mask is all I get. My grandma will get me one. My uncle will get me one. I got a 20-pack at the airport the other day because they’re cheaper when you buy in bulk. I truly cannot get enough. It’s an essential if I’m on a long flight or before a big day of filming or an event. It’s a mask that gives you that hydrated, glowy skin because it has the Japanese Pitera ingredient derived from yeast. And you know, Cate Blanchett is the spokesperson, and look at her skin. It’s incredibly plumping. I sound like I’m on the Home Shopping Network.I love that Cowshed has all of these funny names for its products. I saw this one and thought, Oh, yeah, that’s it. I got it because of the name, but the lotion actually has the best scent. It really is seductive. There’s nothing like hugging someone and having them say, “What are you wearing?” And I don’t say, “HORNY COW,” but I’ll think to myself, Oh, it’s definitely working. It’s kind of got a floral, feminine smell to it. It’s a bit sexy.Nicholas Kirkwood is a British designer, and I don’t know how I found these shoes, but my stylist once told me that it would be so much more flattering to have a pointed toe for feet like mine, which are quite small, so that stuck with me. I hate wearing high heels, and these flats are really stylish, but super comfortable. I became so obsessed with them that I bought them in every color.I always have this in my handbag. My makeup artist Martine actually gave it to me, and at first I was like, “You just want me to use ChapStick?” But it’s really the most comfortable thing to have on your lips. I hate having dry lips, and this keeps your lips moisturized, but with a bit of tint, so it looks like your lips but just extremely enhanced rather than like makeup. And if I lose it, I can just go to CVS and get another one, which is my favorite part.It’s exciting to make your own stuff! I wanted to make something affordable and accessible to everyone, and these T-shirts are just great for every day. They’re made of this comfortable material that’s nice with jeans. My favorite is the one that says, “Today Is My Lucky Day.” I feel like I’m so lucky anyway, but I like wearing it and putting it out there. I actually made up all the slogans on the tees.The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}