{"id": "The Best Gifts for People Going Through a Breakup", "paragraph": "Finding the perfect holiday gift can be maddening — is this the color they’d want? Is it something they already have? Is it so last year? — but really, once you have a sense of a person’s taste, it’s not impossible. This season, we’ll be talking to members of various tribes (we’re calling them the Hard-to-Shop-Fors) to find out exactly what to get that serious home cook, skin-care Redditor, or gamer in your life. Think of it as a window into their brain trust — or at least a very helpful starting point. Back in 2010, NPR reported on a study showing that the most common day of the year for couples to split up is the first Monday in December — or just a few weeks before Christmas. If a holiday-season breakup puts a damper on your plan to order that monogrammed towel set for your formerly in-love friends, or if you’re just trying to show a little extra compassion, we consulted with Amy Chan, founder of the Renew Breakup Bootcamp retreat for the brokenhearted, to recommend gifts for loved ones going through a breakup. She also pointed us to recent Renew alum Taryn (who asked that we only use her first name), who shared the gifts she wished she’d received in this tough time.Chan says when it comes to buying something for a friend after a breakup, “gifts that are going to be conducive to their healing are going to be a lot more valuable” than something that’s just purely nice. One idea is putting together a few items your friend can use to create a calming, daily ritual. “It’s really important to have a routine that you’re doing every single day,” says Chan. “It actually helps you with your emotions.” People often rely on relationships for regularity in life, so losing a partnership can leave your days feeling chaotic. Chan explains that emotions are closely linked to scent, so if you do something like burn Palo Santo incense during your morning ritual when you’re in a peaceful state, catching a whiff of it when you’re feeling sad or anxious can help bring you back to that neutral mind-set. “Palo Santo’s nice to clear the energy and clear the air,” she says.Taryn agrees that scent-based gifts can be very effective at helping the recipient change their emotions. “The best gifts are the ones that have positive affirmations around them and provide a positive distraction,” she says. She recommends giving a lavender-scented candle, as the flower’s smell is known to be soothing. Go all-out with this elegant ceramic candle that looks as good as it smells.Or get this minimal candle that says it all. It actually smells like lavender, rose, and lily of the valley, but fits well when they’re in the anger stage.According to Chan, “Certain essential oils are meant for calming as well.” Chan says she’ll have Vitruvi diffusers on during meditation sessions at Renew, filled with soothing lavender and eucalyptus oils, and then send participants home with their own oils to help bring them back to a place of relaxation. Along with Vitruvi, she also likes doTerra’s essential oils.As for what to wear during those chill self-care sessions, Taryn likes the ultrasoft pajama sets from PJ Salvage. They’re just as comfortable as throwing on an old T-shirt and sweatpants, but help a person feel a little more put-together.For something a little more glamorous, Chan suggests a Kim + Ono robe. Unlike similar polyester alternatives, it’s made from real silk, which’ll make their daily rituals feel luxurious. “Wear your kimono around the apartment and wind down from the day,” she says.We already know celebrities love these fizzy, nutrient-rich tablets, so it was interesting to hear Chan explain how they’re useful during the most intense parts of a breakup. “When people are going through a separation, it’s quite common that they actually don’t have an appetite at all. The body is trying to help you survive by managing cortisol and adrenaline — hunger is the last priority,” she says. It’s hard to deal with emotions without proper nutrition, though, so she recommends these for making sure your brokenhearted friend at least gets in the essentials. “Drinking all the nutrients you need can start helping your body get back in order.”On the other hand, Chan says these intense emotions can desensitize the taste buds, making people crave highly salty or highly sweet foods. If your friend doesn’t have the energy to cook on their own — or is surviving off of pints of Ben & Jerry’s — she likes gifting a healthy meal service, like the plant-based Sakara.“We have an elixir bar at the retreat, with calming teas and CBD oil,” says Chan. “A lot of people have anxiety after a breakup, and CBD could be helpful with calming down the nerves.” She keeps the bar stocked with oil from Ned, which harvests its hemp up in the Rocky Mountains.These CBD capsules, from the socially conscious brand Endoca, has appeared among our readers’ best sellers since we first wrote about it back in April. Taken as a pill, it’s an easy way to reap CBD’s chill-out benefits.Those left reeling after a breakup are often full of questions about what went wrong and how to heal for future relationships. Taryn says this book, which came recommended from her mother, was essential in helping her move through this process. “It allowed for a space to see things in a different perspective and understand my part in everything — the relationship and breakup,” she says. “It helped begin to rewire my thinking and create positive energy in a very negative state.”Learning about one’s attachment style — the way we relate to others that’s formed during early childhood — also provides insight on creating new, positive relationships. Chan says about 90 percent of people who go through her boot camp have an anxious attachment style characterized by a deeply ingrained fear of being abandoned or rejected. “When you understand it, it starts to click. Like, ‘Oh my God, that’s why I react to intimacy this way,” she says. She recommends reading this book for more of those revelatory “aha!” moments.One way of helping a friend get through a breakup is to encourage them to think about all of the other good things they have going for them. “Practicing gratitude is a big part of the healing process,” says Chan. “Studies have shown [gratitude journaling] can actually change your brain when done over a period of 30 days straight.” If you’re looking for something they can keep bedside that doesn’t scream self-help, a simple, nice-looking notebook will do the job. This one is writer Molly Young’s favorite. Chan says journaling can be part of a morning or evening grounding ritual.If your friend needs a push to get started, try this guided gratitude journal that Strategist writer Maxine Builder picked up over the summer. She says, “I’ve been liking the practice so far, as an easy way to collect my thoughts and be more mindful.”The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}