{"id": "The Best Baby Cribs on Amazon, According to Hyperenthusiastic Reviewers", "paragraph": "Here at the Strategist, we like to think of ourselves as crazy (in the good way) about the stuff we buy, but as much as we’d like to, we can’t try everything. Which is why we have People’s Choice, in which we find the best-reviewed (that’s four-to-five-star reviews and lots of ‘em) products and single out the most convincing. While we’ve written before about the best babyproofing gear, the best newborn essentials, and the best baby tubs, here we’re going deep on the best baby cribs on Amazon. (Note that reviews have been edited for length and clarity.)“This crib cannot be beat for the price. I wanted an affordable, nice-looking, and high-quality crib. Sounds impossible, right? Nope. This crib is all of those things. WHAT I LOVE: This crib is beautiful and unique. I’m a single mom, and I was able to set this crib up entirely by myself. The setup was fairly easy, and the instructions were simple to follow. This comes with everything you will need to put the crib together. The overall process took me less than 1.5 hours. My crib arrived in perfect condition. NO WD-40 needed. The stickers that label each piece easily peeled off. All of the bolts and hardware that show are gold. It gives the crib a more polished look. WHAT I DON’T LOVE: The mattress doesn’t have the option to go very high. Because of the wave effect to this crib, the highest mattress setting has to be a lot lower than other cribs. I highly recommend this one.”“We love this crib. Our daughter has been in it for six months now, and we’ve used it at all available mattress heights so far. It’s easy to adjust the mattress height. The crib is lightweight enough to pull it away from the wall and push it back easily if the pacifier gets dropped (or thrown) behind it. We are looking forward to converting it to a bed in the future. Our only concern is that the paint chips off when she chews on the top bars, which, I understand from talking with other parents, happens on all cribs, so we recommend getting a protective barrier of some kind. It is a beautiful crib and looks great it her room.”“Absolutely gorgeous !!!!!! Sturdy. I put it together by myself at seven months pregnant. Easy to put together. In love with it.”“I took forever to decide on a crib and just kept reading reviews. I wanted something simple, but I was worried about buying an inexpensive one for fear of it being garbage. I am glad I took the plunge with this crib. It is among the least expensive available, and it is absolutely great-looking. The crib came undamaged, and the directions were perfectly straightforward and clear. I’d say I’m an advanced novice at furniture assembly — sure, I’ve put things together, but super-complicated things can screw me up, and I don’t really know a lot about tools and parts. This was a grand total of  seven steps to assemble and only required the included Allen wrench. I did it by myself while my baby was asleep in less than two hours. All in all, this is a great value for a solid and cute crib.”“Just love this crib. Good size, easy to assemble and disassemble. Our infant just loves sleeping in it. It is very lightweight, so you can move it easily from one room to another. The color is good, too. It is very sturdy.”“I HIGHLY RECOMMENDED THIS CRIB! It arrived quick and was easy to put together. My son uses it every night. A while ago, he went through a teething stage, so I do recommend crib covers to avoid the child from biting on the wood. I recently converted the crib into a ‘big boy’ bed, and it has been awesome. I’m beyond happy with this purchase still, and I got it over a year ago.”“This crib is perfect! I loved the look online and thought I’d chance it without seeing it in person, and the color is more beautiful than they could have captured in a picture. I sat down thinking it would take a couple of hours to put together, and it honestly took longer to unwrap everything than it did for assembly (which was still less than 15 minutes). Super simple, gorgeous, and worth the money. I’m going to have this for years.”“This was easier than I thought to put together. The crib looks nice and at very reasonable cost. For the money, I think it is an excellent buy. The one thing that might differentiate this from higher-dollar items is that there are some holes visible where the bolts go together. I guess you could try to find caps for that somewhere, but who cares? This is for your infant son or daughter, and they won’t remember what the crib looks like anyway. Get this and save money to use on more important stuff.”“I love this crib so much! I put it together very quickly by myself, and it looks amazing. It’s very modern, which is why I wanted this one. It’s not as expensive as the others, and it’s totally worth it. I do wish I could turn it into a twin bed like other cribs, but it’ll work with any future babies and toddlers that I will have, too. I have actually taken off one of the sides and put it next to my bed, so I don’t have to get up when my baby wakes up. That has been very helpful! The directions are very clear, and it was delivered quickly and in great condition. I’m obsessed. If you want something modern and cute and you want to spend a little more money, then get this! It was a little pricey for me, but this was the one thing I wanted to splurge on.”“Wow! What a great crib for an amazing price! I received it earlier than I expected and had it assembled with 30 minutes of taking it out of the box. I love that the crib itself is very simple in design with clean lines but comes in fun colors! It feels sturdy, and my son enjoyed his first night’s sleep in it. Can’t ask for anything more! I would recommend this item to anyone in need of a quality crib that will grow with baby that doesn’t break the bank!”“Great crib; it’s solid and sturdy. I have twins and didn’t want to buy another expensive crib (I had one expensive one already), and it does the job, it looks nice, too! And another plus was that my husband was able to put it together pretty quickly.”“We bought this mini-crib originally in November 2013, as we lived in a townhouse. We used this crib until our daughter was 17 months, and then decided to transfer to the toddler bed because she was trying to climb over the front rail. The only thing I didn’t like about the crib originally was that the top height setting was still too low. We bought the cherry finish and loved it. It was beautiful, lightweight, and easy to move around. We put felt pads on the bottom of the feet so that we could slide it on our wood floors when cleaning and moving. It was perfect! We loved it right up until we sold it to other expecting parents on Craigslist.”“In love with this, honestly; it’s absolutely perfect! It’s very sturdy and goes amazing with his bedding. Was fairly easy to put together; the last two screws gave me a bit of trouble, but I eventually got it together with a little patience and a little elbow grease.”“Love it! I thought because the price was so good that the backboard might be made of cardboard, or something cheap, but it is NOT. It is solid wood and very well built. It was also very easy to assemble. I also like the four convertible options, especially the full-size bed that doesn’t look like baby furniture and could be used for any age child or adult. (However, the full-size rails must be purchased separately.) I would definitely buy this crib again. It is beautiful and has a high-end feel for a fraction of the cost.”“My son had trouble sleeping in his Arm’s Reach co-sleeper, so we ended up having him in bed with us, which made us a little uneasy. This bassinet-style co-sleeper allowed me to have him in bed, but protected in his own space. This sleeper has a metal frame that is well-padded and has mesh sides. The frameless portion in the middle allows you to place baby down gently without your arms being blocked by the frame — a small but very useful detail. At 7 weeks, he now tolerates sleeping in his Arm’s Reach, but only if I have this bassinet inside of it. I think because it’s a smaller shape, he feels more comfortable. The sleeper collapses in half and travels well in a suitcase. It’s also useful for transferring your sleeping baby to another room without disturbing him. We regularly bring our son from the bedroom into the living room while he is sleeping in this. Great purchase. Don’t pay the extra $30 for another brand that has pockets or a canopy, you won’t need it! Definitely the best purchase we have made.”“We love this crib. It’s incredibly sturdy and beautiful. The only thing that I see probably being a problem in the future is that the wood is very soft. (Another reviewer mentions this as well). My husband and I were able to assemble this in under 20 minutes. I love that it comes with the toddler rail; that was a major selling factor to us. I love this crib, and if we ever have another baby, we will definitely purchase another of these cribs.”“I really like this bed. I love the color (slate), its lightweight ease of assembly, and sturdy construction. We have limited space in our city townhouse, and its footprint is just what we need.”“Our daughter’s nursery doubles as a guest room (with sleeper sofa), so we didn’t want a large, traditional crib. Instead, I was looking for something that had clean lines and was very practical for her and us when friends or family came to visit but stayed in the room. Living in a condo, we are always thinking about ways to maximize storage and save space. The fact that this crib could be rolled from the guest room/nursery into our bedroom at night to ease the transition for our daughter was a HUGE ADVANTAGE. As for its size, it’s spacious in my opinion and should last her into early toddlerhood (2- to 2.5-years-old perhaps). But, by then … she’ll be making yet another transition to a toddler bed, and we can simply fold this crib and pack it away until baby No. 2 needs to use it. Right now, it’s perfect for her.”“I wanted to buy a white crib with drawers to keep baby stuff and found this one. We assembled it last week and it looks great. Very nice finishing and looks very rich and expensive. It’s very sturdy, too. Very pleased with the purchase. Only thing is, the mattress level cannot be adjusted in this, so we bought two mattresses to make it higher. Also, a standard diaper-changing pad won’t fit in this. Only the one from Athena will fit. Overall, very happy with the purchase.”The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}