{"id": "Guest Strat Haul: What Linda and John Meyers of Wary Meyers Bought in October", "paragraph": "Every month, the Strategist editors do their version of a haul blog, jibber-jabbering about their favorite purchases of the last four weeks. To get that same personality and taste insight (via receipts), we’re inviting interesting friends of the Strategist to run down their own buys. For this installment of the Guest Strat Haul, John and Linda Meyers, owners of the Portland soap company Wary Meyers (a Strategist favorite), tell us what they bought in October.Full disclosure: I found these boots unused at our local consignment shop, but love them so much that I would buy a new pair when — if? — these wear out. Lined in sheepskin, they’re incredibly comfortable and equally perfect as a slipper or out to the store or, for that matter, out in the wilds of Westeros. They’re also handmade in Maine (always look for those words).My son was desperate to have us play Fortnite with him, and I tolerated the commando-aesthetic characters for a while, but when this “Rapscallion” skin was offered, gameplay became much more fun and sophisticated. I picture her as a Breton-striped cat burglar in 1950s Monaco, canoodling with John Robie and lifting paintings out of La Colombe d’Or. For a little extra V-bucks, I bought the Starry Flight glider, a take on Van Gogh’s Starry Night, which she uses to float down from the Battle Bus. Incidentally, my interest in Fortnite was largely piqued by this article. I even tracked down one of those visors on eBay. This skin’s unavailable right now, but it might come back later.October happened to be my birthday month, so these purchases were a little more special than the average month’s. Over the summer, I bought a Loquet London locket from the Real Real. It came with a few charms, but I wanted something to add to it, so I got this Loquet x Dimes Restaurant collab fried egg. I’ve always had a thing for miniature food (and precious gems), so this hit the mark. I should also confess that I splurged on the glow-in-the-dark mushroom charm and the large topaz locket ring.We were walking in Soho over the summer and ran into three girls on the sidewalk giving out samples of the cutest, most delicious little cupcakes. One friend we were with said, “Oh, yes, Baked by Melissa. They’re the best.” So when it came time for a birthday cake last week, I opted for the 50-pack. They’re fun and pretty and ridiculously good. Our son had a couple of friends over when the box arrived, and I feel bad, but I waited for those kids to leave before I admitted to my son that the cupcakes were here.We were in Portland, Maine, and got lunch at the Italian grocery store Micucci. I noticed this little peach four-pack of Cipriani Bellini mix. I’ve always liked the logo and the typography, and even though we don’t entertain all that often, I like the bar to be filled with nicely designed packaging. In 1988, I was in Venice and had a Bellini at Harry’s bar, which astonishingly came rushing back into my senses after one sip of this.Truth be told, I bought this back in July, but when I saw that it was a slightly smaller version of the separate 70s books, and being a bit anal about original versions, I bought the other two, volume 1970–1974, in October. For most people, this smaller compilation is just fine — great, in fact. And looking at it again, there’s no reason to buy the separate volumes. Anyway, the book’s a compilation of the best pages from the Italian architecture and design magazine Domus from 1970–1979. Subtitled The Rise of Individuality and Ecological Awareness, it features Joe Colombo, Ettore Sottsass, Shiro Kuramata, Richard Meier, the Pompidou Centre, Supergraphics, Superstudio, Italian Plastics, Discotheques, Solar Houses, etc. A must-have if you’re into design and interiors.This may seem a little mundane, but my pen of choice is the classic Bic Cristal in blue, so I was excited when I saw these at Staples. I remember someone asked Milton Glaser what his favorite pencil was, and it was the Koh-i-Noor multicolored magic pencil, and I thought that was great — why not write in color? These pens are perfect. The yellow is nice and deep; the pink is bright and fluorescent. There’s even a swimming-pool-blue, which I use for thank-you notes when someone orders one of our Poolside soaps.I’ve always liked this print from Erik Heywood’s Book/Shop, and what finally spurred me on to buying it was the marathon Fortnite video-game sessions my son and his friends play on the TV. The other day, I asked him what his favorite things were in the living room, and they happened to all be art, so I thought, There’s nothing wrong with a little subliminal messaging. We also have so many great books and so little time to give them any attention that I thought this might make them happy — in the same vein as you talk to your plants, you write to your books. Also I love the wonky cursive.Technically, this is not a purchase, but a friend of mine sent me these fantastic socks. I seem to put holes in the usual one-size-fits-all socks, but these are exactly your foot size, so it’s like a bespoke sock (I’m sure they exist in some fancy world). And made of merino wool. They’re super comfortable.The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}