{"id": "This Comforter Made From Recycled Plastic Is Like Sleeping Under Cotton Candy", "paragraph": "\n                    Welcome to Sleep Week, which we’re devoting to all the things that help us get better shut-eye. We’re talking to experts and testing products ourselves to get those precious eight hours a night.\n                  \n                            Welcome to Sleep Week, which we’re devoting to all the things that help us get better shut-eye. We’re talking to experts and testing products ourselves to get those precious eight hours a night.\n                          My gratitude journal has seen one recurring line-entry recently: “I’m thankful for a warm bed.” That’s partially due to the colder weather, but I’d also credit the comforter I’ve been testing for the past week or so from Buffy — one of this year’s rising stars in cozy bedding — for my reluctance to get out of bed.The duvet-in a-box startup launched last December as an environmentally friendly bedding disruptor. Instead of the industry-standard cotton and down  which consumes thousands of gallons of water and live-plucks hundreds of thousands of birds per year, respectively — you’ll find a biodegradable lyocell shell sourced from eucalyptus (which has a smaller footprint overall compared to fiber materials like cotton) and interior filling sourced from 100 percent recycled plastic bottles. Buffy also designed their comforter to be softer than cotton and more breathable.You may have already seen it pop up on Instagram, because Buffy’s marketing was made to be shareable. I think of it as Ban.do for bedding: Buffy’s photo campaigns consist of crisp white comforters set against pastel backgrounds — give or take a beaming millennial — and unboxing the thing involves stumbling upon a soothing mint green interior with lots of googly-eyed illustrations, a pastel pink manual with a winky face on it, plus a lavender-scented eye mask that reads “resting Buffy face.”The name “Buffy” wasn’t inspired by a certain vampire slayer — I asked — but because it rhymes with the word “fluffy.” The goal of creating a fluffy comforter was achieved by an unusual method of crafting fine-spun materials from plastic: Using a proprietary process (founder and CEO Leo Wang comes from a family with over 50 years of experience in bedding), Buffy transforms recycled PET bottles into fluffy fibers that the brand describes as “finer than an eyelash and silky soft in texture.” And the finished product certainly lives up to these cloud-like comparisons.It’s tremendously soft, light, and cool to the touch right out of the box, and sleeping beneath it, you feel nestled under an airy but cozy canopy. Maybe it’s because I knew the thing was full of spun fibers, but the Buffy really does feel like sleeping under a pile of cotton candy. On the heat spectrum, it falls in the middle between the heavier down comforters and the thinner summer duvets I’ve slept under. But I do think it falls short of its temperature-regulating promises: if you tend to burn up at night, anything more than a T-shirt and shorts could be overkill (a few nights ago I woke up schvitzing in a full pajama set). I’ve skirted the issue by slipping it into a cooling duvet cover, though — this silky bamboo one from Loomstead, which has a delightfully silky texture — and I’d suggest you do the same.I also like that the comforter is non-lumpy, not liable to pill, and whisper-quiet when you move so it doesn’t rustle you awake. And when you factor in the fact that you’re sleeping under something sourced from recycled goods, rather than creating more waste, you’ll sleep better, too.The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}