{"id": "The Best Small Artificial Christmas Trees on Amazon, According to Hyperenthusiastic Reviewers", "paragraph": "Here at the Strategist, we like to think of ourselves as crazy (in the good way) about the stuff we buy, but as much as we’d like to, we can’t try everything. Which is why we have People’s Choice, in which we find the best-reviewed products and single out the most convincing. We’ve covered the best artificial Christmas trees, Christmas tree toppers, Christmas tree stands, Christmas lights and wreaths, and even the best scent for a fake Christmas tree, and now we’re zeroing in on the best tabletop and small artificial Christmas trees — that is, those under five feet tall — on Amazon, organized from shortest (at 15 inches) to tallest (4.5 feet). (Note that reviews have been edited for length and clarity.)“I grew up with a tree similar to this and have been on the lookout for a similar one for years. This one is perfect! It’s a great size for my house and looks beautiful. The bulb that comes with it could be a little brighter, but that was a simple switch out with a brighter bulb. I will definitely enjoy this for years to come.”“Perfect for what I wanted, which was a decoration for my kitchen table. The base is pretty enough as it is, and I used small ornaments I already had and it looked great. I have a seven-foot tree that is so heavy and lots of work to drag out and put away. I still wanted a tree, just a small, no-fuss one, and this tree filled the bill.”“This little tree is absolutely perfect for our downsized Christmas display this year. The base is sturdy and heavy; the burlap covering is traditional and innocuous. The tree itself was fun to ‘fluff out.’ … There is plenty of greenery to give a realistic look, and generous spaces between the branches to hold our mercury glass heirloom ornaments. The pinecones are sturdy and well-attached. The tree is on a small table to add height. We put some photos on Facebook, and have gotten great compliments! We’ll use this tree for years.”“I love this tree. I bought it after seeing an antique pink tinsel tree at an antique shop and thinking that it would be perfect for my desk area at work. It is a great size, about two feet tall as is advertised. The pink is VERY pink — like a hot pink, very bright. I kind of wanted a softer pink, but it is still very fun. And if you are ordering a pink tree, you are looking for fun. It does shed a bit during setup. It comes in a narrow box, all folded up, and you take it out, put it in its stand and fold down and out its branches and voila, you have your tree. Very easy. I hung it with silver ball garland and tiny silver and blue ornaments, and it looked lovely and fun.”“This little tree has gotten the most attention that any other tree we’ve put up. We usually buy live ten-foot and larger trees. Our live tree died before Christmas; for some reason, it wasn’t absorbing water. Anyway, I replaced it with the Charlie Brown tree as a practical joke, and it was a HIT with our family and guests. We all loved the nostalgia!”“This Christmas tree really exceeded my expectations. It is beautiful. The ornaments are already built into the tree and there is no need for added ornaments unless you choose to add some. The fiber optics are bright and vivid, the star is beautiful as is the base. Out of the box, it needs some adjusting, as all artificial trees do, but once that is done you have a simply beautiful tree to enjoy. I tried, in vain, to purchase one of these trees last year and waited in anticipation for it to become available again this year. I am so happy it did. I highly recommend this to anyone who wants a beautiful, conversation piece, Christmas tree. I am considering purchasing a second one for another area of my home. I do love this tree!”“I am 72 years old and live alone. It is getting too difficult to assemble and dissemble a 7.5-foot tree, so finally went to a smaller tree. I am so glad I did and [I am] especially happy with my Balsam tree. Not only did it come before the stated delivery date (which would have been after Christmas), it is beautiful. Even though it is small, it is very full … I am glad I paid a little more because I feel like this tree will last until I am no longer able to put up a tree.”“This was the perfect answer to my desire to downsize. I am elderly and found the 6.5-foot tree I had was too much to handle anymore. I still wanted a nice, full, but much shorter tree. … Best of all, the lights are a very nice white, not yellow-ish like all the other prelit trees I found. Also, they are not hot to the touch like my old tree. The tree was easy to assemble … I would recommend this tree to anyone who wants a really pretty, old-fashioned, full, but smaller tree. Everyone who visited really loved the tree as well.”“I bought this tree for my mom for Christmas to replace her old small artificial tree and she loves it! It arrived well packaged with instructions and plenty of extra bulbs and fuses. The base that holds the tree is made of metal (not cheap plastic) and is quite sturdy. The tree itself is quality made and looks realistic. The real surprise was when we plugged it in: Lots and lots of lights! My mom was delighted. No burnt out bulbs or problems and it lit up right away. It took about an hour altogether to set it up including ‘fluffing’ out the branches. … All in all, I highly recommend this tree to anyone looking for a well made and sturdy artificial tree that should last for years.”The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}