{"id": "The Best Women’s Parkas on Amazon, According to Hyperenthusiastic Reviewers", "paragraph": "Here at the Strategist, we like to think of ourselves as crazy (in the good way) about the stuff we buy, but as much as we’d like to, we can’t try everything. Which is why we have People’s Choice, in which we find the best-reviewed (that’s four-to-five-star reviews and lots of ’em) products and single out the most convincing. We’ve covered cold-weather essentials like infrared heaters, men’s parkas, and women’s gloves, and here we’ve rounded up the best women’s parkas available on Amazon. (Note that reviews have been edited for length and clarity.)“I absolutely LOVE this jacket. Initially I was a bit skeptical, but after reading other reviews I decided to make the purchase. At first I ordered a large (based on other reviewers’ recommendations to buy a size up), but that was too big. (I am 5’3”, 140 lbs., and a size 9). I returned the large and ordered a medium … fits perfectly!!! I highly recommend this jacket! I currently live in an area where the temperature reaches the single digits/below zero and so far this jacket has kept me extremely warm and comfortable. The lining is extra soft/warm, the pockets are perfect. The only slight issue I have is that the zipper at times will stick, but overall this is a perfect winter jacket! Again, I’m usually skeptical, but please take my word, this jacket is definitely a good buy!”Editor’s Note: We discovered that this was the coat “that took over the Upper East Side”. Read all about it here. “I am a California gal who has never been to the East Coast. I was notified by my employer that I would be traveling to Boston to undergo training for two weeks, arriving January 3. That’s right, they were sending a California gal to Boston in January. Being someone who runs cold and does not tolerate cold temperatures very well, I immediately panicked. I don’t even own a pair of gloves, let alone a “winter” jacket or coat. I purchased a large. When I wore my coat for the first time, it was 11 degrees and snowing. Remember, I run cold. I am 5’3”, 125 lbs., 34DD, size 2-4. I was wearing fleece thermals, jeans, a fairly thick knit sweater, scarf, gloves, and my NEW LIGHTWEIGHT VALUKER DOWN COAT. Most importantly, I purchased this coat for WARMTH, and I was ABSOLUTELY warm! ME, WARM?! YES! I was shocked that this coat did what it said it was designed to do! This is a phenomenal price for a very stylish, lightweight coat that will keep you WARM!”“Not only is it fashionable, but it’s super warm, too! It shields me from the rain and snow (waterproof exterior) and it helps shield from the wind better than the Columbia-brand ski jacket I was previously wearing. I’m an average-sized woman and I usually opt for a large jacket, but I purchased this in medium. Even with my heaviest sweater on, this coat is the perfect fit, with room to spare. The great thing about this jacket is the zippers that run along the sides. They let out about an inch if needed for those who love to layer their clothes like I do. I also love how, when completely zipped up, the hood covers your entire neck area, leaving only your face exposed to the winter elements, and it’s not tight at all, fitting gently around the head. I love it so much I’m going to buy another in a different color. This winter coat is amazing!”“I love this coat! I’ve lived in New England for nearly 15 years, and I’ve been cold every winter. I decided it was high time to get a warm winter coat, and this one hasn’t disappointed me. When I wear it, I feel like I’m wearing a hug; it’s so cozy! It fits great and it’s stylish, too. I highly recommend it!”“I live in Wisconsin. I bought this coat prior to a trip that included visits to Chicago, Minneapolis, and Amsterdam. One coat had to handle all three places. This one was absolutely perfect! Chicago was cold, Amsterdam was cool and overcast, with rain thrown into the mix on our last day, and Minneapolis was downright frigid — meaning never above zero, and sometimes as low as 19 below. I was comfortable in all three places, and have been at home since I returned. A nice feature of this is that it has a zipper pocket on the left chest that fits my iPhone 8 Plus. This coat was definitely worth waiting for.”“Purchased this jacket with the intention of investing in a coat that will last a few years. So far, so good. I was a little worried as the jacket was a lot lighter than and not as puffy as I thought it would be, but having worn it to and from the bus stops here in Pittsburgh in the winter, I have not felt cold at all. Very warm coat and good length — comes just above the knee. I am 5’4” and average build and weight, so I got a medium. It’s perfect with or without a bulky sweater under it. Just enough room to move around. Great price for a well-made jacket!”“Great investment! I live in Chicago where the winters can be harsh. I commute and often wait outdoors for the train to arrive. We’ve had some sub-zero days, and I’ve been warm without overheating. The length is perfect, it spans below the knee. The coat is stylish, fits well, and has plenty of pockets. The knitted cuffs and fleecy inner collar, along with the hood, really keep the wind out. It’s similar in appearance to another down coat that’s extremely popular, very expensive, and worn by a lot of people here. It’s a fraction of the cost of that other design. I’ve received compliments, and been asked, ‘Where’d you get that coat?’ several times. I’m so glad I bought it. Very happy!”“SUPER warm! But it’s honestly a jacket you wouldn’t want to get wet. Very warm, but not ideal for snow or rain. The arm-length is rather short and I would NOT recommend this product if you have bigger thighs/butt. I’m tall and skinny and can’t comfortably stretch my legs in this without feeling like I’m going to pop out of the bottom of my coat. Overall, very nice jacket.”“Love this. Warm and waterproof. Wore during a bitterly cold wind in NYC recently. I wear a hat under the hood as it isn’t a close fit but other than that — awesome, close-fitting, and stylish.”“Had no idea what to expect when ordering this coat, and was pleasantly surprised. I ordered a size XL, and it fits perfectly — I am 39”/33”/45”, 5’6”, 175 lbs. My recent trip to rural PA put this coat to the test, as temperatures reached around 7 degrees Fahrenheit. I started to get uncomfortable below 10 degrees Fahrenheit, but this jacket kept me warm for anything above that. Like any down coat, feathers come out every once and awhile. All in all, it was a great deal for the price, and seems well-made.”“I recently took a trip to Iceland, where the average daytime temperature was in the low 30s to low 40s (Fahrenheit), and it was forecast to rain on and off for our whole trip with the possibility of snow. I’ve lived in a mildly warm climate my entire life and have never had a need for a heavy waterproof jacket before. This jacket was perfect for my needs! It is totally waterproof and very warm. I’m 5’5” and 125 lbs., so I normally wear a size small in tops; I ordered a small jacket and was pleased to find that it was roomy enough to wear multiple layers underneath without becoming stifling or constrictive. The pockets were easily accessible and held my phone, keys, and sunglasses with room to spare. The breast pocket looks small, but it is large enough to hold a smartphone. The inside of the jacket is some sort of faux fur which was quite soft and cozy. I especially liked that the hood has two straps on either side which can Velcro together across the front of the mouth — in bitterly cold wind this prevented the hood from being yanked off my head and protected my lips. And the jacket was very waterproof — I wore it out and about in the rain and stayed completely dry. Overall I was very happy with this purchase and would highly recommend it.”The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}