{"id": "Is There Anything (Non-Surgical) You Can Do About Your Neck?", "paragraph": "“You can shoot collagen and Botox and Restylane into your wrinkles and creases, but short of surgery, there’s not a damn thing you can do about a neck,” Nora Ephron once said, in her book of musings on beauty and aging, I Feel Bad About My Neck.Even as a 20-something, my increasingly prominent neck wrinkles (I’m an unrepentant sloucher) are a source of concern for me since my family seems genetically prone to a Shar-Pei-like neck. It’s made me think a lot about the so-called neck-enhancing products out there that promise to lift and sculpt this area of the body that’s already notoriously difficult to reverse-age. Can you just apply a cheaper anti-aging face cream to the rest of your body?Paula Begoun of Paula’s Choice — the “cosmetics cop” herself — says that “buying a separate product for [the neck and chest area] is unnecessary and more often than not a total waste of money.” We posed the same question to dermatologists: Is a neck cream a waste of time? And if so, what else should you be using on your delicate decolletage area?Joshua Zeichner, the director of cosmetic and clinical research in dermatology at Mount Sinai Hospital, and Debra Jaliman, an assistant professor of dermatology at Mount Sinai’s Icahn School of Medicine, are actually both pro-neck cream. “Any moisturizer you apply on your face can be applied on your neck,” Jaliman says. “However, a dedicated neck cream is preferred if you really want to target the neck area. The skin on your neck is thinner than the skin on your face, and the muscles on the neck weaker, so a face cream might not be rich enough.” Fair enough, but what should a person even look for in a neck cream?We’ve talked about retinol (and retinol alternatives) plenty here at Strategist, and both Zeichner and Jaliman say that anything that’s promoting cellular turnover like a retinol is going to be a helpful ingredient for sagging skin and fine lines. Zeichner adds that many products for the neck area contain antioxidants, niacinamide, and peptides because they support healthy collagen production, while “some even contain polymers that form a ‘scaffold of sorts’ on top of the skin to help support and firm it temporarily.” Below, we asked for specifics on which products they think make good on their neck firming promises.Here’s one that you could easily find in a drugstore: RoC’s Multi-Correxion 5-in-1 Cream (that tells you by its name that it’s not prescriptive for any one part of the body). Zeichner points out that it contains hexinol, an antioxidant which helps prevent free-radical damage in the skin, and that the product has been clinically tested to improve the appearance of lines and wrinkles in the neck. It also includes SPF, which helps with counteracting photo-aging over time.If you’re a purist that insists on using skin-care products that aren’t packaged in a jar, you could try an intensely moisturizing cream like this one with a pump from La Roche-Posay. “You have fewer oil glands in your neck and the more moisturizing the cream the better,” Jaliman says. “This one is good for both face and neck, and contains hyaluronic acid to help your skin retain moisture, while reducing the neck’s crepe-y appearance.”This cream combines a variety of botanical extracts — like soy extract, horse chestnut extract, and red algae — that forms a protective seal over the skin and protects the skin from free radical damage, says Zeichner.Replenix is a favorite among the derms we poll, so it’s no surprise that their body lotion came up here, too. “A moisturizer with retinol is a good idea if you’re trying to reduce the appearance of fine lines and wrinkles or just trying to prevent any future ones,” says Jaliman, and she recommends this one for the retinol in question and added hyaluronic acid.And if I might poke my head back in to offer up some of my own skin-care advice: if you’re looking for a good, gentle retinol product, I really love this one. I smooth a little of it all over my face and neck before I conk out, and it has a push-up application, so I don’t have to worry about dipping my dirty fingers into a jar. While it’s not cheap, it really helps me wake up feeling like a new person (with visibly brighter, smoother skin).Beyond creams and moisturizers, even something lighter like a sheet mask can help you soak in antioxidants and skin-firming ingredients. Zeichner recommends this Skyn Iceland mask (a brand that is near and dear to our hearts) because it contains botanical extracts that calm inflammation and niacinamide, a B-complex vitamin that brightens and firms the skin.Zeichner also calls out the horse chestnut extract in this Clarins firming face mask that “helps calm skin inflammation to help maintain a strong skin foundation.”The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}