{"id": "The Beauty Advent Calendars to Buy Before They Sell Out, According to a Trend Forecaster", "paragraph": "Editor’s note: Two beauty advent calendars from best-selling brands Jo Malone and Kiehl’s are also now available, so we’ve added those below. The appeal of a giant makeup or skin-care advent calendar as a holiday gift — once you stomach the steep price point — is twofold: There’s a little something for everyone, even if you don’t know the recipient’s taste, and it’s almost always a bargain once you account for the retail price of every item individually. Since these calendars are already hitting the shelves, we consulted a trend forecaster about the best ones to buy right now (eagle-eyed observers may note the exception of the collectible M.A.C calendar, which is sadly only available in the U.K. for now), plus ones that give you much more than you pay for.A curated assortment from a retailer with good taste is one of the savviest ways to shop for these sets. “Some of the beauty of these is knowing and trusting a particular brand, like Space NK,” says Jenni Middleton, the head of beauty at trend-forecasting agency WGSN (with over 15 years of experience in the health, retail, and beauty industries). “You trust that whatever you’re going to get from them is going to surprise and delight you.” This year, that means 25 cult favorites like Sunday Riley’s juno oil, Ouai’s wave spray, Tata Harper’s regenerating cleanser, and others — at a fraction of their usual price.“If you’re talking about a beauty house that has a reputation for pulling together great brands, it’s Look Fantastic,” says Middleton. It doesn’t preview which brands are included in the set until you open it, but online spoilers reveal that this year we’ll see a Glamglow mask, First Aid Beauty Ultra Repair Cream, and Caudalie serum, among others — all things that are ideal for dry, winter skin.Net-a-Porter is another name that’s known for its taste in beauty, with one added bonus being that its products are often uniquely culty, says Middleton, and not something you’d find at your average beauty counter. This year’s set, for example, clocking in at just over $200, includes some of our most beloved (and pricey) hair and beauty brands at the Strategist, from R+Co and Leonor Greyl to Sachajuan and Sunday Riley — so this is one we’d recommend scooping up before it sells out.At a lower price point, for the person who self-describes as a Sephora addict, Middleton calls this affordable Once Upon a Castle advent calendar a “beauty smorgasbord” with lots of variety. Note that these are exclusively makeup minis from Sephora’s in-house collection, with highlights that include its cream lip stain (a favorite of the Cut’s Kathleen Hou) and a blueberry bodywash.Editor’s Note: This Sephora calendar has already sold out, but here’s another that’s still on sale.For a varied mix of high-low beauty, Middleton says QVC’s advent calendar is another that’s reliably good. “QVC is a very well trusted curator of beauty products. And it has expertise in selecting from the premium range and the mass-consumer range. It’s got a very fine heritage of beauty.” This one includes skin-care favorites from Dr. Jart and Kate Somerville, plus makeup finds like a Bare Minerals mascara and It Cosmetics brow gel.Beyond a curated potpourri of minis from bigger retailers, the beauty-obsessed person might want something more specific to their high-end tastes. The selection from Diptyque — one of the cultiest luxury brands — never fails to disappoint, and this year’s advent calendar contains 15 mini-candles, plus perfumes and oils, for $425 (which, when you consider the cost per item, is still a steal). Middleton says this one hits a sweet spot of being both festive, Christmassy, and appropriately lavish: “Who doesn’t want to have candles at Christmas? Anything that’s super indulgent, with bath and body and luxury, from relaxing candles to relaxing fragrances, or body soufflés and body butters, people will want to spend more money on those, especially if they think they’re getting more value out of them.”Editor’s Note: As predicted, this set is already sold out, but you can still buy a festive trio of bath and body products from Diptyque or some sets of candles: three, five, or ten.And though we previously reported that this Jo Malone advent calendar was only available in the U.K., the U.S. version just dropped, and as one of the most highly anticipated beauty calendars every year, it’s already sold out at Saks. It’s sort of the ultimate gift set of 24 perfumes, oils, and candles, if you’re a fiend for your bath and fragrance stuff, so we’d suggest moving on this quickly before it sells out and starts making the rounds on eBay.Middleton likes this beauty set from L’Occitane, too, which tends to be a hit with moms (and people who hoard their hand creams). And when you consider that a single hand cream typically runs for $12 a pop, the fact that you’re getting a pocket-size medley of goodies — from soaps to creams — makes this a really nice investment set for the holidays.Another consistent best seller is Rituals’ advent calendar, which Middleton attributes to the fact that “Rituals has raving fans and such a luxury following.” And it’s got utility beyond your own personal use, she adds: “Everyone’s hosting guests for Christmas, or they’re traveling themselves, so those travel-size shower gels and hand soaps can be useful during that time of year.”For sheer presentation alone (look at all this glitter) plus the hyperpopularity and priciness of Charlotte Tilbury products, we’d also suggest checking out her advent calendar of 12 makeup and skin-care staples, from her iconic Pillowtalk lipstick to her deeply rich magic cream.Don’t miss out on this whopping 24-count skin-care advent calendar from Kiehl’s, either. It’s filled with enough masks, serums, cleansers, and moisturizer minis to last you for months — so at $70, it’s a steal.The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}