{"id": "41 Things on Sale You’ll Actually Want to Buy: From Eastpak to Natori", "paragraph": "We thought that Columbus Day was going to be the last big sales moment in October, but, boy, were we wrong. There are a bunch of great deals to be had right now: Everlane just replenished its selection of sale items, Bandier is having a 20 percent off Friends & Family sale (which applies on top of already discounted things), plus Nordstrom Rack has a bunch of great loungewear we want to wear through January. All that, plus our favorite bath tray, Susan Kelechi Watson’s tote bag, and Fitbits that are hardly ever this cheap.A sleek pair of black leather mules you could clomp-clomp in with socks or tights in brisk weather.Writer Verena von Pfetten adores this bathtub tray for reading, watching shows, and enjoying a glass of wine in the tub — now it’s on clearance for $10 off.These cat-eye glasses are very Linda Rodin.A backpack with leather bottom from Eastpak — the backpack line of hypebeasts. And if you’re looking for another style, there are plenty of other Eastpaks on sale.The ever culty Everlane boyfriend jeans in black are now 20 bucks off.The blue on this flattering cotton shirt isn’t a solid but a superthin micro stripe.A work, weekend, day, night, wear-it-all-the-time shirt.The cotton fabric on this white shirt has an almost sheer quality to it that makes it extra amenable to fall layering.If you haven’t gotten on the fitness-activity-tracker train yet, now would be a good time — these Fitbits haven’t been this cheap for a while.Still looking for a good pair of slim sweatpants for lounging? We love the stuff from ecoconscious brand Alternative.And if you’re looking for something a bit splashier, these would be fun with a simple T-shirt.North Face makes a great puffy vest for layering under your favorite wool coats (in the event that you’re not looking to go full gorp).We wouldn’t tie up all the strings on this kimono jacket, but keeping it in the office as an extra layering piece is a stellar idea.As far as comfortable shoes go, few things touch the orthopedic credibility of Clarks. We like the actual look of these Terris (though we might want to cut off that little leather tassel once we get them).A pair of medium-height shoes that you could wear to brunch, to work, to a party and look totally at ease.We love how tailored this North Face hoodie is — it almost doesn’t look like North Face at all.Have you heard? It’s all about the boxy but cropped jean jacket. This one’s got some nice yarn-dyed fabric, too.Another good layering piece for any winter travels you might have coming up (notice the flattering diagonal quilts along the torso).We love a cactus, but sometimes even they’re too high-maintenance. Best to go with a faux version.We love the smell of Murchison-Hume (see here) and would have the freshest house with this clean starter kit featuring four products: Counter Safe All-Purpose Surface Cleaner, Boys’ Bathroom Cleaner, Heirloom Dish Soap, and Premium Glass Cleaner.Just the sweetest thing tied around a glum handbag.Another contender for “the sweater I keep at my desk when the office thermostat is set to kill me.”A very striking-looking curling iron from California-based luxury hair-tool brand T3.This cozy cardigan is the one you would wanna keep in the closet for weekends when you don’t plan to leave the apartment.Our favorite rain boots right now are Chelsea ones (no muss, no fuss!), and we just love the pointed toe and matte look on this pair.We like how Everlane does slightly turned-up versions of the basics — this is a hoodie, but, like, a sophisticated hoodie.Get your extremely charming and menswear-inspired pj’s on sale here!A seven-inch chef knife from German brand Henckels for a fraction of its original price.The funniest little planter (we look at the mustache and laugh) that you could store pencils and pens in, too.A long wallet that’s almost like a party dress — the wide stripes with just a bit of sheen add a festive touch.The band collar on this cotton shirt gives it just a bit of an unexpected silhouette.Bandier is having a big Friends & Family sale on its site right now (everything’s an additional 20 percent off in your cart), including on these interesting-looking leggings.Here’s another pair of workout tights that are all-black save for a few bands of color at the ankle.Why get real animal skin when you can get an adorable faux hide bath mat?A super work bag that’s reversible and also celebrity-endorsed. Susan Kelechi Watson of This Is Us ﻿owns this and says she got it after seeing it on a friend: “It was a fly bag! I asked her about it, expecting it to be some $300 thing, and when she told me she got it at Urban Outfitters, I was like, “Oh, whaaat Urban Outfitters?” So for my birthday that year, I asked my mom to get it for me, and I now get so many compliments on that bag. I’ve had it for so many years, and I still get compliments.”So ugly, so comfy, and now so on sale.We are very into these jeans: The azure shade of the blue, the crop at the ankle, the straight and slightly baggy legs, plus a high waist.A blank tank top you could sweat in without worry at your next spin session.The softest-looking robe in the prettiest shade of brown-pink. Would make a terrific holiday gift for mom.We all need a good winter boot, but nobody makes sturdy seasonal footwear like Frye. Just be sure to treat the leather.Put this pillow on your couch and bam: instant décor zhuzh.The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}