{"id": "The 21 Holiday Toys to Buy Now Before They Sell Out, According to Trend Forecasters", "paragraph": "Last year, we scoured the aisles of every local toy fair to get the scoop on which toys would likely sell out fast during Christmas and the holidays, driving parents on crazy last-minute hunts for sparkly eggs, squishy fake food, and tiny interactive baby monkeys. This year, looking for an even deeper level of insider information, we reached out to trend experts for their opinions on what toys would top the charts of holiday season 2018 (hint: Hatchimals are still very hot).Not to stress you out or anything, but in the wake of hundreds of Toys ‘R’ Us store closures (we may see a comeback from the retailer in the future but sadly not in time for this holiday season), planning ahead this year is even more essential to holiday shopping success. You’re going to need all the help you can get. Note: We’ve also got gift guides for kids of all ages, including 1-year-olds, 2-year-olds, 3-year-olds, 4-year-olds, 5-year-olds, 6-year-olds, 7-year-olds, 8-year-olds, and 9-year-olds. Below, we talked to experts to find the toys you should know about — and what to stock up on before they’re all gone.For the third year in a row, Hatchimals are dominating the holiday toy scene. Adrienne Appell of the Toy Association has seen the large (about the size of a big grapefruit) speckled eggs that hatch baby animals skyrocket. “The new toy from Hatchimals is something that’s seeing a lot of buzz. We’ve seen a lot of interest from both boys and girls.” When you buy one of these HatchiBabies, the surprise is whether it will be a boy or a girl. So in addition to brushing, feeding, and petting your toy, you can host your own gender-reveal party.Far and away this year’s biggest toy trend is blind-bag or box collectibles. Appell explains, “The huge trend right now are collectible toys and unboxing toys; they’re doing extremely well right now and definitely something kids are asking for.” That makes this set of mini Hatchimals CollEGGtibles — get it — twice as desirable.If you really want to blow your kid’s mind you can pick up the exclusive to Amazon set of a dozen glow-in-the-dark Hatchimals CollEGGtibles while supplies last.Appell likes collectibles because they offer a chance to buy a bunch, making the fun last even longer. “The fun thing about this kind of collectible toy is that kids get excited about building their collections. They’re something to stock up on or that could be good for Hanukkah potentially. Some of them have higher price points, but some of them would just make great stocking stuffers. L.O.L. and L.O.L. Surprise are once again slated to be hot toys this holiday season and are perfect for buying in multiples.”The biggest new product from L.O.L. this year is the Eye Spy Under Wraps series. These dolls come wrapped like little glamorous mummies that you unlock using emoji clues. Get ready because each toy comes with 15 different surprises that you can mix and match with other dolls.“A lot of toys are already flying off shelves just as quickly as they are appearing.” says Laurie Schacht, chief toy officer of the Toy Insider and The Toy Book. Among her picks are Hairdorables, a series of 36 different blind-box dolls (including two rare and one ultra-rare) that kids can collect and style. Their motto is “Big hair, don’t care” and they come with every shade of unicorn hair you can imagine. When you open each box you can pull, peel, and reveal 11 surprises. So in addition to the doll there are ten fun outfits and accessories.Poopsie Surprise Unicorns are selling out fast and already being resold on Ebay. So you’d be wise to snap one up right now. Schacht explained the allure of a unicorn you feed and watch poop. “Brought to you from the same folks who make L.O.L. Surprise, this is definitely going to be one of those “hard to find” toys this year, because it hits on multiple trends: unicorns, “cute poop,” slime, and multiple layers of surprise. These are all things kids love wrapped up into one toy.”On a whole new level of mystery toy unboxing are radical reveals. “Toy companies are ditching basic blind bags and coming up with really cool ways for kids to unbox surprise toys, such as digging through clay, adding water for fizzing reactions, and more.” says Schacht. Wowzer Surprise Magical Pets are snow globes full of bubbles called Orbeez that obscure each pet. To reveal the surprise all you have to do is pour water into the top which “magically” makes the bubbles disappear. Inside you’ll find unicorns, rabbits, chickens, rainbow fish, and a whole lot more.Another creative radical reveal toy is the Scruff-A-Luv, a heartbreakingly cute rescue pet that begins as a matted ball of fur. Once you wash, dry, and comb it the surprise (whether it’s a dog, cat, or bunny) is revealed.For educational fun this lab kit lets you perform fizzy beaker experiments to reveal new creatures. In the box you get two bath-bomb-like reactor pods that you insert in the center beaker then dissolve with liquid by plunging water via the two side tanks. Additional pods will get you closer to collecting all 35. The set also includes extra experiments for kids to do based on the creatures and their home planets.This reveal is actually like digging for hidden treasure. Inside the box you’ll find a reveal map and a gold-wrapped block of hardened sand. Run it under water for 30 seconds and start digging to unearth bones, a skull, a weapon, and a treasure chest that you can assemble after rinsing.Meet Ryan, an internet-famous toy reviewer with 16,679,848 followers on YouTube and his own line of toys. This giant mystery egg includes a plush toy, mystery slime, a squishy toy, and lots more Ryan-approved toys.Resembling real-life fashion influencers, Boxy Girls are trendy dolls that come with a pile of their own packages ready to unbox. Each box is just like a real package with bubble wrap or tissue paper. Inside you’ll find clothes and accessories like statement earrings, colored hair extensions, and a purse shaped like a lime.Now that we’ve properly discussed radical reveals and collectibles, let’s move on to Pomsies. These furry accessories are interactive pets that you can cuddle, wear, and play games with. They have two modes: virtual pet and freeze dance. In pet mode they will react to your touch with changing eye colors, movements, and sounds (including burps apparently). Interactive pets are at the top of the hot list this holiday season and Pomsies are the hottest of them all. Buy one now before they are gone.Last year’s insanely popular virtual pets were Fingerlings. Now they’ve released a new interactive plush doll that looks just like the original except it’s soft and much, much bigger. Each monkey or unicorn will laugh, giggle, snore, or smooch in response to you.Another new release from Fingerlings is the Untamed series. These cute T. rex babies cling to your fingers, turn their heads, and growl. Whatever you do, don’t let them loose in your home — just kidding.Another big trend is surrounding nostalgic characters like Harry Potter, who is popping up with a lot of buzz thanks to the 20th anniversary this year. As Appell puts it, “Parents get really caught up in the nostalgia.” So if you loved Harry Potter you might want to pick up one of these wizard training wands that comes with 11 spells you can learn — before they sell out.Laurie Schacht fits right into the category of nostalgic parents. “I remember reading Harry Potter to my kids when they were little. Toys like the Mystery Flying Snitch and the Wizard Training Wands will turn muggles in to wizards, and I cannot play with these enough.” The snitch really flies — with the help of an invisible piece of string — and will make your kid the most popular on the block.The power of nostalgia is also strong with everything Pokémon this year, especially this interactive Pikachu doll. “Pokémon is really really hot right now, and next year there’s going to be a movie so the hype is just going to continue.” says Appell.Another nostalgic toy from the Toy Insider hot list is this multi-level sewer lair that houses the Teenage Mutant Ninja Turtles and Splinter. Kids can enjoy making the turtles skate down the included ramp, train for battle, and chow down on an extra large pizza.For littler kids Fisher Price has an interactive learning toy that is flying off the shelves. With three modes: game, math, and music, the Rocktopus helps children develop their counting, listening, and rhythm skills.The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best women’s jeans, rolling luggage, bed sheets, coffee makers, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}