{"id": "The Best Gifts for 9-Year-Olds, According to a Child Psychologist", "paragraph": "What to make of a 9-year-old, who’s not yet a pre-teen but definitely not a toddler? “At the age of 9, children begin to form real social relationships and friendships,” says Dr. George Sachs, a clinical child psychologist who specializes in ADD and ADHD treatment on the Upper West Side in Manhattan. “Many children even begin to have best friends and start to have sleepovers with peers.” And as they continue their cognitive development, fourth graders “are able to focus better for longer periods of time and can pursue specific interests,” he says. “They’re able to learn in a holistic way and not just learn that things are ‘right’ or ‘wrong.’” Below are 13 books, toys, games, and gifts for fourth graders that Sachs helped us pick out. We’ve also got gift guides for kids of all ages, including 1-year-olds, 2-year-olds, 3-year-olds, 4-year-olds, 5-year-olds, 6-year-olds, 7-year-olds, 8-year-olds, and 10-year-olds.And if you’re looking for holiday toys, don’t miss the top kid’s toys to buy before they sell out — we talked to experts to find 2018’s hottest toys.By age 9, children can read fiction and nonfiction and often begin to read independently: “They have a better grasp of grammar, contain higher vocabulary, and can formulate longer sentences,” says Sachs. Even though these best-selling books are about a middle-schooler named Greg, “this series is really attune to the life of a fourth grader. These books are excellent because there’s a sense of mastery when a child reads the set and then puts put them on their shelf. There’s a sense of accomplishment.” Parents can also use the books as an opportunity to talk to their kids about potentially troubling social interactions: “If your child has conflicts with his or her friends, now is the time to be involved so they can learn the right ways to navigate social interactions with peers.”Rick Riordan’s New York Times best-selling fantasy-adventure series Percy Jackson and the Olympians is a favorite among kids in middle grade, according to Sachs. “In fact, there’s a character with ADHD,” he says. Based on Greek mythology, the five-book set follows the adventures of Percy, a modern-day 12-year-old demigod and son of Poseidon who goes head to head with a slew of gods and monsters. The series can also provide an opening into talking about puberty: “Speak with your children about changes they may experience and help them feel normal and comfortable regarding the transitions.”Winner of the Newbery Medal and the National Book Award, Louis Sachar’s 1998 novel Holes about the misadventures of teenage boy Stanley Yelnats is another excellent choice for 9-year-olds, says Sachs. While some of the themes in the book may be a little advanced for a fourth grader (forced labor, justice, fate, and history, to name a few), they can help kids better understand the world around them. Parents can take this opportunity to provide their children with age-appropriate information about the world. “If your children ask questions about a news story or something they saw earlier in the day, answer honestly but in a framework they can understand,” says Sachs. “Together with your child, you can discuss the feelings that may arise and ways to be involved to help the world.” After reading the book, have a family movie night by watching the film version starring Shia LaBoeuf, John Voight, and Sigourney Weaver.“Judy Blume books are always classic and will always hold up,” says Sachs. This set includes all five books in the Fudge series, which follows the frustrations of 9-year-old 4th grader Peter Hatcher as he deals with his mischievous younger brother Fudge.“Particularly with kids who don’t like to read, I actually recommend graphic novels or anime,” says Sachs, “because it’s getting them reading, which is the most important part.” City and non-city kids alike will appreciate the adventures of Pablo, the new kid in school who gets separated from his class during a field trip to the Empire State building.As kids continue to build their social lives, games are a great way to encourage friendly competition and group play. This classic card game of matching is always a winner, according to Sachs.“One game that I just played with some kids that I was really surprised at how it held up was Sorry!,” says Sachs. “I think that’s a very simple game that kids can get right away and I recommend that.”As Sachs noted, “the classics really nailed it,” and Jenga is no exception.Apples to Apples is another great game for 9-year-olds, says Sachs.“This is the age, where, anything that has to do with slime is huge with girls,” says Sachs. “I don’t know why, but girls are totally into slime: making slime, talking about slime. If you go on YouTube, you’ll see how many girls at this age are making videos about slime.”Lego is a perennial favorite across all age groups: “You can’t go wrong with Legos,” says Sachs. And academically speaking, kids at this age are beginning to do more complex math problem-solving like multiplication and division and, according to Sachs. To get them thinking out of the box, try this five-in-one robot building set that teaches the basics of coding.By this age, most kids have already learned to bike and scooter with some skill. To take their coordination and independence to the next level, Sachs recommends trying skateboarding.Sachs also suggests rollerblading as another more advanced sport that 9-year-olds can attempt — albeit with lessons.The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}