{"id": "The Pirate Cell Towers of Rural Mexico", "paragraph": "\n                    Local Problems, Global Tech\n                  \n                            Local Problems, Global Tech\n                          Talea de Castro is a four-hour drive through winding mountain roads from the capital of Oaxaca, Mexico. In 2013, the indigenous Zapotec town launched Mexico’s first nonprofit, community-run cell-phone network. Now, Indigenous Community Telecommunications (TIC for its initials in Spanish) provides low-cost cell-phone service to more than 3,400 users in underserved areas across Oaxaca.Commercial cell-phone companies like Telcel and Movistar had declined requests to extend service in this mountainous area known as the Sierra Norte. Talea de Castro, along with other nearby towns, petitioned the federal government for the right to use the radio frequency for their own cell network.Since then, TIC has expanded to 16 other Oaxacan communities, beat a costly lawsuit filed by the Mexican government, and is planning to launch in four more states. Communities that were overlooked by telecommunications companies can now access health services and employment, and talk to far-off family members.TIC picks up the slack in areas that commercial telecommunications companies have overlooked. Rural Mexico lags in both internet and cell-phone connectivity. According to Mexico’s demographic agency, only four in ten rural Mexicans are internet users, compared to 64 percent of the general population. And while 72 percent of Mexicans are cell-phone users, in Oaxaca, a largely rural state, just over 50 percent are.Mexico’s telecommunications sector is dominated by Grupo Carso, a consortium of companies owned by Carlos Slim, a Mexican mogul who is the richest person in Latin America, and currently sits at No. 7 on Forbes’s billionaires list. In 2013, Grupo Carso’s cell-phone service, Telcel, controlled 71 percent of the market. A telecommunications reform was passed in 2014, and competitors like Movistar and Unefón now have a growing share of the market.“For Telcel, it’s not profitable to come out to these communities,” says Erick Huerta, of Rhizomatica, a nonprofit that supports the cell-phone network. “They have a very low profit margin. When they have to do repairs, it’s very costly because they are so remote.”Huerta says the Sierra Norte was fertile ground for the project.“These communities already govern themselves through the usos y costumbres system,” he says, referring to the process in which indigenous communities select their own leaders outside the political-party system.Many rural communities in Oaxaca, accustomed to being ignored by the central government, manage their own resources through assemblies, where community members discuss and vote on issues of common interest like government environmental programs or resolving land disputes. Huerta had experience setting up indigenous radio stations and partnered with social entrepreneur Peter Bloom to launch the cell-phone network.A paper by Huerta, Carlos Baca-Feldman, and Daniela Parra describes TIC as a project where “two communities converge”: the indigenous communities of Oaxaca and hackers, two sometimes overlapping groups. Since the project began in 2013, independent programmers have contributed to developing the open-source software necessary to operate the cell-phone network.Each community within the network installs a base transceiver station, which can operate with solar energy. The station transmits local calls and connects to Wi-Fi to make calls outside of the network.Each user pays 42 pesos ($2.18 USD) a month for unlimited minutes within the network. Twenty-five pesos stays in the community, 15 pesos goes to TIC, and 2 pesos go into an emergency fund for repairs. Calls outside of the network have an additional cost but are cheaper than on a commercial cell-phone plan. With Telcel, a monthlong prepaid plan starts at 200 pesos ($10.33).Huerta says there are currently 3,400 registered users on the network. TIC also has a decision-making assembly, which consists of representatives of the communities that use the cell-phone network and the technical support staff and volunteers.“It’s a nonprofit network, which the community manages. We’re not seeking to make money, so our costs are lower,” says Huerta. Repairs are handled within the network, which is cheaper than commercial companies that send technicians from urban areas. The network not only provides communications services but is building local technical capacity.The Mexican government did not accept the project without a fight.In May 2014, Mexico’s Federal Telecommunications Institute (IFT) granted TIC an experimental permit. In July 2016, TIC received a permanent license to operate its cell-phone service on public radio frequencies. The legal victory was short-lived; IFT then slammed TIC with a million-peso ($50,000) fee for use of the radio spectrum in 2016 and 2017. In April of this year, a federal court ruled in favor of TIC. Now, the IFT is only seeking fees for use of the radio spectrum during the launch in 2016.“It’s been a constant struggle for recognition of indigenous peoples’ rights to have their own forms of communication,” says Huerta.Another nonprofit, Redes por la Diversidad, Equidad, y Sustentabilidad (Networks for Diversity, Equity, and Sustainability), manages the cell-phone network’s legal and permitting processes with the federal government.Connecting indigenous communities in states like Oaxaca to phone and internet service is a game changer to help people access employment, education, and health services. “The change has been radical,” says Huerta. “We’ve talked to taxi drivers who say their business has gone up 30 percent because now people who live outside the town have a way to call them to order a cab.”Huerta says, in other cases, that people have been able to access lifesaving medical care, whether it is a woman who has complications during labor, or someone bitten by a snake while farming. But there are complex challenges to replicating the experience in other places, he says, like scaling TIC’s open-source technology in a way that can compete with the telecom industry.Even so, just this year, TIC secured a new concession to expand satellite-based phone and internet service in Puebla, Veracruz, Guerrero and Chiapas. TIC is working with communities in Brazil that have recently launched their own cell-phone networks. Redes published a detailed manual, explaining how to launch community cell-phone systems.What started as a small experiment in Oaxaca could soon grow globally to connect communities passed over by commercial cell-service providers.“If we really want to connect the next billion people in the world who are incommunicado, we need to start doing things differently,” the manual reads, “and build the technical, economic and regulatory framework to do so.”"}