{"id": "The Gizmos to Buy Your Techie This Holiday (Before They Sell Out)", "paragraph": "If you don’t consider yourself to be tech-savvy, it can be hard to find a good tech gift for the more electronically minded folks in your life, especially since the products themselves are constantly changing. So to figure out which tech gifts and electronics are actually worth the splurge this holiday, I spoke with Ben Arnold, senior director of innovation and trends at the Consumer Technology Association (CTA), which has produced an annual report on consumer technology holiday purchasing patterns for the last 25 years. According to its research, 66 percent of U.S. adults are planning to purchase a tech product as a gift this year, so to help you buy the actually nice gadgets before everyone else catches on, here are 13 electronics and appliances that are bound to be popular this holiday season.Voice speakers, or smart speakers, have been big sellers over the past couple of holiday seasons, and Arnold’s research leads him to believe that they’ll be popular once again, “especially since Amazon released several new products a couple of weeks ago.” He anticipates that smart displays — “which is a screen with all of the smart-speaker features built into it” — are going to be especially popular, like the newest iteration of the Echo Show. With a larger screen and louder speaker than the first-generation Show, this device is better equipped to play TV shows or movies from Amazon Prime Video or Amazon Music; however, you need an Amazon Prime account in order to access most of these features.Google is also launching a new voice-activated speaker display for the holidays, called the Home Hub. This one connects to your Google account, so it can do things like display pictures from Google Photos or play your favorite YouTube videos — along with more standard Google Assistant tasks, like reading out your daily schedule or telling you what traffic on your commute will look like through Google Maps. One advantage of the Google devices over the Amazon ones is that you don’t need to pay for any subscriptions to enjoy most of the functionality, but as far as which of these two smart displays to buy, Arnold doesn’t think one is necessarily “better” than the other. “I think of it more as what is going to complement my life the most as a consumer,” he says. “It just depends on how invested you are in either ecosystem, and that’s really the best way to go about it.”Also new this year is the interest in smart-home devices, like smart doorbells, which can be controlled by voice-activated devices like Echo or Google Assistant. “Connected home products aren’t super exciting to get for Christmas,” Arnold admits, “but I think that the market has gotten to a point where there’s a pretty good level of familiarity and awareness for the products.” Sure, it’s not as cuddly as a teddy bear, but Arnold says it’s a matter of reframing your thoughts on what makes a good gift: “When I think of maybe my mother or my grandmother, something like a security camera would bring them a lot of value and a lot of convenience and some peace of mind.”The biggest thing to consider if you are going to gift a smart doorbell or security camera is which digital assistant the recipient uses. If they’re in the Amazon ecosystem and have an Amazon Prime membership and are maybe getting a couple of packages delivered each week, Ring is going to be the best bet, since it’s owned by Amazon.But for a Google household, Nest is the way to go. The company that’s also known for making smart thermostats was acquired by Google earlier this year, so its products seamlessly integrate with Google Assistant.Another fun add-on gift for someone with a digital assistant in their home would be a color-changing LED light bulb, like the Philips Hue. Just connect to their Echo, Google Assistant, or even Apple HomePod, and they’ll be able to control the light in their homes with their voice. That includes specific programs for nighttime, morning, or even party time, if that’s their vibe. “There’s some excitement there for the right gift recipient,” says Arnold.Arnold anticipates that this will be another good year for headphones, especially for what he calls “truly wireless” earbuds. These are headphones that only connect to your device via Bluetooth, with no cords whatsoever. The front-runner in the space are Apple’s AirPods, those white, wireless headphones that you’ve probably seen all over the gym or the subway. But those only connect to Apple devices, and there are some complaints about sound quality — so if you’re looking for Android-friendly or non-Apple alternatives, Arnold cited Bose as a company making high-quality, truly wireless headphones …… Along with Jabra. The Elite 65e stands out because of its truly wireless and truly noise-canceling in-ear headphones. (AirPods certainly can’t do that.)Approximately one in five U.S. adults plans to buy a smartwatch this holiday, according to CTA’s research, and though it might be the most obvious option, the Apple Watch Series 3 is leading the way in this category. “I think the updates to Apple Watch, especially with the cellular connectivity, has driven some more interest into the products,” says Arnold. “So that’s why I’m not surprised to see that it rates pretty highly in our study as well.”However, Arnold doesn’t discount smartwatches from other brands, and he’s especially excited about some of the advances in fitness trackers. “Those products add more features, things like echocardiograms and more accurate tracking of steps,” he says. Plus, there’s a big emphasis on personalization, with different color watch faces and bands. “I think in the conversation of what is a great gift to get, something that is a little bit personalized plays into the gift-giving dynamic pretty well.”For a fitness tracker that’s a little more analog-looking, Arnold likes the offerings from Withings, a French consumer-electronics company that makes connected health products. “They make an activity tracker, but it looks like a traditional watch, so it’s an activity tracker that looks like a watch but that does not look like a smartwatch,” he says.Drones were another popular holiday gift last year, and CTA anticipates that it’ll continue to be a strong sector in 2018, with expected sales of 1.5 million unions. “Drones are always cool,” says Arnold, and the biggest advances this year are what he describes as form-factor changes. “We’ve seen a lot of drones get smaller and more portable, with the ability to fold the drone up and put it into a bag for easy carrying.” The DJI Spark is described as a “mini-drone,” but it’s still pretty impressive. For instance, you can make the device take a photo while flying midair by waving your hand, no remote control or smartphone required.If you’re looking for a sub-$100 option, the Parrot Mambo is a solid mini-drone. Like the DJI Spark, it has a camera and is easy to fly with a smartphone, but it lacks some of the higher-end features like taking a photo with just hand gestures.One trend that has remained constant over the last couple of years is consumers’ desire for TVs during the holidays. In fact, televisions are consumers’ most-wanted tech gift, according to CTA’s research. “Certainly 4K is the leading technology right now, the step-up technology,” says Arnold. “And what’s exciting about that is, we’re getting more and more 4K content available. So now you don’t just have a 4K set. You’ve also got really great content that’s easy to find that you can watch.” Upgrading to a 4K TV set is what’s driving most of the demand, according to Arnold, and though there are super high-end and expensive options on the market, you can find that technology for less than $300.The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.Get the Strategist's NewsletterSign up for expert shopping tips, exclusive discounts and great deals.Thank you for signing up!Stay tuned for more"}