{"id": "Americans are pumping the brakes on home remodeling, and that might spell bad news for Home Depot and Lowe's", "paragraph": " It's looking like the remodeling boom is starting to fade in the United States — and that slowdown may have implications for home-improvement retailers like Home Depot and Lowe's.  Over the last several years, home-improvement sales have soared. The good times even seeped into US pop culture, as remodeling-oriented reality shows like \"Fixer Upper\" have become TV juggernauts.  But home-improvement retailers didn't have a strong housing market to thank for any of that. In fact, MarketWatch reported that \"the housing market's funk\" had previously boosted the remodeling business. There were too few houses on the market to meet demand from buyers, thanks to the slow recovery of the house-building industry, a reluctance among homeowners to sell houses with low mortgages, and the rise of renting, among other factors.  Homeowners who couldn't find a new house to purchase on the market would instead invest in remodeling their current homes.  But now, according to MarketWatch, \"inertia\" in the housing market is starting to have the opposite effect. An extended period of low for-sale inventories means fewer people are going out and hunting for new homes. House hunters are a major driver of home-improvement spending.  Harvard University's Joint Center for Housing Studies released a report estimating that the explosion of remodeling activity would trickle off a bit in 2019. It's not that remodeling expenditures are expected to decline. The same study predicted that Americans would spend $353.1 billion on home improvements and repairs in the third quarter of 2019 — an increase of $22 billion year over year.  But the Joint Center for Housing Studies has predicted that the percentage of increases in spending will decrease between quarters starting in the first quarter of 2019. That's thanks to a stagnant housing market and rising interest rates, according to MarketWatch. Read more: Home Depot, Lowe's, Tesla, and Wegmans top the list of most-liked companies — employees explain why they have such a cult following Either way, Wall Street has taken notice. Barron's reported that Credit Suisse analyst Seth Sigman recently downgraded Home Depot and Lowe's to neutral, citing his belief that \"moderating home prices\" will leave \"less room for upside for the stocks.\"                                                                                             Home Depot declined to comment because the company's earnings call is coming up next week. A Lowe's representative told Business Insider that it's still confident about rising residential investment and home prices, saying that those factors \"are the key drivers of home improvement growth versus new housing starts.\"  The Lowe's spokesperson added that the \"aging housing stock\" in the US was another sign that Americans are living in their houses longer and viewing those houses as investments.  \"When you combine that strong investment mentality with disposable personal income growth and strong consumer credit, consumers tend to spend more on home improvement projects,\" the spokesperson told Business Insider. \"As they have increased financial ability to invest in those homes, it certainly drives demand for home improvement, both in terms of discretionary remodels and renovations and necessary repair and maintenance projects.\"  Meanwhile, Sigman also told Barron's that it wasn't all bad news for home-improvement retailers. He said Lowe's could benefit from \"plenty of low hanging opportunities for improvement over the next year\" and called Home Depot one of the \"best positioned retailers.\" "}