{"id": "China's sea power is growing— here's what their future carrier strike group may look like", "paragraph": " The Chinese People's Liberation Army is pushing ahead with its ambitious plan to build a modern, capable \"blue-water navy\" that will dominate China's neighbors, showcase Beijing's rising power and one day even threaten the US Navy.  China has one aircraft carrier in operation, another undergoing sea trials, and a third one in development, putting the Chinese navy on track to begin fielding carrier task forces as it gains experience with carrier operations.  China's Type 001 Liaoning, a refitted Soviet \"heavy aircraft-carrying cruiser,\" is the sister ship of Russia's Admiral Kuznetsov aircraft carrier. This vessel was officially commissioned into the PLAN in 2012, and it was declared combat ready in 2016, even though its primary purpose is to serve as a training platform.  \"For what the Liaoning is, I think it's pretty good at its job,\" Matthew Funaiole, a fellow with the China Power Project at the Center for Strategic and International Studies, previously  explained to Business Insider.  The Chinese \"purchased it, they reverse engineered it, they used it to design their second aircraft carrier, and now they are using it as a training vessel to sort out carrier operations, figure out how to integrate it into the fleet, and determine what kind of supporting vessels they need to put with the carrier for their mission,\" he added, suggesting that training with the Liaoning could potentially inform future carrier task force decisions, among other important choices.  The Type 001A, a domestically-produced version of the Liaoning undergoing sea trials, features some improvements over its predecessor, but it is the Type 002, the third carrier in development, that could be a \"huge step forward\" for the Chinese PLAN, according to Funaiole.  It is with these next two carriers that the world may start to see China push ahead with the next stage of carrier operations, specifically task force creation for joint operations.  The Liaoning has set sail with a number of different escorts over the years, but the deployment of effective task forces will require a bit more time, experts argue.  \"To create really meaningful carrier task groups is probably five years out, and a lot of it depends on their actual experience with combat aircraft,\" Tony Cordesman, the Arleigh A. Burke Chair in Strategy at CSIS, told BI.  Chinese carriers lack the ability to go toe-to-toe with the US Navy, although they have an advantage in waters near China because Chinese ballistic missiles \"can reach out almost to the limits of its claims and actually potentially hit a carrier-sized object with a conventional warhead,\" he explained, adding that observers should not \"make the assumption that to make the carriers useful, they have to reach a level of competition that could deal with a really sophisticated US threat.\"  The primary task for Chinese carriers is the prestige mission, experts note, suggesting that the Chinese aim to send a message to their neighbors.  \"The prestige mission is probably the most important one. They are going to be going out to show the flag,\" Bryan Clark, a naval expert and senior fellow at the Center for Strategic and Budgetary Assessments, told Business Insider.  There are several areas of potential interest, with two being the contested waterways around China and the Indian Ocean.  In local waterways, such as the East and South China Seas, Chinese carriers advance Chinese interests by simply serving as displays of military might. \"When it comes to projecting power against smaller states, it's often a matter of demonstrative action or influence,\" Cordesman explained.  Countries in the region may soon find themselves \"dealing with a China that can actually project carrier forces and air power now into areas that they've never been able to really project air power before.\" With that capability, which can be achieved relatively quickly, China can make \"a very real difference in regional power and influence.\"  But China could also extend its reach beyond its immediate neighborhood. Clark expects to see China eventually deploy carrier task forces to the Indian Ocean given Beijing's growing interest in the area.  \"Within the South and East China Sea, they have lots of land-based systems, aircraft, and ships they can deploy out there under the cover of their shore-based air defenses and surface missiles,\" he remarked, \"They need the navy to go over and help protect Chinese interests in the Indian Ocean and along the littorals.\"  China could, for instance, be looking at projecting military power in the Strait of Malacca and along East Africa from Djibouti down to Mozambique and Madagascar, where China has notable business interests. China has already, via legitimate and questionable means, developed a string of ports in Sri Lanka, Djibouti, and Pakistan to support such operations.  \"I imagine a Chinese CTF may be a Type 055, a Type 054, and then maybe three or four Luyangs because they want to make sure they've got a lot of air defense capacity and because they want to make it look like a formidable threat,\" Clark explained, referring to China's new cruiser, as well as the country's capable frigates and destroyers.  \"This includes, in some ways, the classic mix that we would use,\" Cordesman told BI.  A typical US Navy carrier strike group includes the carrier and five ships — one cruiser and four destroyers. But China might deploy even greater numbers.  \"It's likely they are going to want to have more surface combatants than even we might have put with a ship,\" Clark said, pointing to the need for increased air defense capacity due to the limited number of vertical launch system (VLS) cells on Chinese surface ships, which can be loaded with missiles to intercept incoming threats and to strike ships.  A Chinese carrier task force would also require support ships, like ammunition oilers, for certain deployments.  The 4,000-ton Type 054A warships, Chinese stealth frigates designed for fleet defense, are armed with HQ-16 medium-range air defense missiles and a 32-cell VLS in the forward section that is able to fire anti-ship missiles, air defense missiles, and anti-submarine torpedoes,  according to The Diplomat.  The first Type 054A was commissioned into the PLAN in 2005, but China has made some modifications to the ship in recent years. For instance, some of the newer ships of this class feature variable depth sonar and towed array sonar, as well as an improved close-in weapon system.  China is reportedly in the process of developing a 5,000-ton variant, the Type 054B Jiangkai III-class frigate.  These ships, especially the newer Type 052D, are said to be similar to the US Navy's Arleigh Burke-class guided-missile destroyers.  Commonly referred to as the \"Chinese Aegis,\" the Type 052D destroyers feature a 64-cell VLS, with each cell capable of carrying up to four missiles, including the lethal YJ-18 anti-ship cruise missile and the HQ-9 surface-to-air missile. A US destroyer, in comparison, can carry 90 or more missiles in its VLS.  Toward the end of September, a Chinese Luyang-class destroyer challenged a US destroyer, the USS Decatur, to a showdown in the South China Sea during a routine freedom-of-navigation operation. The Chinese vessel is said to have nearly collided with the American warship.  While China designates these vessels as destroyers, the US classifies them as cruisers, due to their large size and role as multi-mission surface combatants. This ship is expected to serve a similar purpose to that of America's Ticonderoga-class cruisers.  This ship, which  began sea trials in August, is armed with 112 vertical launch cells with the ability to fire HHQ-9 surface-to-air missiles, YJ-18 anti-ship cruise missiles, and CJ-10 land-attack cruise missiles.  The main gun is a H/PJ-38 130 mm gun, but there are reports that this vessel could eventually be equipped with a railgun.  Chinese corvettes, like the newer PLAN frigates, feature improved anti-submarine warfare capabilities that could be advantageous to the carrier task force, although it's unclear if China would actually incorporate these ships into a future carrier group, especially considering that the Type 054 frigates can provide the same capabilities.  \"What the frigates and the corvettes have are variable-depth sonars, an active sonar operating at a lower frequency and on a cable that can be lowered down into the water below the [sonic] layer to actually find submarines,\" Clark explained. \"I think the Chinese would deploy a Jiangkai frigate or [Type 056] Jingdao corvette with the task force primarily for [anti-submarine warfare].\"  These ships would play a lesser role in air defense, focusing instead on defending the task force from threats lurking beneath the surface of the sea.  In waters near China, the need for support ships is limited. China can rely on its commercial shipping fleet, as well as various outposts and ports, but at greater distances, the task force will require support ships.  \"I would anticipate the carrier task force is going to include an oiler to support them, and that oiler would be what goes ashore in these different bases along the Indian Ocean to receive supplies and fuel and take that out to the carrier task force,\" Clark told Business Insider.  \"Normally, when the Chinese deploy, such as when they deployed destroyers and frigates for counter-piracy operations in the Gulf of Aden, they've generally deployed two combatant ships and a support ship. They always have an oiler that goes with these ships.\" "}