{"id": "The CEO behind IHOP and Applebee's perfectly illustrates how US restaurants could be one of the biggest winners of Trump’s trade war", "paragraph": " While President Donald Trump's tariffs may be  bad news for retailers like Walmart and Costco, the CEO of IHOP and Applebee's says those chains are set to profit.  \"Our product costs are probably going to come down,\" Dine Brands CEO Steve Joyce told Business Insider last week. \"I don't want to be the economist on this, but  other people have said the tariffs are building up inventories. Inventory build up means lower prices.\"  The good news for Dine Brands is coming at the expense of many US farmers, who are seeing prices for their crops and livestock tumble from the trade war.  That's right: Trump's decision to slap tariffs on steel, aluminum, and $250 billion worth of Chinese goods has actually been beneficial to the restaurants that rely on their crops and livestock for ingredients.  In response to Trump's tariffs, countries like China, Canada, and Mexico responded with tariffs of their own on US agricultural goods. These new duties on American goods, like pork and soybeans, caused importers from those countries to look elsewhere for their agricultural needs and left many US farmers unable to sell products abroad.  The inability to sell these goods to key markets has caused a backlog of supply for US farmers, forcing them to cut prices. The cuts on the agricultural products means that  ingredients for the food used at IHOP and Applebee's gets cheaper.  Combined, IHOP and Applebee's purchase billions of dollars of food each year, Joyce said.  \"We are a significant player in the food industry,\" Joyce said. \"What it looks like is, our overall product mix — the cost of it is going to decline over the next year. That helps with margins.\" Read more:  The full interview with Joyce on IHOb madness, whether millennials are really killing Applebee's, and more» According to  data from Plate IQ, a restaurant invoice management company, the US restaurant industry could save as much as $27 million on major non-seafood ingredients like corn, pork, and cheese this year due to the trade war. "}