{"id": "Casper has a new line of dog beds — I got one for my new puppy, and he's in love with it", "paragraph": "The Insider Picks team writes about stuff we think you'll like. Business Insider has affiliate partnerships, so we get a share of the revenue from your purchase. Casper, the online startup that makes one of our favorite to-order mattresses, plus sheets, and even pillows, wants to help your best friend get a good night's sleep.  In addition to human beds and nap-sized pillows, Casper has released a new dog bed, so that your furry companion can get as comfortable as you.  I recently got the small dog bed for my new puppy, Murray, and he's been absolutely in love with it.  Obviously dogs aren't quite as concerned with aesthetics as their human companions, but Casper worked to make the dog bed as sharp-looking as the rest of their furniture, like the new nightstand and the stylish platform bed. It fits in well in the living room, and we get a ton of comments on it when friends come over — the Casper logo and look are becoming pretty recognizable, and the bed definitely stands out.  I'll admit to being a cynic when I was first invited to test out the Casper dog bed. My dog growing up was never crazy about beds. At least, he wasn't big on sleeping on them — he loved trying to tear them to shreds. We tried a couple of flimsy beds from the pet store and it just never worked.  Murray's in love with this bed though, starting with the day we brought him home. We're crate training him, so he spends the night sleeping in his crate, but as he naps throughout the day, or settles down to chew on a bone, he always hops on the bed, first.  While all dog beds might seem the same — just fabric and padding — Casper actually put a significant amount of research into the product, including hundreds of hours of laboratory testing and even dog sleep studies. Murray loves his Casper Dog Bed — although sometimes he forgets to leave enough room to snooze!                                            David Slotnick/Business Insider                                     After more than 100 prototypes, Casper landed on a  hybrid foam design, incorporating both memory foam and durable support foam to make a comfortable, yet sturdy, sleeping surface. We ordered the small, since Murray is currently about 13 pounds, but we expect him to be around 25-30 when he's fully grown. It's a perfect size for him now — I was initially worried that it would be too small by next year, but Casper says that the beds are designed specifically to be a tight, cozy space for dogs, who tend to prefer small and tight shelters.  Although Murray loves to snooze on the bed, he's definitely rough on it, jumping on or off, or trying to dig into it. Fortunately, the Casper Dog Bed is designed to be ultra-durable, and is even intended for dogs to dig a bit when they settle down.                                             David Slotnick/Business Insider                                     The bed ships in a cylindrical canister and takes about five minutes to assemble. The cover is removable and machine washable, and is easy to spot clean since its made of tight nylon fibers.  It's available in three colors and three sizes, and ranges in price from $125 to $225, depending on the size.  Find the best holiday deals on our Black Friday Deals and Cyber Monday Deals page. Subscribe to our newsletter.. Disclosure: This post is brought to you by the Insider Picks team. We highlight products and services you might find interesting. If you buy them, we get a small share of the revenue from the sale from our commerce partners. We frequently receive products free of charge from manufacturers to test. This does not drive our decision as to whether or not a product is featured or recommended. We operate independently from our advertising sales team. We welcome your feedback. Email us at insiderpicks@businessinsider.com. Find all the best offers at our Coupons page. "}