{"id": "The Fortnite-inspired battle royale mode in 'Battlefield V' won't be playable when the game launches in November", "paragraph": " Battle royale video games have quickly become the most popular sub-genre of first-person shooters, fueled by the popularity of \"Fortnite: Battle Royale\" and \"PlayerUnknown's Battlegrounds.\" When first unveiling their games at E3 2018, the creators of both \"Battlefield V\" and \"Call of Duty\" announced that the newest games in their respective series would feature their own battle royale modes, in an apparent effort to cash in on the trend.  \"Call of Duty: Black Ops 4\" came out on October 12 and its battle royale mode, Blackout, has been the game's most celebrated feature, with longtime fans and competitive gamers alike commending the game's polished take on the genre. Now the developers of \"Battlefield V\" have revealed that their battle royale mode, Firestorm, won't be ready when the game launches on November 20th. Instead, Firestorm will arrive in March 2019 as a part of the game's ongoing content release schedule.  In an October 24 blog post, \"Battlefield V\" developer EA DICE detailed what will be included in the game on launch day, and how new content and improvements will be added in the following months. DICE plans to roll out the World War II shooter's content in three phases using the game's live service, Tides of War. Each new chapter in the Tides of War service will add new maps, modes, and improvements to the game. \"Battlefield V\" will guide players through the stages of World War II with Tides of War.                                            \"Battlefield V\"/EA DICE                                     The first chapter is called Overture and will begin with the game's release. Players will be able to play the game's single-player campaign, battle on eight different multiplayer maps, and explore the game's wide array of weapons and vehicles for the first time. Chapter 2, named Lightning Strikes, will arrive in January 2019, incorporating cooperative multiplayer missions and the classic squad conquest mode. Finally, the third Chapter, Trial by Fire, will introduce the Firestorm battle royale mode and a new Greece map in March 2019.  DICE has promised that Firestorm will be a unique battle royale experience. Like some of the game's other multiplayer modes, Firestorm is limited to 64 players with four-person squads, but the map will be the largest in any \"Battlefield\" game thus far. Firestorm will also include the destructible environments and vehicles that define the series. Beyond fighting other players to survive, teams will also be able to clear specific objectives on the Firestorm map to access more valuable equipment during the match.  While Firestorm is one of the most anticipated additions to \"Battlefield V,\" the game looks to have a healthy amount of content for players to dive into on release. With a roadmap of updates spanning into Spring 2019, early adopters will also have a clear idea of what's on the horizon.  \"Battlefield V\" will arrive on PC, Xbox One, and PlayStation 4 on November 20th. Players who subscribe to EA Origin Access Premier will be able to play the full game on November 9th, while EA Access and Origin Access players will be able to try the game with their play first trial. Those who pre-order the deluxe edition will gain early access to the game on November 15th. "}