{"id": "California wildfires just demolished an entire town and forced the Kardashians to evacuate. Here’s why fire season is getting longer and stronger.", "paragraph": " It's shaping up to be another record-breaking year of devastating wildfires in California. As of today, 7,578 fires have burned a combined total of nearly 1.6 million acres across the state, according to the  National Interagency Fire Center.  The Camp Fire, which lit up northern California towns on Thursday morning, has burned through 20,000 acres and left the town of Paradise, which is home to 27,000 people, in blackened ruins.  Further south, in Ventura County just outside Los Angeles, two fires are blazing along the 101 freeway, a major thoroughfare. The Woolsey Fire, which has burned 2,000 acres so far, forced stars Kim and Kourtney Kardashian to evacuate their homes, People reported.  Nearby, the larger Hill Fire in the Santa Rosa Valley has sent flames roaring through 10,000 acres and is threatening areas close to where the deadly Thousand Oaks shooting happened on Wednesday night.  Even before these fires began, the state had already set a new record for its  largest wildfire: the Ranch Fire (Mendocino Complex) burned through 410,203 acres earlier this fall.  This is not a coincidence.  In recent years, warmer temperatures across the western US have fueled more destructive flames than the region has ever seen. The 2017 fire season, which  scorched vines across California wine country, was the costliest to date, triggering  over $9.4 billion in losses.  The flames aren't limited to one season anymore.  \"We're responding to wildland fires year round now,\" Cal Fire spokesman Scott McLean recently told the Sacramento Bee.                                                                                                                      A breathtaking video featuring Weather Channel Meteorologist Stephanie Abrams shows why that's the case: it's all about heat.  \"Over the past few decades the climate over the western US has become more conducive for wildfires with overall warmer, drier weather,\" Abrams said, as a simulation of dry, hot, overgrown brush heated up behind her.  In a warmer world, there's \"plenty of available fuel to burn,\" she added.  Take a look at how the flames develop more quickly and spread with vigor in warmer, drier weather:  As Abrams noted in the clip, large wildfires burn twice the area now that they did in 1970.                                                                                                                      That trend will likely get worse if we continue putting heat-trapping gases into the atmosphere. California's 2018 Climate Change Assessment report estimates that the average area burned in wildfires will increase 77% by 2100 in a business-as-usual scenario.  For the rest of November, temperatures across the western US are expected to remain above average, according to the latest federal climate reports. Large swaths of California are also looking really dry right now, providing the perfect kindling to spark tough-to-contain fires.  \"We're in uncharted territory,\" California  Governor Jerry Brown said earlier this year. \"Since civilization emerged 10,000 years ago, we haven't had this kind of heat condition, and it's going to continue getting worse. That's the way it is.\" "}