{"id": "Here's how we ranked the most underrated colleges in America", "paragraph": " We recently came out with our ranking of  the most underrated colleges in America.  To determine which schools were underrated, we considered two factors: reputation and future earnings. We figured that schools with mediocre or obscure reputations but whose students made high salaries would be underrated.  We used the following rankings to compile this list:  We specifically looked for schools that had relatively low rankings on the US News list but whose students had high salaries.  We combined these two rankings to find the schools that met our criteria as \"underrated\" — 391 universities and liberal arts colleges showed up in both the US News and income rankings.  The chart below shows the relationship between the two rankings. Each point represents one school, with a school's position on the horizontal axis showing its US News ranking and its position on the vertical axis showing its income ranking.  For both, lower number ranks indicate a better score on each metric, so the best US News scores are on the left and the highest median incomes are on the bottom:                                             Business Insider/Andy Kiersz, data from U.S. News and US Department of Education                                     There is a moderate linear relationship between the two rankings: Schools with better US News rankings tend to also have better post-attendance incomes. That relationship is reflected in the black regression line shown on the chart.                                                                                  Schools that fall along the black regression line are properly ranked. As can be seen in the chart below, there are a lot of schools that are far away from the regression line. These outliers are the schools we are most interested in — namely, the underrated schools, in blue, which have a poor US News ranking but a high graduate-salary ranking.                                             Business Insider/Andy Kiersz, data from U.S. News and US Department of Education                                     Our regression line also makes it possible to come up with a quantifiable measure of just how underrated or overrated a school is: the vertical distance between the point and the regression line (called the  residual in regression analysis). Really large negative residuals indicate very underrated schools. The smaller the residual, the closer the school is to being properly ranked.                                             Business Insider/Andy Kiersz, data from U.S. News and US Department of Education                                     Our ranking, then, is based on those residuals. The most underrated colleges and universities in America are those with the largest negative residuals: schools whose graduates make much higher salaries than their US News rankings would suggest. "}