{"id": "How this CEO used a simple system to nail his work-life balance and build a company that just sold for $8 billion", "paragraph": "createPerformanceMark('first image displayed');Qualtrics CEO Ryan Smith at TechCrunch Disrupt SF 2015.                                            Steve Jennings/Getty Images for TechCrunch                                     When a company  offered to buy Ryan Smith's startup Qualtrics for more than $500 million in the early 2010's, he asked his wife to take a drive.  The deal, and the amount of money it would net his family, was a lot to process. But after just 30 minutes of driving south, the couple decided to turn it down.  They felt earning so much money at once could negatively impact the way they were raising their children. And although Smith had been running his business for nearly a decade, he had gotten good at balancing both work and his personal life, so being an entrepreneur wasn't a major strain on his family.  Together, the Smiths decided to keep Ryan's 800-person survey company private — at least until now, as SAP announced it was buying Qualtrics in an all-cash deal for $8 billion, just days before the company was set to IPO.  It wasn't always easy for Smith to feel successful at both home and work. He, like many executives, uses a CEO coach to help him keep things balanced. He likens work-life balance to a plane that can easily go lopsided and constantly needs to be stabilized. One wing represents his family's needs, the other the needs of his work. When he's on a business trip, for example, one side of the plane tilts down. When he returns to his family and clears out the weekend for his children, it's tilted back up.  Smith's CEO coach taught him a way to plan for success that can be implemented every week. He described it to a group of fellow CEOs at a conference in Ireland in 2014.  The coach asked him which jobs he was responsible for. Smith replied that he was:  The CEO coach then asked him what he could do for each job that week to make him feel successful. He noted that if he took his wife on a date and bought her a surprise bouquet of flowers, that might make him feel like a good husband. And if he taught his daughter to ride a bike, he would feel like a better dad. Ryan Smith describes work-life balance as a plane that constantly needs to be stabilized.Flickr/Daniel GiesHe also found that he could combine tasks on his list to achieve everything quickly. If he was really productive, every task written on Sunday could be accomplished by Tuesday.  For example, if he took his daughter to his parent's house and taught her to ride a bike in their cul-de-sac, he could be both a good father and son.  So Smith's weekly job list began to look something like this:  Smith learned that people often plan for one phase of life (\"I'm going to sell my company by the time I turn 30.\") But they either don't know which steps to take to achieve that goal, or they don't plan what to do after the goal has been achieved.  His CEO coach's plan breaks daunting life goals into weekly tasks, so people don't wake up one day and realized they've let major priorities slip.  Shortly after Smith explained this success tactic on Friday evening, he left the conference. Others stayed out late and partied at a local pub, but Smith drove 3 hours to Dublin and booked an early flight home to Utah. That way, when his children woke up on Sunday morning, they'd be able to spend all day with their father. "}