{"id": "A judge just slapped down Republicans' claims of fraud in Florida amid an increasingly chaotic recount", "paragraph": " A Florida judge denied Gov. Rick Scott's request that law enforcement seize and monitor ballots and voting equipment when they're not being used in the state's midterm recount effort.  \"I don't think I have any evidence to enter a mandatory injunction right now,\" Judge Jack Tuter  said on Monday in response to Scott's Sunday suit. \"If someone in this county has evidence of fraud or irregularities, they should report it to a law enforcement office.\"  Tuter also requested that both Democrats and Republicans \"ramp down the rhetoric\" surrounding the contentious gubernatorial and Senate races in Florida. Both are undergoing recounts as a result of their razor-thin margins, and Tuter argued there is a need to assure Floridians — and Americans — of the integrity of the state's electoral process.  Scott — who his leading Democratic Sen. Bill Nelson in the Senate race by 0.14 of a percentage point, or around 12,000 votes — filed suit on Sunday, seeking emergency injunctions against local elections supervisors in two Democratic strongholds in South Florida, Broward and Palm Beach counties.  In the complaint, Scott wrote that he was concerned election officials would \"store election equipment and ballots in an unsecured facility outside the view of the public.\" Democrats and others argued that impounding the equipment isn't necessary because it's being stored in a secure facility and there's no evidence that anyone has or could tamper with it.  Following President Donald Trump's lead, Scott has accused elections officials in his state of electoral corruption and of overseeing widespread voter fraud.  \"Their goal is to keep mysteriously finding more votes until the election turns out the way they want,\" Scott said Thursday.  Florida's secretary of state, appointed by Scott, and Department of Law Enforcement has insisted that there are no credible allegations of election fraud to investigate.  Since Election Day last Tuesday, Trump has repeatedly made unsubstantiated allegations about the vote counts in Florida, claiming that officials are making up votes.                                                                                                                                              \"An honest vote count is no longer possible-ballots massively infected,\" he tweeted Monday, asserting that Scott and Republican gubernatorial candidate Rep. Ron DeSantis had won their contests. Read More: Chaotic recounts are underway in Florida, as Georgia and Arizona scramble to finalize results in key races Republicans, including Scott, are charging that elections officials in the two counties have a record of \"incompetence and irregularities in vote tabulations.\" They point to a recent court ruling that Brenda Snipes, the Broward County elections supervisor, oversaw the illegal destruction of votes in a 2016 congressional contest.  The office has since been under state monitoring — a point that Democrats say undermines Scott's claims of rampant fraud. (Monitors from Scott's administration deny his fraud claims).  \"He also can't win because he had his own staff there since the day of the election — multiple people,\" Mitch Ceasar, the former longtime chairman of the Broward Democratic Party, told INSIDER of Scott's lawsuit. \"It's all distraction. It's what I call the shiny object — don't look over here, look at the shiny object over here.\"                                                                                                                                              Ceasar added that the GOP lawsuits are a \"form of voter suppression, in futuristically,\" because they have the potential to undermine voters' trust in the electoral system and depress engagement.  The Florida Division of Elections ordered recounts on Saturday in three tight statewide races for US Senate, governor, and state-agriculture commissioner.  Scott filed two other lawsuits late last week alleging that local election officials were hiding vote counts from the public, and the court ordered that the vote information be turned over. And he filed another on Saturday to block the chief elections official in Broward Count from submitting votes that were tallied after noon on Saturday, which was the deadline to submit unofficial vote counts to the state. "}