{"id": "Most states, including Texas and Florida, now require showing ID to vote. Here's the full state-by-state breakdown.", "paragraph": " Voter engagement has already skyrocketed ahead of Tuesday's midterm elections in the form of early voting methods, but plenty of voters nationwide are set to cast their ballots in person.  States vary widely on the rules for acceptable forms of identification at the polls. More states require photo IDs than not, but still differ in their technicalities.  See what ID you need to cast your ballot ahead of Election Day:                                             Shayanne Gal/Business Insider                                     For more information on your state's requirements, check out this guide from the National Conference of State Legislatures, or scroll down for our state-by-state breakdown.  Voters are required to present a valid photo ID. See all acceptable forms of ID here » Non-photo identification is required.   See all acceptable forms of ID here » A voter can either present a photo ID that includes a name and registered address, or two forms of non-photo ID that include the voter's name and registered address. See all acceptable forms of ID here » Voters can present a valid photo ID at the polls or cast a provisional ballot after signing a sworn statement attesting to their identity.  See all acceptable forms of ID here » Voters are not required to show ID at the polls, but may be asked to provide one form of valid ID at the polls if it is their first time voting.   See all acceptable forms of ID here » Voters must provide a valid form of ID to vote in person, but it does not have to include a photo.  See all acceptable forms of ID here » Voters must provide a valid form of ID to vote in person, but it does not have to include a photo. See all acceptable forms of ID here » Voters must provide a valid form of ID to vote in person, but it does not have to include a photo. See all acceptable forms of ID here » Voters are required to present an ID that includes a photo and signature.  A second form of ID will be required if the photo ID does not display a signature. See all acceptable forms of ID here » Voters must provide a valid form of photo ID to vote in person. See all acceptable forms of ID here » Voters must provide a valid form of ID to vote in person, but it does not have to include a photo. See all acceptable forms of ID here » Voters must present valid government-issued photo ID or sign an affidavit.  See all acceptable forms of ID here » Voters are not required to show ID at the polls, but may be asked to provide one form of valid ID when registering to vote. See all acceptable forms of ID here » Voters are required to present a government-issued photo ID that includes a name and expiration date. See all acceptable forms of ID here » Voters are required to present valid, government-issued photo ID or voter ID card. See all acceptable forms of ID here » Voters are required to present valid, government-issued photo ID. See all acceptable forms of ID here » Voters are required to present ID before voting, but it does not have to include a photo.  Election officers can also confirm the identity of a voter by personal acquaintance. See all acceptable forms of ID here » Voters must present a valid photo ID that includes a name and signature.  If a photo ID is not presented, a utility bill, a payroll check, or another government document that includes the voter's name and address is acceptable in addition to signing an affidavit. See all acceptable forms of ID here » Voters are not required to present ID.  If the voter is registering at the polls on Election Day, an ID and proof of residence is required.  See all acceptable forms of ID here » Voters are not required to show ID at the polls, but first-time voters who registered by mail must provide a valid form of ID at the polls. See all acceptable forms of ID here » Voters are not required to show ID at the polls, but first-time voters who registered by mail must provide a valid form of ID with or without a photo at the polls. See all acceptable forms of ID here » Voters are required to present photo ID at the polls or sign an affidavit attesting that they do not have any form of photo ID.  See all acceptable forms of ID here » No ID is required.  Voters are required to present photo ID to vote in person. See all acceptable forms of ID here » Voters are asked to present ID at the polls, but with or without a photo.  If a voter has no ID, he or she is allowed to cast a provisional ballot. See all acceptable forms of ID here » Voters are required to show ID at the polls, but it does not need to include a photo. See all acceptable forms of ID here » Voters are not required to show ID at the polls, but first-time voters may be asked to provide one form of valid ID. See all acceptable forms of ID here » Voters must sign in the election board register at the polls, which is compared with the signature on the voter's original application to vote or another form of government-issued ID. See all acceptable forms of ID here » Voters are required to present photo ID at the polls.  If a voter is unable to present a photo ID, a poll worker will take a photo of the voter and attach it to an affidavit, which the voter must sign unless they object to being photographed for religious reasons.  See all acceptable forms of ID here » If a voter did not provide valid ID when registering, ID is required at the polling place.  See all acceptable forms of ID here » Voters are required to show ID if they registered by mail, and may submit photo and non-photo ID. See all acceptable forms of ID here » No ID is required.  Only first-time voters who registered by mail are required to present ID or cast a provisional ballot. Find more info here » Voters are required to present ID that includes a name, address, and date of birth. See all acceptable forms of ID here » Voters must provide their full name and current address along with a valid form of ID, which does not need to include a photo.  If a voter is unable to present a form of valid ID, a driver's license number, state identification number, or the last four digits of a Social Security number may be submitted to cast a provisional ballot. See all acceptable forms of ID here » Voters are required to provide either government-issued photo IDs and county election board voter identification cards.   A voter who is unable to present a valid form of identification may cast a provisional ballot after signing an affidavit.  See all acceptable forms of ID here » Voters are required to provide a driver's license or state ID card number while registering before voting by mail. See all acceptable forms of ID here » First-time voters and those new to their polling place are required to show ID, which does not need to include a photo.   Voters unable to provide ID will be able to cast a provisional ballot.  See all acceptable forms of ID here » Voters are required to provide a photo ID.   Voters unable to provide photo ID will be able to cast a provisional ballot if the signature given matches the one on the voter registration record. See all acceptable forms of ID here » Voters are required to present a photo ID.  Voters can receive a free photo ID from a voter registration office by providing his or her name, date of birth and the last four digits of his or her Social Security number. See all acceptable forms of ID here » Voters are required to show photo ID at the polls or sign a personal identification affidavit.  See all acceptable forms of ID here » Voters are required to present valid government-issued photo ID at the polls. See all acceptable forms of ID here » Voters are required to present a photo ID at the polls.   If a voter tells poll workers they cannot obtain an acceptable form of a photo ID, the voter can present a non-photo form of identification and complete a \"Reasonable Impediment Declaration\" before they are allowed to cast a regular ballot.  See all acceptable forms of ID here » Voters are required to present an ID with a name and photo or two forms of ID that include a name and address. See all acceptable forms of ID here » Voters are not required to present ID unless it is their first time voting and they registered by mail. See all acceptable forms of ID for registration here » Every voter in Virginia must present ID at the polls or cast a provisional ballot.  See all acceptable forms of ID here » Voters are not generally required to submit ID to vote by mail. See all acceptable forms of ID for registration here » Voters are required to present ID at the polls, with or without ID. See all acceptable forms of ID here » Voters are required to present photo ID at the polls. See all acceptable forms of ID here » Voters are not required to present ID at the polls, and first-time voters may present ID with or without a photo. See all acceptable forms of ID here »"}