{"id": "The Northern Mariana Islands — a US commonwealth — just took a direct hit from Super Typhoon Yutu, the strongest storm of 2018", "paragraph": " Super Typhoon Yutu made a direct hit on the Northern Mariana Islands early Thursday morning, lashing the US commonwealth as a Category 5 storm with winds of up to 180 mph.  Yutu is the strongest storm to form this year, and is believed to be the strongest storm to ever hit the Marianas.  Satellite imagery from the NOAA shows that the storm passed directly over Tinian, a small island with a population of a little more than 3,000.             Tinian is located in the Northern Mariana Islands, a US commonwealth.AP/NOAAYutu is believed to be the strongest storm to ever hit the Marianas.AP/NOAA Tinian played an important role in World War II, as the launch site for the atomic bombings on Hiroshima and Nagasaki, according to AtomicHeritage.org.  As Yutu crossed over the US Commonwealth of the Northern Mariana Islands, the walls shook in Glen Hunter's concrete home, a tin roof over the garage blew away and howling winds terrified his cats.  \"At its peak, it felt like many trains running constant,\" Hunter, of Saipan, wrote in a Facebook message to The Associated Press. \"As its peak, the wind was constant and the sound horrifying.\"  On Wednesday night, the weather service in Guam issued dire warnings of possible destruction of homes and others buildings. \"Collapse of some residential structures will put lives at risk,\" the update said. \"Airborne debris will cause extensive damage.\"            Taga Beach on the small island of Tinian is seen above sometime before the storm.RaksyBH/Shutterstock The update warned of falling glass from blown-out windows, electricity and water outages for days or weeks after the storm passes and fallen trees isolating residents.  \"Gonna be quite a scene when the sun comes up,\" Hunter wrote to the AP early Thursday.                                                                                                                                  Hunter, 45, has lived on Saipan since childhood and is accustomed to strong storms. \"We are in typhoon alley,\" he wrote, but added this is the worst he's experienced.  Power went out the previous afternoon and Hunter was bracing for months without electricity or running water. All government offices and schools shut down two days ago. A few gas stations ran out of gas by Tuesday evening, he said.  \"We knew it was going to be big,\" he said, \"but wow.\"  Meteorologist Matthew Foster in Honolulu said Yutu is moving quickly enough that the main concern will be the strong winds, not huge amounts of rain that have been associated with other recent hurricanes.  \"It's a very powerful storm,\" Foster said. \"It's going to be more of a wind damage threat versus rain.\"                                                                                                                                  A super typhoon would be the equivalent of a category 4 or 5 hurricane.  The Northern Marianas are about 3,800 miles west of Hawaii, and have a population of about 55,000 people. Most of the population is concentrated on the island of Saipan.  Waves of 25 to 40 feet are expected around the eye of the storm and flooding is likely, forecasters said.  A typhoon warning was in effect for Saipan, Tinian and Rota and a tropical storm warning was in place for Guam and other southern islands. "}