{"id": "Lionel Messi scored a goal, created another, but then fractured his arm and is now sidelined for the biggest FC Barcelona match of the year", "paragraph": " Lionel Messi needed just two minutes to create a goal when FC Barcelona played Sevilla at Camp Nou on Saturday, then scored one himself 10 minutes later.  It looked like world soccer was about to get treated to yet another Messi masterclass, but the forward suffered a horrific fall in the 17th minute, badly injured his arm, and was substituted off of the field.  The injury looked so bad, former Barça striker Gary Lineker, who presents the popular British soccer highlights show \"Match of the Day\", tweeted that his arm \"may be broken.\"  Lineker said that the player's first half cameo was \"all we're going to get.\" He added: \"Looks like he's seriously damaged his arm… may be broken.\"  The global news network beIN Sports also tweeted that the injury could be a \"dislocation or fracture.\"  The clash occured just over a third of the way into the opening half of the Sevilla game. Barcelona was already leading 2-0 and Messi, who was by far the most effective player on the pitch, tussled for the ball alongside Sevilla midfielder Franco Vazquez.  Messi got tangled up, fell over Vazquez's leg, and landed awkwardly on his arm with his right elbow bending in the opposite direction to his body.  Messi received treatment on the sidelines, had a bandage wrapped around his arm by club physios, and left the field using his shirt as a sling, according to beIN Sports. He was eventually replaced by Ousmane Dembele.  After the match, FC Barcelona confirmed the severity of the injury on its Twitter account.  \"Tests carried out on the first team player Leo Messi have confirmed that he has a fracture of the radial bone in his right arm,\" a statement said. \"He will be out for approximately three weeks.\"  The injury leaves FC Barcelona without its best player one week before its biggest match of the year so far — the highly-anticipated El Clásico against bitter rival Real Madrid on Sunday, October 28.                                                                                                                      Prior to the Sevilla game, Messi was Barça's standout performer with an overall La Liga rating of 8.43 from eight outings, according to statistics website Whoscored.com. As Barcelona's next best player is Philippe Coutinho with a rating of 7.35, Messi's absence will be felt.  Barcelona beat Sevilla 4-2. "}