{"id": "What it takes to become an astronaut", "paragraph": " Following is a transcript of the video. Douglas Hurley piloted the final flight of the Space Shuttle program, in July 2011 and will be among the first to fly in SpaceX's Crew Dragon in 2019. Here's what their training program is like. Douglas Hurley: Coming from the military, at that time I'd been in the military about 12 or 13 years when I was selected, so you know, coming to NASA from the military as far as going into another training program is fairly similar. I think NASA took some lessons learned from military training, especially Flight School for me, was very much an analog to the kind of training we had here.  To become a fully qualified astronaut, candidates train for about 2 years. It can be extremely physically demanding. Hurley: My first six-hour run in the EMU, the space suit, was probably physically, the most challenging thing I've done here. It's a pressurized suit. You're working with gloves that don't exactly fit you very well. You're doing a lot of work with your hands, almost entirely for six hours, you're working with your hands and arms, so that was extremely physically challenging I think, from start to finish. By the time you're done with a six-hour NBL run, you're pretty well exhausted.  Astronauts also undergo extreme mental challenges. Hurley: The psychological challenge, I think for a lot of us, you know, we come from very high-energy, high-workload, high-tempo type jobs and we're always going and doing things and working for that next goal. So I think psychologically, mentally, getting through that part of it is, I think, for most of us, pretty challenging. You know, year after year working hard to be assignable to a spaceflight and then actually getting one, it is, I think for me, it was psychologically the most challenging thing that I've dealt with maybe in my entire professional life.  Being under constant pressure isn't always bad. It helps astronauts learn how to stay calm under pressure. Hurley: I think it's just over the course of time, you get to that point where you know the best way to deal with these things is to try to take the emotion and the human aspect of being nervous out of the equation, because in the end, it doesn't really help you solve the problem. And I think the other part of it is, it's just a case of you do it repetitively enough in simulations that I think you get to a point where you not only trust yourself, but you trust your crewmates and you trust the folks on the ground, that together, everybody kinda keeps a cool head and you work through the problem.  So what does it take to become an astronaut? Hurley: I think, by and large, the first trait is someone who is willing to do anything for the team, you know a team player. Obviously other things that I think are very helpful, is you need to be proficient. You need to know your job. You need to keep a cool head. You need to kinda look at the problem pragmatically, but I think the biggest thing, by far in my opinion, is someone who is willing to do whatever it takes for the good of the team to make the mission successful. "}