{"id": "Bernie Sanders says the 'simple truth' is Trump is an ‘authoritarian leader,’ and several experts tell INSIDER they largely agree", "paragraph": " Sen. Bernie Sanders on Monday said the \"simple truth\" is that President Donald Trump is an \"authoritarian leader\" who does not care about democracy, and several experts on authoritarianism tell INSIDER they largely agree with his assessment.  The Vermont senator's comments come amid ongoing election drama in several states and the president's baseless claims of voter fraud. On Monday, Trump called for a recount in Florida to cease and for the Senate and gubernatorial elections to be called in favor of the Republican candidates.  \"An honest vote count is no longer possible-ballots massively infected,\" Trump said, with no evidence to support this assertion. Read more:  Trump says 'honest' election no longer possible in Florida, demands election be called for Republicans In what was seemingly a response to Trump's remarks, Sanders tweeted, \"Here is the simple truth. Donald Trump, like his friends in Russia, Saudi Arabia and North Korea, is an authoritarian leader who does not believe in democracy.\"  Sanders called for election officials in states where results are still being reviewed to \"ignore the rantings of this president\" and \"COUNT EVERY VOTE.\"  The White House did not immediately respond to a request for comment from INSIDER. Sen. Bernie Sanders.                                            Getty/Tasos Katopodis                                     Beyond the backlash over Trump's recent attempts to discredit the electoral process in the US, he's also faced repeated criticism for his anti-media rhetoric and  routine praise for autocratic rulers such as North Korean Leader Kim Jong Un, whom the president in September said he's  \"in love\" with.                                                                                             Read more:  Trump administration accused of behaving like authoritarian regime after revoking CNN reporter Jim Acosta's credentials and sharing suspicious video In August, experts at the UN warned his rhetoric against the press  could increase violence against journalists. Correspondingly, some critics have  blamed Trump for recent acts of violence or  attempted acts of violence against media outlets.  The president's recent proud embrace of being labeled a  \"nationalist\" has also stirred controversy, and led to a  veiled rebuke from French President Emmanuel Macron as Trump visited France over the weekend.  In this context, some experts are applauding Sanders' characterization of Trump as an authoritarian.  Ruth Ben-Ghiat, a historian at New York University who specializes in authoritarianism and fascism, told INSIDER she is \"glad that Sen. Sanders is using the term authoritarian to describe [Trump].\"                                                                                              \"There is no doubt that Trump has authoritarian inclinations,\" Ben-Ghiat said. \"His labelling of the press as the 'enemy of the people,' use of threat — including announcing that he personally is violent, by  boasting about shooting someone in January 2016 — need for loyalty, humiliation of all those around him, and admiration of leaders who have stifled democracy, are merely some of the qualities that he has in common with authoritarians past and present.\"  Ben-Ghiat added that Trump's \"attempts to derail the unfolding of free and fair elections by saying that votes cast should not be counted is merely the latest episode.\"  Between Democrats taking the House in the 2018 midterms and the escalating probe into Russian election interference led by special counsel Robert Mueller, Ben-Ghiat predicts \"we will see much more of this behavior as Trump feels pressured.\"  Trump is only interested in \"consolidating his own power and protecting his financial interests,\" Ben-Ghiat said, \"and he'll do whatever he needs to do to accomplish that.\"                                                                                             Read more:  Three recounts, baseless voter fraud claims and mixed messages from candidates: Here's what's going on with the Florida elections Cas Mudde, a political scientist at the University of Georgia who's an expert in populism, extremism, and democracy, expressed similar sentiments.  \"I think it is fair to characterize Donald Trump as an authoritarian leader constrained, for now, by a liberal democratic system,\" Mudde told INSIDER.  Mudde added, \"From his various statements, and preference for rule by executive decree, it is clear that Trump does not like the constraints of politics of compromise, between institutions and parties.\"  Sheri Berman, a professor of political science at Barnard College with expertise in democracy, populism, and fascism, offered a somewhat more cautious assessment of Sanders' comments on Trump's leadership style.                                                                                              Berman told INSIDER that Trump's behavior, such as questioning vote recounts and making unsubstantiated claims about voter fraud, is \"clearly\" not \"consistent with democratic norms and procedures.\" In this handout photograph provided by The Strait Times, North Korean leader Kim Jong-un (L) with U.S. President Donald Trump (R) during their historic U.S.-DPRK summit at the Capella Hotel on Sentosa island on June 12, 2018 in Singapore. U.S. President Trump and North Korean leader Kim Jong-un held the historic meeting between leaders of both countries on Tuesday morning in Singapore, carrying hopes to end decades of hostility and the threat of North Korea's nuclear programme.                                            Kevin Lim/The Strait Times/Handout/Getty                                     \"On the other hand, the US is not Russia, North Korea, and Saudi Arabia,\" Berman added. \"Unlike in those countries, Trump does not control all political institutions and actors and so while his comments and actions have immense consequences, he cannot, alone, determine political outcomes.\"  In short, even if it's what Trump desires, Berman said it's \"hard to be an authoritarian in a non-authoritarian system.\"  Berman said it would perhaps be \"more accurate\" to describe Trump as an \"authoritarian-inclined leader.\" But she also concedes that wouldn't have been as effective a message for Sanders given he made his statement on Twitter, where \"no one goes for nuance.\"  Similarly, David Rothkopf, a foreign-policy expert and visiting scholar at the Carnegie Endowment for International Peace, said we should be wary of calling Trump an authoritarian in an absolute sense.                                                                                              \"I think it is more fair to say Trump has strong authoritarian impulses, that cannot be denied,\" Rotkopf told INSIDER. US President Donald Trump and Russian President Vladimir Putin.Chris McGrath/Getty Images \"He is drawn to other authoritarian leaders. His actions have a strongly authoritarian element to them from his efforts to undermine the rule of law while suggesting he himself is above the law, to his constant attacks on the institutions that are the bulwark of our democratic system from free elections to the Department of Justice to freedom of the press, to his use the military and other branches of government as props to promote his own personal agenda and enhance his own personal power,\" Rothkopf said.  \"But to say he is an authoritarian suggests that the checks within our system against such behavior have failed altogether. That is not the case,\" Rothkopf added.  Rothkopf pointed to Democrats' recent success in the midterms as a strong sign authoritarianism has not taken hold in the US. He also pointed to the apparent resistance against Trump's agenda within his own cabinet as a sign he's not a full-blown authoritarian.                                                                                              \"Left to his own devices Trump would be an authoritarian or worse, that seems certain. And he will seek to attack and undermine our system as long as he is in office, that too is certain,\" Rothkopf added. \"But my money is on our system standing up to him and containing those impulses and thwarting his ambitions.\" "}