{"id": "These founders left Google to chase a vision of healthier screen time for their kids — and their flagship product has become a hit in classrooms and homes", "paragraph": " Circa 2012, Pramod Sharma was working on a Google project to scan physical books and put them on the internet.  Like many at Google, Sharma would drop off his daughter each morning at the company's on-campus daycare facilities. Over time, he recognized something both ironic and worrisome.  There were no tech products in the room.  \"They were very proud of their wooden blocks from Germany,\" Sharma told Business Insider in a recent interview.  However, he knew how much his daughter loved any screen that was put in front of her, and thought there had to be room for a positive piece of technology in her life. With his experience combining the analog and digital worlds for Google Books, ideas started to bubble up. And so, in 2013, Osmo was born— with the help of his co-founder and fellow Googler, Jerome Scholler.  The big idea: A proprietary hardware accessory that snaps onto any iPad, using mirrors to connect the movements a child makes on a physical game board with animations on the tablet's screen. Osmo recently added certain games to be compatible with Android and Amazon Fire tablets as well.  Five years later, the Osmo device can be found in 30,000 schools and a half-million households worldwide. The company has raised over $38 million, has more than 60 employees, and last week announced the release of its 14th game, \"Detective Agency\" — inspired by the popular 90s board game, \"Where in the World Is Carmen Sandiego?\"  Osmo's games are geared towards children between the ages of three and nine and can range in price from $19 to $100. The hardware piece for tablets costs $29. Osmo, the company, has raised over $38 million in venture capital financing, and has more than 60 employees Osmo's latest game, \"Detective Agency\"                                            Osmo                                     Osmo's magic lies in the strength of its games, says Sharma                                                                                                          One game called \"Monsters\" prompts kids to draw objects (like a magic wand), and once their drawing is complete, a replica appears on the screen being used by the animated monster. Another, called \"Coding Awbie\" — which the company says is \"easiest way to introduce coding to your child\" — allows kids to create commands for their on-screen character by snapping different combinations of blocks together.  Sharma says he understands the hesitation of parents, especially parents in Silicon Valley, to expose their children to too much screen time.  \"At a young age, you don't want to make them addicted to media,\" Sharma tells us. \"If I'm a three-year-old and someone gives me a choice between Coke or milk, I'll drink Coke all day long. Children don't have that differentiation of what's good for them.\"  But Sharma argues that not all screen time is equal. He tells us there's a difference between passive screen time (where a child is merely sitting in front of a screen, watching) and active screen time (where a child is called to engage).  Osmo prides itself on creating active screen time for children.                                                                                                          \"At Osmo, everything has to be active. You have to engage, otherwise there's no experience,\" Sharma explains. \"A screen doesn't change unless you do something — that's a very fundamental thing. By design, Osmo makes you do things.\"  Osmo — which Sharma describes as a \"child's first console\" — also considers the length of time children spend on a game in a single sitting. It tries to limits each session to around 30 minutes. Internally, he explains, the company is less concerned with \"time spent\" as a metric to determine a game's effectiveness and more interested in \"puzzles solved.\"  In the future, Osmo wants to allow for a more personalized experience for children, recommending games for them based on areas of learning where they could use improvements.  \"My daughter is in 4th grade, and I actually don't know what her weak points are,\" Sharma tells us. He imagines most parents feel the same way and believes Osmo is the perfect platform to help.  As a first-time CEO, Sharma tells us that the hardest and most exciting part of his job thus far has been learning how to be a leader.                                                                                                          \"We are a very diverse team and leading them has been an interesting experience,\" he says. \"You can lead engineers, you can lead designers, you can lead business people, but leading them all — it's always challenging for anyone starting a company.\"  Sharma says his favorite moment thus far leading Osmo came with the launch of its latest game.  \"'[Detective Agency]' is the first product where I had zero contributions,\" Sharma told us. \"That is the most rewarding part because you can build a system where people can innovate, and good ideas can come up. That to me is extremely fulfilling.\"  As for getting Osmo into Google's daycare center, Sharma says that may be possible now with the release of \"Detective Agency\" — the company's first game compatible with Android.  Get the latest Google stock price here."}