{"id": "A huge question looms over Trump after the CIA reportedly concludes the Saudi crown prince ordered Jamal Khashoggi's killing", "paragraph": " The White House is in a bind following the CIA's reported assessment that Saudi Crown Prince Mohammed bin Salman ordered the murder of dissident journalist Jamal Khashoggi at the kingdom's consulate in Turkey last month.  The crown prince was widely believed to have played a key role in carrying out the Khashoggi killing even before the CIA came back with its findings. The Saudi government denies the allegation, and so far, President Donald Trump has mostly accepted its narrative.  But the CIA's finding, which was made in high confidence and first reported by The Washington Post, represents the most definitive US assessment to date directly linking Saudi Arabia's de facto ruler to Khashoggi's murder.  In light of that, Trump is faced with a critical question: will he accept his own intelligence agency's assessment or Saudi Arabia's? Read more:Here's everything we know about the troubling disappearance and death of Saudi journalist Jamal Khashoggi CIA director Gina Haspel traveled to Turkey late last month to address the investigation into Khashoggi's death. She met with Trump when she returned to the US a few days later, and national-security experts said it was highly unlikely she didn't fill him in on what the agency had determined.  On Saturday morning, Trump told reporters he had not yet been briefed on the matter.  Ned Price, the former senior director of the National Security Council under President Barack Obama, told INSIDER the odds that the CIA had high confidence in its assessment and yet did not brief Trump right away \"are virtually nil.\"  \"Both of these things almost certainly can't be true,\" he added.                                                                                                                      Indeed, several Trump aides told The Post he had already been shown evidence of the crown prince's alleged involvement in Khashoggi's murder but was looking for ways to avoid blaming him for the journalist's death.  Later Saturday, the White House said Haspel and Secretary of State Mike Pompeo briefed Trump on the CIA's assessment while he was en route to California.  The agency has also reportedly briefed Congress, which has signaled that it will seek to punish Saudi Arabia for its actions. As of Saturday evening, Trump had not publicly commented on whether he trusted the CIA's findings. President Trump has boasted about how he made \"hundreds of millions\" of dollars from the Saudis.                                            Mark Wilson/Getty Images                                     Robert Deitz, the former general counsel at the National Security Agency, said the president's silence was par for the course.                                                                                                                      \"When Trump is in a bind, he tends to temporize, and I think that's what's going on here,\" Deitz told INSIDER. \"The bind is this: Saudi Arabia is the mother of all arms buyers. They're also a very important Middle East ally. So how can the US hold [Crown Prince Mohammed] and Khashoggi's killers accountable while also preserving the alliance? Because it's very challenging for the US to simply dump Saudi Arabia.\"  After saying he hadn't been briefed on the Khashoggi investigation Saturday morning, Trump touted the US's economic ties to Saudi Arabia, calling the country a \"great ally.\"  \"They give us a lot of jobs ... a lot of business, a lot of economic development,\" he said.  While Saudi Arabia is an important economic partner, fact-checkers have pointed out that the president often overstates the value of the alliance by inflating the number of American jobs Saudi arms sales would create and how much it would help the US economy.  Trump and his advisers have also stressed the strategic advantages of a US-Saudi alliance, particularly when it comes to containing Iran. But Middle East experts say that with or without a partnership with the US, Saudi Arabia would still push back against its neighbor because of roiling tensions between the two countries that go back years.                                                                                                                     Read more: US hits 17 Saudis with sanctions over Khashoggi, including crown prince's top henchman who reportedly directed killing via Skype Glenn Carle, a former CIA covert operative, offered a blunt assessment of Trump's response — or lack thereof — to the Khashoggi investigation.  \"The main pillar of this administration when it comes to the Middle East is that the president wants to make nice with [Crown Prince Mohammed] and Saudi Arabia because he likes dictators and because the Saudis have bought the man,\" Carle told INSIDER.  Trump said last month that he has \"no financial interests in Saudi Arabia.\" But during his presidential campaign, he boasted about making \"hundreds of millions\" of dollars from Saudi customers and said he would maintain close ties with the kingdom because it invested in his properties.  Ultimately, Carle said, Trump will likely \"pay lip service to how killing is bad,\" but will go back to business as usual by supporting the crown prince and Saudi Arabia.                                                                                                                      Randa Slim, the director of conflict resolution at the Middle East Institute, echoed that view.  From the onset of the Khashoggi case, she told INSIDER, Trump made clear that \"maintaining a close relationship with the de-facto ruler of Saudi Arabia will trump the need for justice and accountability\" for Khashoggi's murder. Trump stunned observers when he rebuffed the US intelligence community in favor of Russia in Helsinki.                                            Thomson Reuters                                     If Trump were to continue trusting Crown Prince Mohammed over the CIA after being briefed on the matter, it would be reminiscent of his response to Russian President Vladimir Putin after the US intelligence community concluded with high confidence that Russia meddled in the 2016 election to elevate Trump to the presidency.  When Trump flew to Helsinki for a high-stakes meeting with Putin over the summer, he shocked observers when he said at a press conference that he trusted Putin's denial of Russian interference over US intelligence findings.                                                                                                                      \"The president has shown time and again that he will only agree or praise or take note of something that supports his particular perspective, and everything else he will either ignore or denigrate,\" Carle said. \"Thus, his approach to the Saudis will be the same as his approach to Russia. He doesn't care if it's an ally or an adversary; it's all about what supports his own personal interests and beliefs.\" Read more:National security experts warn Trump is behaving more and more like a 'controlled spy' Trump, who has a long history of business ties to Russia, often praises Putin and says it's important for the US to foster closer ties with Russia so the two countries can cooperate on matters of mutual interest, like counterterrorism.  He has faced resistance, however, from Congress and his own administration, which continues approving sanctions and other countermeasures against Russia even as Trump calls for a cozier relationship with the Kremlin.  The looming quagmire with Saudi Arabia is similar, but with one key difference.                                                                                                                      \"The CIA concluded with high confidence that [Crown Prince Mohammed] ordered the assassination of a US resident,\" Slim said. \"While Putin stands behind many of his critics' assassinations, no intelligence agency, let alone the CIA, has publicly stated he ordered the killings himself.\" John Haltiwanger contributed reporting."}