{"id": "When Michelle Obama told her mother she hated being a lawyer, her mom told her to 'make the money, worry about being happy later'", "paragraph": " Former first lady Michelle Obama's mother gave her a key piece of perspective at a turning point in her career.  Town & Country on Monday published an interview between Oprah Winfrey and Obama, whose new memoir, \"Becoming,\" is set to be released Tuesday.  The women discussed the former first lady's journey from her working-class upbringing on the South Side of Chicago to becoming a lawyer, and Obama described her sense of pushing herself on a particular life path:  \"In the book, I take you on the journey of who that little striving star-getter became, which is what a lot of hard-driving kids become: a box checker. Get good grades: check. Apply to the best schools, get into Princeton: check. Get there, what's your major? Uh, something that's going to get me good grades so I can get into law school, I guess? Check. Get through law school: check.\"  Obama did not enjoy her time in a law firm. Winfrey quoted Obama as saying in her memoir that she \"hated being a lawyer.\"  Obama described her feelings of doubt about her career path: \"I wasn't a swerver. I wasn't somebody that was going to take risks. I narrowed myself to being this thing I thought I should be.\" Read more: Michelle Obama says 'What do you want to be when you grow up?' is the worst question you can ask a kid Obama said she remembered the moment she confided in her mother about disliking her job, in which she spent much of her time doing document production.  \"So I shared with her in the car: I'm just not happy. I don't feel my passion,\" Obama said. \"And my mother — my uninvolved, live-and-let-live mother — said, 'Make the money, worry about being happy later.' I was like [gulps], Oh. OK. Because how indulgent that must have felt to my mother.\"                                                                                  She continued: \"When she said that, I thought, Wow — what — where did I come from, with all my luxury and wanting my passion? The luxury to even be able to decide — when she didn't get to go back to work and start finding herself until after she got us into high school. So, yes. It was hard.\"  Eventually, she met her husband, Barack Obama, who she said was \"the opposite of a box checker.\"  \"He was swerving all over the place,\" she said.  The interview and Michelle Obama's memoir include several other intimate details of her path to the White House,  including about her early relationship with her husband and the  challenges she faced in conceiving her children. "}