{"id": "Tesla will start making cars at its upcoming factory in China faster than expected", "paragraph": " Tesla said on Wednesday that it will accelerate its production timeline at its upcoming factory in Shanghai. The automaker said it plans to begin parts of Model 3 production at the Shanghai factory in 2019, though it did not specify when in 2019 production would begin. Tesla also said all vehicles in China will be available only to Chinese customers.  In July, Tesla said it expected construction for the factory to begin  \"in the near future\" and projected it would take around two years after construction began before production started. Tesla has said the Shanghai factory could produce around 500,000 vehicles starting about four to five years after construction begins.  Reuters reported on Wednesday that Tesla will make its upcoming Model Y SUV, which Tesla CEO Elon Musk has  said will begin production in 2020, at the Shanghai factory, citing a Shanghai government filing.  Vehicle production has been a major point of focus for Tesla since it introduced the Model 3 sedan in July 2017. Musk  acknowledged in April that the automaker had attempted to automate too many production tasks at its factory in Fremont, California, where it makes the Model S, Model X, and Model 3, and would use more human workers in the assembly process.  Tesla initially struggled to hit its production targets for the Model 3 due in part to excessive automation at the Fremont factory. In May 2016, Musk  estimated the company would make 100,000 to 200,000 Model 3s during the second half of 2017, though Tesla made just 2,685 Model 3 vehicles in 2017.  At the end of June, Tesla hit its long-delayed goal of making 5,000 Model 3 vehicles in one week and, at the beginning of this month, Tesla said it  produced 80,142 vehicles during the third quarter, which was the highest quarterly production rate in the automaker's history and 50% higher than its previous high, achieved in the second quarter of this year.  The automaker  posted adjusted earnings of $2.90 per share (compared to an analyst forecast of -$0.15 per share) on $6.8 billion in revenue (compared to an analyst forecast of $6.315 billion) during the third quarter. Have a Tesla news tip? Contact this reporter at mmatousek@businessinsider.com. Get the latest Tesla stock price here."}