{"id": "There's a battle brewing over Google's $1 billion high-tech neighborhood, and it could have major privacy implications for cities", "paragraph": " Imagine living in a city that can monitor almost everything you do in a day, from when you're stopped at a traffic light to when you've left the oven light on for too long. Then imagine that data could be shared with companies or governments in unprecedented ways. That could be the reality awaiting future residents of  Quayside, a 12-acre planned neighborhood along Toronto's Eastern Waterfront.  The project, which could cost  up to $1 billion, is being developed by Sidewalk Labs, the urban innovation arm of Google's parent company, Alphabet. After first announcing the neighborhood in 2017, Sidewalk Labs  revealed more of its plans in August, which include futuristic innovations like heated roadways built for driverless vehicles and robots that deliver mail and transport garbage through underground tunnels.  One particularly striking feature has led to a growing battle between the developers, data experts, and local activists.  Sidewalk Labs plans to install a layer of sensors that measure things like traffic, air quality, noise, and building occupancy. The technology behind these ideas will most likely consist of  cameras or lasers that detect objects as they pass by.  This would make it easier to regulate building temperatures, reduce energy usage, and even provide transit discounts for low-income residents.  It's all part of  the company's mission to develop \"the most measurable community in the world.\" It's achievement that might seem groundbreaking, but for those worried about privacy, the Quayside neighborhood could set a disturbing precedent for the future of data collection.  When plans for Quayside were first unveiled, there was plenty of excitement surrounding the project. On the day of the announcement, Canadian Prime Minister Justin Trudeau  said the new neighborhood would transform the area to \"into a thriving hub for innovation.\"  But the prime minister's claim that the project would \"put people first\" has fallen under increasing scrutiny over the last year. One of the  many fears circulating throughout the Toronto area is that data will be shared with other governments or entities outside Canada.  These fears  come amidst an increasingly tense relationship between the public and major  tech companies that share their information. Though Sidewalk Labs has promised to make all of its public data anonymous, the company has not agreed to keep its data local.                                                                                                                                              Sidewalk Labs believes that data can be governed under Canadian law without exclusively residing in the country. This would allow companies — and particularly startups — outside Canada to compete in the global digital market.  The way to protect this data, according to the proposal, is to develop strong contracts and methods of encryption. But the nature and terms of these contracts remain unclear.                                             Sidewalk Toronto                                     \"If you don't define a boundary, you don't know when there's a breach,\" said Saadia Muzaffar, a technology expert who  resigned from the project's  Digital Strategy Advisory Panel over a lack of transparency. The panel, which formed in April, focuses on guiding the fair and safe use of data technology in the Quayside neighborhood.  The Globe and Mail  reports that at least three other panel advisers are weighing their resignations. Even Toronto's mayor, John Tory, has expressed \"acute concern\" over a lack of clear communication with the public.  Earlier this week, Sidewalk Labs took a major step to clarify its intentions.                                                                                                                                              The company  issued a lengthy proposal for an independent trust that would serve as the gatekeeper of \"urban data,\" or data that is collected from urban citizens in a public place (like an intersection or park). According to Sidewalk Labs, there are no existing laws that determine ownership of this information, and few regulations that successfully protect it.  The data trust would hold Sidewalk Labs to the same standards as any other company or government body. Sidewalk Labs also plans to allow other companies to deploy digital infrastructure in Quayside — a move that would encourage healthy competition, but introduce a new set of players with their own interests.  But what about those who simply don't want their activity monitored? According to Micah Lasher, the head of policy and communications at Sidewalk Labs, this practice is already happening with or without their knowledge.  \"Urban data is a fact of life in cities around the world, and more so with every passing day,\" he said, citing the  surveillance cameras that have become ubiquitous in many neighborhoods.  While Sidewalk Labs says its data will be used to benefit the Quayside community, its desire to spearhead the collection process has many experts worried.                                                                                                                                              \"It's not up to Sidewalk Labs to implement a data trust. It's between a government and its residents,\" said Bianca Wylie, the co-founder of Tech Reset Canada. Wylie questions the need for Sidewalk Labs to collect personal information, worrying it could be used to further its financial interests.  \"No matter how much you build in privacy by design, this project is about power,\" said Nasma Ahmed, the executive director at Digital Justice Lab. \"Sidewalk Labs has approached this project and talked about it in a way that makes you feel like they are the governing body.\"  Her words call to mind  criticism of Mark Zuckerberg, who has  referred to Facebook as \"more like a government than a traditional company.\"  Sidewalk Labs is not making that claim — in fact, quite the opposite — but it hasn't been able to fend off the association. \"People have understandably wanted to see evidence that [data is not part of our business model],\" said Lasher. \"In some respects, [our proposal] provided that.\"                                             Sidewalk Labs                                     Though Lasher maintains that \"much of the decision-making [for the data trust] will ultimately be up to policymakers and government,\" there's still a chance that the company will give some input. \"These are not finished policies,\" Lasher said. \"At some point, we may have ideas that we put forward [on how the trust should be structured].\"                                                                                                                                              That's the problem, according to data experts, who have taken to Twitter to express their opposition. It's also part of the reason why Muzaffar resigned in early October. After witnessing what she calls a \"disappointing\" reaction to citizens' concerns from both Sidewalk Labs and its partner, Waterfront Toronto, Muzaffar decided she had seen enough.  Among the many issues raised in her  resignation letter, Muzaffar referenced  reports that Sidewalk Labs had asked potential consultants to either hand over intellectual property or issue an exclusive, royalty-free license. That could force competition to dwindle, since not all firms would be willing to agree to these terms. As Wylie wrote in a recent  blog post, it also \"confirms one of the ways Sidewalk Labs may be expecting to make a return on its investment.\"  Both Wylie and Muzaffar have also called out Sidewalk Labs for suggesting that its data partnerships would need to align with its corporate mission — another sign that the company may be prioritizing its own interests above those of residents. Lasher said the phrasing was \"an error, nothing more.\"  Amid this back and forth, many have criticized the timing of Sidewalk Labs' proposal. Muzaffar called it \"hasty,\" while Wylie called it \"pure public relations theater\" and \"a panicked, rushed move after weeks of bad press.\"  Though Lasher insists that Sidewalk Labs has been brainstorming these solutions since before the Quayside launch, he acknowledges the pressure from the public. \"Of course we read what's written and said about the project,\" he said. \"These are ideas that have evolved, developed, and benefited from what we've heard.\"                                                                                                                                              The question now is whether Sidewalk Labs will listen to feedback from its latest proposal and allow it to guide its future efforts. According to Muzaffar, this will require more careful reflection than the company has demonstrated thus far.  \"There's this false sense of hurry,\" she said. \"So what if we take time and do this right? I think we should.\"  Get the latest Google stock price here."}