{"id": "Growth for Microsoft's cloud business Azure sees the biggest slowdown in three years", "paragraph": "Microsoft dazzled Wall Street by topping revenue and profit expectations in its  quarterly results on Wednesday, but a close look at one notable part of the company's business reveals a worrisome trend.  Azure, the name of Microsoft's cloud computing product line, is a central plank in Microsoft's mission to reinvent itself as a powerhouse in the new generation of cloud services. But in the three months ended September 30, Azure's revenue growth slowed to its lowest clip in years.  Microsoft does not break out the actual revenue from Azure, but said that Azure's revenue growth rate in the first quarter of its fiscal 2019 year was 76%. That's pretty good for most businesses, but it represents deceleration from the 89% growth it chalked up in the previous quarter. In fact, it's the slowest growth since Microsoft began to report the growth rates in its fiscal 2016.  And if you look at the past 12 quarters, the slowdown in Azure's revenue growth is even more apparent: Fiscal 2019 Q1: 76%Fiscal 2018 Q4: 89%Q3: 93%Q2: 98%Q1: 90%Fiscal 2017 Q4: 97%Q3: 93%Q2: 93%Q1: 116%Fiscal 2016 Q4: 102%Q3 120%Q2: 140% Azure is one of the most vital fuels for Microsoft, along with Office. Amazon Web Services is Microsoft's  strongest competitor for the Azure product, as both tech giants are key players in the  cloud wars. Analysts from Wedbush believe there will be opportunity to convert enterprises to using Azure based on discussions they've had with partners and customers.  Microsoft ascribed the deceleration to the \"law of large numbers.\" During the company's conference call, CFO Amy Hood said the Azure number on its own was less important than the overall \"hybrid demand,\" for Microsoft's cloud services, which benefit from its productivity apps and other products.  For now, investors appear willing to take Microsoft's word for it. Shares of the company were up 2.4% in after hours trading following the company's earnings report on Wednesday. This is a subscriber-only story. To read the full article, simply click here to claim your deal and get access to all exclusive Business Insider PRIME content. Get the latest Microsoft stock price here."}