{"id": "The new 'Call of Duty' has a surprisingly fantastic Battle Royale mode aimed directly at 'Fortnite'", "paragraph": " For years, \"Call of Duty\" was the biggest shooter in the world — but not anymore. \"Fortnite\" now rules the world, followed closely by \"PlayerUnknown's Battlegrounds,\" with \"Call of Duty\" trailing in third at best.  There's one main reason for that: the massive 1-vs-100 game mode known as \"Battle Royale,\" based on the movie on the same name. It's this mode, popularized by \"PUBG\" then exploded by \"Fortnite,\" that's become the new standard in multiplayer shooters.  In this year's \"Call of Duty,\" a multiplayer-only entry named \"Black Ops 4,\" the crucial Battle Royale game mode shows up with a very \"Call of Duty\" name: Blackout. Having spent the last several days sneaking around in Blackout, I've got nothing but positive things to say.  There's a foundational gameplay cycle at the heart of every Battle Royale game: Fall from the sky into the match, scrounge for weapons and supplies, then carefully make your way towards the ever-shrinking safe part of the map while murdering anyone in your way.  \"Call of Duty: Black Ops 4\" doesn't change that cycle, but it tweaks it in one crucial way: by adding four-wheelers.  There have been vehicles in other Battle Royale games — most notably in \"PUBG\" — but they've never controlled as well as the vehicles in the Blackout mode of \"Black Ops 4.\" More spefically, the four-wheeled ATVs found all over the place in Blackout serve as an excellent means of quickly navigating the sprawling map.  They're loud, and you're completely exposed to gunfire while riding them. But they're also incredibly fast and versatile. Mastering the art of slowing down enough to leap off without hurting yourself is crucial.  More importantly, marauding around the massive landscape of Blackout on an ATV is incredibly fun. It turns the monotonous grind of scrounging for loot into a far faster, more thrilling experience. I like to carefully park my ATV in a garage, so anyone on foot is unlikely to realize I'm inside a nearby building loading up on ammo and health kits.  As I approached a seemingly empty house, I could hear someone stomping around upstairs. Someone was up there, literally running from room to room, making a racket in the process.  So I slowly approached the side door and opened it. A loud creak sounded throughout the house, and suddenly the racket upstairs stopped as whoever was up there caught wind of an intruder downstairs.  Then I closed the door, without entering. A second creak. Then I opened it again. Another creak. Then I closed it again.  I moved a few feet away, towards a window — one tap on my melee button and the window smashed. I then slowly backed away from the house while crouching, so as not to make any noise.  I wasn't there to fight — I was just there to mess with another player. This is the delightful stupidity of playing Battle Royale games. Half the fun is exploiting the game's mechanics — the importance of audio cues to know who's nearby, in this instance — for your own enjoyment.  In \"Black Ops 4,\" this is as true as ever. Better: It's easier than ever to dependably execute the same actions. There's no messiness of control (like \"Fortnite\"), or potential for mistake (like \"PUBG\") — \"Call of Duty\" is a super polished game franchise, and \"Black Ops 4\" is no outlier.  All of which is to say one thing: Blackout is just as silly as all the other Battle Royale modes, but it plays better because it's a \"Call of Duty\" game. \"Call of Duty\" was the standard in shooters for so long because it's incredibly accessible.  It's attractive, and the guns feel good to shoot, and the objectives are straightforward. If you're into lore, there's some to be found — but it's really just a light backdrop for the shooting.  That \"accessibility über alles\" approach extends to Blackout in a lot of little ways, but the most obvious way is how healing works. Unlike the other modes of \"Call of Duty\" multiplayer, you've actually got a shot at survival if you're spotted first in Blackout.  When you're hit, you lose health (starting at 150 and dropping to zero). But first aid and med kits and even trauma kits are scattered all over the world in such high abundance that you'll almost always have several on your person. Healing takes just a second or two, and you can heal all the way back to 150 — over 150 if you snag a trauma kit.  There are health kits and potions in competing Battle Royale games, but their implementation here is subtly different. It's fast, like most things in \"Call of Duty,\" and is always locked to a single button.  Even the system for choosing which type of healing kit to use is simple and intuitive, dubbed \"Quick Equip.\" Just a quick tap up on the d-pad and you can easily access and swap out all sorts of gear. It's a huge step up over how similar things are handled in \"Fortnite\" and \"PUBG.\"  At $60, \"Call of Duty: Black Ops 4\" is expensive for what's being offered: a bunch of different multiplayer modes. But if you're into \"Call of Duty,\" you're probably buying the game for multiplayer — and maybe some of that Zombies mode — anyway, right?  But \"Fortnite\" is free, and \"PUBG\" is $30, and $60 for just Blackout is simply asking too much. If you're at all interested in playing the other game modes — standard multiplayer stuff like Deathmatch/Team Deathmatch and Control, or the Zombies co-op mode — then the $60 asking price is far more justifiable.  For the rest of us who don't buy the new \"Call of Duty\" every year, Blackout is something special that's absolutely worth your time — when it comes down in price. As someone who fell off the \"Call of Duty\" train long ago, I'm tremendously surprised to like Blackout as much as I do.  It may be the best version of Battle Royale yet, but the asking price is too high for now.  Get the latest Microsoft stock price here."}