{"id": "You don't need to be rich to get a prenup — here's how much you should expect to pay", "paragraph": " Contrary to popular belief, you don't need to be rich to get a prenup. Regardless of how much they have in assets, more millennials are signing on the dotted line before saying \"I do\" thanks to the several benefits of prenups.  But do you need to be rich to be able to afford a prenup?  Maybe, maybe not. The cost of a prenup is typically $2,500, according to US News & World Report. Estate-planning attorney Ann-Margaret Carrozza told LearnVest couples can expect to pay $1,200 to $2,400 — but that's \"if your finances are straightforward.\"  The cost of a prenup depends on where you live. In places with a higher cost of living, like major urban cities, you can expect to shell out a bit more for a prenup.  For example, the cost to negotiate and draft a prenup in Manhattan can range from $7,500 to $10,000 per party, Kelly Frawley and Emily Pollock, partners in the Matrimonial and Family Law Department at Kasowitz Benson Torres LLP, told Business Insider.  But besides location, there are a number of other factors that can affect the cost of a prenup.  Max Barger, wealth strategist regional manager at PNC Wealth Management, told Business Insider he's seen the cost of negotiating and drafting prenuptial agreements range from three-figure fees to high five-figure fees. \"It all depends on what you are protecting, if the negotiations are contentious, the quality of counsel you select, and the client's own socio-economic level,\" Barger, who is based in McLean, Virginia, said.  He added: \"Costs vary widely geographically, but also based on the practice and reputation of the attorney drafting. That said, it is likely that you and your spouse-to-be should each prepare to spend a similar amount on a prenuptial as you would for your foundational estate planning documents (trusts, wills, powers of attorney, etc…).\"  Keep in mind that you're likely to be on clock with the attorney — a prenup is rarely negotiated on a flat fee, Barger said. \"There are far too many variables, and the risk of negotiations dragging out is a reason an attorney will want to charge you on an hourly basis.\"                                                                                              The more you haggle, the more hours you'll end up paying for.  If you haven't discussed your expectations of what you want in the prenup beforehand, or you convey a different message to your counsel than what was previously discussed, this will make the prenup process take longer than expected, explain Frawley and Pollock. Negotiations can also be prolonged, they said, if the opposing counsel doesn't focus their practice in the matrimonial and family area because they aren't as familiar with some standard provisions and courtesies.  According to Barger, negotiating around sensitive areas like inheritance for children from a prior marriage, alimony obligations, and reasons for fault-based claims such as infidelity can cause an otherwise friendly negotiation to go sideways.  There are also less emotional and more technical issues that can prolong haggling, Barger said, like tax issues — how you'll file income taxes as a married couple or how you'll split gifts, for example. \"These are examples of important issues if you are affected by them, but there is little passion about them,\" he said. \"Unless they are left unaddressed and you or your heirs are left to fight over the mess you left.\"  Other costly issues could be complex issues in your own affairs, or your family's, according to Barger.                                                                                              For example: You own a business and want to protect interest in said business. \"Your business partners probably don't want your ex-spouse as a business partner,\" Barger said. \"Then you and your attorney will be spending some face time thinking through what could go wrong and how to keep that from happening.\"  \"Also, where there are existing complex arrangements like trusts, LLCs, and partnerships that protect wealth and save taxes — that may need to be revealed to your future spouse, and it may be something they want to talk through with you, with counsel present, naturally,\" he added.  That's up to you.  \"You have to decide how important it is to protect what you want to protect, and what that is worth to you,\" Barger said. \"Depending on your circumstances, though, the prenup may be the most important estate planning document you sign in your life.\"  In Barger's opinion, a prenup is priceless. \"If you want to pay less, you may sacrifice quality — although paying more doesn't necessarily guarantee quality,\" he said. "}