{"id": "The coffee chain once purchased by Michael Avenatti and Patrick Dempsey is finally, truly dead", "paragraph": " Tully's coffee chain — once acquired by attorney Michael Avenatti and \"Grey's Anatomy\" star Patrick Dempsey — is officially dead.  Five years after Global Baristas  purchased roughly 40 Tully's locations, the company has agreed to never operate a coffee chain, or any other food or beverage business, under the name again.  After months of legal back-and-forth, Keurig Green Mountain and Global Baristas  entered a permanent injunction in late September that prevents Global Baristas from using any Tully's trademarks or related names. The injunction follows a  January complaint in which Keurig Green Mountain demanded that Global Baristas stop using the brand, alleging that the company failed to pay $500,000 in licensing fees for 2016 and 2017.  Keurig Green Mountain, which owns the Tully's brand and wholesale business, will continue to sell Tully's branded coffee.  The injunction represents the practical death of a coffee chain that created controversy for Avenatti in recent months, as the attorney's star has risen in the political arena.  The attorney, who has become well-known as Stormy Daniels' attorney and may be considering his own political career, is listed as Global Baristas' sole \"governing person\" in Washington state business filings. Avenatti told Business Insider that he sold his stake in Global Baristas, which he founded, at a nonspecific previous date.  \"I had practically nothing to do with the case and sold the company for nearly $28 million a long time ago,\" Avenatti said in an email to Business Insider on Wednesday. \"The company agreed to not to use the marks because they didn't care to use the marks again.\" Read more: Former employees reveal what it was like to work at the mysterious coffee chain once owned by Stormy Daniels' lawyer — including running out of coffee and questions about getting paid Tully's was  founded in Washington in 1992 by Tom O'Keefe, but it struggled to compete with the rise of Seattle-based Starbucks. Keurig parent company Green Mountain Coffee Roaster purchased the chain's wholesale business in 2009 for $40 million, turning Green Mountain into the chain's supplier.                                                                                                          In 2012, Tully's filed for Chapter 11 bankruptcy with more than $3 million in debt.  In January 2013, Dempsey swooped in to save Tully's as the public face of Global Baristas LLC when the company beat out Starbucks and five other bidders to acquire Tully's more than 40 locations in Washington state for $9.15 million. Behind the scenes, Avenatti was the original sole owner and manager of Global Baristas before Dempsey joined as a partner,  according to a complaint filed by Dempsey. Dempsey (who left Global Baristas in August 2013) and Avenatti said at the time that the company planned to revamp and expand Tully's. Keurig reached an agreement with Global Baristas in 2014 in which the coffee chain pays $250,000 a year for the use of the brand.  \"It was really exciting,\" one former employee who worked at the chain in 2013  told Business Insider in May. \"And then we started to realize that nothing was happening.\" Tully's.Ted Warren/AP Global Baristas struggled to pay suppliers and landlords, with more than 45 lawsuits filed against the company for issues such as unpaid rent and late payments. In March, all remaining locations suddenly shut down.                                                                                                          \"Dozens of people showed up for work on that March morning to find they were without a job,\"  an employee who worked for Tully's for eight years told Business Insider. \"Many are college students that needed to work to help lighten the financial burden on their parents, to reduce as much as possible any future student loans, and to cover their day to day cash needs. Many are single moms that seriously depended on their income to support their families,\" the employee continued.  At the time, Suzy Quinn — Tully's head of communications who is now working as Stormy Daniels' head of media relations —  told the Associated Press that the company was \"rebranding,\" an effort that could take months. Since then, a number of shops that formerly hosted Tully's have been reopened under new names and ownership, completely separate from Global Baristas.  Avenatti has faced more  general scrutiny regarding his finances since Business Insider initially reported on Tully's in April.  On Monday,  Avenatti was ordered to pay $4.85 million for failing to pay a debt to a former colleague, Jason Frank. Avenatti told reporters that Frank instead owed him millions for \"fraud\" he committed.                                                                                                          Also on Monday, Avenatti's law firm, Eagan Avenatti, was evicted from its Orange County offices for allegedly failing to pay rent. Avenatti  told the Daily Beast he had divested his interest in the law firm and that it was not his responsibility. "}