{"id": "The head of tech of one of the world's largest consulting firms says the business world's most overhyped new technology is also the most important", "paragraph": " Artificial intelligence, according to Paul Daugherty, is overhyped, many of the expectations for it are unrealistic, and most companies and their workers are unprepared for it.  At the same time, he says, it's the biggest and most important trend in technology today, will likely remain so for the next 10 to 20 years, and will profoundly change businesses around the world.  \"We call it the alpha trend,\" Daugherty told Business Insider in an interview this week. He continued: \"I don't want to be accused of hyping it more, but it is a big deal in terms of its impact.\"  Daugherty is in a position to know. He's the chief technology and innovation officer at Accenture, the giant consulting firm that counts more than three fourths of the Fortune Global 500 as its customers. As such, Daugherty leads the firm's effort to help clients identify, embrace, and integrate critical new technologies.  Every year, he and his team put together a list of the top technology trends in business. At the top of the list right now — and likely for many years to come — is AI, he said. Carnival Cruise Lines is using AI and machine learning to better serve guests aboard its ships.                                            Princess Cruise Lines                                    AI is remarkable for lots of reasons, but among them is how it's being adopted and by whom, Daugherty said. With previous trends, such as e-commerce or mobile apps or the cloud, the technology tended to be adopted quickly by only a handful of companies or a smattering of industries or in only a few countries around the world, he said. The companies on the cutting edge of the mobile phone trend tended to be banking and financial services firms, for example, while retailers tended to be the first ones to adopt e-commerce.  What's changed with AI is just how rapidly and broadly companies and industries globally are adopting it and related technologies, such as machine learning and automation, Daugherty said. Accenture has never seen interest among its clients or business grow this quickly with any other technology trend, he said. And instead of the interest being focused on a particular industry, it ranges from everything from the retail segment to utilities, he said.  \"What we're seeing with AI is very different. It's very broad, immediate adoption,\" he said. He continued: \"It's the fastest growing technology trend we've ever seen.\"  Utility companies are using machine learning and AI to try to become more efficient and get the most out of their production and distribution facilities, he said. Banks are using such technologies to try to better and more easily flag suspect transactions. Online clothing company Stitch Fix uses AI to help personalize clothes for its customers.                                            Business Insider                                    Online clothing seller Stitch Fix is using AI to try to better understand its customers fashion preferences and to better predict what clothes they'll want next, he noted. Meanwhile, Carnival Cruise Lines has put in place a system to track the activities customers take part in and the stops they visit to better tailor its offerings.  \"It's remarkably broad in terms of the adoption and going global very quickly,\" Daugherty said. He continued: \"You see companies looking at how to better optimize their assets and create new revenue streams.\"  To be sure, there are likely to be hitches and hiccups in the race to embrace AI. Many companies have unrealistic expectations of what the technology will be able to do for them, he said. And many of them are unprepared for the technology.  In a recent study where Accenture surveyed executives at some 1,500 organization, some 65% of those polled said their workforces weren't yet ready to work with AI and related technologies. But only 3% said their companies were investing in training their employees to use them.  \"It's an area that most companies are behind on,\" Daugherty said, continuing, it's \"a striking disconnect.\" This is a subscriber-only story. To read the full article, simply click here to claim your deal and get access to all exclusive Business Insider PRIME content."}