{"id": "I found a comfortable memory foam mattress for back and side sleepers under $1,000 — it sleeps cool too", "paragraph": "The Insider Picks team writes about stuff we think you'll like. Business Insider has affiliate partnerships, so we get a share of the revenue from your purchase.                                            Amazon                                     Would you commit to sleeping with someone every night for the next 20 years after just talking to them for 10 minutes? Probably not. Yet, this is essentially what you are asked to do at a mattress store. A high-pressure salesperson tries to get you to commit to a long-lasting product after lying on it for 5 to 10 minutes. The bed-in-a-box industry seeks to put an end to this practice with its risk-free trial periods.  Anyone can try the Snuggle-Pedic Mattress risk-free for four months. If you decide you don't like the mattress, Snuggle-Pedic will arrange to have a charity pick it up, and they'll refund your money. I was already a fan of  the Snuggle-Pedic body pillow when they asked me if I'd like to try their mattress for free. Here's my experience with it.  The Snuggle-Pedic Mattress came in a box about the size of a mini fridge. I liked that the company included a letter opener to make it easy to remove the plastic wrap without fear of accidentally cutting the mattress. In under 10 minutes, I had the plastic removed, and the bed was expanding to its full 10-inch-thick size.  Though I didn't have any trouble, others might have a difficult time handling the 70 pounds of bed. Unfortunately, Snuggle-Pedic doesn't have an answer for that yet. They don't offer \"white glove\" delivery or setup.  I've unboxed more than my fair share of memory foam products, and they almost always have an odor that dissipates after a few days. The Snuggle-Pedic mattress had no odor. I asked Jennie Katz, a representative for Snuggle-Pedic, what their trick was, and she told me that they don't do anything special to lessen the smell. Instead, \"they] use a very high-quality foam that uses a process that is far cleaner than the foam used by competitors.\"  Katz also recommended that I set up the bed on a firm, level surface, such as a platform, box spring, or other similar foundation. We used a cheap Zinus frame, which fit the bill, but I would recommend spending a few more bucks on something that will keep the mattress in place.  I mainly sleep on my stomach, but I've been known to venture to my sides. With the Snuggle-Pedic Mattress, side and back sleeping were much more comfortable than stomach sleeping. I felt like I was sinking a little too much on my stomach.  The mattress has a medium firmness, which is the most common in the industry. However, Snuggle-Pedic offers a special customization process that vice president of product development Dr. Rick Swartzburg, D.C. describes this way:                                                                                                                      We make a modular cover that allows a change to the layering of the mattress that cannot only make it firmer or softer in general but can target whether you need a firmer or softer surface, core, or perhaps even just a change in the buoyancy/springiness of the mattress. A change in the buoyancy can be exceptionally important because some customers are happy with the feel from the get-go, but may not want as much contouring effect. In the case of a mattress modification, we would exchange a new layer by sending them directly to the customer, so they do not have to send their large mattress into us. Of course, in both cases, they still have 120-nights to test products and can still return them even after any modifications are made.  This process is a bit of a hassle up front, but considering the mattress is designed to last for 20 years, it's important to get the feel just right.  With most beds, I sleep hot and wake up covered in sweat. This is particularly true with memory foam beds, which tend to trap heat. But, heat was not an issue with the Snuggle-Pedic Mattress. It features a patented \"Airflow Transfer System\" that consists of a series of ventilation holes and open side channels to allow for maximum air circulation. It clearly worked well at keeping me cool.  Despite weighing 70 pounds, the bed was easy to move around, which is important if you move your bed often or if you just want to stick to rotating your mattress every six months.  I was most disappointed by the poor edge support of the mattress. Snuggle-Pedic designed the edges to have some give because they've found customers don't like hard edges. I didn't share the bed with anyone so I didn't have any fear of falling off the edge, but if you do plan to share the mattress with anyone, you can contact Snuggle-Pedic for a free reinforced edge upgrade.                                                                                                                      The mattress failed my motion transfer test. I dropped a 20-pound weight from 4 feet above the bed to see if it would knock over a can of soda sitting 1 foot away from the contact point. The can fell over each time I tested. If you are a light sleeper who shares a bed with someone, the motion transfer may wake you up in the night.  There aren't any showrooms where you can walk in and try out the Snuggle-Pedic Mattress before you buy it. For old-fashioned shoppers, this would be nice to have available. Fortunately, the company offers a nice, long risk-free trial instead.  Overall, I would strongly recommend the Snuggle-Pedic Mattress to side or back sleepers who don't share a bed with others. Though you can potentially update the edge support to keep you snugly in bed, the motion transfer could wake light sleepers. On the plus side, the bed sleeps cool and provides the just-right firmness to support you on your side or back. And, though a queen will run you $900, Snuggle-Pedic backs their products with a 20-year warranty so you can count on your mattress lasting you for decades.  Find the best holiday deals on our Black Friday Deals and Cyber Monday Deals page. Subscribe to our newsletter.. Disclosure: This post is brought to you by the Insider Picks team. We highlight products and services you might find interesting. If you buy them, we get a small share of the revenue from the sale from our commerce partners. We frequently receive products free of charge from manufacturers to test. This does not drive our decision as to whether or not a product is featured or recommended. We operate independently from our advertising sales team. We welcome your feedback. Email us at insiderpicks@businessinsider.com. Find all the best offers at our Coupons page. "}