{"id": "As NATO gets ready for its biggest military exercise in years, things are heating up closer to Russia", "paragraph": " NATO forces are converging on Norway for Trident Juncture, which will be the alliance's largest military exercise in nearly two decades.  But military activity has been increasing on the other side of the Baltic Sea and in Kaliningrad — areas that have long been flash points for Russia and NATO.  Moscow assumed control of Kaliningrad after World War II and retained it after the breakup of the Soviet Union.  Now an 86-square-mile exclave, Kaliningrad is home to about a million people who are separated from the rest of Russia by Lithuania, Poland, and Belarus. But that location makes it strategically valuable. Russian navy corvette Steregushchy, left, destroyer Nastoichivy, middle, and frigate Admiral Gorshkov anchored in a bay of the Russian fleet base in Baltiysk in Kaliningrad, July 19, 2015.                                            Thomson Reuters                                     It has Russia's only Baltic Sea port that is ice-free year-round. In addition to several air bases, it is also home to Russia's 11th Army Corps. It also looks over one side of the Suwalki Gap, which NATO worries could be blocked during a conflict, cutting the Baltics off from the rest of Europe.  Russia appears to be upgrading its military facilities there.  Moscow has in the past deployed Iskander short-range, nuclear-capable missiles there temporarily, but in February, a Russian lawmaker confirmed that the Iskander, which has a maximum range of about 310 miles, had been moved there permanently in response to NATO's buildup in Eastern Europe.  It was \"the biggest move we've seen\" in regard to Russian military activity in Kaliningrad, a US defense official said at the time. The Kremlin said it had a \"sovereign right\" to put forces there.  Satellite imagery taken between March and June showed activity around bunkers in Baltiysk, the main base of Russia's Baltic Fleet, including the fortification of buildings \"characteristic of explosive storage bunkers,\" Matt Hall, a senior geospatial analyst at 3Gimbals, told Defense One in July.  Other imagery detailed in June by the Federation of American Scientists showed renovations of what appeared to be an active nuclear-weapons storage site. Russian crew members service an Iskander missile.                                            Russian Defense Ministry                                     Imagery taken between mid-July and the beginning of October showed upgrades at least four sites in Kaliningrad, according to CNN.                                                                                                                                              That included construction of 40 new bunkers and the expansion of a military storage area near Primorsk, which is Russia's second-largest Baltic port. Images also showed improvements at the Chkalovsk air base and upgrades at a base in Chernyakhovsk, which houses Iskander missiles.  Kaliningrad received much of the Soviet weaponry in Eastern Europe after the USSR's collapse, and for a long time the area \"was a bit of a dumping ground,\" said Jim Townsend, a transatlantic security expert at the Center for a New American Security.  Moscow's focus on Kaliningrad increased in the early 2000s, around the time the Baltic states — Estonia, Latvia, and Lithuania — joined NATO. Their inclusion was especially galling for Russia, which sees them as its \"near abroad.\"  \"Kaliningrad has been on a trajectory of improvements since the Baltic tensions and certainly since\" the Russian annexation of Crimea in 2014, Townsend said. Kaliningrad remains a major Russia outpost on the Baltic Sea.                                            Google Maps                                     The Iskander deployment is of a piece with Russian efforts to influence other European capitals, Townsend added. \"They would say, 'Look, if NATO puts troops into the Baltics, we're going to put Iskanders onto Kaliningrad.\"                                                                                                                                              Northeast Europe is a particularly sensitive area for Russia, Townsend said.  St. Petersburg, from which the Baltic can only be reached by passing Finland and Estonia, is Russia's second-biggest city. To the north is the Kola Peninsula, home to Russia's Northern Fleet and its submarine-launched ballistic missiles.  \"The Baltic is kind of a backdoor to that. Kaliningrad helps to defend that backdoor,\" Townsend said. \"So that's very sensitive.\"  Russian officials reportedly told Defense Secretary Jim Mattis in early 2017 that they would be willing to use tactical nuclear weapons against NATO if there was a war in the Baltics. Russian President Vladimir Putin and Defense Minister Sergei Shoigu, right, at celebrations for Navy Day in Baltiysk in Kaliningrad, July 26, 2015.                                            REUTERS/RIA Novosti/Mikhail Klimentyev/Kremlin                                     Russia's military is not the only one active in the Baltics.                                                                                                                                              The NATO buildup cited by Moscow as reason for permanently deploying Iskander missiles was the multinational battle groups the alliance has stationed in Poland, Lithuania, Latvia, and Estonia since 2016.  More recently, the US Air Force and the Estonian air force heralded the completion of a joint-use facility at Amari air base near the latter's capital, Tallinn, which was the first completed military construction projected fully funded by the European Deterrence Initiative.  Soviet jets were stationed at Ameri during the Cold War, but since 2004 it has hosted NATO aircraft during their rotations in the alliance's Baltic air-policing mission. (The Baltic countries don't have their own combat aircraft.) US airmen from the 493rd Expeditionary Fighter Squadron marshal in an F-15C Eagle at Siauliai air base, Lithuania, August 29, 2017.                                            US Air Force/Tech. Sgt. Matthew Plew                                     Improvements at Amari \"provide strategic access into that very contentious part of Europe,\" said Brig. Gen. Roy Agustin, director of logistics, engineering, and force protection for US Air Forces in Europe and Africa, according to Stars and Stripes. \"You look right across the border and there's a big regional adversary right there.\"                                                                                                                                              The EDI, previously called the European Reassurance Initiative, has funded military projects in Europe since Russia's intervention in Ukraine in 2014. Since then, the US has spent millions upgrading facilities across Eastern Europe to allow its military and partner forces to respond quickly to crises.  EDI funding also covers Operation Atlantic Resolve, which includes US armored rotations in Europe, a continuous presence in the Black Sea area, and prepositioning equipment and weapons around the continent.  The Pentagon's 2019 budget request for the EDI was nearly double what it got for the program in 2017 and six times what was allotted for it in 2015. US soldiers arrive in Eastern Europe for infantry exercises.                                            Kacper Pempel/Reuters                                     North of the Baltics, Sweden and Finland — close NATO partners that remain outside the alliance — have also turned increasing attention to military readiness.                                                                                                                                              Sweden's armed forces said earlier this year that they needed to boost staffing from 50,000 to 120,000 by 2035 — in addition to adding new surface vessels, subs, and combat aircraft — to meet future challenges.  The report also said Sweden's military budget would need to more than double over that period. Every mainstream party in the country's September 2018 parliamentary election backed a military budget increase, but that growth will take time.  Stockholm's defense outlay has tumbled since hitting 3.68% of GDP in 1963. The 1.03% of GDP currently spent on the military is a historic low, according to Defense News.  Sweden has also reintroduced military conscription and put troops back on Gotland Island in the middle of the Baltic Sea. Swedish armored personnel carriers on Gotland Island, September 14, 2016.                                            Thomson Reuters                                     More recently, Finland, which shares a 838-mile border and a history of conflict with Russia, has begun pumping money into military modernization — notably $1.5 billion for the Squadron 2020 program, which includes buying four multirole, ice-breaking, submarine-hunting corvettes armed with surface-to-surface missiles, torpedoes, and sea mines.                                                                                                                                              The program will also fund upgraded fast-attack missile vessels and upgrades to Finnish mine-layers and mine-countermeasure vessels, according to Defense News.  \"The Baltic Sea has become a possible focal point for tension between East and West,\" said Finland's defense minister, Jussi Niinistö. \"We are dealing with a more unpredictable Russia.\" "}