{"id": "This Irish CEO explains how a barista in a hipster coffee shop inspired Intercom, a $1.3 billion startup", "paragraph": " Eoghan McCabe, CEO and co-founder of Intercom, first came up with the idea for his business in a coffee shop.  In Dublin, where McCabe is from, he and his coworkers would frequent a hipster coffee shop called 3fe and chat with the owner, Colin Harmon. There weren't many other coffee shops with that vibe in the city, and McCabe appreciated how Harmon connected with his customers. The personalized service Harmon offered ended up inspiring McCabe and his partners.  \"We got to meet and appreciate the guy, feel the passion for his craft,\" McCabe said. \"We built a relationship with him and paid more for his overpriced coffee.\"  He continued: \"When we looked at every internet business, they didn't get to connect with us the way Colin connected with us.\"  McCabe started thinking about how internet businesses aren't great at interacting with customers. Typically they send customers emails from \"donotreply\" addresses and then route them through not always helpful \"help\" desks when they need more support.  \"All these products were really impersonal,\" McCabe said. \"With Colin, if you went into his store and asked, 'We have a question about Colombian roast,' he'd say, 'What is it?'\"  McCabe and co-founders Des Traynor, Ciaran Lee, and David Barrett, soon got to work on a messaging service for companies that became the foundation of Intercom.  Fast forward seven years to today, and the company has become a  $1.3 billion business headquartered in San Francisco with offices in four other cities. It's one of the  fastest growing startups in Silicon Valley. In March, it raised $125 million in new funds. And just this month, it launched its new product, the Answer Bot.  When Intercom first began, it focused on creating an instant messaging system to connect companies' customers with their sales, marketing, and support employees. Its next step is to use machine learning and artificial intelligence to create bots that can automate every stage of the customer lifecycle.                                                                                                                                                                                                          \"The first chapter was about getting people back into the mix,\" McCabe said. \"This next chapter is to facilitate automation, bots, to achieve the same vision and mission.\"  That may seem contradictory. After all, Intercom's original goal was to make businesses more personal, and bots are literally not persons at all.  But McCabe says the apparent contradiction goes away if you think about the meaning of \"personal.\"  It's \"all about treating the customer as an individual,\" he said. \"It's about respecting their time and their dignity. It's all about getting them to their ideal outcome.  \"We started to realize these bots and automation technology could do all that — sometimes better than humans.\"  Intercom's bots aren't pretending to be humans; they're open about being bots. They're also not intended to completely replace human workers. Instead, they're meant to assist them and allow companies to help more customers than they could before.                                                                                                                                                                                                          If a company only has human workers to handle customer service questions, customers can end up having to wait long periods for someone to handle their queries. Intercom's clients can use Answer Bot to handle some of those questions instead.  The service uses machine learning, relying on previous conversations between employees and customers to figure out how to answer new queries. Intercom clients can even build their own chatbots using Custom Bot, a product the company released in August.  While their bots are handling routine questions, companies can route more complicated ones to their human workers.  \"Answer Bot has a deep bank of the questions people ask about that business,\" McCabe said. \"The next time people ask that question, it doesn't get sent to your support team to answer that question for the 2000th damn time. Answer Bot can answer that and say, 'let us know if you need anything else.'\"  McCabe predicts that bots will soon become commonplace. Intercom has over 30,000 paying customers, including  Sotheby's,  Atlassian,  Shopify, and  Expensify, and its service facilitates 500 million conversations a month. To improve its bot technology, the company is doubling down on research and development and expanding its product development team.  But leading a company hasn't always been easy, McCabe said. Intercom isn't his first startup — he had previously founded two other ones with the company's other cofounders. Those experiences helped, since he and his partners made a lot of mistakes along the way in their prior ventures.                                                                                                                                                                                                          \"A lot of the dumbest mistakes we got out of the way,\" he said.  McCabe and his cofounders learned that to be successful, they needed to figure out how to have their companies do what they're best at while continuing to innovate. Having learned that lesson, he's ready to face the next chapter in automation. And he thinks his company is primed for a major transition in the industry.  \"In the next couple of years, every single business that has invested in trying to accelerate their growth will have simple bots working alongside humans,\" he said. That will allow them \"to have higher quality and faster response to allow humans to do what humans do best.\" This is a subscriber-only story. To read the full article, simply click here to claim your deal and get access to all exclusive Business Insider PRIME content."}