{"id": "Roger Stone associate Jerome Corsi says Mueller told him he will be indicted for perjury", "paragraph": " Jerome Corsi, a far-right political commentator and longtime associate of Roger Stone, said this week that the special counsel Robert Mueller told him he will be charged in the Russia investigation for perjury.  \"They told me they were going to indict me,\" Corsi told NBC News on Monday.  \"I fully anticipate that the next few days I will be indicted by Mueller for some form rather [sic] of giving false information to the special counsel ... or [however] they want to do the indictment,\" Corsi said on a YouTube livestream. \"But I'm going to be criminally charged.\"  \"I think my crime, really, was that I dared to support Donald Trump,\" Corsi said. \"Supporting President Trump ... Now I'm going to have to go to prison the rest of my life because I dared to oppose the deep state.\"  Corsi was served a subpoena in August by Mueller to testify before a grand jury. Mueller was  reportedly investigating whether Corsi had prior knowledge of the Hillary Clinton campaign's hacked emails — which were later delivered to and published online by secrets-leaking organization WikiLeaks — and whether he passed those emails on to Stone.  Stone, a GOP strategist and former adviser to Donald Trump, was under scrutiny by the special counsel for his connection with Julian Assange, WikiLeaks' founder, and Guccifer 2.0, an online identity believed to be part of the Russia's military-intelligence arm.  Responding to reports that Corsi will be indicted, Stone cast doubt on Mueller's investigation and indicated that the special counsel does not have enough proof against him or Corsi. He pointed out that he has taken two polygraph tests and passed both. He also said his attorneys have reviewed all his written communications with the far-right commentator.  \"When those aren't viewed out of context they prove everything I have said under oath regarding my interaction with Dr. Corsi is true,\" Stone said. \"It is possible to take individual communications out of context to create a false impression to a grand jury. Such a case would be weak and would fail. I stand by my statement to the House Intelligence Committee and can prove it is truthful if need be.\"  Stone added: \"Watching his podcast, Dr. Corsi strikes me as a man who has been squeezed hard but refuses to do anything but tell the truth which is why they may be indicting him.\" Jerome Corsi.                                            Charles Sykes/AP Images                                     Federal prosecutors indicted  12 Russian military officers for the hack in July and provided evidence that connected WikiLeaks' ties to Guccifer 2.0.  Corsi, formerly the Washington bureau chief of conspiracy-theory-website InfoWars, suggested Mueller had material evidence for his case.  \"When they have your emails and phone records ... they're very good at the perjury trap,\" Corsi said to NBC producer Anna Schecter.  In 2016, days before a trove of emails were leaked, Stone made several statements on Twitter that eventually attracted attention from investigators. Stone previously tweeted \"it will soon [be] Podesta's time in the barrel,\" in reference to John Podesta, Clinton's embattled campaign manager, whose emails were breached.  Corsi later claimed to be the inspiration behind Stone's tweets that suggested Podesta's brewing troubles. One person familiar with the situation said Mueller's team was reviewing communications with Trump's associates, in which Corsi and Stone appeared to take credit for the release of the hacked emails, according to  NBC News. The source added that there has yet to be evidence of their potential involvement in the email's hack or subsequent release to the public.  Corsi denied having prior knowledge of the emails. Stone reportedly described his alleged ties with Russia as a \"left-wing conspiracy theory\" and claimed Corsi did not tip him off about WikiLeaks' possession of the emails prior to its public release.                                                                                              \"For the record, I have never had any communication of any kind with Julian Assange, WikiLeaks, or Guccifer 2.0, or any Russian agents of any kind, including those mythical Russian agents who the Democrats believe wanted to throw the election for Trump,\" Corsi reportedly wrote on InfoWars in March 2017. "}