{"id": "Most Americans think Trump has encouraged white supremacists, and some are worried he has become a 'legitimizing voice' for hate groups", "paragraph": " In light of a wave of high-profile hate threats and attacks, President Donald Trump has been widely  criticized in the media for stoking conspiracy theories and false narratives among the conservative fringe.  Now,  a poll from the Public Religion Research Institute released Monday suggests that most Americans agree that Trump has \"encouraged white supremacist groups\" with his decisions and behavior.  The poll, which surveyed 2,509 adults from all 50 states through online surveys and live telephone interviews between September 17 and October 1, found that 54% of participants believed that Trump's decisions and behavior have encouraged white supremacist groups, and 69% of participants said that Trump has \"damaged the dignity of the presidency.\"  The poll, while taking place before the more recent threats and attacks, suggests that even before the shooting at a synagogue in Pittsburgh and bomb threats sent to Trump critics, much of the public believed the narrative that Trump has played a roll in stoking hate.                                             Chris Jones/Business Insider                                     Keegan Hankes, senior research analyst at the Southern Poverty Law Center, says he's not shocked by the results.  \"It's not a surprising result given the type of rhetoric we've seen come out of the White House, in particular out of President Trump's Twitter account,\" Hankes said.  According to Hankes, Trump's rhetoric is similar to that found in white supremacist spaces.  \"We've seen him promote demonizing vulnerable populations such as immigrants, refugees, Muslims, and so on,\" says Hankes. \"That was exactly the type of rhetoric that we see coming out of the white supremacist community.\"  Most recently, Trump has been criticized for playing a role in encouraging alarmist theories that alleged Tree of Life synagogue shooter Robert Bowers posted on fringe social media site Gab.  Right before the shooting, Bowers singled out Jewish nonprofit HIAS, which resettles refugees in the US, writing: \"HIAS likes to bring invaders that kill our people. I Can't sit by and watch my people get slaughtered. Screw your optics, I'm going in.\" The post, along with others  shared and written by Bowers, suggest that the alleged killer was motivated by a conspiracy theory alleging that the migrant caravan making its way toward the US border through Central America is part of a Jewish plot (this has no basis in fact).                                                                                                                  Trump and his administration have pushed  alarmist messages about the caravan in recent weeks, with both Vice President Mike Pence and Trump himself  saying that \"Middle Easterners\" and \"terrorists\" were part of the caravan. After the Tree of Life attack, Trump echoed Browers's exact rhetoric in a tweet, labeling the caravan an \"invasion.\"  Trump's rhetoric also notably aligned with white supremacists in his response to the Charlottesville Unite the Right rally in 2017, which was organized by a group of neo-Nazis and white supremacists and left one counterprotester dead. Despite ample documentary evidence of marchers at the event chanting \"Sieg Heil\" and \"Heil Trump,\" Trump insisted that there were \"very fine people on both sides.\"  Hankes said the recent attack in Pittsburgh and the wave of bomb threats \"represent the danger of that type of rhetoric coming out of the most powerful halls of government,\" calling Trump a \"legitimizing voice for white supremacist groups.\"  Hankes's assertion may not just be guesswork either. Hate crimes increased by 12% in America's 10 largest cities in 2017, according to  a report from the Center for the Study of Hate and Extremism. A separate paper published by the Social Science Research Network found a statistical correlation between the number of tweets Trump made per week related to Islam and the number of anti-Muslim hate crimes that took place following that period (though the correlations only applied to tweets and attacks related to Islam).                                                                                                                  The data should at least suggest rhetorical caution, Hankes said.  \"Trump's rhetoric, demonizing vulnerable populations is not helpful,\" he said. \"Rhetoric has consequences, sometimes violent consequences as we saw Saturday. When these opinions are coming from the government, they legitimize people with racist, bigoted, extreme beliefs, who are sometimes violent minded. It's a dangerous combination we're talking about.\" "}