{"id": "AT&T has notified a group of dealers who sell DirecTV products that their contracts will end in December after a terrible quarter for pay TV", "paragraph": " AT&T has notified a group of dealers who sell DirecTV products that their contracts will end December 1, 2018.  AT&T declined to comment to Business Insider on the number of dealers impacted, but a dealer who works under a similar agreement selling DirecTV products told Business Insider that AT&T gave 30-day notices to \"thousands\" of longtime residential dealers, informing them that their contracts would expire in December.  \"We regularly assess and make changes to our dealer relationships based on their performance and other factors,\" a spokesman for AT&T told Business Insider.  The dealers are part of a fleet of third-party laborers who sell DirecTV products and services including satellite, broadband, and phone services. Before news of the contracts ending, the dealers had also increasingly been directed to prioritize selling AT&T mobility products (phones and related plans) alongside video and broadband products where no previous directive existed, the dealer said.  The changing business strategies in the unit may be another indication that three years after its $50 billion acquisition of DirecTV, the telco behemoth is still struggling to stabilize that part of its business.  AT&T isn't alone in its pay-TV troubles.  The pay-TV business got clobbered during the quarter, as the industry reported its worst quarter to date and for the first time lost more than 1 million subscribers. AT&T lost 346,000 traditional video subscribers in the third quarter of 2018, faring worse than Wall Street analysts had projected.  The story isn't much different for AT&T than for other traditional-linear-television providers. Disruptive companies like Netflix and YouTube have spurred a cord-cutting revolution, offering cheaper or more customizable options. Cable and satellite companies have fought back with burgeoning virtual multichannel video programming distributor packages, or vMVPDs, that aim to retain customers by shifting them from traditional to digital within the same company (DirecTV, for example).  AT&T has an vMVPD option called DirecTV Now. But growth could already be slowing, as the company added only 49,000 DirecTV Now subscribers in the third quarter, a substantial decline in growth compared to the 342,000 added subscribers the quarter before.                                                                                             If you have any thoughts or information on DirecTV, AT&T, or the future of cable and satellite TV, contact ajackson@businessinsider.com.This is a subscriber-only story. To read the full article, simply click here to claim your deal and get access to all exclusive Business Insider PRIME content."}