{"id": "Trump continues to blame fires on forest mismanagement even while traveling to California", "paragraph": " President Donald Trump again blamed California's wildfires, that have left at least 74 people dead and over 1,000 missing, on forest mismanagement hours before he was due to visit the affected areas.  Trump told reporters before he departed from the White House Saturday that during his visit to the areas that were ravaged by fires in the past week that he and local authorities would be \"talking about forest management,\" seeming to suggest potential policy changes after discussions with California officials.  \"I've been saying that for a long time, it should have been a lot different situation,\" Trump said. \"But the one thing that everybody now knows that this is what we have to be doing, and there's no question about it. It should have been done many years ago. But I think everybody's on the right side. It's a big issue.\"  Trump's mention of management echoed his comments in a Fox News interview that is slated to air Sunday, in which he shrugged off climate change as a possible contributing factor in the blazes, saying \"maybe it contributes a little bit. The big problem we have is management.\"  \"You need management,\" Trump said. \"I'm not saying that in a negative way, a positive I'm just saying the facts.\" Read more:Trump blames deadly California wildfires on 'gross mismanagement of the forests,' but the federal government oversees 40% of them Trump said Saturday morning he wanted \"to be with the firefighters and the FEMA first responders\" during his trip, and added he would be meeting Saturday with Gov. Jerry Brown, Gov.-elect Gavin Newsom, and emergency workers.  Trump's comments echoed criticism from one of his tweets last week that California's \"gross mismanagement\" of its forests lead to the \"massive, deadly and costly forest fires.\"  Brian Rice, president of the California Professional Firefighters, said Trump's statement attacking California management and threatening to pull funding was \"ill-informed, ill-timed and demeaning,\" adding that nearly 60% of California's forests are under federal management.                                                                                  \"The president's message attacking California and threatening to withhold aid to the victims of the cataclysmic fires is ill-informed, ill-timed, and demeaning to those who are suffering as well as the men and women on the front lines,\" Rice wrote in a statement.  Trump is scheduled to visit the northern California town of Paradise Saturday, a home to 27,000, which was entirely destroyed by the Camp Fire. "}