{"id": "Stan Lee's famous Marvel cameos started out as a joke in the comics", "paragraph": "createPerformanceMark('first image displayed');Stan Lee (L) talks to Peter Parker (Tobey Maguire) in \"Spider-Man 3.\"                                            Sony/Marvel/\"Spider-Man 3\"                                    With the passing of Stan Lee on Monday at the age of 95, we don't just say goodbye to the face of the Marvel brand, but also the man of 1,000 cameos.  The former president and chairman of Marvel Comics is known by many Marvel Cinematic Universe fans as the guy who shows up in the majority of the movies released by Marvel Studios since 2008's \"Iron Man.\" But he started doing cameos long before there were superhero movies. Going as far back as the 1960s, Lee's likeness would be inserted occasionally in covers and inside the pages of the Marvel comics he was overseeing. And from what Lee told Business Insider back in 2015, it was never his intention to pop up in all things Marvel.  \"The artists back then would draw me in as a joke or just to have fun,\" Lee told Business Insider then. \"And I would put some dialogue balloons there and it looked as if I intended it. I didn't try to do cameos in those days.\" Here's Lee and fellow iconic Marvel artist Jack Kirby showing up on the cover of a \"Fantastic Four\" comic in the 1960s.                                            Wikipedia/Marvel                                    And Lee shows up in this edition of the \"Nova\" comics in the 1990s.                                            Cyber Space Comics/Marvel                                     \"Anything that seemed fun and anything that the readers seemed to enjoy we kept doing and those things brought in a lot of fan mail,\" Lee recalled. \"And we weren't doing movies or television, our whole existence depended on comic books, so if you see that something is interesting to the fans you stay with it.\"  Marvel definitely stayed with it, making Lee the face of the company. Over the decades, he also appeared in countless cartoons, TV shows, and movies ranging from Fox's '90s cartoon \"Spider-Man\" to 1995 comedy \"Mallrats\" where Kevin Smith used him as a voice of reason.             Lee in the final episode of the cartoon TV series \"Spider-Man.\"                                            Fox/Marvel/\"Spider-Man\" (1994)                                    Lee said he particularly liked his cameo in 2015's \"Avengers: Age of Ultron\" because \"it's so funny.\"  That's primarily why he also has a fondness for his appearance in 2007's \"Fantastic 4: Rise of the Silver Surfer,\" in which he can't get into the wedding of Reed Richards and Susan Storm because the bouncer doesn't think he's really Stan Lee. \"I like any of them that seem a little bit funny,\" he added.Lee in \"Fantastic 4: Rise of Silver Surfer.\"                                            Fox/Marvel/\"Fantastic 4: Raise of the Silver Surfer\"                                    You will next see Lee on the big screen for Sony's \"Spider-Man: Into the Spider-Verse,\" where he makes a cameo in animation form. This story has been updated from its original version."}