{"id": "Bose's $350 noise-cancelling headphones are a must-have if you want to live in a quieter world – and they sound great, too", "paragraph": "createPerformanceMark('first image displayed');                                            Business Insider                                    At $350, Bose's comparatively expensive  QC35II headphones aren't for everyone, especially if all you want is a simple, good pair of Bluetooth headphones.  But Bose's Quiet Comfort headphones come with noise cancelling, and they're usually the best at drowning out unwanted ambient noise. If you're in the market for noise cancelling headphones, the QC35II should certainly be near the top of your shortlist.  They deliver premium audio quality, but they're not my favorite headphones for music, as I personally prefer a little bit more bass than they deliver for bass-heavy music. But their excellent noise cancellation and extreme comfort make the QC35II my go-to pair of headphones for every day use.  Check out the Bose QC35II headphones:  The QC35II creates a sound proof bubble in the office. They totally remove the hum of the office air conditioners at BI, which can be incredibly loud. Other sounds like office chatter, doors closing, and footsteps are muffled, but they're still audible. Don't expect the kind of silence you get at a library, but these headphones absolutely make the office a less distracting place to work in.  The QC35II muffle the sounds of commuting, like subways and noisy streets, but everything is still largely audible. I wasn't very impressed at first, but then I took the headphones off in the middle of a subway ride and realized just how much sound they were cancelling out.  The same thing goes for walking around NYC. I initially thought the city was still pretty loud while using QC35II. But once I took them off, I wondered how people live without ear plugs or noise cancelling headphones. It's pretty amazing, and it makes commuting a lot more comfortable.  The headphones don't completely remove an airplane's hum, but they're close! It's the same experience as during my commute. You don't realize just how much noise the QC35II headphones cancel out until you take them off. I wondered the same thing as I did with my commute: How could anyone possibly go through a flight without ear plugs or noise cancelling headphones?  The headphones also come with an aux cord that plugs into the headphone jack of any device that still has a headphone port, like an airplane's entertainment system.  By cancelling out most of the unwanted noise surrounding me, the QC35II let me listen to music at lower volumes than headphones without noise cancellation. As a result, I'm less at risk of permanently damaging my hearing in the long term.  But I don't always listen to music when wearing the QC35II. In fact, I'm mostly just wearing them for their noise cancelling feature without any audio. In my opinion, the fewer decibels I hear, the better it is for my long-term hearing.  As you'd expect from $350 headphones, the QC35II sound great. They deliver a clear, rich, premium sound that's signature to Bose headphones, and most people would be very happy with them.  With that said, Bose added its own tweaks to the sound that fits certain types of music more than others. Classical, Jazz, and Rock sound amazing, but the QC35II don't quite deliver for tracks with heavier bass. Those who like to be enveloped in a warm blanket of bass when they listen to music won't be satisfied here. I felt myself wanting more ultra-low-end bass, especially on Hip Hop tracks.  Phone calls work incredibly well with the QC35II headphones. The noise cancellation helps me hear the person I'm speaking with very clearly, even when I'm walking around the noisy streets of New York City.  The microphone also picks up my voice easily, even when there's lots of ambient noise, and the person I'm speaking with can hear me loud and clear. The microphone's audio is fed through the headphones through a call so you can hear what the other person is hearing. Hearing myself through the headphones also helps me gauge how loudly I need to speak for the other person to hear me. I never felt like I had to exert extra effort to speak more loudly or more clearly while on calls with the QC35II.  I have the type of head and ears that don't like headphones: the pressure from the headband typically leaves the top of my cranium sore after an hour, or the ear pads get hot and my ears get sore. Sometimes I get an uncomfortable combination of all those things.  The QC35II headphones are the most comfortable pair of headphones I've tried to date. They cup around my relatively large ears and don't cause any pain after long periods of use. They still get a little warm, but it's not too uncomfortable. They're pretty light, too, and the well-padded headband never caused any soreness.  Battery life is not stellar, but it's pretty good on the QC35II. Bose boasts a 20-hour battery life, and it seems pretty spot on from my experience.  Unfortunately, the headphones charge via microUSB instead of USB-C. And the microUSB cable it comes in is comically short - about five inches. That's disappointing because more and more of my devices are using USB-C, and I have to bring a microUSB cable just for the headphones when I'm travelling. It's not a deal-breaker by any means, but I hope Bose uses USB-C in the future.  The Bose app lets you adjust the level of noise cancellation and lets you manage all the devices connected to the headphones. It even keeps the headphones up to date with the latest firmware. You can also check in on the battery level through the app, but you can also find that information in the Today View menu when you swipe right on iOS devices.  The headphones work without the app, but you might as well use it to get the latest firmware updates that bring improvements to your headphones over time.  As with any good pair of Bluetooth headphones, the QC35II have music controls for volume and track control. Volume control is intuitive enough, but track control needed a quick check of the manual.  (To switch to the next track, you need to double-press the Play/Pause button. To go to the previous track, you need to triple-press it.)  You can use Google Assistant that lives in your phone via the QC35II headphones, which seemed like an interesting feature at first, but the experience falls flat.  To issue voice commands, you have to press and hold the button on the left ear cup, and Google Assistant will give you its reply.  It does work for simpler questions, like getting the weather and other questions you can search on the web, and it can tell you your next calendar event, too. But there's a significant delay between your voice command and the answer from Google Assistant. I couldn't imagine a scenario at home when I'd use Google Assistant on the QC35II headphones, and speaking to voice assistants out in public isn't something I'm ready to do. Plus, if you have reach up to press and hold the button for Google Assistant, you might as well reach for your phone.  I also tried some more complex things like sending a message and getting direction using Google Assistant with the QC35II, but it never worked properly.  You can also get notifications from your phone to the headphones, but this interrupted music or quiet moments so often that it became unbearable. I turned off all the notifications with angry satisfaction.  Apple claims it works with Siri on its website, too, but I found no compatibility with Siri in the Bose app settings on an iPhone X.  For a pair of $350 headphones, I was expecting a little more in terms of build quality. The plastic feels cheap and hollow, and it can get lightly scuffed over time. Still, as long as they continued to sound good and block out exterior noise, I didn't mind.  If the QC35II were simple headphones without noise cancellation, I'd say the $350 price tag would be a stretch, as you can get some great-sounding Bluetooth headphones for $150. But they make their case with their class-leading noise cancellation that can drown out a lot of distracting noise, and even help prevent long-term hearing damage.  If you're looking for a pair of noise-cancelling headphones to help you focus at the office or simply turn down the volume of the world around you from time to time, the QC35II are absolutely worth it. The excellent phone calls is the icing on this very good cake.  With that said, the built-in smart assistant feature complicates the experience. It's thankfully optional, and if you're not interested at all in the smart assistant feature, you can opt for the original QC35 headphones that are slightly cheaper at $330 on  Amazon at the time of writing. It's essentially the same pair of headphones without the built-in smart assistant.  You can buy the Bose Qc35II headphones from  Amazon for $350. "}