{"id": "New research finds some purchasers are asking for 'Weinstein misconduct clauses' in M&A deals as scandals rock Silicon Valley", "paragraph": " From  Intel to  Google, sexual-misconduct scandals have unseated powerful executives in the past year and caused a lot of pain to many people.  Such scandals can be particularly problematic in the mergers-and-acquisitions space, where buyers take on risks financially and in reputation — sometimes without having all the information before signing the deal.  Executives are often seen as an asset to a company, so if one gets pushed out for misconduct, that devalues the acquisition. Past misconduct and potential future misbehavior open the new owner up to risks of legal action and expensive payouts. Read more: Almost 17,000 Googlers walked out to protest of sexual misconduct at the company Despite this, legal protections for buyers seem to be rare.  Less than one-third of executives  surveyed by the business law firm Dykema said they had been involved in a deal with a so-called  Weinstein misconduct clause.  Dykema described a Weinstein misconduct clause — named for the Hollywood film producer  whose alleged misconduct was reported widely last year — as legally binding assurances for a company's leaders that effectively certify for the buyer that they haven't been accused of sexual harassment or misconduct.  Only 28% of the 203 US-based senior executives surveyed said they had been involved in an M&A deal where a misconduct clause was proposed, \"suggesting that the #MeToo movement may not have yet reached middle-market M&A to a substantial degree,\" the report said.  Of the respondents who said they had participated in deals with such a clause, about nine out of 10 said they had a \"knowledge qualifier,\" holding the sellers liable only if they didn't disclose misconduct known to the company.                                                                                                                                  Whether these clauses will grow in popularity remains to be seen, but it is clear that sexual misconduct will continue to be a factor in corporate M&A.  On Thursday,  Business Insider reported on allegations of sexual assault against the former CEO of Apttus, who left the company just two months before the private-equity firm Thoma Bravo acquired a majority stake in the startup. This is a subscriber-only story. To read the full article, simply click here to claim your deal and get access to all exclusive Business Insider PRIME content. Get the latest Intel stock price here. Get the latest Google stock price here."}