{"id": "Carmelo Anthony never turned into the player the NBA world expected, and now his career has taken an ugly final turn", "paragraph": " In a somewhat surprising turn of events, it appears  Carmelo Anthony's tenure with the Houston Rockets will soon come to an end.  Reports over the weekend said Anthony was meeting with the Rockets to discuss his role moving forward. The New York Times' Marc Stein reported on Sunday that though it wasn't official, Anthony had likely played his last game with the Rockets.  Anthony and the Rockets have gotten off to a sluggish start. Anthony is averaging 13 points and 5 rebounds per game while shooting 40% from the field and 32% from three while the Rockets are just 5-7, a far cry from their play last season when they won 65 games.  If the Rockets do indeed move on from Anthony, it will send the 34-year-old looking for a fourth team in less than two years. Anthony was traded from the New York Knicks to the Oklahoma City Thunder before the start of last season. This summer, the Thunder traded Anthony to the Atlanta Hawks, who then bought him out, allowing him to sign with the Rockets.  If Anthony is nearing the end of his career, at 34, in his 16th season, it shouldn't be a surprise. Anthony has over 1,100 games under his belt and played over 38,000 regular-season minutes. Only a few unique players manage to make it beyond that mark and still thrive in the league.  But in some ways, this late, ugly turn in Anthony's career only makes his peak years more bitter. Anthony is at the stage of his career when he should be playing a role on a good team, seeking out that elusive championship. Instead, it appears that his best skills are no longer applicable in today's NBA, and his inability to adapt has made him an outcast.  It only reinforces the feeling that Anthony left something on the table during his peak years, when he never really came close to contending for a ring.                                             Mary Altaffer/AP                                     At his peak, Anthony was a bulldozing offensive force with a rare combination of speed, strength, and finesse. Few players in NBA history have possessed Anthony's ability to get a basket. To talk about Anthony's peak as some kind of disappointment would surely strike some as odd. He's a top-20 all-time scorer, a 10-time All-Star, six-time All-NBA team member, and likely Hall of Famer.                                                                                                                      But the way Anthony plied his trade hurt him in the long run. Anthony was at his best in the midrange and post, holding the ball, sizing up his opponent, then making his move. Sometimes that would be with a deceptively quick, blow-by step to the basket. Other times, it was with a quick move to his right or left, creating just enough separation to get off his shot. And sometimes, he just rose up in the face of a defender and hit shots in a maddeningly unguardable way.  But most frequently, it came while bringing the offense to a halt, leaving his teammates standing around and watching.  A compilation of every made field goal of Anthony's career would have a lot of plays like this:  Anthony's scoring prowess often came at the expense of his other skills. He was often indifferent to defense, but capable when he tried. He's always been a solid rebounder but could have been elite, as evidenced by a stretch in the 2013-14 season when he averaged double-digit boards for the Knicks.                                                                                                                      But most of all, Anthony was a gifted passer who didn't want to give up the ball very much. He owns, (in this writer's opinion) one of the cooler passes of all-time. Anthony had the vision and touch to make outstanding passes when he wanted.  At times, Anthony even blended his face-up game with his court vision, seeking out three-point shooters like a quarterback in the pocket finding his receivers.  But either because of a desire to score, a lack of trust in his teammates, or a lack of understanding, Anthony never committed to being the type of playmaker he could be. He averaged over four assists per game just once in his career. As a player who commanded the attention of entire defenses, Anthony probably could have racked up far more assists than he did, and his teams would have benefitted as a result.  In basketball circles, there existed a version of Carmelo Anthony called \"Olympic Melo.\" Olympic Melo torched teams overseas with USA Basketball, acting as a spot-up shooter who did not have to do the offensive lifting himself — he could finish plays instead of creating them. The world saw peak Olympic Melo when he scored 37 points in 14 minutes against Nigeria in the 2012 Olympics.                                                                                                                      Except, when Anthony got the opportunity in the NBA, he didn't become \"Olympic Melo.\" He shot just 40% from the field and 35% from three last season with the Thunder, failing to become the necessary third weapon behind Russell Westbrook and Paul George.  After the season, he didn't seem thrilled with the role, either, even though he accepted it.                                             Matthew Stockman/Getty                                    \"I don't think I can be effective as that type of player,\" Anthony said of playing a smaller role after last season. \"I think I was willing to accept that challenge in that role, but I think I bring a little bit more to the game as far as being more knowledgeable and what I still can do as a basketball player.\"  The Rockets appeared to be gambling that they could be the team to turn Anthony into Olympic Melo. When given a chance, especially for a group that emphasizes three-point shooting, Anthony couldn't connect. His best skills don't jibe with what Houston emphasizes, a fact that seemed clear from the start. Read more:  Carmelo Anthony's move to the Rockets comes with a role he's already complained about Now older and a step slower, Anthony is also routinely targeted on defense.  The Rockets insisted in recent days that Anthony did everything that was asked of him, from a role-playing standpoint. He seems more willing to embrace that he's not the No. 1 or even the No. 2 option on a good team anymore.  Now seemingly heading for the open market, there's risk of a snowball effect. How many teams want to sign up for what Anthony brings — the occasional ability to get a basket, spotty three-point shooting, slow-footed defense, even when he's engaged? Anthony still has his moments, and he can be a serviceable player, but how many teams will go out of their way to sign such a player? That two borderline contenders have now said, \"No thanks,\" must surely raise some eyebrows on other teams.  Anthony may yet still find a fit in the NBA. It's worth considering the adjustment he's had to make in recent years. It takes players time to get used to systems, roles, and teammates. Anthony may have needed more time with the Thunder; for the Rockets to conclude he's not a good fit after 12 games, is borderline shocking.                                                                                                                      But as Anthony grows increasingly desperate for a fit and a last shot at a championship, it's hard not to think that his peak years, when his full talents could have led a team to a championship, were spoiled. "}