{"id": "Trump keeps claiming the GOP will 'protect people with preexisting conditions.' But he's been trying to gut those protections for almost 2 years.", "paragraph": " According to  multiple polls, healthcare is the  top issue for voters in Tuesday's midterm elections and one healthcare fight has dominated the airwaves:  preexisting conditions.  Democrats have gone all out attacking Republicans for their attempts to strip preexisting condition protections away from Americans, and the GOP has been on the defensive.  President Donald Trump has continually claimed that his administration and the entire Republican Party's healthcare platform would provide as good, if not better, protections for people  with preexisting conditions.  \"Republicans will protect people with pre-existing conditions far better than the Dems!\" Trump tweeted Wednesday, the latest in a slew of earlier tweets on the subject. Read more:  Republicans tried to kill Obamacare. Now they're trying to embrace its most popular feature in a defining fight of the midterms» It's no wonder that Trump is focused on the issue: Voters rank healthcare  among the most important issues for the upcoming midterm elections. Protecting  preexisting conditions is a large— and popular — part of that concern.  The protections created in the Affordable Care Act, or Obamacare, made it so that insurance companies could: Read more:Democrats are embracing a radical change to US healthcare, and it could be the defining political fight for years to come But while Trump may toss out the suggestion that the GOP will provide similar preexisting condition protections for Americans, the actions of the administration and the party it represents are very much in conflict with that promise.                                                                                                                                              Outside of the GOP's eight-year crusade to repeal Obamacare, which created the protections, the Trump administration has recently attempted to undermine preexisting condition protections in various ways. "}