{"id": "Dana White just gave a big hint as to Khabib Nurmagomedov's next opponent, and it could be a fight that's been years in the making", "paragraph": " Dana White hinted towards the next opponent of undefeated lightweight champion Khabib Nurmagomedov, and it sounds like those who were hoping for a rematch with Conor McGregor will have to wait a bit.  Speaking with ESPN, White was asked — As a fight fan, who he would like to see Nurmagomedov face next? His answer, without hesitation, was the former lightweight champion, Tony Ferguson.  \"As a fight fan, you've gotta go with Tony,\" White said. \"Tony had the belt, tweaked his knee, got stripped, (McGregor vs. Nurmagomedov) happens. Tony never lost the belt in a fight.\"  \"Neither did Conor,\" White continued, \"But Conor actually got the opportunity to fight for the belt. I think Tony deserves the next shot.\"  While the framing of the question indeed allows White some wiggle room, there's little doubt that setting up a championship fight between Nurmagomedov and Ferguson is a top priority. While Nurmagomedov-McGregor was the biggest fight at UFC 229, Ferguson's fight against Anthony Pettis that went off just before the championship was likely a more entertaining contest for most fight fans.  Nurmagomedov-Ferguson has been a long time coming. Though it certainly wouldn't be as big as any fight that features the superstar drawing power of McGregor, it's a fight that fans have wanted for years and has been scheduled numerous times only to be canceled at the 11th hour due to injuries or weight issues. With Nurmagomedov's newfound star power within the company, it's a fight that would bring in eyes.  There are no guarantees, and it's entirely possible that this is just some sort of marketing or negotiating tactic on White's part to set something up in the future — or possibly a play to draw Nurmagomedov back into the octagon after he's been heard flirting with the idea of his fight against Floyd Mayweather.  Regardless of the reasons, it sure sounds like White wants Nurmagomedov-Ferguson to happen, and with good reason. "}