{"id": "RANKED: The 50 most underrated colleges in America", "paragraph": " Whether a student is more inclined to learn about artificial intelligence or take up photography, several factors play a role in choosing the right college.  Business Insider has complied a ranking of the top 50 underrated colleges nationwide by considering two factors: reputation and future earnings. We figured that schools with mediocre or obscure reputations but whose students made high salaries would be underrated.  To determine our ranking, we combined the mutually exclusive sets of Best Universities and Best Liberal Arts Colleges from The US News & World Report's annual college ranking. We pulled data on median earnings for students from each school who were working and not enrolled ten years after starting at the college from the US Department of Education's College Scorecard. You can read the full methodology  here.  The Missouri University of Science & Technology took the No. 1 spot. The campus has an atmosphere students described as a less stereotypical Big Bang Theory episode, according to The Princeton Review.  Keep reading to find out the 50 most underrated colleges. Location: Immaculata, Pennsylvania US News ranking: 183 Median mid-career salary: $50,600  There are 1,482 students at Immaculata and class sizes are relatively small. The admissions acceptance rate is 83% with an average high school GPA of 3.26. Location: San Diego, California US News ranking: 85 Median mid-career salary: $60,000  The University of San Diego is a moderately sized liberal arts Catholic school with a \"laid back\" student body, according to There are a total of 5,774 undergraduates representing 57 foreign countries. Location: Pittsburgh, Pennsylvania US News ranking: 25 Median mid-career salary: $83,600  Carnegie Mellon's motto is \"my heart is in the work\" which resonates from engineering to drama majors. The university has a 22% acceptance rate and an average high school GPA of 3.77. Location: Washington, DC US News ranking: 78 Median mid-career salary: $61,000  With an acceptance rate of 29%, American University has 8,123 undergraduates and a student-to-faculty ratio of 11:1. A student told The Princeton Review that \"the poli-sci kids are all going to be president one day, and the international studies ones are all going to save the world.\" Location: Washington, DC US News ranking: 22 Median mid-career salary: $93,500  This moderately sized Jesuit school has an acceptance rate of 16% and has a student body representing 138 foreign countries. Location: Kingston, Rhode Island US News ranking: 157 Median mid-career salary: $52,900  The University of Rhode Island has one of the best marine biology programs on the East Coast with other stand-out majors including nursing and pharmacy. Location: Cleveland, Ohio US News ranking: 42 Median mid-career salary: $74,600  One of the biggest campus events at Case Western includes a 10-day game of tag called \"Humans Vs. Zombies.\" Location: Atlanta, Georgia US News ranking: 35 Median mid-career salary: $79,100  As a world-renowned public research university, Georgia Institute of Technology offers \"rigorous\" engineering, science, and business programs. With a 23% acceptance rate, the average high school GPA is 4.02, according to The Princeton Review. Location: Binghamton, New York US News ranking: 80 Median mid-career salary: $61,600  There is a total of 13,708 undergraduates at Binghamton University-SUNY representing 97 foreign countries. With a 40% acceptance rate, the average high school GPA is 3.7. Location: South Orange, New Jersey US News ranking: 119 Median mid-career salary: $57,200  A Catholic university, Seaton Hall offers more than 90 majors in seven undergraduate colleges and has an average class size of 21 students, according to The Princeton Review.Location: Houston, Texas US News ranking: 171 Median mid-career salary: $51,600  Among 45,300 students, The University of Houston has an equal number of men and women studying at the institution. The campus spans 594 acres and there are more than 120 undergraduate majors and minors, according to The Princeton Review. Location: Blacksburg, Virginia US News ranking: 76 Median mid-career salary: $62,500  Virginia Tech has a 70% acceptance rate among students with an average high school GPA of 3.97. The university offers 240 undergraduate programs to more than 31,000 students. Location: Newark, New Jersey US News ranking: 115 Median mid-career salary: $57,900  There are 8,551 undergraduates representing 57 foreign countries at Rutgers University, Newark. The University has a 64% acceptance rate. Location: St. Paul, Minnesota US News ranking: 124 Median mid-career salary: $56,800  The University of St. Thomas employs 332 faculty members for 1,864 undergraduate students. With an acceptance rate of 81%, the average high school GPA is 3.66. Location: Lowell, Massachusetts US News ranking: 157 Median mid-career salary: $53,300  The University of Massachusetts-Lowell was founded in 1894 with a focus on innovation and entrepreneurship. The University has a 69% acceptance rate with an average high school GPA of 3.55. Location: Washington, DC US News ranking: 129 Median mid-career salary: $56,800  A majority of Catholic University students socially identify as conservative with a small portion of \"liberal millennials,\" according to The Princeton Review. Location: Arlington, Texas US News ranking: 221 Median mid-career salary: $48,700  The University of Texas-Arlington has 25,690 undergraduate students representing 123 countries. A student told The Princeton Review that professors bring \"real-life application and useful knowledge to the students.\" Location: Washington, DC US News ranking: 63 Median mid-career salary: $69,600  There are more female students at GW than male students and 97% of the total student body are from out-of-state. The university was founded in 1821 by an Act of Congress. Location: Villanova, Pennsylvania US News ranking: 49 Median mid-career salary: $77,900  Villanova University has a 36% acceptance rate with an average high school GPA of 4.09. Location: Lisle, Illinois US News ranking: 221 Median mid-career salary: $49,000  Benedictine University has 2,960 undergraduate students representing 17 foreign countries. With an acceptance rate of 69%, the average high school GPA is 3.39. Location: Lubbock, Texas US News ranking: 187 Median mid-career salary: $51,400  Texas Tech University accepts 69% of applicants with an average high school GPA of 3.75, according to The Princeton Review. Location: Milwaukee, Wisconsin US News ranking: 89 Median mid-career salary: $62,600  Marquette University is a Jesuit school that seeks to instill faith, service, and leadership in students, according to The Princeton Review. Location: Troy, New York US News ranking: 49 Median mid-career salary: $82,000  Rensselaer Polytechnic Institute is the oldest tech university in upstate New York. Location: Loudonville, New York US News ranking: 135 Median mid-career salary: $57,100  Siena College is a small Roman Catholic college that upholds Catholic Franciscan qualities, according to The Princeton Review. Location: Lexington, Virginia US News ranking: 81 Median mid-career salary: $65,700  Nine countries are represented from 1,722 undergraduate students at Virginia Military Institute. Location: Pittsburgh, Pennsylvania  US News ranking: 119 Median mid-career salary: $58,500  Duquesne University is a private Catholic University with 5,942 undergraduates enrolled. With an acceptance rate of 72%, the average high school GPA is 3.73, according to The Princeton Review. Location: Bethlehem, Pennsylvania US News ranking: 53 Median mid-career salary: $81,900  Lehigh University is a Division 1 school that offers more than 100 majors and academic programs. Location: Queens, New York US News ranking: 152 Median mid-career salary: $55,200  St. John's was founded in 1870 and upholds Catholic and Vincentian traditions, according to The Princeton Review. Location: San Francisco, California US News ranking: 96 Median mid-career salary: $62,300  The University of San Francisco is a private Jesuit school with 6,745 undergraduate and 4,293 graduate students.Location: Boston, Massachusetts  US News ranking: 177 Median mid-career salary: $53,100  Suffolk University is more than 100 years old and enrolls approximately 950 students in the freshman class, according to The Princeton Review. Location: Azusa, California US News ranking: 205 Median mid-career salary: $51,100  Azusa Pacific University is a \"God-centered Christian university\" and is known for its nursing and music programs, according to The Princeton Review. Location: Rochester, New York US News ranking: 102 Median mid-career salary: $62,400  Rochester Institute of Technology has a 57% acceptance rate and average high school GPA of 3.6, according to the Princeton Review. Location: Baltimore, Maryland US News ranking: 165 Median mid-career salary: $55,000  The University of Maryland-Baltimore County is a liberal arts honors university with an average high school GPA of 3.8, according to The Princeton Review. Location: Worcester, MA US News ranking: 59 Median mid-career salary: $84,900 Worcester Polytechnic Institute is a private research school focused on science, technology, engineering, and math. Location: Easton, Massachusetts  US News ranking: 124 Median mid-career salary: $60,800  Stonehill College is a liberal arts Catholic institution. With a 72% acceptance rate, the average high school GPA is 3.32, according to The Princeton Review.Location: Chester, Pennsylvania  US News ranking: 194 Median mid-career salary: $53,400  Widener University has 3,427 undergraduates representing 38 foreign countries, according to The Princeton Review. Location: Chicago, Illinois US News ranking: 96 Median mid-career salary: $69,100  Illinois Institute of Technology programs focus on areas of STEM — science, technology, engineering, and math. Students told The Princeton Review that \"the students at IIT are absolute nerds, and we all say that with pride.\" Location: Fairfax, Virginia US News ranking: 136 Median mid-career salary: $59,900  George Mason University has 24,987 undergraduates representing 106 foreign countries. Location: Hoboken, New Jersey US News ranking: 70 Median mid-career salary: $89,200  Students at Stevens Institute of Technology can choose from 35 majors with a focuses on innovation and entrepreneurship. Location: Garden City, New York US News ranking: 147 Median mid-career salary: $58,500  Adelphi University is a research institution offering liberal arts and science programs across arts and humanities, STEM, social sciences, business, education, and health and wellness, according to The Princeton Review. Location: Philadelphia, Pennsylvania  US News ranking: 102 Median mid-career salary: $68,800  At Drexel University, first-year students take several classes pertaining to their major, then alternate every six months studying and being employed full-time, according to The Princeton Review. Location: Newark, New Jersey US News ranking: 106 Median mid-career salary: $68,500  New Jersey Institute of Technology has 8,483 undergraduate students representing 65 foreign countries. Location: Golden, Colorado  US News ranking: 80 Median mid-career salary: $84,900  Colorado School of Mines has a 56% acceptance rate and average high school GPA of 3.78, according to The Princeton Review. Location: Melbourne, Florida US News ranking: 177 Median mid-career salary: $56,600  At first, the Florida Institute of Technology started as a graduate school in 1958 but has since expanded to include bachelor's, master's, and doctoral degrees, according to The Princeton Review. Location: Potsdam, New York US News ranking: 102 Median mid-career salary: $72,000  Clarkson University's programs mainly focuses on science and engineering. Students told The Princeton Review that \"Clarkson has 'a fair ratio of 'nerds' to 'jocks' due to the recruitment of athletes for teams.'\" Location: Stockton, California US News ranking: 106 Median mid-career salary: $71,700  University of the Pacific has accelerated programs in dentistry, law, engineering, and pharmacy, according to The Princeton Review. Location: Houghton, Michigan US News ranking: 136 Median mid-career salary: $66,400  Michigan Technological University was originally established as a school for mining engineers in 1885 and is now a leading public research university. Location: Denver, Colorado US News ranking: 205 Median mid-career salary: $56,400  University of Colorado-Denver's in-state tuition is low at $5,054, while out-of-state tuition is $17,010, according to The Princeton Review. Location: New York, New York US News ranking: 177 Median mid-career salary: $60,300  Pace University is known for its liberal arts and business programs. Students told The Princeton Review that the student body is \"as diverse as the city around us.\" Location: Rolla, Missouri US News ranking: 157 Median mid-career salary: $71,200  Missouri University of Science & Technology exposes students to \"every different type of engineering\" and is described by students as a less stereotypical Big Bang Theory, according to The Princeton Review. "}