{"id": "Republican Marsha Blackburn and Democrat Phil Bredesen are locked in a competitive, nasty battle for a key Senate seat — here's what they told us about their race", "paragraph": " Business Insider recently spoke with Republican Rep. Marsha Blackburn in Franklin, Tennessee and Democratic former Gov. Phil Bredesen in Nashville, Tennessee about their competitive race for retiring GOP Sen. Bob Corker's seat.  Below are transcripts of the interviews, lightly edited for clarity.  Business Insider: Healthcare seems to be a big issue for many voters. How do you draw the contrast between yourself and the congressman on this issue? Bredesen: Healthcare is a big issue, but when you start parsing it, it's different issues in different places. In rural parts of Tennessee, it tends to be just about access — hospitals closing and you can't get doctors to locate there. It's more about the cost of healthcare when you get into the suburbs and so on.  I'm trying to run to run the campaign not by just criticizing everything she's ever done. I think one of the big things, though, that I have talked about is that we're all concerned about how you get people with pre-existing conditions some kind of insurance. And in today's world, unless you work for a corporation that has a big comprehensive health plan, the Affordable Care Act is really the only way to do that — that's what it was designed to do. So one criticism I've certainly made — and I did in one of the debates — is that you claim, you brag that you've voted 60-plus times to eliminate the Affordable Care Act without having anything really to replace it. There's 225,000 Tennesseans who are depending on the Affordable Care Act for their insurance, many of whom would not be able to get insurance somewhere else. And you're doing this from a platform of you've got free, lifetime, excellent healthcare from public funds. And I think that's hard to justify — I think it's impossible to justify when the only reason you're doing it is a political reason. It's one thing if you run out of money, but it's all just political posturing.  Obviously, I've [drawn a contrast] on the opioid issue — you've probably followed some of that, I won't repeat it all.  One area that I just want to emphasize a little bit — there's a lot of issues with the VA, the Veterans' Administration, and that's been my field. That's a place where having been someone who's run large healthcare operations — I think I'd have some understanding of it and I ought to be able to help sort this thing out and getting it more responsive to the needs of veterans. And that's simply a contrast in the sense of that's something I spent a significant part of my life doing as opposed to she has no experience whatsoever in that area. BI: A lot of Democrats are signing on to single-payer — Medicare for All. Do you think that's a good long-term goal? Should it be pushed for in the short term?Bredesen: I'm not ready to sign on to that at this point. I do think we need to take some first steps to just solidify the Affordable Care Act. I mean, It's the law of the land, as I said there's 225,000 Tennesseans who are depending on it. Lamar Alexander [the senior senator from Tennessee] who heads up the health committee has a bipartisan bill that I think does a lot of good things to help stabilize the markets — and I think that's what we need to do to while we talk about the longer-term solution. This is one thing that I really believe has got to be done on a bipartisan basis. I think one of the flaws of the Affordable Care Act is that it wasn't done on bipartisan basis. We've always done big things in this country on a bipartisan basis — Social Security was that way, Medicare was that way, the Voting Rights Act was that way, and I think we're not going to make progress on a long term solution to healthcare until both parties figure out a way to do it together.                                                                                 BI: Are you surprised the Republicans have changed their tune recently on the ACA and pre-existing conditions protections?Bredesen: Yeah, I think it's one of the things that's confusing to the public. \"We're going to get rid of Obamacare, but we're going to protect pre-existing conditions.\" Well, okay, how are you gonna do that? So I've tried to call that out. I think it's certainly appropriate to contrast yourself, but I have not been trying to correct or fight back on every single crazy thing that comes of out these ads and so on, on the basis that I don't want to run a campaign in which the issues are driven by the opponent. I like to talk about my own issues. And I've talked about healthcare from several aspects — most recently this stuff having to do with the drug prices and our approach to dealing with that. BI: What do you think Democrats are getting wrong on the national level?Bredesen: I think we've gotten too elitest about things, I think we've gotten a little too narrow about the definition of what it is to be a Democrat. I'd like to see us getting back to being a muscular party, whose common theme is about creating opportunity for working and middle class Americans. And picking issues that clearly focus on making that happen. And I do think the tent needs to be bigger. I'm from Nashville now, but I'm originally from a rural upstate New York area, and I know these non-urban folks all over the country, and certainly in this state — it's a different culture, it's a different set of values. They're not better or worse, they're just different. And I think Democrats, we claim to have respect for multiculturalism — well, some of those cultures are American. And I think we need to broaden the tent a little bit and have a little more respect for the needs of people in these different places. BI: How, specifically, should the message or the policies change?Bredesen: I think, first of all, we need to focus the message there and get off of a whole variety of social issues and other issues, which I'm not saying we're wrong on, I'm just saying they're appealing to relatively small parts of the base. I think we should be much more creative about healthcare than we are. When the Affordable Care Act was being debated, I was still governor then, but it struck me that healthcare has changed dramatically since 1965 when Medicare and Medicaid came in, and yet the ACA is kind of doubling down on the system that worked in 1965. So, I'd like us to be looking forward. It's a little bit like when we passed Social Security, we were thinking of the conditions that existed in 1880, not 1935.  So that's one area where I think we could just be much more creative. There's a lot of smart people in both parties who could get some good ideas out there. BI: How well do you think Democrats are handling immigration? What do you think of the \"abolish ICE\" movement\"?Bredesen: I don't think particularly well. And again, when you say Democrats — there certainly are a few visible, national people who are sort of taken to be the voice of Democrats, which I haven't always accepted, but I think we do have an interest in our country in being able to control and secure our borders. And so when somebody says something like abolish ICE [Immigration and Customs Enforcement], my reaction is that's a stupid idea. Obviously, we need to control our borders and if they're not doing something right, let's fix what they're not doing right, but I think most Americans want to control the borders. We can debate whether there's 50,000 or 150,000 people who come in from some country or some area or under some set of circumstances, but controlling the borders I think is basic. I think we should recognize that and stop this stuff of trying for more open borders through lack of enforcement. BI: Taylor Swift recently endorsed you. Were you surprised by that?Bredesen: Yes. I wish I could claim that it was something I had organized or orchestrated, but it was not. I had known her very slightly before she became really famous because we went around and did some things in schools, talking to kids about drugs together, but not a lot — a few times. And I've seen her backstage at things over the years once in a while. But I had no reason to believe she would even know I was running, let alone that she would do this. So it came out of the blue and it was surprising. And I think it was helpful. You know, for somebody who's on the other side of 70, relating to millennials is not as easy as if you're [Texas Democrat] Beto O'Rourke or somebody, so I think that really helped me. BI: How have you reached out to communities of color, to younger voters?Bredesen: It's different — I mean, with people of color, I've had a long record there. I've been, I think, respected and in good shape in those communities. When I was governor we really, I think, did a good job of having appointments and members of our cabinet, and judges to be representative of the larger community — and they recognize that. And there were a number of issues I worked on that were important in those communities — in education, we did a lot of work on infant mortality in Memphis, for example — so I've always been in reasonable shape there. Obviously, you need to campaign and pay your respects, but I've always been in reasonable shape there.  For millennials, it's more like, they just don't know what I did as governor because they were five years old or something and now they're 20. For them, you need to reach out. I've really done that in two ways, one of which is to talk about a couple of issues that seem important to them — obviously, college and student debt is one of them. I've found that net neutrality — they tend to know more about that stuff than other people. I always make a point of trying to talk to them as adults because even if they're 22, someday they're going to get married, some day they're going to have kids, they want to have good jobs, they want to have a strong economy, they want to have education for their kids and so on. I think it's also important to not just segregate people into these little demographic groups and talk about just their issues because these young people are also young Americans who are going to have a lot of the same concerns that anybody else does. BI: Do you think Tennessee is becoming more conservative? How do you think the state has changed — in terms of political demographics — since you were governor?Bredesen: I'm not sure whether people's opinions have changed, but I think their view of what party is likely to better address their issues has tilted very much in favor of the Republican Party in the last 10 years, 15 years. It was starting to happen when I was elected. I was elected in 2002 and that was two years after [Democrat] Al Gore had lost the state famously and the presidency. And it's continued in that path ever since then. But I think, in a way, something that's good for me is I'm really trying to reach out to voters who have abandoned the national Democratic Party to try to get to see me as acceptable, and okay, and desirable, as opposed to trying to convince people who have a lifetime commitment to the Republican Party as an organization change their views. I will get a fair number of Republican votes from — I call it the economic wing of the Republican Party. But I think their view of what party is being responsive to their issues has definitely shifted. BI: You had a long career and didn't need to get back into politics. Why did you do it?Bredesen: I hadn't really retired. When [my wife] Andrea and I talked about it I think we just decided this was the highest and best use of me. I was getting discouraged for a long time over what I saw was happening in Washington. When Bob Corker said he wasn't going to run, there was an opening there and I was uniquely positioned for that opening because it had been my background for so long. And I just kind of felt it was my responsibility to step forward and do that. I'd be much more satisfied personally by trying to fix that problem while sitting on a beach somewhere. It was a big decision — I'm 74, it's no secret. So if I'm elected, I'll spend a significant part of the rest of my life — maybe the rest of my life — getting on a plane to Washington on Monday night, coming back on Thursday night, being in Memphis on Friday and Chattanooga on Saturday and all this kind of stuff. So it obviously has to be for something I care about. But just this issue of trying to get the mechanics of government once again working for the benefit of the people in the country is a really important issue and there's nothing I'd rather do. BI: Was there a tipping point for you?Bredesen: I don't think so. There are several people who have taken credit for convincing me, but it's not right. I started out talking with Andrea about it, talked to a few of my friends and associates from the days as governor, who I trusted, and obviously did a little research — I'm not interested in any windmills or suicide missions or anything like that, I wanted to make sure it was possible. I think what we decided was that it was a very close race, that it was doable and worth the effort.                                                                                 BI: What other issues would you try to work across the aisle on in Washington?Bredesen: I've often talked about the fact that we've always done things in this country — the big things — in a bipartisan way. Social Security was that way, Medicare was that way, the Voting Rights Act was that way — I think immigration's in that category. It's something that's that's built up over the course of 30 years, of 35 years, and in the same way that I was very critical of the Affordable Care Act and trying to do a big thing by ramming it through as a partisan issue, I don't think we're going to get any significant immigration [reform] through as a partisan issue, we've got to find some ways to do it. I think that DACA [Deferred Action for Childhood Arrivals] and solving that problem could be the entree into that, solving it is popular across the board. I think we should just deal with that as an isolated issue. BI: Would you tie the president's rhetoric — and attacks on the media and his political opponents — to the actions of a Florida man who recently sent explosive devices to several top Democrats and CNN?Bredesen: I don't care to second guess how the president is handling it. I do think that — while, obviously, I don't know all of the motivations and the background of this guy — I think the sort of volume right now of rhetoric and stuff that verges on hate speech and the notion that if you're not in my tribe you're the enemy and evil and so on, as opposed to we're all Americans who have different views about how to solve some problems, I think opens the door for people who are on the fringes of society to consider more of this kind of thing, which I think is not healthy. You just make it more acceptable with that kind of rhetoric.  We just had this tragedy with the shooting at the synagogue and again, not knowing all the reasons, I suspect it will turn out to be the same kind of thing — somebody just harboring his hate-filled notions. In a different environment might not have gone anywhere, but in this environment might have seemed more reasonable.                                                                                 BI: What do you say to those on the left who want you to move to the left on policy issues and campaign more aggressively against Rep. Blackburn?Bredesen: I'm going to campaign as who I am. There have been some places where I've tried to draw contrasts with my opponent, and there's been third party ads on both sides, but we certainly haven't done anything in the category of 'let's throw something against the wall and see if it sticks to the wall for some reason.' I'm running a campaign based on who I am, I get the support to talk about issues, I get the support to be civil about things.  The thing which people remarked most about that last debate to me was the final question which was, 'would you support your opponent once they're elected.' She basically said no and I basically said yes, we've got an election which is about making a decision, and when that's done we need to come together and figure out how to help that person be successful — that's a pretty fundamental difference. Rep. Marsha Blackburn talks with a supporter in Franklin, TN on October 27.                                            Eliza Relman/Business Insider                                     Business Insider: What would you say is the biggest policy problem in the state?Blackburn: What we hear in the state is that people want to keep growth and jobs. The number one thing that they will bring up is 'let's keep this economy growing because Tennessee's economy is very robust, it's doing very well.' Unemployment is below the national average. And they bring that up with me because when I was in the state senate, I led a four-year fight in opposition to a state income tax and people in this state joined with me, we won that battle, I went to Congress, worked with Kevin Brady, who now chairs the Ways and Means, and we restored sales tax deductibility for those of us in non-state income tax states. It was a driving force and the only promise I made when I ran, and I was able to get that done. And that is worth about a billion in tax savings to Tennesseans every year. So people will talk about that, and they bring the state income tax up because in 2014 the state voted in a referendum to amend the state constitution to forever prohibit a state income tax, so it is a settled issue in our state.  And people will say the Trump tax cuts are working, the regulatory relief is working, let's keep these policies going. They also mention wanting to see more federal judges — the district courts, the appeals courts, they like Gorsuch and Kavanaugh on the Supreme Court, so they mention that. Law enforcement talks a lot about the immigration issue. When Bredesen was governor, he gave driving certificates to 51,000 illegal aliens. And we became kind of a magnet for illegal aliens that were looking to get those driving certificates. And those problems of drug trafficking, sex trafficking, gangs, they end up in local communities and local law enforcement is on the front line with that.  Healthcare comes up quite a bit. When you look at the Tennessee work place, you have about 93% of all the jobs are small business jobs or independent contractors and health insurance rates have skyrocketed under the Affordable Care Act, and we have — I think it's about 15 or 20% of the state — that has either no, or only one, provider of an ACA-compliant plan in the marketplace in their county, so the cost has just become cost-prohibitive. And we have 160,000 Tennessee families that had to pay the penalty because they couldn't afford to buy the insurance. And I just talked to a lady and that was her number one issue. She is a single mom, a teacher, has a couple of kids and one still — she said she can't afford the family plan so she has to go to the marketplace. BI: Where do you stand on protecting people with pre-existing conditions?Blackburn: Oh, that was a Republican provision and has been.                                                                                 BI: I think reporting has shown it was actually a Democratic initiative.Blackburn: It goes back to '06 — and we supported it then. I support it. When we had it in committee back in 2006 and were trying to push it forward. I support providing pre-existing conditions and older children staying on insurance policies. BI: Do you still believe people with pre-existing conditions should be put in high-risk pools? I think there's a way work on those. The House has done some work on the high-risk pools looking at the Maine model and certainly we were hopeful that we'd be able to do something with that. The object is to get to the point where you have access to affordable health insurance and access to affordable health insurance for all Tennesseans. BI: You've said you're to the right of Sens. Alexander and Corker. What do you disagree with them on?Blackburn: I wouldn't even say it is disagreement. I think that when you look at the Republican Party, what you've got is a big tent and a lot of discussion about how to approach issues and I've had the opportunity to work with Sen. Alexander a good bit on healthcare issues, certainly on 21st century cures, that we did in a bipartisan way coming out of the House and the Senate and the SOFTWARE Act, which I had authored, was included in that, that set up the definition for healthcare technology. Also the Children Count Act, that was clinical trials, allowing children into clinical trials. So we've had a good working agreement on that.  Issues where I'll have a difference of opinion or a different approach many times deal around government funding issues. I prefer to see us lower our spending. Every year I offer one, two, and five percent across-the-board spending cuts and I think that is a fiscally responsible position to take. We've got to get the spending under control. I support a balanced budget amendment that includes no tax increases. BI: There was another mass shooting this morning — this one at a synagogue in Pittsburgh. Would you work across the aisle on any gun control measures?Blackburn: The shootings are just heart-wrenching and I fully believe that we can protect the Second Amendment and protect our citizens in public places. We in the House have already voted to put the red flag system in for mental health. There is no one that wants a person who is a danger to themselves or others to have a firearm. BI: Is Tennessee becoming more conservative, in your view?Blackburn: As you walk around and talk to people, what you will hear — and I think much of this is because Tennessee is such an entrepreneurial state — they will say, 'get government off our back, get it out of our pocketbook, lessen the regulation.' I use a little formulary many times speaking to business groups — less regulation plus less taxation plus less litigation equals more innovation and job creation. And that really is where a lot of Tennesseans are.  With so many jobs being small business jobs, sole proprietors, independent contractors, people just want less interference from the federal government. They are very constitutional in their view of the responsibilities of government, they do not want micro-management of the government, they do not want big projects managed by the government. They want freeing up of the private sector. I talk about it in terms of freedom, free people, and free markets. And that is really where Tennesseans are. And they're pretty pragmatic. BI: Do you think President Trump is a good role model?Blackburn: President Trump is and continues to be a good role model for politicians. He made promises and he's kept them and he's good at getting the job done. As we saw through the [Brett] Kavanaugh hearings, he's very loyal, and he stood with him through that process and now he is Justice Kavanaugh. So for elected officials that are in public office, he presents a good role modeling of how to keep those promises and get the job done. BI: Some that I've talked to here don't like the president's rhetoric. Do you think he should change his rhetoric?Blackburn: There's a couple of times I've said we need to take a kinder approach. This is the South and people have a lot of respect for manners. They also understand that sometimes it is important to draw a proper contrast and to show where someone truly stands on an issue. I had a gentleman today who said I don't appreciate some of the rhetoric, but we elected him to go drain the swamp and if this is what it takes to get elitism out of Washington, DC then that's great. This gentleman said he always knew I'd been a fighter on the outside kind of pushing against the establishment and trying to return us to a government of, by, and for the people. He said, \"I'm hanging in here with this and very appreciative for the tax cuts, for the federal bench, for the work that's being done to curb illegal immigration, for the push you all are making trying to get the Affordable Care Act off the books so that we can free up the insurance marketplace and increase access.\" BI: I just spoke to one of your supporters who thinks that the mail bombs sent to top Democrats was orchestrated by the left-wing, rather than the right-wing —Blackburn: Let me just say this, when it comes to any of these bombings, whomever does these things, makes these death threats, they need to be prosecuted to the full extent of the law. There is no place for this in civil society. BI: The accused bomber was a big Trump supporter. Do you blame the president at all?Blackburn: This happens from both sides. I've had plenty of threats, my staff has had personal harm threats, I've had death threats. There is just no place for this. We had a group that set up a Facebook page that had to be taken down. It was a \"Rape Marsha Blackburn\" page. There is just no place for this. It's one of the things that will cause individuals to say I don't want to choose to serve.                                                                                 BI: Do you agree with Gov. Bredesen that there is too much partisanship in Washington?Blackburn: I've got one of the most bipartisan records in the House. You can look at my record at my committee that I have led and I've led that committee — the subcommittee on — in a very bipartisan way. There is a lot of partisan rhetoric. Gov. Bredesen could have run as a Republican, chose not to — didn't have the courage to. Chose not to run as an independent. He has been running as a Democrat since 1970, so he would go to Washington as a Washington Democrat. BI: You would be the first female state-wide elected official in Tennessee. You talked about...Blackburn: People that I have had the opportunity to serve and to represent know that I'm going to be the most hard-working elected official they have ever had. They know they can count on that, and that word gets out. BI: Do you think they ever think about how you being a woman might change the way you legislate, in a good or bad way?Blackburn: The more barriers I break, the less of an issue it becomes. "}