{"id": "5 male ad execs are considering a discrimination claim after their gay female boss said she would 'obliterate' her company's reputation as a haven for straight, white men", "paragraph": " Five straight, white men have retained a lawyer to look at whether they can bring a discrimination claim against ad agency JWT, after a senior executive said in a meeting she wanted to \"obliterate\" JWT's reputation for being populated by white, British, privileged, straight men,  The Times reports.  The men went to their HR department after hearing the remarks and lost their jobs days later,  according to Campaign magazine and  The Times.  JWT denies it discriminated against them.  The creative director of the agency, Jo Wallace, made the speech at an agency conference attended by JWT executive creative director Lucas Peon and James Whitehead, the chief executive. The context of her remarks was that JWT had been ranked near the bottom of its peers on a measure of how equally it paid men and women. JWT's gender pay gap was 44.7%, The Times said.  Peon said at the meeting, \"In the World Cup of sucking at pay gap numbers, we made the final.\"  \"Wallace, who introduced herself to the audience as a gay woman, said she was going to 'obliterate' JWT's reputation as an agency full of white, British, privileged, straight men,\"  Campaign reported on November 12. The magazine gave no further context for what she meant by \"obliterate.\" There is another  account of the meeting here.  In 2017, however,  Wallace wrote a column for The Drum, a marketing trade magazine, that said, \"a hell of a lot of people are literally sleeping on the job when it comes to diversifying their creative department beyond white, pale, stale males.\"  \"If you're going to troll me as an angry, white, privileged man claiming that you're now at a disadvantage, (yes, I've had several white, privileged men try to convince me of this ridiculous notion), please check your stats, and please #CheckYourPrivilege. If I may point out, you still account for at least 80% of senior creative roles. Even after a concerted effort in recent years, women still only represent 13% of creative directors and still, in 2017, only 8% of senior positions are held by someone who's black or from a minority ethnicity. Statistics, history and the resulting bias in society demonstrates that you are in fact unfairly advantaged,\" her column said.  \"If your department is full of white, straight men then there's a very good chance you're confusing talent with privilege and when that sentence comes out of your mouth you're basically equating diversity to 'talentless',\" Wallace wrote.                                                          The men reportedly went to HR to ask what Wallace's statement meant for their careers and were let go shortly afterwards. JWT has been conducting a rolling series of layoffs across the company, according to multiple reports.  In a press statement, JWT said, \"It's not appropriate for us to comment on individuals in an ongoing process. Any redundancies at J Walter Thompson London are handled fairly, lawfully and without any form of discrimination.\"  JWT's potential liability in the case is exacerbated because of the discrimination angle,  according to Campaign columnist Jeremy Lee. \"The damages for unfair dismissal are capped at about £80,000; however, if the group of creatives can prove that they were discriminated against, there is no limit to the damages they could receive. Some believe that this could cost the agency millions,\" he wrote.  The advertising world has been roiled by claims of sexism at the management level for decades. In 2016,  Saatchi & Saatchi CEO Kevin Roberts was forced out of his job after he told Business Insider that \"I don't think [the lack of women in leadership roles] is a problem.\"  JWT's former CEO,  Gustovao Martinez, left the agency earlier this year after being accused of making sexist and racist comments. "}