{"id": "After seeing the iPhone XR in person, I'm not sure if I can recommend it", "paragraph": " I was really excited for the iPhone XR. But after spending some time with it, I'm just not sure if I can recommend it, especially at its $750 price point.  On paper, the iPhone XR would seem like the better deal compared to the iPhone XS, which starts at $1,000.  Both phones are powered by the same brains: Apple's new A12 Bionic chip.  Both phones have nearly identical camera systems.  Both phones run the same software.  But the iPhone XR has clear advantages: a larger screen, better battery life, more colors, and it's $250 cheaper.  This would make it seem like the iPhone XR is the clear winner over the iPhone XS, right?  I got a chance to use both of these phones in person recently, and after spending a good deal of time with them, I couldn't imagine getting excited enough to buy an iPhone XR. Of course, this is a decision you'll have to make for yourself, but I would personally recommend spending the extra money on the iPhone XS, if your options are only those two new iPhones, or something even cheaper if you're trying to save some money.  You touch your smartphone dozens, maybe hundreds, of times every day. In my opinion, it's worth it to get a phone you're really going to like.                                                                                                                                                                      But the first thing I noticed when I held the iPhone XR in my hands was the screen, and how dull it looked.  Colors looked muted. It felt very dim in general. And the screen looked almost sunken, which was probably because the bezel, or border around the display, is thicker than it is on the iPhone X and XS. Read more:  9 reasons you should buy the iPhone XS instead of an iPhone XR Now, I've personally become accustomed to the OLED display on my iPhone X, which gets very bright and provides excellent contrast. OLED displays, in general, are better-looking than LCD displays, and the iPhone XR has an LCD display. But for some reason, seeing the iPhone XR in person, with the same edge-to-edge display as the iPhone X, but with an LCD instead of an OLED — just didn't get me excited; quite the contrary.  On paper, this display is technically better than the iPhone 8's LCD display. And it's still a very powerful phone that runs Apple's ecosystem. But I think many customers would have a tough time picking the iPhone XR over the iPhone XS if they've seen both phones. The iPhone XR costs $250 less to start compared to the iPhone XS, but the gap in display quality makes it pretty clear how Apple was able to get that price down.  I was personally excited to see the six new colors of the iPhone XR. But then I saw them in person.                                                                                                                                                                      One of the biggest selling points of the iPhone XR is that it's available in more colors than any other iPhone. But I'd say in general, the best-looking iPhone XR models you can buy are the black and white models, which are colors you can get on any other iPhone.                                             Apple                                     After that, I'd say your best bet is the new coral color, which is nice but you have to be okay with a very orange-looking iPhone. Then come the blue and yellow models, which are tied in my mind because they both look equally childish. I would rank the shiny red iPhone XR last, unfortunately; the hue is fine, kind of like a Ferrari, but to me it's a bit bright and aggressive. I'm not sure I'd want to look at it on a daily basis. Read more:  Here's how to decide between the red, blue, yellow, white, black, and 'coral' versions of the iPhone XR Personally, I think Apple would be better off coming up with more mature colors for its iPhones — to make them distinctive but also desirable. The iPhone XR colors are too bright and tacky, in my opinion.                                                                                                                                                                      I think the iPhone XR could have looked incredible in deeper tones, like navy blue or forest green. Even a deep-red \"wine\" color would have looked great. Apple last year even made an iPhone X case in \"dark aubergine,\" which is this beautifully rich purple color. Why couldn't that be on an iPhone? Heck, I would love a deep brown, almost chocolate-looking iPhone XR. I'll keep holding out hope that Apple's design team comes around on this one.  At $750 to start, the iPhone XR is cheaper than the other new iPhones announced this year — the iPhone XS and XS Max — but it's still by no means a \"cheap phone.\" After taxes, and hopefully some kind of insurance (Apple's own AppleCare+ if you're a smart cookie), you're still spending over $900 for the iPhone XR. That's very expensive.  By all means, I am not saying the iPhone XR is a \"bad phone.\" It is an excellent phone. But it clearly looks like a step down from last year's iPhone X and this year's iPhone XS. And for many of the same features, you can get the iPhone 8 for $150 less — it starts at $600 right now.  If you're just looking for an affordable iPhone, though, I'd go for the iPhone 7. A \"seven\" might sound old compared to a \"ten,\" especially when you're talking about technology, but the iPhone 7 is actually only two years old, and it starts at $450. As someone who owned and loved his iPhone 7,  I would call this a steal.  I'm sure many people are still interested in the iPhone XR because it's so similar to the iPhone XS, but more affordable and available in more colors. Money is going to be a top consideration for many people. But if you have the extra cash, I'd advise splurging on the iPhone XS, since it really is that much better to look at and use, or save even more money and get yourself an iPhone 7. I'm just not sure if I can recommend a phone that looks cheap, but isn't.  This is an opinion column. The thoughts expressed are those of the author. "}