{"id": "", "paragraph": "By MARINA STARLEAF RIKER | Victoria Advocate, Texas | Published: October 20, 2018\r\n\tTIVOLI, Texas (Tribune News Service) — It was only a matter of weeks before Joe Villarreal, 65, would have moved into a brand-new home.\r\n\tAfter Hurricane Harvey ripped apart his longtime Tivoli home, volunteers had just started to build the U.S. Air Force veteran a new one on his property. It was going to have two levels, just like Villarreal wanted, and enough space for his beloved pets – most importantly, his two chihuahuas. \"He was really excited,\" said Mary Canales, the mayor of Austwell who helped connect Villarreal with volunteers. \"He got to pick the color of the house, the paint – so he was very excited and happy.\"\r\n\tBut sadly, moving day would never come for Villarreal. The veteran, remembered for his kindness, warm smile and love for animals, died early Friday morning when a fire destroyed his Tivoli home, still in disrepair after Hurricane Harvey.\r\n\tShortly after midnight, firefighters found the home engulfed in flames. It wasn't until after firefighters from departments in Tivoli, Austwell, Refugio and Seadrift extinguished the blaze that they found Villarreal's body. An official said later that morning that he didn't know what caused the fire.\r\n\t\"He was liked by everybody,\" said Villarreal's brother, David, who lives just a few houses down. \"It was a sad way to go.\"\r\n\tVillarreal, who is known by most as \"Joe Bird,\" was raised in Tivoli and would've turned 66 later this year. He left South Texas to join the U.S. Air Force to serve during the Vietnam era, then eventually returned home to work in construction. \"Everybody knows him as Joe Bird,\" said his brother. \"A friend of his gave him that name because he wore these round glasses all the time.\"\r\n\tLate Friday morning, that news of Villarreal's death had spread across Austwell and Tivoli. Grieving friends and family said the veteran loved his pets; community events; and driving his red Ford Mustang to Hopper's Landing, a popular local fishing spot near Austwell.\r\n\t\"I just can't believe this,\" said his neighbor, Rosie Canales. \"He was at my house yesterday.\"\r\n\tCanales had just returned home after working at a nursing home in Port Lavaca when a neighbor called her in the middle of the night to give her the sad news. From Canales' front yard, you could see what was left of Villarreal's home – smoke rising from heaps of charred belongings, building materials, brick and pieces of a blue tarp that once covered the home after Hurricane Harvey.\r\n\t\"I just can't believe this,\" Canales kept repeating. As she went to check her mailbox, a silver pickup pulled over. The woman inside called to Canales: \"Did Joe get out?\"\r\n\tCanales paused, then responded: \"No.\"\r\n\t\"Sad,\" the woman replied before driving off.\r\n\t\"God, it's so sad,\" Canales continued. She knew Villarreal from when they were both small children, and she went to school with his sister, she said. Decades later, he often came to sit with her outside her home, usually accompanied by his beloved dogs. It's unclear whether they, too, perished in the fire.\r\n\tHis neighbor was just one of many Austwell and Tivoli residents who spent Friday processing Villarreal's death. Just 6 miles from his home, friends in Austwell recalled their favorite moments with him.\r\n\t\"He couldn't believe that (my husband) went out of his way to buy a couple of books of house plans so Joe could pick out his house,\" said Cindy Bailey, who runs a nonprofit that was helping Villarreal rebuild.\r\n\tSince late spring Bailey and her husband, Rusty, had been working to build a new home for Villarreal with the help of another veteran, Bradley Gruetzner, who works to help veterans across the U.S. By the time Villarreal died, the group had raised thousands of dollars in addition to collecting most of the building materials, furniture and appliances for the new house.\r\n\tThey were just about to start constructing the frame and expected the home to be built within about six weeks. Villarreal was beyond excited, Bailey recalled.\r\n\t\"He was just happy,\" said Bailey. \"He died hopeful – that's one way of trying to comfort ourselves in this.\"\r\n\t___\nAdvocate reporter Jon Wilcox contributed to this report.\r\n\t(c)2018 Victoria Advocate (Victoria, Texas)\r\n\tVisit Victoria Advocate at www.victoriaadvocate.com\r\n\tDistributed by Tribune Content Agency, LLC.\r\n\t article continues below "}