{"id": "No Man’s Sky travel journal: into the terrible abyss", "paragraph": "At various points over the last two years, I’ve been documenting my time with the sci-fi exploration game No Man’s Sky in a series of journal entries. And while that series came to a conclusion back in August, I decided to bring it back for a one-off story about my time with “The Abyss,” the latest No Man’s Sky update that adds depth to the game’s oceans and new, terrifying creatures to uncover. It’s the perfect thing to play before Halloween.It starts, as it usually does, with a call for help.As I drift aimlessly through an asteroid field, collecting gold and silver and whatever minerals I can get my hands on, my communicator chimes. But the message is distorted, and I can’t catch most of it. Something about the speaker being “duty bound” to follow. It’s intriguing, though, and I’m able to pinpoint the origin of the message: a planet in a nearby system. With nothing else to do, I decide to head straight over. I punch the hyperdrive and watch the world bend around me.The star system I end up in is bathed in cool green, a handful of planets scattered about huge asteroid belts. But I only have eyes for one world: the ringed planet where the signal originated. As I approach it, I realize is covered almost entirely in a liquid ocean. Once I make my fiery descent through the upper atmosphere, I have a hard time finding a place to even land my ship. There are small, rocky islands dotting the surface, but most of them are too small to touch down. Eventually, after a few minutes of flying close to the surface of the unending ocean, I find a tiny rock formation with just enough space for my ship.As soon as I exit my craft, I can feel eyes on me. It only takes a few seconds before a sentinel — a flying drone that serves as a sort of planetary police officer — swoops over me, its round eye glowing red with distrust. I need to be careful. Normally they pay me no mind unless I’m doing something that actually harms the planet, but this sentinel seems upset that I’m even here at all. Best not to test it. I use my scanner to identify the exact location of the distress call and find that, of course, it’s coming from underwater. I leave the sentinel behind and dive in.From above, everything about this world is blue. But down below there’s a kaleidoscope of colors. There are glowing orbs dangling out of towering red plants, strange purple clams stuck to green rocks, turquoise crystal formations that shimmer hypnotically when I point my flashlight at them. I inspect a rock on the seafloor with an intense orange glow — only to swim away as fast as I can as it spews out a cloud of superheated water. There’s plenty of animal life, too; long fish with big bellies and square jaws, smooth red squid that swim together in large groups. Unlike the vigilant sentinel, the sea creatures don’t seem to even notice my presence. The water is so clear that when I look up I can see a nearby planet hanging ominously in the sky.It only takes a few minutes to find the source of the signal, but even in that short amount of time I‘ve almost completely depleted my oxygen reserves. It’s not clear whether I have enough air to resurface. I find a small craft, slightly larger than my own, but completely destroyed with no working systems whatsoever. Nearby, there’s a small structure that’s sealed off from the ocean where I’m able to head inside and catch my breath.I know the ship crashed, obviously, but I don’t have any information about the crew or how they met their demise. But I am able to pull some very useful blueprints from the ship: it’s the recipe for making my own submersible vehicle, a sort of mini-submarine. Putting it together is a tedious process. I mine nearby rocks and salt pillars for raw materials, but I have to keep heading back to the crash site to get oxygen. Sometimes when I destroy a big rock formation, a school of bright white jellyfish will burst out and attack me.A few jellyfish stings later, I have a nice little vehicle that makes it a lot easier to get around this huge ocean. It’s also equipped with a sonar device that searches out points of interest underwater, including sunken wrecks and submerged buildings. I find one such structure a few minutes from the crash site. It’s night, and aside from the light coming from the twin headlamps on the front of my sub, I can’t see much. I sit still, and aim the lights around the building, trying to get an idea of what awaits me inside. It looks mostly harmless, but there are some strange, tube-like growths on it; one on the roof and another near the main entrance.When I get out of my ship and head toward the door, the growth springs to life. The tip opens to reveal a huge, glowing yellow eyeball, which emits a red beam, pulling me closer to it. I can’t swim away, so I pull out my weapon and start firing at the creature. At first it does nothing — the bullets bounce off its body. But when I hit it directly in the eye, it releases its grip on me. I keep firing until the horror is dead, and leaves behind its eyeball as a kind of twisted trophy. I pick it up wondering how much it’ll fetch on the galactic market.Inside the building, I’m able to access a slightly decayed computer and I learn a bit more about the people who sent out the beacon. I repeat this process a few times, using my sonar to locate structures, and then scouring them for clues. It’s amazing how much is sitting at the bottom of this ocean. More buildings guarded by those unnerving eyes, ancient temples that look centuries old. Once I even come across an entire freighter, cracked in half, resting on the sea floor.Slowly, I piece together exactly what happened to these people who were lured by this world’s abundant natural resources, until something happened that left their ship inoperable. Eventually they began to experience a sort of shared mania. I can’t pinpoint the cause — there’s mention of a cave, but I’m not sure if that’s it — but crew members talk about seeing disorienting geometric patterns burned into the sky. There’s a sense of panic and dread as the crew members discuss fixing their ship to escape. Unfortunately, all of the messages I find are distorted, with huge chunks missing. Sometimes there are just hours of scratching noises. In the end, I’m left with more questions than answers, and no real, solid information of how the crew died.To clear my head, I go for a quick swim around the abandoned, submerged temple. The underwater plant life is dense and rich, and I figure at the very least I should be able to find some rare resources to make this trip worth it. One plant in particular catches my eye, with its long, curving stems that each house a bright orb on the end. They look like the kind of orbs I could sell for a lot of money. But as soon as I grab one, a massive, striped fish bursts out of the plant — and I realize that the orb is attached to its head as a kind of lure. I scramble back into my sub and speed away as fast as I can, not even looking back to see if it’s following me. The fish is big enough that it could easily damage my small submersible if it really wanted to.In my panic, I manage to pilot my sub into a tight, dark cave without realizing it. I’m not entirely sure which way I came in, so I just pick a direction and drive. I keep smashing into crystal formations, and banging my ship on the roof of the cave. To make matters worse, my sub’s fuel is only about a quarter of the way full. I start to panic . But after about 15 minutes in the tunnels, I pop back out into the ocean right near the crash site where I started. Finally some good luck.With nothing else to do, I head back to that original site, to see if I missed a clue. There has to be some kind of detail I overlooked, something that could give me more insight into the crew’s fate. But when I arrive, the ship — the one that, earlier in the day, had been a completely non-functioning wreck — is gone. There’s a burnt shadow on the ground where it once was, and nothing else.I decide I don’t want answers after all, I just want to get off this planet for good. I head to the local space station to teleport to my homebase for a little while — it may not be all that exciting, but at least I know there aren’t any terrors waiting for me."}