{"id": "Android’s new multitasking is terrible and should be changed back", "paragraph": "I’ve been using the Google Pixel 3 XL since its launch two weeks ago, and I wholeheartedly agree with our review’s conclusion that the Pixel 3 offers the best Android experience right now. But there’s one aspect of that Android experience that I can’t abide, and no, it’s not the gargantuan notch. It’s the appallingly bad new multitasking system, which is mandatory on this year’s Pixel generation, foregoing the option of the old familiar Android button trio as we had with the Pixel 2 on the same Android 9 Pie OS.On its surface, Google’s new approach to switching between apps looks a whole lot like the one Apple introduced with the iPhone X. It relies on swipes and shares two of the same fundamental gestures: one swipe up from the bottom of the screen brings up the multitasking overview, while lateral swipes across the bottom navigation bar flip between apps. Like my colleague Dan Seifert, who argues everyone should copy the iPhone X’s gestures, I think Apple’s implementation of this approach is gorgeous (in its animations) and quickly becomes second nature once you figure out the basics. Google’s, on the other hand, is filled with internal contradictions and painful annoyances.Google’s first major sin with implementing these new gestures in the Android interface is that the company refused to get rid of a fundamental old one. The app drawer, the place where you stash all the apps you don’t need on your home screen, has for a long time been accessed by swiping up from the bottom of the screen. (At least in Google’s flavor of Android.) Now, that same swipe is how you get into multitasking mode, which is all well and good — I don’t fear change — but Google thought it wise to still have an upward swipe to access the app drawer, just a much longer and horribly unnatural one. With a phone the size of the Pixel 3 XL, it’s legit thumb tendon exercise to execute a full-screen swipe.When I want to access my apps, what tends to happen most often is I fail at completing the awkward long swipe, wind up at the multitasking menu, and then I do another quick swipe to get to the apps. This may sound minor, but it genuinely takes away from the speed with which I’m able to access my less commonly used apps. Even if I populated a half dozen home screens or folders with those apps, that’d still take longer than Google’s previous, effortless system of swiping up and picking out the desired app immediately. Where there was once fluidity and speed, Google has now introduced frustration.The slickest aspect of Apple’s iPhone X / XS navigation is the way you can swipe across the gesture bar at the bottom to switch between apps. Google has a drunk version of this. Firstly, it lacks the smooth animation of Apple’s system. In Android Pie, the app window shrinks back, slides right, and then the previously used app zooms into full view. This animation is jarring, with the latter app seeming to bounce up at you.Apple’s navigation also allows the user to swipe left and right between apps, whereas Google’s only toggles between the most recently used app and the current one. To go further back, you don’t do more swipes, you have to hold your finger on the right of a navigation bar that shows up and functions somewhat like a scroll bar in desktop operating systems. The problem there is that I can never judge the correct amount of holding to do to get to my desired app. With the iPhone, I know that the fifth most recently used app is five swipes away, I can do that without looking at or paying attention to the phone. With the Pixel 3, I have to very carefully pick the exact right moment to let go as the phone flicks between my recently used apps. It feels like trying to walk on an ice rink.Set aside the comparisons to Apple’s gesture-based interface, which is still not everyone’s favorite cup of UI tea. What about Google’s existing multitasking system in previous Android iterations? It had a dedicated software button to access multitasking, so no swiping conflict with the app drawer, and I could double-tap that button to switch to my most recently used app. It was fast — but more to the point, that action was easy to turn into an unconscious habit. There’s nothing easy or natural about Google’s new system.Another undesired change in Google’s latest multitasking view is that you basically only see your current app in it, with only vertical slivers of the two neighboring apps. In previous versions of Android, you’d get a vertical stack of apps, letting you tap to access older apps more quickly. Samsung still does this, and when I pick up the Galaxy Note 9 with Android 8.1, I feel like I’ve had an interface upgrade when switching apps.In summary, Google has reduced the usability and information density of its multitasking without gaining much of anything. Even if you believe, as Google does, that the trio of Android software buttons needed to go away to simplify the experience and allow more space on the screen for other uses, that hasn’t really happened with the iteration introduced in Android 9 Pie. There’s still just as much space occupied on the screen by the back and home button as there used to be with the previous three buttons.I don’t think Google’s new multitasking system is an irredeemable disaster, but neither do I think it’s worthy of being the default and only option for the company’s signature version of Android on the Pixel 3. Just give us the old option back, Google, while you iron out the kinks in your new one.Command Line delivers daily updates from the near-future."}