{"id": "Facebook will allow French regulators to monitor content moderation processes", "paragraph": "Earlier today, French president Emmanuel Macron announced that regulators from France will be allowed to study Facebook and its attempts to moderate hate speech on its platform, which will give French officials significant access into how the company vets offensive content.In 2019, French regulators will be given access to Facebook’s content policies and how the company removes posts that may discriminate against or target minority groups or others based on gender, sexuality, or religion.“It is in that context significant and welcome that the French government and Facebook are going to announce a new initiative,” Facebook’s vice president for global affairs and communications, Nick Clegg, said today. “That model of co-regulation of the public tech sector is absolutely key.”There are already internal rules that forbid hate speech on these platforms, and Facebook has made tens of thousands of new hires in the last year to enforce moderation rules more consistently. Mark Zuckerberg has often touted his platform’s investment in artificial intelligence and machine learning tech that can remove offensive content before it’s published. These would be the kinds of processes that the French regulators would more than likely be given insight into. This isn’t Macron’s first attempt to regulate speech online. Earlier this year, he announced that he would introduce a draft law that would ban fake news online. If passed, the law would allow France’s political parties to bring up complaints online. Judges would then be able to call for the posts to be taken down. The draft law is similar to efforts that have been made in other European countries. Germany introduced its own law at the beginning of this year to tackle disinformation The United States has a more difficult time when it comes to regulation over content moderation than its European counterparts. The First Amendment generally protects hate speech. Lawmakers like Sen. Ted Cruz (R-TX) have been outspoken about platforms taking down what he would call conservative-leaning content, and claiming that the platforms are biased against Republican speech.Command Line delivers daily updates from the near-future."}