{"id": "First Toy Story 4 teaser introduces the internet’s newest hero, Forky", "paragraph": "Toy Story 4 is the continuation of one of Pixar’s most beloved franchises, and the first teaser for the film introduces a new character who’s caught some advance attention. Forky is an adorable, demented little spork outfitted with pipe-cleaner arms and a cute, squiggly face. It’s the type of toy that could only be loved by a child who spent 20 whole minutes making it, and it’s obvious from the teaser that he doesn’t belong with the rest of Andy and Bonnie’s precious toys. Even Forky admits it, frantically crying out that he isn’t a toy — which feels like a callback to the first Toy Story’s central plot, where Buzz Lightyear refused to believe he was a toy rather than a real-life astronaut. Whether Forky actually belongs with the group doesn’t really matter to the people online who have become obsessed with the strange character. Forky envy pic.twitter.com/UzMQGZo2ctForky is a gay icon. Note the   on his foot and how his crippling anxiety (“I don’t belong here!”) is triggered by “Both Sides Now.” pic.twitter.com/kqWutfOJ5UI will say this for new Toy Story character Forky: he’s the perfect embodiment of 2018. pic.twitter.com/dHVJgqLNexThere is still some debate, however, as to whether Forky is actually a fork. Objectively, Forky is a spork. His name should be Sporky, but hopefully his confusing name will be addressed in the film. A synopsis of Toy Story 4 from Disney Pixar reads:Woody has always been confident about his place in the world and that his priority is taking care of his kid, whether that’s Andy or Bonnie. But when Bonnie adds a reluctant new toy called “Forky” to her room, a road trip adventure alongside old and new friends will show Woody how big the world can be for a toy.Toy Story 4 will be released in Summer 2019.Command Line delivers daily updates from the near-future."}