{"id": "Google is using software to make the Pixel 3’s screen corners even rounder", "paragraph": "Google is extending its design atheistic that favors subtle, rounded corners even further by manually adjusting the Pixel 3’s screen corners during start up, as first spotted by an eagle-eyed Reddit user earlier today. Material Theme, an updated version of the company’s software design philosophy, is the driving force behind the Gmail and Chrome redesigns of late, and you’ll notice it most prevalently in the new Chrome tab design that eschews rough and pronounced corners for softer, rounded ones. Google isn’t going so far as to turn the edges of the Pixel 3 display into Chrome tab replicas, but it is using a subtle software trick to “shrink” the radius of each corner of the display to produce more rounded corners. The radii change means that the Pixel 3 screen isn’t using the available screen real estate at its absolute maximum, though it’s a pretty much imperceptible cutoff unless you closely observe the change during the phone’s start up phase.In the GIF below, you can see the corner change shape a few moments after the device is initially turned on: Notably, Google isn’t doing this on the Pixel 3 XL, as best as we can tell from rebooting The Verge’s review model numerous times. That’s interesting mostly because some people have commented on the lack of consistency between the display curve on the edge-to-edge top and that of the bottom bezel, or “chin,” on the larger version. Theoretically, it sounds like Google could do something on the software side to make the corners match, but it doesn’t look like that will happen unless a ton of users really complain about it. Still, some people have noticed:So I don’t have a problem with the Pixel 3 XL’s notch. But once you notice that the top corners and bottom corners of the display don’t have the same radius, you can’t unsee it. pic.twitter.com/BSrQlL1BjxA few users Reddit thread mentioned above note that the same screen corner alteration occurs on the Pixel 2 XL, but that would make sense considering both the Pixel 2 XL and standard Pixel 3 have similar-shaped displays and lack the edge-to-edge look of the Pixel 3 XL. Either way, this isn’t something that will affect anyone’s ability to use the standard Pixel 3 or any visual experience on the device. It’s mostly just a small little quirk that shows Google’s aesthetic tastes when it comes to corner design. Command Line delivers daily updates from the near-future."}