{"id": "All of the Stan Lee cameos from Marvel movies, and why we love them", "paragraph": "Stan Lee is the godfather of modern comics, and his death at age 95, although extremely sad, is a chance to celebrate exactly how much he gave to the world of pop culture. Today, the internet has been flooded with eulogies of his work, life, and his immense impact on comics and film. Many fans fondly recalled the cameos that Lee regularly made in Marvel films over the years, including the pre-Disney Marvel movies, the new Sony Spider-Man Universe, and, of course, the Marvel Cinematic Universe.It’s an Easter egg that never fails to prompt cheers, but it also inspired one of the most powerful moments I’ve ever experienced in a movie theater.It’s rare to witness the personal effect that an icon like Lee has on people. It’s easy to gauge someone’s celebrity in the comics or entertainment world based on the enormous gatherings and lines they inspire at San Diego Comic-Con. But bearing witness to that profound, often intimate impact that a creator like Lee has on people’s lives isn’t as common. I was lucky enough to witness one such moment first-hand earlier this year. It happened during AMC’s 31-hour Marvel movie marathon, which led up to the debut of Avengers: Infinity War. Along with my Verge colleague, Megan Farokhmanesh, I decided to sit through the entire marathon in the name of content. I’d attended movie marathons before and expected more of the same: trouble keeping my eyes open at some point, friendly conversations with other die-hard fans, drinking a ludicrous amount of coffee. Those things certainly happened, but the highlight of the 31-hour endurance test came from the crowd’s seemingly uncontrollable reaction to Lee’s cameos in every film. Nothing — not Iron Man, Captain America, Spider-Man, Doctor Strange, or any other hero’s debut — could match the voracious appreciation and love the audience had for Lee. No matter how exhausted people became, everyone mustered up the energy to give Lee his due whenever he appeared on-screen. Then, right before Infinity War kicked off, something wonderfully unexpected happened. One fan, outfitted in a superhero T-shirt and wearing Thanos’ Infinity Gauntlet, stood up before an excited crowd and asked for one thing: silence during Lee’s cameo. It wasn’t that he was tired of everyone’s cheers, hollering, and hooting, but he wanted to spend a moment to really listen to what Lee had to say.The request had a sad undertone: at the time, Lee was reportedly sick and in and out of hospitals, and we didn’t know how many more Stan Lee cameos we were going to get. The fan just wanted a chance to really experience another Lee cameo in silence and pay homage to him with other fans. The audience honored his request. When Lee appeared on screen during Infinity War as a bus driver, no one said anything, everyone was quiet. It was only after Peter Parker escaped the bus that people cheered. There’s almost no way to describe the heady sensation of that moment as I looked around and realized just how much of an impact Lee’s work and his creations had — not only on the few hundred people in an AMC theater in midtown Manhattan, but for millions of people around the world. That’s the clearest memory I have now of Stan Lee and his legacy, but it’s one that left me moved and grateful for everything he created and inspired — including the legion of incredible fans he left behind.Command Line delivers daily updates from the near-future."}