{"id": "$100 off an Xbox One console with Red Dead Redemption 2 deal expires today, plus other tech deals", "paragraph": "\n    Welcome to Good Deals, a Verge-approved roundup of the best tech deals, in partnership with Vox Media's commerce team.\n  Black Friday isn’t quite here yet, but we wouldn’t blame you for assuming it was late November already given the amount of deals that have started to pop up. Target has unleashed its Black Friday ad, and we expect others to follow suit shortly. Before things get too hectic with shopping for the holidays, there are a some really good deals to check out — a few of which will expire pretty soon.Expiring later today, November 3rd, is the big promo blitz for Red Dead Redemption 2 that takes $100 off an Xbox One console when you buy the new open-world game. Developer Rockstar’s latest title comes free in this promo, plus you’ll get a new console for the cheapest prices we’ve seen yet. Find a few of the best bundles below, and check out more retailer offerings over at our roundup.RAVPower’s 26,800mAh power bank with USB-C power delivery throughput will let you game on the Nintendo Switch, work on the new iPad Pro, or the redesigned MacBook Air without losing charge. It’s a huge battery that’s surprisingly portable, and for a limited time it’s cheaper than ever for Verge readers. Usually priced at $75.99, it costs $49.39 with offer code RP35TVG.If you’re on T-Mobile, or planning to be, you can trade in your smartphone to buy the new OnePlus 6T for as little as $300. That’s pretty cheap for a phone designed this nicely, and with specs that more or less match far more expensive Android smartphones.Another deal that expires later today, November 3rd, is Amazon’s decent savings on its Fire tablets. All sizes are available with as much as $30 knocked off of the price. If you’re on the hunt for a cheap Android tablet, the most affordable are even cheaper — but not for much longer.Amazon Fire 7 tabletFire HD 8 tablet is $20 offFire HD 10 tablet is $30 offIn a surprise move earlier this week, Walmart announced Overclocked, its own lineup of PC gaming hardware. You can find both pre-build gaming desktops, and gaming laptops at Walmart now, though one sticks out for the time being. For $1,399, its 15-inch laptop packs in an Intel i7, a GeForce GTX 1060, 16GB of RAM, and more impressive, a 144Hz display. It’s tough to find a laptop with a display that’s this fast to refresh for under $1,500.Lastly in PC gaming deals, B&H Photo has taken $150 off of the Nvidia GeForce GTX 1070 Ti by EVGA. Normally costing $499, this graphics card at $350 is the best price we’ve seen — plus, it comes with a free copy of Monster Hunter: World.Command Line delivers daily updates from the near-future."}