{"id": "How the hell do you say Eevee’s name?", "paragraph": "Of all the original 151 Pokémon, Eevee’s name might just be the easiest to pronounce. E-vee. Eee-vee. It’s exactly what it looks like. Or so I thought, until I started playing Pokémon: Let’s Go, Eevee!, where I listened my little fuzzy friend pronounce its own name as eh-vie for 30-something hours. Have I been saying its name wrong? Is Eevee saying its name wrong? Do pokémon have accents?Pokémon: Let’s Go is modeled after Pokémon Yellow; the game is set in the series’s original region, Kanto, with the first 151 pokémon. Your starter, either Pikachu or Eevee, is chosen for you, depending on which version of the game you bought. Your furry little friend rides around at all times with you, and you can spend extra time rubbing its cute little head. Because I wound up with Let’s Go, Eevee, I spent most of my time focusing on my brown little dog friend, and, in turn, obsessing over its name. In the cartoons, trainers pronounce Eevee in what I’m calling the standard way:And here it is again from the older series:There’s a discrepancy in how Eevee pronounces its own name. In the first video, you can hear it sort of approaching the “eh-vie” version, while in the latter video, it sort of just squeaks. Let’s Go doesn’t allow every pokémon to happily say its own name. In fact, most make the garbled noises fans will be familiar with from the older games. And pokémon sometimes stress different parts of their name differently, like Pikachu sometimes hitting a hard “ka” when it speaks. In Let’s Go, however, Eevee consistently defaults to this “eh-vie” version, whether you’re patting its head or tossing it into battle. Does this matter? It is a fictional character in a made-up world, after all. Is this going to bother me until I get a definitive answer? Yes. Yes, it is. Command Line delivers daily updates from the near-future."}