{"id": "Facebook introduces ‘Hunt for False News’ series in attempt to be transparent about misinformation", "paragraph": "Misinformation masquerading as news that spreads via Facebook isn’t a recently developed problem for the company, but a new series is trying to open up about what the team at Facebook is doing. Antonia Woodford, product manager at Facebook, published the first “Hunt for False News” blog post today, examining three false stories that circulated on the site before they were debunked. Two of the stories were caught by Facebook and third-party fact-checkers, but the last story was completely missed. The point of the series is to be more transparent with users about how stories circulate on Facebook, especially in the wake of fake news around election periods being a continuous talking point. Each story Woodford addresses in the blog post is slightly different, and she acknowledges why bad actors would use certain methods of sharing posts to spread misinformation. The first story, for example, was a video of a man wearing a headscarf who appeared to spit on a woman. Although the video was real, an AFP report confirmed it didn’t match the misleading attached caption — “Man from Saudi spits in the face of the poor receptionist at a Hospital in London then attacks other staff.” This didn’t happen. These types of false captions are also used to spread hateful messages, according to Woodford. “These posts are often used to fuel xenophobic sentiments and are often targeted at migrants and refugees, as the International Fact-Checking Network — the association that certifies the third-party fact-checkers we partner with — has explained,” Woodford’s post reads. Just because a story is proved to be false doesn’t mean Facebook’s team stops it from being shared completely, though. Woodford wrote that after the AFP report proved the circulating video was real, but the caption was intentionally misleading and false, it led Facebook’s team to “reduce its distribution in News Feed.” The second story focused on a similar form of misinformation. A photo was spread of a man alleged by the poster to be the main suspect in an attack on Brazilian politician Jair Bolsonaro. The story surrounding the photo turned out to be false thanks to fact-checker Aos Fatos, and Facebook took action to demote the image in News Feed. In neither circumstance did Woodford address whether Facebook removed the entire post. The last story is far less harmful, but still demonstrates how misinformation can spread on Facebook. A viral story about NASA paying people $100,000 to spend sixty days in bed quickly circulated in 2017. Facebook didn’t catch it. It wasn’t until July 2018 that Politifact investigated the story and discovered the main claim was false. Woodford addressed that Facebook is still learning how to combat fake news, combining third-party fact-checkers and machine learning algorithms to spot stories before they go viral or can inflict major harm. “In this particular case, we were able to identify this older article that had been circulating on Facebook for months, using an improved similarity detection process we’ve implemented,” Woodford wrote. “It took us too long to enforce against this piece, and we continue to develop new technology to catch these kinds of stories in the future, before they go viral.” The 2018 midterms are just around the corner, and Facebook’s ability to stop fake news and misinformation from spreading will become more crucial than ever. Command Line delivers daily updates from the near-future."}