{"id": "Disney’s Star Wars park will come with original music from John Williams", "paragraph": "When Disney’s Star Wars land Galaxy’s Edge opens next year, it’ll come with a familiar soundtrack — Entertainment Weekly reports that John Williams will provide the score, and has a preview of what to expect, along with looks at two of the park’s big experiences. The first of EW’s videos shows off a new behind-the-scenes look at the park’s construction, revealing an extensive array of buildings and landscapes, set to a music that is the “overarching theme” for Galaxy’s Edge. EW also previews a pair of videos that highlight the main rides for the parks — Smuggler’s Run, set aboard the Millennium Falcon, and Rise of the Resistance, set onboard a First Order ship. The construction video shows off a sprawling world called Batuu — which we’ve seen a bit of already in Timothy Zahn’s recent novel Thrawn: Alliances — and in particular, a village called Black Spire, described as a “remote trading outpost” in the midst of a forest of petrified trees. The score is epic and sweeping, and it certainly feels like it belongs to the Star Wars universe. Hopefully, Disney will release a companion soundtrack for those of us unable to visit in person. The two additional videos show off detailed and immersive experiences. For “Smugglers Run”, visitors will board the Millennium Falcon, and will pilot the ship away from Batuu, taking on one of three roles to ensure “the mission is a success.” The video for “Rise of the Resistance” shows off the finished interior of a First Order spaceship, complete with Stormtroopers and droids as a Resistance fleet drops out of hyperspace just outside. EW says that the experience will show off “what it’s like to be caught in the crossfire of a deep-space battle between the First Order and the X-Wing dogfighters” and that visitors will be able to fight against Kylo Ren. The park is expected to open in the summer of 2019 at Disneyland in Anaheim, California, and in the fall of 2019 at Disney’s Hollywood Studios at Disney World in Orlando, Florida. Disney has said that the park will be a completely immersive experience, with guests interacting with in-universe characters, and staying in a hotel decked out like a starship.Command Line delivers daily updates from the near-future."}