{"id": "Facebook’s growth continues to slow down", "paragraph": "The era of Facebook’s nonstop growth has long since come to an end. Although the company is far from the point at which it might start to shrink, its growth in the US and Canada, as well as Europe, has stopped entirely and appears to occasionally decline. In its 2018 third quarter earnings report out today, the social network confirmed that the number of daily active users in US and Canada has remained flat at 185 million, while the number of European users has slipped from 279 million to 278 million. The latter may be a direct result of recent European privacy regulations, namely GDPR, which initially caused Facebook to lose 1 million monthly active users after it went into effect in May. Overall, the company continues to grow thanks to international expansion, adding 9 percent year over year to its daily active user base for a total of 1.47 billion people. The total number of monthly active users grew 10 percent from this time a year ago, to 2.27 billion people. But despite that, and the fact that the company continues to grow its digital advertising business at an astonishing rate, the rate at which Facebook is growing continues to decline quarter to quarter and year over year. And it’s no longer growing in the markets in which it makes the most revenue per user (North America and Europe). So the fear of more user falloff and a lack of new user retention — and the inevitable ad revenue decline that would instigate — has some critics and analysts worried about its future. Facebook says it grew ad revenues 33 percent year over to year, to $13.73 billion, coming in just under Wall Street analysts’ estimates. Profit was $1.76 a share, well over analyst expectations. Both monthly and daily active user growth figures came in under Wall Street estimates. Still, the company has done a good enough job warning its investors and the press of this eventual turn of events, leading to tempered Wall Street expectations this quarter after it suffered the biggest ever decline in the history of the American stock market last quarter. So Facebook’s share price has understandably remained steady in after-hours trading as a result. Users down in Europe, flat in U.S./Canada, the company's most lucrative advertising markets.Wall St. so far isn't too alarmed. They knew this was coming. pic.twitter.com/rRJvnhBtuGBut while Facebook’s short-term financial performance continues to keep it in the upper echelon of Silicon Valley, the company’s long-term future continues to look less rosy — unless it makes the significant transition that CEO Mark Zuckerberg has been forecasting. In particular, Zuckerberg sees Facebook’s future as more Stories-centric, meaning ephemeral and private messaging on both Facebook and in its ecosystem of messaging apps. In turn, its signature News Feed product will soon take the back seat to video via Facebook Watch and more community-driven products like Groups, Events, and Pages. “Public sharing will always be very important but people want to share privately too,” Zuckerberg said on an earnings call this afternoon. “People feel more comfortable being themselves when they know their content is only seen by a small group and when they know it won’t be around forever.” But to make that transition to a world where Stories, video, and communities thrive on Facebook, the company has to prevent users from leaving. It does that by beefing up its security, quelling concerns over user privacy, and clearing its platform of fake news, junk, and other unwanted forms of sharing. Over the past two years or so, Facebook has sustained a number of high-profile data privacy and security scandals, most prominently in March with the Cambridge Analytica debacle and most recently involving a massive security flaw that allowed a hacker to steal the login information of tens of millions of users. And since the 2016 US election, Facebook has become a breeding ground for conspiracy theories, fake news, and propaganda, as well as a vital espionage and misinformation outlet for foreign governments, some of which, like Russia, have run widespread influence campaigns to create chaos among voting-age Americans. The most recent example of such is a campaign conducted by an Iran-based group seeking to sow division in the US ahead of next week’s midterm elections. While these controversies haven’t really affected Facebook’s bottom line, at least not yet, public perception of the company appears to be at an all-time low. Facebook will eventually feel the effects of users leaving the platform for greener pastures, unless it figures out how to better moderate its platform. (The company is spending heavily in that area, adding tens of thousands of new contract workers and ballooning its headcount by 45 percent, to nearly 34,000 employees, year over year.)While Facebook could very well pull off a turnaround for its core social networking platform, it makes sense that it’s also investing heavily in its ecosystem of apps and services, like Instagram and WhatsApp. Those could help sustain the business if the main Facebook app continues to decline. Facebook pointed out in its earnings release that “more than 2.6 billion people now use Facebook, WhatsApp, Instagram, or Messenger (our ‘Family’ of services) each month, and more than 2 billion people use at least one of our Family of services every day on average.” It’s clear the core Facebook app will not remain on top forever, regardless of what the company does with video or Stories, and so it is shifting resources toward ensuring its other platforms can fill the gap. Instagram, although it just lost both of its co-founders, has a lot of room to grow its ad business, and Messenger and WhatsApp have just started to properly monetize channels for businesses to reach customers. Facebook’s role as the do-it-all social network may be winding down, but its future as a web of successful photo-sharing and messaging apps is just getting started. Update 10/30, 6:15PM ET: Added details from Facebook’s earnings call. Command Line delivers daily updates from the near-future."}