{"id": "How to view your notification history on Android", "paragraph": "\n    Tips, tricks, and hacks for the tech in your life.\n  If you’ve used Android for quite some time, it’s likely you’ve mistakenly swiped away a notification or two for one reason or another. Maybe you’re swiping in a hurry like my colleague Dieter Bohn, or you accidentally cleared everything in the notification drawer without meaning to, or maybe you just wonder where all your notifications go, and if there’s a historical list of them, after you’ve dismissed them. But don’t worry, as you can find everything from missed messages, emails, app updates, and even system messages in the stock Notification Log option. You can also use Unnotification on any Android 8.0+ phone to bring back your last dismissed notification. Both methods are lifesavers if you’ve missed an urgent message from work or your family and don’t know which app you need to open first to find the missed alert. A much better approach is Unnotification https://t.co/vmywWdSuTV.The notification log is super user unfriendly and not the same as bringing back the swiped away notification at all.We seriously need this as a standard Android feature, an undo button.Just remember that every Android phone may not have the stock Notification Log. I’ve tested this shortcut on the Google Pixel 2 XL, Pixel 3, and Razer Phone 2 — all phones with stock or near-stock versions of Android. The Samsung Galaxy S9 and LG G7 didn’t have the log listed anywhere within Android’s system settings. But there is a workaround for this, as pointed out on Twitter by Artem Russakovskii from Android Police.For phones that don’t have the default log (or if you want a more user-friendly experience), you can also download Unnotification. The app brings back your last dismissed notification, as well as your notification history. You can find the app on the Play Store. How to look at your notification history on stock AndroidCommand Line delivers daily updates from the near-future."}