{"id": "A new Oculus feature lets you record an abusive VR user’s behavior and report them", "paragraph": "Oculus is rolling out new features, including a system-wide option for reporting abuse. The update is available on the Oculus Go and Samsung Gear VR mobile headsets, and it will arrive on the PC-based Oculus Rift next month. In addition to the new reporting tools, Oculus Go is getting a beta feature that lets you cast your screen to a phone or tablet using the company’s mobile app, and Oculus has begun streaming live NBA games in its Venues social app.The new reporting procedure is detailed in Oculus’ help center. Rather than filling out a web form when someone violates the platform’s code of conduct, Oculus Go and Gear VR users now have a toolbar menu option that they can select from within any app. They can either fill out a text-only description of the incident or select the “Video Report” option, which will automatically return them to the app and start recording for up to two and a half minutes. (The web form asks for video evidence if it’s available, but it doesn’t include a recording feature.) Oculus moderators will then review the report.Oculus’ code of conduct bans “sexually explicit, abusive, or obscene content,” as well as promoting real-world violence or illegal activity, threatening other people, and using “hateful or racially offensive” language. Oculus games and apps face abuse issues similar to their non-VR counterparts. But VR also makes it easier to physically invade another user’s personal space or to simulate violent or sexually abusive actions like groping a fellow player with virtual hands — although some individual developers have created interface options to make this harder.Oculus, and its parent company Facebook, are heavily promoting VR as a social space. Oculus has revamped its once-static Home experience to let you visit friends, for instance, and Facebook CEO Mark Zuckerberg has declared that he wants to entice a billion people into VR. So while every platform has a stake in tamping down on harassment, it’s a particularly big deal for Oculus — especially when it’s still trying to win over skeptical non-users.Command Line delivers daily updates from the near-future."}