{"id": "Amazon is reportedly in ‘advanced discussions’ to locate its HQ2 in Northern Virginia ", "paragraph": "Amazon is apparently narrowing in on its location for its second headquarters: Crystal City, Virginia, on the outskirts of Washington DC in Northern Virginia. The Washington Post says that the company has “held advanced discussions” that are “more detailed” than similar talks happening in other candidate locations in the immediate region and around the country. The Post says that the talks have included discussions about which buildings the company can occupy, and how quickly it can more employees there. It cites two people “close to the process” that indicate that Amazon could likely move “several hundred employees” into a pair of office buildings within nine months if the city is ultimately selected.  Sources also tell the Post that the announcement could come this month, following the midterm elections next week. The paper does caution that the company could be conducting “similar discussions” with other cities. But talks are apparently far enough along that JBG Smith, the city’s top real estate developer, has pulled some of its property off the market.  Amazon launched its bid for a second North American headquarters last year, with plans to invest around $5 billion and 50,000 jobs. In January, it announced that it had narrowed its pool of finalists down to 20 locations: Atlanta, Georgia; Austin, Texas; Boston, Massachusetts; Chicago, Illinois; Columbus, Ohio; Dallas, Texas; Denver, Colorado; Indianapolis, Indiana; Los Angeles, California; Miami, Florida; Montgomery County, Maryland; Nashville, Tennessee; Newark, New Jersey; New York City, New York; Northern Virginia, Virginia; Philadelphia, Pennsylvania; Pittsburgh, Pennsylvania; Raleigh, North Carolina; Toronto, Ontario, and Washington, DC.Amazon is reportedly close to announcing its final decision, and while Washington DC has been rumored to be a frontrunner, Northern Virginia’s Crystal City located just minutes away. Command Line delivers daily updates from the near-future."}