{"id": "Apple’s new MacBook Air faces strong Windows and iPad competition", "paragraph": "Steve Jobs changed the world of laptops 10 years ago when he introduced the MacBook Air by removing it from a tiny paper office envelope. It was a moment that shocked the audience at Apple’s Macworld 2008 keynote, and sent shockwaves through the entire PC market. Apple created a wedge shaped laptop that at its thickest part was still thinner than the thinnest part of the Sony TZ Series — one of the thinnest laptops back in 2008. No other PC maker had anything that could compete, and it took years for the PC market to find an answer. \n    Related\n  Apple’s MacBook Air from 10 years ago signaled a new era for laptops, but the company’s latest refresh, unveiled earlier this week, shows how the competition has caught up. While the original MacBook Air dazzled the crowd 10 years ago, the model unveiled earlier this week is more a refresh than a revolution. A quiet revolution has been occurring in the Windows laptop space over the past decade, though.A big part of the appeal of the original MacBook Air was its reliable hardware. The keyboard had the right amount of travel, the glass trackpad felt buttery smooth, and you could open the lid and know it would reliably resume. You could even close the lid on a MacBook Air and the battery wouldn’t drain even if you left it for weeks. The sleek wedge design and lightweight frame also made it very appealing if you wanted to travel light, and the battery life was solid. This combination of hardware was very appealing to consumers.Windows laptops at the time were a mess. Most were built out of plastic, with erratic trackpads that were so unreliable that PC users just got used to the poor experience. Booting up a Windows laptop was slow, and resuming was hit and miss. Battery life was also poor on many Windows laptops compared to the MacBook Air, and while some like Dell’s Adamo managed to beat the thinness of the MacBook Air, none managed to beat the whole package for more than five years.I spent a lot of time searching for the perfect Windows laptop when Windows 8 was released in October 2012, and like many others I opted for a MacBook Air. Running Windows on a MacBook wasn’t ideal, but it was simply the best option at the time. It wasn’t until 2015 that the PC industry finally unveiled an answer to the MacBook Air. Dell’s XPS 13 appeared at CES 2015 with an impressive edge-to-edge display, a glass trackpad, and a machined aluminum and carbon fiber design. I switched to it immediately, and it was this period of time when PC makers finally figured out how to compete with the MacBook Air.It was the same period in time that Microsoft had just released its Surface Pro 3 and reignited the Mac vs. PC conflict for its marketing campaign. While the Surface Pro 3 debuted with Windows 8, Microsoft had spent years developing Windows 10 to step away from its drastic tablet-focused changes in Windows 8. Microsoft also worked closely with Intel to improve Windows trackpads and the gestures in Windows 10 made PC laptops feel identical to the MacBook Air’s trackpad. Apple’s MacBook Air felt dated at the launch of Windows 10 in 2015, and the competition has grown even stronger recently.The best Windows laptops you can buy right now include devices from Huawei, HP, Microsoft, and Lenovo. While there was some experimentation during the Windows 8 days, the industry appears to have settled on a common 2-in-1 form factor that provides some tablet functionality alongside a more traditional laptop format. HP’s Spectre X360 does a good job at this combination, while devices like Microsoft’s Surface Laptop 2 and Huawei’s MateBook X Pro offer the traditional laptop in a modern touchscreen package.Surprisingly, Apple’s new MacBook Air doesn’t do much to overtake these latest crop of Windows laptops. A new high resolution display is now included on the MacBook Air, which was a much-needed addition after the existing Air has been available for $999 with a low resolution non-IPS display for 10 years. While Microsoft refreshed its Surface Laptop 2 with Intel’s latest quad-core U series processors, Apple has opted for a less powerful dual-core Y series processor inside the new MacBook Air. Apple also decided to ship the latest generation of its controversial butterfly keyboard on the new MacBook Air. It’s still too early to know whether the improvements Apple has made to the butterfly switches are enough to combat dust issues, but it’s still a keyboard that people either love or hate.Apple did add Touch ID to its latest MacBook Air, although a bigger improvement would be Face ID. Windows 10 introduced support for Windows Hello, to allow you to log into a PC with just your face. Most modern Windows laptops now include Windows Hello, and Face ID would be a welcome improvement to any MacBook.Most of Apple’s more notable hardware improvements appear to have been reserved for the iPad Pro. Apple added Face ID to its latest iPad Pro, and a powerful A12X processor. It’s built on 7nm technology, and has an 8-core CPU and 7-core GPU. Apple claims the new iPad Pros are faster than 92 percent of all portable PCs sold in the last 12 months, and the new hardware “delivers Xbox One S-class graphics performance.” These performance advances on the iPad Pro combined with reduced bezels and Face ID are far more impressive than a refreshed MacBook Air. Apple’s new MacBook Air won’t drive the laptop market forward significantly, but the iPad Pro is stealthily making advancements. It’s been clear for some time that Apple is prioritizing the iPad Pro over the MacBook as its consumer “computer” of choice, but it was made even clear during Apple’s event earlier this week. Apple revealed it has sold more iPads in the past year than the entire lineup of notebooks from any single manufacturer. “This makes iPad not only the most popular tablet, but the most popular computer in the world,” said Apple CEO Tim Cook. Apple also revealed there are 100 million active Mac devices worldwide, compared to the 1.5 billion active Windows PCs figure that Microsoft briefly revealed last weekend before replacing it with the company’s 700 million Windows 10 figure. It’s no surprise that Apple will focus on iPad over Mac, as Mac is just 6 percent of the overall desktop PC market. While Apple didn’t mention the active number of iPads, Cook did reveal more than 400 million iPads have been sold to date. Even if only half of those are still active today, that’s still double the amount of active Mac devices worldwide.Throughout 2017 Mac sales continued to buck the PC industry trend and grow year-over-year, even if most quarters experienced tiny growth. During 2018 Mac sales have consistently dropped every quarter, while iPad sales have been mostly flat. Apple still makes more revenue from Mac sales than iPad sales, but if it can convince more consumers to opt for an iPad Pro than a MacBook Air or another Windows laptop then that will change. This year’s iPad Pro is priced at $799 for the 11-inch model, a $150 price increase from the previous 10.5-inch version. The larger 12.9-inch iPad Pro now starts at $999 instead of the previous $799 starting price. When you factor in the price of an iPad keyboard (which also increased) then a 12.9-inch iPad Pro is now the same price as a base model MacBook Air ($1,199). That sets up an interesting choice of picking between macOS, iOS, or a Windows-based machine. Apple is now going to make it difficult to see how people are making that choice. Apple has traditionally been surprisingly transparent with its Mac and iPad sales numbers, reporting them every quarter unlike the rest of the industry. That’s all about to change, though, as Apple’s price hike strategy shows early signs of paying off. Apple will no longer report sales numbers for iPhone, iPad, and Mac, so it will make it more difficult to see just how well the MacBook Air and iPad Pro compete against traditional PC laptops.The debate over tablet vs. laptop will rage on for many years, but it’s clear that Apple’s new MacBook Air now faces stronger competition than it has ever faced before. The PC industry has changed for the better, thanks to both the MacBook Air and the iPad, but it’s the iPad that will now shape its future and not the new MacBook Air.Command Line delivers daily updates from the near-future."}