{"id": "Tesla stopped promoting the ‘Full Self-Driving’ option for its cars", "paragraph": "Tesla has pulled a long-standing promise of a “Full Self-Driving” option for its cars from the order page on the company’s website. Elon Musk, Tesla’s CEO, said on Twitter that the option will be temporarily available “off menu,” much like Animal Style fries at an In-N-Out burger joint. It will quickly leave the secret menu, though, and won’t come back until the company is ready to roll it out. The Full Self-Driving option was “causing too much confusion” for customers to justify keeping it front and center, he said. The company declined to comment. Three years ago, Musk claimed that Tesla’s vehicles would be ready and able to completely drive themselves without any human interaction by 2017. Two years ago, Musk announced every car made going forward would have the hardware necessary to facilitate this goal. Tesla has spent the years since advertising this impending breakthrough on its website as an easy add-on to the purchase of a new car, something that only required a few thousand dollars and a little bit of patience. Those promises have all since weakened, though. Musk recently admitted that the company will need to upgrade cars already on the road with new hardware — specifically, a new AI chip — in order to endow them with full self-driving capabilities. (Even then, some in the industry believe Tesla’s cars lack a crucial piece of the autonomous puzzle.) Tesla missed Musk’s 2017 estimate for rollout of Full Self-Driving by at least a year. And now, Tesla has dimmed the visibility of Full Self-Driving in general, raising questions about the company’s approach to one of its grandest goals. “Tesla has had a ton of problems with their autonomous driving approach,” Rob Enderle, a technology analyst for the Enderle Group, says in an email to The Verge. He points to how Tesla has used the term “Autopilot” for years, even though its cars are only currently able to handle driving themselves in very specific situations, and always with driver supervision.Why the confusion? Exhibit A: Tesla's website. Sterling Anderson, who led Tesla's Autopilot before leaving to co-found Aurora, told me the “entire industry” needs “to be more truthful about our capabilities\" https://t.co/V6w1q6SfhL pic.twitter.com/UssFEy50FRTesla has faced regulatory pushback over that very issue. In 2016, the German government asked the company to stop using the term Autopilot, arguing that it was “misleading” consumers. And just this week, the European New Car Assessment Program — a safety coalition led by a number of governments and transit agencies from across the continent — released a report that criticized Tesla’s promotion of Autopilot. Tesla, the Euro-NCAP writes, has released videos that are “confusing consumers about the actual capabilities of the Autopilot system.”Musk’s claim of consumer confusion was backed up by a new poll published this past week. Commissioned by Euro-NCAP and Thatcham, a research company started by the automotive insurance industry, the poll queried 1,567 car owners from China, France, Germany, Italy, Spain, the UK, and the US. Strikingly, 71 percent of those polled believed they can buy a self-driving car right now — which is not true. The poll also found that one in 10 drivers “would be tempted to have a nap” while using semi-autonomous systems like Autopilot. That’s dangerous: Tesla requires users to keep their hands on the wheel in case the car needs to hand control back to the driver. Driver assistance system currently exist in a sort of uncanny valley. In the right settings, systems like Autopilot make it seem like the car can truly drive itself, which can in turn lead to a false sense of security, or a dulling of the driver’s awareness. This isn’t just a polling concern, either; Tesla itself has said that a driver who died while using Autopilot earlier this year was warned multiple times for not having his hands on the wheel in the minutes before impact, a sign that the driver might have been too reliant on the car’s abilities. Enderle believes Tesla’s new, more conservative approach to promoting the Full Self-Driving option is an effort to “cover up” this growing problem. “This should be binary, release a system that works or don’t, don’t release a system that doesn’t work and make it hard to order,” he says. “That just seems incredibly stupid.” There are other ways to look at the decision. Moving the option out of the spotlight “seems to be Tesla’s way of saying to its hardcore devotees that if you insist on giving us extra money, we will be happy to take it,” says Sam Abuelsamid, senior analyst at Navigant research. Tasha Keeney, an analyst at ARK-Invest, says she doesn’t believe the removal of Full Self-Driving as an option signals a change in Tesla’s ultimate goal of making its cars fully able to drive themselves. “We heard from Musk on Twitter that Tesla is going to follow through on their plan to swap out the Nvidia board in customer cars, which combined with the chip update we heard on the earnings call, seems to say they’re still executing on their autonomous plan,” Keeney writes in an email. “Unless I hear otherwise, I don’t think this would change our long term thesis” about the success of Tesla’s goals for autonomy, she says. ARK-Invest, one of the most optimistic firms when it comes to Tesla’s future in this space, recently estimated that the automaker’s supposedly forthcoming network of summonable self-driving cars — which Musk estimates could be ready by the end of 2019 — could generate $200 billion in annual services revenue in a world where fully autonomous cars are the norm. Before this week’s alterations to the Full Self-Driving option, Tesla also pushed back the release of a different Autopilot feature. Navigate on Autopilot was billed by Tesla as the “most advanced Autopilot feature ever,” allowing the car to drive from on-ramp to off-ramp, take the correct exit, handle highway interchanges, and even suggest lane changes. It was originally going to be included in version 9.0 of Tesla’s vehicle software, and was supposed to be the first of a series of new features coming to the company’s driver assistance system.But when version 9.0 was released earlier this month, Navigate on Autopilot was absent. Tesla said it still needed a few weeks of validation, and that in the meantime, cars equipped with version 9.0 would collect data to help make the feature more accurate out the gate when it is eventually released. Another conclusion that the Euro-NCAP poll arrived at was that much of this confusion could be mitigated if features like Autopilot, or even Navigate, were subjected to more rigorous standards. According to the poll, 74 percent of people supported standardized naming conventions for adaptive cruise control, lane keep, and other features that combine to make up systems like Autopilot. What’s more, 77 percent said they would watch a training video or take an online course to better understand these features.“The lack of driver training and standardized controls, symbols and names for these features, is further muddying the waters for consumers,” Matthew Avery, Thatcham’s director of research, said in a statement.But broader point remains. Promises like Full Self-Driving can lead to a false sense of security and consumer confusion. And those are the last things you want when people’s lives are at stake. “Cars, even those with advanced driver assistance systems, need a vigilant, attentive driver behind the wheel at all times,” Avery said.Command Line delivers daily updates from the near-future."}