{"id": "Apple adds an emoji for the drunk weirdo at the bar", "paragraph": "An iOS update usually means more emoji, and iOS 12.1 is no different. As noted by Emojipedia, if you account for all the skin and gender variations, there are 158 new tiny icons coming to an iPhone near you, including lettuce, a badger, and a disembodied leg. That’s cool — except for emoji No. 5 on that list, “Face With Uneven Eyes and Wavy Mouth aka ‘Woozy Face.’”Woozy Face is just a polite way of saying “my dude has some wicked drunk face,” which, really, is the only way to interpret this ding-dong: At 2AM, this is the emoji that will slide up next to you, try to make conversation, and promptly spill a beer in your hair. This emoji will puke in your cab and make you cover the cleaning fee because they “just don’t believe in cash, man.” This emoji thinks fireballs are an acceptable birthday shot. I once watched this emoji get dragged out neck-first by an angry bouncer while the entire bar cheered.But please, don’t take my word for it. Let’s hear what my smarter co-workers have to say.Julia: This emoji is a digital replica of the most obnoxious inebriated man I’ve ever encountered at a bar. He staggered over to where my friends and I were sitting, watching a Raptors game during the NBA Finals, and then demanded we talk to him about the team in order to prove we weren’t just there scavenging for dudes. It’s the type of face that leads you to believe they may be charming, even through the slurred speech and stench of vomit coming from their mouths. But, ultimately, it only leads to some kind of unnecessary comment. The only good thing about this emoji is that it can be used as a signal to your friends who are hanging out somewhere else in a bar, alerting them to the jerk who just doesn’t know when to quit. Makena: Woozy face is equal parts intoxicated and lovesick. He’s the guy at the party who knows he’s had one too many and is incredibly self-aware of it. He spots you from across the room at a bummy Bushwick house show and walks over. “H-hey,” he says from the corner of his mouth, refusing to make eye contact with you. He continues to speak, but you can’t understand what he’s saying. The music is too loud. Your friends are trying to get out of here. He’s slurring his words. He seems sweet, but you also know nothing substantial is going to come out of his mouth — at least not tonight. You look at him, point at your friends, shrug your shoulders, and head for the door.Adi: Honestly, I’m not getting the drunk thing. This is like an emoji Junji Ito character in the first stages of twisting their features into a grotesque yellow flesh-spiral as a metaphor for collective intergenerational guilt or repressed desire or... okay, maybe I should just take another look after Halloween.Natt: Y’all got this all wrong. This is just the face we all make when we watch an Apple keynote, and then see the pricing announcement at the end. A MacBook Air costs how many of my firstborns, Apple!?!?Dami: This is the UwU “h-hewwo?” face. End of story.In short:take it back https://t.co/V0IBeac026Command Line delivers daily updates from the near-future."}