{"id": "Stan Lee dies at 95", "paragraph": "Stan Lee, the former editor-in-chief, publisher, and chairman of Marvel Comics, died this morning in Los Angeles at age 95. Lee was best known for co-creating much of Marvel’s pantheon of beloved superheroes: Spider-Man, The X-Men, The Fantastic Four, the Hulk, Iron Man, Thor, Daredevil, Black Panther, and Doctor Strange, among others. Lee’s comics career began in 1939, when the 17-year-old took an assistant job at Timely Comics, the predecessor to Marvel. Born Stanley Martin Lieber, he adopted Stan Lee as a pen name when he started writing comic book stories, and later made it his legal name. His style of scripting — giving the artist a brief synopsis, then returning to nail down the details after the story was drawn — would later be dubbed “The Marvel Method,” and offered collaborators and co-creators like Jack Kirby and Steve Ditko enormous creative input into the work. Later, there would be sometimes bitter conflicts about precisely who created — or co-created — which characters, though the work-for-hire nature of their contracts meant that none of them retained the rights.\n    Related\n  During the 1960s (and beyond), Lee spoke often about the importance of inclusion and the evils of racism. In 1971, Lee challenged the Comics Code Authority — a sometimes draconian set of industry-imposed rules created to avoid government regulation after a Congressional witch hunt of the comic book medium — with an anti-drug storyline in an issue of The Amazing Spider-Man. His boundary pushing led to a review and revamp of the Code, which ultimately declined into irrelevance. A year later, Lee stepped back from writing comics to become the publisher of Marvel, and quickly became its most recognizable public face, from then until now. As the world of Marvel superheroes expanded into the vast and lucrative Marvel Cinematic Universe, Lee became known for his cameo appearances in the films — perhaps the most popular in-joke in movies already peppered with references for comic book fans.Recent years have been tumultuous for Lee, including a bout with pneumonia, accusations of sexual misconduct, a $1 billion suit against his former company POW! Entertainment, claims that his advisors have been preying on him financially, Siri erroneously informing the world he was dead earlier this year, a bizarre report that his blood had been stolen to sign collectible comics, and the death of his wife, Joan Lee, who passed away last year after a stroke.But Lee’s legacy and impact on the world of both comic books and entertainment remains vast, enduring and undeniable. News of his death prompted eulogies across Twitter, by everyone from Chris Evans to Elon Musk. He changed the way we look at heroes, and modern comics will always bear his indelible mark. His infectious enthusiasm reminded us why we all fell in love with these stories in the first place. Excelsior, Stan.There will never be another Stan Lee. For decades he provided both young and old with adventure, escape, comfort, confidence, inspiration, strength, friendship and joy. He exuded love and kindness and will leave an indelible mark on so, so, so many lives. Excelsior!!He lives forever through his work. What a giant.With great power comes immortality.     pic.twitter.com/t395qw9H0LRest in peace, Stan Lee. The many worlds of imagination & delight you created for humanity will last forever.This is bitter news. We were lucky to have him. Untold millions of lives made better by stories. Endless people who learned responsibility from Spider-man, acceptance from the X-men, self-forgiveness from the Hulk.Stan Lee put better heroes in our vision.Forever the Man.Even the /thanosdidnothingwrong subreddit — which banned half of its community at their own request in July in a nod to Avengers: Infinity War — decided to hold a moment of silence to honor Lee by restricting submissions until the day after his death.In an October interview with The Daily Beast, when asked what was still on his wish list after so many years and so many accomplishments, Lee’s answer was simple: “That I leave everyone happy when I leave.”Command Line delivers daily updates from the near-future."}