{"id": "Unagi is the $1,190 electric scooter you won’t want to share with anyone", "paragraph": "If you’re tired of those janky dockless electric scooters and ready for an upgrade, a new startup based in Oakland, California may have what you’re looking for. Unagi is the Japanese word for freshwater eel, but now it is also a stylish electric scooter for the luxury set. Electric scooters are fast becoming a convenient and fun way to commute for city folks. But not everyone lives in a city with dockless, shareable scooters like Bird and Lime. David Hyman, the former Beats Music CEO and co-founder of music startup MOG, says he was inspired to launch Unagi after finding the scooter-sharing services to be kind of a “drag.” Many of the scooters are broken, and they could be hard to find when you need them the most, Hyman said. “The real breaking point was a year ago, taking one to Whole Foods to buy groceries and coming outside to find someone took my scooter,” he wrote in an email. “I had just bought a $7 pint of Jenny’s ice cream and it was 75 degrees outside. I walked to the closest scooters based on their apps showing them to me on a map, and as i approached (1/4-1/2 mile away), someone jumped on and rode away. I walked home with melted ice cream and decided at that point, I needed to own one.”First introduced in China as Swan, the scooter company rebranded as Unagi for its US release. Hyman traveled to China where he toured several scooter factories and was most impressed by the team at Qingmai Company working on Swan. He convinced three of the company’s industrial designers to form Unagi for the purpose of releasing the scooter in the US. “We spent six months massively improving on the legacy design,” he said. “New motors, new braking mechanism, new lighting, new display, and most importantly, rebuilt from the ground up controller from the drone world that’s bullet-proof.”“The Swan was the 1.0 and the Unagi is the 2.0,” Hyman added, “and going forward it’s all Unagi.” The company launched its own Kickstarter last week, and has already reached his goal in raising over $100,000. Hyman said he hopes to begin shipping scooters in January. The Unagi scooter cuts an attractive profile. The handlebars are magnesium, the stem is Japanese carbon fiber, and the deck is machined aluminum with embedded silicon. The price tag, though, differs wildly from the original price for the Swan scooter in China. Unagi comes in a couple of different models — a 250 watt for $890 and a 450 watt for $1,190. Compare that to popular brands available on Amazon, like Xiaomi Mi for $599, or Segway-Ninebot for $777. According to Electrek, Swan is currently available in China for￥2,499 (~$384). Both of the models have three riding modes: beginner (9.3 mph max speed), intermediate (12.4 mph max speed), and advanced (15.5 mph max speed). A digital display between the handlebars indicates what mode you’re in, how fast you’re going, and how much battery life you have left. I got a chance to test the Unagi a few days last week. I live in New York City, so my experience with electric scooters is pretty minimal; the scooters are still technically illegal under state law, but I’m seeing more people riding them every day. And the big scooter-sharing companies like Bird and Lime are actively lobbying city officials to lift the ban. That said, New York is an extremely inhospitable place for electric scooters. Riding on the ancient, pockmarked streets of lower Manhattan, there were several times I felt I would fall into a pothole and never emerge. The Unagi’s tires and shocks are fairly solid, but I would recommend sticking to more recently paved roads when riding one. With wheels measuring just 7.5-inches in diameter, you still end up feeling every bump and crack in the road.Hyman said his scooters can get the job done. “I’m from NYC,” he wrote. “The roads there are no worse than the roads here in Oakland I think.”Two paddles control the acceleration and brakes. The scooter’s braking distance on a dry road is about 13 feet. When I was testing it, the roads were a little slick after a rain, so the distance may have been slightly further. The brakes are completely electronic, unlike some other scooters that also include manual hand brakes or disc brakes. I found the Unagi’s brake to be a little jerky in advanced mode, even though the company says it aims to bring the scooter to “a safe, steady stop.”Unagi claims its patented stainless steel hinge system is one of a kind. Of course, other electric scooters fold in half, too, but Unagi’s works very well. I brought the folded scooter onto the subway, and was able to get through the turnstiles with no fuss. It wasn’t the lightest scooter I’ve ever handled, but at 24.48 lbs, it wasn’t particularly heavy either. Unagi has a number of other helpful features, like a headlight with adjustable brightness, and a rear tail light. The lithium ion battery is built into the platform, takes about four to five hours to fully charge, and has a range of over 15 miles. Of course, purchasing items through Kickstarter can be risky, so you may want to wait and see what happens with Unagi before making a decision. “We’re trying to do something unique that, in its current state, is not ready for outside investment and may never be,” Hyman said. “We’re trying to bring something beautiful to people from our own passion for it, regardless of whether it checks off the VC’s boxes.”Electric rideables — bikes, scooters, skateboards — are growing increasingly popular, so it makes sense we’d begin to see more premium models like Unagi. But Hyman said it was important to offer his scooters at a price competitive with top-end electric bikes and scooters on the market. “There [have] been plenty of electric bike shares but their popularity has paled in comparison to scooters,” he said. “There’s also something inviting about just jumping on a scooter that feels much less cumbersome. And you don’t mess up your clothes either.”Command Line delivers daily updates from the near-future."}