{"id": "Chilling Adventures of Sabrina finds a smart metaphor in Satanism", "paragraph": "Netflix’s Chilling Adventures of Sabrina justifies its existence in its second episode, which begins with a contentious conversation about religious rituals and cultural norms — a surprisingly sophisticated argument for a TV show about a teenage witch. As heroine Sabrina Spellman (Kiernan Shipka) approaches her 16th birthday, her aunts Hilda and Zelda and their priest, Father Faustus, try to quell some of her concerns about her upcoming baptism, reassuring her that the pledge of eternal service she’s making to the Lord will be merely symbolic, and will ensure she doesn’t go to Hell when she dies.The twist? The “Lord” in question is Satan.Like Riverdale — another wild reimagining of the Archie Comics universe — Sabrina drops the characters and concepts from an old, beloved piece of Americana into a seemingly incompatible genre. Riverdale is a high school soap opera crossed with film noir. Chilling Adventures of Sabrina is adolescent melodrama mixed with occult horror.Both shows are overseen by writer Roberto Aguirre-Sacasa, whose association with Archie dates back to 2003, when the comics’ publisher threatened a lawsuit if Aguirre-Sacasa staged his original play Archie’s Weird Fantasy, in which Archie Andrews comes out as gay. Ten years later, after Aguirre-Sacasa built a thriving career writing for the stage and television, Archie Comics brought him into the fold, and he co-created Afterlife with Archie, an alternate-reality series aimed at mature readers, reimagining the quaint small town of Riverdale as a post-apocalyptic, zombie-infested wasteland.The title was such a hit that Aguirre-Sacasa became the chief creative officer for Archie Comics, helping spearhead a revamp of the whole line that eventually led to the CW series Riverdale, and to his own more realistic Sabrina comic, Chilling Adventures of Sabrina. (The TV version of the latter was originally intended to be a CW Riverdale spinoff, before it shifted over to Netflix.)The character of Sabrina Spellman dates back to the early 1960s, when she regularly appeared in various Archie titles, supplementing the regular cast’s teenage hijinks with her own high school and romantic drama, with a little sprinkle of witchcraft. In the era of the magic-dusted TV sitcoms Bewitched, I Dream of Jeannie, and My Favorite Martian, it didn’t take long for Sabrina to get her own comic book, and her own Saturday-morning cartoon. She had a second boost in popularity in the 1990s, thanks to ABC’s live-action sitcom Sabrina the Teenage Witch.Netflix’s Chilling Adventures of Sabrina doesn’t toss out those earlier iterations. Sabrina is still a teenage orphan who had a human mother and a witch father, and who’s just now aging into her magical legacy. She’s still devoted to her kindly human boyfriend, Harvey Kinkle. Shipka (best known for growing up on Mad Men, playing Don Draper’s daughter) is superb in the role, emphasizing Sabrina’s intelligence and compassion as she stands up to bullies and rallies behind her misfit friends.The bones of the 1960s Sabrina are still present. And thanks in part to a soundtrack heavy on retro pop and rock, the show also has echoes of countless ’80s high school rom-coms, where underdogs overcome the insults and pranks of the popular kids to find companionship and love. But what’s really radical about Chilling Adventures is how hard it leans into the supernatural elements of the classic Sabrina comics — and why.The new TV series focuses a lot on Sabrina’s devoutly witchy aunts, though their personalities have been amplified, and their presence is less benign. Lucy Davis plays Aunt Hilda as a sweet bumbler whose prodigious powers have been underestimated her whole life. Miranda Otto plays Aunt Zelda as a sinister schemer who sometimes gets so angry at her sister that she literally kills her. (That little wrinkle is likely an homage to the characters of Cain and Abel, “hosts” of the DC Comics horror anthology House of Mystery, though they’re better known from their revival in Neil Gaiman’s Sandman. They’re similarly locked into a cycle of sibling murder and rebirth.)Both aunts are active in the Church of Night, and are urging Sabrina to transfer from Baxter High to the Academy of the Unseen Arts, headed up by Father Faustus. The ancient institution is effectively ruled by a trio of powerful mean girls, dubbed “the Weird Sisters.”Younger viewers are likely to connect Chilling Adventures’ fascination with magical minutiae to two other pop-culture franchises: Harry Potter and Buffy the Vampire Slayer. Like Harry, Sabrina endures difficult arcane rites of passage that her parents dealt with before her, without them around to guide her through them. And like Buffy, she’s protecting a town — Greendale, in this case — plagued by the paranormal.The look of this Sabrina is influenced by the horror movies the heroine loves to watch. The director of the first two episodes, Lee Toland Krieger, sets the tone by filling the screen with eerily beautiful images of spooky forests, and maze-like tunnels and flora. Harkening back to supernatural thrillers like Rosemary’s Baby, and to the many, many Hammer Horror witchcraft movies, Chilling Adventures also plays up the eroticism of the demonic, and the idea that choosing a life of evil also means eagerly opting in to carnal hedonism.The big difference between this series and its horror forebears is that Satanism isn’t some alluring “other.” It’s the only religion Sabrina’s ever really known. She’s been drilled on “the 13 Commandments,” and she’s sat through boring church services with hymns and smelly candles, just like so many other kids. She’s heard hundreds of snide comments from priests and parishioners about the nearby Catholic church, with its biased stories and “false God.” (To the Church of Night, the Christian Bible is the original “fake news.”)Aguirre-Sacasa and company clearly enjoy the shock value of hearing pleasant old Aunt Hilda casually saying, “Praise Satan!” The show also plays up the grimness of some of the Church of Night’s rituals, which involve sacrifice and cannibalism. And it’s suggested strongly from the start of the series that no matter what Father Faustus says, if Sabrina pledges her body to the Dark Lord, that isn’t just a metaphor.The point of all this goes beyond merely startling audiences, or even just drawing comparisons between different kinds of religious fanaticism. If anything, in this Sabrina, “religion” stands in for any kind of fervent belief: a political affiliation, a social cause, sports fandom, bigotry, whatever. Charismatic leaders of any movement tend to paint themselves and their “side” as righteous, and to downplay legitimate criticism. So it goes here, where according to the priests, Satanism isn’t about “evil,” it’s about “free will.” That’s not too different from politicians who defend discrimination against LGBTQ customers on the grounds of religious freedom, or who rail against government overreach when it comes to taxes, but not when it comes to cops shooting unarmed, innocent citizens.Thanks to its strong visual style, its appealing performances (from Shipka especially), and a fairly disciplined narrative approach that balances long serialized arcs with more episodic storytelling, Chilling Adventures of Sabrina overcomes some of the common flaws of modern TV dramas. The individual chapters are still too long, and the plotting still relies too much on hints and teases of what’s to come. But the show does provide some simple, satisfying problems and resolutions along the way, as Sabrina and her pals confront everything from obnoxious jocks to the dangers of hazing — not to mention exorcism, resurrection, and other witchy stuff.Yet by the end of season one’s 10 episodes, what mostly stands out about Sabrina is its sly commentary on people’s situational sense of right and wrong. Just by replacing a few familiar religious words with “Satan” and similar twists, Chilling Adventures asks its viewers to consider how much the ideologies they cling to are determined by accidents of birth or circumstance. It’s a clever little rhetorical gambit this show is playing — and wickedly so.Command Line delivers daily updates from the near-future."}