{"id": "The internet is celebrating Danny DeVito this week", "paragraph": "Sometimes, people can have really astounding weeks: they get engaged, promoted, and win their local karaoke competition all within a few days. Other times, they can have really terrible weeks: they go through a rough breakup, get fired, and are forced to listen to seven horrible rendition’s of Journey’s “Don’t Stop Believing” at their local karaoke competition. Danny DeVito had a legendary week — on the internet, at least. DeVito, who has become best known in recent years for his portrayal of Frank Reynolds on It’s Always Sunny in Philadelphia, has long been a staple of internet culture. People adore DeVito and his strange character roles or commercials he stars in, but this week has seen an influx of strange DeVito stories celebrating the actor’s life. DeVito’s banner week began with the ambitious and strange Detective Pikachu trailer. The movie has little to do with DeVito. He isn’t part of the film’s cast or production team, but it’s a role that DeVito and Pokémon fans have been clamoring for ever since the film adaptation of Nintendo’s popular game was first announced. Pikachu is instead voiced by Deadpool’s Ryan Reynolds. For disappointed fans, this, of course, meant editing clips from the film’s trailer to pay homage to DeVito — the one true Detective Pikachu. It didn’t stop there. Even the team at Warner Bros. that’s working on Detective Pikachu understands how important DeVito is to fans. The Twitter account, which launched earlier this week, followed a couple of prolific accounts of people who are involved in the film, Warner Bros.’ main Twitter account, and it even threw DeVito a follow. DeVito hasn’t responded to the outpouring of love and support by Pokémon fans who are left devastated by his lack of presence in the film, but perhaps that’s because he has more pressing online matters to attend to.The best Danny DeVito story of the week has to do with a creepy shrine created by college students at Purchase College in New York. Videos of the shrine, which was hidden behind a paper towel dispenser in a bathroom possibly located in the school’s visual arts building, according to Mashable, appeared on Twitter on Sunday. The video, seen below, showcases the shrine set up in DeVito’s honor. A handwritten note inside the shrine reads, “Leave An Offering for Our Lord and Savior Danny DeVito, Patron Saint of Trash Men.” The shrine went viral, circulating on Twitter, Facebook, and Tumblr.Hole in a school bathroom that leads to a cavernous shrine to Danny devito pic.twitter.com/Xsdg22IxzLUnfortunately, not all attention is good, and some people will never appreciate good art. A few days later, a Facebook post confirmed that the entrance to the sacred shrine was sealed off once the school got wind of what students in the visual arts building were up to. It’s unclear if the gifts left for DeVito were taken out before the shrine was closed, ostensibly forever. “It was good harmless fun for students for a long time,” one student told Mashable. “But sadly, all of the attention made the administration aware of it and they took it away.”There is some good news, though: DeVito saw the news about the shrine and shared a special message with students, thanking them from the bottom of his heart full of garbage and adding one more entry into the Week of DeVito — it’s his birthday tomorrow.Your shrine honors me. My heart is filled with love and garbage.Tomorrow, as you may know, is my name day. Do something that makes you feel good. Above all be kind to each other. Pick up trash, recycle, and be aware of plastics in the ocean. https://t.co/UER6uZY886Happy early birthday to Danny DeVito: the internet’s favorite actor, the patron saint of trash men, and a consummate legend who will continue to inspire hundreds of bathroom shrines for years to come.Command Line delivers daily updates from the near-future."}