{"id": "Netflix has canceled Marvel’s Luke Cage", "paragraph": "Just a week after it announced that Iron Fist wouldn’t return for a third season, Marvel has revealed that another of its Netflix shows won’t continue: Luke Cage. The series aired its second season earlier this summer. Marvel and Netflix confirmed to Deadline that the show “will not return for a third season.” The cancelation comes as a surprise, as it was widely expected to be renewed for an additional season. Unlike Iron Fist, which Marvel indicated might continue on in some form, this reads as a definitive end for the series. It’s a shame, because Luke Cage has consistently been held up as one of the better shows in the franchise, while Iron Fist was widely panned. In the case of Iron Fist, Deadline speculated that the series might migrate over to Disney’s forthcoming streaming service alongside planned shows about Loki and the Scarlet Witch. That goodwill doesn’t appear to be there for Luke Cage. Deadline pointed to Marvel and Netflix’s concrete efforts to develop a third season — they stood up a writer’s room for a third season earlier this year — which were stymied by “rising tensions in the past month,” over “creative differences” between Marvel and Netflix over the scripts that have been developed. That Netflix and Marvel appear to be pulling back from their partnership doesn’t come as too much of a surprise. Disney, after all, is developing its own streaming service to rival Netflix, and is presently building out its own catalog of original content. Disney announced that it would end its distribution deal with Netflix last year, and while Netflix worked to try and retain the rights to the Star Wars and Marvel franchises, it seems that those properties will eventually migrate over to Disney’s platform. But that won’t happen overnight: the streaming service just launched the third season of Daredevil (it remains to be seen whether or not there’ll be a fourth season of the inaugural series), while Jessica Jones and The Punisher have each been renewed for a third and second season, respectively. At the very least, that leaves Netflix with at least some of the interconnected superhero universe for 2019. Command Line delivers daily updates from the near-future."}