{"id": "Migrant caravans won’t bring disease — anti-vaxxers will", "paragraph": "Yesterday, a guest on Fox News claimed that migrants traveling toward the US will “infect our people” with smallpox, leprosy, and tuberculosis. He did not cite evidence to support this claim, because there is none — and available evidence suggests that when it comes to public health, we have more to worry about from anti-vaxxers than from immigration. This isn’t to say that there is never any risk of infectious disease from migration. The Centers for Disease Control and Prevention (CDC) acknowledges the possibility of diseases such as measles, rabies, hepatitis A, flu, and tuberculosis spreading across the US-Mexico border. But though migrants often have health problems like the common cold and diarrhea, there has never been evidence of mass outbreaks at the border. Plus, the CDC, its Mexican counterpart, and border officials all know to be vigilant for signs of diseases. (A representative for the CDC was not available for comment as of press time.) More to the point, the US already has tuberculosis, measles, and the flu — as well as tropical diseases like Chagas’ disease, dengue, and West Nile — so there’s little evidence for common right-wing talking points, most recently claimed by Laura Ingraham, that migrants will bring diseases “we haven’t had in decades.” Unlike when Europeans brought disease to the Americas, we today live in a very interconnected world, with people and goods constantly on the move. As a result, there are very few diseases found globally that are not also found in the United States, according to Peter Hotez, dean of the National School of Tropical Medicine at Baylor College of Medicine in Houston. “There’s the misconception that somehow the United States is protected from those diseases and that’s simply not true,” he says. “The major factors promoting these diseases are poverty and urbanization and climate change. The idea that a few thousand immigrants are going to create a bump in that just defies the numbers.”More specific parts of the Fox News “infection” claim are wrong, too. The last victim of smallpox was a cook named Ali Maow Maalin, and that was in Somalia in 1977. Three years later, the World Health Organization officially declared the disease eradicated. Smallpox, at least, is a frightening disease with no cure. In contrast, leprosy (or Hansen’s disease) is a bacterial condition that is easily treated with antibiotics and which has been almost entirely eliminated in Latin America. And when it comes to viral diseases, many areas of Latin America have higher vaccination rates than parts of the US, Hotez says. That infectious disease is a small and well-addressed risk hasn’t kept it from being touted again and again by xenophobic politicians. Though the Fox News hosts later clarified that they “couldn’t independently confirm” the leprosy-and-smallpox claim, this was hardly a one-off mistake considering that the same day, a Fox and Friends host mused about migrant disease. Dave Levitan, author of Not a Scientist: How Politicians Mistake, Misrepresent, and Utterly Mangle Science points out how the Immigration Act of 1917 — a sweeping piece of legislation that marked a turn toward nationalism — associated foreigners with “loathsome or dangerous contagious disease.” Similarly, in their academic article on the persistent association of immigrants with germs, scholars Howard Markel and Alexandra Minna Stern argue that metaphors of germs and contagion are usually motivated by “ideologies of racialism, nativism, and national security rather than substantiated epidemiological or medical observations.” Recent history provides plenty of examples. In 1987, Republican Senator Jesse Helms authored legislation banning anyone who was HIV-positive from entering the country, despite the fact that there were almost no HIV-positive people trying to enter and even though it was well-known by then that HIV isn’t spread through casual contact. “There was a lot of fear-mongering that these people are going to come to our borders and infect us, which doesn’t make a lot of sense in terms of the transmission mechanism for HIV,” Levitan says, “but it was very effective as a political tactic.” This same association of foreignness with disease popped up during the 2014 Ebola outbreak, and again a year later when both a Republican House representative and then-candidate Ben Carson falsely suggested immigration was responsible for a measles outbreak. The irony is that, at this point in time, the bigger health risk is Americans who resist vaccinating their kids. The outbreak Ben Carson worried about? That wasn’t caused by immigrants, that was because of distrust of vaccines. We were able to eradicate smallpox because of a worldwide vaccination campaign. And yet the anti-vaxxer movement has been growing. Though most parents in the United States do vaccinate their children, there are pockets where it has become increasingly common to refuse. For example, between 2003 and 2016, there was a 19-fold increase in vaccine refusal in Texas and a political action committee in the state is raising money to help parents apply for exemption. Vaccine skeptics have hosted an anti-vaccine march on Washington and Trump himself has falsely suggested that vaccines cause autism. When enough people aren’t vaccinated, we lose “herd immunity” and the entire community is at risk. Using the examples of measles again, a single infected person can infect more than a dozen people who haven’t been vaccinated — many of whom are children or who have compromised immune systems. Last year, a JAMA Pediatrics study suggested that a 5 percent reduction in vaccination coverage is enough to risk a big outbreak. “This is a terrible self-inflicted wound and a lot of that is coming from the activities of political action committees using Tea Party language like ‘medical freedom’ and ‘vaccine choice,’’ says Hotez. “And so it’s incredibly disingenuous of those same individuals to worry about diseases that immigrants are bringing in.” Ultimately, the greater harm doesn’t come from refugees or asylum-seekers outside our borders, but from the anti-vaxxers, already right here in the US, who could make us all vulnerable. Command Line delivers daily updates from the near-future."}