{"id": "Epic would really like you to stop calling the new Fortnite monsters ‘zombies’", "paragraph": "Fortnite’s Halloween festival, adorably named Fortnitemare, kicked off earlier today, and the most notable addition was a horde of monstrous-looking ghouls that resembled zombies. But they’re not zombies. An Epic Games representative told The Verge that zombies don’t exist within the Fortnite universe. There’s a name for those fiery fantastical fiends that players will have to face in battle royale’s newest mode, but it’s not exactly fear-inducing. “They’re officially ‘Cube Monsters,’” the representative said. “Across Fortnite, we don’t refer to any enemies as ‘zombies.’ In Save the World, you have ‘Husks’ and ‘monsters’ of various names and types.” The rep did admit that people referring to Epic’s new undead army, which first appeared in-game this morning, is understandable. The monstrous creatures do resemble horror’s beloved freaks. Even Verge staffers had a difficult time trying to decide if we should label these supernatural beasts as zombies when they clearly have little in common with classic zombies seen in movies like Night of the Living Dead. We weren’t the only ones confused, either. Chance the Rapper cried afoul on Twitter after his character was killed by a zombie. Ali-A, one of Fortnite’s most popular players and YouTube creators, also referred to them as zombies. Not everyone called out the disturbing creatures as zombies, though. Chaosxsilencer, another popular YouTube creator, referred to them as monsters on Twitter. Still, the overwhelming majority of Fortnite players on Twitter definitely assumed these soulless corpses were zombies. Although many weren’t happy with the plethora of walking dead roaming around their map — words like “annoying” and “frustrating” accompanied many tweets on the subject — they were happily convinced that Fortnite was playing into the video game trope of adding zombies to a game. That’s simply not the case. Epic wants Fortnite aficionados to know that it doesn’t have any zombies stalking players in any part of its game. Just be prepared to deal with “Cube Monsters” instead. Command Line delivers daily updates from the near-future."}