{"id": "Apple iPad Pro specs compared: how the iPads stand out", "paragraph": "Apple announced new 11-inch and 12.9-inch iPad Pros in New York today, which now come with Face ID, a USB-C charging port, and a new “Liquid Retina” display. Aesthetically, they’ve got slimmer bezels that only come in black, like the new MacBook Airs. The black bezels, when paired with the Smart Keyboard Folio, make the iPad Pro look closer to a laptop than it ever has before. They also allow for the 11-inch model display to fit a bigger screen into the same overall dimensions as the prior 10.5-inch model. The iPads also lose their home buttons entirely in favor of the iOS 12 gesture controls found in Apple’s new iPhones. Swiping across the various edges of the screen now brings up the home screen, lets you switch apps, and pull up the Control Center, Notification Center, and Dock.The new iPad Pros bring a redesigned Apple Pencil as well, which has gesture controls, a flat side to prevent it from rolling away, and a new charging method via magnetic attachment. It’s sadly only compatible with the newer model, and first-generation Apple Pencils won’t be compatible with the new iPad Pro, either. Besides aesthetics, what differentiates Apple’s current lineup of 11-inch and 12.9-inch iPad Pros from the old 10.5-inch iPad Pro and 9.7-inch iPad is the processors. The new iPad Pros use the A12X Bionic chip, which is found in all of Apple’s latest iPhones, meaning extremely fast performance with apps. The 10.5-inch iPad Pro and 9.7-inch iPad use an A10X and A10 processor, respectively, which don’t make a huge difference in speed when compared to each other, but are a downgrade compared to the A12X chips, which are supposedly nine times faster. Out of all three, the 9.7-inch iPad would definitely be considered the “entry-level” iPad.Then there’s the issue of price. The cheapest you can pay for an iPad is $329, but if you go up to the 1TB storage option with LTE, the 12.9-inch model can run you up to $1,899. That’s quite the difference, so here’s a chart to help you through the myriad features and options available when you’re purchasing an iPad.Command Line delivers daily updates from the near-future."}