{"id": "Kickstarter to end Drip, fund new platform with XOXO festival creators", "paragraph": "Nearly a year after launching its subscriber-based crowdfunding platform, Kickstarter announced today that Drip is on the way out. Fortunately, for the creators currently working with Drip as well as anyone looking for an alternative to Patreon, Kickstarter isn’t abandoning the platform. Instead, the company is providing seed funding to XOXO festival creators Andy Baio and Andy McMillan to create an entirely new one with an explicit focus on providing financial stability and transparency to independent artists.The new initiative came about through conversations between Kickstarter founder Perry Chen and Baio, a former Kickstarter CTO. “You start thinking, what’s next, what are the possibilities?” says Chen. “As we talked more and more, I ended up thinking that this could be a good way for this to progress, for [Baio] and [McMillan] to build on what we’ve done with Drip over the last year.”Baio and McMillan have a reputation for working with and supporting independent artists, primarily through their work at the annual XOXO arts and tech festival that they created in 2012. “So much of the festival is about helping independent artists and celebrating their work and helping them connect with one another,” says Baio. “But there’s the financial component, too. And helping them getting ongoing funding for their work is something we’ve been thinking about for the better part of a decade.”There is no specific launch date for the as-yet-unnamed platform, but Kickstarter will continue to run Drip for the next year until existing Drip creators can be migrated there or to another service of their choosing. Baio and McMillan have incorporated as a public benefit corporation (PBC) for the project, much like Kickstarter, which reincorporated in 2015 as a PBC. The new platform they want to build is “much more community driven, much more social,” says Baio. “The thing we keep coming back to is building something that works for every project, regardless of whether or not they’re currently seeking funding.”The duo emphasizes again and again that they understand the responsibility that comes with this sort of subscription-based funding, which many creators rely on to pay their bills month to month. “It’s different from project-based funding like Kickstarter,” says Baio. “You need to be around for a long time. We are specifically structuring it as we go to make something that is as sustainable as possible.”The pair remains uncertain about the policies they will adopt around NSFW content. McMillan says that while they wanted to support as many creators as they can, “there are complex technical problems in supporting [NSFW content], like payment gateways. We need to look into how technologically possible it is to support those creators but I would say that we have a history of prioritizing and including those people in the community and that’s a priority for us moving forward.”When asked whether LGBT content would be flagged as adult content, even if it is not explicit — a controversy that has recently erupted around Patreon — Baio’s response was succinct: “LGBT content is not inherently explicit or NSFW in any way.”Baio and McMillan also emphasized that they planned to be communicative with their creators about any significant changes to the service, particularly anything that would affect the income of the people on the platform. “Essentially what you’re offering here is financial stability for independent artists,” says McMillan. “The thing that we are producing for these people is going to look like a piece of software, but really it’s financial stability. And we have to be incredibly respectful of bringing people into this ecosystem, in everything that we do. One aspect of that is inevitably is going to be radical transparency whenever we decide that we’re going to change something.”Although early phases of the new platform may be invite-only, their goal is to make it open to everyone. And despite the seed money, Chen makes it clear that Kickstarter will have no oversight or control over the project. “We’re just here to support,” he says. “It’s their ship to steer. And that’s exactly the way it should be.”Command Line delivers daily updates from the near-future."}