{"id": "Jake Paul’s racism controversy reveals the flaw in Shane Dawson’s docuseries", "paragraph": "Speaking purely in terms of raw numbers, Shane Dawson’s eight-part documentary on the most notorious YouTuber on the planet has been a tremendous success — in less than 24 hours, the 105-minute finale has been watched 10 million times. Some fans, however, have questioned whether Dawson truly held Jake Paul accountable for his seemingly careless treatment of former colleagues, particularly when it came to racist remarks he’s made; it’s a criticism that speaks to one of the series’ greatest — and perhaps defining — weaknesses.At the start of the documentary, Shane Dawson establishes that he wants to be hardline about Jake Paul. This is important, Dawson suggests, because, historically, he’s acted more as a friend or confidant to his documentary subjects rather than interviewer, reporter, or skeptical party. He decides that he can’t handle Jake Paul — a creator who has been criticized for performing dangerous stunts, overly promoting merchandise to a young and impressionable audience, and abusing his former colleagues — in the same way. “I am way too nice, way too forgiving, way too loyal, and I don’t wanna do that this time,” Dawson says in the first episode. “I want this time to, like, actually sit down in a room with him and be like, ‘This is why people don’t like you. This is what you did that was bad. I want you to tell me why you did it, be honest about it, and change your life. And fucking stop.’”Dawson continues to hammer this point throughout his series, often playing up how tricky it will be to strike a good balance between doing his job as a documentarian and wanting to be the Nice Guy that empathizes with Jake Paul. When the pair sit down for the final interview, Dawson goes through a long list of sins that paint Jake Paul in a negative light. For each one, Paul explains his thought process and why he did what he did, and for the most part, Dawson doesn’t really push back. Instead his responses are largely sympathetic to Paul’s woes, and when he does counter them, he does so gently and unthreateningly. For the most part, that kind of approach is Dawson’s modus operandi, one that is easy to overlook if we treat the series as a piece of entertainment. Even so, on social media Dawson’s fans are in disbelief at how he handles Paul’s explanation of a racism controversy involving former members of Team 10. Dawson’s stumbles are a consequence of his generally toothless approach to Jake Paul, one that has come to define the series, for better or worse.Late last year, Spanish YouTubers Ivan and Emilio Martinez alleged that their departure from Jake Paul’s influencer group had been because the YouTuber had bullied them, terrorizing them with pranks like destroying their room. The brothers speak English as a second language, which, they say created a barrier between them and the rest of Team 10; the divide was regularly widened by Paul, who would allegedly make racist remarks and mock their background and heritage.When Dawson brings this up to Jake Paul in the interview, the YouTuber denies that any physical abuse went on. All the pranks were fake, he says, and he would tell people about them in advance so they always knew what would happen. This arrangement was mutual, Paul says, and the brothers would tell him in advance of the practical jokes they’d pull on him, too. “My vlogs are like, lightly scripted,” Paul says. Dawson only nods. He does not ask Paul if he ever gave the brothers the option to say no, or if they felt pressured to agree to whatever pranks Paul thought of, no matter how dangerous, demeaning, or uncomfortable. He does, however, ask Paul if he feels their interactions were bad enough to justify the twins’ departure. “I think sometimes there was a language barrier when we would be joking around off-camera,” Paul admits. “Sometimes I’d see them get mad at me, but I would always try to fix it.” Dawson then brings up the accusations of racism — the twins allege that Paul would call them “beaners,” for instance — but he immediately couches the criticism by relating to Paul’s childhood. Dawson grew up in an environment where anything could fly; if Paul grew up in similar circumstances, that would make it difficult to know when a line has been crossed. “It was aggressive, the jokes were crazy,” says Dawson, who has come under fire for wearing blackface in the past. “It was offensive. And I’m not saying it’s good. I wouldn’t raise my kids that way, especially now. But, that’s where I came from, right? So when I started YouTube, and I started saying jokes, and I started saying things with my friends and stuff, I didn’t know it was too far.”Jake Paul takes the out, agreeing that this was the case for him, too. He says he waded in “high school locker-type vibes” in the past; meanwhile, early footage of him on Vine mocking a Chinese accent plays onscreen. The Martinez twins, he explains, came onto his team composed of best friends who treated everything as a joke, where nothing was off-limits. “We’d talk about each other’s moms, we’d talk about sisters, we’d diss each other,” Paul says. “And anything anyone said about me, my family, it was all just jokes ... so when we’d say jokes to the Martinez twins, I think at the time they thought it was funny, but then maybe looking back on it, they were like, ‘Oh, they were like being racist.’”Paul admits that he would call the brothers beaners, but that it was a back and forth where they would also call him a cracker, or a stupid white person. “We would just like, give [the insults] back, bros being bros,” Paul says. “And when they left, I think they used that against us. To be like, ‘They called us this and that,’ when that was the culture in that house. And they did it to us, too.” Without questioning any of this, Dawson insists he didn’t notice that kind of culture when he was visiting the house. He only asks if Paul feels he’s changed since then. “One hundred percent, those words wouldn’t even come out of my mouth, ‘cause ... to this day, I’d be scared of someone just, even saying that I said something bad,” Paul says. “...I definitely learned from that situation, like, not everyone is gonna joke around in the same way. And even they are joking around, they might not actually be okay with that environment.”Essentially thanking Paul for talking with him about this at all, Dawson then reassures him that it’s okay to be mad at the twins for what they’ve said about him. Paul, for his part, says he’s still in disbelief about the brothers’ Team 10 departure, given that he discovered them, taught them English, raised them out of poverty, and brought them into the influencer fold. He claims that they’ve only accused him of racism because the controversy would help their career after leaving Team 10.“I was, like, the first person that they would ever even feel comfortable to speak English with,” Jake says. “I don’t know. That’s why I’m mad about it.” Most of the reception to the documentary has focused on subjects like Jake Paul’s ex-girlfriend, but for some, the dilemma with the Martinez twins has taken center stage. #ShaneDawsonisOverParty was reportedly trending on Twitter at one point; right now, if you search “Shane Dawson” on the website, it’s not a highly visible hashtag, but many top results reference the discussion of racism.“I’m blocking ANYONE who still supports Shane Dawson after giving MULTIPLE FUCKING RACISTS a platform,” one tweet declares, likely in reference to an earlier Shane Dawson interview with Jeffree Star, a beauty YouTuber who has been criticized for using the n-word in the past. “Shane Dawson: defending an abuser, defending racists, making platforms for all of them, loosing [sic] his shit when people call him out,” another Tweet reads. Most tweets on the subject append some sort of video, GIF, or image that makes fun of how Dawson excuses, sympathizes, or doesn’t really critique Paul’s use of racist slurs. Despite his refusal to apologize for making offensive jokes in the past, it’s undoubtedly a good thing that someone with Jake Paul’s reach now thinks twice before making them again. But Dawson’s insistence on being the likable good guy, no matter who he speaks to, highlights the biggest flaw with his docuseries: even if it’s entertaining and successful, it can’t deliver on his own self-imposed promise to stop being “way too nice, way too forgiving, way too loyal.” Most of all, he wants to have a good time with Jake Paul, outright saying so at one point during the series. Throughout, Dawson seems more committed to enjoying making the ill-advised documentary than he is to holding Paul accountable.spoiler alert: ur family to me now. love u too man. ❤️ https://t.co/lAa6RI1hHbThis is not a work that wants you to think critically of Jake Paul as much as it is a series that really wants you to feel bad for Jake Paul — or perhaps even give you a list of reasons to like him. By the end of it, the whole thing feels like a glorified PR stunt that will help the younger Paul brother rehabilitate his unruly image: if Shane Dawson, the charming king of YouTube, loves Jake Paul, then who are you to hate him? No wonder Jake Paul feels comfortable coinciding the relaunch of his entire brand with the end of the series, when the views of sympathetic viewers are flowing his way."}