{"id": "Fortnite’s mysterious cube is gone, leaving behind a brand new location", "paragraph": "“Fortnitemares” has come to an end, and it left the world of Fortnite dramatically altered. This afternoon the battle royale game was home to a live, one-time-only in-game event, which marked the end of the monster-filled Halloween mode and introduced a number of changes to the game. More than 1 million people watched the event happening in real-time on Twitch alone.It all started when the game’s mysterious, purple cube disappeared. First, it starting melting, dripping something into the lake it hovered over. Then the cube began pulsating and spinning rapidly, before it eventually disappeared — and pulled players into a strange, brightly-lit realm. There, you couldn’t do much but float and watch a strange butterfly fluttering about.This lasted for a minute or so, before all players were transported back to the Fortnite island, which featured a brand-new location. The former Loot Lake, which had turned into the home of the cube and its floating island, now has a new landmass made up of a series of smaller islands. There are likely other changes to the map as well that we’ll see discovered in the coming hours and days. In addition to the new in-game location, Epic has also added a series of new challenges, dubbed “Lil’ Kev challenges,” after the nickname Kevin that the community gave to the cube.Developer Epic Games announced that the event was happening earlier in the week, and today even sent out a push notification for mobile Fortnite players. Those logging into the game on other platforms earlier today were warned that “the cube is unstable.”This isn’t the first time the studio has experimented with limited, live events. Back in June, Fortnite was home to a spectacular rocket launch that created a dimensional rift in the sky, which led to a steady stream of map-altering changes in the game. Most recently, Fortnite was invaded by the mysterious cube, which slowly rolled across the map, and eventually created a floating island. Before that, players who were in the game at the right time could catch a glimpse of the cube slowly disappearing into the lake, creating a fun — albeit temporary — trampoline.It’s an ever-evolving kind of environmental storytelling that has helped set Fortnite apart from other similar games. Just don’t stay away too long — a lot can happen in just a short period of time.Command Line delivers daily updates from the near-future."}