{"id": "Silent Night, Bloody Night is the perfect streaming slasher for Halloween fans", "paragraph": "There are so many streaming options available these days, and so many conflicting recommendations, that it’s hard to see through all the crap you could be watching. Each week, The Verge’s Cut the Crap column simplifies the choice by sorting through the overwhelming multitude of movies and TV shows on subscription services, and recommending a single perfect thing to watch this weekend.What to watchSilent Night, Bloody Night, a 1972 gothic horror picture splattered with gore. Though it takes place at Christmas, don’t mix this one up with the controversial Silent Night, Deadly Night, which outraged parents’ groups in 1984 with its depiction of a killer Santa. Here, the holiday setting is meant mainly to evoke wholesome small-town Americana, and to add a note of irony to the story of a spooky old Massachusetts mansion — once an insane asylum — located in a community where the locals have begun dying under mysterious circumstances.Because the latest version of Halloween opens in wide theatrical release this weekend.When writer-director John Carpenter and his co-writer/producer Debra Hill loosed the original Halloween on the world in October 1978, the film was so enormously successful that the American and Canadian horror-movie industries spent much of the next decade cashing in on its popularity. By the early 1980s, multiplexes were teeming with movies about super-powerful serial killers, murdering young people in perversely creative ways, often while tying their crimes to some kind of annual celebration — birthdays, Valentine’s Day, prom night, et cetera.Halloween has spawned multiple sequels and reboots, most of which try to get back to what made the Carpenter/Hill film a classic: the relentless masked monster Michael Myers, a placid-looking small town populated by vulnerable teens, and the idea that evildoers and the people they’ve traumatized compulsively return to the scene of the crime every so often. In the new Halloween (co-written and directed by eclectic arthouse and indie comedy filmmaker David Gordon Green), Jamie Lee Curtis reprises her role as the franchise’s first “final girl,” Laurie Strode, who’s spent 40 years obsessively gearing up for one last fight against the boogeyman she rightly assumes will eventually come after her again.As fresh as Halloween seemed back in 1978, it didn’t come out of nowhere. Over the years, Carpenter narrowed his list of influences primarily to old-time Hollywood directors Howard Hawks and Alfred Hitchcock. But the style of Halloween is also reminiscent of early 1970s giallo movies — dark Italian thrillers that often popped up in American drive-ins and grindhouses back then. And the idea of a “mad slasher” had been a staple of suspense for decades.Silent Night, Bloody Night (sometimes distributed as Death House, Deathouse, or Night of the Dark Full Moon) is a prime example of the pre-Halloween slasher, where the identity of the killer is shrouded in mystery, as the audience witnesses a string of murders through his or her first-person point of view. In this case, for much of the film, all viewers know about the gruesome deaths that pepper the plot is that they’re all related to something terrible that happened 20 years earlier in East Willard, Massachusetts. B-movie favorite Mary Woronov plays respected local Diane Adams, who tries to get to the root of the crimes. She gets some help from returning native son Jeffrey Butler (James Patterson), who wants to sell the house where the troubles began during a long-ago Christmas season.Horror historians.Genre fans who’ve only ever watched post-Halloween slasher movies may need to adjust their expectations for Silent Night, Bloody Night, which isn’t aiming to be a white-knuckle scare-fest. Its roots are elsewhere, in the atmospheric, almost literary horror produced by Britain’s Hammer Films in the 1950s and 1960s, and in the gritty, unsettling docu-realism of the New York underground cinema scene. Director Theodore Gershuny spends a lot of time at the start of the picture establishing a mood, lingering over austere, wintry New England landscapes. And he builds to a deeply creepy climactic flashback sequence, set in the asylum that the Butler house became, and played out by a cast drawn from Andy Warhol regulars like Candy Darling, Jack Smith, and Ondine.But Halloween fans may be surprised by some of the eerie similarities between the two movies. Silent Night, Bloody Night begins with the killer escaping from a mental institution. The first big murder scene happens as the victims are having sex. And the holiday trappings give the story a haunted feel, as though the characters listening to carols on the radio are actually hearing echoes from their town’s dark past. The overall approach is creakier than Halloween’s, but the film provokes a similar reaction, in that it takes locations and situations that should be warm and inviting, and twists them into something disturbing.Tubi.tv. The service has a few other pre-Halloween horror pictures too, including 1973’s Don’t Look in the Basement (another shocker set in an insane asylum) and 1972’s Children Shouldn’t Play with Dead Things, an early effort by director Bob Clark, whose Black Christmas two years later helped codify a lot of the look and language of slasher movies.Command Line delivers daily updates from the near-future."}