{"id": "Microsoft reports record Q1 results as cloud, Surface, and gaming all grow", "paragraph": "Microsoft posted the first quarter of its 2019 financial results today, reporting revenue of $29.1 billion and net income of $8.8 billion. Revenue is up 19 percent, and net income has increased by 34 percent. Microsoft says this is a record first quarter, thanks primarily to strong cloud growth.Surface revenue has jumped 14 percent year over year this quarter to $1.1 billion. This is the first quarter since Microsoft launched its Surface Go tablet in August, and it’s clear Surface is now a solid billion dollar business. Microsoft has also managed to become a top five PC manufacturer in the US during the recent quarter, thanks to Surface. On a call with investors, Microsoft CFO Amy Hood revealed that Surface revenue this quarter has been driven by Surface Book 2 and Surface Go sales.Microsoft also unveiled its new Surface Pro 6 and Surface Laptop 2 laptops recently, but these devices didn’t go on sale until October so the revenue will be counted next quarter. Likewise, the new Surface Studio 2 and Surface Headphones won’t be available until next month so we’ll have to wait for Microsoft’s Q2 2019 financial results to see if these have an impact.Microsoft’s gaming business has been growing steadily recently, and revenue is up 44 percent this quarter. Xbox hardware revenue has grown 94 percent this quarter, due to the timing of the Xbox One X launch. Xbox Live active users has also grown to 57 million in the recent quarter. In a call with investors, Microsoft CEO Satya Nadella says that “bringing [Xbox] Game Pass to the PC” is a big part of the company’s future for its Xbox services.Microsoft revealed recently that it plans to start trials of its xCloud game streaming service in 2019. Microsoft’s cloud gaming will have strong competition from services like GeForce Now, PlayStation Now, Shadow, and Liquid Sky. Even Google is testing its own Project Stream service that will let gamers play Assassin’s Creed Odyssey through its Chrome browser on a laptop or desktop. While Surface has pushed Microsoft into the top five PC makers in the US, the company also saw good results for its Windows licensing revenue. Windows OEM Pro revenue is up 8 percent this quarter, which means there was a higher mix of premium licenses being purchased by PC makers. Non-Pro revenue has decreased by 5 percent, as PC makers continue to market more and more high-end Windows laptops to consumers and commercial customers. Windows commercial products and cloud services revenue is also up 12 percent, due to an increase in multi-year agreements with businesses.Speaking of businesses, this is where Microsoft is recording impressive growth. Office commercial products and services revenue grew 17 precent this quarter, and Office 365 commercial revenue grew 36 percent. Businesses have been aggressively adopting Office 365 over the past year, and monthly active users has now surpassed 155 million. Even Office consumer revenue has grown by 16 percent, and 32.5 million consumers now subscribe to Office 365. Over on the cloud and server side, Microsoft’s Azure revenue has grown 76 percent this quarter. Server products and cloud services in general has also grown by 28 percent. The entire “intelligent cloud” division has now increased by 24 percent, marking $8.6 billion of Microsoft’s overall $29.1 billion revenue this quarter. More personal computing, that includes Windows, gaming, search, and Surface is the top division at $10.7 billion of overall revenue. Cloud, server, and Office combined makes up for $18.4 billion in revenue.Microsoft’s $26 billion bet on acquiring LinkedIn, the business-focused data and social networking company, is still looking promising. LinkedIn revenue grew 33 percent this quarter, thanks to an increase in sessions.Bing, and Microsoft’s search efforts, is also contributing steadily to Microsoft’s overall revenue. Search advertising revenue increased 17 percent this quarter, and it has been increasing like this consistently over the past year. It appears to be related to higher revenue per search and an increase in search volume overall.Looking forward, Microsoft CEO Satya Nadella now says the company’s GitHub acquisition will close “shortly.” The European Union approved the deal last week, and the $7.5 billion acquisition is a big part of Microsoft’s continued push towards supporting the open source community.Update, October 24th 6:10PM ET: Article updated with comments from Microsoft CEO Satya Nadella and Microsoft CFO Amy Hood.Command Line delivers daily updates from the near-future."}