{"id": "How Facebook’s crisis PR firm triggered a PR crisis", "paragraph": "\n    The Interface is a daily column about the intersection of social media and democracy. Subscribe to the newsletter here.\n  Pretend for a moment that you run a large and successful company. After years of outsized success, the company is confronted with a crisis. Public perception has begun to turn — against your company in general, and against you specifically — and your leadership team is now presented with the question of what to do. Your head of communications is charged with managing the public response. In time it will come out that this response including hiring a public relations agency whose work includes what is euphemistically referred to as “opposition research” and is more commonly understood to involve smear campaigns. These campaigns target your critics with attacks that are tinged with anti-Semitism and employ the services of a partisan “news” site that promotes your talking points to more mainstream outlets. As CEO, your responsibilities are vast. But the crisis in question is arguably the most serious you have faced. So what do you know about the communications plan for dealing with the crisis — and when do you know it? If you are Facebook CEO Mark Zuckerberg, or COO Sheryl Sandberg, the answer to these questions is Wednesday. That’s when the New York Times published its investigation into the company’s handling of 2016 Russian influence campaign, the details of which continued to roil the company on Friday.Subscribe to The InterfaceIn the company’s version of events, an unspecified person on the communications team hired Definers Public Affairs to monitor press about the company, help with product announcements, and carry out the odd whisper campaign against prominent enemies. The company’s reports were sent to hundreds of Facebook employees over the past year, but if they reached Zuckerberg or Sandberg, they appear not to have registered with them.The person overseeing communications at the time — the person ultimately responsible for hiring agencies — was Elliot Schrage, who served in the role for a decade before stepping down in June. His departure marked a rare shake-up on Facebook’s insular M-team, whose composition had remained largely unchanged for many years. And yet while Schrage has officially departed, he said in a farewell post that he planned to stay on to manage the transition to his successor, Nick Clegg, this coming January — and that he would continue to work on special projects after that. And he has. I’m told that Schrage was seen on campus as recently as Tuesday. Is he working on the Definers fallout? Facebook hasn’t responded to my request for comment. But it’s at least possible that the fall guy for the Definers story is still working on one of the things that he publicly took the fall for.Meanwhile, reporters are digging in to how Definers operated. The Times examines how it tried to get ahead of Congressional hearing by blasting out fact sheets listing which ad trackers senators used on their own websites, and how much they had spent on Facebook ads. CNN found the firm trying to plant a story about liberal bias at Apple. (Facebook says that work was not done on its behalf.) They also pitched The Verge a (presumably unrelated to Facebook) negative story about the scooter company Bird.At TechCrunch, Taylor Hatmaker finds several more ties to Definers at Facebook, where former Republican campaign staffers who once worked with its co-founder now work on the communications team.Sandberg, who had remained silent for a day, put up a Facebook post on Thursday evening largely reiterating points other people had already made. This was the key passage, to me:We’re no longer working with them but at the time, they were trying to show that some of the activity against us that appeared to be grassroots also had major organizations behind them. I did not know we hired them or about the work they were doing, but I should have. I have great respect for George Soros – and the anti-Semitic conspiracy theories against him are abhorrent.Sandberg then called in to CBS This Morning to discuss the story. “We absolutely did not pay anyone to create fake news,” Sandberg said — and while plenty of people are more or less saying Facebook did, it’s worth noting that the original Times story did not.Definers got around to issuing its first public statement, letting everyone know that the implications of their name aside, they are basically just a humble neighborhood press clippings service. The statement does not address its “in-house fake news shop,” as a former employee called it to NBC. NTK, which shares a co-founder and a physical office with Definers, put out a statement saying this was was all a big coincidence. (Farhad Manjoo has a nice roast of this here.)One of the Definers, Tim Miller, put out a much better statement, in which he walks through most of the Times story and explains his side. It pays minimal attention to the smear campaigns, and no attention to NTK, but it at least grapples with the implications of circulating documents linking Facebook’s critics to George Soros, even when that link is legitimate.Are we paying too much attention here to a single PR firm? I don’t think so. The field of public relations is a vast and largely unseen force shaping most of the news you consume, whether you know it or not. It’s a shadowy conspiracy that’s actually true! There are six PR people for every working journalist in the United States, and for the most part they are operating invisibly. Much of the work is essentially benign, but in the aggregate it exerts a force, drawing reporters away from more enterprising stories they might otherwise cover. And when the stakes are higher, companies are more likely to use agencies that resort to dirty tricks — and the public ought to know about those tricks, too.I spent the past few days chatting with people in and around Facebook’s orbit about the likelihood that Zuckerberg and Sandberg didn’t know they had hired Definers. The former employees I spoke with were in unanimous agreement that they believed Zuckerberg when he said he did not. Communications, they said, has generally been something he was willing to delegate. I talked with other CEOs, outside the social realm, who told me they almost never knew what agencies their communications people were working with at any given time. I talked with people who hired agencies who said their CEOs never asked about them.As many observers have noted, not knowing who your agencies are gives you a plausible deniability that can come in handy when they go rogue. But in the midst of a true crisis, it would seem that greater attention to detail is warranted. Certainly it was unlikely that Facebook’s hiring of a crisis PR agency would itself become a crisis. But the unexpected has been rippling across every corner of Facebook for more than two years now. The effort to reset the narrative on terms friendly to you — and the tactics by which you intend to go about it — would seem to deserve the CEO’s full attention.Facebook reports a massive spike in government demands for data, including secret ordersFacebook published the details of 13 national security letters, Zack Whittaker reports, amid growing demand from the US government for user data.Notifications every 2 minutes: This in-depth look at how people really use WhatsApp shows why fighting fake news there is so hardLaura Hazard Owen has a great recap of something that somehow I missed, because you personally did not email me about it! The BBC did a weeklong series on misinformation across TK. Owen has an incredible detail here about the unintended consequence of WhatsApp recently adding a “forwarded” tag to forwarded messages, which was supposed to encourage people to question the source of the information that was coming to them:For instance, WhatsApp, under government pressure, added a “Forwarded” tag in India to show that messages might have originally come from an unknown source. But “we observed that citizens for the most part had either not quite noticed the tag or if they had noticed they had misinterpreted what it meant. In what is possibly an isolated case, a respondent even thought that the tag was encouragement to further forward the message on!”What Facebook Knew and Tried to HideIf you prefer your Facebook talk in audio format, The Daily did an episode on the situation Friday.Facebook Morale, Already Hurt by Share Drop, Suffers Another HitSarah Frier catches up with what Facebook employees are saying on the anonymous talk-trash-about-your-job app Blind:“I’m f-ing exhausted of cleaning up after the sloppy and careless mistakes that made so many of the people responsible for them so, so rich,” said a third.Facebook’s Instagram Loses Two Senior Leaders After FoundersSarah Frier has the scoop on two medium-profile departures from Instagram:Instagram is losing two of its higher-level employees: Bangaly Kaba, the head of growth, and Ameet Ranadive, who ran product for the well-being initiative that sought to combat bullying on the app.Hackers Are Stealing Instagram Influencer AccountsTaylor Lorenz has details on a clever new Instagram hack in which bad people tempt users with the promise of easy influence-marketing money, then trick them into logging onto a portal that lets the hacker steal their login credentials and account.Once the influencer logged in with the Instagram username and password, Brooks seized control of the account. Within minutes, he was spamming the influencer’s millions of followers with offers for a free iPhone.Brooks has targeted several YouTubers, Instagram stars, and meme pages and used the stolen pages to promote scammy-looking apps and fake offers for free products. In the past month alone, he has seized @Fact, with 7.2 million followers, @Chorus, with 10.1 million, and @SnoopSlimes, with 1.9 million. After the accounts are seized, the hackers update the account’s bio to say “managed by SCL Media,” and begin reaching out to brands via direct message, telling them to negotiate sponsored content deals with SCL, not the previous account holder, going forward.Bitcoin Giveaway Scams Are Flourishing On Twitter. They’re Probably Coming From Russia.Jane Lytvynenko and Ryan Mac report on the embarrassing prevalence of Bitcoin scams on Twitter:Though the platform outright banned all cryptocurrency ads in March, fraudsters — some who appear to be Russia-based — have become more sophisticated and are starting to hack verified accounts with high follower counts to push their scams. In some cases, they’ve even purchased and run Twitter ad campaigns to promote them.On Tuesday, hackers were able to post promoted tweets from the accounts of Target (1.9 million followers) and Google’s business apps division, G Suite (more than 823,000 followers) and used them — along with some other verified accounts — to pump cryptocurrency giveaway scams through Twitter’s own ad network. BuzzFeed News was also able to purchase cryptocurrency scam ads with the same language.‘No Morals’: Advertisers React to Facebook ReportOur nation’s last remaining moral compass, the advertising industry, is publicly aghast at the latest Facebook revelations, Sapna Maheshwari reports. (We’ll see if any of this translates to, you know, less advertising on Facebook.)The revelations may be “the straw that breaks the camel’s back,” said Rishad Tobaccowala, chief growth officer for the Publicis Groupe, one of the world’s biggest ad companies. “Now we know Facebook will do whatever it takes to make money. They have absolutely no morals.”How The Wall Street Journal is preparing its journalists to detect deepfakesThe Journal is training its staff to recognize digitally manipulated video:We at The Wall Street Journal are taking this threat seriously and have launched an internal deepfakes task force led by the Ethics & Standards and the Research & Development teams. This group, the WSJ Media Forensics Committee, is comprised of video, photo, visuals, research, platform, and news editors who have been trained in deepfake detection. Beyond this core effort, we’re hosting training seminars with reporters, developing newsroom guides, and collaborating with academic institutions such as Cornell Tech to identify ways technology can be used to combat this problem.Bumble Is Open to a Right Swipe on IPOThere’s finally going to be a public social network with a woman in charge: Bumble CEO Whitney Wolfe Herd. More of this, please!Facebook Messenger is building a “Watch Videos Together” featureAnd just when the app was finally streamlining, too! Soon you’ll be able can watch a movie inside a group chat, or something.It’s time to start regulating FacebookNina Jankowicz, a Russian disinformation researcher, has had it with the recent Facebook revelations:While Facebook attempts to convince us that it is atoning for its sins (and sometimes using dubious methods to do so), the company is consistently violating the principle of “do no harm.” Facebook’s actions have shown that it believes that harm is okay — inevitable, even — as long as profits are up and the company can afford shady smear campaigns to distract from its mistakes.Mark Zuckerberg’s response to the NYT’s damning Facebook story proved its point.Will Oremus has a fair point about one reason that tech companies like agencies:Of course, the ability to distance yourself from an opposition-research firm’s tactics and plausibly deny knowledge is a big part of why companies and campaigns hire them in the first place. Firing Definers and disclaiming responsibility is the epitome of the “typical D.C. relationships” Zuckerberg claimed to be eschewing.Antitrust Alone Won’t Save Us From the “Curse of Bigness”Gene Kimmelman, the president of Public Knowledge and former chief counsel of the FTC’s antitrust division; and Charlotte Slaiman, Public Knowledge’s policy lawyer, say breaking up big tech companies isn’t the panacea that Tim Wu and others say it will be:While Tim acknowledges the need for additional policy solutions, his focus on antitrust overstates its power to eliminate the full array of harms caused by highly concentrated markets. We also need regulation. The excessive market concentration and corporate power we see today resulted not only from conservative jurisprudence and lax antitrust enforcement, but also excessive deregulation. It will take much more than antitrust to rectify this.Will Stanich’s Ever Reopen? Why America’s Best Burger Spot Closed DownHere is a beautiful story about a man who went on a quest to find the best burger in America, and named it, and the resulting flood of attention from social media drove the business into an early grave. It’s a nuanced and beautifully told story about how the internet can serve as an attention lens, for better and for worse. One to savor over the weekend:Stanich explained that, as these issues were going on in the background, it was hard to read the social media screeds attacking them, and listen to the answering machine messages at the restaurant calling him a fat fuck and telling him to fuck himself for closing his own restaurant. He didn’t care about them, he insisted. He only cared about people like that woman who’d shown up, the regulars who live in NE Portland. “I need to take care of the people who took care of me,” he said. “They don’t turn on you.”Send me tips, comments, questions, and links to your favorite NTK stories: casey@theverge.com. Command Line delivers daily updates from the near-future."}