{"id": "Despite its flaws, Facebook still holds my memories, and giving that up is hard", "paragraph": "Deleting your Facebook is the new going to the gym. Logically, everyone knows that they need to unplug from Mark Zuckerberg’s terrifying, data-collecting, ad-serving monstrosity, but actually doing so is another matter entirely. It’s impossible to move on. But despite scandals with the geopolitical significance of the Cambridge Analytica scandal and breaches that affect 29 million Facebook accounts. I still haven’t been able to pull the trigger. I objectively hate this service, and spend minutes at a time staring at that neat blue “Delete Account” button, but there’s still something here that I can’t face losing entirely. It’s a cliche, the thing that Facebook obnoxiously prides itself on storing, and I hate myself for saying it... But I don’t want to delete the memories. I joined Facebook around the age of 16, the time at which my school went from gender-separated to co-ed classes. It was essentially the start of my “adult” social life. My school didn’t do face books in the traditional sense (those big sheet of headshots that you learn the names of your new classmates from), so the digital face book at the core of the social network was what drew us en masse to the service. Ten years later, and although Facebook has grown bloated with viral content and news sharing, this core is still its strongest element. Two years after opening my account in school, I went to university, and Facebook deepened its claws into my personal relationships. By that point I had my first smartphone, and although its Android app was close to unusable at the time compared to its slick iOS counterpart, the social network continued to amalgamate most of my non-academic life. I got into student theatre as Facebook was solidifying itself as the most effective way of promoting amateur events, and friends and I formed Facebook groups around the student societies we were involved with. Both school and university were a long time ago. Nowadays I no longer attend or organize amateur events with nearly the same frequency, and I couldn’t even tell you the last group I joined. Facebook’s breadth of features are now more or less irrelevant to me, and that means my account has become a perfect historical record of that period rather than a service I actively use. In a previous era, a non-photographer like me wouldn’t have much in the way of a visual record at all, but Facebook allows me to have exactly that, with little to no effort from me beyond having an account in the first place. I’ve thought hard about how I’m going to move on from Facebook. Facebook does make it trivially easy to download my data, but it doesn’t touch the thousand odd photos which I didn’t upload but which I’ve been tagged in over the years. Doing that took messing with some seriously dodgy Chrome extensions. I’m not even going to link to the program that I used because it’s impossible to say whether it’s already run off with all my data and sold it to the highest bidder. These processes have gotten me two things: a ZIP archive containing HTML records of all my data, and a folder containing around a thousand unordered and unlabelled photos that’s less of a streamlined memory lane and more of a disorientating nostalgia junction. Technically that means I’ve backed up every data point I can, but I still can’t bring myself to delete my account entirely. That’s because the real value, which you can’t save to a hard drive, is the endlessly updating network that ties all this information together.This web of information that Facebook constructs around your photo memories offers an astounding amount of context that it’s easy to take for granted. You can pretend that it’s always been a useless service, but the digital face book at its core is a work of beauty; simple to use but astonishingly powerful. My parents and grandparents own countless photo albums full of pictures of friends they no longer remember the names of, but Facebook’s photo tagging system means that each and every photo contains a hyperlink to the profile of the person behind it, and in most cases I can see exactly what they’ve been up to since it was taken. It’s just a shame that this web of information that brings context and meaning to every one of my photographs is exactly the same data that powers Facebook’s powerful ad network. It attaches them to our location histories, event attendance, the personal information we willingly provided, and all those pieces of tracking information we never chose to give to Facebook but which it gained through a network of cookies that spans most of the western internet. We get the convenience of easy access to our memories, and Facebook — and by extension, its advertisers — gets the data that underpins it. I have no doubt that plenty of people still use Facebook as a healthy social network on a daily basis, but for my network of friends that time has long since passed. My Facebook page has become two things. On the one hand, it’s like a LinkedIn profile; a stub of an account that exists for people to get in contact if they don’t have my phone number or invite me to events. But it’s also a service I use to indulge my nostalgia. I read old statuses and look back at old photos that Facebook finds for me. I descend down a rabbit hole of old acquaintances, clicking through profiles, snooping at “life events” and yet always stopping short of posting anything myself. I’m glad that Facebook existed during the period of my life that it did. I’m glad that a period that saw me turn from an angsty teenager into something approaching a mature adult was catalogued (almost without any effort from me) and I’m glad that an online network existed that eased me into the rapidly forming friendship groups of my early university life. Now though, the amount of personal data that I’ve poured into the service has reached a critical mass, and I can’t let the allure of easy access to a decade of memories keep me pinned to a ticking time bomb of sensitive data.Now that I have my photos downloaded, I eventually want to curate this mass of memories outside of Facebook’s network. I want to pick out my favorite photos from each section of my life and arrange them in a traditional photo album, adding labels and descriptions to the photos that my parents never bothered with while I’m still able to remember their contexts and participants. It’s a nice idea, but it still pales in comparison to the information Facebook effortlessly serves up. Memories have survived before without people having immediate access to every person they’ve ever met. But, while you have to be careful not to lose photographs, Facebook’s strength as a service is that as you use it organizes and categorizes your life — quietly transforming life events into memories that you can effortlessly return to. Giving up Facebook means giving up this convenience. I just hope I haven’t forgotten how to preserve memories in the meantime. "}