{"id": "New trailers: Black Monday, Narcos: Mexico, Destroyer, and more", "paragraph": "So I finally made it back to theaters to go see First Man, the Neil Armstrong biopic from La La Land director Damien Chazelle. Like my colleague Bryan Bishop wrote, I think the film gets a little stuffed up by Armstrong’s stoicism, preventing us from getting too close to him. But that being said, the reason the film stands out at all is because of the way it tries so hard to dive into his character.Everyone knows the events of the moon landing, at least generally enough. So instead of worrying about telling that beats of the story in excruciating, inspiring detail, the film gets to hone in on what Armstrong and others around him — his wife, his kids, his colleagues — are all feeling as this daring journey rockets along.It makes the stakes feel greater, and the events all the more tense. More importantly, we’re truly seeing a story we haven’t seen before, even if something very familiar (the quest to get to the moon) is the plot that drives it along. It’s a clever approach. And while I wish the film would have brought us even further into Armstrong’s head, it still made for a compelling take on the moon landing.Check out nine trailers from this week below.Here’s our first real look at Narcos’ revamped new season / spinoff series, which moves the show to Mexico for what looks like a much bigger and wilder ride. The show is supposed to be about the birth of Mexico’s drug war, focused on the rise of the Guadalajara Cartel. Michael Peña and Diego Luna star. It comes out November 16th.This is just expertly assembled. Don Cheadle stars in this frenzied and hyper-stylized series about the first modern stock market crash, which saw markets dive across the globe. I have no idea how you continue a series based around and named after a single day, but it looks just incredibly fun, so who cares. The show starts January 20th.After winning a bunch of new fans with her small-scale horror film The Invitation, Karyn Kusama is back with Destroyer, a trippy-looking crime thriller that has a sometimes-unrecognizable Nicole Kidman playing an LAPD detective going perhaps too far undercover to bust a gang of thieves. It looks like this one’s gonna be another winner. It comes out on Christmas. As you all know, this New Trailers column is also the home of the internet’s largest Keira Knightley period piece fan club, so we are obviously very excited about this new film that seems to be almost exclusively filled with longing gazes and troubled reaction shots. It comes out April 26th.The concept is a little cliche and cheesy, but it actually looks like Jonathan could take a simple premise and turn it into a smart and thrilling sci-fi film. The movie’s about a guy, played by Ansel Elgort, who wakes up every other day in one of two different personalities, who leave messages for one another to explain what they’ve been up to. Eventually, they get into a heated disagreement, and naturally, things go very awry. It comes out November 16th.Gina Rodriguez stars in this remake of a 2011 Mexican film of the same name. This new version is directed by Catherine Hardwicke, who made Twilight and Lords of Dogtown, and seems to have a much more polished and action-forward approach. The film has Rodriguez playing a woman who gets kidnapped and forced to assist a gang of smugglers, while also trying to save her missing friend. It comes out February 1st.The Clovehitch Killer looks like an interesting and modern twist on the serial killer crime drama story by making the probable killer the father of the main character — and then making the killer’s motivations stem from obviously toxic masculine ideas. Reviews are limited, but pretty good so far. It comes out November 16th.The Possession of Hannah Grace looks like it’s coming out exactly one month too late. It’s a really straightforward-looking horror film about a morgue employee who discovers that a body has become possessed and is obviously now doing scary things. The thing that I think makes the film stand out is how focused it is: from the trailer, it looks like the whole film is confined and one-on-one, just the star and the demon trying to find her. It comes out November 30th.You just know some Sony producer sent out an all-staff email saying “Millenials seem to be really into these ‘escaping rooms’. Anything we can do with that?” and this movie was born. It’s really not the worst idea — the film looks like something between Saw and Cube — but the name just seems like the laziest thing imaginable. It comes out January 4th.Command Line delivers daily updates from the near-future."}