{"id": "Faraday Future founder resigns, employees being furloughed amid cash crunch", "paragraph": "Faraday Future is nearly out of money following a fight with its main investor, a founder has resigned, and the company is taking even more drastic measures to keep the company from collapsing until new investment comes in, The Verge has learned. Last week’s layoffs and salary cuts have not trimmed enough of the some $10 million monthly payroll, so management has decided to shut down some operations this week at the company’s headquarters in Gardena, California, and at its factory in Hanford, California. Workers will be placed on unpaid leave, or a “furlough,” until new funding is secured, according to an email from CEO Jia Yueting obtained by The Verge.In addition, Nick Sampson, one of Faraday Future’s three co-founders, resigned on Tuesday, according to a separate email obtained by The Verge. His departure comes just one day after Peter Savagian, a longtime GM executive and Faraday Future’s senior vice president of technology and product development, also left the company. And it follows last week’s news of layoffs and salary cuts, which came as a result of a fight with Faraday Future’s main financial backer, Chinese real estate giant Evergrande Group. After this article was published, Faraday Future spokesperson John Schilling confirmed Sampson and Savagian’s departures in an email to The Verge. “We wish them the best of luck in their future endeavors,” he wrote.“The company is effectively insolvent in both its financial and personnel assets, it will at best will [sic] limp along for the foreseeable future. I feel that my role in Faraday Future is no long [sic] a path that I can follow, so I will leave the company, effective immediately,” Sampson wrote. “I cannot continue knowing the devestating [sic] impact we are having on the lives of our employees, their families and loved ones as we as the [sic] ripple effect this will have on lives throughout our suppliers and the industry as a whole.”Sampson added that “if circumstances should materially change, I certainly would consider returning to the company.”Faraday Future’s CEO (and only remaining founder) Jia says in his email that all employees who started working after May 1st of this year “must take a furlough.” Full-time staff workers who have been with Faraday Future since before May 1st will have the option to remain on board with a reduced salary of $50,000 per year, according to the current and former employees. Hourly workers who have been with the company for more than six months will be allowed to stay on, but at minimum wage, the current and employees say. Jia said the furlough will last at least through December, and is dependent on finding new funding. “We are grateful to all of the hundreds of employees who are willing to stay with the minimum wage [sic] and continue to work on the FF91 core project,” Jia wrote. “This was an extremely tough decision to make, and we recognize the emotional stress and financial strain this puts on people’s personal lives.” Have information about Jia Yueting, or Faraday Future? Email the author at sean.okane@theverge.com, or use SecureDrop or Signal to securely send messages and files to The Verge without revealing your identity.The furloughs, though, will “basically shut down the company,” Sampson wrote. “I have tried as best as I know how to find solutions to the problems but have met insurmountable barriers that I have not been able to resolve. I am sorry and sad that this day has been reached but I must do what my heart tells me.” Faraday Future’s discord with Evergrande Group resulted in layoffs and wage cuts — of 20 percent — last week, as well as stalled payments to a number of suppliers. The company had spent the first $800 million from Evergrande by July, and it was denied an advance on the remaining $1.2 billion after taking the case to arbitration in Hong Kong. The arbitrator did allow Faraday Future to seek up to $500 million in new investment money, but it is subject to Evergrande’s approval. Jia said in Tuesday’s email that Faraday Future is “currently engaged in conversations with investors from different backgrounds.” Faraday Future signed a lease for the Hanford factory in August 2017, and it promised the local government that it would eventually create around 1,300 jobs. The company spent most of 2018 refurbishing the factory — which had sat dormant since 2001 when it was used to make Pirelli Tires — to get it ready for the production of the company’s electric luxury SUV, the FF91. It bought the Gardena headquarters in 2014 and has occupied the building ever since. Update October 30th, 4:30PM ET: Added comment from Faraday Future spokesperson.Command Line delivers daily updates from the near-future."}