{"id": "Spinal implants help treat paralysis but aren’t ready for primetime", "paragraph": "David Mzee’s left leg has been paralyzed ever since he bounced off a trampoline and broke his neck in 2010. So when he woke up in the middle of the night last year and realized he was moving his left toe, he couldn’t believe it. “I didn’t know if it was real,” he says. He kept wiggling the toe, resting it, and then wiggling it again. “I think I was awake for an hour after that, just to see if it keeps on moving.”It kept moving. Mzee’s toe wiggle was the result of months of physical training and a device that delivers pulses of electrical stimulation to Mzee’s spinal cord. Now, after participating in a study at the Swiss Federal Institute of Technology in Lausanne, Switzerland (EPFL), he and Gert-Jan Oskam, another man with partial lower body paralysis, can walk across the ground with crutches. A third participant, Sebastian Tobler, came to the study with an extreme case of lower body paralysis — and by the end, he could walk across the ground with a walker, according to a study published Wednesday in the journal Nature. For all of the study participants, stepping is still slow and difficult; they continue to use wheelchairs to get around (and, for Mzee, to play competitive wheelchair rugby.) But the surprising thing is that even with the spinal stimulation turned off, both Mzee and Oskam can now take a handful of steps with crutches, and move joints that they couldn’t move before — like Mzee’s left toe. It shows that with electrical stimulation and training, the spinal cord can regain control over paralyzed muscles even years after an injury. The study, led by Grégoire Courtine, an associate professor at EPFL, is the third small study in just over a month to show similar results. And it raises the question of whether it’s time for these spinal stimulation devices to move beyond the lab and into the clinic. “If we rush too fast, there’s going to be mistakes and that could set back everything,” says Reggie Edgerton, a professor of integrative biology and physiology at the University of California, Los Angeles. Edgerton, who was a co-author on one of the three recent studies, encourages caution, tempered by the urgency felt by many in the medical community: “At the same time I know that patients are waiting, and keep waiting.” Each year, traumatic incidents around the world injure hundreds of thousands of people’s spinal cords, according to the World Health Organization. In the United States, 1.3 million people have paralysis due to spinal cord injuries. For people living with such injuries, these studies may offer hope that being able to move once-paralyzed muscles even a little bit could bring massive benefits like more independence, better blood pressure control, and boosted stamina. But for now, there’s no real treatment. “Outside of these experimental trials, there’s not really anything else available that even claims to offer long term benefit,” says Jeff Marquis, whose lower body has been completely paralyzed ever since a mountain biking accident.Like Mzee, Marquis received a spinal cord implant as part of a research study. The implant and training at the University of Louisville in Kentucky helped Marquis and another participant with complete lower body paralysis, Kelly Thomas, walk across the ground with walkers. “I used to not get out of bed without someone there to help me transfer. That’s something I don’t even think about doing now,” Marquis says. “There’s no question that it’s benefited me.” Thomas has made so much progress with walking that she’s now working on getting rid of the walker altogether — but other strength gains have made a major difference for her, too. “I wasn’t able to contract all my torso muscles prior to having this implant, and now if I need to cough, or need to clear my throat, I can,” she says. “It puts my mind at ease.” Yet another person with complete lower body paralysis who participated in a study at the Mayo Clinic can now take steps across the ground with assistance, according to a second paper published last month. The track record isn’t perfect: there were two participants in the Louisville study whose gains weren’t quite as dramatic as those of Thomas and Marquis, and another person in the Mayo clinic study whose results haven’t been published yet. None have returned to their pre-injury health. Still, three studies in three different centers have shown positive results — using somewhat different approaches. Courtine’s team in Switzerland took the tech itself the farthest: they MacGyvered a device intended for deep brain stimulation, the Medtronic Activa RC, to send timed pulses of electricity into the spinal cords of Mzee, Oskam, and Tobler.  “We scienced the shit out of it,” says Courtine, whose team at EPFL collaborated with neurosurgeon Jocelyne Bloch and others at Lausanne University Hospital (CHUV) on the research. “The way we stimulate the spinal cord is with the precision of a Swiss watch — where we stimulate, when we stimulate.” The theory is that this pulsed stimulation resembles signals from the brain, and the precise timing — matched to the study participants’ steps — might help rewire the injured nervous system. “In the central nervous system, plasticity is related to time. When neurons fire together they breed new connections,” Courtine says. Right now, it’s still a theory — supported by the group’s work in animal models. But the Louisville and Mayo Clinic studies also showed positive results using a simpler strategy that sends continuous, rather than pulsed, electrical stimulation to the spinal cord. Both approaches are helping people move parts of their bodies that they couldn’t before. Still, despite the successes, there’s a long way to go before either method is made available to patients at a broader scale. The first step is improving the technology, Courtine says. “Clearly we have reached the limit for what we can do as academic investigators,” he says. To that end, the team has spun out a startup called GTX medical to continue their work with the stimulation tech: the Swiss Federal Institute of Technology (EPFL) owns the patents, and is exclusively licensing them to GTX medical.The goal is to continue optimizing the electrode array and the neurostimulator, as well as the voice-activated user interface. “It needs to be incredibly reliable,” Courtine says. “You can’t just use Siri.” For example, imagine if someone talking next to you could turn on or off your stimulation, he says. But those investments in research and development, followed by clinical trials, aren’t cheap. That’s one reason that Courtine’s startup isn’t facing a crowd of competitors. In the traditional regulatory pathway for medical devices, companies invest upwards of $100 million for large-scale, long-term clinical trials to show the device is safe and effective. “On average, to go from absolute startup to approval is in the eight-to-ten year range,” Donald Palme, a strategic scientist for NAMSA, a medical research organization says. “It’s very difficult, and that’s the major barrier: the potential for profit, for most of these companies.”And conducting clinical trials in the spinal cord injury population can be challenging: “Every injury is different, every extent of the injury is different. It’s going to work in some, and it’s not going to work in others,” Palme says. He suspects that the big names in electrical stimulation like Medtronic, Boston Scientific, and Abbott are following these academic research studies closely. But the one with the closest ties to the tech, Medtronic, has little to say about their future plans. “We’ve got a lot to learn related to what type of product this indication really needs and the clinical pathway associated with getting this therapy to market,” Sara Thatcher, a spokesperson for the company, says in an email. Even if an implant does make it to large-scale clinical trials, there’s still another group of people who will have to buy into the technology, Mzee, Thomas, and Marquis agree: the people it’s intended for. And using it takes a serious commitment, they all say. There’s surgery, the time investment for the physical training, and there are no guarantees that it will work for everyone. “It’s not a magic pill that makes you walk,” Mzee says. “You need to train hard.”In addition to the physical work, the cycle of hope and disappointment as abilities look like they might re-appear and then never materialize can take a toll, too, he says. For Mzee, it’s been worth it. Having more control over his once-paralyzed left leg means he can flip over in bed, and get comfortable enough to sleep, for one thing. “But people should know that sometimes it’s a roller coaster of feelings and that the training can be very hard.” Mzee says. “And we still don’t know the long-term effects, whether good nor bad.”Update November 3rd, 2018: Updated to include the study contributions of researchers at Lausanne University Hospital (CHUV). "}