{"id": "Verily pauses research on glucose-sensing contact lens", "paragraph": "Verily, previously Google Life Sciences, is putting a hold on its program to build a contact lens that can monitor glucose in tears. First announced in 2014, the glucose lens has been one of Verily’s highest-profile projects, even as experts suggested the entire project was a pipe dream. The lens — which was supposed to contain a tiny wireless chip and glucose monitor — was intended to help diabetic patients. People with diabetes need to carefully monitor their glucose levels, but all the existing monitoring options involve needles and can be painful. For many life science companies, building a needleless blood monitor is the holy grail of the industry, especially because 592 million people worldwide are expected to have diabetes by 2035. Last year, rumors circulated that Apple, for example, was trying to build a needleless glucose monitorBut all of these companies are facing an uphill battle. Glucose is fundamentally hard to measure. Among other challenges, the body doesn’t have a lot of it, and it lacks distinguishing features. Plus, experts say the contact lens program was misguided from the beginning. Tears are an unreliable measure of blood glucose, John L. Smith, former chief scientific officer of Johnson & Johnson’s glucose monitoring division and author of The Pursuit of Noninvasive Glucose: Hunting the Deceitful Turkey, told The Verge. Glucose in tears simply doesn’t track closely enough with glucose in the blood. Today’s development is the latest sign of a change in Google’s health initiatives, as the company recently hired a CEO to organize its fragmented health initiatives. Though Verily will continue research on smart lenses to address farsightedness and cataracts, the end of the glucose monitoring project itself is hardly surprising. After all, this project went quiet in 2016. Command Line delivers daily updates from the near-future."}