{"id": "Now that the crowd is here, the fun can begin in MapleStory 2", "paragraph": "I couldn’t decide if I wanted to play MapleStory 2 when it was released globally in October. I had eagerly anticipated it since its South Korean launch in 2015, but now that it was here, I needed to see if my friends and boyfriend — whom I met in the original MapleStory — wanted to join, so that I would have a guild and people to party up with on quests.It wasn’t long before they seemed bored by it. During the beta testing phase this May, hardly anyone was approved to be a beta tester, so the worlds of Maple were lonesome. Then in the weeks leading up to MapleStory 2’s global launch, nobody said a word in my Discord channel. Nobody, it seemed, cared. That included me — I planned to spend this winter getting comfy with my PS4, trying some visual novels.During this time, at the end of September, I was out on vacation for three weeks, surfing the web on a VPN, not interested in Google or Discord while I was in China. I may have missed the increasing hype around MapleStory 2 as old fans decided to pick up the game. My obsessions while in China were the shopping app Taobao and the food delivery app Meituan, which gets you midnight snacks for a 2 to 3 RMB service fee ($0.29 to $0.44). Little did I know that my entire Discord horde was busy buying founders’ packs that grant you extra boosts, designing their little Lego-like houses, buying cute clothes, and upgrading weapons in MapleStory 2.But once I landed in New York again, I saw that my friends had their real names as usernames. Short, crisp, five-letter names that contain references to early anime, Twitch streams, and company values. (The last one was my boyfriend, who bought his founder’s account off the black market after he returned from China, struggled to find a username, and settled on using his company’s value of accountability. He got his other username by looking at his jury duty summons. Yeah, I know.)Getting my account up to speed became of paramount importance. So immediately I began training and leveling my character — a priest — to level 50, only to be irked by her insufficient damage. I started over and set my sights on a different character, a more powerful class. I debated whether I should play an assassin, a wizard, or a weird hybrid of the two: a rune blader. I randomly went with the wizard and got stuck on picking a username. This is when the delight of playing MapleStory 2 unexpectedly revealed itself.I’ve already beta tested MapleStory 2. I know what this game is and what happens when you get to the end — you’re bored and lonely, and there’s nothing left to do but to explore the world. But what the beta version was missing — the enormous MapleStory community of children and teenagers now grown up as college students and young professionals — meant that I was only playing a shell of a game.It’s the thrill of knowing others are also striving to make their characters the silliest-looking or the most lovable, that clever names are well sought after, and that when you are looking for a party quest, five other strangers at any time will immediately join you. These are the things that make this game meaningful. I sat there for hours trying every nice word I could think of until I finally landed on a four-letter word username that others hadn’t taken yet: Leit, as in leitmotif. (I also created characters named Enlarge and Colonial, but those don’t have quite the same appeal for obvious reasons.) In beta, virtually any word was available, which sucked the joy out of this exquisite hunt. The same goes for building a house. You’re afforded so much free space and furniture, but the act of laying the bricks and intricate details is tiresome if nobody ever knocks on your door.I’ve come to the conclusion that MapleStory 2 lives or dies by how many people are playing it together. And while that’s true for most massive multiplayer games, it’s especially true for Maple, because its fan base is largely people who grew up with the original, and enjoy the nostalgia factor. No one really plays Maple for its quests and content.One of the most popular activities in the original MapleStory, and it remains that way in the sequel, is letting your character stand in the middle of a town square while you’re physically away from the game. You might not be playing, but you’re showing off your appearance and stats to onlookers. That doesn’t have quite the same appeal when nobody is looking.Command Line delivers daily updates from the near-future."}