{"id": "Trump reportedly still uses an unsecured iPhone, and China and Russia are listening in", "paragraph": "President Donald Trump routinely calls old friends, business partners, and confidants on his personal iPhone while in the White House, giving Chinese and Russia spies easy access to his personal communications and interests, reports The New York Times. The story cites American intelligence reports, which detail how Trump aides have repeatedly warned the president not to use his personal iPhone and to use the secure White House landline instead. Despite the warnings, Trump continues to take personal cellphone calls, and the White House has resolved to simply hoping the president doesn’t discuss classified matters over the phone. According to the report, US intelligence agencies have reason to believe that Chinese and Russian spies are regularly eavesdropping on Trump’s calls by way of human sources within foreign governments and through the interception of communications between foreign officials. The goal, according to the NYT, is to keep Trump from escalating the ongoing trade war with China, with Chinese intelligence agencies hoping that by learning more about Trump’s behavior, they can use people close to him to influence policy. The Russians are thought to be a running a less sophisticated operation because of Trump’s close relationship with Russian President Vladimir Putin, which apparently makes influencing Trump to favor Russian interests less of a concern. As The New York Times puts it, this is a classic intelligence strategy tailored to the specific situation of a president that regularly defies his aides and refuses to follow protocol: China’s effort is a 21st-century version of what officials there have been doing for many decades, which is trying to influence American leaders by cultivating an informal network of prominent businesspeople and academics who can be sold on ideas and policy prescriptions and then carry them to the White House. The difference now is that China, through its eavesdropping on Mr. Trump’s calls, has a far clearer idea of who carries the most influence with the president, and what arguments tend to work.Trump reportedly carries around three iPhones, with only two of them containing National Security Agency protections that would limit the ability for others to intercept communications or otherwise exploit vulnerabilities in the device. Trump’s third iPhone is a standard one no different than any of the millions of devices used by Americans every day, and Trump reportedly uses it to call people because he can store his contacts in it. According to the NYT, it is relatively easy for both the US and foreign governments to intercept communications as they travel between cell towers and satellites, and tapping the phones of foreign leaders is considered a highly effective form of modern spying. Previous leaders, like former President Barack Obama, used modified iPhones that could not make calls or take pictures and that only received incoming messages from a special email address. The devices also often did not contain microphones, while texting was prohibited. Trump, on the other hand, sometimes uses a device with none of those protections whatsoever. Although Trump did eventually give up his insecure Android phone last year, generating headlines about his vulnerable electronic device use, he does not appear to follow standard protocol. The one silver lining here is that Trump does not text or use email, reducing the number of potential attack points for foreign agencies and hackers. Command Line delivers daily updates from the near-future."}