{"id": "One way Twitter’s ad archive improves on Facebook’s", "paragraph": "\n    The Interface is a daily column about the intersection of social media and democracy. Subscribe to the newsletter here.\n  As the midterms approach, a central question has been how campaigns would adapt to the fact their digital ads were now public. Thanks to online archives established this year by Facebook, Google, Twitter, we now have unprecedented visibility into campaigns. But as I’ve noted here a couple times now, advertisers are working hard to make themselves less visible. The tug-of-war between transparency and obscurity is turning out to be one of the defining stories of this election.ProPublica identified a dozen ad campaigns from industry lobbying groups that obscured their true backers.The 12 ad campaigns, for which Facebook received a total of more than $800,000, expose a significant gap in enforcement of its new disclosure policy, and they cast doubt on Chief Operating Officer Sheryl Sandberg’s assurance to the U.S. Senate in September that “you can see who paid for” ads. Adopted this past May in the wake of Russian interference in the 2016 presidential campaign, Facebook’s rules are designed to hinder foreign meddling in elections by verifying that individuals who run ads on its platform have a U.S. mailing address, governmental ID and a Social Security number. But, once this requirement has been met, Facebook doesn’t check whether the advertiser identified in the “paid for by” disclosure has any legal status, enabling U.S. businesses to promote their political agendas secretly.Facebook told reporter Jeremy B. Merrill that it didn’t have the resources to evaluate every submitted advertiser name to evaluate its authenticity.Rob Leathern, Facebook’s director of product management, said Facebook doesn’t try to verify the provenance of every political ad. The lack of a “reliable source to look and see every possible entity name that would be valid, including ‘doing business as’ names,” would make it a herculean task, he said. “We have to rely on the things that we can scalably look at.” Facebook primarily monitors disclaimers for profanity, names of hate groups and “vague or inaccurate” descriptions, as well as URLs (banned because they’re not official names), he said.Notably, Twitter takes a different — and possibly more effective — approach:Twitter verifies advertisers’ names via their Employer Identification Numbers, making it harder for the actual sponsors to hide. For instance, ads from Energy In Depth carried a disclaimer on Twitter — but not on Facebook — that they were paid for by Independent Petroleum Association of America.It’s something for Facebook to consider as its ad archive evolves over time.The flip side of advertiser disclosures is that platforms are asking people to verify their identities in order to post plainly apolitical material. The Atlantic stress-tested the algorithms responsible for determining ads’ political content and found a bunch of mistakes:Most of the ads that Facebook prohibited were for national parks or Veterans Day parades. One prohibited ad advertised a music album that shared a name with a candidate. Facebook prohibited 5 percent of our ads for Veterans Day gatherings. Facebook also prohibited 18 percent of national park ads linking to government websites. When we appealed some these decisions, Facebook’s reviewers reversed them, confirming our belief that they were initially mistakes.Maybe these mistakes aren’t so surprising. Overall, Facebook prohibited 11 percent of our park and parade ads and 1 percent of product ads that included a candidate name, a difference of 10 percentage points. Political ads often mention imagery and values common to many Americans. Machine-learning models designed to detect these political ads could easily learn these features and systematically prohibit information and ideas central to nonpartisan American civic life. Whatever the reason, the company prohibited fewer product ads.I understand it must be annoying to have to send Facebook a post card in order to buy an ad for an event at a national park. And yet also … I can’t really bring myself to care. A few false positives seem more than worth the trade-offs involved here.In their conclusion, the Atlantic authors lay it on thick: “The greatest collateral damage from these protections could be the nonpartisan communities and conversations that divided societies most desperately need.” Facebook is not banning those nonpartisan communities, though. It’s asking them to mail in a postcard.That, I think, democracy can survive.Midterm Election 2018: Tracking Campaign Ads From Health Care to Taxes and JobsSpeaking of ads, Bloomberg has a beautiful data visualization of the subjects of political ads across the country right now, broken down by location and medium.In many parts of the country, candidates and groups supporting them are still appealing to pocket books, focusing their ads on tax cuts and job growth. Elsewhere, politics are still local—topics like public safety, teachers’ salaries and tariffs on crops are all driving the political conversation. In Tennessee, it’s all about praise for President Donald Trump; in Washington D.C., anti-Trump fervor has dominated.Bloomberg News analyzed more than 3 million election ads for 2018 congressional and gubernatorial races to get a sense of the most commonly discussed issue in 210 local television markets, as defined by the Nielsen Company. Across the U.S., 16 different topics are mentioned more than anything else during midterm TV ads.Facebook Allowed Advertisers to Target Users Interested in “White Genocide” — Even in Wake of Pittsburgh MassacreAnd still speaking of ads, because it’s all anyone is speaking about, this isn’t great:Earlier this week, The Intercept was able to select “white genocide conspiracy theory” as a pre-defined “detailed targeting” criterion on the social network to promote two articles to an interest group that Facebook pegged at 168,000 users large and defined as “people who have expressed an interest or like pages related to White genocide conspiracy theory.” The paid promotion was approved by Facebook’s advertising wing. After we contacted the company for comment, Facebook promptly deleted the targeting category, apologized, and said it should have never existed in the first place.Private messages from 81,000 hacked Facebook accounts for saleRussian hackers told the BBC that they have obtained personal information from 120 million accounts. Facebook says that it was not compromised, that the number is likely overstated, and that any data leak is likely the fault of a rogue third-party browser extension. I have no idea what to make of this story:The hackers offered to sell access for 10 cents (8p) per account. However, their advert has since been taken offline.“We have contacted browser-makers to ensure that known malicious extensions are no longer available to download in their stores,” said Facebook executive Guy Rosen. “We have also contacted law enforcement and have worked with local authorities to remove the website that displayed information from Facebook accounts.”Google CEO Pichai Says He’s Still the Boss Amid Employee RevoltsSundar Pichai wants to remind you that, yesterday’s walkout notwithstanding, he is in charge of Google:“We don’t run the company by referendum,” Pichai said at a conference in New York on Thursday. “There are many good things about giving employees a lot of voice, out of that we have done well.“China is making the internet less free, and US tech companies are helpingShannon Liao looks at the connection between internet companies’ embrace of China and yesterday’s Freedom House report about the decline of the free internet:As US companies work to reach China’s nearly 1 billion internet users, the promise of profits seems to outweigh the dwindling of online freedom that it could help accelerate. Hundreds of US internet services in China are already blocked, and the ones that remain available have completely acquiesced to the government. While it’s possible that American companies will be able to grow in China without compromising their values, the experience of many US companies of late proves just how hard, if not impossible, that may be.How Apple News is covering the midtermsWill Oremus looks at Apple’s plans to cover the midterms. Which is an unbelievably weird sentence to type y’all!Launched in June, Apple’s Midterm Elections project is already in full swing. But starting at 8 p.m. ET on Nov. 6, the company will launch a redesigned, election-night version. Midterms news will take over the top of both the app’s main “Today” feed and its “Digest” tab, while also being featured in the widget that appears when you swipe right from the home screen of an iOS device. The section will lead with the latest results based on data from the Associated Press, which will update once a minute without making you refresh the page. And it will pipe in live TV coverage from at least two major networks, along with clips from CNN, Fox News, and others, without requiring users to log in as pay-TV subscribers.Top Apple executives have publicly advocated for the company’s decidedly editorial approach to picking news stories. “We are responsible for what’s in there,” its chief of apps, Roger Rosner, told the New York Times recently. That’s a responsibility from which Facebook and other internet companies have shied, professing to be mere tools for their users to communicate with one another.Peter Thiel says Russian ads on Facebook didn’t help Trump win electionWell that settles that, then! Sorry to have asked. (Oh wait but also this.)Twitter Listed A Trending Topic For “Kill All Jews” After A Brooklyn Synagogue Was VandalizedHere is your reminder for today that it is long past time to retire “trending topics” from social feeds. They are easily gamed, prone to being abused, and platforms refuse to dedicate staff to seeing what keywords are trending until it’s too late.Google’s top Washington lobbyist is leaving roleSusan Molinari, a former Republican congresswoman, will leave the company at the end of the year, David McCabe reports. She’ll retain an advising role:Earlier this year, the company hired GE executive Karan Bhatia to lead its global policy efforts. Bhatia said in an email to policy employees working on the Americas that Molinari “will focus on the critically important goal of strengthening our relationships with key external constituents” and will report to him.Alt-Right and Alt-Social MediaBy now you’ve heard of Gab. But are you familiar with other right-wing social networks, such as Seen.life and Voat? The Digital Forensics Research Lab is here to introduce you:Seen.life is advertised as a “free speech” Facebook alternative. It appears to be a subsidiary of fringe media outlet BeforeItsNews.com, run by Temporal Media Ltd. It’s worth noting that BeforeItsNews.com does not mention their shared ownership in their advertorials for Seen.Life.Alt-right, xenophobic, and Anti-Semitic content is particularly prevalent on Seen.Life. Among the most popular groups on this nascent social networking site is “Rise Against Islam”. It describes itself as a group dedicated to “resolving the [Islam] situation” and calls moderate Muslims to “change their belief system or face the wrath of the countries they are trying to occupy.”Unfold launches a design agency for Instagram StoriesKatharine Schwab profiles Alfonso Cobo, whose app for building Instagram stories has 11 million downloads:That’s where Unfold, an app specifically for Instagram Story templates, is poised to help. Founded in March 2017 by Alfonso Cobo–an architect by training–Unfold began as an app for designers to create portfolios via iPad, before Cobo realized that Instagram Stories were catching on. At the time, “Instagram Stories was really limited in terms of tools and how we could showcase our work in this platform,” Cobo says. “I saw there was a huge potential in Stories.”The Unfold app features seamless UX that lets you build a story out by electing individual page templates from five different series, each with a different aesthetic, and then add photos and text. Once you’ve designed the whole thing, you can download it to your phone, where each page will save as a separate image, easily uploadable to Instagram (or you share directly on the app itself).Snapchat will display polling locations in its Snap Map on Election DayGood on Snap for this:In preparation for the US midterm elections on November 6th, Snapchat is now adding election-themed lenses and filters that will guide voters to their polling locations through its Snap Map on Election Day. According to Engadget, the filters will dress up your Bitmoji in a special costume on your Snap Map.The feature is part of Snapchat’s continued effort to encourage young voters to go to the polls. In September, the app displayed a link to a voter registration page on the profile of every user over 18, resulting in over 400,000 users registering to vote in two weeks.Tencent is launching its own version of Snap SpectaclesHere’s a Snapchat clone I didn’t see coming: China’s Tencent now has its own version of Spectacles. Rita Liao and Jon Russell report:Tencent, which is best known for operating China’s massively popular WeChat messenger, has been an investor in Snap for some time after backing it long before it went public. But, when others have criticized the company and its share price struggled, Tencent doubled down. It snapped up an additional 12 percent stake one year ago and it is said to have offered counsel to Snap CEO Evan Spiegel on product strategy. We don’t know, however, if the two sides’ discussions have ever covered Spectacles and thus inspired this new Tencent take on then.The purpose behind Tencent’s new gadget is implicit in its name. Weishi, which means “micro videos” in Chinese, is also the name of the short-video sharing app that Tencent has been aggressively promoting in recent months to catch up with market dominators TikTok and Kuaishou .Facebook Gives Away AI Tools Used to Improve Video, MessengerThe realm of artificial intelligence is so competitive that the big tech platforms are making many of their tools open source. This week Facebook made available a tool that optimizes elements of video display and notifications:Facebook used this set of tools internally to optimize how 360-degree videos are displayed on the social network, taking into account such factors as the available bandwidth and how much of the video has already been buffered. The same tools, according to the blog post, were also used to improve what content to push to users through notifications. And it was used to hone the suggestions that its intelligence assistant, which is called M, makes to users of its Messenger app.The Horizon software is focused on reinforcement learning, in which software improves itself by trial-and-error from experience to maximize some reward or minimize some loss, rather than from labeled data sets.Political Reality: Buy Ads on Facebook or Risk Losing the ElectionChristopher Mims notes that even the politicians who have questioned Facebook most sternly generally still buy ads there:That few politicians feel they can escape the necessity of advertising on Facebook is precisely why we need to contemplate its ever-growing scale, revenue and power. The ramp-up in political spending across Facebook’s social networks, which also include Instagram, is breathtaking: In 2014, digital ad spending was 1% of all political ad spending. Now it’s 22%, or about $1.9 billion, according to the nonpartisan Center for Responsive Politics. Facebook says that politicians have spent nearly $300 million in the U.S. on Facebook ads since May. As of Oct. 30, Democrats were outspending Republicans on Facebook 3 to 1.Politicians who want to reach the same voters their competitors are reaching on Facebook have little choice but to go there, too. That’s despite mounting criticism that Facebook’s algorithms are actually driving increased political polarization and concerns that the site serves as a vector for influence campaigns by Russia and now Iran. Facebook, a driver of our fractious political debate, can be seen as profiting from the fallout.Nothing is more terrifying than this Slack spoofMegan Farrokhmanesh has a fun roundup of the week’s best memes, which includes several Halloween costumes you should go out of your way to see. Slack man is my favorite:1 new message pic.twitter.com/H09WcuYYoJMay all your notifications be silent this weekend.Send me your tips, comments, questions, and weekend plans: casey@theverge.com.Command Line delivers daily updates from the near-future."}