{"id": "Remembering Grim Fandango: this week in tech, 20 years agoHomer’s Smarter Brain“Kill your enemies. Kill your friends’ enemies. Kill your friends.”“Literally Bruce Willis with a machine gun on a skateboard”A strike in the MP3 warsThe book that launched a war on bioterror", "paragraph": "You can find a lot of Halloween-themed coverage on The Verge, but this week also marked the Mexican holiday Día de Muertos — and the 20th anniversary of Grim Fandango, the classic adventure game that was heavily inspired by it. Grim Fandango was one of the last games from the acclaimed studio LucasArts, and its clever blend of noir pastiche and folklore has earned it acclaim since the very beginning, when GameSpot praised its “great writing and beautiful art direction.”There’s a less-than-proud tradition of artists ripping off surface-level Día de Muertos imagery, an issue game director Tim Schafer has discussed: “I knew I was appropriating someone else’s culture, so the idea was to be as authentic as possible and do as much research as possible,” he told the Los Angeles Times in 2015. But Grim Fandango is a distinctive piece of art, full of puzzles that have (mostly) held up well. It was released on the Nintendo Switch just this week — and if you decide to play it, here are five other stories to check out while it’s downloading.As a person who covers day-to-day technology news, I often wonder how my writing might come off to someone in the future — and whether anyone will even be reading it. I can’t answer those questions, but I can do the next best thing: look back at what other people were writing 20 years ago.Here are five stories — big and small — that science and tech enthusiasts might have checked out in the week before November 3rd, 1998.What do Intel, The X-Files, and The Simpsons have in common? All three became iconic in the ‘90s, and all three were featured in this Adweek article about “Homer’s Smart Brain,” a commercial in which Homer Simpson has his brain replaced — or at least, supplemented — with an Intel Pentium II processor. The ad aired during the X-Files’ sixth season premiere, and it was designed to “educate [Intel’s] consumer audience about what role the processor plays in their PC and the value of it.”For what it’s worth, the 2nd Generation Pentium II processor topped out around 450MHz, and the 2018 Intel Pentium Gold G5600 (one of the company’s cheaper processors) runs at 3.90GHz. So if a Pentium II could turn Homer from a bumbling schlub to a college professor in two weeks, a modern Intel chip would have to make him some kind of god.Did you know you can play video games... against other humans... on the internet? It’s the year 2018, where every celebrity has an e-sports team, so the answer is probably “yes.” But The New York Times was on this trend 20 years ago, when the state of the art was games like Bungie’s Myth: The Fallen Lords or Origin’s Ultima Online. “The novelty is that you are not playing yourself in a dark corner of a room somewhere, but you are interacting with actual people,” explained Myth player Daniel Shiffman, who is now a professor at NYU’s Tisch School of the Arts.The Times article is a worthwhile look back at the state of ‘90s internet gaming, which grew symbiotically with portals like AOL. As a companion piece chronicles, however, navigating web and gaming portals was every bit as miserable as dealing with modern video game DRM and service updates — and you had to do it over a dial-up modem.But you didn’t need a fancy modem to play one of the year’s oddest games: Apocalypse, a third-person shooter / platformer about Bruce Willis averting the apocalypse. Willis originally lent his voice (and face) to an AI sidekick, but after Apocalypse fell into development hell, studio Neversoft salvaged it by making him the protagonist — albeit one who constantly quips to an invisible partner, since the dialog was apparently already recorded. GamePro enthusiastically previewed the game in its October 1998 issue, and on October 30th, it was given a holiday launch date. IGN ultimately declared the final product “a lot of fun, and ... entirely engaging for a few hours or so.”As a Eurogamer feature chronicles, Apocalypse’s greatest legacy is actually the incredibly successful Tony Hawk series of skateboarding games, which Neversoft built on Apocalypse’s game engine. In fact, the first prototypes reused Willis’ character model — so as level designer Aaron Cammarata puts it, “the main character was literally Bruce Willis with a machine gun on a skateboard.”If you were more into music than video games, this was also a pretty good week. The Recording Industry Association of America had filed to stop production of the Diamond Rio, an early MP3 player that the RIAA claimed promoted piracy. In late October, however, a judge denied its request for a permanent injunction, allowing Diamond Multimedia Systems to ship the Rio in November. Diamond’s legal luck continued, and in 1999, a US appeals court declared that MP3 players didn’t violate unauthorized recording laws.The Rio only held 60 minutes of music, and like most early MP3 players, it couldn’t stand up to Apple’s iPod — the last Rios were produced in 2005. But its legal battle had established that consumers could copy music files from a computer to a music player. As Motherboard put it last year, it’s arguably the MP3 player that made MP3 players possible, at least in the US.Finally, for book lovers, an MIT Technology Review story examined President Bill Clinton’s fascination with The Cobra Event, a 1997 novel about a biological weapon that causes victims to cannibalize themselves. The novel (written by Richard Preston, better known for his nonfiction book The Hot Zone) reportedly alarmed Clinton so much that he immediately asked the FBI to investigate its plausibility. And in 1998, he proposed a $300 million budget line for fighting bioterrorism, including $51 million to stockpile vaccines.Technology Review author Stephen S. Hall was deeply skeptical of “merchants of fear” who inflated the relatively small possibility of a deadly, large-scale bioterror attack. But after Clinton left office, bioterrorism became a far more pressing threat, in the wake of several anthrax attacks in 2001. To date, the worst American bioterrorism attack is still the Rajneesh cult’s decidedly non-futuristic 1984 poisoning of a salad bar in Oregon — which was recounted in Netflix’s documentary Wild Wild Country earlier this year.Command Line delivers daily updates from the near-future."}