{"id": "Why Guillermo del Toro’s attention to detail makes his movie monsters stand out ", "paragraph": "Guillermo del Toro is behind some of cinema’s most inventive and visually-pleasing genre films in recent years — Pan’s Labyrinth, Pacific Rim, Hellboy, and The Shape of Water all enjoy stunning costume and set design that complement their stories and which stand out from the rest of what you might see in theaters. A new video from YouTuber Kristian Williams, (aka kaptainkristian) explores why the filmmaker’s movie monsters are so memorable, especially in an age when CGI is so prevalent. A key reason for why del Toro’s films are so memorable is the attention to detail and effort put into the design of his characters, and how they interact with their surroundings. In Pan’s Labyrinth, Williams notes that the faun complements his surroundings, and vice-versa — when he’s introduced, he’s part of the landscape. He’s a central part of the story, not just because he’s important to the narrative, but because he feels like he belongs there. del Toro goes on to say that when he creates a character, he has to make sure that the character’s design, wardrobe, production design, and color and lighting all work together to bring that character to life. But good design is only part of the story: the performance of actor Doug Jones — who has played many of the fantastical creatures in del Toro’s films — is also critical. Williams notes that while he’s covered under prosthetics — and some visual effects — those features augment Jones’ performance in any given film, bringing a new level of believability to the character. All of that comes together to produce movie monsters that “feel alive” — not just for the performers acting out the scene, but for the audience as well. “Their significance is in more than just their presence —it’s what they represent” in the story, something that del Toro describes as “eye protein,” rather than “eye candy.”\n    Related\n  Command Line delivers daily updates from the near-future."}