{"id": "Waymo gets the green light to test fully driverless cars in California", "paragraph": "Waymo, the self-driving unit of Google parent Alphabet, has been granted permission to operate fully driverless cars without human drivers behind the steering wheel on public roads in California. The company is the first to receive a driverless permit in the state. Waymo will restrict its driverless test cars to the neighborhoods of Mountain View, Sunnyvale, Los Altos, Los Altos Hills, and Palo Alto. “We know this area well,” the company said in a statement, noting it includes its own headquarters (housed within Google’s X lab) as well as Alphabet’s main campus. If it seeks to expand its testing, Waymo says it will notify the new communities first and obtain permission from the DMV. Waymo’s permit includes day and night testing on city streets, rural roads, and highways with posted speed limits of up to 65 mph. “Our vehicles can safely handle fog and light rain, and testing in those conditions is included in our permit,” the company says. “We will gradually begin driverless testing on city streets in a limited territory and, over time, expand the area that we drive in as we gain confidence and experience to expand.”Waymo won’t offer rides to the public right off the bat; the company is close to launching its first commercial taxi service using its fleet of autonomous minivans in Phoenix, Arizona. “Eventually, we’ll create opportunities for members of the public to experience this technology, as we’ve done in Arizona with our early rider program,” Waymo says.California began accepting applications for fully driverless testing permits on April 2nd after a rule change opened the door for companies wishing to test their autonomous vehicles on public roads. Among the many provisions, the new rules would allow autonomous cars without steering wheels, foot pedals, mirrors, and human drivers behind the wheel to be tested on its roads.“California has been working toward this milestone for several years, and we will continue to keep the public’s safety in mind as this technology evolves,” said California DMV director Jean Shiomoto in a statement. California is an obvious hotbed for autonomous vehicle testing, so changes made to the state’s rules governing these tests are followed closely by companies like General Motors, Waymo, and Uber that are developing fleets of self-driving cars for public use. There are currently 60 companies testing nearly 300 autonomous vehicles that are licensed with the DMV, officials said.Driverless testing permit holders must also report any collisions involving a driverless test vehicle to the DMV within 10 days and submit an annual report of disengagements. Arizona, which is the only state that allows Waymo to operate fully driverless vehicles, requires no such disclosures. Command Line delivers daily updates from the near-future."}