{"id": "Saudi Arabia reportedly groomed Twitter employee to spy on user accounts ", "paragraph": "On Saturday, The New York Times published a report detailing Saudi Arabia’s efforts to combat dissent on platforms like Twitter, such as slain US journalist Jamal Khashoggi, who was subjected to intense and personal attacks online before his death. As part of those efforts, the kingdom’s reportedly worked to groom a Twitter employee to spy on user accounts. According to the Times, western intelligence officials contacted the social media company, saying that the Saudi government was “grooming” one of its employees, Ali Alzabarah, “to spy on the accounts of dissidents and others.” Alzabarah worked at Twitter beginning in 2013 as an engineer with access to user accounts, and was convinced by Saudi intelligence officials to look into several accounts. Once alerted, Twitter reportedly placed Alzabarah on administrative leave while an investigation took place, and while “they could not find evidence that he had handed over Twitter data to the Saudi government,” he was fired at the end of 2015. The company then notified a “few dozen accounts” that they might have been targeted. Following his dismissal, Alzabarah returned to Saudi Arabia. Reached for comment, a Twitter spokesperson said that the company has “nothing to add at this time.” The Times says that among the accounts that were notified belonged to security researchers, academics, and journalists, including individuals who worked for the Tor project. Prior to his death, Khashoggi was involved in launching a project designed to combat online abuse. The report doesn’t say if Khashoggi’s accounts was one of the ones viewed by Alzabarah, but it does say that he had been subjected to attacks from the troll farms set up by the Saudi government to silence critics. The group was led by one of Crown Prince Mohammed bin Salman’s advisors, Saud al-Qahtani, who was fired recently from his post after the country admitted that Khashoggi had been killed in the Saudi’s Turkish consulate. According to the Times, the group used group chats in messaging apps to distribute lists of people to harass, topics to monitor, and to issue pro-government messaging across multiple sock-puppet accounts. The group focused on topics like the war in Yemen and women’s rights in the country, mass-reporting tweets to get Twitter to hide tweets by the people they were targeting. On Thursday, NBC News reported that Twitter suspended a botnet account that was used to push out pro-Saudi propaganda in the wake of Khashoggi’s death, and that this particular network, created between 2011 and 2017, used sophisticated tactics to avoid detection after the company implemented new rules to combat the use of such automated accounts. Command Line delivers daily updates from the near-future."}