{"id": "Alphabet executive named in NYT sexual misconduct exposé resigns", "paragraph": "An executive at Google parent company Alphabet’s X division has resigned after being named in a high-profile New York Times investigation into the company’s mishandling of sexual harassment claims, according to Axios. The executive, Rich DeVaul, held the title of “Director of Rapid Evaluation and Mad Science” at X, formerly known as Google X and the division responsible for Alphabet’s experimental “moonshots” projects like self-driving car unit Waymo and the Google Glass wearable headset. He did not receive an exit package of any sort, Axios reports. The initial investigation primarily centered on Android co-founder Andy Rubin, who an employee accused of sexual assault in 2013. After Google investigated the claims and found them to be credible, Rubin left the company, but not before being awarded a $90 million exit package. Alphabet CEO Larry Page, who was aware of the allegations and the investigation’s findings, did not disclose publicly Rubin’s reason for leaving, saying in a statement at the time, “I want to wish Andy all the best with what’s next.” Prior to the Times investigation, it was known that Rubin had been accused of some form of sexual harassment, but the nature of the allegation and his exit package from Google were not known. Rubin has gone on to found Android phone maker Essential, which recently cut 30 percent of its work force and has cancelled plans to release a second-generation Essential Phone. Rubin has denied the claims, writing in a tweet that the Times story contained “numerous inaccuracies about my employment at Google and wild exaggerations about my compensation.” He went on to say, “These false allegations are part of a smear campaign to disparage me during a divorce and custody battle. Also, I am deeply troubled that anonymous Google executives are commenting about my personnel file and misrepresenting the facts.”In the Times story, DeVaul allegedly invited hardware engineer Star Simpson, who was interviewing to work at Google, to the art and culture festival Burning Man, telling her he and his wife were polyamorous. Simpson attended the festival in hopes it would improve her chances of getting hired — she brought her mother with her and “professional attire,” according to the Times. Yet DeVaul encouraged her to remove her clothing and asked to give her a massage.Later on, Simpson learned that she did not get the job, and that DeVaul knew this when she chose to attend Burning Man. Simpson says she informed Google of this series of events two years later and was encouraged not to go public with it because “appropriate action” would be taken, yet DeVaul remained at the company. In a statement to the Times, DeVAul apologized for his “error of judgment” and claimed he thought Simpson had been aware that she did not get the job when she attended the festival. DeVaul has been an employee of Alphabet since August 2011, when he joined the X lab’s Project Loon, an initiative to deliver wireless internet using high-altitude balloons, as a chief technical architect. DeVaul assumed his role at X two years later and remained in that position since. He left the company earlier today, Axios reports. Alphabet was not immediately available for comment. In response to the initial Rubin story, Google CEO Sundar Pichai issued a statement last week saying the company had instituted a new program in 2015 to combat sexual harassment in the workplace. He said that the program, alongside improvements to its reporting policy and more hardline approaches to punishment, have resulted in 48 employees being fired for sexual harassment-related offenses in the last two years. “We are dead serious about making sure we provide a safe and inclusive workplace. We want to assure you that we review every single complaint about sexual harassment or inappropriate conduct, we investigate and we take action,” Pichai wrote. “We are committed to ensuring that Google is a workplace where you can feel safe to do your best work, and where there are serious consequences for anyone who behaves inappropriately.”Despite Pichai’s assurances, Google employees have reportedly been incensed by the Rubin revelations and at the company’s handling of such claims. Yesterday, BuzzFeed reported that hundreds of employees are planning a walkout to protest Google’s protection of high-profile male executives accused of sexual harassment.  Confirming: the Google Walkout is real and deeply inspiring. Hundreds of people are demanding structural change, not just inclusive sounding PR“Personally, I’m furious,” a Google employee told BuzzFeed,  requesting anonymity. “I feel like there’s a pattern of powerful men getting away with awful behavior towards women at Google‚ or if they don’t get away with it, they get a slap on the wrist, or they get sent away with a golden parachute, like Andy Rubin. And it’s a leadership of mostly men making the decisions about what kind of consequences to give, or not give.” The walkout is scheduled to take place tomorrow, and more than 200 people are confirmed to attend. Update 10/30, 7:40PM ET: Added more context around Google’s response to the NYT investigation and reported plans for an employee walkout scheduled for Thursday, November 1st. Update 10/30, 7:49PM ET: Clarified that DeVaul was not fired, but resigned from the company. The headline has been updated to reflect this fact. Command Line delivers daily updates from the near-future."}