{"id": "Steven Yeun on Burning, The Walking Dead, and changing roles for Asian-Americans", "paragraph": "For fans of The Walking Dead, Steven Yeun is a familiar face — he played fan-favorite character Glenn Rhee over the course of six years and seven seasons of the show, in the process earning a fandom and rapidly kickstarting a widely varying acting career. Asian-American actors often struggle to find roles that don’t fall into simple, predictable stereotypes, but Yeun has kept things complicated, playing a conflicted animal-rights activist in Bong Joon-ho’s Netflix weird fable Okja, a confident union agitator in Boots Riley’s Sorry to Bother You, and lone-wolf pilot Keith in the animated series Voltron: Legendary Defender.Yeun’s latest film, Burning, adapts the 1992 Haruki Murakami story “Barn Burning,” about an awkward Japanese outsider who makes a brief connection with a wealthy, urbane, expressive man who claims he enjoys burning down barns. The film version, directed by Lee Chang-dong, shifts the action to Korea, replaces the barns with dilapidated abandoned greenhouses, and draws out the brief story into a moody mystery that closely resembles the Dutch thriller The Vanishing. Ah-In Yoo stars as Jong-su, the quiet, ineffectual young man obsessed with his former classmade Hae-mi (Jong-seo Jeon). Yeun plays Ben, the sophisticate who dates Hae-mi and accepts Jong-su as a compatriot and confident. Lee’s film plays out slowly, revealing Ben’s secrets and giving Jong-su time to develop from a cipher into a driven amateur detective dogging Ben’s footsteps.The film captures the melancholy and discomfort of so much of Murakami’s work, but for Yeun, it’s also a reminder of how Asian-American actors can often get more varied and elaborate roles by working overseas. Burning is his first Korean-language film. I sat down with him at Austin’s Fantastic Fest to discuss how working in a different language changed his dynamic, what he learned from his time on The Walking Dead, and how he hopes the current “anomaly” of roles for actors like him can become a movement.This interview has been edited for clarity and brevity.Has Lee Chang-dong ever indicated why Burning focuses on greenhouse arson instead of barns?Oh! In Korea, there are no barns. Or, they exist, there just aren’t a plethora of them. What exists more are these dirty vinyl greenhouses that a lot of farms put up, and sometimes they abandon them. That’s the more analogous Korean version of abandoned barns.So right in the title of the original Murakami story is something that doesn’t translate culturally. What did you see as more universal about the narrative?I remember Director Lee talking about how he was drawn to the material as an interesting exploration of a mystery. He was tackling a lot of specific themes, but overall, it was just the mysteriousness of life in general. And then also what it’s like to be young in this age. For me, I trusted intrinsically in his mind and talent. And when I read the script, it was a character that I thought, “This is fascinating, I’d love to explore this. And I probably won’t be able to in America. I don’t know if I’ll be afforded the chance to play something like this.” I don’t think Asian-American actors are being offered stuff like this. But that seems to be changing.The success of Crazy Rich Asians has been seen as a possible precedent that could change casting opportunities for Asian-Americans. It’s too soon to track that change on a larger scale, but have you gotten any unusual reach-outs since the film came out?I don’t know, I don’t have any specific metrics on what is happening. I think the market reacts — money follows money. That movie opened up a lot of careers for Asian-Americans who haven’t been seen in America before, which increases the talent pool. It’s just bits and pieces as we go. Sometimes we unfortunately try to conflate multiple different movements together, but for this Asian-American movement, I think we’re headed in the right direction. We just have to take steps to widen the pool of talent. My particular outlook on life and work is just do stuff that means something to me, to try to avoid labels. I think it took Director Lee a leap of faith to cast me in this, and that was what drew me.You’ve had a fairly diverse career, though. Your résumé doesn’t look like a checklist of stereotypes.Sometimes it feels that way, and then you realize a lot of these things were aimed at me. Okja was Director Bong writing something for me. Sorry To Bother You was Boots Riley calling me because he wanted me to play that role. Burning was also effectively someone thinking of me and putting me into the role. So those three things, I felt very lucky to be a part of. The things I’ve had to say no to don’t look like those three films. And two of those films are Korean, so there, I’m not limited by what I look like. They just see me as an actor. You know, sometimes we just make things that are easy to digest. That’s a lot of what’s out there, and those are a lot of the things I have to say no to. Instead, I’m fortunate enough to be here, and be part of things that are beyond those ideas.What had Boots Riley seen you in that made him seek you out for Sorry to Bother You?I have no idea! But I thank him for casting me in it, because it was a really wonderful experience to dive into that world, and be part of something as beautiful as that, with the type of talent that was in it. I don’t take my luck for granted, that’s for sure. Burning was your first Korean-language film. How was that experience?One of the film’s challenges was definitely the language. My Korean is… fine, but it’s not the level that Ben speaks. Also, my reading is bad. So there were different ways I had to memorize the script, and then I had to understand the words specifically within a Korean context, so it took a lot of study of tone, intonation, inflection, and leaving my own natural thing in it. What was really strange was, when I said yes to the project, when Director Lee said yes to me, for some reason I wasn’t scared. In hindsight, I should have been. In hindsight, this looks like a very difficult task. But when I was there, there was just something about Director Lee’s assuredness that it was like, “The only way this is getting made is if you just 100 percent believe it’s going to happen.” And somehow we’re here.It seems like language would be a particular challenge in playing Ben because he’s so clearly conveying that he’s from a specific social class, that he’s educated and sophisticated, but also extremely comfortable in his skin. How did you discuss that aspect of the performance?Language was a little bit of a separate piece than the philosophy of him, but we spoke a lot about the philosophy of him. Not like, “What does he think about the ubermensch?” but more like “How many times has he been around this circle?” We just had a shorthand of understanding maybe the outlook and view Ben might approach the world with. In some sad way, he’s actually the most present person in the film. He’s 100 percent there, just present, and he’s bored with [society], because that’s how vacuous we’ve made it. That’s what I love about the layer of commentary Director Lee brought to a story about youth, to say, “What realities are we living in? How many masks do we have on? How many versions of ourselves do we have? Are we real, are we not?” Is Ben bored because he’s off in his own bored land, or because he’s super-present, and what he’s present for is not fun at all? It’s fabulous. There’s a key moment where it seems like he experiences a moment of connection, or satisfaction, even gratitude. How did you discuss that moment with Director Lee?We discussed a lot of things. I definitely don’t want to give it away. One thing Director Lee said was, “Only you know.” So… only I know! How do you go about playing a scene where you’re keeping secrets from the audience, and even from the other person in the scene?I guess by just playing it as real as possible, and just not saying it. Director Lee is great at making his films really solid reflections of the world as he sees it. Sometimes people walk out of one of his films, and they hated it. Or maybe they loved it. Or maybe it disturbed them. That’s always been my connection to him — how he turns the film inward onto me, and that’s what I’m left with. Not just with Burning, with all his films. Peppermint Candy struck me, as a young Korean-American kid who could never really understand why he might have this pent-up rage that’s part of his life. You watch Peppermint Candy and think, “Oh, I see.”So watching his films helped you navigate your own emotional terrain? Did you talk to him about that?He knows. Like, we don’t have to talk about it. He’s like, “I know, I see it.”Is there anything in this film that you think will have that place in younger people’s lives, where they’ll see themselves in it?One thing that’s a theme for me is that everybody’s lonely. Everybody’s looking for something, or someone, or some happenstance to pull them out of their loop. Everybody’s burning for something, as corny as that might be. When you look at the three central characters, they’re all waiting for somebody to come change them.That loneliness and alienation is such a theme of Haruki Murakami’s. Are you a fan?Yeah, I’ve read a lot of Murakami, and Director Lee and I talked a lot about Murakami. And then we also talked a lot about William Faulkner. I would say, Director Lee more closely identifies with Faulkner. He comes from more of a humble background, working class, so it’s kind of that delineation between nouveau riche and working man that’s also a layer within the film. That’s not even intrinsically in Murakami’s short story. I think that was an effective way to adapt a Murakami tale — it’s almost like Murakami requires you to talk about him, within his own film, about his story. You need to know the disposition of the man it’s coming from, for the voice to effectively work. Otherwise, it’s too insular and singular.Murakami always has an eerie, ominous feel at the end of his novels. You finish it, and you’re like, “I feel accomplished for finishing that, but I’m not sure what to make of it. It’s leaving me with something.” And I think that’s something Director Lee knows all about, and it was a perfect marriage. Everything he does is purposeful. He’s a novelist himself. He started making films when he’s 40. So watching a master break down and re-craft a story was pretty cool.Is it helpful to you to your process, to hang out with a creator and talk about life?It’s very helpful for me. My approach is rooted in a base of outlook and philosophy, and then it extrapolates out to physical behavior. I really enjoy those types of conversations.Is that something you’ve gotten on many of your projects?Yeah, I would say all of them, except for The Walking Dead. Not because I couldn’t get it there. But I don’t think I was aware enough to ask for it at 25. When I got on the show, I was just like, “What the hell is going on?” And then when I was finished, that’s when I came to a realization of what I’d learned. I had a wonderful experience, but then I was like, “This was an experience, and now you’re done, so now what are you?” When I reset from there, I had to answer some questions I didn’t have to answer while I was there.What else about The Walking Dead was useful for your later career?It taught me professionalism at a level that — I admired watching Andy Lincoln. That guy’s the president of the universe. He’s the classiest dude, and a family man, he knows what’s important, he’s wise, hardworking. And you’re like, “Okay, like that guy did it.” Jon [Bernthal], same way. Norman [Reedus], same way. Jeff DeMunn, all these incredible, incredible people. Scott Wilson! He knows, he knows what’s up, and I got to act with him somehow, fresh out of comedy school! It was awesome.Are you actively seeking out more Korean drama at this point?No, getting to work with Director Bong and Director Lee, I was just lucky enough that I could fit within their parameters. So I feel very fortunate. It’s not that I don’t want to do Korean things. I just want to do a project that makes sense. There are a lot of brilliant directors everywhere, and I’m excited for the future. I don’t know how fast that will come, but I’m excited that I can be a part of the change that’s happening. I feel like this is an anomaly right now, and I feel fortunate that I get to be part of an anomaly, like a weird mutation that happened for a second. I feel very privileged to be in this position, for sure.Command Line delivers daily updates from the near-future."}