{"id": "Twitter removes thousands of bot accounts discouraging Democrats from voting in the midterms", "paragraph": "Ahead of the US midterm elections next Tuesday, Twitter is hard at work scrubbing its platform of thousands of fake accounts and coordinated activity seemingly designed to influence voter turnout, according to a report from Reuters today. The report says Twitter has removed around 10,000 such accounts targeting Democratic voters and masquerading as party members and officials, and it continues to monitor its platform for similar activity. Twitter confirmed to The Verge that it has been removing these accounts throughout September and October, but the company did not confirm the 10,000-account figure. The tweets were first brought Twitter’s attention by the Democratic Congressional Campaign Committee (DNCC), Reuters reports. The DNCC has increased its efforts to detect and shut down such behavior on social platforms following the widespread Russian influence campaign that aided President Donald Trump and sought to harm Democratic presidential nominee Hillary Clinton. “For the election this year we have established open lines of communication and direct, easy escalation paths for state election officials, DHS, and campaign organizations from both major parties,” a Twitter representative said in a statement. “We removed a series of accounts for engaging in attempts to share disinformation in an automated fashion — a violation of our policies. We stopped this quickly and at its source.”Twitter too has been amplifying its efforts to combat bots, misinformation, and election interference of late, as activity on the social networking platform has intensified ahead of the midterms. Earlier this week, Twitter added a function to its reporting process that lets users specific when they think a specific tweet has been sent out by a bot account. The company also said back in July that it had suspended more than 70 million accounts in May and June alone, and that it was removing up to 1 million additional accounts per day that were violating rules around misinformation, propaganda, and other forms of coordinated activity that may be used as election interference tools. Command Line delivers daily updates from the near-future."}