{"id": "Facebook-linked PR firm Definers pushed criticism of Apple, Google, and Bird", "paragraph": "As Facebook reels from a bombshell New York Times report published this week, much of the focus has been on a controversial public relations firm hired by the company. Definers Public Affairs, a DC organization, pressed reporters with information favorable to Facebook, including by linking liberal billionaire George Soros to the funding of anti-Facebook activities.Since the report was published, a fuller scope of the group’s activities has been established.  The group also pitched reporters on negative articles about other tech companies: the Times and Business Insider have noted that the firm sought to portray Google and Apple in a negative light, and similar emails were also received by The Verge. According to CNN, one pitch about Apple attempted to question whether there may be a liberal bias in Apple News. The firm also pitched The Verge on a negative story about scooter company Bird, encouraging a reporter to question the number of cities the company was operating in at the time. So far, there’s little information about which tech companies may have retained the group’s services. In addition to Facebook, NBC News reports that Qualcomm, which has been embroiled in legal fights with Apple, may have been a client. (Qualcomm did not respond to a request for comment.) The firm has also worked with Bird scooter rival Lime, according to emails sent to The Verge. (Lime declined to comment.)“Our public relations professionals worked with Facebook and the media to help the company roll-out policy announcements regarding platform changes, policy initiatives, and company news,” Definers said in a statement today. “This included work on advertising and hate speech policies, addressing bias on the platform, and their efforts to crack down on inauthentic behavior on the platform.”Mark Zuckerberg said this week that he was unaware of Definers’ activities, but the company has severed ties with the group. The firm is also facing pushback from lawmakers, who were also reportedly discussed in pitches to reporters. The Times reported yesterday that the firm circulated information about tracking on senators’ websites, suggesting they might be hypocritical for going after Facebook. “This is pretty disturbing,” Sen. Mark Warner said in a tweet. “At the same time that Facebook was publicly professing their desire to work with the Intel committee, they were paying a political opposition research firm to privately attempt to undermine the committee’s credibility.” Command Line delivers daily updates from the near-future."}