{"id": "Motorola’s notched Android One smartphone is coming to the US for $399", "paragraph": "Motorola today announced that it’s bringing the Motorola One to the United States a few months after the Android One phone launched internationally. It will be available exclusively from Best Buy for $399; you’ll be able to order it online (in black) beginning November 9th or find it in stores (in white) as of November 11th. The One is sold as a GSM-unlocked device, so it’ll work on AT&T and T-Mobile, but not Verizon or Sprint. The Motorola One has a look that’s very similar to Apple’s iPhone X, featuring a notched 5.9-inch display (720x1520). The device’s “chin” is big enough for Moto to stamp its logo on. The rest of the One’s spec sheet is also on the mid-range side: you get a Qualcomm 625 processor, 64GB storage (with microSD), 4GB RAM, a 13-megapixel camera, and an 8-megapixel selfie cam. Its battery is 3,000mAh and the phone has a nano-coating to protect against spills or rain. And there’s a headphone jack! No wireless charging at this price, though.  The fact that the Motorola One runs Android One means buyers are guaranteed a steady, consistent road forward for updates. Motorola says the device, which ships running Android 8.1 Oreo, will be updated to Android 9 Pie and eventually Android Q. Equally as important, the phone is guaranteed security updates for three years. Motorola’s software experience is already very close to stock Android, and some of the company’s signature tweaks and shortcuts are also included on the One. Unfortunately, today’s Motorola announcement makes no mention of the larger Motorola One Power coming stateside. The One Power has a 6.2-inch screen, slightly more powerful Snapdragon chip, upgraded cameras, and a much bigger 5,000mAh battery. It also replaces the glass back with metal. For now, that One remains exclusive to India. At $399, the Motorola One’s main competition is... well, other Motorola phones. Command Line delivers daily updates from the near-future."}