{"id": "The first Bird Box trailer makes it look like the opposite of A Quiet Place", "paragraph": "Back in 2014, The High Strung frontman Josh Malerman wrote his debut novel, Bird Box — a chilling post-apocalyptic movie about a young mother trying to get her two children to safety in a world overrun with monsters. The book’s big hook: no one actually knows what those monsters looks like, because anyone who sees them immediately loses their mind and kills themselves, often in spectacular, horrific fashion. So the survivors protect themselves by wearing blindfolds — which limits their movement, leaves them open to all sorts of other dangers, and makes every stray sound into an unknown threat.Bird Box is a relatively quiet, spooky novel, the kind of literary fiction that’s perfect reading for a windy October night leading up to Halloween. But Netflix has adapted it into a film, and judging from the trailer, it looks a lot more explosive and scream-filled than the source material.Sandra Bullock stars as Malorie, the mother trying to survive the threat. She’s joined in the cast by John Malkovich, Sarah Paulson, BD Wong, Jacki Weaver, and Rosa Salazar, among many others. Malerman’s novel mostly takes place years later, focusing on how Malorie and her unnamed children navigate their mostly empty world, and the constant temptation to look around in it. But the trailer focuses much more on the lead-up to the monsterpocalypse, which helps explain the extensive cast.The book feels like something of a companion piece to John Krasinski’s recent thriller A Quiet Place, about a family trying to survive in a world overrun by monsters who hunt by sound. Netflix’s Bird Box looks like a similar story, but with one major difference — the characters can make all the noise they want (and certainly frequently do), as long as they keep themselves blinded. Both stories are unnerving for the same reason — they suggest immediate, fatal punishments for everyday actions like speaking to someone, or looking at them.Bird Box is due to arrive on Netflix on December 21st. It’ll also have a limited theatrical run at the same time, a sign that Netflix wants the film to qualify for industry awards like the Oscars and Golden Globes. That may seem odd for a horror movie about unseen monsters, but A Quiet Place has been getting some early Oscar buzz for its central performances. And Bird Box director Susanne Bier is a celebrated filmmaker whose 2010 Danish feature In a Better World won the Best Foreign Language Oscar, and who won a Primetime Emmy for her miniseries The Night Manager, based on the John Le Carré novel, and starring Marvel Cinematic Universe regular Tom Hiddleston. Her presence alone suggests that Bird Box is a more prestigious and ambitious feature than the low-rent horror films that are a lot more common on Netflix. It seemed like a difficult book to adapt to a visual medium, given how much it focuses on characters who can’t let themselves see anything. But Bier certainly seems to have a handle on the look of this world, and the way people interact with it. Command Line delivers daily updates from the near-future."}