{"id": "Pimax opens preorders for its very expensive 8K and 5K VR headsets", "paragraph": "Pimax has begun taking preorders for its 8K and 5K+ VR headsets. The 8K model will cost $899 for just the headset — no SteamVR controllers or base station included — and the 5K+ model is $699 with the same lack of pack-ins. For comparison, HTC’s Vive Pro retails for $799 if you’re only buying the headset or $1,400 in a package that includes everything but the PC to plug it into. Pimax’s website is down at press time, so preorders are down until that’s resolved. But Pimax has managed to stir a lot of excitement with the expanded 200-degree field of view and reduced screen door effect that its headsets offer. Gaining peripheral vision inside virtual reality is extremely cool, as my colleague Nick Statt discovered. The company raised over $4.2 million on Kickstarter in the run-up to this commercial launch. Those backers will receive their units first before preorder shipments make their way to everyone else. And compared to the preorder prices, they certainly got a deal. The $900 8K headset is double the price of the early bird backing rate. After a string of delays — shocking for a Kickstarter product, I know — the first 8K headsets have started arriving to backers. Here are one person’s first-day impressions. There’s no ETA for when preorders will ship; Pimax seems to be using this as a way to gauge interest. With more predictable and accurate numbers of orders, Pimax can better forecast and plan the resources and production cycle, make the lead time shorter, and request the vendors to prepare resources in a more planned and efficient manner.The Pimax 8K features dual 4K displays — each with a resolution of 3840 x 2160 — and upscales its content from 2560 x 1440, according to VentureBeat. Its refresh rate tops out at 80Hz; the 5K+ does a little better at 90Hz. The 5K has two 2560 x 1440 screens that display content at a native resolution. (The $999 5K Business Edition uses OLEDs.) But one potential hurdle that buyers face is the GPU power demanded by these headsets. Tom’s Hardware recently took a fairly comprehensive look at a preproduction Pimax 5K+ and found that it — let alone the 8K headset — requires a top-end graphics card to hit satisfactory performance. In our own testing of the Pimax 5K+ we’ve learned that the headset’s requirements still exceed the GTX 1070’s ability. Don’t expect to see clear visuals and high frame rates with a 1070-caliber card; a GTX 1070 can provide only one of those things at a time.We snagged an RTX 2080 GPU to drive our Pimax 5K+ headset for this review, and even that card ran into performance trouble. Performance can be improved if you cut down the peripheral vision displayed by the headset, but doing so eliminates one of the major advantages of choosing Pimax over a Vive or Rift in the first place. Pimax is offering preorder bundles that include either Nvidia’s RTX 2080Ti or RTX 2080 card. Command Line delivers daily updates from the near-future."}