{"id": "Tesla rides Model 3’s popularity to its first profit in two years", "paragraph": "Tesla has posted its first profitable quarter in two years, its third ever, thanks to the popularity of the Model 3 sedan. The automaker said on Wednesday that it generated $6.8 billion in revenue in the third quarter of 2018 and walked away with $311 million in profit — the most the company has ever made in a quarter. The company finished the quarter with $3 billion in cash, up $731 million from the second quarter of the year. Tesla’s last two profitable quarters came in 2013 and 2016, and it has never made a profit over an entire year.“Q3 2018 was a truly historic quarter for Tesla,” CEO Elon Musk and CFO Deepak Ahuja wrote in a letter to investors. “Model 3 is attracting customers of both premium and non-premium brands, making it a truly mainstream product.”The turning of financial fortunes can be largely attributed to how Tesla nearly doubled production of the Model 3 from the second quarter to the third this year. In fact, the company has made so many cars recently that it overwhelmed itself with delivery efforts, switching from so-called “production hell” to “delivery logistics hell,” as Musk famously put it. “Fortunately, these challenges are easier to solve than vehicle manufacturing, and we made improvements through the quarter,” Musk and Ahuja write. In total, Tesla wound up delivering 56,065 Model 3s in North America in the third quarter, which is 225 more than it said when it announced initial delivery counts for the quarter in early October. The company also sounds ready to cash in on demand in other markets, with Musk and Ahuja saying Tesla will start taking orders in Europe and China for the Model 3 “before the end of this year.” After finally turning a profit on the Model 3 earlier this year, Tesla now says it is now pulling in more than a 20 percent margin on the car. It did this thanks to a reduced cost of raw materials, but also by cutting the number of labor hours needed to make each Model 3. Tesla says this figure dropped 30 percent from the second quarter to the third, and that it now takes less time to produce a Model 3 than to make a Model S or X. Also helping boost the company into profit was the sale of $52 million worth of zero-emission vehicle credits to other automakers.Tesla says it is still targeting early 2019 for the launch of the long-promised $35,000, 220-mile version of the Model 3. The company delayed the most affordable version of its small electric sedan in order to focus on the higher-cost, higher-margin versions. Musk even said this year that focusing on the lower-cost Model 3 would cause the company to “die.” The delay, combined with the fact that Tesla’s cars are now no longer eligible for the full $7,500 federal EV tax credit, has contributed to some cancellations. But Tesla says demand for the Model 3 remains strong, and that “less than 20 percent” of the 455,000 reservation holders have asked for a refund. The company also says that it doesn’t expect selling lower-priced cars to impact profitability long term.Despite the boost in production’s effect on Tesla’s bottom line, the company is still running into problems related to that explosion in scale. Tesla has had problems with customer service, with Musk recently admitting that the company has “major gaps” in its nationwide coverage. And while the company’s cars consistently earn some of the highest safety ratings in the industry, its widely documented quality control issues continue to plague customers new and old. Before the earnings letter dropped on Wednesday, Consumer Reports said that Tesla ranked the third worst for reliability among major automakers. Tesla also has more than $10 billion in debt, with more than $1 billion due in the next six months. This, along with future projects like the Model Y crossover, Tesla Semi, and factories in Europe and China, has had many financial analysts expecting Tesla to raise new money sometime soon. But an increase in cash on hand coupled with increasing revenue from other parts of Tesla’s business — like its energy generation and storage business, which increased by $25 million to just shy of $400 million this quarter — could help Musk continue to make his case that he won’t need to take more of anyone else’s money. The release of the quarterly letter wraps one of the wildest quarters in Tesla’s history, which is saying something for a company with as many ups and downs as a reality TV show. On August 7th, just days after the company recapped its second quarter performance, Musk made a surprise announcement on Twitter about how he was considering taking the publicly traded company private again. Musk said he wanted to delist the company from the NASDAQ once its stock price hit $420 per share and claimed that he had “funding secured” to back the potentially massive buyout required to pull off such a move. Musk, it turned out, did not have any funding secured. The $420 share price cutoff he suggested was, in part, a joke about weed meant to impress his girlfriend, the musician Grimes. Less than two months after Musk sent those tweets, he was sued by the Securities and Exchange Commission for committing securities fraud. The SEC’s complaint, built largely on subpoenaed internal communications at Tesla, showed that Musk’s privatization attempt (and the way he went about it) was also a surprise to many of the people inside the company. While Musk had told Tesla’s board of directors that he was considering the idea, he didn’t give them a heads-up that he was about to make a public announcement. Tesla’s CFO had to email Musk shortly after his first tweets to suggest the company draft an official press release, and the company’s head of Investor Relations spent the hours and days after reassuring shareholders that the plan was legitimate, despite a lack of evidence to support that claim. Musk quickly settled the suit. He agreed to step down as chairman of Tesla for three years, and both he and Tesla were ordered to pay $20 million fines. The company has been ordered to hire a lawyer to oversee all of his public communications, including his tweets. As it moves into the final quarter of 2018, Tesla still has to name a successor Musk as chairman of the board of directors. The board is also getting two new independent directors as a result of the settlement with the SEC, though one of those roles can be filled by the new chairman. Tesla also reiterated plans to accelerate its manufacturing timeline in China. The company recently signed off on a lease for the land outside Shanghai where it plans to build a new Gigafactory, and on Wednesday it said it is “aiming to bring portions of Model 3 production to China during 2019.” China has been an increasingly important market for Tesla over the years, but the recent trade war with the US has caused the company’s cars to be subjected to a 40 percent tariff. Beyond that, Musk said the upcoming Model Y crossover has been approved for production, though it still won’t be built until 2020. Musk added that he is “personally most excited about” the Tesla pickup, though. “I think that’s going to be some next level stuff there,” he said.Command Line delivers daily updates from the near-future."}