{"id": "The Pixel 3 removes the ability to unlock your phone with your voice", "paragraph": "Google has quietly removed the Unlock with Voice Match function from its latest Pixel 3 and Pixel 3 XL phones, as first reported by Piunikaweb. The feature, which was previously available on the past two Pixel devices, allowed for users to unlock their phones’ Assistant features with an, “OK Google” command. Google confirmed that the feature is no longer available on its support page, where it explains: “On Pixel 3 phones, you can’t unlock your phone by saying ‘Ok Google.’ Instead, you can use the Google Assistant on your lock screen.”This is a pretty big functionality to lose for any Pixel owners who were expecting to see the feature carried over to the Pixel 3. With the previous Pixel phones, users could make calls, send messages, and access third-party apps via Google Assistant voice support without unlocking their phones. The “Unlock with Voice Match” toggle in the Pixel 2’s Assistant settings has now been replaced on the Pixel 3’s settings with a “Lock screen personal results” toggle, which now reads “Use Voice Match to access personal results like email, calendar, contacts, and reminders when your phone is locked.”@madebygoogle @Google 1) Got my Pixel 3. Super excited. Transferred data from my original Pixel. Tried using \"okay Google call mom.\" Didn't work. Did an hour of troubleshooting on my own. Went through 2 hours of troubleshooting with your support teams. No fix in sight.It’s not clear why Google removed the feature, but one theory could be that the Voice Match feature had some security flaws that could allow for someone with a similar-sounding voice, or a voice recording, to unlock the phones. Another reason could be that Google sees its new Pixel Stand, which allows you to use Google Assistant without having to unlock the phone when docked, as a better solution for hands-free access. Command Line delivers daily updates from the near-future."}