{"id": "Tim Cook talking to Lana Del Rey was the most human moment at Apple’s event  ", "paragraph": "Apple events are traditionally a chance for tech connoisseurs to spend a couple of hours learning about the company’s next line of hardware products or software updates, but it also gives Apple executives a chance to hang out with super cool musicians. At the end of Apple’s presentation today, melancholic pop princess Lana Del Rey gave a charming performance with Jack Antonoff of two songs from her upcoming album Norman Fucking Rockwell. Del Rey wasn’t allowed to say the name of her album because Apple didn’t want any cursing at its keynote. (It’s perhaps a sign of what people should expect from the company’s upcoming original slate of TV shows and films, which is also rumored to be family-friendly.) Fans of Del Rey’s previous work will immediately recognize the familiar dreamlike, almost apathetic tones on her new tracks. Despite the pleasant performance, which took place at the Brooklyn Academy of Music in New York City, the most enchanting part happened after Del Rey stopped singing. Apple CEO Tim Cook came out to give Del Rey a hug and thank her for performing, and Del Rey confessed that she’s “always so nervous” about performing. “No, I’m the one who’s nervous,” Cook said, laughing as he walked with Del Rey. It’s an endearing moment, this little spontaneous burst of humanity! Apple spends so much of its time trying to connect its products to human beings — technological objects that enrich the lives and contribute to our world’s overall story — that can often lead to eye-rolls at its obvious marketing tricks. But this was a small, humbling exchange between people at the end of a successful presentation. And it reminds us that we’re all just nervous beings trying our best to make it through this world. Del Rey’s entire performance can be watched below. Norman Fucking Rockwell doesn’t have a release date yet. Command Line delivers daily updates from the near-future."}