{"id": "James Woods has turned his Twitter feed into a ‘bulletin board’ for missing California wildfire evacuees", "paragraph": "As unprecedented wildfires have torn across California over the past week — devastating hundreds of thousands of acres, displacing hundreds of thousands of residents, and killing at least 31 people — plenty of celebrities, including those who have been evacuated, have been tweeting links and encouraging their followers to donate to relief efforts. But in an unexpected turn, the celeb doing perhaps the most online legwork for victims of the three fires has been conservative actor James Woods. Known on the platform for his deeply combative political screeds, Woods has turned his Twitter feed into a signal-boosting “bulletin board” for victims, their families, and facilities and organizations offering help, tweeting virtually nonstop since November 8th using hashtags #CampFireJamesWoods or #SoCalFiresJamesWoods (including his own name, evidently, to differentiate tweets that specifically needed amplification). Whether or not it’s been directly because of his efforts, several of those he’s retweeted have successfully located their evacuee relatives, found shelter for evacuated livestock, and reunited lost pets with their owners.Among those Woods’ tweets have aided is liberal actor / producer Alyssa Milano, whose horses were successfully evacuated from her Bell Canyon home on Friday in the hours following Woods’ tweets. (It’s unclear whether his tweets directly contributed to their evacuation.) In the meantime, Woods chastised his own followers for questioning his choice to help Milano, whose usual Twitter activity is essentially the political inverse of Woods’. (Woods’ last tweets before going in on the fire were pro-gun statements using the hashtag #DemocratAntifaMob; he was locked out of his account back in September for sharing an election hoax meme.)She needs help with five horses. It was previously reported that her horses had been evacuated, but she says that did not happen. Please contact her at @Alyssa_Milano to get her location or use my hashtag #SoCalFiresJamesWoods This  is a serious request. https://t.co/R7krd0WfbgBecause her animals are in danger and she needs help. @Alyssa_Milano #SoCalFiresJamesWoods https://t.co/GFc66PGSalHorses are finally safe. My children are safe. My home is in jeopardy but... everything with a heartbeat is safe. Thank you all for your concern.To those who insisted on still being hurtful because our political affiliation is different, you are what is wrong with the country.Also among those lost and found — many of whom were elderly or disabled — were actors Martin and Janet Sheen, whose son Charlie Sheen tweeted for help finding them on Friday night. The pair were located hours later by the local news station in Zuma Beach.Grandma Joyce has been found alive & well. THANK YOU so much everyone for retweeting. I continue to pray for the others still missing. Thank you @RealJamesWoods for having such a great heart & organizing this & spending so much of your time reuniting  #CampFireJamesWoods pic.twitter.com/fPbeIpZqZtIn addition to signal-boosting, Woods has been peppering his retweets with disaster tips. Most are pet- and livestock-oriented — if you didn’t know to spray paint your phone number on your horse’s flank (or writing it in permanent marker on their hooves) before unbridling and letting them run free when a fire hits, for example, or what to pack in your car if you might have to evacuate, now you do — but others include not flying your drones over the affected areas.Thus far, the Camp fire — the most destructive wildfire in California’s history — has killed 29 people, the Woolsey fire killed two. According to the Los Angeles Times, more than 250,000 Southern Californians have been evacuated.Every Californian with a #BlueCheckMark is invited to stop trolling @Twitter today and use your voice to retweet #Evacuation and #Safety advisories instead. Be sure to check the time an advisory was posted. Thank you! #SoCalFiresJamesWoods #CampFireJamesWoodsCommand Line delivers daily updates from the near-future."}