{"id": "The Kepler Space Telescope is dead", "paragraph": "This afternoon, NASA officially bid farewell to the Kepler Space Telescope, a pioneering spacecraft that helped discover thousands of planets beyond our Solar System. After years of service that extended long beyond its initial four-year mission, the spacecraft finally ran out of fuel.Engineers realized that Kepler was almost out of fuel earlier this summer. At the time, they put it in safe mode for a brief time to focus on getting the scientific data that Kepler had already collected safely back to Earth. They managed to turn it on and collect more data, but they knew at the time that the spacecraft was nearing its end.Kepler launched with enough fuel on board to last for more than six years; it lasted nine. “We filled it up with fuel to let it go as long as it could,” says Charlie Sobek, project system engineer for the Kepler spacecraft.Now without fuel, NASA decided to officially retire the spacecraft. It’s currently in a safe orbit far from Earth. This week or next, the engineers will send a command to the spacecraft that will turn off its transmitter and other instruments, leaving it silent and drifting in its orbit.  Kepler launched in 2009 on a mission to find planets outside our Solar System called exoplanets. At the time, very few exoplanets had been detected, so the instrument was peering deep into the unknown. When it launched, Kepler was a marvel of scientific engineering. It detected planets by looking for their transits, which are the small dips in the light of a star as a planet passes between that star and the Earth. “It was like trying to detect a flea crawling across a car headlight when the car was 100 miles away,” William Borucki, a retired Kepler principal investigator, said in a press conference today.  In its first few years of operation, Kepler was wildly successful. It looked for planets in a particular segment of the sky, monitoring about 150,000 stars for transits. But in 2012, some of the equipment on the spacecraft that kept it steady malfunctioned. The next year, the situation worsened, and researchers feared that it was the end of the road for the spacecraft. But later in 2013, engineers came up with a solution, using the pressure of sunlight to balance the spacecraft. Using the Sun, they could keep the spacecraft steady for 83 days at a time. The development let NASA start a new mission with the spacecraft, which it called K2. Kepler and K2 helped researchers discover that planets are incredibly common, even more common than stars. Together, the missions discovered and confirmed the existence of 2,681 planets and identified many more blips around distant stars that could be planets but are still awaiting confirmation. Many of those worlds are somewhere between the size of the Earth and Neptune, which is unlike any seen in our Solar System.All the data that Kepler managed to gather was safely transmitted back to Earth, and scientists will continue poring over the information for years to come. But new information is also on its way. Several other exoplanet-hunting missions are in the works, including the much-delayed James Webb Space Telescope. Luckily, another telescope is already in space and is ready to continue Kepler’s work. NASA launched the Transiting Exoplanet Survey Satellite (aka TESS) earlier this year. It took its first science picture in August, and by September, it had already identified two potential planets. TESS has a long way to go before it catches up to Kepler. But someday in the not-too-distant future, TESS or another future telescope will eventually usurp Kepler’s position as the undisputed ruler of planet-discovering devices. More powerful telescopes will send back images that are crisper and more detailed than Kepler could take. Advances in computing will help scientists pick out transiting planets from data gathered long after Kepler’s death. More worlds will be found, and our image of the galaxy will keep resolving into a sharper focus. Kepler’s legacy is this constant expansion of our understanding of the universe. “Now, because of Kepler, what we think about the universe has changed,” says Paul Hertz, the astrophysics division director at NASA. Kepler will not be the last exoplanet explorer, but it was NASA’s first, and it gave the world a new way of looking at our place in the Universe. “Kepler opened the gate for the exploration of the cosmos,” Borucki says.Command Line delivers daily updates from the near-future."}