{"id": "New trailers: Spies in Disguise, Dogs, and more", "paragraph": "Last week we put out a video about how the golden age of streaming services — where you sign up for one service and find a wealth of content from all over — is rapidly ending. And tellingly enough, one of the best examples of a service like that, FilmStruck, which specialized in classic cinema, announced plans to shut down just days later.I’ve complained about this plenty of times before, but you can already feel the squeeze, especially on Netflix. Netflix isn’t just pushing its own TV shows because they’re new — it’s pushing them because they’re the only content Netflix can truly guarantee.In some ways, it’s the à la carte TV dream — now you’ll just have to pay for the streaming service you want. But when you have to sign up for more and more services as they all fracture and companies seek to make money on their own by clinging to a few exclusive series and titles, the whole situation looks even worse for consumers, whose streaming bills are going to keep growing.Check out nine trailers from this week below.The premise for this movie is so bewildering that I just can’t understand how it came to be. The film has Will Smith voicing a super cool, super smooth secret agent who... gets transformed into a pigeon. I have no idea where, or how the movie plays out from there. I’m curious though, so I guess this trailer worked. The film comes out at some point next year.Earlier this year, we got Amy Schumer’s take on a romantic comedy gone awry after the main character hits her head and starts to see the world differently. Now, we’re getting Rebel Wilson’s taken, and it pushes things into a much wilder direction: she gets trapped inside a very self-aware rom-com — and hates it. It looks like a very fun twist on the genre. The film comes out on Valentine’s Day.Blue My Mind is a coming-of-age film about a teenage girl transforming into something like a mermaid... except, it’s completely horrific, as her body is warped and she gets sudden cravings for raw fish. In her review earlier this year, my colleague Shannon Liao wrote that “enjoying the film requires enjoying teen angst and body horror since there isn’t a moment without them.” It comes out November 13th.A few years ago, the Norwegian disaster film The Wave got a bunch of buzz for taking a somewhat smaller-scale approach to a disaster movie, honing in on the characters more than just the epic disaster shots. Now the producers are back with a sequel of sorts, The Quake, which seems to be attempting to strike the same balance of characters meeting epic destruction. But ultimately, it’s very clear that the movie’s interests lie in being a big, fun blockbuster. It comes out December 14th.Now this is a Nic Cage movie. Cage plays a creepy dude with cowboy boots trying to, I think, reconnect with his dead wife and daughter by using the daughter of some woman he’s seeing who has died and come back to life, but seems to be stuck somewhere in between life and death. It’s very stylized and looks increasingly nuts, like any good Nic Cage film. It comes out December 21st.There’s a new trailer out for The House That Jack Built, Lars von Trier’s controversially gruesome film that has Matt Dillon playing a serial killer. This trailer is a good reminder of everything great and terrible about Lars von Trier; there’s some incredible mood building... there’s also just a lot of gross nonsense. And as someone who sat through four hours of Nymphomaniac, I need to keep reminding myself of the marathon feeling that watching his films evokes. The film comes out wide on December 14th, though if you’re masochistic enough, there’s a one-night-only release of his director’s cut on November 28th.Cixin Liu’s The Wandering Earth is being adapted into a big, sci-fi blockbuster, and as my colleague Andrew Liptak writes, it looks eye-popping enough to potentially break out into an international hit. You can read more about Liu’s story and how it fits into China’s burgeoning sci-fi film canon in his story. The film comes out in February.The lackluster sophomore season of HBO’s anthology show True Detective didn’t kill off the franchise, but a third season has been several years coming. This time around, we get to follow Mahershala Ali as he begins investigating a case in which two children vanished in the Ozarks in the 1980s. What a buncha good boys.Command Line delivers daily updates from the near-future."}