{"id": "Netflix updated its app to resolve an early annoyance with Apple’s new iPad Pro", "paragraph": "Netflix today released an update for its iOS app that adds full support for Apple’s latest iPad Pro tablets. The devices went on sale last Wednesday, and early buyers quickly discovered something that flew under the radar in a lot of press reviews: you can expect to see many apps with black bars surrounding them, which detracts from the new “all-screen” (but definitely not edge-to-edge) design of these iPads. The issue is more pronounced on the 11-inch iPad Pro because it features a different screen aspect ratio than the 10.5 inch model it replaces. Very few apps are optimized for the new display size, so it’s worth knowing that you’re in for a waiting game if you’re planning to purchase one of the new models. It’s a minor frustration for most cases, but games can be impacted by the bars since on-screen assets get moved around a bit.The 12.9-inch model maintains the same aspect ratio of its two predecessors, but its rounded corners and the new virtual home indicator are still causing black bars in many apps. Even with the apps that stretch the full width of the iPad screen (such as YouTube and Google Docs), there’s a black bar behind the virtual home bar. With its latest update, Netflix avoids all of this and looks rightly optimized for the new iPad Pros. It’s likely that essential, hugely popular apps will be updated fairly quickly — as Netflix demonstrated today. But there’s no telling when some games or more niche apps will look their best on the new screens. Developers tend to treat their iPad apps with less urgency than iPhone apps. Take Facebook for example: the company never even updated its iPad app to natively take advantage of the 10.5-inch screen on the previous Pro. For now, the black bezels of the iPad Pros help lessen the issue a bit. In recent years, Apple has been encouraging developers to build apps in such a way that they dynamically scale to a variety of display sizes without being hard-coded for a certain display. It’s the apps that haven’t added this flexibility that will look worst on the 11-inch iPad Pro — at least until they’re updated. Apple has set a March 2019 deadline for all apps (and app updates) to be built using the iOS 12 SDK. So while early adopters will have to put up with the bars, hopefully the March cutoff should encourage developers to optimize their software for Apple’s latest iPhone and iPad screens. It seems Apple is aware that this might take awhile, though. None of the demonstration iPad Pros at the company’s retail stores have third-party apps loaded onto them. Command Line delivers daily updates from the near-future."}