{"id": "Russian woman charged with managing budget for US election interference plot", "paragraph": "The Department of Justice has unsealed a criminal complaint against a Russian national who allegedly attempted to interfere with US elections. Originally dated to late September, it accuses a St. Petersburg-based woman named Elena Alekseevna Khusyaynova of acting as the chief accountant for Project Lakhta, an expansive political influence operation that’s been mentioned in earlier indictments. This follows the indictment of several other Russian figures who allegedly conspired to manipulate the election.According to the criminal complaint, Khusyaynova managed the budget of Project Lakhta, funded by the companies Concord Management and Consulting LLC and Concord Catering — both of which were mentioned in earlier indictments. The total operating budget between January 2016 and June 2018 was allegedly $35 million, which covered activities directed at the US, Russia, the European Union, and Ukraine. Among other things, Khusyaynova allegedly coordinated payment for expenditures like “activists, advertisements on social media platforms, registration of domain names, the purchase of proxy servers, and ‘promoting news postings on social networks.’”The complaint states that Khusyaynova kept “detailed financial documents” that outlined payments for activities meant to undermine US elections. An itemized budget covering the year leading up to January 2017, for instance, listed expenses for Instagram, Facebook, and VKontakte ads. It also included budget lines for “bloggers,” “developing accounts” on Twitter, and funding online videos. Between January and June of 2018, she submitted expenditures of roughly $60,000 for Facebook ads, $6,000 for Instagram ads, and $18,000 for bloggers and Twitter accounts. In its press release, the Justice Department thanked Facebook and Twitter for “exceptional cooperation” during the investigation.The release coincides with a joint statement from the Justice Department, Federal Bureau of Investigation, Department of Homeland Security, and Office of the Director of National Intelligence, expressing concern about “ongoing campaigns by Russia, China and other foreign actors, including Iran, to undermine confidence in democratic institutions and influence public sentiment and government policies.” The statement said that they “do not have any evidence” of any breach that would let these operations prevent voting or change vote counts, but acknowledged the threat of propaganda and disinformation during the upcoming 2018 and 2020 elections.Today’s complaint covers some territory seen in earlier cases, including the broad strokes of Lakhta’s alleged goal: to “sow discord” in the US political system by exaggerating the presence of extreme viewpoints online and aggravating existing political divides. It provides a number of examples of this propaganda. One guidance document, for instance, emphasizes that “colored LGBT are less sophisticated than white” and are “very sensitive toward #whiteprivilege,” so posters should “be careful dealing with racial content.”Another string of messages suggest finding ways to “brand [Sen. John] McCain as an old geezer who has lost it and who long ago belonged in a home for the elderly,” in order to discredit his criticism of Donald Trump, and to brand fellow legislator Paul Ryan as “a complete and absolute nobody incapable of any decisiveness.”The complaint also lists some specific names of fake identities used for misinformation: “Helen Christopherson” was a supposed New York City resident who became a co-coordinator of an anti-Trump flash mob, and “Bertha Malone” was used to create over 400 inflammatory Facebook posts focused on immigration and Islam. She also created the “Stop AI” Facebook page that appeared in a list of propaganda ads released last year. Again, some of these names were already known — like “Luisa Haynes” or @wokeluisa, whose popular liberal tweets were picked up by several news agencies before her identity was discovered.According to the complaint, net neutrality was one of the favored topics for debate, alongside gun rights, the 2018 midterm election, and negotiations with North Korea. An account with the handle @KaniJJackson reposted tweets praising Republican senators who voted for net neutrality rules and urging voters to “repeal” Sen. Ted Cruz (R-TX) for voting against them.As before, the Justice Department emphasizes that it’s not alleging this conspiracy actually influenced the election — only that there was a coordinated attempt to do so.Command Line delivers daily updates from the near-future."}