{"id": "An academic reported sexual harassment. Her university allegedly retaliated", "paragraph": "Lara Carlson remembers November 20th, 2012, as a pivotal moment in a bruising conflict with her employer, the University of New England. On that day, Carlson entered a meeting with the university’s human resources department to discuss troubling problems she’d had over the past year. She’d received what she considered to be lewd emails from her boss, Paul Visich, the chair of the Exercise and Sport Performance department. She alleged that he made unwanted, sexually charged remarks as well as unwanted physical contact. Visich was her direct supervisor — he wrote up her teaching evaluations and merit raises and oversaw the direction of her curriculum — and was, until his recusal, the head of the committee that decided whether Carlson, 50, received tenure. So Carlson complained to Sharen Beaulieu, a human resources director at the university, as well as Timothy Ford, the interim dean of UNE’s Westbrook College of Health Professions. Carlson printed out the emails from Visich and put them in a binder. Ford and Beaulieu, Carlson says, acknowledged Visich’s actions were sexual harassment. Beaulieu told Carlson that she had to meet with Visich. “I didn’t want to do it,” Carlson says, adding that she was fearful that Visich would brush off her complaints or seek to damage her career. “I was scared. I was scared to death.” Beaulieu was the first to speak at the November 20th meeting, and she said Visich had called the meeting. “You and I talked, Paul,” the administrator said, “and you said you thought it would be good for us to get together.”Carlson felt blindsided. She had complained, yet Visich’s concerns, in her view, dominated the meeting. “I was shocked, and I felt betrayed,” she tells The Verge. Carlson recorded the meeting.Her tape recorded Beaulieu telling Carlson that Visich “is your chair so we’ve got to figure out a way to make this work.” The HR director urged Carlson to improve her communication with Visich. A second binder of emails — evidence of Carlson’s harassment allegations — that Carlson brought in case the first she gave to Beaulieu was not used remained on the table, unopened. “It was clear that no matter what, UNE was going to keep Visich as my chair,” Carlson says.“I know there’s times when we’ve had issues and you’ve tried to stay as far away as possible from me and I’ve had to go hunt you down,” Visich said in the recording. “Being part of the team is important. And you have kind of set yourself apart from all of us... You have created some animosities with the faculty.” Carlson pushed the binder across the table toward Visich. He refused even to glance downward, she says. After an hour and a half, Carlson left to give a lecture. The next Monday, Carlson emailed Beaulieu to ask about Visich’s harassing emails. “I addressed his interactions with you and inappropriate emails immediately after you left for your class,” the HR director replied. Visich, in a September 7th, 2016, deposition, told attorneys he called for the meeting, but he did not recall discussing these emails with HR.Less than three years after the meeting, Carlson, no longer a part of the Exercise and Sport Performance department, would be embroiled in a legal battle against the university for retaliating against her after she raised sexual harassment complaints. The reporting that follows tells Carlson’s story based on court documents and interviews with Carlson and her colleagues. The fallout from the events at UNE, including that meeting, upended her once-promising career.After Carlson filed a lawsuit in the US District Court in Maine, the university asked the court to dismiss the claim. “UNE exercised reasonable care to prevent and promptly correct any discriminatory, harassing or retaliatory behavior,” wrote the university’s attorneys in the answer to Carlson’s complaint. She had “unreasonably failed to take advantage of the corrective opportunities provided by UNE or otherwise failed to avoid harm.”Between 60 and 80 percent of women in the workplace experience some form of sexual harassment. Carlson’s story “is the sort of thing that I’ve heard quite a bit over the years,” says Kathryn Clancy, an anthropologist at the University of Illinois at Urbana-Champaign. Clancy is an author of a recent National Academies of Sciences, Engineering, and Medicine report, published in June, that describes the pervasiveness of sexual and gender harassment in science in academic settings. More than 50 percent of female faculty members have experienced harassment, mostly sexist comments and inappropriate jokes.The story Carlson tells is a story of sexual harassment. But it is also a story of institutional failure. “Male domination and organizational tolerance toward harassment are the two main underlying factors that often create more harassment,” Clancy says.  A series of allegations have rocked the academic astronomy community since BuzzFeed News revealed in 2015 that a prominent exoplanet researcher violated the University of California, Berkeley’s sexual harassment policies. A 2016 investigation by The Verge found that mammalogist Miguel Pinto harassed fellow research students at the Smithsonian National Museum of Natural History. Pinto was banned from the museum’s labs. The #MeToo movement that went viral in October 2017 pulled the most egregious examples of sexual harassment and sexual assault to the forefront of public consciousness. But what still lurks outside of the headlines and news chyrons are the more common, yet still professionally destructive, forms of abuse.The focus on explicit misconduct misses the vast majority of harassment. Demeaning jokes, unwanted sexual attention, and excluding women from decision-making processes and leadership positions all cause detrimental effects on women’s health, productivity, and long-term career goals.“This isn’t some kind of Harvey Weinstein-type of story in terms of the seeming severity of the behaviors of the perpetrator,” Clancy says. “At the same time, the personal and professional consequences are really obvious.” A decade ago, Carlson was a rising star in the field of exercise physiology. Before becoming a scientist, she was an athlete who competed in the hammer throw at four USA Track and Field national championships. An injury cut her athletic career short. “I’m no stranger to hardship,” she says. She found success in academia. In 2009, Carlson left her job at Vermont’s Castleton State College, now known as Castleton University, for a tenure-track position at the private University of New England in Biddeford, Maine. The university recruited Carlson not only for her physiology expertise, but also for her reputation as a teacher. “She had a phenomenal teaching record,” says Amy Davidoff, a University of New England professor of pharmacology who describes herself as “an advocate and a mentor” for Carlson. During her time at UNE, Carlson was nominated for the university’s Westbrook College of Health Professions’ Distinguished Teaching award, and she won UNE’s Excellence in Academic Advising award. Students adored her. One of Carlson’s former students, who requested anonymity for fear of professional repercussions, described “Doc. C” as “easily the best professor” at the university. Carlson had scientific chops, too. She was twice elected as president of the New England American College of Sports Medicine (NEACSM), and she founded UNE’s first NEACSM College Bowl team. In her first few years at the University of New England, Carlson led an investigation into the physiology of stock car drivers. Studying male NASCAR competitors, Carlson discovered that significant heat strain causes drivers’ skin temperatures to rise and their bodies to lose weight through sweat. In 2013, The New York Times described her studies as “new research that supports racing’s athletic cred.” The university commissioned a short documentary of her work, which the New England chapter of the National Academy of Television Arts and Science nominated for an Emmy. In the university’s eyes, “I was a superstar,” Carlson says. That is, until she complained about Visich. The University of New England hired Visich, who had researched the genetics of muscle size among other areas of study, from Central Michigan University to become chair of the Exercise and Sport Performance (ESP) department in 2011. UNE faculty were impressed by Visich’s resume and his ability to secure grant money from the National Institutes of Health.But Visich began to act unprofessionally shortly after his arrival as the new department head, Carlson says. In a January 20th, 2012, email exchange, he wrote: “I am home in my PJs sipping tea and watching porn!”Visich, who did not respond to four requests for comment by email and phone, has described these emails as banter among friends. Carlson and her husband were the “first good friends” Visich and his wife made in Maine, he said. “Of course, I was not watching porn. I was simply joking with her,” he said in the September 2016 deposition. “We had a joking relationship with each other during these times.” In February 2012, Visich sent a picture of a female baboon’s engorged genitals to Carlson. “Hey just wanted to let you know that I’ve got the itches BAD today,” his email read. “Seriously my ass feels like this.” Other messages referenced Lara’s husband: “I hope the old man is giving you a nice rub down with some old oil he found in the garage, haha!” and “Blair told me he was shopping the other day and got you some real sexy panties, what a man! He was probably trying them on, haha!”He wrote these emails “jokingly,” he said in 2016, and “didn’t necessarily think they were considered sexual.” During meetings, Carlson says, Visich sat next to her and placed his hands on her thighs and knees in an unwelcome manner and stared at her chest. He stopped her once, while the department was moving into its new facility at the Alfond Forum, by grabbing her upper arm and holding her so forcefully that she asked him to let go. Carlson began to avoid one-on-one meetings with Visich. “I started to distance myself from him,” she says.Visich targeted students, too, Carlson says. In May 2012, as part of a physiology class, Carlson and Visich decided to take students on a trip up Quandary Peak, a Colorado mountain. Carlson recalls that for months prior, Visich, during guest lectures in Carlson’s class, told female undergraduates to prepare by packing colorful bras.A student complained about Visich’s repeated references to wearing colorful bras on the trip to a staff member in the department. That staff member, who spoke on condition of anonymity for fear of professional repercussions, confirmed this incident with The Verge. On the trip, Carlson stayed at the base with a combination of altitude sickness and a stomach bug. At the top, Visich insisted on taking a picture where, despite the altitude and snow, the men stripped to the waist, and the women wore bright sports bras. Visich is in the picture as well, grinning as he flexes his biceps. Visich continued to take shirtless photos with undergraduate students as recently as 2016, according to a longtime faculty member and associate professor at the university, who wished to be unnamed for fear of retaliation. Two students complained to this professor. One of those students shared the photos, which Visich had posted to social media, with the faculty member. “Before I even met Lara,” the professor says, “I heard from students who were in his classes how uncomfortable it made them.”Carlson formally raised her complaints to Ford and Beaulieu in the fall of 2012, explaining that Visich “was touching me in an unwelcome way, leering at my chest.” The November 20th meeting with Visich came from those complaints, but things soon spun far from resolution. Visich began to retaliate against her for complaining, Carlson says. In early June 2013, he wrote a negative evaluation about Carlson, saying her “involvement with the department this year has been fairly minimal.” Visich was removed as the head of Carlson’s tenure committee in the fall, but he remained her direct supervisor. Visich removed Carlson as the head of UNE’s College Bowl team. He created more stringent procedures for allowing non-Exercise and Sport Performance majors to take Carlson’s class; consequently, several students were denied enrollment. The next spring, without prior discussions with Carlson, he nixed the lab time allotted for her exercise physiology course, which prevented her from implementing labs she was still required to teach. The meeting also didn’t stop Visich’s unwanted touching. On September 5th, 2013, Carlson was sitting on her motorcycle in a school parking lot, talking with a student, when Visich approached, reached out, and began to rub her shoulders. The student who was present described the behavior to The Verge as “creepy” and says that Carlson appeared “weirdly uncomfortable.” Visich, in the deposition, said he was consoling Carlson after the death of a colleague. “Could I have touched her back? Yes,” he said. “Was it sexual in nature? No way.”The student submitted a witness statement, Beaulieu reviewed the incident when Carlson complained, and she concluded that no sexual harassment had occurred. Afterward, the student says, he was blackballed from applying for a job in the department.The federal civil rights law known as Title IX has become a major force through which victims of sexual harassment at universities — both students and faculty — raise their complaints. Title IX is cheaper than a lawsuit (it’s free), and federal oversight compels universities to act aggressively. Celene Reynolds, a sociologist at Yale University, has studied Title IX mobilization over the last several decades. She found that gender discrimination complaints under this law have risen continuously since 2006, with an “explosion” in complaints after 2009. In 2014, 1,446 Title IX complaints were filed.But while more people are coming forward, Title IX does not necessarily prevent or prosecute sexual harassment, nor does Title IX always provide victims with the assistance they need. Betsy DeVos, secretary of education in the Trump administration, has spent much of her term dismantling Obama-era guidelines meant to empower victims of sexual misconduct on campus, arguing the moves are to ensure the accused are not wrongfully disenfranchised. Moreover, these laws are frequently misunderstood. “A lot of people don’t understand why sexual harassment — and sexual violence as an extreme form of sexual harassment — is a civil rights violation, a violation of the victim’s rights to an equal education or equal employment opportunity,” says Nancy Cantalupo, a lawyer who has written extensively about gender discrimination in universities and colleges. “But that’s how civil rights laws define it.”Schools mistakenly approach violations to Title IX and Title VII (which bans discrimination in any workplace) from the perspective of criminal law, rather than civil rights law. Administrators may focus on punishment, not reestablishing the civil rights of the victim. Therefore, if universities believe they cannot find evidence they deem punishment-worthy, victims are virtually ignored.“If you’re focused on a punitive response, you’re not really thinking about what the civil rights law requires of you,” says Cantalupo. That’s not the only problem. Universities, in particular, don’t allocate many funds to human resources and Title IX offices, says Clancy. “That makes it really easy for retaliation and other things to happen,” she says. And she’d know: Clancy, in an influential 2014 survey of 658 researchers who conduct field work, found that 61 percent were victims of harassment, including inappropriate or sexual remarks. Twenty percent reported they were sexually assaulted. Few of the subjects in the study understood how to report such incidents, and most who did were unhappy with the official outcome.The federal government is only making the process more difficult for victims. Under DeVos, the Department of Education wants to pivot the standard for evidence under Title IX cases toward a criminal standard, from a “preponderance of evidence” (the allegations are more likely than not true) to a “beyond a reasonable doubt” standard, which would make it harder for victims to prove discrimination on campus.As Carlson felt the retaliation progress, she found her ability to do research being systematically dismantled, beginning in 2014. First, she was removed as an undergraduate student adviser. Then, Carlson asked the new dean and Ford’s successor, Elizabeth Francis-Connolly, for a new supervisor, and she was rebuffed. The dean felt this “would create a significant conflict and would usurp the authority of the leadership of ESP,” according to court documents. Instead, she offered to move Carlson from the ESP department to a different college.Here’s where everything for Carlson began to crumble. Reluctant to transfer, she finally agreed after a series of conversations with Francis-Connolly, which led Carlson to believe that she would continue to teach her courses and conduct research. The transfer, Carlson told Francis-Connolly, “could resolve the situation” if it “can be accomplished along the lines we discussed.” The university, in court proceedings, emphasized that Carlson had “freely agreed to” the transfer.After receiving tenure in March 2014, Carlson left the department in April 2015 and was assigned to the Portland, Maine campus. But she was unable to teach exercise physiology — a popular class for which she’d designed the curriculum — or environmental physiology. She only found out about these changes when the published course catalog listed the instructor for those courses as “TBD.” Carlson asked Francis-Connolly to cross-list environmental physiology to the Biology Department so she could teach it, but she says that Visich convinced Francis-Connolly to reject that move. The university maintains that it did not cross-list the course because Carlson failed to follow proper protocol for submitting her request.Eventually, Carlson’s profile was removed from the ESP department’s website at Visich’s behest in July 2015, which, she says, led external funders to stop contacting her. For the 2016 academic year, she received a merit raise of 2 percent — the smallest raise she says she had ever received during her time at UNE. In 2016, she was placed in the university’s Department of Physical Therapy, despite not being a licensed physical therapist, excluding her from participating in department decisions and curriculum changes. It’s been years since she collected data for her own research.“I just felt dehumanized, devalued and literally discarded,” she says.The behavior Carlson describes is typical of the kind of sexism, misconduct, and lack of accountability that university settings can foster. Such actions “don’t quite meet, say, the definition for things like sexual coercion,” Clancy says, though they “are just below that threshold.”Clancy’s assessment of the situation was unambiguous: there should have been a thorough investigation, and if the allegations were true, then Visich should have been removed as head of the ESP department. It’s important to call out less shocking but still inappropriate behavior, says Heidi Lockwood, a philosophy professor at Southern Connecticut State University who advocates for survivors of sexual harassment at universities. “We need to get away from evaluations of how much harm specific individuals experience, and focus on the pure wrongness of the act.”This sort of harassment can have the worst personal consequences, Clancy says, because victims may internalize it. The organization that’s supposed to address grievances is instead closing ranks around the perpetrator “and further gaslighting the victim.” With institutions choosing to side with perpetrators over victims, it’s no wonder so many women are effectively being harassed out of the sciences.Paul Lannon, an attorney at the law firm Holland & Knight in Boston specializing in employment and labor, points out that academic culture, as opposed to the commercial sector, is imbued with an overt layer of free expression. “Academic freedom for a faculty member gives them the freedom to discuss ideas, present ideas in the classroom, write about ideas, in ways that can be controversial, or out of the mainstream, or provocative,” Lannon says. “That freedom sometimes, I think, can be misconstrued as license to behave in a way that would violate the laws against sexual harassment or discrimination.” If male academics are celebrated for their controversial or provocative ideas, it’s not hard to see why they might believe it’s okay to act controversially or provocatively in the workplace. There’s little wonder why academia has a sexual harassment problem: once these sorts of men find themselves in positions of power with the job security tenure provides, they have little reason to fear the consequences when their “provocative” attitudes augur into inappropriate, demeaning conduct against others.  Lannon, who has served as outside counsel for several universities in harassment lawsuits, says that the revocation of tenure is a very lengthy and disruptive process that both colleges and the accused must agree to. In cases where the accused are forced out, they often opt for a voluntary resignation to avoid a long, public conflict. “It may not look like they were fired from the outside, but it was the consequence of findings made during an investigation,” he says. But since those findings rarely become public, aggressors tend to simply move on to other positions at other schools where they can enjoy a clean reputation and even begin their harassment anew. Carlson did not take legal action against the university until the school removed her from courses in the Physiology Department. “When I learned that they were not going to give me my job back — my classes, that I loved so passionately to teach, the reason I came to the University of New England — that’s when we decided to move forward,” she says.On November 4th, 2014, attorneys David Kreisler and Christopher Harmon filed an Equal Employment Opportunity Commission complaint on Carlson’s behalf. She filed a lawsuit against the university on January 4th, 2016, for retaliation. Maine District Court judge Jon D. Levy ruled that Carlson failed to show the university retaliated against her. The crux of his argument was built around Carlson’s decision to leave the department. The “evidence is undisputed that Carlson participated in the decision for her to transfer out of the ESP Department, and that the transfer was voluntary,” the ruling states. The “fact that the choice given to Carlson was a difficult one, and possibly ill-advised in light of the harassing conduct she alleged Visich committed, does not render the transfer retaliatory.” Carlson, Levy wrote, was unable to suggest “that the real motive behind UNE’s actions was unlawful discrimination in retaliation for her harassment complaints.” Because sexual misconduct and retaliation are civil rights cases, “plaintiffs have to show not merely that the alleged conduct happened, but also that it in some way impeded their access to civil rights guaranteed under Title VII or Title IX,” Lockwood says. Levy’s ruling doesn’t dispute that Visich sexually harassed Carlson, but it does deny that her civil rights were violated since she still had a “choice” in responding to what happened to her. Carlson immediately appealed the ruling. Levy’s ruling is wildly different from how we interpret other acts of aggression, Lockwood says. “When someone steals your wallet, no one wants to know how upset you were about the theft, and you don’t need to provide proof of the hardship. No one asks, ‘Are you sure you really had a wallet, and are you sure you didn’t just lose it?’ or ‘Did your work performance decrease after your wallet was stolen, and did you seek counseling?’ No one demands proof that the victim didn’t ‘encourage’ the theft by, say, leaving the wallet in an unlocked car. It’s understood that no reasonable person would want to have a wallet stolen.”What happened to Carlson is a perfect example of what Lockwood likes to call the “Goldilocks problem.” If your story sounds profoundly heinous, the courts think you’re lying. If it doesn’t sound severe enough, the courts won’t find your case convincing. Your story has to have the right amount of wrongdoing. That burden of proof, Lockwood says, is a symptom of how our culture assumes victims — women — might actually enjoy sexual harassment and the implicit trade of sexual favors for perks and benefits.Carlson almost gave up as the lawsuit stalled. “You start losing hope,” she says. “I’m the type of person if I have hope I can keep going.” She lost friends. “You learn real quick who’s there for you and who isn’t.” Anyone who wonders why more victims of harassment don’t come forward hasn’t thought about “the guilt, the shame and the re-traumatizing over and over and over again,” she says. “It’s just a horrible process.”Nevertheless, Carlson appealed. In August, the First Circuit Court in Boston reversed the district court’s initial judgment and sent the case back to the lower courts for further proceedings, noting that “Carlson has demonstrated that there are genuine disputes of material fact as to whether UNE misled Carlson into transferring departments.” Carlson’s employment, the court found, may well have been adversely affected by her inability to teach her previous courses, advise ESP students, and by her disappearance from the ESP department website. And Francis-Connolly’s “shifting justifications” seemed to indicate these moves may not have been made in good faith. “A jury could find that Carlson would not have accepted the transfer but for Dean Francis-Connolly’s misrepresentations,” the court stated. “A jury could also reasonably infer that Dean Francis-Connolly did so in retaliation against Carlson. A reasonable jury could also find that these events would not have occurred ‘but for’ Carlson’s activity in reporting Visich’s sexual harassment of her.” During those proceedings, UNE maintained that Carlson was not misled into accepting an undesirable transfer or even that staying in the ESP department would have constituted an adverse employment action. Its lawyers argued that the removal of her biography from the department website, her removal of her advisees, and changes to her course assignments were simply a consequence of her transfer “caused by Carlson’s request to have distance from Visich and her choice to transfer out of the Department, not as the result of her complaints of sexual harassment.”The university declined to comment beyond a brief statement. “The university does not comment on ongoing litigation or on personnel matters,” Sarah Delage, UNE’s director of public relations, said in the statement. “We have robust programs in place to prevent sexual harassment on campus and in the workplace, and provide a range of related educational programming to students, faculty and professional staff throughout the year. We respond to all allegations of sexual harassment and investigate those accusations appropriately and conscientiously, and take appropriate action when the investigation indicates it is warranted.”UNE president James Herbert assumed office on July 1st, 2017; four months later, he released a campus-wide letter about sexual harassment. “If you believe you have experienced harassment or assault, I urge you to come forward,” he wrote. Carlson, who has never met Herbert, sent him a letter on November 16th, 2017. “In my view, Paul Visich still poses a significant risk to others at the UNE,” she wrote. “UNE’s current policies allow him to continue in his unchecked behavior.” If Herbert received her warning, he did not respond, Carlson says.In February 2018, Lockwood spoke with Herbert for an hour. Lockwood recalls that she told Herbert that students in the ESP department “are worried about Visich’s behavior.” His initial response to Lockwood, she says, was “essentially, ‘I’m really concerned, I had no idea that there were any problems in that department.’” As the conversation continued, “at one point he said there was one case involving a faculty member and a romance gone bad. And she was an ‘angry employee,’” Lockwood tells The Verge. That case, Herbert told Lockwood, had been settled. Lockwood followed up in a June email to Herbert, concerned about unanswered questions from their conversation. She asked him whether the bad romance and “angry employee” referred to Carlson or someone else. Herbert did not reply to Lockwood. The Verge’s requests for comment to the president’s office have gone unanswered.In all of her interviews with victims over the years, Clancy says, she’s noticed a common refrain. “One of the things that I’ve been really struck by is how many of them say, ‘I just want to get back to work.’”Carlson is no exception. She wants to teach the subject she knows. She wants to collect new data. She wants to mentor students. “All I’ve been fighting for,” she says, “is to do my job.” She wants to return to the department she still calls “home.”"}