{"id": "New trailers: Detective Pikachu, Toy Story 4, and more", "paragraph": "There’s a really powerful category of recent films about teenage girls coming of age through cannibalism, vampirism, or other body-mutating horrors. They tend to be scary, discomforting, and uniquely descriptive takes on the challenges of adolescence, and I finally got around to seeing one of the buzzier names from this category in recent years, Raw.The film deserves its reputation; it’s perpetually unsettling, and it has one of the most striking sex scenes put on film. But what’s perhaps most bold about the movie is also what made me the most uncomfortable with it: usually, the cannibalism / vampirism / etc. is a direct metaphor for one thing or another. Here, I walked away unsure what that was.And the answer may well be nothing in particular. Raw’s cannibalism gets its main character into all kinds of trouble. We watch her struggle with the changes and consequences and why they’re happening. Everything is hard and confusing, and that seems to be the point. It’s a weird and difficult stage in life, and Raw is not scared to show it.Check out nine trailers from this week below.I don’t have the slightest idea how, of all of the possible live-action Pokémon movies that could be made, one about Pikachu being a detective and a smarmy dope of a friend was what got greenlit. But maybe that added level of absurdity is the right way to go. This movie looks strange and tonally and visually bizarre, and perhaps that’s the key to getting people to stop thinking so much and just enjoy it. It comes out on May 10th.Pixar put out a very teaser-y first teaser for Toy Story 4 this week, giving the world a quick look at the film’s driving force — a plastic fork named Forky. The teaser actually gives a really good clue about what the film will be about, but ultimately, I care way less about this teaser than the other video Pixar put out for Toy Story 4: a “trailer reaction” video that’s basically just an animated version of Key & Peele doing their valet bit. The film comes out on June 21st.Disney’s live-action remakes continue with Tim Burton’s take on Dumbo. Even though it’s a Disney classic, Burton’s twisted sense of style still shines through here, making the whole world feel at once dreary, magical, and like something is very wrong. It comes out on March 29th. Everybody Knows is the latest film from Asghar Farhadi, the director of A Separation and The Salesman. It looks like another small but intensely dramatic film, this time about a girl being abducted. Unfortunately, this trailer doesn’t give a great sense of what to expect, probably because it’s trying to hide the fact that the film is in Spanish. It comes to the US on February 8th.This is kind of wild. Ruth Wilson plays her real-life grandmother in this adaptation of her grandmother’s memoir, which quickly takes a very surprising turn. The history behind this makes it fascinating enough, but the story itself should be compelling, too, since it seems to leap into the territory of a spy novel. It comes out sometime next year.I am 100 percent here for a film romance between Julianne Moore and John Turturro, even if, inevitably, it all has to go bad by the end. What’s really interesting here: Gloria Bell is actually a remake of a movie called Gloria that this same director made five years ago in Spanish. The film — and Moore’s performance — have been getting high praise, so this’ll be something to look for when it comes out on March 8th.Here’s the full trailer for Roma, Alfonso Cuarón’s first film since Gravity. It’s quiet, it’s black-and-white, and Netflix evidently thinks it’s going to be a very big deal: the film is getting screened in theaters for a couple of weeks before it starts streaming — something the service doesn’t usually do. The film will come to a small number of theaters starting on November 21st, then it will go online on December 14th.Stephen Merchant directs this very odd comedy about a pair of siblings trying to break into the wrestling world. Naturally, The Rock makes an appearance or two. It comes out on February 22nd.Buffalo Boys is Singapore’s submission for next year’s foreign language Oscar — something that you might be surprised to hear after watching this entirely English language trailer. But the film is in both English and Bahasa, according to Variety, and it’s directed by Indonesian film producer on Mike Wiluan. It comes to the US on January 11th.Command Line delivers daily updates from the near-future."}