{"id": "Daredevil’s ‘suffering makes a man’ trope is common, familiar, and bad for everyone", "paragraph": "Like the first two seasons of Netflix’s Daredevil series, the third season loves to show its hero getting beaten up. For the first few episodes, Daredevil, aka Matt Murdock (Charlie Cox), is convalescing after the events in Netflix’s Defenders crossover miniseries, and the camera lingers lovingly on his battered face and body, watching him stagger about the screen in an ecstasy of infirmity and pain. When he’s somewhat recovered and back battling bad guys, the fight sequences are grinding, extended affairs. Viewers are meant to feel it viscerally every time a nose shatters or a rib cracks. Murdock emerges from each conflict bloodied, bruised, and exhausted — and in one notable instance, with a pair of scissors sticking out of his chest. Daredevil depicts Matt Murdock in pain because enduring that pain is what makes him a hero. He’s not alone, either. Whether it’s Daniel Craig laughing and joking through a brutal testicle-whipping in Casino Royale, or Bruce Willis pulling broken glass out of his bare feet in Die Hard and continuing to fight, men in action movies and television series are constantly expected to shrug off tremendous damage, including being shot, stabbed, and graphically tortured. These narratives of stoic anguish make it seem natural and unremarkable for men to coldly ignore pain in real life. And at the same time, the trope usually makes women’s suffering seem uninteresting or marginal.The most obvious result of glamorizing and exaggerating men’s imperviousness to pain is that men who suffer feel like they are supposed to endure it without complaint. Deadpool 2, as just one example, actually starts with the protagonist trying to kill himself out of grief. He literally blows himself into small pieces — but he has regenerative powers, so he’s back in the next scene, wisecracking and complaining. His attempted suicide is played off as a joke; his depression and despair are just another way to demonstrate his invulnerability.The Deadpool version of the story is an extreme exaggeration, and just one of many gags that’s reaching for subversion by making light of the most serious subjects the screenwriters can find. But the “heroes suffer, and it doesn’t slow them down” cultural trope does reflect a common social stereotype. Men are expected to shrug off setbacks and power through emotional difficulties without sharing or showing them. Films glamorize heroes who don’t feel anything but anger or fear — and who then find ways to make the anger dominant. It’s a culturally ubiquitous message that makes it more difficult for men to seek help when they’re emotionally distressed or depressed. That’s part of the reason men account for 77 percent of suicide deaths in America, killing themselves at almost four times the rate that women do. “Women are far more likely to acknowledge that they have depression and seek help,” according to Amit Anand, a professor of medicine at the Cleveland Clinic’s Lerner College of Medicine.Pushing through pain is supposed to be heroic and manly. But pain is even more validating if it’s suffered in pursuit of some worthy goal, like protecting weaker people through the sheer force of endurance. Daredevil’s injuries are the result of fighting the good fight; he’s battling to save his city and to stand between his friends and the dangers that threaten them. He isn’t beaten and tortured for no reason — it’s in the line of the duty he’s chosen for himself. Like most superheroes, he shows his strength by using it on other people’s behalf. The idea that it’s honorable for men to suffer while doing their job is similarly reflected in the real world, and it comes out through workplace injury numbers. Getting injured on the job is overwhelmingly linked to gender. The Bureau of Labor Statistics found the men were the victims of 93 percent of fatal work injuries.Men are injured so often at work in part because sexist barriers to hiring women, plus the gender expectations for certain jobs, mean that high-risk occupations are often overwhelmingly male. The 11 people killed on the Deepwater Horizon in 2010 were all men, for example, because jobs on oil rigs are overwhelmingly male. As on oil rigs, so at war: while women make up a greater share of military personnel than they did in the past, men continue to be the vast majority of soldiers on active duty — 85 percent in 2015. That’s reflected in death tolls; as of 2018, the conflict in Afghanistan has killed 2,297 American men and 50 women.But men are also vulnerable to injury because they’re more likely to indulge in high-risk behaviors than women. Daredevil insists on trying to prepare himself for combat even when his injuries mean he’s hardly able to stand. Guys are socialized to disregard their health, safety, and lives in pursuit of a greater cause — whether that’s fighting crime in New York, or extracting oil. And by the same token, because it’s supposed to be okay for men to sacrifice their health for work, companies have less incentive to make heavily male, high-risk workplaces safe. Similarly, war is justified because it gives men a chance to prove themselves through endurance and callousness. The famous ambivalently anti-war film Full Metal Jacket ends with its main character, Joker, forced to shoot a wounded sniper in cold blood. That moment of psychological trauma is painful, which is meant to make it validating. “Hardcore,” one of the onlookers breathes as the deed is done, and Joker — who is, appropriately, his outfit’s joker — becomes a warrior.It’s no accident that the sniper Joker shoots is a woman. Male suffering onscreen often is built on female suffering, which it obscures and expropriates. The trope-definining instance came in a 1994 Green Lantern comic, in which the hero discovers his girlfriend murdered and stuffed in their refrigerator. Pointing to this comic in particular, comic writer Gail Simone coined the term fridging to describe the common plot device in which a woman is murdered, mutilated, or sexually assaulted in order to traumatize the man closest to her, giving him a worthy motive for violence and revenge.But the strange flip side of the cultural emphasis on tough, impervious men is that when men do let their pain out, they may be taken more seriously than women, because of the assumption that women are emotional all the time, while any emotions men are unable to hold inside must be overwhelming. “We are primed, almost from birth, to find men’s emotions more serious and more worthy of empathy than women’s,” author Sady Doyle wrote earlier this month, in response to the Senate testimony of Supreme Court Justice nominee Brett Kavanaugh. In his response to sexual assault allegations, Kavanaugh shouted, cried, and belligerently claimed to have been wronged, putting his pain on display. That resonated for many viewers because male pain is such a powerful narrative trope, and men expressing it openly goes so counter to cultural expectations that it’s taken seriously when it happens.Some commenters criticized Kavanaugh for his weakness in breaking down, but others were clearly moved by the spectacle he made of his suffering. “Men can afford pain,” Doyle wrote, “because when faced with the spectacle of male pain, our culture’s first instinct is to look for whatever is making him uncomfortable and remove it  —  and, more often than not, what is making him uncomfortable is a woman asking for more than he’s prepared to give.”Daredevil season 3 is also built on the erasure of a woman’s agony. The Defenders ends with a building falling on Daredevil and his love / nemesis Elektra (Elodie Yung). The physical punishment Daredevil suffers is a reflection of the inner torment he feels because he’s responsible for Elektra’s death. Her suffering is more a part of his story than her own; it adds interest to him, without being important in itself. In the same vein, newly introduced Daredevil villain Bullseye (Wilson Bethel) is a troubled young man whose violence is motivated by one woman who dies of cancer, and another whom he stalks and frightens. The suffering of women is a narrative sideline, which motivates two men to dramatically, viciously beat the snot out of each other.Like so many action heroes, Daredevil is cool because he’s tough. He gets punched and kicked and he just keeps punching back. Pain and manliness validate each other in action stories, creating wish-fulfillment scenarios where the audience can imagine being just as calm under fire as their heroes, just as impervious to any physical or emotional pain they feel, just as capable of shrugging off whatever hurts or frightens them. But an obsessive focus on men expressing themselves primarily through anger and invulnerability can make suffering seem heroic in itself — which is why the series, in every season, is so eager to show scenes of Daredevil torturing people. When pain is what makes a man, everybody of every gender who comes in contact with men ends up suffering along with them.Command Line delivers daily updates from the near-future."}