{"id": "Verizon will launch RCS text messaging in early 2019", "paragraph": "Yesterday at a small, business-focused GSMA event in New Jersey, Verizon’s SVP of consumer products, Aparna Khurjekar, announced that Verizon will launch support for RCS messaging in “early 2019.” The move is potentially significant as RCS is the new texting standard set to replace SMS just as soon as carriers around the world update their systems to support it.More specifically, RCS Chat will replace SMS if carriers update their systems to support the “Universal Profile,” the version of RCS technology that allows messages to interoperate cleanly between carriers. Currently, very few do; in the US, that list includes Sprint, US Cellular, and limited support on T-Mobile. Other carriers like AT&T and Verizon use a proprietary texting system. Redditors have been maintaining a spreadsheet of carriers that do and don’t support the Universal Profile.I’m told by the GSMA that Verizon’s RCS will support Universal Profile 1.0, but we spoke to Verizon, and the company wouldn’t confirm that the RCS launch will support it, nor would it nail the timeline down more specifically. Hopefully, Khurjekar is referring to full, Universal Profile RCS. If so, it would be a significant step toward supporting Google’s plan for next-generation texting on Android phones, RCS Chat. It’s a system that turns basic carrier texting into something more full-featured, with support for typing indicators, group chats, high-resolution media, and read receipts. It also, unfortunately, will be unencrypted. The New Jersey event was focused on Business Messaging, which seems to be the thing driving carrier interest, instead of creating a coherent and robust messaging system for consumers. Whatever works to make it happen! 3C, a mobile marketing company that has produced chatbots like this one for Walgreens, believes that RCS will reach 147 million users by the end of 2019. A little more than a week ago Fierce Wireless noted that Twilio — a messaging-focused business with a penchant for lighthearted experiments — indicated that it believed Verizon would launch support for RCS in February. According to a Seeking Alpha transcript, Twilio’s CFO said thatPreviously, Verizon has treated all P2P, or person to person and A2P or application to person, messaging the same. Starting in February, Verizon is planning on creating a new service offering, which will add a quarter of the penny fee per message to all businesses with A2P SMS messaging use cases.Read between the jargon lines there, and you’ll see that Verizon is lining up the pieces to launch a broader messaging offering.We’ve reached out to AT&T and Google about this story, and as of press time, we haven’t heard back. However, earlier this month, AT&T provided us with the following statement about its RCS support:AT&T launched RCS on Android devices as ‘Advanced Messaging’ in 2015 as part of our messaging app for no additional cost. We are currently completing a network upgrade to support the Universal Profile, and anticipate evolving our network and device support in line with upgrades to the GSMA standards.In any case, things are finally, definitely happening. Whether it’s small announcements at business forums or strange internal Verizon messages regarding Pixel 3 support for RCS, it seems the replacement for SMS is finally coming — just years later than we’d hoped. The next question, besides “when,” will simply be this: will it be as truly “universal” as it needs to be to work? We have to wait for the carriers, Google, and Apple (which hasn’t announced any support for RCS whatsoever) to finish building out their systems to see.Command Line delivers daily updates from the near-future."}