{"id": "Over 20,000 Google employees participated in yesterday’s mass walkout", "paragraph": "More than 20,000 Google employees and contractors participated in the mass global walkout yesterday to protest the company’s handling of sexual harassment allegations against top executives, according to organizers of the protest who published a Medium post this evening. As of September 30th, 2018, Google had 94,372 full-time and contract employees worldwide, meaning more than 20 percent of the entire company participated in the walkout. The event was sparked by an investigation from The New York Times that revealed how Android co-founder Andy Rubin was paid $90 million upon his exit from the company after it learned of a sexual assault allegation against him.“We have the eyes of many companies looking at us,” Google employee Tanuja Gupta said in New York, according to the event organizers, who have assembled under the name Google Walkout for Real Change. “We’ve always been a vanguard company, so if we don’t lead the way, nobody else will.” According to the organizers, Google employees participated primarily from the company’s US offices, but also in I offices located in Australia, Brazil, Canada, Germany, India, Ireland, Japan, the Netherlands, Philippines, the UK, Singapore, Sweden, and Switzerland. For immediate release: 20,000 Google employees and contractors participated in “global walkout for real change” in 50 cities worldwide on November 1, 2018. https://t.co/cOGmohJaEw #GoogleWalkoutIn addition to the figure, which was not publicly disclosed yesterday because participants were still being counted, the walkout organizers say Google CEO Sundar Pichai has agreed to meet with them on Monday to “review a plan that would address” five key demands. Those demands include: an end to forced arbitration in cases of harassment and discrimination; a commitment to “end pay and opportunity inequity”; a publicly-disclosed sexual harassment transparency report; an “inclusive process” for reporting sexual misconduct safely and anonymously; and a “commitment to elevate the Chief Diversity Officer to answer directly to the CEO and make recommendations directly to the Board of Directors.”The organizers are also calling on Google to appoint an official employee representative to its board. “Google is famous for its culture, but in reality, we’re not even meeting the basics of respect, justice and fairness for every single person here,” organizer Claire Stapleton said yesterday, according to the organizers’ post. Google was not immediately available for comment. Command Line delivers daily updates from the near-future."}