{"id": "Xiaomi made a 150-inch $2,000 laser projector exclusively available at Walmart", "paragraph": "Xiaomi has a couple of new products out in Walmart and gave press the rundown today at an event in New York City. The first is a 150-inch laser projector going for $1,999.99 at Walmart doubles up as a television with Android TV. It may seem overpriced for what it is, but it also marks one of Xiaomi’s infrequent expansions into American offerings.There are a couple of things to break down here, namely that projector is oddly expensive for a 1920 x 1080p screen. Xiaomi says it has no concrete plans to bring a 4K version to the US, and that this is the same model it’s sold in China. You could have found cheaper 1080p projectors back in 2016. Still, the laser projector has a number of positives including an ultra-short throw, so it can be placed 20 inches from the wall and still display a bright, colorful image, in contrast with other projectors that might need to be placed at the back of a room and show a more faded image. There’s also a detector on top of the projector so if you get too close to the laser, the projector will shut off its light automatically to prevent you from damaging your eyes. The device also comes with a corresponding remote control with which you can summon Google Assistant.There are three HDMI 2.0 ports, two USB ports, and Wi-Fi and Bluetooth compatibility. It also has four speakers that support Dolby audio. The sound coming from the Mi Laser Projector is relatively decent, with minimal bass. It’s enough to enjoy your average pop song, but probably not great for listening to finely tuned orchestral music or bass-intensive dubstep.  Xiaomi also launched a Mi LED Desk Lamp for $39.99, a Yeelight LED Light Bulb for $19.99, and a Mi Bedside Lamp for $44.99. Most of these are pretty self-explanatory smart light devices where you can adjust the brightness and coolness of the light via the corresponding Mi Home app. All of them come in a very generic white design.There’s also a smart plug for $14.99 which lets you control power flow to regular home appliances through the Mi Home app, thus turning a regular appliance like a coffee machine into something you’re able to switch on and off remotely. Additionally, Xiaomi made a second generation version of its Mi Box, called the Mi Box S, which runs on Android TV 8.1 and costs $59.99. All of the products are compatible with Google Assistant.All of the products are available now in the US through Walmart. It’s not the first time that Xiaomi has partnered with Walmart to sell products in the US, although the company is certainly diversifying its offerings over time. We’ve asked Xiaomi if it plans to offer Black Friday deals on these products and will update this piece with further details.Command Line delivers daily updates from the near-future."}