{"id": "AT&T says its 5G network is launching ‘in the next few weeks’", "paragraph": "AT&T promised at the beginning of the year that it would be launching a real, standards-based 5G network at the end of 2018, and during its latest earning call, CEO John Donovan confirmed those plans, promising that the network would be launching “in the next few weeks,” via Phone Scoop.This would be an authentic next-generation 5G network, unlike the “5G Evolution” network that it rolled out last year, which essentially amounted to the same 4G LTE improvements that its competitors were doing under some creative branding. Again, given that AT&T had already promised the launch of its 5G network sometime before the end of the year, and the fact that the end of the year is a few weeks away (I know, right?), Donovan’s commitment to launching isn’t huge news, especially given that AT&T has already been testing its network since February.\n    Related\n  Strictly speaking, Verizon has beaten AT&T to the punch for the first 5G network in the US, launching its early 5G network in Houston, Indianapolis, Los Angeles, and Sacramento at the beginning of October. But Verizon’s network isn’t based on the 3GPP’s 5G NR specification, instead using a different, earlier standard called 5G TF that it intends to upgrade to 5G NR sometime in the future. Additionally, Verizon’s current network is a fixed 5G network for stationary home internet, not the mobile devices that you’re probably thinking of when you think of cellular internet.AT&T’s network, if all goes as planned, would be the first US network to fully launch both a 3GPP standards-based 5G NR system as well as a mobile network (although there are still basically no devices that support it yet). Less clear is how extensive AT&T’s 2018 launch will be — currently, AT&T has been testing 5G in Charlotte, Raleigh, Oklahoma City, Dallas, Atlanta, and Waco, marking just six of the total 12 cities it promised in January to roll out 5G to in 2018.Command Line delivers daily updates from the near-future."}