{"id": "Chevy’s new electric Camaro is the near future of EV drag racing ", "paragraph": "GM made a fun surprise announcement at this past week’s Specialty Equipment Market Association (SEMA) trade show: an all-electric Chevrolet Camaro concept with 700 horsepower meant to bust out a quarter mile run in about nine seconds. And unlike EV performance cars like the NIO EP9 or the upcoming second-generation Tesla Roadster, which are purpose-built, the Camaro concept appears to be a beautiful, cobbled-together Frankenstein’s monster of a car. The car, dubbed the eCOPO Concept (after the original COPO Camaro special order performance models from the late 1960s) looks like any other modern Camaro from the outside, even in electric blue paint. Inside is much different. For instance, the eCOPO is powered by a combination of BorgWarner electric motors, which are the same ones used in these Daimler electric trucks. The motors draw power from an 800-volt battery pack, which is twice as much as you’d find in a Chevy Bolt. But the eCOPO doesn’t use a “skateboard” style battery pack that takes up the whole floor of the car, which is pretty much the standard for EVs these days. Instead, the pack is split into four 200-volt modules that are tucked into different spots around the car’s frame: two sit in the rear-seat area, and two are in the trunk, with one over the rear axle and one taking up the spot where the spare tire usually goes. GM says distributing the mass of the batteries like this helps improve performance on a drag strip, as it gives the car a 56 percent rear weight bias, which helps on launch. But it also shows how much of a sort of clever workaround effort this was on the part of Hancock and Lane, an electric drag racing team that helped Chevy build the car. “This project exemplifies Chevrolet and General Motors’ commitment to engaging young minds in STEM education,” Russ O’Blenes, the director of performance variants, parts, and motorsports at GM, said in a statement. “It also represents our goal of a world with zero emissions, with the next generation of engineers and scientists who will help us get there.”  GM’s brands aren’t involved in any of the current EV racing series like Formula E, but the eCOPO might be a sign that they’re thinking about it as the company moves its fleet toward hybrid and electric power. And they’re approaching it in an interesting way that might make electric racing a bit more accessible.“I like that they’re using proven off-the-shelf components and that they’re pushing electric vehicles into motorsports,” automotive journalist Bozi Tatarevic tells The Verge. “The motor that they are using is obviously stout since Daimler chose the same one for the eCanter. The inverters they are using are widely available and match up with their claims of running 800 volts.”  Perhaps most important, Tatarevic says, is that the housing for the electric motors matches  that of GM’s combustion LS motors, which are supremely popular. This “offers an opportunity for other race cars to adapt the same system if they decide to offer it as a crate package,” Tatarevic says, theoretically making it easier for people to explore EV drag racing beyond just bringing their Tesla to the track. O’Blenes admitted as much in the official press release. “The possibilities are intriguing and suggest a whole new world for racers,” he said. “Chevrolet pioneered the concept of the high-performance crate engine right around the time the original COPO Camaro models were created, and the eCOPO project points to a future that could include electric crate motors for racing, or even your street rod. We’re not there yet, but it’s something we’re exploring.”The eCOPO is far from the first muscle car that’s been retrofitted with electric power. Three years ago we met a man who turned his 1968 Ford Mustang into an 800-horsepower electric monster. A Maryland-based company called Genovation recently transformed a modern Chevy Corvette into a similarly powerful EV. Seeing a company support the effort to make a car like this, though, signals that there’s interest in electric racing beyond purpose-built solutions like Formula E’s cars. In fact, the National Hot Rod Association (NHRA) praised the concept this week. “Chevrolet’s dedication to innovation and performance is evident in this new concept vehicle,” NHRA president Glen Cromwell said in a statement. “NHRA has been discussing and exploring how electric cars are evolving to determine how they will shape the future of drag racing. The new COPO Camaro is an exciting development in that process.”Command Line delivers daily updates from the near-future."}