{"id": "Comcast should be investigated for antitrust violations, say small cable companies", "paragraph": "An industry group wants antitrust regulators to investigate whether Comcast-NBCUniversal is abusing its power to hurt smaller television and internet service providers. The American Cable Association (ACA), which represents over 700 small and medium-sized cable operators, has asked US Assistant Attorney General Makan Delrahim to “immediately” open an investigation into Comcast’s practices. Comcast denied that the claims have merit, and the Justice Department hasn’t publicly responded. But the ACA has found a potential supporter in President Donald Trump — who tweeted about its claims this afternoon.The ACA claims Comcast has a uniquely powerful hold on the US cable industry because it controls a large chunk of “must have” programming like NBC’s regional sports channels. The group argues that the Comcast “has shown a willingness to harm rivals” in the past, even while bound by a 2011 consent decree that expired earlier this year. The letter is dated November 6th but was published today, after Fox Business Networks reported on its existence last week.Trump appears to have caught a follow-up Fox Business segment today, prompting a tweet about the ACA:American Cable Association has big problems with Comcast. They say that Comcast routinely violates Antitrust Laws. “These guys are acting much worse, and have much more potential for damage to consumers, than anything AT&T-Time Warner would do.” Charlie GasparinoContra Trump’s description, the letter doesn’t seem to describe “routine” violations of antitrust law. It’s primarily arguing that there’s a huge risk of Comcast abusing its market position, while explaining just how much damage could result if Comcast did so. The ACA has put forward more concrete claims in the past, though — like a 2017 complaint that Comcast was forcing smaller cable providers to bundle unwanted NBC-owned channels into TV packages, driving up their costs.ACA communications VP Ted Hearn says companies will only disclose Comcast’s alleged misbehavior as part of a confidential Justice Department investigation. “ACA member providers have extensive ongoing dealings with Comcast-NBCU and are naturally concerned that the media giant will engage in retaliatory actions should they publicly disclose information about how Comcast-NBCU has unreasonably disadvantaged them,” Hearn tells The Verge. “This process will enable the Department to conduct a thorough examination of the facts, and the Department can then disclose its results at the appropriate time.”Comcast provided The Verge with a statement denying any wrongdoing. (Disclosure: Comcast is an investor in The Verge’s parent company, Vox Media.) “At Comcast NBCUniversal, we are competing in this dynamic environment the way we always have — by continuing to innovate and conducting our business in compliance with antitrust laws and other legal requirements,” writes senior vice president Sena Fitzmaurice. “We believe that ACA’s letter is without merit and constitutes an inappropriate attempt to gain leverage in the commercial marketplace.”The Justice Department is currently trying to stop a merger between AT&T and Time Warner, and the ACA strategically argues that Comcast is more dangerous than those companies combined. But the department may already have its sights on Comcast. In August, Delrahim warned Comcast that it would continue monitoring potential antitrust threats even after the consent decree expired. Last month, Delrahim also said the Justice Department would investigate whether Comcast was using its 30 percent share in Hulu to undermine the streaming video service, which competes with traditional cable.The ACA’s letter also raises concerns involving Hulu, suggesting that Comcast could effectively hold the service hostage. “We have heard from ACA members that they fear that ComcastNBCU may restrict, if it is not already restricting, their ability to access Hulu and make it available to their customers as an alternative to their cable offerings,” reads the letter. (Hulu is generally found on the web, but cable operators can add it as a “channel” for more traditional TV viewing.) However, Comcast only holds a minority share in Hulu, and it will have even less influence after a Disney-Fox merger gives Disney control over 60 percent of the service.Trump has vocally denounced monopolistic behavior among increasingly consolidated tech, media, and telecommunications companies; he also opposed the AT&T-Time Warner merger. But his complaints often look like outgrowths of unrelated personal grudges — Time Warner owns CNN, a network Trump loathes, for instance. Trump once called the NBC news network “worse than even CNN” and implied that NBC should have its broadcasting license revoked, so it’s not surprising he’d promote a complaint about its parent company.President Trump has a history of attacking companies and never following up. But regardless of how seriously he takes this complaint, the ACA is tapping into some existing concerns by the Justice Department.Command Line delivers daily updates from the near-future."}