{"id": "Bavaria’s space program shot to viral fame — but it may be in trouble", "paragraph": "Markus Söder, the prime minister of Bavaria, a southeastern state in Germany, has been wildly ridiculed about the announcement of his new space program, Bavaria One. But the plan is not that outlandish.Söder launched himself to international attention through his attempts to create Bavaria One. When the politician from the Christian Social Union (CSU) party announced his “Mission Future,” many Germans thought it was a joke. But Söder caught worldwide attention with a tweet in October: a photo that shows him speaking with a Star Trek-inspired emblem of his face displayed behind him, captioned “Bavaria One.”Zukunft heißt Technologie. Bayern ist Marktführer: wir investieren in Digitalisierung, Robotik, künstliche Intelligenz, Hyperloop und Raumfahrt und entwickeln sogar Quantencomputer. pic.twitter.com/v3GpSi7YP5“The future means technology,” Söder said in his speech. “Bavaria is the market leader: we invest in digitization, robotics, artificial intelligence, hyperloop and space travel, and even develop quantum computers.”The picture immediately went viral, inspiring hashtags like #SpaceSöder and #BavariaOne. Germans, inspired by Little Peter’s Journey to the Moon, a children’s tale, dubbed this event “Little Söder’s Journey to the Moon.” One enterprising user Photoshopped the faces of Bavarian politicians onto the Star Trek crew members. Bavaria’s “Mission Future” was renamed online: “Mission Moonface” or “Mission Megalomania.”It was part of an election campaign, of course, which ended on Sunday with the CSU politicians losing their majority. There were other issues at play, too: the populist appearance of CSU leader and German interior minister Horst Seehofer and the dispute over asylum policy also damaged the Bavarian CSU, as well as issues such as the environment, affordable housing, and education. Additionally, Prime Minister Söder is considered a credible and good prime minister by only half of Bavarians. The defeat doesn’t kill Bavaria’s space ambitions, though. The logo is fake, adapted from the youth organization associated with CSU, which used the Star Trek-inspired emblem to campaign for Söder. Bavaria One, however, is very real.Bavaria aims to transform itself into the most important place for aerospace innovation over the next decade, and it has budgeted €700 million for the project, primarily to expand existing facilities. The expansion of the Technical University of Munich’s campus is expected to cost around €100 million. Over the next five years, Bavaria plans to invest €30 million annually in the campus. Where the rest of the budget will be allocated has not yet been determined. The Bavarian government adopted the strategy, following a presentation by Söder in April, on October 2nd. The Bavarian minister of economics, Franz Josef Pschierer, was appointed as “space coordinator” and tasked with implementing the plan. As private companies spring up to replace — or compete with — the traditional state-sponsored space programs, Bavaria sees an opportunity to become a global player. The central hub for Bavaria One will be Ottobrunn, a small town southeast of the state capital of Munich. There are already facilities at the Technical University of Munich, and they’ll be merged into an interdisciplinary center for aviation, aerospace, and geodesy, which is the discipline for measuring Earth. Ottobrunn is ideal because it’s close to existing aerospace companies such as Airbus Defense and Space. The 10-point strategy for Bavaria One outlines more than 55 new professorships in the coming years, along with 132 new positions and almost 2,000 study places planned. Boosting the plan is the fact that Bavaria is already something of a space center. In Ottobrunn, Airbus already manufactures solar panels for satellites as well as space propulsion systems and thrust chambers for the Ariane 5 launch vehicle. Bavarian space fans are proud of the NIRSpec, a near-infrared spectrometer that helps NASA’s James Webb Space Telescope detect the weakest radiation from galaxies. As for Bavaria One’s goal of being a “center of excellence” that conducts cutting-edge research in space robotics and exploration technology, the research center for the German Aerospace Center (DLR) is based in the same region in Oberpfaffenhofen.Satellites are a major focus of Bavaria One. They offer a bird’s-eye view of Earth, which is useful for measuring cities or landmarks, improving responses to natural disasters, or helping farmers tweak their methods. Small satellites are of a particular interest, said Ulrich Walter, a professor of astronautics at the Technical University in Munich and a former astronaut, in an interview with Der Spiegel. Walter is also behind the Bavarian space strategy. The way he sees it, cheaper, smaller, and more specialized satellites are the cornerstone of the Bavaria One plan. US companies OneWeb, which is designing “internet from space” using hundreds of satellites, and Planet, a startup that builds low-orbit satellites for tracking deforestation, should expect competition from Bavaria. In 2022, Bavaria plans to send its first satellite to space. BavariaSat is an Earth observation satellite with sensors, a robot arm, and a video camera. A bus promoting the Bavaria One plan will visit schools and universities, giving people the opportunity to remotely control the robot arm. The campaign is intended to inspire citizens to take an interest in spacecraft, but it also reeks of being a stunt.It’s not just satellites representing Bavarian ambition, however. The plan also calls for a 400-meter (1,212-foot) track for testing hyperloop prototypes. The student team WARR from the Technical University of Munich currently holds the world speed record for hyperloop pods, with a final speed of 290 miles per hour. But what does that have to do with space? In 2018, group members incubated a brand-new space startup, Isar Aerospace. The startup, which just completed a seed round of funding, is developing parts of launch vehicles to transport small satellites more cheaply and efficiently into space. Startups like Isar Aerospace are slated to receive more funding and support under the Bavaria One plan, and the plan also calls for startups, researchers, and industry partners to work together closely. Mostly, the Bavaria One strategy is a plan that continues existing activities and adds a garnish of buzzwords plus a sprinkling of cash. Expanding Bavaria’s space expertise is smart, even if €700 million isn’t nearly enough to achieve its ambitious goals. (Expanding the campus in Ottobrunn alone is likely to eat up a great deal of the budget.)But the elections have passed, and the CSU no longer holds the absolute majority in the state parliament. That may keep Bavaria One from taking off since the CSU is likely to make a coalition with the Free Voters Party, whose head, Hubert Aiwanger, is one of the sharpest critics of Bavaria One. In a coalition, he said in a radio interview with “Bayern 2,” the CSU must “say goodbye to some megalomania projects” — like the space program. Command Line delivers daily updates from the near-future."}