{"id": "It’s your last chance to get a free copy of Red Dead Redemption 2 in the latest PS4 Pro bundle", "paragraph": "\n    Welcome to Good Deals, a Verge-approved roundup of the best tech deals, in partnership with Vox Media's commerce team.\n  The busy product launch season is beginning to wind down, though we’re still expecting big news for both the iPad and Mac lineup out of Apple’s October 30th event in Brooklyn. In terms of what’s next, Black Friday and Cyber Monday will present an opportunity to buy a lot of this year’s best tech at a rare discount. We’re not there quite yet, but there are a few deals that are worth checking out in the meantime.Not without its share of prerelease controversy, Red Dead Redemption 2 will release next Friday, October 26th, and if you haven’t yet purchased a console to play it on, this is your last chance to buy the PS4 Pro bundle that includes the game for free. Amazon is bundling the third-generation Echo Dot and Xbox One consoles together at no additional expense. You can get the Echo Dot in the color of your choosing with either the Xbox One S or Xbox One X.Nvidia’s GeForce RTX 2070 launched this week, which means that graphics card prices are about to drop. We’ll continue having our eyes out for affordable GTX 10-series GPUs, but if you want the new gear, we’re documenting the most affordable ray-tracing graphics cards into one place.Anker’s Nebula Capsule is a special kind of portable projector. It runs on a bespoke version of Android with access to the Play Store, and it doubles as a pretty decent Bluetooth speaker. Tile is a great stocking stuffer, especially with Best Buy’s promotion. If you buy a pack of four Tile Bluetooth trackers, you’ll get a Google Home Mini smart speaker included for free.We’ve worked with Optoma NuForce to give Verge readers a discount on its BE Sport 4 wireless headphones. This model boasts good sound performance and noise isolation, and includes plenty of tips and fins to ensure a comfortable fit.Command Line delivers daily updates from the near-future."}