{"id": "This might be Google’s budget Pixel, complete with headphone jack", "paragraph": "Surely you remember the fateful week when Google’s big day was spoiled — when Russian bloggers revealed the Pixel 3 phone to the world in all its glorious detail? We still don’t know how, exactly, a batch of phones fell into their hands, but it may have just happened again: Russian tech blog Rozetked claims that you’re looking at the first images of the “Pixel 3 Lite.”And unless our eyes deceive us, this phone comes with a bona fide headphone jack. According to the publication, this Pixel 3 Lite has a 5.56-inch, 2220 x 1080-pixel IPS display, a plastic case, and a Snapdragon 670 processor, all of which would make it a cheaper Pixel but probably not a smaller one. The existing Pixel 3 has a 5.5-inch screen, too — but Google’s unprecedentedly expensive $800 flagship has a more expensive OLED panel that’s nearly on par with the screens in Samsung’s Galaxy S9 and the iPhone XS, according to Dieter’s Pixel 3 review.There are reasons to take this leak with a grain of salt, though, even though Rozetked was the first publication to bring us a blowout of the Pixel 3 XL, and even though a cheaper Pixel has long been rumored to be in development.First off, it’s bugging me that the logo on the back of the phone looks wrong. It’s supposed to be a G, not a C, as those previous images of the leaked Pixel 3 XL clearly showed. I’ve also got to wonder whether it makes strategic sense for Google — would it want to start yet another round of blowback about missing headphone jacks, after first mocking Apple for dropping them and then getting roundly thumped for ditching the jack themselves in the Pixel 2? Also, don’t forget that none other than Google head of hardware Rick Osterloh was the one to quash those first rumors of a cheaper Pixel in March 2017, with the words “Pixel stays premium.”Companies and people can change their minds, of course. And the apparent codename of this phone, Sargo, did appear buried in the code for Google’s ARCore app a while back. (You can thank Android Police for that tidbit.) But we need more evidence.Command Line delivers daily updates from the near-future."}