{"id": "Red Moon is a novel full of fascinating ideas that never come together ", "paragraph": "Kim Stanley Robinson is known for his heady and thought-provoking science fiction novels. Aurora turned the concept of a generation ship on its head, following a decrepit interstellar ship sailing for a moon in the Tau Ceti system, while New York 2140 examines the economics of climate change. His latest, Red Moon, is set within spitting distance of today, envisioning the power struggle between an ascendant China and a declining United States. While it’s chock-full of ideas, it’s an underwhelming read compared to his recent stories. China’s rise as a major power has become a curious focus for science fiction in recent years. This isn’t even the first book depicting lunar clashes between China and the US this year — David Pedreira’s novel Gunpowder Moon imagines geopolitical pawn pieces maneuvering around one another as the crew of a mining outfit try to avert war. Robinson’s book is a bit more subtle when it comes to imagining outright conflict, but he does use the novel to cover the friction between nations as they contend with one another beyond Earth. When the novel opens, a technician named Fred Fredericks is visiting the Moon for the first time, tasked with delivering a quantum-enabled phone to a Chinese client, governor Chang Yazu. His meeting goes disastrously wrong. Upon shaking Yazu’s hand, the official drops dead from poison placed on Fredericks’ hand. Fredericks barely survives, and upon waking up, he discovers that he’s the prime suspect in the murder. He’s quickly shuffled off of the Moon along with a young woman named Chan Qi, who got pregnant — a violation of local regulations. Qi turns out to be the daughter of a high-ranking Chinese official who has his eyes on power in the Chinese government. As the pair flee between the Earth and Moon (and back again), we come across anonymous Chinese intelligence officials, American secret service, and a travel blogger / poet, all while a Chinese black unit called Red Spear works to hunt them down — both to close the loop on the original murder, but also to prevent Qi from becoming a sort of spiritual leader for a restless global population. Over the course of this story, Robinson explores some intriguing themes: what does China look like a handful of decades from now, and how does it contend with balancing its ascendant foothold when it comes to global politics and a large population of disadvantaged people? He drops in elements like artificial intelligence, Hyperloop, cryptocurrencies, and vast governmental surveillance, and seems to be focusing all of these various elements toward a society that will be drastically changed by the tools available to them — and which isn’t well-equipped to handle the transformation. Unfortunately, while all of that has the potential to be fascinating, Red Moon is a book that never really gels between all of its component parts. Tracked and chased by rogue elements of the Chinese government, Fredericks and Qi’s scramble to escape is both exciting — and extremely boring. Fredericks and Qi spend pages talking about a variety of topics, from philosophy to history to quantum physics. The transformation that Robinson hints at has its roots in today, but it feels like the book is missing a key character or viewpoint to tie it all together. Robinson has certainly used his books to expound on everything from the impact of capitalism on climate change, or the intricacies of how you’d colonize Mars, but in those cases, they’re packaged right alongside solid characters and a narrative that draws you in. That’s not really the case here, and while the individual components are interesting in and of themselves, the book just doesn’t stack up alongside his prior works. Command Line delivers daily updates from the near-future."}