{"id": "With FilmStruck disappearing, Criterion is launching its own streaming service", "paragraph": "In the wake of WarnerMedia’s decision to shutter FilmStruck, The Criterion Collection is planning to launch its own standalone streaming service in spring 2019.The new service, “The Criterion Channel,” will allow subscribers to stream the company’s library of celebrated films, ranging from Hollywood classics to arthouse cult films and foreign pictures. A blog post on the company’s site confirms The Criterion Channel will also be available on “WarnerMedia’s new consumer platform when it launches late next year.” The decision to launch The Criterion Channel follows the heartbreaking news for cinephiles that FilmStruck, Warner Bros.’ classic Hollywood movie streaming service, would shutter at the end of November. FilmStruck had an exclusive license to stream Criterion’s films. Deadline reported that WarnerMedia was working on a way to ensure that FilmStruck devotees would still be able to stream their favorite movies, and this could be the compromise hinted at in the outlet’s report. Multiple directors and actors, including Martin Scorsese and Steven Spielberg, personally asked Warner Bros.’ chairman, Toby Emmerich, to bring FilmStruck back.“The Criterion Channel will be picking up where the old service left off, programming director spotlights and actor retrospectives featuring major Hollywood and international classics and hard-to-find discoveries from around the world, complete with special features like commentaries, behind-the-scenes footage, and original documentaries,” the blog post reads. Criterion Channel is expected to launch in early 2019, but early signups for “Charter Subscribers,” which come with extra benefits, are available now. Subscriptions for Charter members will cost $9.99 a month or $89.99 a year, according to the site. Normal memberships will cost $10 a month or $100 a year. More information about subscriptions are available on the company’s website. Charter members will be charged once the service launches, according to a company representative. Update 11/16: Includes comment from Criterion Collection representative. Correction: A previous version of this article misstated the monthly price for Charter members. It is $9.99, not $8.99. Command Line delivers daily updates from the near-future."}