{"id": "Jolted is a deep dive into a school shooting that didn’t happen ", "paragraph": "There are a ton of podcasts out there, but finding the right one can be difficult. In our column Pod Hunters, we cover what we’ve been listening to that we can’t stop thinking about.Just two days after the deadly school shooting at the Stoneman Douglas High School in Parkland Florida, authorities in Vermont arrested 18-year-old Jack Sawyer, who told a friend that he planned to commit a similar shooting at his former high school. The revelation had a bombshell effect on the state: Republican governor Phil Scott eventually signed three bills that implemented some restrictions on gun ownership in the traditionally gun-friendly state. Earlier this fall, Vermont Public Radio released a five-part podcast called Jolted that delved into the attempted shooting and its ramifications. The five-part podcast takes a deeper look into the entire incident, beginning with who Sawyer is and how he allegedly planned to attack his school, how the state grappled with charging him with a crime — which wasn’t carried out — and how it changed the mind of a governor known for his support of gun rights. The entire series is a thoughtful work of reporting that breaks out of the news cycle to examine the entire situation with a bit of hindsight and in-depth reporting, and raises questions that so many people are grappling with as we witness shooting after shooting in the US. Listen to Jolted on VPR’s website, Apple Podcasts, Google Play, NPR One, and Stitcher.Jolted is a bit different than other podcast productions — it’s created by a team of journalists in an active newsroom. VPR’s investigative reporter Emily Corwin noted that the story started out under their regular coverage, and as the larger story was winding down, they “had this moment of realization that these sort of atomized, individual news stories weren’t doing the story justice.” Part of the problem was that the story of the shooting was more than just an isolated crime. It was part of a larger, national story of shootings, but also the role of Vermont’s mental health system, criminal law, and the state’s culture of gun ownership. “These are all related and nobody was telling the story with all of that context,” Corwin said. Faced with that, VPR’s news director, Sarah Ashworth, decided to put resources into a dedicated series that explored all facets of the story. VPR also has a larger slate of podcasts that it regularly releases — Brave Little State is a monthly feature that draws on listeners’ questions about the state of Vermont, and But Why is a kids-oriented program that answers questions from children. Angela Evancie, VPR’s Managing Editor for Podcasts noted that they’ve worked on building out their podcast offerings, and that Jolted represented a good opportunity for a limited project, whereas most of its other offerings are ongoing. Evancie noted that the limited-run podcast format was something that they’d wanted to dip their toes into, and realized that this story was ideal one for that one to experiment with. She also noted that they were in a unique position that most podcasters aren’t in: the station has a long track record of covering news in the state. “Thinking about this project in particular, and the reason why VPR was the one to tell it was that we had been reporting on this story as a Vermont outlet as it unfolded. Our reporters had amazing contacts to draw on and already had quite a lot of trust” from the people involved in the story. Corwin noted that she also felt that Jolted was unique because it bridged the gap between a narrative story and an ongoing news story. “We were using a lot of the narrative-oriented tools that you might use in telling a true crime-type story to tell this very newsy story. I don’t think that’s something we see a lot of, and I think that being public radio reporters made us particularly qualified [to tell this story].” Command Line delivers daily updates from the near-future."}