{"id": "The internet’s horrified with Detective Pikachu", "paragraph": "To understand the intense reaction to Detective Pikachu’s first trailer, you have to understand where the Pokémon fandom stands in 2018. As a franchise, Pokémon taps into a yearning for adventure: it’s just you, your pet pals, and the open road. Defeat the gyms and you’ll get actual emblems for your success. No parents, no responsibilities. The possibilities seem endless. For a while, that fantasy is enough for Pokémon fans — and then they grow up.For years now, there’s been a growing shift within the Pokémon fandom, as the franchise continues to cater to children even as its original audience ages. The kids who sneaked Game Boys under their desk in the ‘90s now have wrinkles and mortgages, but the games themselves have been preserved in amber. Ash Ketchum will never truly age. Obviously, companies behind these decisions know what they’re doing: Pokémon is still extremely successful, especially after the advent of Pokémon Go. But Pokémon’s refusal to mature means that part of the fandom has grown obsessed with what darker pocket monsters could look like. That pitch — Pokémon, but realistic, more adult, is everywhere.Fan art with savage, grittier renditions of pokémon regularly goes viral on the internet, accruing millions of page views and hits. Pokémon fan games that blow up on the internet often promise storylines where protagonists are older, or are in more complicated situations than simply having the desire to catch them all. And whenever a new game in the core franchise gets released, weary fans always ask: is this one actually going to go somewhere different?Hardcore old-school fans want nothing more than for Pokémon to evolve as a franchise. This, then, might explain why we’ve suddenly been saddled with the terror that is Detective Pikachu, a live-action movie where our favorite yellow rodent speaks actual words. Right now, everyone is fixating on how strange every creature in this trailer looks, especially when it comes to the textures. Something looks off when you add actual fur or realistic skin to iconic monsters, no?And yet! Something about all of this looks incredibly familiar to anyone who has ever seen “realistic pokémon” fan art. Isn’t this the style that’s gone viral a thousand times over on the internet? Isn’t the idea that pokémon can be out in the real world exactly what made Pokémon Go’s trailer blow up? Haven’t fans always wondered what pokémon might say if we could actually speak to them? This is exactly what people asked for!Well, technically. Yes, people want ‘realistic’ pokémon. Yes, they want a Pokémon game that feels modern and self-aware, they want to know what it might feel like to have the games be less of a fantasy and more of a reality. But... not like this. Detective Pikachu feels like someone took a very specific list, checked off every item, and then went to a dollar store to fulfill the order with off-brand merchandise. The fact this looks like fan art and not official renditions says everything, and explains why the internet can’t stop talking about this trailer. But hey, at least the jokes are good. pic.twitter.com/r19LHO99RKMister Pikachu. pic.twitter.com/zoHoNTi5ebpic.twitter.com/15hCt7o4Vkseth everman pic.twitter.com/0rhh26o4DKthis one frame got me i pic.twitter.com/u7zvyG5Xodpic.twitter.com/BjoJoiL1QkThat one person who never quite stopped looking like a weird baby. pic.twitter.com/26IM7FWQ1ZDetective Pikachu looks great pic.twitter.com/rG0IjmDt0uCommand Line delivers daily updates from the near-future."}