{"id": "Apple confirms its T2 security chip blocks some third-party repairs of new Macs", "paragraph": "Apple’s annual October hardware event wrapped late last month with the announcements of a new MacBook Air and a revamped Mac mini. Both computers, like the newest MacBook Pro and last year’s iMac Pro, come equipped with Apple’s security-focused T2 chip. The T2 chip, which acts as a co-processor, is the secret to many of Apple’s newest and most advanced features. However, its introduction into more computers and the likelihood that it becomes commonplace in every Mac going forward has renewed concerns that Apple is trying to further lock down its devices from third-party repair services.The T2 is “a guillotine that [Apple is] holding over” product owners, iFixit CEO Kyle Wiens told The Verge over email. That’s because it’s the key to locking down Mac products by only allowing select replacement parts into the machine when they’ve come from an authorized source — a process that the T2 chip now checks for during post-repair reboot. “It’s very possible the goal is to exert more control over who can perform repairs by limiting access to parts,” Wiens said. “This could be an attempt to grab more market share from the independent repair providers. Or it could be a threat to keep their authorized network in line. We just don’t know.” Apple confirmed to The Verge that this is the case for repairs involving certain components on newer Macs, like the logic board and Touch ID sensor, which is the first time the company has publicly acknowledged the new repair requirements for T2-equipped Macs. But Apple could not provide a list of repairs that required this or what devices were affected. It also couldn’t say whether it began this protocol with the iMac Pro’s introduction last year or if it’s a new policy instituted recently.The T2 is a custom-designed component that performs, among other tasks, processing for Touch ID fingerprint data. It also stores the cryptographic keys necessary to securely boot the machines it runs on. Apple says the chip is critical to new features, too, such as enabling the MacBook Pro to respond to “Hey Siri” requests without requiring you to press a button. It also prevents its laptop microphones from being remotely operated by hackers when the lid of the device is closed. Effectively, the T2 chip is capable of communicating with other components in order to perform some of the most important and sophisticated tasks modern Macs are capable of. But recent revelations about the T2 have Apple critics concerned that it could be used to further shut out DIY enthusiasts and third-party repair services. First revealed last month by MacRumors and Motherboard, both of which got their hands on an internal Apple document, the T2 chip could render a computer inoperable if, say, the logic board is replaced, unless the chip recognizes a special piece of diagnostic software has been run. That means if you wanted to repair certain key parts of your MacBook, iMac, or Mac mini, you would need to go to an official Apple Store or a repair shop that’s part of the company’s Authorized Service Provider (ASP) network. If you want to repair or rebuild portions of those devices on your own, you simply can’t — at least, according to this document. The parts affected, according to the document, are the display assembly, logic board, top case, and Touch ID board for the MacBook Pro, and the logic board and flash storage on the iMac Pro. It is also likely that logic board repairs on the new MacBook Air and Mac mini are affected, as well as the Mac mini’s flash storage. Yet, the document, which is believed to have been distributed earlier this year, does not mention those products because they were unannounced at the time. Regardless, to replace those parts, a technician would need to run what’s known as the AST 2 System Configuration suite, which Apple only distributes to Apple Stores and certified ASPs. So DIY shops and those out of the Apple network would be out of luck. As the document puts it:For Macs with the Apple T2 chip, the repair process is not complete for certain parts replacements until the AST 2 System Configuration suite has been run. Failure to perform this step will result in an inoperative system and an incomplete repair.But complicating matters, it was unclear if this “kill switch” was active as of last month. The teardown experts at iFixit, who are also staunch right-to-repair advocates, bought a new 2018 MacBook Pro and discovered that they could still replace its display with one from a unit they bought over the summer. “To our surprise, the displays and MacBooks functioned normally in every combination we tried. We also updated to Mojave and swapped logic boards with the same results,” iFixit’s Adam O’Comb wrote in a blog post.Apple confirmed to The Verge that the display assembly should not require the diagnostic tool, but it is unclear why iFixit was able to swap logic boards and still boot the machines. One possible explanation is that iFixit used components already validated by Apple, and the diagnostic tool may only be required for brand-new, unused components. iFixit speculates that the software could be a mechanism for checking that third-party repair shops are using the correct components and not overcharging customers and using cheaper parts to make money on the side. It could also be for calibration purposes. But O’Comb says that Apple may want to have more end-to-end control over how Mac computers are repaired, what parts are used, and how much those repairs cost the customer. Making all of this function is the T2 chip, a now-integral part of the Mac hardware and software ecosystem that Apple says enables all sorts of critical security functions. In that sense, running the software diagnostic suite on T2-equipped devices could simply be a way to ensure that all of the security-focused features enabled by the chip remain intact after repairs of, say, the logic board on the iMac Pro or the Touch ID board on the MacBook Pro. It’s certainly reasonable, but Apple’s lack of clarity on when, why, and to what extent it instituted the diagnostic tool requirement has led to confusion and concern. Apple says that a vast majority of repairs can be conducted without needing the tool, and it’s certainly true that most Mac owners will never be in the position of needing to replace a logic board or Touch ID sensor on their own. Both components are parts Apple says only it distributes, while solid state drives on most modern Macs, like the new Mac mini, are not user replaceable because they are soldered either to other components or the housing unit.So while Apple may not have initiated this protocol for all T2-equipped devices or simply doesn’t require it on used parts, as iFixit’s demonstrations made clear, the company’s confirmation that it nonetheless requires some form of proprietary software may add more fuel to the long-simmering repairability debate. Critics, with iFixit among the most vocal, have knocked Apple in the past for how its environmental and reusability pledges square with the reality of its repair practices and the longevity of its devices. Onstage at its event, Apple touted the new MacBook Air and Mac mini as the first products to be made of recycled aluminum. It was also reported that Apple is planning an expansion of its repair services to include a “vintage” option for older devices, like the iPhone 4S and 2012 MacBook Pro, that have since been removed from repair eligibility. Additionally, Apple appears to have made the new MacBook Air’s battery more easily replaceable and allowed 2018 Mac mini owners to replace the RAM on the new machine, a change from the 2014 model. Yet Apple devices remain among the hardest in the industry to repair due to custom screws, unibody enclosures, and manufacturing decisions that make removing certain components needlessly difficult. The end result is that a vast majority of iPhone and Mac owners are reliant on Apple or members of its trusted repair network to get devices fixed or to reuse old ones. That’s an issue if you don’t live near an Apple Store or one of its authorized providers, but it’s also an issue because Apple-provided repairs tend to be more expensive than third-party ones, and a lack of any meaningful competition may lead to higher prices down the road. The company is also opposed to right-to-repair legislation that would mandate it make instructions and tools available to DIY hobbyists and out-of-network third-party repair shops. Inevitably, because of this attitude, Apple owners may be more likely to simply buy a new device instead of repairing a current one or refurbishing an old one, something environmental advocates fear could complicating efforts to reduce e-waste. Apple can only reuse so much of a device, with the rest being recycled, but it still must source a finite amount of minerals and other key elements that end up going into the production of phones and computers. And the technology industry, of which Apple is just the most visible player and certainly not the biggest or only offender, has been accelerating its production of new devices over the last decade. Of course, the debate around iPhone repairability is much more complex than that of Macs. Customers tend to replace phones more often than computers, and there are a number of incentives — like Apple’s iPhone Upgrade Program and the fact that smartphone batteries degrade — that encourage the more frequent buying of new phones. A MacBook Pro owner is much more likely to get their laptop repaired, even if it requires shipping it off to Apple for two weeks, then they are to toss out the computer and buy a new one. Still, with the existence of the T2 diagnostic requirement, Macs could soon become even harder to repair than they already are, and iFixit’s Wiens says that, whatever the motivator, requiring you only go through Apple’s network could have negative consequences for all parties involved. “It would be a very dangerous precedent, and might bring things into legal jeopardy,” he said. Wiens made note of how Error 53, which bricked iPhones using third-party components, forced Apple to develop a fix for the issue. The Australian government fined the company $6.6 million when Apple Store employees informed users that their bricked phones were pretty much unrecoverable. Similarly, last year’s battery slowdown fiasco, in which it was revealed Apple throttled older iPhones to prevent accidental shutdowns, led to discount battery replacements for the last 12 months and a congressional inquiry. “If they do this, it will dramatically increase the likelihood that right to repair legislation passes and forces them to reverse course,” Wiens said, referring to Apple requiring the diagnostic tool on all future logic board and Touch ID replacements. “Locking down repairs is bad for consumers, bad for the environment, and bad for Apple.”Command Line delivers daily updates from the near-future."}