{"id": "\n  Trump raises eyebrows with treatment of black women journalists", "paragraph": "Watch VideosAt a White House press conference last week, PBS’s Yamiche Alcindor reminded Donald Trump that he’s described himself as a “nationalist,” which she suggested may have emboldened white nationalists. Before she could continue, the president interrupted to accuse her of asking “a racist question.”It wasn’t a racist question, though it was the start of an unfortunate series of comments Trump directed at black women journalists.Two days later, in response to a question about CNN’s Jim Acosta, the president decided to go after April Ryan. “I mean, you talk about somebody that’s a loser, she doesn’t know what the hell she’s doing,” Trump said. “She gets publicity, and then she gets a pay raise or she gets a contract with, I think, CNN. But she’s very nasty, and she shouldn’t be. She shouldn’t be.”A few minutes later, CNN’s Abby Phillip had this exchange with the president about his acting attorney general, Matt Whitaker.Q: Do you expect Matt Whitaker to be involved in the Russia probe? Do you want him to —TRUMP: It’s up to him.Q: Do you want him to rein in Robert Mueller?TRUMP: What a stupid question that is. What a stupid question. But I watch you a lot. You ask a lot of stupid questions.Yamiche Alcindor, April Ryan, and Abby Phillip have a few things in common: they’re all women journalists; they’re all African American; and they were all on the receiving end of presidential indignation last week.I imagine the White House and its allies believe Trump shows contempt for anyone who gets in his way, and these reporters’ race was irrelevant to the president. Perhaps.But there’s also a pattern of recent behavior to consider. A few months ago, for example, Trump wrote on Twitter, “LeBron James was just interviewed by the dumbest man on television, Don Lemon. He made LeBron look smart, which isn’t easy to do.”Around the same time, Trump delivered a series of speeches in which he attacked Rep. Maxine Waters (D-Calif.) as a “low I.Q. person.”More recently, the president blasted Florida’s Andrew Gillum as a “thief” and Georgia’s Stacey Abrams as “unqualified.”It matters, of course, that Trump’s admonishments about each of these men and women have been factually wrong, but it also matters that the president seems to express a special indignation toward certain groups of people.It’s not subtle."}