{"id": "\n  Reality discredits fraud allegations from Trump, Florida’s Scott", "paragraph": "Watch VideosDonald Trump and Florida Gov. Rick Scott (R) aren’t the only ones who’ve peddled election-related conspiracy theories – Rudy Giuliani and Sen. Marco Rubio (R) have, alas, dipped their toes in the same misguided waters – but the president and the governor have been more aggressive than most and have done the most damage to their credibility.Let’s start with Scott, who has a dwindling lead against Sen. Bill Nelson (D), and who dispatched Florida law enforcement officials to find evidence to back up his ideas. That didn’t turn out well.State election monitors in Broward County told The Miami Herald on Saturday that they’ve seen no evidence of voter fraud. And Palm Beach County State Attorney Dave Aronberg, a Democrat, said he has seen no evidence of voter fraud in the county. In addition, the state agency tasked with overseeing elections said it is not investigating any claims of voter fraud.It’s almost as if the governor publicly raised the prospect of “rampant fraud” as part of a panic-induced public-relations scheme, rather than based on meaningful proof of wrongdoing.After Florida law enforcement told the public that there’s no evidence of fraud, Scott went to Fox News to once again raise the prospect of fraud.All of which looked pretty bad for the governor – though the president’s take may have been slightly worse.Trump started tweeting about Florida’s election results on Thursday, pointing to “fraud” that did not, and does not, exist. A day later, he lied about the discovery of “miraculous” votes, and vowed to dispatch lawyers to “expose the fraud” that doesn’t exist.On Saturday, while in France to recognize the 100th anniversary of World War I, Trump kept up the offensive, publishing a tweet accusing Democrats of “trying to STEAL two big elections.”This morning, the Republican president called for Florida to stop counting votes, raised the prospect of “forged” ballots, and condemned the uncounted ballots as “infected.” Trump added, “Must go with Election Night!”In other words, since his preferred candidate is currently ahead, Trump wants officials to stop counting votes, including those cast by military servicemen and women serving overseas. In the process, the president took steps to undermine confidence in the integrity of the elections system, as if counting provisional and vote-by-mail ballots is inherently suspicious.This question from Brendan Nyhan rings true for a reason: “The president is making baseless accusations of fraud and calling for the vote count to be stopped while his political allies are ahead. What would you say if you saw it in another country?”"}