{"id": "\n  Monday’s Mini-Report, 11.12.18", "paragraph": "Watch VideosToday’s edition of quick hits:* The latest out of California: “Deadly wildfires burning across Northern and Southern California have killed a total of 31 people across the state and forced the evacuation of hundreds of thousands.”* Someone should let the White House know: “The chief state judge in Broward County, Fla., urged the lawyers involved in the battle over the state vote recount on Monday to ‘ramp down the rhetoric’ and take any accusations of electoral fraud where they belong: to the police.”* Wall Street: “The Dow Jones Industrial Average sank by more than 600 points Monday, dragged down by a tumble in Apple and Amazon shares, mounting geopolitical concerns, and a strengthening dollar.”* Israel: “A new round of hostilities triggered by a botched Israeli covert operation into the Gaza Strip pushed the territory’s fragile security situation to the brink on Monday, as Palestinian militants launched hundreds of rockets toward Israel and Israeli jets carried out bombing raids.”* An agenda takes shape: “Democrats will take control of the U.S. House in January with big items topping their legislative to-do list: Remove obstacles to voting, close loopholes in government ethics law and reduce the influence of political money.”* Duterte is still at it: “The Philippine government said on Friday that it would charge a veteran journalist and her online news start-up with tax evasion, a move the publication described as an attack against media in the country by the government of President Rodrigo Duterte.”* It’s a shame to watch the trajectory of Graham’s career: “Sen. Lindsey Graham said Sunday that French President Emmanuel Macron’s perceived swipe at President Donald Trump is because the leader of America’s oldest ally is facing his own internal problems.”* A brutal story out of the Chicago area: “Witnesses said a Midlothian police officer responding to a shooting inside a south suburban bar shot at the wrong person early Sunday morning.”* And on a related note: “A mocking tweet from the National Rifle Association has stirred many physicians to post on social media about their tragically frequent experiences treating patients in the aftermath of gun violence.”Anything to add? Consider this an open thread."}