{"id": "\n  Tuesday’s Mini-Report, 10.30.18", "paragraph": "Watch VideosToday’s edition of quick hits:* Quite a story: “Special counsel Robert Mueller last week asked the FBI to investigate a possible scam in which a woman would make false claims that he had sexually assaulted her, after several political reporters were contacted about doing a story on the alleged assault.”* In related news: “The special counsel investigation into President Trump’s longtime ally Roger Stone is pressing witnesses about Stone’s private interactions with senior campaign officials and whether he had knowledge of politically explosive Democratic emails that were released in October 2016, according to multiple people familiar with the probe.”* Pittsburgh: “President Trump arrived in Pittsburgh on Tuesday as the city began to bury the victims of Saturday’s synagogue attack and as many officials and residents made clear his visit was not welcome.”* A good piece on this week’s Brazilian election results from Heather Hurlburt: “Bolsonaro’s Victory in Brazil Should Feel Worryingly Familiar to Americans.”* Quite a scandal: “A supervisor at the Interior Department sent sexually explicit messages to three subordinate employees and ‘inappropriately’ used department surveillance to capture images of employees without their knowledge, according to a new watchdog report.”* How does Trump explain a year in which the major indexes have barely grown? Not very well: “President Donald Trump on Tuesday claimed that the stock market was taking a ‘little pause’ amid anticipation for next week’s midterm elections.”* I’ll look forward to seeing what this probe turns up: “A U.S. government agency has launched an internal investigation after airing a Spanish-language program earlier this year describing George Soros as a ‘multimillionaire Jew’ and espousing conspiracy theories about the billionaire philanthropist.”Anything to add? Consider this an open thread."}