{"id": "\n  Acting Attorney General tied to fraud scheme under FBI investigation", "paragraph": "Watch VideosThe Federal Bureau of Investigation is conducting a criminal investigation of a Florida company accused of scamming millions from customers during the period that Matthew Whitaker, the acting U.S. attorney general, served as a paid advisory-board member, according to an alleged victim who was contacted by the FBI and other people familiar with the matter.The investigation is being handled by the Miami office of the FBI and by the U.S. Postal Inspection Service, according to an email sent to the alleged victim last year by an FBI victim specialist. A recording on a phone line set up by the Justice Department to help victims said Friday the case remains active.Mr. Whitaker, appointed Wednesday by President Trump to replace Jeff Sessions as head of the Justice Department, oversees the FBI in his new job.Let’s back up for a minute, because the details are almost hard to believe.Whitaker joined the company’s advisory board after having served as a U.S. Attorney in the Bush/Cheney administration – a fact World Patent Marketing exploited to lure potential clients.Four years ago, the company issued a press release that quoted Matt Whitaker as saying, “As a former U.S. attorney, I would only align myself with a first-class organization. World Patent Marketing goes beyond making statements about doing business ethically and translates them into action.”Those comments started to look pretty bad after the Federal Trade Commission filed a civil suit against this World Patent Marketing, describing it as “an invention-promotion scam that has bilked thousands of consumers out of millions of dollars.” Among its alleged victims are many disabled American veterans.Now, the company is facing possible criminal scrutiny from the FBI, all while one of the company’s top officials is running the Justice Department.It’s a dynamic that sounds like fanciful fiction: the president unilaterally empowered Matt Whitaker to serve as the nation’s chief law enforcement official, while a company Whitaker helped lead is at the center of a multi-million-dollar fraud scheme being investigated by the FBI.And before you think his work on World Patent Marketing’s advisory board meant his connection to the company was unimportant, note that according to Federal Trade Commission, Whitaker wrote threatening emails to the company’s customers, pressing them not to complain about having been defrauded by the firm.Among those subpoenaed as part of the FTC’s case against World Patent Marketing was none other than Matt Whitaker, your new acting attorney general.If you’re wondering why a president would elevate such a person to an immensely powerful post, it’s important to note that the White House apparently had no idea about Whitaker’s connection to the company – because he wasn’t vetted.If there’s a defense for such a move, I can’t think of it."}