{"id": "\n  Wednesday’s Mini-Report, 10.24.18", "paragraph": "Watch VideosToday’s edition of quick hits:* The FBI released a fairly detailed official statement this afternoon on the packages sent to prominent Democratic leaders, Obama administration officials, and CNN.* Details are still coming together on today’s shooting in Kentucky: “Police say multiple people have been shot inside a grocery store on the outskirts of Louisville, Kentucky. A dispatcher with the Jeffersontown Police Department said a suspect was detained following the shooting Wednesday afternoon at a Kroger store. The store is located on the eastern outskirts of Louisville.”* Wall Street: “U.S. stocks slid on Wednesday, continuing a brutal month, as weak forecasts from chipmakers fanned concerns over the impact of tariffs and China’s slowdown on corporate profit, even though Boeing hiked its outlook.”* On a related note: “President Trump escalated his attacks on Federal Reserve Chairman Jerome Powell, saying the head of the nation’s central bank threatened U.S. economic growth and appeared to enjoy raising interest rates.”* This is still ridiculous: “The Senate is still away, but its Judiciary Committee keeps plugging away. The panel is scheduled to hold another likely sparsely attended confirmation hearing on Wednesday to hear from more of President Donald Trump’s judicial nominees, including a Ninth U.S. Circuit Court of Appeals selection opposed by home-state Democratic senators.”* This is not a good move: “Trump attorney Rudy Giuliani has a new side gig: conference headliner in Armenia. The 74-year old Trump defense attorney spoke Tuesday in Yerevan at the International Forum of Eurasian Partnership, a conference aimed at promoting the Eurasian Economic Union – the Russia-organized economic bloc.”* A story out of Indiana I mentioned a while back: “A special prosecutor will not file criminal charges against Indiana Attorney General Curtis Hill, who was accused of inappropriately touching an Indiana lawmaker and other women during a party in March at an Indianapolis bar.”* It’s amusing someone followed up on this: “[W]hen Trump claimed there were pictures of Mueller and Comey ‘hugging and kissing each other,’ of course we had to check it out. After BuzzFeed News made a records request for any such pictures with the FBI last month, we finally got an answer Tuesday: The FBI said they had no pictures of Mueller and Comey embracing each other. None.”* Referring to Saudi Arabia, Jared Kushner said this week, “Once those facts come in, the secretary of state will work with our national security team to help us determine what we want to believe.” He probably could’ve phrased those last few words a little better.Anything to add? Consider this an open thread."}