{"id": "\n  This Week in God, 10.20.18", "paragraph": "Watch VideosFirst up from the God Machine this week is a look at a striking evangelical perspective on the suspected murder of Jamal Khashoggi from one of the nation’s most infamous religious right leaders.On Monday morning, TV preacher Pat Robertson told his “700 Club” audience that Khashoggi’s apparent slaying is less significant than an arms deal between the United States and Saudi Arabia. As the estimable Kyle Mantyla reported at Right Wing Watch reported, Robertson returned to the subject a day later.“We’ve got to cool the rhetoric,” Robertson said. “Calls for sanctions and calls for punitive actions against the Saudis is ill-advised…. You’ve got a hundred billion dollars’ worth of arms sales – which is, you know, that’s one of those things – but more than that, we’ve got to have some Arab allies. We have to have it! We cannot alienate a biggest player in the Middle East who is a bulwark against Iran.”When Robertson’s co-host Wendy Griffith argued that we cannot have governments killing critical journalists with impunity, Robertson dismissed those concerns.“We’ve had so many people killed,” he responded. “We’ve had CIA people killed in Lebanon. People have been taken hostage over the years. I know it’s bad, but we’ve had all kinds of stuff, but you don’t blow up an international alliance over one person. I mean, I’m sorry.”A few things. First, there is no $100 billion arms deal. Second, Robertson was perfectly willing to jeopardize an international alliance over one person when the person was a Christian evangelist in Turkey. Third, drawing a moral parallel between the United States and Saudi Arabia – as if the two countries have comparable records on human rights – is quite a departure from the right’s usual approach to patriotism.But even putting these relevant details aside, the televangelist’s on-air comments were emblematic of just how far some evangelical Christians are prepared to go to defend Donald Trump’s position. Christian principles about the value of human life are nice, but a multi-billion-dollar arms deal that doesn’t really exist is, evidently, quite a bit nicer.Stephen Colbert, dressed in a robe and a fake beard, did a great bit on his show this week, pointing to the Ten Commandments’ prohibition on killing, and joking about its apparent asterisk: “Thou shalt not kill – unless there’s a lot of coinage on the table…. If that be the case, then the big guy upstairs is more than willing to look the other way.”It’s worse, of course, given the fact that there isn’t even a lot of coinage on the table.Also from the God Machine this week:* Federal prosecutors in Pennsylvania: “The Department of Justice issued subpoenas to Catholic leadership in Pennsylvania on Thursday in following a grand jury report this summer that alleged hundreds of priests in the state molested young children for years. The dioceses of Allentown, Harrisburg, Erie, Greensburg, Scranton, Pittsburgh and Philadelphia have received subpoenas and intend to cooperate with federal investigators.”* Litigation worth watching: “Two conservative Christian groups in Texas believe that businesses and employers have the legal right to discriminate against LGBTQ workers on religious grounds, and they’re trying to get the courts to back them up. The US Pastors Council and Texas Values, two nonprofit evangelical groups, filed multiple lawsuits in state and federal court this week, claiming that Christian businesses and churches have a constitutional right to fire – or not hire – LGBTQ workers.”* And Politico recently reported that Donald Trump’s administration is often accused of advancing a foreign policy that routinely seems to put the interests of one faith tradition over every other: “Even some supporters of the administration concede that its actions have created the impression that the Trump government favors Christians over other faiths, a perception fueled by the powerful influence Christian evangelicals wield in Trump’s electoral base.”"}