{"id": "\n  Despite his troubled record, Trump condemns political violence", "paragraph": "Watch VideosToday’s big story is obviously the suspicious packages sent to prominent Democratic leaders, former Obama administration officials, and CNN. Donald Trump hosted a bill-signing ceremony at the White House this afternoon, and he addressed the suspected bombs at the outset of the event. From the transcript:“The safety of the American people is my highest and absolute priority. I have just concluded a briefing with the FBI, Department of Justice, Department of Homeland Security and the U.S. Secret Service. As we speak, the packages are being inspected by top explosive experts and a major federal investigation is now underway.“The full weight of our government is being deployed to conduct this investigation and bring those responsible for these despicable acts to justice. We will spare no resources or expense in this effort. And I just want to tell you that in these times, we have to unify. We have to come together and send one very clear, strong, unmistakable message that acts or threats of political violence of any kind have no place in the United States of America…. This egregious conduct is abhorrent to everything we hold dear and sacred as Americans.”Moments later, the president strayed a bit from his prepared text and added, “We’re extremely angry, upset, unhappy about what we witnessed this morning and we will get to the bottom of it.”And at that point, Trump turned his attention back to the subject at hand.The president is scheduled to headline a campaign rally in Wisconsin tonight, and the White House announced this morning that the developments will not cause a postponement. Under the circumstances – some of Trump’s highest-profile targets were apparently sent potentially dangerous devices in the mail – his rhetoric will probably draw more scrutiny than usual.As for this afternoon’s comments, there was nothing especially problematic about what the president had to say. His remarks were brief, but inoffensive.The trouble, however, is more with the messenger than the message.It was, after all, just last week when Donald Trump celebrated a Republican congressman for his unprovoked violence toward a journalist.For that matter, it’s hard to forget Trump’s pre-election rhetoric, when he frequently seemed to encourage violence toward protesters.In June 2017, after White House Press Secretary Sarah Huckabee Sanders argued that the president has never “promoted or encouraged violence,” the Washington Post  reported soon after that the claim was “laughable,” adding, “Even if you don’t believe Trump has technically incited violence (which he has been sued for), he clearly nodded toward violence at his campaign rallies. Sometimes it was veiled; other times it was unmistakable. Sometimes he was talking about self-defense, but it was clear he was advocating for a ‘form of violence.’”I’m not in a position to say whether the sender of the packages was motivated by the president or not. An investigation is underway and we’ll know when we know. Until then, speculation isn’t especially constructive.For that matter, even at his lowest moments, the president may describe his domestic opponents as “evil,” but he’s never endorsed anything along the lines of a pipe bomb.That said, it’s not too early to say Trump’s record makes it difficult for him to be credible when talking about “unity” and his opposition to “violence.”"}