{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nState trooper escorts wandering elephant back home to animal sanctuary State trooper escorts wandering elephant back home to animal sanctuary  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Barack Obama surprise guest at Michelle Obama's book show  Trump says he should have gone to Arlington on Veterans Day  Migrants won't see armed US soldiers on border  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  US, allies to bring electricity to most of Papua New Guinea  Teen accused of killing mom over bad grade charged with murder as adult  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\nA New York State Trooper received the biggest shock of his career Sunday night while on patrol -- an 8,000-pound surprise, to be exact.\n\nSgt. Dave Scott was on duty when police received a call around 11:35 p.m. detailing an elephant that had somehow gotten loose in Westtown, New York State Police Public Information Officer for Troop F Steven Nevel told ABC News.\n\n\n\nScott and another trooper responded to the field within 10 minutes, where the elephant was enjoying her freedom. Scott, who is familiar with the area, had an inkling that the elephant had escaped from the Sanctuary for Animals, a farm that houses all kinds of animals, across the street.\n\n\n\nScott then went to the sanctuary and alerted the owners of the elephant's breakout, who came out and ordered the elephant to go back to where she belongs.\n\n\"They came out and spoke to the elephant like someone would talk to their dog,\" Nevel said. \"They told her to turn around and head back home, and she started heading back home.\"\n\n\n\nThe 46-year-old Vietnamese elephant named Fripha, who arrived in the U.S. after she was burned by napalm during the Vietnam War, was able to stroll out of the sanctuary after a worker forgot to turn on an electric fence, Nevel said.\n\n\n\nFripha was not phased by the commotion and remained \"nice\" and \"friendly\" during the run-in, he added.\n\n\n\nWhile state police often get calls detailing wayward bears, dogs and deer, it was the first time Scott had ever had to escort an elephant home, describing the encounter as \"the strangest thing,\" Nevel said.\n\n\n\n\"I wish I could have seen the trooper's face when it came over the radio that we have a wandering elephant,\" Nevel said. \"I can imagine that he would have said, 'Can you repeat that?'\"\n\nABC News' Ben Stein contributed to this report."}