{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nTrump takes aim at Stacey Abrams during Georgia campaign rally  Trump takes aim at Stacey Abrams during Georgia campaign rally   Andrew Gillum concedes Florida governor's race to Republican Ron DeSantis  Betsy DeVos pitches new protections for students accused of sexual assault  Controversies hamper candidates in Mississippi Senate race   The sisterhood of congressional 'firsts': Diverse group of newly elected women bond   Family of immigrant WWI soldier receives his Purple Heart 100 years after death  Sunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Papadopoulos launches late bid to delay looming prison term  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Fraternity suspended after member critically injured in fall  Trump says he finished answering questions from special counsel  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\nPresident Trump ripped into Democratic gubernatorial candidate Stacey Abrams at a rally in Macon, Georgia, on Sunday, calling her \"radical,\" and \"one of the most extreme far-left politicians in the country.\"\n\nThe president was headlining a rally for Republican gubernatorial candidate Brian Kemp, who he also endorsed during the primary, likely catapulting Kemp from second place to Republican nominee in the general election.\n\n\n\nA crowd of thousands in a Middle Georgia Regional Airport hangar cheered raucously for \"six more years\" of a Trump presidency. They also chanted \"lock her up\" during Trump's references to a woman who admitted to falsifying rape claims against Supreme Court Justice Brett Kavanaugh. Those claims were not considered serious by Senate investigators, and stand in contrast to the allegations made by Dr. Christine Blasey Ford, who testified before the Senate Judiciary Committee.\n\n\n\nDuring the rally, Trump baselessly told the crowd that if Abrams is elected, \"your 2nd Amendment is gone.\"\n\n\n\nAbrams has campaigned on increasing gun control in Georgia while \"having respect for the 2nd Amendment.\"\n\nTrump also said Abrams \"wants illegal aliens to vote,\" a common criticism of Abrams referencing a video that surfaced of her saying undocumented immigrants are part of the so-call \"blue wave\" of Democratic voters expected to vote in this year's elections.\n\nAbrams refuted that accusation in an interview with ABC News' Deborah Roberts. \"I know that the only people who are allowed to vote are eligible citizens,\" said Abrams.\n\n\n\nThe president further riled up the crowd with references to the \"caravan\" of migrants moving from Central America towards the U.S.-Mexico border.\n\n\"You saw last week I called up the U.S. military, we’re not playing games,\" he said of the thousands of U.S. troops headed to the border just days before the midterm election. \"Because you look at what’s marching up, that’s an invasion,\" he said. Trump also accused the caravan of including criminals.\n\n\n\nTrump is scheduled to hold another rally on Sunday night in Chattanooga, Tennessee."}