{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nHere's the news you missed this weekend Here's the news you missed this weekend  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Barack Obama surprise guest at Michelle Obama's book show  Trump says he should have gone to Arlington on Veterans Day  Migrants won't see armed US soldiers on border  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  US, allies to bring electricity to most of Papua New Guinea  Teen accused of killing mom over bad grade charged with murder as adult  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\nThe high-stakes midterm elections are just two days away, and we analyze five major issues dominating the races.\n\nDemocrats are in the race to control Congress, but their advantage has narrowed since the summer, an ABC News/Washington Post poll finds.\n\nThousands of Central American migrants traveling with children toward the U.S. border can't afford what truck drivers are charging to help haul their belongings.\n\nIt's been two years since a 30-year-old woman was killed while jogging in New York City. The trial for the young man who allegedly killed her is set to begin Monday.\n\nThe testimony of one of Supreme Court Justice Brett Kavanaugh's accusers has inspired a casting director to do a documentary-style PSA.\n\nBefore you begin your week, take a look back at some of the top stories of the weekend.\n\n\n\n\nABC News has identified the five most important issues leading into Tuesday's election.\n\nTrump: It will be a nationwide referendum on his presidency.\n\nMaking history: Women, African-American and LGBTQ candidates can all break barriers and become the first elected officials at different levels of government.\n\nPink wave: Speaking of women, female candidates are hoping to make history in Congress. A staggering 239 women are on the ballot for House seats.\n\nHealthcare: Democrats, who lost big in 2010 after former President Obama's historic legislation, are now leveraging the issue in some conservative pockets of the country.\n\nImmigration: President Trump has increased his rhetoric on the polarizing issue as a caravan of migrants makes its way to the U.S. border.\n\n\n\n\nDemocrats lead Republicans 52-44 percent among likely voters in this final ABC News/Washington Post pre-electon poll. But that lead his dipped 14 percentage points since August.\n\n\n\nThe GOP, meanwhile, has maintained its base of non-college white men, rural residents and independent women, the poll finds.\n\n\n\n\nMany migrants traveling with their families, their belongings in backpacks, couldn't afford the 150 pesos or roughly $7.50 drivers were asking to ride on the back of cargo trucks.\n\n\"Everybody is sleeping in the street,\" one man told ABC News. \"A lot of people right now are hungry.\n\n\n\nSome also wanted people to know that they are not the violent criminals that Trump has described.\n\n\"Everybody wants freedom,\" one migrant said.\n\n\n\n\nKarina Vetrano, 30, was killed two years ago, and the trial for the young man who allegedly killed her, Chanel Lewis, is scheduled to begin Monday.\n\nVetrano's body, was found by her father after she went for a jog and didn't return.\n\n\n\nLewis, 22, was arrested six months later after DNA allegedly linked him to the crime. Police say he confessed, but his lawyer and a spokesman for the family say it was coerced.\n\n\n\n\nWhen Christine Blasey Ford testified during Kavanaugh's confirmation hearing, Skyler Barrett created the public service announcement, which featured #MeToo activists and sexual assault survivors reading every word of Ford's testimony.\n\n\nBarrett said after seeing social media reactions to the Supreme Court hearings, she felt a disconnect among those who doubted Ford’s story, and she hopes to start a conversation to show just how pervasive “rape culture” is.\n\n“I wanted to show people this affects people from every walk of life,” Barrett said."}