{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nDevlin Hodges notches FCS mark with 14,584 career passing yards Devlin Hodges notches FCS mark with 14,584 career passing yards  Aaron Donald fined for going after Justin Britt, vows to control temper  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\nThe number of Samford, Southern Conference and FCS records seemed countless during quarterback Devlin Hodges' career.\nBut the Bulldogs know just how many passing yards Hodges threw across one field after another: 14,584, the FCS record.\nIn the final game of his career at ETSU on Saturday, Hodges passed the late Steve McNair from Alcorn State to establish the mark. Hodges entered the game 316 yards shy of the 1994 Walter Payton Award winner and threw for 404 yards.\nHe set the record with a 7-yard screen pass to DeMarcus Ware on the final play of the third quarter of a 38-27 season-ending win. \n\n\n\"The biggest thing for me is just get the win,\" Hodges said. \"Obviously, I'm glad I did. I said at the beginning of the year that that was a goal. Who wouldn't want to be the all-time passing leader? I'm just really glad that I've had a lot of help along the way. I've had some great guys come through here and helped me be the best I can be. I'm just so thankful for them.\" \nHodges has set FCS records for completions (1,310) and attempts (1,896) in his career and passed for 111 touchdowns. He finished with 15,601 yards of total offense and was responsible for 128 touchdowns.\nMcNair threw for 14,496 yards in 42 college games. Hodges set the record in 44 games.\nThe Associated Press contributed to this report. "}