{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nRelentless California wildfires leave 79 dead, nearly 1,300 others still missing Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Barack Obama surprise guest at Michelle Obama's book show  Trump says he should have gone to Arlington on Veterans Day  Migrants won't see armed US soldiers on border  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  US, allies to bring electricity to most of Papua New Guinea  Teen accused of killing mom over bad grade charged with murder as adult  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\nThe number of people who remain missing in the wake of a pair of ferocious wildfires that have been blazing across both ends of California for more than a week spiked to nearly 1,300 late Saturday.\n\nThe two monstrous blazes which both ignited last week have claimed a total of 79 lives while laying waste to a total area of nearly 400 square miles, according to the California Department of Forestry and Fire Protection. Officials said that 63 of the remains have been positively identified so far.\n\nA vast majority of the deaths were due to the Camp Fire in Northern California's Butte County, making it the deadliest and most destructive wildland fire in the state's history.\n\nThe number of people missing or unaccounted for in Butte County grew to 1,011 by Friday, and 1,276 by late Saturday, though those figures may continue to fluctuate as authorities track down the names on the list, according to Butte County Sheriff Kory Honea.\n\nPresident Donald Trump arrived in California on Sunday to survey the devastation and meet with firefighters, alongside California Gov. Jerry Brown and the state's governor-elect, Gavin Newsom.\n\n\n\nThe president stopped first in Paradise, where he called the damage \"total devastation.\"\n\n\"We've never seen anything like this in California,\" Trump said.\n\nThe president later visited Malibu to tour devastation from the Woolsey Fire.\n\nMeanwhile, the smoke from the flames has descended across the Golden State and choked the air in major cities, including San Francisco. Officials have advised residents in the affected areas to remain indoors and wear a protective mask outside.\n\nThe National Weather Service issued a red flag warning for California through Sunday as humidity drops and wind gusts could get up to 40 mph in the Camp Fire zone.\n\n\n\n\n\n\nThe Camp Fire ignited Nov. 8 near Pulga, a tiny community in Butte County nestled in the Plumas National Forest. The blaze exploded as strong winds fanned the flames southwest, enveloping the town of Paradise, a bucolic community of 27,000 people in the Sierra Nevada foothills.\n\nThe fire has virtually decimated the entire town.\n\nMelissa Schuster, a Paradise town council member, said her house was among those leveled by the Camp Fire.\n\n\"Our entire five-member council is homeless,\" Schuster said in a Nov. 13 interview on ABC News' \"Start Here\" podcast. \"All of our houses have been destroyed.\"\n\n\n\n\n\nThe death toll from the Camp Fire increased to 76 on Saturday, after officials found still more bodies in the burned-out rubble of homes and melted cars, according to the Butte County sheriff, who has warned that the remains of some of the missing may never be recovered due to the severity of the fire.\n\nThe Camp Fire had burned more than 149,000 acres as of Saturday evening, and destroyed nearly 13,000 structures, according to the California Department of Forestry and Fire Protection.\n\nThom Porter, chief of strategic planning for the California Department of Forestry and Fire Protection, said the body count is expected to climb higher as search crews continue sifting through the destruction.\n\n\"It is by far the most deadly single fire in California history and it's going to get worse, unfortunately,\" Porter said of the Camp Fire.\n\nMany of the deaths have taken place in Paradise.\n\n\"The entire community of Paradise is a toxic wasteland right now,\" Schuster said, holding back tears. \"In addition to that, and this is the hardest part for me to even talk about, the number of fatalities is [among] things that we don't know at this moment and that's something that has to be determined before people can move back in.\"\n\n\n\nThe Camp Fire, which has scorched a total of 149,000 acres in Butte County, was 55 percent contained Saturday evening as thousands of exhausted firefighters work around the clock to quell the inferno, according to the California Department of Forestry and Fire Protection.\n\nTwo prison inmate firefighters were among a total of three firefighters who have been injured while battling the Camp Fire, officials told ABC News.\n\nEarlier this week, Gov. Brown toured the devastation caused by the Camp Fire along with Brock Long, administrator of the Federal Emergency Management Agency (FEMA), as well as U.S. Interior Secretary Ryan Zinke.\n\n\"This is one of the worst disasters I've ever seen in my career, hands down,\" Long told reporters at the scene Wednesday.\n\n\n\n\nThe Woolsey Fire also ignited Nov. 8 near the city of Simi Valley in Ventura County and rapidly spread south to Los Angeles County. The wind-driven flames jumped the 101 Freeway before sweeping through the celebrity enclaves of Malibu and Calabasas.\n\nThe entire city of Malibu and a sprawling naval base near the seaside city of Oxnard were among the areas under mandatory evacuation orders, as officials warned the blaze could potentially spread all the way to the Pacific Ocean.\n\n\n\n\n\nEvacuation orders have since been lifted for some areas, including parts of Malibu, as firefighters successfully stretch containment levels.\n\nThe Woolsey Fire, which has torched a total of 98,362 acres in Ventura and Los Angeles counties, was up to 82 percent containment by Saturday morning, according to the California Department of Forestry and Fire Protection.\n\n\n\nBut more than 900 structures have already been damaged or destroyed, including many homes and a legendary Hollywood film set.\n\nThe blaze burned down a portion of Paramount Ranch in Agoura Hills known as “Western Town,” where hundreds of movies and television shows, including HBO’s \"Westworld,\" have been filmed, dating back to the 1920s.\n\nThe Woolsey Fire has been blamed for the deaths of at least three people, and three firefighters sustained injuries while battling the flames, according to the California Department of Forestry and Fire Protection.\n\n\n\n\nU.S. Health and Human Services Secretary Alex Azar has declared a public health emergency in California, where the wildfires have forced the evacuation of at least two hospitals and eight other health facilities.\n\n\"We are working closely with state health authorities and monitoring the needs of healthcare facilities to provide whatever they may need to save lives and protect health,\" Azar said in a statement Wednesday. \"This declaration will help ensure that Americans who are threatened by these dangerous wildfires and who rely on Medicare, Medicaid and the Children’s Health Insurance Program have continuous access to the care they need.\"\n\nSmoke advisories have been issued for the affected region amid concerns that smoke from the fires could present a \"significant health threat\" for people with asthma and other lung conditions, according to the U.S. Department of Health and Human Services. Residents have been urged to stay indoors as much as possible and to wear a properly fitting mask when venturing outside.\n\n\n\n\n\nBerkeley Earth, a California-based nonprofit that analyzes air quality in real-time, ranked San Francisco, Stockton and Sacramento as the world's three \"most polluted cities\" on Friday morning.\n\nNational Weather Service meteorologist Aviva Braun told reporters that light winds have contributed to the poor air quality but, on Saturday, stronger northeast winds mixing in the valley should help improve conditions.\n\nMeanwhile, there has been an outbreak of norovirus at a shelter in Butte County housing evacuees, according to Lisa Almaguer, public information officer for Butte County Public Health.\n\nPeople who are ill at the shelter have been taken to a separate location, are using separate restroom facilities and are being cared for by public health experts, according to Almaguer, who said the presence of the contagious virus is \"not uncommon,\" especially at this time of year and \"with hundreds of people living in close quarters.\"\n\nABC News' Karine Hafuta, Marilyn Heck and Bonnie McLean contributed to this report"}