{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nRepublicans slam 'mob' for aggressive confrontation of Nancy Pelosi Republicans disavow 'mob' for confrontation of Nancy Pelosi  Andrew Gillum concedes Florida governor's race to Republican Ron DeSantis  Betsy DeVos pitches new protections for students accused of sexual assault  Controversies hamper candidates in Mississippi Senate race   The sisterhood of congressional 'firsts': Diverse group of newly elected women bond   Family of immigrant WWI soldier receives his Purple Heart 100 years after death  Sunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Papadopoulos launches late bid to delay looming prison term  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Fraternity suspended after member critically injured in fall  Trump says he finished answering questions from special counsel  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\nAs President Donald Trump seeks to paint Democrats as a party of \"mobs\" hell-bent on violently confronting conservative figures, a new video showing a group of purported \"anti-communists\" shouting down and insulting House Minority Leader Nancy Pelosi is receiving condemnation from several Republican lawmakers.\n\nThe video posted on YouTube, which shows Pelosi being confronted outside a Miami Democratic campaign event Wednesday, includes protesters chasing and heckling Pelosi and banging on a door after her and her staff walk through it.\n\nOne of the protesters can be heard saying, \"It's the Proud Boys in here,\" a reference to the far-right group that is under investigation over a series of attacks on protesters in New York last weekend.\n\nDrew Hammill, a spokesperson for Pelosi, confirmed the confrontation in a statement to ABC News Saturday and said President Trump and Republicans in Congress were to blame for stoking \"the flames of incivility, intolerance and aggression.\"\n\n\"It is stunning that Republicans have the gall to call courageous survivors of sexual assault a ‘mob,’ and at the same time they incite and condone violent actions like this,\" Hammill said. \"Republicans must condemn this vile and dangerous conduct, and stop the reckless and dangerous rhetoric that encourages it.”\n\n\n\nSeveral Republicans including Rep. Steve Scalise and Sen. Marco Rubio took to Twitter late Friday night and Saturday to disavow the group.\n\n\"I don't agree with Nancy Pelosi's agenda, but this is absolutely the wrong way to express those disagreements,\" Louisiana Rep. Steve Scalise wrote in a tweet. \"If you want to stop her policies, don't threaten her, VOTE! That's how we settle our differences.\"\n\n\n\n\nFlorida Senator Marco Rubio also tweeted about the incident.\n\nYou are not helping the cause of anti-communism if you behave like the repudiation mobs Castro has long used in Cuba. Not sure who was behind this behavior but you should have protested Pelosi campaign stop without borrowing the tactics of left wing mobs. https://t.co/LDsR4SDSPJ\n\n\"You are not helping the cause of anti-communism if you behave like the repudiation mobs Castro has long used in Cuba,\" he wrote. \"Not sure who was behind this behavior but you should have protested Pelosi campaign stop without borrowing the tactics of left-wing mobs.\"\n\n\n\nFollowing the emotionally charged and at times aggressive protests in Washington during the hearings for Supreme Court Justice Brett Kavanaugh, President Trump and other Republicans have repeatedly accused Democrats of stoking irrational fears and inciting \"mobs\" to publicly shout down their political opposition.\n\nThey have seized on comments by lawmakers like Rep. Maxine Waters, who in June had urged supporters during a rally to \"create a crowd\" and \"push back\" whenever they happened to spot a Trump administration official in public.\n\nPresident Trump has even sought to make a hashtag out of the attack line, tweeting Wednesday \"#JobsNotMobs.\"\n\n#JobsNotMobs! pic.twitter.com/U1suRW5j6G\n"}