{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nUS missionary killed in Cameroon in what family says was 'targeted' attack US missionary killed in Cameroon in what family says was 'targeted' attack  Andrew Gillum concedes Florida governor's race to Republican Ron DeSantis  Betsy DeVos pitches new protections for students accused of sexual assault  Controversies hamper candidates in Mississippi Senate race   The sisterhood of congressional 'firsts': Diverse group of newly elected women bond   Family of immigrant WWI soldier receives his Purple Heart 100 years after death  Sunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Papadopoulos launches late bid to delay looming prison term  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Fraternity suspended after member critically injured in fall  Trump says he finished answering questions from special counsel  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\nAn American missionary was shot and killed in Cameroon Tuesday, his brother confirmed to ABC News, and his family says they believe he was targeted amid growing violence in the West African country.\n\nCharles Wesco, his wife Stephanie, and their eight children had moved to Bamenda, a major city in Cameroon's northwest province, less than two weeks ago. After years of missions to Africa, the Wesco family had decided to permanently move to the country from Indiana after a visit there in 2015.\n\n\"Their objective was to share the love of Christ with people in a very poor and strife-ridden country,\" his brother Timothy Wesco told ABC News. \"That was their passion, and that was their life -- to share Jesus Christ.\"\n\nBut Tuesday morning, while driving into town to go shopping, Charles was shot. He was taken to one of the local hospitals where he was treated by Doctors Without Borders, Timothy said, but was declared dead shortly after arriving.\n\n\"It appears that he was targeted,\" Timothy said, adding later it was \"quite probable he was targeted because he was a white, English-speaking American.\"\n\n\n\nCameroon has seen violence flare in recent months as English-speaking separatists have attacked schools in a revolt against the French-speaking government's education system and perceived oppression of English speakers. A former French colony, Cameroon is largely French-speaking, except for the two provinces Northwest and Southwest where English is the major language.\n\nThe separatist movement has been met with a severe crackdown by government forces, with the violence bringing the country to the brink of \"an emerging civil war,\" according to Richard Moncrieff, the Central Africa project director at the International Crisis Group. At least 400 civilians have been killed in the last year since separatists declared independence in October 2017, reported ICG.\n\n\n\nLocal Cameroonian media reported that Wesco was shot by government forces, but his brother could not confirm that.\n\nThe State Department told ABC News that a U.S. citizen died in Bamenda and that it is providing full consular services to the family, but declined to provide any other details.\n\nChief among the family's needs right now is safety.\n\n\"We're very concerned about the safety of the family,\" Timothy Wesco said. While Stephanie and the eight children are still in the country right now, the family hopes to get them out soon, he added.\n\n\n\nThe family was aware of the risks in Cameroon, with Charles and Stephanie writing in a September-October newsletter about a curfew where \"English section civilians are not allowed to safely leave their homes or operate their businesses without risking loss or death.\"\n\n\"Keep praying earnestly for a return of peace to the English and French sections of Cameroon!\" they added, noting their humility and excitement for their religious mission.\n\n\n\nIf Cameroonian security forces are found to be responsible for Charles's killing, it would not be the first time they have been accused of crimes. In July, State Department spokesperson Heather Nauert said the U.S. was \"gravely concerned\" about a video that appeared to show military forces executing two women and two children. Cameroon's Ministry of Information dismissed the video as \"fake news.\"\n\nThe U.S. has taken little action to punish the government of President Paul Biya for its human rights abuses, including allegations of killing protesters, torturing detainees, and arresting journalists. Earlier this month, Biya was reelected to another seven-year term after nearly 36 years in office in elections that opposition figures denounced.\n\n\n\nThe State Department said there were \"a number of irregularities\" that \"may not have affected the outcome but created an impression that the election was not credible or genuinely free and fair.\" But it called on the parties to peacefully resolve any disputes, instead of pushing for any recount."}