{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nA day in the life of a family in the migrant caravan A day in the life of a family in the migrant caravan  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Barack Obama surprise guest at Michelle Obama's book show  Trump says he should have gone to Arlington on Veterans Day  Migrants won't see armed US soldiers on border  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  US, allies to bring electricity to most of Papua New Guinea  Teen accused of killing mom over bad grade charged with murder as adult  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\nJust past 4 a.m., under a star-streaked sky, the Central American migrants shouldered their bags and picked over broken sidewalks -- first as a trickle, then as a flood -- to the edge of the Mexican town of Mapastepec.\n\nThey walked straight and without hesitation. Few spoke much. Their compass point was north, towards the U.S.\n\nTheir goal for the day was to reach Pijijiapan. The town, 30 miles away, was the next stop on a trek by thousands in a caravan that has so enraged U.S. President Donald Trump he has threatened to close the U.S.-Mexico border and slash aid to Central America.\n\n\n\nHonduran boys Adonai, 5, and Denzel, 8, set off from Mapastepec still fogged with sleep. Their mother, Glenda Escobar, 33, clutched her youngest's hand. Her friend, Maria, held onto Denzel's T-shirt.\n\nNo one had a torch. Potholes were treacherous. Only the floodlights of the odd truck in the opposite lane of the highway helped them see a few feet at a time.\n\nWithin minutes, a young man lay on his back, hugging his knee to his chest. He'd smashed his ankle on a rock, he said, and was in too much pain to stand. The single mother and her boys strode past, keeping pace with the long train of people.\n\n\n\nEscobar’s ultimate destination: Los Angeles, a city where she knows no one. \"It's because in my dreams, God told me that's where he's sending me,\" she said.\n\nTrump, who campaigned against illegal immigration and won the 2016 U.S. presidential election, has seized on this caravan in the run-up to the Nov. 6 midterm elections, firing up support for his Republican Party.\n\n\n\nYet the caravan’s members make up a fraction of the hundreds of thousands of people who every year flee violence and poverty in Central America for the United States.\n\nEstimates on the size of the caravan vary from around 3,500 to more than double that. Some migrants have abandoned the journey, deterred by the hardships or the possibility of making a new life in Mexico. Others joined it in southern Mexico.\n\n\n\nEscobar kneaded her shin. Agile and slight, she used to exercise regularly back home in the crime-wracked city of San Pedro Sula. But even the hardiest person would have struggled to cover the roughly 30 miles every day since she joined the caravan on Oct. 14.\n\nIf she and her boys were lucky, a passing car or minivan would give them a ride before the sun turned the day from sticky warm to sticky hot.\n\nSoon the boys watched wide-eyed as dozens, mainly young men, sprinted for the backs of slowing trucks and jumped aboard -- an impossible feat for a mother with two small children.\n\n\n\nEscobar’s family had had no food or water since residents of Mapastepec provided them a dinner of rice, beans, and eggs about 12 hours earlier.\n\nThat morning, there had been nothing to eat at the school where they slept on a three-foot square patch of floor, squeezed among dozens of parents with small children.\n\nAt least they had found shelter from the night's downpour that soaked hundreds who slept on the sidewalks.\n\nA shifting committee of self-appointed representatives in green jackets decide when to rise, move or sweep the streets they borrow for a night. The caravan follows like clockwork.\n\n\n\nThrough Guatemala to southern Mexico, private citizens, church groups and local organizations offered help at almost every stop and on the walks in between.\n\nSince entering Mexico, they have been assisted by members of Pueblo Sin Fronteras, a migrant rights group that has guided caravans through the country for several years, including this current one that drew the ire of Trump in April.\n\nHis broadsides against that caravan have generated enormous publicity, convincing others desperate to leave Central America that caravans are a safer way to travel. Others have begun forming behind Escobar's group.\n\n\n\nBy 9 a.m, two hours past sunrise, the first hitchhikers reached Pijijiapan.\n\nThe Escobars followed far behind.\n\n\"We've been going so many days,\" Escobar said, watching her sons flag, then suddenly leap to life and give each other piggy backs. \"Should we rest here a bit?\"\n\n\n\nThe boys dropped down and started wrestling, which did nothing to stir Maria, who fell asleep in seconds on her backpack. Escobar, splayed on her back, stared at the sky, relating the many reasons that led to her journey.\n\nThe eldest of seven children, she abandoned school and dreams of becoming a detective to help her mother.\n\nLife spiraled down at 18, she said, when on her way to work, a man she knew kidnapped her. She escaped but was pregnant with the child of her rapist, a former policeman who turned out to be a member of Barrio-18, she said. That brutal gang, together with MS-13, dominates much of El Salvador and Honduras.\n\n\n\nHe disappeared, believed to have been killed, but no one ever found the body, she said.\n\nShe raised his girl and had a son with another man. In time, he fled to the U.S., promising to send for her. Within a year, his sister told her he had married someone else.\n\nFinally, she fell for a mototaxi driver, who fathered Denzel and Adonai. But he began to throw things at her and abuse her and the boys. Then he forced her out of the house she had paid for with money saved from years working as a cook and a seamstress, she said.\n\n\n\nWhen a neighbor told her about the caravan, she packed fast: a plastic tarp, clothes for the children, some soap. She left her two eldest children with family, hoping to fetch them later.\n\nCoordinators have not said definitively when and where the caravan might reach the U.S. border, saying it will likely fragment as many people decide to stay in Mexico.\n\nEscobar and her family heaved to their feet. Denzel unfolded a discarded pamphlet that workers from the United Nations High Commissioner for Refugees distributed to the caravan two towns back.\n\n\n\nTo disperse the convoy, Mexico has offered the Central Americans temporary jobs and identification papers if they submit requests for asylum in the south. But most have rejected the offer.\n\n\"No, no,\" Escobar told her son. \"The United States is better. For everything.\"\n\nAfter six hours, Escobar started hitchhiking.\n\n\n\nIn Pijijiapan, hundreds had turned the main square into a mix of carnival and refugee camp. The family headed for a warehouse-sized shelter reserved for anyone with children.\n\nA medical aide squeezed iodine on a woman's bleeding foot. People swarmed into the bathroom. Many went for a dip in a river.\n\nIn mid-afternoon, the warehouse was stifling with the crush of bodies. Escobar searched outside and set her plastic tarp under a tree. Two more stops and they would board a northbound freight train known as “La Bestia” (the Beast), she said.\n\nAll around, adults fell asleep, exhausted.\n\nBut Adonai was sprinting for his third bottle of water. And Denzel was climbing a tree.\n\n\"They're as strong as adults,\" she said. No problem then, rousing them for the next day's 3 a.m. start.\n\n\n\nReporting by Delphine Schrank for Reuters."}