{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nCandidate chides Pete Davidson of 'SNL' over eyepatch joke Candidate chides Pete Davidson of 'SNL' over eyepatch joke  Mark Zuckerberg, Nancy Pelosi latest to be mocked by 'SNL'   Michael Buble on how his son's fight with cancer changed him   What we know so far about Kate Upton's life as a new mom  'Widows' actress on how fitness training helps balance her life  Mariah Carey celebrates first snow of the season with her holiday anthem  How Serena Williams learned to love her body  Tamera Mowry-Housley's niece Alaina laid to rest after Thousand Oaks mass shooting  How Michael B. Jordan is changing the game in front of and behind the camera  Why you need to meet the 2 young stars of 'Haunting of Hill House'  Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\n\nA Texas Republican congressional candidate has chided \"Saturday Night Live\" comic Pete Davidson for poking fun at the eyepatch he wears because he was badly wounded during his third tour in Afghanistan as a Navy SEAL.\nDavidson said during Saturday's \"Weekend Update\" segment that Dan Crenshaw, whose photo was displayed, was \"kinda cool\" but that viewers might be \"surprised he's a congressional candidate from Texas and not a hit man in a porno movie.\" He added, \"I'm sorry, I know he lost his eye in war or whatever.\"\nCrenshaw, who is running against Democrat Todd Litton for an open suburban Houston district seat, replied in a tweet on Sunday, saying: \"Good rule in life: I try hard not to offend; I try harder not to be offended. That being said, I hope @nbcsnl recognizes that vets don't deserve to see their wounds used as punchlines for bad jokes.\""}