{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nMan apologies for shouting 'Heil Hitler' at show Man apologies for shouting 'Heil Hitler' at show  Mark Zuckerberg, Nancy Pelosi latest to be mocked by 'SNL'   Michael Buble on how his son's fight with cancer changed him   What we know so far about Kate Upton's life as a new mom  'Widows' actress on how fitness training helps balance her life  Mariah Carey celebrates first snow of the season with her holiday anthem  How Serena Williams learned to love her body  Tamera Mowry-Housley's niece Alaina laid to rest after Thousand Oaks mass shooting  How Michael B. Jordan is changing the game in front of and behind the camera  Why you need to meet the 2 young stars of 'Haunting of Hill House'  Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\n\nA man who yelled \"Heil Hitler! Heil Trump!\" at a theater performance of \"Fiddler on the Roof\" in Baltimore says he's sorry for the outburst.\nThe Baltimore Sun reports that Anthony M. Derlunas II said in an interview with the newspaper that his comments were \"beyond a mistake.\"\nThe 58-year-old said he'd been drinking heavily before the show. Derlunas said the classic play set in a Jewish village in czarist Russia reminded him of President Donald Trump's immigration policies, which prompted his outburst.\nThe comments sparked panic in the Hippodrome Theatre and a few dozen people began running for the exits. The scare came a few weeks after a gunman fatally shot 11 people inside a Pittsburgh synagogue."}