{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nRashida Tlaib projected to win Michigan Congressional seat Democrat poised to become 1st Muslim-American woman in Congress  Andrew Gillum concedes Florida governor's race to Republican Ron DeSantis  Betsy DeVos pitches new protections for students accused of sexual assault  Controversies hamper candidates in Mississippi Senate race   The sisterhood of congressional 'firsts': Diverse group of newly elected women bond   Family of immigrant WWI soldier receives his Purple Heart 100 years after death  Sunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Papadopoulos launches late bid to delay looming prison term  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Fraternity suspended after member critically injured in fall  Trump says he finished answering questions from special counsel  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\n\n\nRashida Tlaib is projected to win in Michigan's 13th Congressional District, ABC News projects, based on analysis of voting data, and is poised to become the first Muslim-American woman in Congress.\n\nIn Minnesota, Ilhan Oman was hoping to join Tlaib as first Muslim-American and separately be the first Somali-American woman to be elected to Congress.\n\n\n\nThe seat in Michigan was left open last year when longtime Rep. John Conyers Jr. resigned, citing health concerns, though he was also facing sexual harassment allegations. Tlaib faced no Republican or Independent challenges in the district.\n\nAlways wanted to try waiting tables, so it was fun helping @Janefonda and @onefairwage and more raise awareness about the need to raise the minimum wage for tipped workers this morning at @dfillingstation! Owners Phyllis and Joel pay fair wages and great benefits, great example! pic.twitter.com/MVodCvHUAe\n\nTlaib served in the Michigan House of Representatives beginning in 2008 and was the first Muslim American to serve there. The Detroit native went on to serve three terms in the Michigan House and was the Democratic leader of the Appropriations Committee. Because of term limits, she could not run for her seat again.\n\n\nAfter serving in Michigan’s House, she went on to work as an attorney for the Sugar Law Center for Economic and Social Justice, combating anti-Arab and anti-Muslim rhetoric, repairing state benefit fraud and environmental measures to stop the pollution of the Detroit River, according to her website.\n\n\n\nIn early August of 2016, during then-candidate Donald Trump’s presidential campaign stop in Detroit, Tlaib and a group of about 20 women stood during his speech and shouted questions about his treatment of women, according to Michigan Live."}