{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nLawsuit: Yale removed depressed student from campus Lawsuit: Yale removed depressed student from campus  Formerly Conjoined Twins Get Send-Off at Hospital Where They Were Separated  CDC Issues New Vaccine Guidelines for Adults  Facebook Post Helps Toddler Get Kidney From Parents' Former HS Classmate  Flu Takes a Toll in NYC, With 4 Children Reported Dead  Mumps Outbreak Reaches 367 Cases in Washington State  Girl Surprised With Super Bowl Tickets After Being Treated for Rare Cancer  In Chicago, Witnesses to Violence Turn to First Aid to Save Lives  6-Year-Old Girls Link Intelligence to Men Over Women, Study Says  Avian Flu Outbreaks Raise Concerns About Possible Pandemic   Seoul Virus Spread by Pet Rats Under Investigation in Multiple States  Teacher Aide Accused of Faking Cancer to Hide Criminal Past  More Chronically Ill Patients Have Health Insurance After ACA, Study Finds  11-Year-Old Boy Is One of the Youngest to Get Artificial Heart  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\n\nA Yale University graduate is suing the Ivy League school over allegations she was wrongly removed from campus after she sought counseling for depression as school officials worried about more negative publicity following two student suicides.\nThe Yale Daily News reports the lawsuit was filed Nov. 5 in federal court in New Jersey by a woman known only in court documents as \"Z.P.\"\nA Yale spokeswoman says university officials do not comment on pending litigation.\nThe woman says Yale violated her constitutional rights by placing her on mandatory medical leave after she sought counseling in November 2016, the same month as the two suicides. She alleges she was unlawfully held for involuntary treatment at Yale-New Haven Hospital and hospital staff illegally gave her medical information to Yale officials.\nShe was placed on medical withdrawal in the fall of 2016 when she was a senior and reinstated in the fall of 2017. She graduated this year.\nThe woman's lawyer, Robert De Groot, said his client is seeking damages for Yale's violations of the federal Americans with Disabilities Act, saying school officials did not \"assist or accommodate\" her for her depression and illegally denied her due process by forcibly removing her from campus.\nDe Groot accused Yale officials of forcing the student to leave school only because they did not want another suicide to spur more negative media coverage.\n\"This was not done to assist this young woman,\" De Groot told the student newspaper. \"This was done to protect (Yale's) own image from being tarnished.\"\nThe lawsuit also names as defendants Yale President Peter Salovey and other top school officials, as well as six unidentified university and hospital employees.\nAfter she was placed on medical leave, the woman appealed to Yale officials to let her stay on campus.\n\"Please let me continue to learn how not to be afraid, continue to grow and become an adult who is strong enough to make a better life for herself,\" she wrote in a letter. \"Please let me return to Yale and continue to help myself.\""}