{"id": "Celebrate the 25th Anniversary of ‘Tim Burton’s The Nightmare Before Christmas’ with Disney PhotoPass at Disneyland Resort", "paragraph": "by Emily Southard, Marketing & Communications Coordinator“Tim Burton’s The Nightmare Before Christmas” is approaching the 25th anniversary of its Oct. 29, 1993 release, and Disney PhotoPass Service is brewing up a few ways for you to commemorate this beloved classic when you visit Disneyland Resort!From October 26-31, visit a Disney PhotoPass photographer at the following locations to enjoy these awfully festive photo opportunities!You won’t believe your eyes! Get this Oogie Boogie Magic Shot on Buena Vista Street at Disney California Adventure park. For those of you who are extremely batty about the anniversary, at this location you can also snap a photo with a special prop to commemorate this celebration.  To capture a Magic Shot featuring Jack Skellington’s loyal poltergeist pooch Zero, visit the Disney PhotoPass photographer stationed at the giant pumpkin on Main Street, U.S.A. in Disneyland park.If you want to show off these photos somewhere besides just social media, consider creating a personalized photo product! Ornaments, wood block and metal prints, magnets and coasters are just a few ways you can showcase these memories. Simply click here, log in, and follow the photo product links to see the full assortment.Season’s Screamings!Valid theme park admission required for photo locations. Disney PhotoPass service is subject to the Disney PhotoPass terms and expiration policy found at https://disneyland.disney.go.com/photopass-terms-conditions/. Online registration required. Not responsible for missing, lost or damaged photos. Photos are restricted to personal use by Disney account holder only and may not be used for a commercial purpose. Subject to other restrictions and change or cancellation without notice.Photo gift products are offered by a third party, EZ Prints. Not all Disney PhotoPass photos can be used in EZ Prints products. Use of Disney PhotoPass photos by EZ Prints will be subject to EZ Prints’ own policies and terms, and Disney will not be responsible for EZ Prints products, site or actions. More information on third-party products can be found in the Disney PhotoPass terms and conditions here. Subject to restrictions and change without notice.Destinations: Disneyland Resort, Disney California Adventure, Disneyland ParkUh, it’s actual release date is October 22, 1993. So it already turned 25.We love the magic shots and so many of the photo pass photographers are really quite creative with how you pose. Wish they would add videos to more of the rides!I love getting Magic photos especially during special events.  They are so cool.by Thomas Smith, Editorial Content Director, Disney Parksby Ryan March, Editor, Disney Vacation Club’s Disney Files Magazineby Kevin Rafferty, Jr., External Communications Manager, Disneyland ResortFood & Beverage Content Relations Coordinatorby Emily Southard, Marketing & Communications Coordinator\n\r\n      Start planning your dream Disney Vacation\r\n      View Videos\n© Disney, All Rights Reserved\nSign Up\nBy submitting this form, you are granting Disney Parks Blog permission to email you. You can revoke permission to mail your email address at any time using the unsubscribe link, found at the bottom of every email. We take your privacy seriously. For more information on our data collection and use practices, please read our Privacy Policy.By providing my email address I'd like to receive updates, special offers, and other information via electronic messages and postal mail from Disney Destinations, LLC and other members of The Walt Disney Family of Companies.You can withdraw your consent for these messages at any time. For more information on our data collection and use practices, and managing your preferences, please read our privacy policy."}