{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\n'No Blame'? ABC News finds 17 cases invoking 'Trump' in connection with violence, threats or alleged assaults 17 cases invoking 'Trump' in connection with violence, threats, alleged assaults  Andrew Gillum concedes Florida governor's race to Republican Ron DeSantis  Betsy DeVos pitches new protections for students accused of sexual assault  Controversies hamper candidates in Mississippi Senate race   The sisterhood of congressional 'firsts': Diverse group of newly elected women bond   Family of immigrant WWI soldier receives his Purple Heart 100 years after death  Sunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Papadopoulos launches late bid to delay looming prison term  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Fraternity suspended after member critically injured in fall  Trump says he finished answering questions from special counsel  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\nPresident Donald Trump has repeatedly refused to accept any responsibility for inciting violence in American communities, dismissing critics who have pointed to his rhetoric as a potential source of inspiration for some citizens acting on bigoted beliefs.\n\nLittle more than a week ago, he insisted he deserves \"no blame\" for what he called the \"hatred\" seemingly coursing through parts of the country, and outside of the White House on Friday, Trump accused news outlets of fomenting the very violence they've been asking him about.\n\nBut a nationwide review conducted by ABC News has identified at least 17 criminal cases where Trump's name was invoked in direct connection with violent acts, threats of violence or allegations of assault.\n\nNearly all -- 16 of 17 -- cases identified by ABC News are striking in that court documents and direct evidence reflect someone echoing presidential rhetoric, not protesting it. ABC News was unable to find any such case echoing presidential rhetoric when Barack Obama or George W. Bush were in the White House.\n\nThe perpetrators and suspects identified in the 17 cases are mostly white men, as young as teenagers and as old as 68, while the victims represent an array of minority groups -- African-Americans, Latinos, Muslims and gay men.\n\nFederal law enforcement authorities have privately told ABC News they worry that -- even with Trump's public denunciations of violence -- Trump's style could inspire violence-prone individuals to take action against minorities or others they perceive to be against the president's agenda.\n\n\n\nWhile asserting that \"fake\" media coverage is exacerbating divisions in the country, Trump has noted that \"a fan\" of former Democratic presidential candidate Bernie Sanders opened fire on Republican lawmakers playing baseball in a Washington suburb last year.\n\n\"Nobody puts ... 'Bernie Sanders' in the headline with the maniac,\" Trump said last week. But there's no indication the shooter mentioned Sanders while launching his attack, and no criminal case was ever brought because he was fatally shot during his assault.\n\nIn identifying the 17 Trump-related cases, ABC News excluded incidents where charges were never brought and incidents of Trump-inspired vandalism.\n\nIn conducting its review, ABC News did find several cases where pro-Trump defendants were charged with targeting minorities, or where speculation online suggested the defendants were motivated by Trump, but in those cases ABC News found no police records, court proceedings or other direct evidence presenting a definitive link to the president. So those cases also were excluded in the ABC News tally.\n\nABC News found at least one case out of Chicago featuring anti-Trump rhetoric in connection with violence.\n\nOn Thursday, ABC News sent a list of the cases it identified to White House spokeswoman Sarah Sanders for comment. As of Sunday evening, three days later, she had yet to respond. Trump has previously told reporters he's \"committed to doing everything\" in his power to not let political violence \"take root in America.\"\n\nHere are the cases identified by ABC News:\n\n\n\nAUG. 19, 2015: In Boston, after he and his brother beat a sleeping homeless man of Mexican descent with a metal pole, Steven Leader, 30, told police \"Donald Trump was right, all these illegals need to be deported.\" The victim, however, was not in the United States illegally. The brothers, who are white, ultimately pleaded guilty to several assault-related charges and were each sentenced to at least two years in prison.\n\nDEC. 5, 2015: After Penn State University student Nicholas Tavella, 19, was charged with \"ethnic intimidation\" and other crimes for threatening to \"put a bullet\" in a young Indian man on campus, his attorney argued in court that Tavella was just motivated by \"a love of country,\" not \"hate.\" \"Donald Trump is running for President of the United States saying that, 'We've got to check people out more closely,'\" Tavella's attorney argued in his defense. Tavella, who is white, ultimately pleaded guilty to ethnic intimidation and was sentenced to up to two years in prison.\n\n\n\nAPRIL 28, 2016: When FBI agents arrested 61-year-old John Martin Roos in White City, Oregon, for threatening federal officials, including then-President Barack Obama, they found several pipe bombs and guns in his home. In the three months before his arrest, Roos posted at least 34 messages to Twitter about Trump, repeatedly threatening African Americans, Muslims, Mexican immigrants and the \"liberal media,\" and in court documents, prosecutors noted that the avowed Trump supporter posted this threatening message to Facebook a month earlier: \"The establishment is trying to steal the election from Trump. ... Obama is already on a kill list ... Your [name] can be there too.\" Roos, who is white, has since pleaded guilty to possessing an unregistered explosive device and posting Internet threats against federal officials. He was sentenced to more than five years in prison.\n\nJUNE 3, 2016: After 54-year-old Henry Slapnik attacked his African-American neighbors with a knife in Cleveland, he told police \"Donald Trump will fix them because they are scared of Donald Trump,\" according to police reports. Slapnik, who is white, ultimately pleaded guilty to \"ethnic intimidation\" and other charges. It's unclear what sentence he received.\n\nAUG. 16, 2016: In Olympia, Washington, 32-year-old Daniel Rowe attacked a white woman and a black man with a knife after seeing them kiss on a popular street. When police arrived on the scene, Rowe professed to being \"a white supremacist\" and said \"he planned on heading down to the next Donald Trump rally and stomping out more of the Black Lives Matter group,\" according to court documents filed in the case. Rowe, who is white, ultimately pleaded guilty to charges of assault and malicious harassment, and he was sentenced to more than four years in prison.\n\n\n\nSEPT. 1, 2016: The then-chief of the Bordentown, New Jersey, police department, Frank Nucera, allegedly assaulted an African-American teenager who was handcuffed. Federal prosecutors said the attack was part of Nucera's \"intense racial animus,\" noting in federal court that \"within hours\" of the assault, Nucera was secretly recorded saying \"Donald Trump is the last hope for white people.\" The 60-year-old Nucera has been indicted by a federal grand jury on three charges, including committing a federal hate crime. Nucera, who is white, has pleaded not guilty and is awaiting trial. He retired last year.\n\nSEPTEMBER 2016: After 40-year-old Mark Feigin of Los Angeles was arrested for posting anti-Muslim and allegedly threatening statements to a mosque's Facebook page, his attorney argued in court that the comments were protected by the First Amendment because Feigin was \"using similar language and expressing similar views\" to \"campaign statements from then-candidate Donald Trump.\" Noting that his client \"supported Donald Trump,\" attorney Caleb Mason added that \"Mr. Feigin's comments were directed toward a pressing issue of public concern that was a central theme of the Trump campaign and the 2016 election generally: the Islamic roots of many international and U.S. terrorist acts.\" Feigin, who is white, ultimately pleaded guilty to a misdemeanor charge of sending harassing communications electronically. He was sentenced to probation.\n\nOCT. 13, 2016: After the FBI arrested three white Kansas men for plotting to bomb an apartment complex in Garden City, Kansas, where many Somali immigrants lived, one of the men's attorneys insisted to a federal judge that the plot was \"self-defensive\" because the three men believed \"that if Donald Trump won the election, President Obama would not recognize the validity of those results, that he would declare martial law, and that at that point militias all over the country would have to step in.\" Then, after a federal grand jury convicted 47-year-old Patrick Stein and the two other men of conspiracy-related charges, Stein's attorney argued for a lighter sentence based on \"the backdrop\" of Stein's actions: Trump had become \"the voice of a lost and ignored white, working-class set of voters\" like Stein, and the \"climate\" at the time could propel someone like Stein to \"go to 11,\" attorney Jim Pratt said in court. Stein and his two accomplices are awaiting sentencing.\n\nNOV. 3, 2016: In Tampa, Florida, David Howard threatened to burn down the house next to his \"simply because\" it was being purchased by a Muslim family, according to the Justice Department. He later said under oath that while he harbored a years-long dislike for Muslims, the circumstances around the home sale were \"the match that lit the wick.\" He cited Trump's warnings about immigrants from majority-Muslim countries. \"[With] the fact that the president wants these six countries vetted, everybody vetted before they come over, there's a concern about Muslims,\" Howard said. Howard, who is white, ultimately pleaded guilty to a federal civil rights violation, and the 59-year-old was sentenced to eight months in prison.\n\nNOV. 12, 2016: In Grand Rapids, Michigan, while attacking a cab driver from East Africa, 23-year-old Jacob Holtzlander shouted racial epithets and repeatedly yelled the word, \"Trump,\" according to law enforcement records. Holtzlander, who is white, ultimately pleaded guilty to a charge of ethnic intimidation, and he was sentenced to 30 days in jail.\n\nJAN. 3, 2017: In Chicago, four young African-Americans -- sisters Brittany and Tanishia Covington, Jordan Hill and Tesfaye Cooper -- tied up a white, mentally disabled man and assaulted him, forcing him to recite the phrases \"F--k Donald Trump\" and \"F--k white people\" while they broadcast the attack online. Each of them ultimately pleaded guilty to committing a hate crime and other charges, and three of them were sentenced to several years in prison.\n\nJAN. 25, 2017: At JFK International Airport in New York, a female Delta employee, wearing a hijab in accordance with her Muslim faith, was \"physically and verbally\" attacked by 57-year-old Robin Rhodes of Worcester, Mass., \"for no apparent reason,\" prosecutors said at the time. When the victim asked Brown what she did to him, he replied: \"You did nothing, but ... [Expletive] Islam. [Expletive] ISIS. Trump is here now. He will get rid of all of you.\" Rhodes ultimately pleaded guilty to a misdemeanor charge of \"menacing,\" and he was sentenced to probation.\n\nFEB. 19, 2017: After 35-year-old Gerald Wallace called a mosque in Miami Gardens, Florida, and threatened to \"shoot all y'all,\" he told the FBI and police that he made the call because he \"got angry\" from a local TV news report about a terrorist act. At a rally in Florida the day before, Trump falsely claimed that Muslim refugees had just launched a terrorist attack in Sweden.\n\nWATCH WALLACE'S INTERVIEW WITH THE FBI AND POLICE:\n\n\n\nWallace's attorney, Katie Carmon, later tried to convince a federal judge that the threat to kill worshippers could be \"protected speech\" due to the \"very distinctly political climate\" at the time. \"There are courts considering President Trump's travel ban ... and the president himself has made some very pointed statements about what he thinks about people of this descent,\" Carmon argued in court.\n\nHEAR CARMON'S REMARKS IN COURT:\n\n\n\nWallace, who is African American, ultimately pleaded guilty to obstructing the free exercise of his victims' religious beliefs, and he was sentenced to one year in prison.\n\nFEB. 23, 2017: Kevin Seymour and his partner Kevin price were riding their bicycles in Key West, Florida, when a man on a moped, 30-year-old Brandon Davis of North Carolina, hurled anti-gay slurs at them and \"intentionally\" ran into Seymour's bike, shouting, \"You live in Trump country now,\" according to police reports and Davis' attorney. Davis ultimately pleaded guilty to a charge of battery evidencing prejudice, but in court, he expressed remorse and was sentenced to four years of probation.\n\nMAY 3, 2017: In South Padre Island, Texas, 35-year-old Alexander Jennes Downing of Waterford, Connecticut, was captured on cell phone video taunting and aggressively approaching a Muslim family, repeatedly shouting, \"Donald Trump will stop you!\" and other Trump-related remarks. Police arrested downing, of Waterford, Connecticut, for public intoxication. It's unclear what came of the charge.\n\nAUGUST 2018: After the Boston Globe called on news outlets around the country to resist what it called \"Trump's assault on journalism,\" the Boston Globe received more than a dozen threatening phone calls. \"You are the enemy of the people,\" the alleged caller, 68-year-old Robert Chain of Encino, California, told a Boston Globe employee on Aug. 22. \"As long as you keep attacking the President, the duly elected President of the United States ... I will continue to threat[en], harass, and annoy the Boston Globe.\" A week later, authorities arrested Chain on threat-related charges. After a hearing in his case, he told reporters, \"America was saved when Donald J. Trump was elected president.\" He has pleaded not guilty and is awaiting trial.\n\nLATE OCTOBER 2018: Over the course of a week, Florida man Cesar Sayoc allegedly mailed at least 15 potential bombs to prominent critics of Trump and members of the media. Sayoc had been living in a van plastered with pro-Trump stickers, and he had posted several pro-Trump messages on social media. While federal prosecutors have accused him of \"domestic terrorism\" and filed several bomb-related and assault charges against him, he has pleaded not guilty.\n\nABC News' Luke Barr, Karen Travers, Meredith McGraw and Alexis Scott contributed to this report."}