{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nGeorgia Democrats cry foul as Republican candidate for governor launches last-minute hacking investigation GA Dems cry foul as GOP gubernatorial candidate launches last-minute hacking probe  Andrew Gillum concedes Florida governor's race to Republican Ron DeSantis  Betsy DeVos pitches new protections for students accused of sexual assault  Controversies hamper candidates in Mississippi Senate race   The sisterhood of congressional 'firsts': Diverse group of newly elected women bond   Family of immigrant WWI soldier receives his Purple Heart 100 years after death  Sunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Papadopoulos launches late bid to delay looming prison term  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Fraternity suspended after member critically injured in fall  Trump says he finished answering questions from special counsel  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\nGeorgia Secretary of State and Republican gubernatorial candidate Brian Kemp announced that his office opened an investigation on Saturday night into the Democratic Party of Georgia over an alleged hacking attempt of the state’s voter registration system, according to a news release posted early Sunday morning.\n\nThe announcement -- slammed by opponents as a “political stunt” -- comes just two days before a hotly-contested gubernatorial election in which Kemp is facing off against Democrat Stacey Abrams in a race that has featured legal action over Kemp’s alleged efforts to use his office to suppress votes.\n\n\n\n“While we cannot comment on the specifics of an ongoing investigation, I can confirm that the Democratic Party of Georgia is under investigation for possible cyber crimes,” Candice Broce, press secretary for Kemp at the Secretary of State’s office, said in a statement, which indicated that the alleged hacking attempt was unsuccessful and that no personal data was breached.\n\n\n\n“Federal partners, including the Department of Homeland Security and the Federal Bureau of Investigation, were immediately alerted,” the statement said.\n\n\n\nThe Department of Homeland Security told ABC News in a statement that the state “has notified us of this issue,” but deferred further comment back to the state.\n\nThe FBI did not immediately respond to a request for comment.\n\nThe announcement from Kemp’s office, which was devoid of details on the nature or timing of the attempt, was quickly denounced by his political opponents in Georgia as “scurrilous” and “100 percent false.”\n\n“This political stunt from Kemp just days before the election is yet another example of why he cannot be trusted and should not be overseeing an election in which he is also a candidate for governor,” said Rebecca DeHart, executive director of the Democratic Party of Georgia.\n\n\n\nLater in the day, DeHart issued another statement accusing Kemp of using “false accusations” to smear his opponent with “a creative, but pathetic attempt to cover up his own failures.\n\n\"Within the past hour it was revealed that Brian Kemp's office, along with the FBI, was notified by a third party yesterday morning regarding a major security vulnerability of Georgia's elections database,” DeHart said. “We were disturbed but not surprised that when Brian Kemp learned of major vulnerabilities to Georgians' personal information, he didn't work to fix the problem. He didn't warn Georgians that their personal information may be compromised. He instead launched politically motivate accusations against his political opponents.”\n\nAbrams, who with a victory on Tuesday would become the first African-American woman to be elected governor in the United States, told ABC News’ affiliate WSB-TV in Atlanta that Kemp was “trying to distract voters with a desperate ploy.”\n\nAs of Sunday afternoon, FiveThirtyEight’s gubernatorial forecast listed the Georgia race as a “toss-up,” with both candidates projected to receive just shy of 50 percent of the total vote. President Donald Trump is scheduled to appear at a rally for Kemp in Macon on Sunday afternoon.\n\nBrian Kemp will be a GREAT Governor of Georgia. Stacey Abrams will destroy the State. Sooooo important, get out and VOTE for Brian!\n\nThis is not the first time Kemp has raised allegations about attempts to infiltrate the secretary of state’s computer network. Just days after the 2016 presidential election, Kemp requested a federal investigation by the Department of Homeland Security, citing 10 suspected unauthorized attempts by DHS personnel to penetrate the state’s firewall.\n\nA report from the Inspector General of DHS released in July 2017, concluded that allegations were unsubstantiated. The investigation determined that the activity flagged by Kemp was the “result of normal and automatic computer message exchanges,” and that there were no unauthorized intrusion attempts.\n\nVoting rights have been a central issue in the campaign over the past several months, and Kemp has resisted calls, including from former President Jimmy Carter, to recuse himself from overseeing an election in which he is running.\n\nKemp’s office has been under fire for weeks after an investigation by the Associated Press found that more than 50,000 registrations, the vast majority from African-American voters, had been put on hold because data in their voter registration applications did not exactly match other government records.\n\n\n\nCivil rights’ groups have sued Kemp over that so-called “exact-match” law and over allegations that hundreds of absentee ballot were tossed after election workers determined that the signatures on the ballot applications did not match those on file. Federal judges ruled against Kemp in both instances.\n\n“He twice this week was told by federal judges that he was wrong when it comes to voter suppression,” Abrams said Sunday. “They forced him to restore access to the right to vote for those who are casting absentee ballots and those who on the exact match list. He is trying to rile up his base by misleading voters yet again.\"\n\n\n\nLater Sunday, Kemp’s office released another brief statement indicating that the investigation into the state’s Democratic Party was opened “after receiving information from our legal team about failed efforts to breach the online voter registration system and My Voter Page. We are working with our private sector vendors and investigators to review data logs.”\n\n\"The Democratic Party of Georgia will stop at nothing to regain relevance and power in our state,\" said Ryan Mahoney, Communications Director for Kemp’s gubernatorial campaign. \"In an act of desperation, the Democrats tried to expose vulnerabilities in Georgia's voter registration system. This was a 4th quarter Hail Mary pass that was intercepted in the end zone. Thanks to the systems and protocols established by Secretary of State Brian Kemp, no personal information was breached. These power-hungry radicals should be held accountable for their criminal behavior.”\n\nABC News’ Jack Date and Jeffrey Cook contributed to this report.\n"}