{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nEU auditors struggle to track use of Turkey refugee money EU auditors struggle to track use of Turkey refugee money  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Barack Obama surprise guest at Michelle Obama's book show  Trump says he should have gone to Arlington on Veterans Day  Migrants won't see armed US soldiers on border  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  US, allies to bring electricity to most of Papua New Guinea  Teen accused of killing mom over bad grade charged with murder as adult  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\n\nEuropean Union auditors on Tuesday said that Turkish officials refused to provide information that would help establish whether 1.1 billion euros ($1.2 billion) in EU refugee aid money is being properly spent.\nThe auditors said in a new report that Turkey's family and social policies ministry declined access to the names, ID numbers and addresses of people who benefited from two EU cash-assistance projects.\nThe projects include a system whereby refugees can withdraw around 30 euros in cash from pre-paid cards to help meet their needs.\nThe auditors said the ministry cited data protection laws as the reason for not providing the information. They said it's \"very rare\" for the court to be denied access to documents.\nChief court reporter Bettina Jakobson said that \"neither the (European) Commission nor the European Court of Auditors was able to track the project beneficiaries from their registration to the payment.\"\n\"This is a serious situation,\" she said. \"Normally as an auditor you would say you would like to follow the flow of money from the cradle to the grave. We cannot do that here.\"\nJakobson said \"there is a risk\" that not all the money is reaching the refugees.\nEU countries agreed in 2016 to give Turkey at least 3 billion euros in Syrian refugee aid money and other incentives to persuade the government in Ankara to stop migrants leaving for Greece.\nThe bloc said that if the money was properly used it could provide a further 3 billion euros in assistance. Around 3.5 million Syrian refugees are estimated to be on Turkish territory.\nThe EU has hailed the agreement with Turkey as a great success as it has helped slash migrant arrival numbers. However, many migrants are still languishing in terrible conditions on the Greek islands.\nThe bloc wants to replicate versions of the agreement with countries in northern Africa as it seeks to stop migrants setting out on dangerous voyages in rickety boats across the Mediterranean Sea.\nAsked whether the EU refugee money in Turkey has been well spent, Jakobson said \"I think so, yes. But of course we could have had more value for money.\""}