{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nPrison inmate death after incident with staff ruled homicide Prison inmate death after incident with staff ruled homicide  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Barack Obama surprise guest at Michelle Obama's book show  Trump says he should have gone to Arlington on Veterans Day  Migrants won't see armed US soldiers on border  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Governor: Official who said whites are 'master race' must go  US, allies to bring electricity to most of Papua New Guinea  Teen accused of killing mom over bad grade charged with murder as adult  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\n\nThe death of an inmate following an \"altercation with correctional staff\" at Western Illinois Correctional Center in May has been ruled a homicide, according to an autopsy report provided to The Associated Press under a Freedom of Information request.\nLarry Earvin died from blunt trauma to the chest and abdomen, the death certificate from Clinton County in southern Illinois said. The 65-year-old Earvin sustained 15 rib fractures and two dozen or more abrasions, hemorrhages and lacerations. Surgery to remove a portion of his bowel appears to have followed the injury, the report says.\nThe FBI is investigating the May 17 incident at the prison in Mount Sterling, about 250 miles (400 kilometers) southwest of Chicago. Illinois Department of Corrections officials declined to disclose details of the altercation.\nAt least four Western Illinois employees were placed on administrative leave with pay on May 22, according to documents provided under the Freedom of Information Act. Suspended for allegedly violating conduct standards were correctional Sgt. Willie Hedden, 40, of Mount Sterling; correctional Lts. Benjamin Burnett, 33, of Winchester, and Blake Haubrich, 30, of Quincy and correctional officer Alex Banta, 27, of Quincy.\nEarvin was black. The race of the officers allegedly involved in the altercation is uncertain.\nEarvin, serving a six-year sentence for a Cook County robbery and scheduled for release in September, was airlifted to a regional hospital after the incident , Corrections spokeswoman Lindsey Hess said in July. He died six weeks after he was airlifted, on June 26, at Centralia Correctional Center, according to the death certificate signed by Clinton County Coroner Phillip Moss.\nMoss declined comment. So did Dr. Gershom Norfleet, the St. Louis forensic pathologist who performed the autopsy with special agents from the FBI and Illinois State Police and a state police crime scene investigator attending.\nNeither FBI spokesman Brad Ware nor Hess would comment on the autopsy.\n\"The IDOC (corrections department) has cooperated fully with federal authorities and, as per FBI policy, we are not allowed to discuss details regarding an investigation,\" Hess said in an email.\nIn addition to the broken ribs and multiple abrasions which showed signs of healing at the time of death, Earvin had pneumonia, a tracheostomy tube and a chest tube to drain fluids, all associated with chest trauma, according to Norfleet's findings. Under the heading \"blunt abdominal trauma,\" the report says that a portion of Earvin's colon had been removed surgically and an ileostomy bag installed for waste removal.\nIn Earvin's system were morphine and Hydrocodone for pain and drugs used for anxiety and depression. He also had severe narrowing of the aorta, high blood pressure, cirrhosis and Hepatitis C.\nThe death certificate indicates that Earvin was born in an unknown Mississippi city. He was sentenced to six years in prison in 2015 for theft of merchandise under $300 in Cook County. His rap sheet also includes a seven-year stretch in 2004 for aggravated arson and previous convictions for retail theft, burglary, theft and attempted burglary dating to 1984.\nThe AP has been unable to locate any members of Earvin's family.\nHedden, Burnett, Haubrich and Banta were placed on administrative leave for \"violations of standards of conduct pending investigation,\" documents show. Hess declined comment on the officers' current status and would not confirm their suspensions were connected to the Earvin incident. But in the department's response to the AP's request for their disciplinary records, the department indicated it was withholding relevant documents because the \"FBI is the primary investigative agency in this matter and has determined that a release of these records would jeopardize the investigation.\"\nHedden declined comment when contacted. Messages left after calling numbers associated with the other correctional staff, Burnett, Haubrich and Banta, were not returned.\nThe corrections department initially said it didn't have any documents related to the incident. It denied AP's first request for records in July, and when the news organization appealed to the attorney general's public access counselor, the department responded that it had turned everything in its possession over to the FBI , and didn't even have copies of its own investigative reports. It later acknowledged it had found copies. The counselor ruled last week that the department had not fully complied with the Freedom of Information Act.\n———\nAP Researchers Jennifer Farrar and Rhonda Shafner in New York contributed.\n———\nFollow Political Writer John O'Connor at https://twitter.com/apoconnor ."}