{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nTexas Senate showdown: Cruz and O'Rourke talk presidential ambitions, border politics  Cruz, O'Rourke talk presidential ambitions, border politics: Texas Senate showdown  Andrew Gillum concedes Florida governor's race to Republican Ron DeSantis  Betsy DeVos pitches new protections for students accused of sexual assault  Controversies hamper candidates in Mississippi Senate race   The sisterhood of congressional 'firsts': Diverse group of newly elected women bond   Family of immigrant WWI soldier receives his Purple Heart 100 years after death  Sunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Papadopoulos launches late bid to delay looming prison term  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Fraternity suspended after member critically injured in fall  Trump says he finished answering questions from special counsel  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\nIn the midst of a fiery and critical U.S. Senate race in Texas, Republican Senator Ted Cruz and his opponent Democrat Rep. Beto O’Rourke each sat down with ABC News’ Paula Faris ahead of the November midterm election, opening up about presidential ambitions, the politics of immigration and President Donald Trump.\n\nCruz, who just two years ago was running against Trump for president, deflected questions about his 2016 campaign trail battles with Trump in his interview with Faris. At different times during that campaign, Cruz called Trump \"utterly amoral,\" \"a serial philanderer\" and a \"pathological liar.\"\n\nNor was he inclined to respond to Trump's campaign trail attacks on him.\n\n“Look, I have no interest in revisiting the comments of 2016,” he said -- calling the campaign \"bare-knuckle\" with \"hard shots on all sides.\"\n\nDuring the 2016 Republican presidential primaries, Trump attempted to link the father of the Texas senator, Pastor Rafael Cruz, to Kennedy assassin Lee Harvey Oswald.\n\n\n\nFaris, who asked Cruz if he would consider Trump a friend or a foe, stopped short of answering the question.\n\n“He's the president,\" said Cruz. \"I work with the president in delivering on our promises.”\n\n'A country to save'\n\n\nWhen Faris asked the elder Cruz if he had moved past the president’s insults, he suggested that it was not the time to be dwelling on the past.\n\n“We have a country to save,\" he said. \"We have a state to save. And we need to put away our petty differences and stand shoulder to shoulder.”\n\n\n\n\n\n\nTrump -- who has endorsed Cruz’s campaign -- is scheduled to arrive into Houston for the senator’s Monday rally. Cruz, in turn, said he would campaign for the president during his 2020 re-election bid.\n\nWhen Faris asked if the senator would say unequivocally that he would serve his entire second term, Cruz said “absolutely.”\n\nCruz has wavered on this point in the past.\n\n\n\n\n\n\nWith the 2020 presidential race drawing nearer, there was at least one thing opponents O’Rourke and Cruz could agree on.\n\nO'Rourke told Faris that he does not intend to run for president, partly in deference to his family.\n\n\n\n“We can't be out on the road for another two years. Nor would I want [to]. Nor do I think that's right,” he said, in reference to his wife and two young kids.\n\n“We've seen the consequence of a junior senator who leaves the state to pursue the presidency -- leaves our priorities. our opportunities, our needs -- behind,\" O'Rourke said, in a veiled reference to the unsuccessful presidential campaign that Cruz -- Texas's junior senator -- ran in 2016.\n\n\"I want to make sure that I'm there -- every single day, for every single one of us.”\n\n\n\nWith immigration taking center stage in Texas politics and a caravan of asylum seekers heading for the southern U.S. border with Mexico, Cruz believes law enforcement should intervene.\n\n“If you've got 4,000 people trying to cross illegally at one point, of course we should have the law enforcement resources to stop that,\" Cruz said. \"That's simple, common sense.”\n\n\n\nO’Rourke disagrees.\n\n“If things are so desperate -- in Guatemala, Honduras, El Salvador -- that someone would risk their lives to come here, then what can we do to improve conditions there?”\n\n\n\nEarly voting in Texas begins on Monday."}