{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nEx-convict convicted in fatal shooting of Tennessee officer Ex-convict convicted in fatal shooting of Tennessee officer  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Barack Obama surprise guest at Michelle Obama's book show  Trump says he should have gone to Arlington on Veterans Day  Migrants won't see armed US soldiers on border  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  US, allies to bring electricity to most of Papua New Guinea  Teen accused of killing mom over bad grade charged with murder as adult  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\n\nAn ex-convict was found guilty of first-degree murder and other charges Sunday in the fatal shooting of a police officer in Memphis, Tennessee.\nA jury in state court convicted Tremaine Wilbourn on Sunday in the August 2015 killing of Officer Sean Bolton. Wilbourn also was found guilty of carjacking and weapons charges, news outlets reported.\nBolton, who was white, was one of four police officers to be fatally shot in Memphis since July 2011. Wilbourn is black.\nPolice said Bolton interrupted a drug deal in a car Wilbourn occupied in a residential neighborhood. Wilbourn got out of the vehicle, and he and Bolton got into a physical struggle, according to authorities. Wilbourn took out a gun and shot Bolton, police said.\nAn autopsy report shows Bolton was shot eight times.\nWilbourn already has been sentenced to 25 years in federal prison on weapons charges. His lawyer said his client did not intend to kill Bolton. In court documents during his federal trial, prosecutors said Wilbourn carjacked a vehicle a few minutes after the shooting, telling the motorist that \"he needed the car because he had just shot a police officer.\"\nWilbourn led officers on an intense, two-day manhunt before turning himself in to U.S. marshals.\nAt the time of the shooting, Wilbourn was on federal probation after serving prison time for armed bank robbery."}