{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nClothing retailer J.Crew's chief executive stepping down Clothing retailer J.Crew's chief executive stepping down  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Barack Obama surprise guest at Michelle Obama's book show  Trump says he should have gone to Arlington on Veterans Day  Migrants won't see armed US soldiers on border  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  US, allies to bring electricity to most of Papua New Guinea  Teen accused of killing mom over bad grade charged with murder as adult  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\n\nThe chief executive of J.Crew Group Inc. is stepping down.\nThe clothing retailer said in an announcement Saturday that the departure of James Brett, a retail veteran who took the top job in 2017, was by mutual agreement between Brett and the company's board of directors.\nIn a statement, Brett said that despite a recent brand relaunch which was showing positive results, he and the company's board were \"unable to bridge our beliefs on how to continue to evolve all aspects of the company.\"\nThe company said Brett's responsibilities will be assumed by four senior J.Crew executives, including Michael Nicholson, the company's president and chief operating officer.\nBrett, who had previously headed up furniture chain West Elm, had been hired in the summer of 2017 when Mickey Drexler, J.Crew's longtime top executive, stepped down.\n\"Returning J.Crew to its iconic status required reinventing the brand to reflect the America of today with a more expansive, more inclusive fashion concept,\" Brett said in his statement.\nIn its statement, the company said that Brett had brought new energy to J.Crew and had \"enhanced our ability to relate to a broad range of consumers.\""}