{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nAmid search for North Carolina 13-year-old Hania Noelia Aguilar, authorities ask residents to check properties for 'anything unusual' Police ask residents to check properties amid search for 13-year-old Hania Aguilar  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Barack Obama surprise guest at Michelle Obama's book show  Trump says he should have gone to Arlington on Veterans Day  Migrants won't see armed US soldiers on border  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  US, allies to bring electricity to most of Papua New Guinea  Teen accused of killing mom over bad grade charged with murder as adult  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\nAuthorities are asking residents in North Carolina's Robeson County to check their properties this weekend for \"anything unusual or out of place\" amid the ongoing search for kidnapped 13-year-old Hania Noelia Aguilar.\n\n\"If you see something that doesn’t belong or is not normal, do not touch anything (you could damage possible evidence) and call the tip line or 911,\" the Lumberton Police Department wrote in a Facebook post Friday night. \"You know your property best and can most easily determine if something is worth contacting law enforcement to help us.\"\n\nLumberton Police Chief Michael McNeill told reporters earlier this week that investigators are following \"every conceivable lead\" to find the eighth-grader.\n\n\n\n\n\n\n\n\nHania was kidnapped just before 7 a.m. local time on Nov. 5 outside her home at the Rosewood Mobile Home Park in Lumberton, a city in Robeson County, according to police.\n\nShe had grabbed her aunt's car keys that morning so she could turn on the vehicle before school. That's when a witness saw a man clad in all black with a yellow bandanna over his face approach the girl and force her into the green, 2003 Ford Expedition, police said.\n\nThe suspect then drove away in the family's SUV with Hania inside, police said. The stolen vehicle was located several miles away on Quincey Drive three days later, but Hania was nowhere to be found.\n\n\n\n\nSo far, investigators said there's no indication to believe Hania isn't alive.\n\nThe FBI, which has named Hania's disappearance its \"Most Wanted: Case of the Week,\" announced Tuesday that it had raised its reward to $25,000 for information on the case. The state of North Carolina is also offering a reward of up to $5,000, bringing the total possible reward amount to $30,000.\n\n\n\n\n\nAuthorities also released a handwritten statement in Spanish by Hania's mother, Elsa Hernandez, pleading for her daughter's safe return while dismissing the rumors swirling on social media.\n\n\n\n\n\"I trust in God that my daughter will return,\" Hernandez wrote. \"No one knows the pain I have in my heart. Despite all the criticism and speculation against me, I would never use my daughter’s name in order to take advantage of this situation. I thank all those people who have provided me help.\n\n\"Please,\" she continued, \"if you know something, call. I ask everyone not to make absurd comments. For the love of God respect my pain. I only want Hania, my princess, back. I miss her.\"\n\nThe FBI subsequently posted a statement on Twitter in support of Hania's mother.\n\n\"Social media can be cruel. Hania Aguilar is still missing. Her Mother wrote this note to ask people not to say such mean things on social media. Support this Mother, her daughter was kidnapped,\" the FBI's field office in Charlotte tweeted Tuesday night.\n\n\n\nInvestigators are still trying to track down a man who was seen in surveillance footage walking in the neighborhood that Monday morning, around the time Hania was abducted. The three videos, which the FBI released earlier this week, show the unidentified man wearing light-colored shoes, a light-colored shirt and a hoodie.\n\nThe man is not considered a suspect or person of interest at this time. Rather, he's someone authorities \"want to speak with\" because he may be able to help investigators narrow down a timeline of Hania's kidnapping, according to FBI Supervisor Andy de la Rocha.\n\n\n\nAuthorities are seeking additional surveillance footage from anyone who lives or owns a business on or near Quincey Drive.\n\nHania is described as a Hispanic girl who is 5 feet tall and weighs about 125 pounds, according to the FBI. She has black hair and brown eyes and was last seen wearing a blue shirt with flowers and blue jeans.\n\nAuthorities have set up a special tip line that anyone can call if they have information to help investigators find Hania: (910) 272-5871.\n\nABC News' Rachel Katz and Emily Shapiro contributed to this report."}