{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\n7th child dies from outbreak at NJ rehabilitation center", "paragraph": "Coming up in the next {{countdown}} {{countdownlbl}}Coming up next:{{nextVideo.title}}{{nextVideo.description}}Skip to this video now RelatedNow Playing:{{currentVideo.title}}Play Video This transcript has been automatically generated and may not be 100% accurate.Virus outbreak strikes NJ medical facility, killing 6 childrenThe medical center provides long-term care for medically fragile children with severely compromised immune systems. 6 children dead from adenovirus outbreak in New JerseyThe outbreak occurred in recent days at the Wanaque Center for Nursing and Rehabilitation in Haskell, according to a statement from the New Jersey Department of Health.Now Playing: Virus outbreak strikes NJ medical facility, killing 6 childrenNow Playing: 6 children dead from adenovirus outbreak in New JerseyNow Playing: 7th child dies from adenovirus outbreak at New Jersey rehabilitation centerNow Playing: 91,000 pounds of ground turkey recalled due to possible SalmonellaNow Playing: Top tips for Thanksgiving food safetyNow Playing: Juul to temporarily stop selling most flavored nicotine in storesNow Playing: What is AFM?Now Playing: New AHA guidelines for battling high cholesterol and heart disease Now Playing: What to know about the new cholesterol guidelines for heart health Now Playing: Cigarette smoking in the US hits record low, but it's not all good newsNow Playing: How to fight off the 'winter blues'Now Playing: New study shows actual force backpacks put on your spineNow Playing: 'This is the future': How a mirror could transform working outNow Playing: FDA approved new opioid drug called DsuviaNow Playing: FDA approves powerful, controversial new painkiller Now Playing: Meghan McCain and actor Joe Mazzello bond over losing their fathers to glioblastomaNow Playing: Medicine isn't candy: How to keep your kids safe this HalloweenNow Playing: ABC News' Amy Robach opens up about her journey up Mt. Kilimanjaro Now Playing: 2 women believed to be 1st to carry same babyNow Playing: 72 confirmed cases of rare, polio-like AFM in 24 states: CDCNow Playing: {{itm.title}}"}