{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nColorado's Jared Polis could make history as first openly gay governor Colorado Democrat could make history as first openly gay governor  Andrew Gillum concedes Florida governor's race to Republican Ron DeSantis  Betsy DeVos pitches new protections for students accused of sexual assault  Controversies hamper candidates in Mississippi Senate race   The sisterhood of congressional 'firsts': Diverse group of newly elected women bond   Family of immigrant WWI soldier receives his Purple Heart 100 years after death  Sunday on 'This Week': Rep. Adam Schiff and Sen. Roy Blunt  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Papadopoulos launches late bid to delay looming prison term  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Fraternity suspended after member critically injured in fall  Trump says he finished answering questions from special counsel  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\n\n\nNot once during his public remarks to a small group of ardent Democrats in this picturesque mountain town did Jared Polis talk about his personal life.\n\nHe talked about his accomplishments in Washington and his goals for Colorado. He talked about the Continental Divide Recreation, Wilderness, and Camp Hale Legacy Act and he talked about the Helicopter Fuel System Safety Act. He talked about how lowering the cost of early childhood education would benefit the state's neediest families and how if his opponent is elected, he will serve as a \"yes-man\" for the president. But Jared Polis didn’t talk about his personal life.\n\nIn a year in which candidates across the country are sharing tales of  their health ailments and job layoffs, racial discrimination and childcare struggles, Polis -- who could make history next week as the first openly gay man to win a U.S. gubernatorial election -- is instead deflecting attention away from his potential historical accomplishment and towards the message of inclusivity that has been embraced by his fellow Democrats in the most diverse election cycle in modern memory.\n\n\"I really think that we are at our best as a nation, as a society, when our elected officials are fully representative of the people they're elected to work for,\" Polis told ABC News. \"That means we should have our communities of color represented, women represented, the LGBTQ community represented. And the more diversity we have in elected leadership, responsible positions, I think the better result we'll have.\"\n\n\n\nThough he's chosen not to make his sexual orientation a talking point on the campaign trail, Polis' shot at history comes as part of this year's \"rainbow wave,\" an influx of LGBTQ candidates across the country who are running for office.\n\nIn Vermont, Democrat Christine Hallquist is the first transgender woman to be a major party's gubernatorial candidate. Gov. Kate Brown, up for re-election in Oregon, became the first openly bisexual person to serve as a state's governor upon her ascension to the position in 2015. ABC News has identified an additional 22 candidates who identify as members of the LGBTQ community running as the major party nominee in House and Senate races nationwide.\n\n\n\nTo Polis however, already the first openly gay man to be out when first elected to the House of Representatives, such progress is not unusual, at least in his home state.\n\n\"Colorado is a groundbreaking state,\" said Polis. \"We've had LGBT speakers in our state assembly, Senate minority leaders, commissioners.\"\n\nBut as he referenced the various achievements of LGBTQ community members across the state, Polis neglected to mention moments that it did not distinguish itself as progressive. Namely, the 1992 referendum formally called the \"Colorado No Protected Status for Sexual Orientation Amendment.\" The initiative, which was approved by a 53.4 to 46.6 margin stripped legal protection for homosexual, lesbian and bisexual residents on the basis of their sexual orientation. This led Colorado to acquire the nickname, \"The Hate State.\"\n\nThough the result of the 1992 referendum startled the state's LGBT community, it also spurred a call to action that has led to significant developments for the LGBTQ community over the past 25 years.\n\n\"Activism around Amendment 2 really helped, I believe, Colorado become more politically sophisticated and more organized,\" said Rex Fuller, the vice president of communications at the non-profit GLBT Community Center of Colorado in Denver.\n\n\n\nFuller linked the amendment's passage to the 1980s AIDS crisis, which disproportionately affected LGBT persons, describing the era as a low-point for the community from which it has gradually recovered. A number of legal advancements since have come in the form of Supreme Court decisions. In 1996, Amendment 2 was thrown out as a result of the decision in Romer v. Evans, the Defense of Marriage Act was struck down via United States v. Windsor in 2013, and 2015's Obergefell v. Hodges decision affirmed the right of same-sex couples to marry.\n\n\"They're the rights that anyone should have under our Constitution,\" Fuller said, explaining that though the LGBT community may appear insular to outsiders, its members should be treated no differently.\n\n\"I think that's always where we've been trying to move. Any minority group wants to enjoy a shared heritage that they share because of shared experiences, but that doesn't govern everything.\"\n\nComing out is never easy, but #itgetsbetter #nationalcomingoutday #lgbt pic.twitter.com/mkXUpjbjRz\n\nThe Supreme Court decisions and a broader societal shift towards LGBTQ acceptance have not, however, ended the harassment of the community. Fuller recounted a number of incidents in the past two years in which local LGBT individuals have been hassled because of their sexual orientation, including once by a person wearing a \"Make America Great Again\" hat.\nAccording to Human Rights Campaign, an LGBTQ civil rights organization, 22 transgender people have died due to fatal violence in 2018. Last year the total was 29, the highest number ever recorded by the organization.\nhttps://www.hrc.org/resources/violence-against-the-transgender-community-in-2018\n\nAdditional legal protections for the LGBTQ community are being sought by legislative means, and though community members are optimistic about Colorado's increasingly progressive laws -- those governing marijuana possession and use were among the first of their kind in the country -- LGBTQ advocates have run into roadblocks over the past four years when they attempted to make it easier for transgender people to change their birth certificates and outlaw conversion therapy on LGBTQ minors.\n\n\n\nDaniel Ramos, the executive director of One Colorado, an LGBTQ advocacy organization located in Denver, said that while gathering bipartisan support, the both measures failed in recent years in the state's Republican-controlled Senate. In addition to Polis' history-making campaign, Colorado Democrats' top priority this week is to win back that chamber.\n\n\"For the work that we do, we know that the governor can only do so much,\" Ramos said. \"And that the more work we do to change hearts [and] minds in Colorado and across the country around LGBTQ issues is even more important.\"\n\n\"While we may have a pro-equality majority in state legislature and a pro-equality governor, the important work we still need to do is to tell stories and to humanize the impacts of legislation for LGBTQ folks. Having a gay governor doesn't make everything else go away.\"\n\nThough Polis has been a public figure in the state for decades -- prior to his run for the House he was a chairman of the state board of education and a prolific philanthropist -- he has not been immune to attacks on his sexual orientation. The appearance of homophobic bumper stickers against Polis were reported in the town of Eagle, Colorado, and police have located a person of interest, according to Fox's Denver affiliate KDVR.\n\nBut as for his sexual orientation's impact at the polls, the Democrat was adamant that voters are focused on the bigger picture.\n\n\"I think what the people of Colorado care about is: who's going to make my life better?\" Polis said. \"They don't care about who you are and who you love.\""}