{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nMigrants get cool reception in Mexican border town Migrants get cool reception in Mexican border town  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Barack Obama surprise guest at Michelle Obama's book show  Trump says he should have gone to Arlington on Veterans Day  Migrants won't see armed US soldiers on border  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  US, allies to bring electricity to most of Papua New Guinea  Teen accused of killing mom over bad grade charged with murder as adult  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\n\nMany of the nearly 3,000 Central American migrants who have reached the Mexican border with California via caravan said Saturday they do not feel welcome in the city of Tijuana, where hundreds more migrants are headed after more than a month on the road.\nThe vast majority were camped at an outdoor sports complex, sleeping on a dirt baseball field and under bleachers with a view of the steel walls topped by barbed wire at the newly reinforced U.S.-Mexico border. The city opened the complex after other shelters were filled to capacity. Church groups provided portable showers, bathrooms and sinks. The federal government estimates the migrant crowd in Tijuana could soon swell to 10,000.\nTijuana Mayor Juan Manuel Gastelum has called the migrants' arrival an \"avalanche\" that the city is ill-prepared to handle, calculating that they will be in Tijuana for at least six months as they wait to file asylum claims. U.S. border inspectors are processing only about 100 asylum claims a day at Tijuana's main crossing to San Diego. Asylum seekers register their names in a tattered notebook managed by migrants themselves that had more than 3,000 names even before the caravan arrived.\nWhile many in Tijuana are sympathetic to the migrants' plight and trying to assist, some locals have shouted insults, hurled rocks and even thrown punches at the migrants.\nIt's a stark contrast to the many Mexican communities that welcomed the caravan with signs, music and donations of clothing after it entered Mexico nearly a month ago. Countless residents of rural areas pressed fruit and bags of water into the migrants' hands as they passed through southern Mexico, wishing them safe journeys.\nAlden Rivera, the Honduran ambassador in Mexico, visited the outdoor sports complex Saturday. Rivera expects the migrants will need to be sheltered for eight months or more, and said he is working with Mexico to get more funds to feed and care for them. He expects the migrant numbers in Tijuana to reach 3,400 over the weekend, with another 1,200 migrants having made it to Mexicali, another border city a few hours to the east of Tijuana. An additional 1,500 migrants plan to reach the U.S. border region next week.\nRivera said 1,800 Hondurans have returned to their country since the caravan first set out on Oct. 13, and that he hopes more will make that decision.\n\"We want them to return to Honduras,\" Rivera said, adding that each migrant must weigh whether to go home, appeal for asylum in Mexico or wait in line to apply for asylum in the U.S.\nThe Mexican Interior Ministry said Friday that 2,697 Central American migrants have requested asylum in Mexico under a program that the country launched on Oct. 26 to more quickly get them credentials needed to live, work and study in southern Mexico.\nIvis Muñoz, 26, has considered returning to Honduras. The coffee farmer called his father in Atima, Honduras, on Saturday to consult on his next move a few days after being attacked on a beach by locals in Tijuana. His father told him to stick it out.\nMunoz has a bullet in his leg. A gang member shot him a year ago in Honduras and threatened to kill him if he sees him again. Munoz said he found out later his girlfriend had been cheating on him with the gang member.\nHe's afraid to go home, but he feels unwelcome in Tijuana.\nMunoz was asleep on a beach in Tijuana with about two dozen other migrants when rocks came raining down on them around 2 a.m. Wednesday. He heard a man shout in the darkness: \"We don't want you here! Go back to your country!\" Munoz and the others got up and ran for cover, heading toward the residential streets nearby. As the sun rose, they hitched a ride on a passing truck to Tijuana's downtown. Now he is staying at the sports complex.\n\"I don't know what to do,\" said Munoz. He fears the U.S. won't grant him asylum, and that he'll get deported if he tries to cross into the country without authorization.\nCarlos Padilla, 57, a migrant from Progreso, Honduras, said a Tijuana resident shouted \"migrants are pigs\" as he passed on the street recently. He did not respond. \"We didn't come here to cause problems, we came here with love and with the intention to ask for asylum,\" Padilla said. \"But they treat us like animals here.\"\nPadilla said he will likely return to Honduras if the U.S. rejects his asylum request.\nThe migrants' expected long stay in Tijuana has raised concerns about the ability of the border city of more than 1.6 million to handle the influx.\nTijuana officials said they converted the municipal gymnasium and recreational complex into a shelter to keep migrants out of public spaces. The city's privately run shelters have a maximum capacity of 700. The municipal complex can hold up to 3,000; as of Friday night there were 2,397 migrants there.\nSome business owners near the shelter complained on Saturday of migrants panhandling and stealing.\nFrancisco Lopez, 50, owns a furniture store nearby. He said a group of migrants took food from a small grocery a few doors down, and he worries that crime in the area will rise the longer the migrants stay at the shelter.\nOther neighbors expressed empathy.\n\"These poor people have left their country and they're in an unfamiliar place,\" said Maria de Jesus Izarraga, 68, who lives two blocks from complex.\nAs Izarraga spoke from her home's front door, a man interrupted to ask for money to buy a plate of beans. He said he came with the caravan and had blisters on his feet. She gave him some pesos, and continued speaking: \"I hope this all works out in the best possible way.\"\nOutside the complex, lines of migrants snaked along the street to receive donations of clothes and coolers full of bottled water being dropped off by charity groups and others looking to help the migrants.\nFelipe Garza, 55, acknowledged that many in his hometown don't want to help as he and other volunteers from his church handed migrants coffee and rolls at the impromptu municipal shelter. \"It's uncomfortable to receive such a big multitude of people, but it's a reality that we have to deal with,\" he said.\nGarza surmised that if the Central Americans behave, Tijuana will embrace them just as it did thousands of Haitians in 2016. Those Haitians have since opened restaurants, hair salons and enrolled in local universities.\nPolice officer Victor Coronel agrees but wonders how much more the city can take. \"The only thing we can do is hope that President (Donald) Trump opens his heart a little,\" said Coronel.\nTrump, who sought to make the caravan a campaign issue in last week's elections, took to Twitter on Friday to aim new criticism at the migrants.\n\"Isn't it ironic that large Caravans of people are marching to our border wanting U.S.A. asylum because they are fearful of being in their country — yet they are proudly waving ... their country's flag. Can this be possible? Yes, because it is all a BIG CON, and the American taxpayer is paying for it,\" Trump said in a pair of tweets.\n———\nAssociated Press writer Amy Guthrie in Mexico City contributed to this story."}