{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nManhunt underway for 'armed and dangerous' suspect in killing of Georgia police officer Manhunt underway for 'armed and dangerous' suspect in killing of police officer  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Barack Obama surprise guest at Michelle Obama's book show  Trump says he should have gone to Arlington on Veterans Day  Migrants won't see armed US soldiers on border  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  US, allies to bring electricity to most of Papua New Guinea  Teen accused of killing mom over bad grade charged with murder as adult  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\nA manhunt was underway Sunday for a suspect in the killing of a police officer near a suburban Atlanta school after he and his partner responded to a report of a suspicious vehicle, authorities said.\n\nTafahree Maynard, 18, is considered \"armed and dangerous\" and is believed to be the gunman who opened fire without warning Saturday afternoon on Gwinnett County Police Officer Antwan Toney and his partner, police said.\n\nMaynard is wanted on suspicion of felony murder and aggravated assault in the death of Toney, who had recently celebrated his 30th birthday with colleagues in Las Vegas and was just six days short of marking his third anniversary as a member of the department, officials said.\n\n\n\nAs of Sunday afternoon, police said the hunt for Maynard was ongoing and announced a $5,000 reward for information leading to his arrest and indictment.\n\nToney and another officer approached a vehicle near the Shiloh Middle School in Snellville about 2:30 p.m. on Saturday to check out a report of people smoking marijuana, according to Sgt. Jake Smith of the Gwinnett County Police Department.\n\n\"Before they could even get to the vehicle the shots rang out\" from inside the car, Smith said, adding that such things don't happen \"99.999 percent\" of the time.\n\n“That it went this way, it’s just tragic,” Smith said.\n\n\n\nThis was the first police job for Officer Toney. Prior to working for our agency, he worked as a security guard. His immediate family lives in California.\n\nOfficer Toney was assigned to the South Precinct. pic.twitter.com/JKV5oOLD7K\n\nOne of the bullets struck Toney, Smith said.\n\n\n\nToney's partner, who has not been identified, was not injured and dragged the mortally wounded officer away for cover, Smith said.\n\n\n\n\nIt was not immediately clear where Toney was struck. He was taken to nearby Gwinnett County Medical Center, where he was pronounced dead.\n\n\"What a chief wants to hear is that the officer is OK. And when I asked that question, that wasn't the answer I got,\" Gwinnett County Police Chief Butch Ayers said during an emotional news conference late Saturday.\n\nWhen Toney graduated from the police academy in 2015, it was Ayers who presented him with his badge.\n\n\"The people that worked with Officer Toney on a daily basis recalled a very jovial person who was dedicated to his job and dedicated to his community,\" Ayers said.\n\nThe GCPD officer shot in the line of duty has died as a result of his injuries. Efforts are ongoing to locate the suspect responsible. Media post is at Hwy. 78 and Killian Hill Rd.\n\nInitial reports indicated that the vehicle Toney and his partner were called to investigate contained as many as four people.\n\nFollowing the shooting, the car took off and crashed less than a mile from the shooting scene, Smith said. The officers returned fire, but it was unclear whether anyone in the car was hit or if any injuries resulted from the crash, Smith said.\n\n\n\nThe suspects fled on foot.\n\nOne suspect, Isaiah Pretlow, 19, was arrested soon after the shooting and charged with aggravated assault, officials said. Pretlow was nabbed after he allegedly opened fire on U.S. Marshals as they approached him, officials said.\n\nThe marshals were not injured while arresting Pretlow, officials said.\n\nAyers said investigators are reviewing body camera footage of the shooting, but did not specify whose body camera footage he was referring to. Earlier, Smith had said most of the officers in the department have body cameras, but not all.\n\nIsaiah Pretlow (in dreadlocks) has been arrested and charged with Aggravated Assault. Still at large is Tafahree Maynard, who is charged with Aggravated Assault and Felony Murder in connection with Ofc. Toney’s murder. Anyone with information on Maynard should call 770-513-5710. pic.twitter.com/18w0JXV1VG\n\nFriends and community residents joined officers who worked with Toney for a candlelight vigil Saturday night at the Gwinnett County Fallen Heroes Memorial in Lawrenceville, Georgia.\n\n\n\n\"He was practically like a brother. He was over at my house all the time,\" Reginald Pierre, a friend of Toney's who attended the vigil, told ABC affiliate station WSB-TV in Atlanta.\n\nABC News' Alexandra Faul and Mark Osborne contributed to this report."}