{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nDHS secretary praises Mexican police for handling caravan migrants 'in a professional and humane manner'  DHS secretary praises Mexican police for handling of migrant caravan  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Barack Obama surprise guest at Michelle Obama's book show  Trump says he should have gone to Arlington on Veterans Day  Migrants won't see armed US soldiers on border  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  US, allies to bring electricity to most of Papua New Guinea  Teen accused of killing mom over bad grade charged with murder as adult  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\nAs the caravan of Central American migrants enters Mexico, a senior Trump administration official praised the Mexican police for their handling of the \"crisis on their southern border.\"\n\nDepartment of Homeland Security Secretary Kristjen Nielsen tweeted that DHS would continue \"to support our Mexican partners as they take steps to confront the crisis on their southern border. The Mexican federal police are handling this in a professional and humane manner.\"\n\nShe added in a subsequent tweet that she has been in “constant contact” with her foreign counterparts in Mexico, Guatemala and Honduras, and that her department was monitoring the situation and ready to provide assistance if necessary.\n\n\n\nI have been in constant contact with my foreign counterparts in Mexico, Guatemala and Honduras. Closely monitoring developments and providing any requested assistance.\n\nThousands of migrants reached the Guatemala-Mexico border on Friday, breaking through a fence on the Guatemala side of a bridge separating the two countries. On the Mexican side of the bridge, they were met by Mexican police in riot gear. Others, meanwhile, waded into the Suchiate River or took rafts to get to Mexico.\n\n\n\n\n\nMany of the migrants are seeking refugee status in either Mexico or the United States.\n\n\n\n\n\nThe Mexican Interior Ministry said on Saturday that 640 Honduran migrants have requested refuge in Mexico. It also said that priority attention would be given \"164 women, some of them in advanced stage of pregnancy; 104 girls, boys and teenagers, who are from 3 months old to 17 years old; as well as older adults who have varying degrees of disability. This group includes a minor who traveled alone.\"\n\nPresident Trump threatened in a series of tweets on Thursday to “call up the U.S. military and close our SOUTHERN BORDER” if Mexico doesn’t do anything to stop the flow of migrants moving north.\n\nI am watching the Democrat Party led (because they want Open Borders and existing weak laws) assault on our country by Guatemala, Honduras and El Salvador, whose leaders are doing little to stop this large flow of people, INCLUDING MANY CRIMINALS, from entering Mexico to U.S.....\n\n....In addition to stopping all payments to these countries, which seem to have almost no control over their population, I must, in the strongest of terms, ask Mexico to stop this onslaught - and if unable to do so I will call up the U.S. Military and CLOSE OUR SOUTHERN BORDER!..\n\nThe president also blamed Democrats at a rally on Friday night in Arizona for the illegal border crossings.\n\n\n\n\n\nYet, it seems that Mexico will continue to process migrants. The Interior Ministry said in its statement that migrants will begin the refugee application process at the country’s National Institute of Migration, where their data will be collected, before they are sent to shelters that have been “enabled for their accommodation.”\n\nThe Mexican government also released handout video of migrants on a bus being told by an official that they would be assisted in being processed for any asylum claims they may have.\n\nABC News' Amanda Maile and Joshua Hoyos contributed to this report. "}