{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nWhat to know about the new IVF treatment  What to know about the new IVF treatment   Formerly Conjoined Twins Get Send-Off at Hospital Where They Were Separated  CDC Issues New Vaccine Guidelines for Adults  Facebook Post Helps Toddler Get Kidney From Parents' Former HS Classmate  Flu Takes a Toll in NYC, With 4 Children Reported Dead  Mumps Outbreak Reaches 367 Cases in Washington State  Girl Surprised With Super Bowl Tickets After Being Treated for Rare Cancer  In Chicago, Witnesses to Violence Turn to First Aid to Save Lives  6-Year-Old Girls Link Intelligence to Men Over Women, Study Says  Avian Flu Outbreaks Raise Concerns About Possible Pandemic   Seoul Virus Spread by Pet Rats Under Investigation in Multiple States  Teacher Aide Accused of Faking Cancer to Hide Criminal Past  More Chronically Ill Patients Have Health Insurance After ACA, Study Finds  11-Year-Old Boy Is One of the Youngest to Get Artificial Heart  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe ", "paragraph": "\nAshleigh and Bliss Coulter from Mountain Springs, Texas, have become the first same-sex couple in the state to take part in the birth of a child using a technique called Reciprocal effortless in vitro fertilization, a procedure pioneered by their doctor, Dr. Kathy Doody, and her husband, Dr. Kevin Doody, both Reproductive Endocrinology and Infertility specialists. Reciprocal effortless IVF is a unique way for two females to physically take part in the creation of a child.\n\nWhat’s the difference between “Reciprocal IVF” and “Reciprocal effortless IVF?”\n\nReciprocal effortless IVF is a combination of two IVF treatments that allows two women to take part in carrying their child at different stages.\n\nReciprocal IVF has already been practiced for many years, and allows two women to participate. This involves fertilizing the eggs from one woman with sperm, incubating them in a lab, and then transferring the embryo to their female partner.\n\nEffortless IVF is a procedure that uses an FDA approved device called the INVOcell to assist in reproduction. Once the eggs have been retrieved from the female, the sperm and egg are placed in a test tube for 5 minutes. They are then transferred to the INVOcell device, which is moved to a woman’s vagina. The vagina acts as an incubator and carries the embryo for 5 days. The INVOcell is then removed by a doctor and the embryo is implanted into the same woman’s uterus.\n\nWhile effortless IVF typically involves the same female providing the egg and carrying the embryo, Reciprocal effortless IVF involves one female providing the egg and initial incubation environment, while another carries the embryo to term in a pregnancy.\n\n\n\nDoes that mean that two women can be pregnant with the same baby?\n\nEach woman isn’t actually pregnant using this method. The first female holds the device containing the sperm and egg that becomes the embryo in her body for five days. The embryo is then transferred into the uterus of the woman who eventually gives birth. Only the second woman is actually pregnant.\n\n\n\nWhat could this mean for same sex couples?\n\n\nAccording to Dr. Doody, Bliss and Ashleigh Coulter were the first same sex couple that were both able to both carry the same baby. While Bliss provided the eggs and incubated the embryo for the first 5 days, it was transferred to Ashleigh who became pregnant and delivered their child.\n\n“For same sex couples this opens up a whole new way to look at IVF,” said Doody.\n\n\n\nWhat is the cost?\n\nDr. Doody’s website estimates the cost of effortless IVF to be $8,000 to $10,050, which can be less expensive than traditional IVF.\n\nWhat are the differences between effortless IVF and traditional IVF procedures with incubation?\n\nThis procedure is not much of a departure from regular IVF, according to Dr. Richard Paulson, a professor of obstetrics and gynecology and chief of the division of reproductive endocrinology and infertility at the University of Southern California. The main difference is that the fertilization happens inside the first woman instead of an incubator.\n\nEditor’s Note: Dr. Doody has a financial interest in the company that makes INVOcell, and her husband serves on its board.\n\nDr. Anna Jackson is a psychiatry resident at Vanderbilt University Medical Center and a member of the ABC News Medical Unit.\n\nEditor's note: This article has been updated to reflect the following changes: The article originally stated that the Coulters were the first-ever same-sex couple to ever have this specific IVF procedure. They were in fact the first couple in Texas to have the procedure. Ashleigh Coulter's name was originally misspelled as Ashley, this has been corrected throughout the article. Reciprocal effortless in vitro fertilization was pioneered by both Dr. Kathy Doody and her husband, Dr. Kevin Doody, not just Dr. Kathy Doody."}