{"id": "\nSections\n\nShows\n\nLive\n\nYahoo!-ABC News Network  |  © 2018 ABC News Internet Ventures. All rights reserved.\n\n\n\n\nCentral American migrants in caravan respond to President Trump calling them criminals: 'This is all propaganda'  Migrants in caravan respond to Trump calling them criminals  Relentless California wildfires leave 79 dead, nearly 1,300 others still missing  Argentine submarine found at bottom of Atlantic after year of searching  Betsy DeVos pitches new protections for students accused of sexual assault  Fraternity suspended after member critically injured in fall  Barack Obama surprise guest at Michelle Obama's book show  Trump says he should have gone to Arlington on Veterans Day  Migrants won't see armed US soldiers on border  The DC docket shows dozens of sealed criminal indictments. Are they from Mueller?  Stacey Abrams calls Brian Kemp the 'victor' in Georgia governor's race  Trump says he finished answering questions from special counsel  Nancy Pelosi, potential challenger have 'candid' discussion on speaker's race  Papadopoulos launches late bid to delay looming prison term  Trump awards Presidential Medal of Freedom to Babe Ruth, Elvis Presley   Trump says he'll nominate acting EPA chief Andrew Wheeler to be permanent  The Note: Uneasy questions settle over post-election Washington  Alabama DA shot after ambush by former state trooper: Police  Graham says acting AG Whitaker will 'honor regular order' in Mueller probe  Prison inmate death after incident with staff ruled homicide  Governor: Official who said whites are 'master race' must go  US, allies to bring electricity to most of Papua New Guinea  Teen accused of killing mom over bad grade charged with murder as adult  Man still missing after disappearing from NFL game  What we know so far about Kate Upton's life as a new mom  Private funeral held for Stan Lee, more memorials in works  Pet lovers meet pet stars at Manhattan's PetCon  Attorney for female GoFundMe suspect claims she, too, was duped   Dior and Jennifer Lawrence face claims of cultural appropriation over new campaign   Creed II' goes more than the distance: Review  Comedian releases novel inspired by his Irish roots  Female high school quarterback throws TD on 1st pass in varsity game ", "paragraph": "\nBattling hunger, exhaustion and President Donald Trump's portrayal of them as criminals, thousands of Central American migrants traveling through Mexico were hoping to get rides Sunday to move them closer to the U.S. border, but many trekking with children said they could not afford what drivers were charging to squeeze onto the payloads of cargo trucks.\n\nAt a gas station in Loma Bonita, Oaxaca, Franklyn Cano, 30, of Honduras, said drivers were charging 150 pesos, or about $7.50 in U.S. currency, to board trucks headed to Mexico City, a fee most could not afford.\n\n\"Everybody has children sleeping in the street. A lot of people right now are hungry,\" Cano told ABC News.\n\nAs Cano spoke, a chaotic scene was unfolding nearby with hundreds of migrants cramming onto a truck. The driver was still deciding whether to take them after a humanitarian group told him he should not be charging the desperate people for rides.\n\nCano said he used to live in New York City and hoped to one day get back there. He said he fled Honduras because of gangs and corrupt government officials that have made his life difficult there.\n\n\n\nMany of the migrants said they have been following what Trump has been saying about them in recent days and wanted to convey to Americans that most of them are not the violent criminals that the president has described.\n\n\"Everybody wants freedom,\" Cano said.\n\nAt campaign rallies across the United States, Trump has zeroed in on the so-called caravan of immigrants from Central America making their way north through Mexico toward the U.S. border.\n\n“When you look at that caravan coming up –- that's not what we want. That's not for us, folks,\" Trump said at a campaign rally in Florida on Saturday. \"They have to come in legally. They have to come in absolutely through a process and they have to come in through merit so they can help all the companies moving back to Florida and the United States.\"\n\n\n\nHe has described those traveling in the caravan as violent criminals, among whom he says could include Middle Eastern terrorists.\n\nTrump has pledged to send up to 15,000 troops to the border in response to the slow-moving migrant caravan.\n\nThe Pentagon said more than 3,500 troops have been deployed to staging bases along the border, including about 1,000 Marines in California. Still, there were only about 100 troops at the border as of Friday, working at and near a bridge leading to McAllen, Texas, the Rio Grande Valley's second-biggest city, with a population of about 140,000.\n\n\"Donald Trump is saying that everybody in here they're violent. That is not true,\" Rafael Garcia of Guatemala told ABC News Sunday morning. \"This is all propaganda for his campaigns. It's all political what he's doing and that's not right what he's doing. He should be ashamed of himself for saying that.\"\n\n\n\nTrump has frequently cited a violent scene that occurred on Oct. 20 when thousands of Central American migrants forced their way across a bridge at the Guatemala-Mexico border and pushed through a fence, overwhelming Mexican riot police, who responded by firing rubber bullets and tear gas. Some in the group, according to Trump, threw rocks at the police.\n\nGarcia is traveling with his two daughters, one 13 years old and the other 14 months old. He said Trump's rhetoric has discouraged him from traveling to the United States.\n\n\n\nInstead, he said he plans to go to Mexico City, where people have promised him shelter and a job.\n\nGarcia said he used to live in the United States, and spent about 35 years in Los Angeles before he was deported when he was cited for driving under the influence.\n\nIn Guatemala, Garcia said he started a small business.\n\n\"I had a good little business and I was being extorted by criminals sent by police, corrupted police,\" he said. \"I was paying them but they kept on asking me for more and more and after that, I couldn't give them more, so they killed my wife. They shot my wife six times in the face and then they started telling me that if I wasn't going to cooperate still that my daughter was going to be next. So, when I heard about the caravan I decided we have to take off.\"\n\n\n\nHe said many of the migrants, who have been traveling since early October, have left the caravan and returned to their homes because of Trump's decision to send soldiers to the border.\n\n\"These people [migrants] think that they’re going to get over there and the soldiers are going to start shooting at them,\" Garcia said. \"That's what the government in Honduras, Guatemala, and El Salvador do.\"\n\nAnother migrant, Nelmy Ponce said she, too, has a message for Trump.\n\n\"I want to send a message to Donald Trump and ask him to soften his heart,\" Ponce told ABC News in Spanish during an interview near Isla municipality in the port city of Veracruz.\n\n\n\n\"I will want to work,\" she continued. \"Give us permission to enter the country, because we are not delinquent. We are not bad people. We come from our country because we have problems there and we cannot stay there.\"\n\n\n\nPonce, who is traveling with her teenage daughter, said they are fleeing violence in their home country of Honduras and will go \"wherever God takes us.\"\n\n\"We have problems in our country, but it's not because of us. We are not causing the problems. We are looking for a better life, especially for our kids,\" she told ABC News. \"In our country, when [our kids] go to study, they can be kidnapped or killed. We are not bad people. We just want a better life for our families.\"\n\n\n\nOn Saturday, the governor of Veracruz said buses would be sent to take the migrants to Mexico City, but then he backtracked, citing a water shortage in Mexico's capital city.\n\nAfter rallying outside the Mercado Municipal in Sayula, Ponce and other migrants set off on foot en masse Saturday.\n\n\"We want buses!\" Ponce yelled.\n\nAs Ponce began walking with her teenage daughter, she said, \"For the moment, there are no buses, no easy routes, but there is hope that this long arduous journey won't be in vain.\"\n\nABC News' Morgan Winsor contributed to this report."}