{"id": "\n\n\n\nPOLITICO\n\nErik Prince lobbies up ", "paragraph": "\n                                                            PoliticoIntelligence and analysis on lobbyingGet the POLITICO Influence NewsletterBy signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.10/24/2018 03:02 PM EDTWith Daniel LippmanERIK PRINCE LOBBIES UP: Erik Prince, the founder of the security contractor once known as Blackwater, has hired a lobbyist to help him sell his plan to privatize the Afghan war. Ron Phillips of Gavel Resources, a former House Armed Services Committee staffer, started representing Prince in September and reported lobbying Congress and the Defense Department on his behalf in a disclosure filing. In an interview, Phillips said he’s set up meetings for Prince with members of Congress and administration officials so Prince can discuss his proposal to turn much of the Afghan war over to private security contractors. “There is no ask other than he’s providing information,” Phillips said. Bill Jarrell, a former aide to former House Majority Leader Tom DeLay and a Gavel partner, is working on the effort, too.Story Continued Below— Prince has been talking up his vision for remaking the Afghan war for more than a year. “My proposal is for a sustainable footprint of 2,000 American Special Operations and support personnel, as well as a contractor force of less than 6,000 (far less than the 26,000 in country now),” Prince wrote last year in an op-ed in The New York Times. “This team would provide a support structure for the Afghans, allowing the United States’ conventional forces to return home.” He’s made his case to Afghan leaders in Kabul in recent months, and now he’s focused on winning over Washington. He already has an in with the administration. President Donald Trump has discussed the proposal with Prince’s sister, Education Secretary Betsy DeVos, according to Phillips. “Erik has got his friends and he’s got his foes, but the one thing you cannot deny is he understands unconventional warfare,” Phillips said.MORE NEW BUSINESS: Lori Otto Punke, a former in-house lobbyist for Starbucks, has registered to lobby for the coffee giant through her firm, LOP Strategies. Juul Labs retained Layth Elhassani of Covington & Burling to lobby on tariffs, after recently adding Kountoupes Denham Carr & Reid and the S-3 Group to its expanding roster of lobbyists. (Juul spent $560,000 on Washington lobbying in the third quarter, up from $210,000 in the second quarter.) Chris Cox of Morgan, Lewis & Bockius have joined eBay’s squad of outside lobbyists, which also includes half a dozen other firms. And Subject Matter picked up a quartet of new clients, including BP and Visa. Good afternoon, and welcome to PI. Marianne is on vacation this week, so I’m helming PI solo. Please share your tips, your hopes, your dreams, your fears: tmeyer@politico.com. You can also follow Marianne and me on Twitter: @theodoricmeyer and @marianne_levine.Join POLITICO Playbook Co-Authors Anna Palmer and Jake Sherman, for a special Playbook Elections event in Pennsylvania to discuss the 2018 midterm cycle and issues shaping the races. This event, part of the POLITICO-AARP Deciders series, will feature an exclusive conversation with elected officials, addressing issues that matter most to voters.FACEBOOK ON THE HILL: “With the 2018 midterm elections less than two weeks away, Facebook officials head to Capitol Hill today offering to brief all 535 congressional offices on election security,” POLITICO’s John Hendel and Nancy Scola report. “Nathaniel Gleicher, who heads cybersecurity for the social media giant, is scheduled to lead the briefings, according to the company. The sessions will focus on how Facebook is seeking to safeguard its network ahead of the midterms, with an emphasis on its battle against 'coordinated inauthentic behavior' along the lines of what Russia did in the 2016 presidential election.” Full story.IF YOU MISSED IT ON TUESDAY: POLITICO’s Nahal Toosi profiled Ali Shihabi, the Washington operative who leads the Arabia Foundation and defended Saudi Arabia in the wake of Jamal Khashoggi’s disappearance. “The global outrage over Khashoggi’s murder has forced many Washington lobbyists and public relations pros to cut ties with the Saudi government. But not Shihabi, a Saudi national who may be the country’s most effective defender in the U.S. capital. Media savvy and politically shrewd, Shihabi has relationships with prominent journalists, Trump administration officials and think tank experts throughout Washington. The Saudi ambassador left Washington earlier this month and reportedly may not return, but it matters less given that many already consider Shihabi, who is close to the Saudi leadership, to be the kingdom’s unofficial envoy.” Full story.JOBS REPORT:— CAQH, a nonprofit whose members include big health insurers, has hired Mark Pratt to lead its state and federal affairs program and April Todd to lead its CORE and Explorations programs. Pratt previously worked for America’s Health Insurance Plans. Todd previously worked for Avalere Health.— Brownstein Hyatt Farber Schreck has hired Annie Starke as a policy adviser. She previously worked for McGuireWoods Consulting.SPOTTED: At the opening of Interel’s new offices on New York Avenue on Tuesday, according to a PI tipster: Christine Lagarde of the International Monetary Fund; David O’Sullivan, the European Union’s ambassador to the U.S.; Filip Vandenbroeke of the Belgian embassy; John Graham of the American Society of Association Executives; Doug Pinkham of the Public Affairs Counsel; and Fredrik Lofthagen, Bob Lewis, Jason Jarrell and Florence Maisel of Interel.— On Monday night at on a rooftop at the Wharf to celebrate the move of John Jones, until recently chief of staff to Rep. Emanuel Cleaver (D-Mo.), to a new gig at the National Association of Real Estate Investment Trusts, according to a PI tipster: Dan Turrentine of H&R Block; Fabrice Coles of the Congressional Black Caucus; Minh Ta of Rep. Lisa Blunt Rochester (D-Del.)'s office; Karis Gutter of DuPont; Lee Slater of the House Ways and Means Committee; Jeff Carroll of the House Energy and Commerce Committee; Cachavious English of Rep. Terri Sewell (D-Ala.)'s office; Jake Perry of Jake Perry + Partners; Julius West of House Minority Leader Nancy Pelosi (D-Calif.)'s office; Todd Webster of Cornerstone Government Affairs; Mary Beth Stanton of Invariant; Mike Williams of the Williams Group; Sean Gard of Rep. Gwen Moore (D-Wis.)'s office; and Joyce Brayboy of Goldman Sachs.President Trump says a red wave is coming on Election Day. Is he right, or will the tide turn blue? Compete against the nation’s top political minds in the POLITICO Playbook Election Challenge, by correctly picking the winning candidates in some of the most competitive House, Senate and gubernatorial races in the country. Win awesome prizes and eternal bragging rights. Sign up today! Visit politico.com/playbookelectionchallenge to play.None5050 by 2020 Committee (PAC)MiamiAmeric.Org (Super PAC)OneAmerica Votes Justice for All Fund (Unknown) BGR Government Affairs: IDT CorporationBGR Government Affairs: Zayo Group, LLCBoyagian Consulting, LLC: Eiguren Ellis Public Policy on behalf of Greenbriar Capitol CorpCapitol Partners, LLC: CMC PharmaCypress Advocacy, LLC: HCBS Advocacy, LLCCypress Advocacy, LLC: Trio GroupHolly Strategies Incorporated: Brownstein Hyatt Farber Schreck, LLP (on behalf of KGL Logistics)LOP Strategies: Starbucks CorporationMascia Group LLC: Issue OneMayer Brown LLP: Medline Industries, Inc.Mrs. Caron Gala: Agricultural & Applied Economics AssociationOldaker & Willison, LLP (formerly Oldaker Law Group, LLP): Medical Card System, Inc.Rich Feuer Anderson: Institute of International BankersRoss Capon: American Association of Private Railroad Car OwnersS-3 Group: REC Americas LLC Sirona Strategies LLC: Partnership to Empower Physician-Led CareSullivan & Cromwell LLP: Bank Policy Institute (FKA The Financial Services Roundtable)West Front Strategies LLC: Skane Wilcox LLP (obo Contemporary Services Corporation) Alexander J. Beckles, L.L.C.: Stanton Park Group LLC on behalf of Healthcare Sharing Ministry Barnes & Thornburg, LLP: Ernst & Young LLPGibson, Dunn & Crutcher, LLP: Embassy of the Kingdom of Saudi ArabiaGroom Law Group, Chartered: The ESOP AssociationHolland & Hart LLP: Big Game ForeverKAR Associates, LLC: National Association of Clinical Nurse SpecialistsMichael E. Korens: Nav CanadaMorgan, Lewis & Bockius, LLP: NetChoiceNavy League of the United States: Navy League Of The United StatesPlaymaker Strategies, LLC: BIOX CorporationSamuels International Associates, Inc.: Solvay Chemicals Inc\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}