{"id": "\n\n\n\nPOLITICO\n\n\n\nFlorida\n\n'Nelson has no path': Democrats admit Scott beats Florida icon\n", "paragraph": "\n                Without favorable court rulings to expand the available ballot pool, Sen. Bill Nelson has no way to make up his 12,603-vote deficit with Gov. Rick Scott. | J. Scott Applewhite/AP Photo\n                    By MARC CAPUTO11/16/2018 09:18 PM EST\n                    Updated 11/16/2018 09:49 PM ESTSen. Bill Nelson has run out of time, run out of favorable court rulings and is about to officially run out of votes.After losing to Gov. Rick Scott on Election Day, losing after an automatic recount and appearing to not make up the gap following a manual recount Friday, Nelson’s campaign was dealt a mortal blow later that evening by U.S. District Judge Mark E. Walker, who crushed the Democrat’s last major hope by upholding a Florida law that forbids county election offices from counting vote-by-mail ballots received after 7 p.m. Election Day.Story Continued Below“It’s done. But it was done before today. This was a total Hail Mary,” said a top Democrat involved in Nelson’s campaign who didn’t want to speak publicly before the Democratic Party icon conceded defeat to one of the party's most-hated rivals. The night before, Walker had rejected yet another Nelson lawsuit concerning standards for divining voter intent in manual recounts, and he refused to extend the deadlines of the recount.Without favorable court rulings to expand the available ballot pool, Nelson has no way to make up his 12,603-vote deficit with Scott. Nelson can still appeal, but Democrats said that’s highly unlikely, considering Walker has historically appeared more sympathetic to their arguments compared to appeals courts.The counties officially have to submit their manual recount totals to the state Sunday. The election is supposed to be certified Tuesday.On Friday, Nelson gave an emotional “thank you” speech to staff earlier in the day “but it was more of a goodbye,” said yet another top Florida Democrat connected to Nelson’s re-election. A third source added that the Democratic Senatorial Campaign Committee and its mammoth recount ground force is starting to leave Florida: “DSCC is packing up and headed north” — an assertion disputed by a DSCC official who said “no one’s leaving.”While party officials refused to discuss the hopelessness of the situation on the record, the Florida Democratic Party on Friday continued to fundraise off the recount, suggesting to donors that Nelson had a shot when his own top backers knew he didn’t.Nelson, a three-term U.S. Senator, was the last Democratic statewide elected official in Florida for years. First elected to the Florida House in 1972, he served as a member of the U.S. House and as insurance commissioner before being elected to the Senate in 2000. He only lost one race: a Democratic primary for governor against party legend “Walkin’” Lawton Chiles in 1990.Scott's defeat of Nelson certifies him as a Democratic giant-killer who continues to prove party elites wrong. In three straight elections, Democratic insiders have predicted his defeat. Scott first beat Alex Sink, the woman once thought to be the future of the party, in his first gubernatorial race. Then he defeated former Gov. Charlie Crist, a once-highly popular governor. And now he has bested the one politician Democrats thought was unbeatable in a Florida general election, Nelson.Scott called on Nelson to withdraw.“Once again, the courts have denied Bill Nelson’s desperate attempt to change Florida law after the election. It’s long past time for Bill Nelson to face the facts: this charade is over, Floridians' votes have been counted multiple times, and Rick Scott is the next Senator from Florida,\" said Chris Hartline, Scott's campaign spokesperson.Like Nelson's official campaign spokespeople, the Democrat’s usually voluble recount attorney, Marc Elias, fell uncharacteristically quiet Friday after the recounts and before Walker’s ruling. Elias this week has held daily conference calls with reporters and — contrary to the assertions of experts who spoke to POLITICO — had insisted throughout that Nelson had a shot. But Elias acknowledged Thursday evening it would take more than “one silver bullet ...[to] ... change the margin in this race.”During that call, Elias said Nelson was relying on a court ruling to potentially count absentee and provisional ballots that had been rejected because the voter’s signature did not match the signature on file. The state estimated Friday that 5,686 such ballots existed. But even if all somehow voted for Nelson, he still would come up short against Scott.Elias also hoped that the manual recounts, which wrapped up Friday, would produce new loads of votes for Nelson — especially in Broward County, where he estimated 23,000 votes in the Democratic-rich area might not have been properly read by machines in the precincts on Election Day. In pushing this narrative, Elias specifically tried to bat down experts who said that the county’s bad ballot design — the Senate race was tucked in the lower left-hand corner beneath the instructions — caused many voters to not see the race and therefore not vote in it.But after the recount Friday in Broward, observers in the room said there was no batch of hidden votes. People just undervoted the race by disproportionate margins compared to the 66 other counties.“The votes weren’t there. It was bad ballot design,” said Democratic data analyst Matt Isbell, who first raised the issue of the undervotes after Election Night. “Nelson has no path.”Late Friday, the Scott campaign reported that Nelson netted fewer than 300 votes in Broward County after the recount. The campaign obtained the numbers through a public records request. The third “silver bullet” Elias was hoping for concerned the mail-in ballots that were not received at county offices before 7 p.m. Election Day. The estimated number of these ballots is unclear, but likely totaled in the thousands.Elias had said the ballot-receipt rule was unfair because overseas absentee ballots that were postmarked before Election Day could continue to be counted through Friday, Nov. 16.But Judge Walker said the rule just helps soldiers and other U.S. citizens who are disadvantaged by the mail system since they’re overseas, and that this effort to give them a little help does not disadvantage domestic absentee-ballot voters.Walker also noted that the challenge of a longstanding law by Nelson came too late in the process, and that the state at a certain point has the right to fix the deadlines it wants to make sure elections are orderly.“The fact that there might be problems with the mail does not outweigh the state’s important interest in delineating finality in elections. To hold otherwise could call into question the entirety of the vote-by-mail system itself,” Walker said. “The restriction is reasonable, and the state’s regulatory interest is sufficient to justify the deadline.”And though other states allow absentee ballots to be received after Election Day as long as they’re postmarked by Election Day, the judge said that has no bearing on Florida.“A later or more lenient deadline in other states may not a constitutional violation make,” he ruled.A weekly, must-read brief on health care news and moves in Tallahassee and around the stateA morning email with must-read analysis and breaking news on Florida politics and policy.A weekly must-read on budget politics for Florida Pros, with exclusive reporting and analysis, interviews and more. POLITICO Florida Pro's high-level outlook on the policy issues driving the month in Florida.Matt Dixon and Marc Caputo's must-read briefing on what's hot, crazy or shady about politics in the Sunshine State\n                        POLITICO ProA morning email with must-read analysis and breaking news on Florida politics and policy.\n                        POLITICO ProA weekly, must-read brief on health care news and moves in Tallahassee and around the state.\n                        POLITICO ProOur weekly digest of college and university news in the Sunshine State.\n                        POLITICO ProA weekly must-read on budget politics for Florida Pros, with exclusive reporting and analysis, interviews and more. \n                        POLITICO PROPOLITICO Florida Pro's high-level outlook no the policy issues driving the month in Florida.\n                        POLITICO ProOriginal federal and state policy documents © 2018 POLITICO LLC"}