{"id": "  POLITICO Magazine\nIs Saudi Arabia Helping Trump in the Midterms?\n", "paragraph": "The Friday Cover is POLITICO Magazine's email of the week's best, delivered to your inbox every Friday morning.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n                AFP/Getty Images\nWashington And The World\n                        An overlooked factor in the president’s calculations over Jamal Khashoggi: the price of oil.\n                    By JIM KRANE and BILL ARNOLDOctober 24, 2018The three-way test of wills over Saudi Arabia’s murder of an exiled journalist has started to play out in oil markets.Each day, Turkish President Recep Tayyip Erdogan maintains his drip feed of grisly details of Jamal Khashoggi’s killing in the Saudi Consulate in Istanbul. Each day, a reluctant President Donald Trump is forced to respond to a new revelation. The affair has betrayed a yet unseen presidential aptitude for restraint.Story Continued BelowMeanwhile, the Saudis’ initially combative tone has been quietly replaced with a more deferential stance. They have opened the valves on their idled oil production, exactly as Trump has demanded in his tweets. Saudi oil minister Khalid al-Falih has talked down oil prices with unusually forthright public statements, saying the kingdom will make sure global demand is met, no matter what.For Trump and his embattled Republican allies in the U.S. midterm elections, the change in Saudi behavior is welcome. And as long as Trump soft-pedals the Khashoggi affair, it seems the Saudis are willing to cooperate with the American president’s oil market wishes.A few weeks ago, there were rumors that Trump was pondering an election-timed release from the U.S. Strategic Petroleum Reserve. Now, with the Saudis on board, U.S. gasoline prices—the third rail of domestic politics—should remain low at election time.If Trump’s measured responses are incentivizing Saudi production increases, the president’s policies are working. The international oil price is down about $9, from $85 just after Khashoggi’s murder to $76 on Tuesday.Prior to the Khashoggi murder, Saudi Arabia had been slow-walking promised production increases despite strong evidence that Trump’s sanctions on Iran were strangling oil markets. Saudi oil output rose by just 300,000 barrels per day between June and October, while Iran’s oil exports fell by about triple that amount, around 1 million barrels per day.Had the Saudis continued to drag their feet, prices might have neared the iconic $100 mark just in time for the U.S. election—handing Democrats a convenient talking point. Trump’s unilateral removal from world markets of 1.5 million barrels per day of Iranian oil would have looked masochistic, given that his sanctions deadline is just two days ahead of the Nov. 6 elections.But global outrage over the Saudi critic’s murder has put the kingdom on the back foot. Allies and detractors alike, including normally friendly Republicans in the U.S. Senate, are baying for sanctions and an arms embargo.While Saudi political leaders produced fumbling explanations for the murder, the oil minister stepped forward to change the narrative. Al-Falih promised another 300,000 barrel-per-day increase “soon” and said the kingdom still had another 1 million barrels of spare capacity it could call upon. If that weren’t enough, Saudi Arabia would consider investing in further capacity increases, he said. “We will meet any demand that materializes,” Al-Falih said Tuesday. The comments calmed skittish markets, revealing that the oil minister, at least, is one Saudi official who retains credibility.Is the kingdom rewarding Trump’s softly-softly approach? It’s hard to be sure. But the timing makes it look like the Saudis are banking that the president needs low gasoline prices more than he needs Riyadh in the penalty box.The wild card is Erdogan. What depredations will emerge in the Turkish president’s next release? Will he finally release the alleged recordings of the gory murder and dismemberment in Istanbul?Should that happen, Trump’s resolve could crumble. A forceful presidential response could revive Saudi threats to take “bigger measures” (read: oil) if the kingdom’s leadership were censured.Although Al-Falih has stated that the kingdom has no intention of revisiting the the hardball tactics that brought us the Arab oil embargo of 1973, other Saudi policymakers have broached the possibility.“If President Trump was angered by $80 oil, nobody should rule out the price jumping to $100 and $200 a barrel or maybe double that figure,” wrote Turki al-Dakhil, an ally of the Saudi royal court and director of the Saudi-owned Al Arabiya news network.These were undoubtedly scare tactics. But coming from Saudi Arabia, scare tactics can put a scare into oil markets. Prices get notoriously jumpy when Saudi Arabia sheds predictability.And if prices get jumpy, Trump’s Iran embargo would quickly be undermined by a sheaf of sanctions waivers, starting with Turkey and India, and then extending to others.Pretty soon, the embargo starts to look like Obama’s, where import waivers were handed out because OPEC didn’t have the spare capacity to cover the loss of Iran’s exports.Trump has a weak hand. He knows that the Saudis’ influence over U.S. gasoline prices gives them leverage in U.S. elections. Until the voting is done, bet on this: The president will find it hard to get tough on his Saudi friends.Jim Krane (@jimkrane) is a fellow for energy and geopolitics at Rice University’s Baker Institute for Public Policy.Bill Arnold (LinkedIn) is a professor in the practice of energy management at Rice’s Jones Graduate School of Business.Swamp Diary \n\n                        By Jack Shafer\nThe Friday Cover\n\n                        By Keith Kloor\nPolitics\n\n                        By Derek Robertson\n\n © 2018 POLITICO LLC"}