{"id": "\n\n\n\nPOLITICO\n\n\nCummings urges reluctant Dems to back Pelosi for speaker if she wins caucus vote\n", "paragraph": "\n                Rep. Elijah Cummings argued that picking House Minority Leader Nancy Pelosi to become speaker would prevent a divisive campaign that could shatter Democratic unity. | Chip Somodevilla/Getty Images\nCongress\n                    By KYLE CHENEY11/12/2018 05:13 PM EST\n                    Updated 11/12/2018 07:38 PM ESTRep. Elijah Cummings (D-Md.), an influential House Democrat, pleaded Monday with colleagues and incoming House freshmen to reject the efforts of a \"small group\" of Democrats he said is \"trying to generate opposition\" to Nancy Pelosi's bid for the speakership.\"For two years, they asserted that with Nancy Pelosi as our leader, Democrats could never win back the House. They claimed that these relentless Republican attacks made Leader Pelosi appear too divisive, and they argued that she should step aside for the good of the party,\" Cummings wrote in a \"Dear Colleague\" letter to the incoming class of Democrats. \"But then last Tuesday happened. And the American people obliterated the theory that Nancy Pelosi could not lead House Democrats to victory.\"Story Continued BelowCummings, a Maryland Democrat who has represented a Baltimore district since the 1996 elections, offered a preview of how Pelosi's allies will attempt to counter arguments that she's overstayed her welcome as Democratic leader — she's led the party in the House for 16 years — and has become a divisive figure that has jeopardized Democratic gains in swing House districts. A slew of Democratic victors in last week's elections vowed to oppose Pelosi in a House floor vote, imperiling her bid for a second stint as speaker. But no alternative candidate has emerged yet, and Pelosi's allies are beginning to mount a forceful campaign suggesting that Pelosi's leadership and experience is necessary to guide the new Democratic majority.\nCongress \n                    By RACHAEL BADECummings suggested that lawmakers who have vowed to oppose Pelosi should feel free to vote their conscience during a closed-door vote of the Democratic caucus, where a majority of votes will carry the day. But once the battle moves to the House floor, Cummings said, all Democrats should unite behind the winner -- and if it's Pelosi, give her a resounding vote of support to blunt opposition by President Donald Trump and congressional Republicans. \"After we as Democrats make our selection, our new members should not be pressured into voting against our party’s nominee on the House floor in January—when the choice will be between the Democratic candidate and the Republican candidate,\" Cummings wrote.\nCummings, who is expected to become the chairman of the House Oversight Committee, has tangled with Republicans for years over some of Congress' highest-profile investigations and is expected to play a central role in a wave of investigations of the Trump administration next year. Though his support of Pelosi was expected, his arguments against the tactics of a band of Pelosi detractors are a window into how Pelosi will attempt to overcome some of the arguments offered by critics within the Democratic Party.Cummings noted that Democrats' most potent issue in the 2018 campaign was health care, an issue he said Pelosi is more closely identified with than any other elected Democrats. \"There would not be an Affordable Care Act without her, and no one has battled more effectively to defend it,\" he argued. But most of all, Cummings argued that picking Pelosi would prevent a brutal and divisive campaign that could shatter Democratic unity before the new Congress even gets underway.\"Our new members promised their constituents to bring stability and common-sense to a dysfunctional Washington—not to be drawn into an effort to throw the House into chaos,\" he added. \"Our new members promised to get results on the issues their constituents care about—not to delay these efforts while they are dragged into a self-destructive leadership battle.\"Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}