{"id": "\n\n\n\nPOLITICO\n\n\nPapadopoulos seeks to delay prison time\n", "paragraph": "\n                George Papadopoulos, the 31-year-old former campaign adviser to President Donald Trump, cut a deal with Mueller’s office and pleaded guilty to the false statement charge.  | Mandel Ngan/AFP/Getty Images \nLegal \n                        The former Trump campaign adviser cited a separate case challenging Robert Mueller's legal authority.\n                    By JOSH GERSTEIN11/16/2018 05:10 PM ESTFormer Trump campaign foreign policy adviser George Papadopoulos is asking to delay a looming prison stint by citing an appeal that challenges the legality of Special Counsel Robert Mueller’s appointment. Papadopoulos elected not to mount such a challenge in his own case last year when Mueller’s office charged him with making false statements and obstruction of justice resulting from Mueller’s probe into alleged 2016 Russian election meddling.Story Continued BelowThe 31-year-old former campaign adviser instead cut a deal with Mueller’s office and pleaded guilty to the false statement charge. In September, U.S. District Court Judge Randy Moss sentenced him to 14 days in prison.In the weeks since his sentencing, however, Papadopoulos has dramatically shifted his posture towards prosecutors — distancing himself from his previous defense lawyers and leveling public claims that federal prosecutors railroaded him and denied him access to key evidence. “Biggest regret? Pleading guilty,” he wrote in a Nov. 9 tweet that has since been deleted.The race for 2020 starts now. Stay in the know. Follow our presidential election coverage.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.“I have killer lawyers now, actively trying to get out of this, but it’s much more complicated than I thought,” he added soon after.Papadopoulos’ new attorneys did not raise any new factual allegations Friday as they asked Moss to delay their client’s duty to report to jail on Nov. 26. They argued instead that an appeal in another case — filed by a grand jury witness resisting a Mueller subpoena — raised serious issues about the special counsel’s legitimacy and should be resolved before Papadopoulos is required to begin serving his sentence.“In light of the advanced stage of the appeal…Mr. Papadopoulos faces the prospect of unnecessarily serving a sentence of incarceration for a conviction that may in the near future be reversed,” his new lawyers, at the firm of Pierce Bainbridge, wrote. “Absent a stay of the execution of his sentence, the hardship and unfairness to Mr. Papadopoulos is palpable: he risks unnecessarily serving a sentence of incarceration that was unconstitutionally obtained,” they added.Papadopoulos’ approach towards Mueller’s office grew even more combative after he testified behind closed doors last month to lawmakers from the House Judiciary and Oversight committees. While Papadopoulos has recently said he might seek to withdraw his guilty plea on grounds of some type of misconduct by prosecutors or investigators, the Friday motion appears to rule out such a move.“If the appeal is unsuccessful, he will undoubtedly serve his sentence,” the defense lawyers wrote.\nMUELLER INVESTIGATION\n                    By DARREN SAMUELSOHNA spokesman for Mueller’s office, Peter Carr, declined to comment on whether prosecutors will resist the move.The exact date that Papadopoulos was scheduled to begin serving his sentence had not been publicly revealed before the defense motion was filed Friday. However, details about the defendant recently began appearing in the federal Bureau of Prisons’ public database, suggesting that his reporting date was imminent. It’s also unclear exactly how long Papadopoulos would have to serve or where. A 14-day sentence is too short for a prisoner to receive so-called “good time” credit, but he may be entitled to shave a day or two off his sentence because of a brief stay in FBI custody and at an Alexandria, Va. jail soon after he was arrested last year.In what may have been a prelude to Friday’s motions, Papadopoulos’ original lawyers, Tom Breen and Robert Stanley, formally asked to withdraw from the case on Tuesday and were officially discharged by Moss late that day. They said following Papadopoulos’ sentencing hearing that they were unaware of any evidence of government misconduct in the case, or that their client had ever been the target of a Foreign Intelligence Surveillance Act warrant.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}