{"id": "\n\n\n\nPOLITICO\n\n\nDonald Trump learns to love his haters\n", "paragraph": "\n                After the “Access Hollywood” tape leaked, Republican Sen. Dean Heller famously said he was “100 percent against Clinton, 99 percent against Trump.” | Carolyn Kaster/AP Photo\nWhite House\n                        Just as his onetime naysayers have come around to the president, so too has Trump embraced establishment pols he once spurned.\n                    By CHRISTOPHER CADELAGO10/20/2018 05:06 PM EDTELKO, Nev. — Not that long ago, it wasn't hard to imagine moderate Sen. Dean Heller (R-Nev.) breaking with President Donald Trump in his reelection campaign, given Nevada's swing-state status and Heller's refusal before the 2016 election to say whether he'd vote for Trump.But on Saturday, the two were acting like old pals. Standing onstage in this small rural city in the far reaches of Northern Nevada, Heller basked in the glow of the president, who trekked cross-country to stump for his onetime skeptic.Story Continued BelowThe president praised the senator for his collaboration on tax reform and veterans issues. Heller declared the president’s first two years a triumph: “Welcome to Trump country!” he beamed, turning to Trump. “Mr. President, you know a little bit about gold. In fact, I think everything you touch turns to gold.”Trump has nursed some legendary grudges. But his union of obligation with Heller, coming after their turbulent start, underscores what his advisers describe as the president’s increasing comfort with bending to political imperatives the longer he's in the White House. And it provides insight into his evolution from anti-establishment interloper to party leader whose fortunes are now closely linked with Republicans.On his swing though Nevada, Arizona and Montana this week, Trump touted his alliances with former rivals, brandishing his capacity for political absolution like a United Nations peacekeeper might carry the blue helmet. “You know, you go to wars together and then, if you’re smart, and if they’re smart, you get along,” Trump said Thursday at his stop in Missoula, Mont. He went on to say he has \"great relationships\" with his 2016 rivals. “Ted Cruz has become a friend of mine. He’s doing great. And Marco Rubio, Chris Christie, Mike Huckabee,” he said, adding to the list of former adversaries. Left unmentioned were Trump’s earlier spats with Sen. Lindsey Graham (R-S.C.), whose cellphone number he shared with the world, and Sen. Rand Paul (R-Ky.), whom, during an early presidential debate, Trump suggested was ugly. Now, the two senators are golf buddies and among Trump's closest friends in the Senate.\nElections\n                    By MARY LEEOn Monday, Trump will rally at an 18,000-seat arena in Houston for Cruz, who is facing a stiff challenge from Rep. Beto O’Rourke, the Democratic darling and national fundraising juggernaut. On Wednesday, the president will be in Mosinee, Wis., to rally for Gov. Scott Walker, another 2016 foe whose state is key to Trump's reelection hopes.“If you look at Trump and his history — he’s always willing to make nice with people who will make nice with him,” a former White House official said.Trump doesn’t need to have a deep personal connection to appreciate someone’s value. In some cases, he prefers a comfortable but arm's-length pact based on mutual respect and utility, according to more than a half-dozen White House aides and outside presidential advisers. This year, Republicans’ efforts to maintain Senate control have been made easier by Trump’s tendency to let bygones be bygones. Martha McSally, a GOP congresswoman running to succeed Trump detractor Sen. Jeff Flake (R-Ariz.), declined to endorse Trump in 2016.But Trump resisted wading into McSally’s primary against hard-line conservatives Kelli Ward and Joe Arpaio, the ex-Maricopa County sheriff whom the president pardoned last year for criminal contempt of court. On Friday, Trump headlined a Scottsdale fundraiser benefiting a joint committee of McSally, the National Republican Senatorial Committee and the Arizona Republican Party that raised more than $700,000, said a person familiar with the event. Later, Trump sang the praises of McSally, a former pilot who was stationed in the Middle East, while they toured Luke Air Force Base and again at his midterm rally at a hangar in Mesa.“Martha’s a veteran, a great veteran, a great fighter, a warrior,” Trump said, contrasting her background with her Democratic rival's. “While Martha was bravely fighting the Taliban, Kyrsten Sinema said she had no problem with Americans defecting from our country to join the Taliban.”\nWhite House\n                    By CHRISTOPHER CADELAGO and BRENT D. GRIFFITHSTrump's evolution with Cruz is especially striking. In 2016, Trump suggested that Cruz's father was involved in JFK's assassination and seemed to imply that the senator's wife was ugly. Cruz returned the favor by announcing onstage at the Republican National Convention that Republicans should \"vote your conscience.\"Government aides to Trump and Cruz now communicate regularly, and the president and senator have spoken directly on everything from funding for hurricane disaster relief to trade policy to Trump’s Supreme Court nominations, according to a senior Republican official with insight into the connection. Along the way came little breakthroughs.In the midst of the health care fight last year, Cruz saw the opportunity to debate Sen. Bernie Sanders live on CNN as a way to highlight what Republicans view as Sanders’ outside-the-mainstream support for \"Medicare for all,\" as well as to show that he could be a team player by helping advance the GOP and Trump agendas. Trump was pleased enough with the performance he reached out to Cruz to tell him he did a good job. (One aide familiar with the exchange noted the president did not explicitly say he tuned in to CNN, his favorite media punching bag.)Among Trump’s political relationships, his pact with Heller is most indicative of his approach. The senator holds a slight lead over Democratic Rep. Jacky Rosen in recent public polls.“The president is well aware of the challenging political nature of Nevada, and he appreciates that Sen. Heller has done a really good job in the U.S. Senate,” Bill Stepien, the White House political director, said in an interview. “It’s not an easy place to get elected. It’s not an easy place to get reelected.”The lone Senate Republican fighting to hold a state carried by Hillary Clinton in 2016, Heller that year wouldn’t say who he was voting for. After the “Access Hollywood” tape leaked, the senator famously said he was “100 percent against Clinton, 99 percent against Trump.”\nWhite House \n                    By ANDREW RESTUCCIA and BEN SCHRECKINGEREarly in the Trump presidency, one Republican strategist here recalled the anger directed at the senator in conversations with local activists around the state. If Heller remained on that path, “it would have been curtains,” said Bob List, a former Nevada governor.Heller stood alongside Republican Gov. Brian Sandoval in announcing his opposition to Obamacare repeal legislation. In July 2017, Trump jokingly threatened Heller by noting “he wants to remain a senator” in reference to whether Heller would vote for the Republican plan.But in private sessions concerning alternative health care legislation proposed by Graham and Sen. Bill Cassidy (R-La.), Trump and Heller got to know each other better, aides said. Their work grew more serious when Heller was in the thick of helping write and pass the tax overhaul as part of the Finance Committee. While the tax bill gave Trump and Heller something to tout, the aides said it was more narrowly focused bills — many on veterans issues — that cemented the association. Finally, last fall, Heller said in a statement to The Nevada Independent that he did end up voting for Trump. “I think he sensed that people appreciate the administration, and he knows he’s on the right side when he’s in line with the president,” List said.Nevada Democrats have sought to exploit the old tensions. Sarah Abel, press secretary for the state party, said Heller’s “total 180 flip-flop on Donald Trump is the perfect example of how he's a self-serving career politician who will say anything if he thinks it helps him politically.”Trump, for his part, acknowledges the rocky start he and Heller had. In June, he said they went from “shaky” to “rock solid.” At his Las Vegas rally with Heller in September, Trump spoke about the transition from disliking to respecting and then liking each other. “Then,\" Trump added, \"we started to love each other.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}