{"id": "\n\n\n\nPOLITICO\n\n\nWarner: Trump, social media must do more to secure elections\n", "paragraph": "\n                Sen. Mark Warner and other senators are pushing legislation intended to improve the transparency of online political ads. | J. Scott Applewhite/AP Photo\nElections\n                    By DAVID BEAVERS11/04/2018 01:03 PM ESTThe vice chairman of the Senate Intelligence Committee on Sunday said the Department of Homeland Security has been doing a \"very good job\" working with election registrars to secure Tuesday’s midterm elections, but more could be done. “I think we are much better,” said Sen. Mark Warner (D-Va.) on CBS' \"Face the Nation.\" \"DHS has been doing a very good job in terms of working with individual election registrars. ... There is a good cooperative relationship.”Story Continued Below\"We've made great progress, particularly at the individual polling stations and in the tabulation of votes,\" he explained. \"So, I think people should go out and vote with confidence.\" But Warner also expressed concern that the White House hasn't done more to counter foreign influence in elections following Russia’s interference in the 2016 presidential campaign.“It would have been better if, in the aftermath of 2016, this White House, after that kind of attack, would have actually appointed someone in charge of election security,” Warner said. “Unfortunately, Mr. Trump has not done that. Matter of fact, he even eliminated the position of cybersecurity at the White House, which I think is a totally wrong move.”Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.The Trump administration in May eliminated the White House’s top cyber policy role, a position created during the Obama administration to harmonize the federal government's approach with cybersecurity policy and digital warfare.The senator also accused social media companies of failing to act sufficiently to prevent the proliferation of fake accounts intended to influence the elections. Warner and other senators are pushing legislation intended to improve the transparency of online political ads.“What I’m more concerned about is a flood of fake accounts or fake manipulation through social media where, again, we’ve made some progress,\" Warner said. \"But the companies have not moved as far as they need to move.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}