{"id": "\n\n\n\nPOLITICO\n\n\nZinke attorney lashes back amid reports of Justice referral\n", "paragraph": "\n                Interior Secretary Ryan Zinke has been the subject of multiple inspector general investigations for most of his tenure at the department. | Chip Somodevilla/Getty Images\nEnergy & Environment\n                        A referral to the Justice Department would be a serious escalation of the reviews of multiple allegations of ethical lapses by Zinke.\n                    By BEN LEFEBVRE and ERIC WOLFF10/30/2018 06:55 PM EDTInterior Secretary Ryan Zinke has not been contacted by the Justice Department, a lawyer for the secretary said today amid reports that Interior's internal watchdog had sent criminal referrals related to its investigations into his conduct in President Donald Trump’s Cabinet.The statement came after the Washington Post and CNN cited anonymous sources who said Interior's Office of Inspector General had referred investigations to DOJ. Interior's IG has been conducting several probes into Zinke since last year including one involving a Montana land deal — first reported by POLITICO — tied to the secretary and the chairman of the major oil services company Halliburton.Story Continued BelowNews of the referral comes two weeks after a botched announcement that a Trump administration political appointee would be brought in to lead the Interior inspector general’s office.“The Secretary has not been contacted or notified of any DOJ investigation or Inspector General referral,” said Stephen Ryan, a partner at McDermott Will and Emery acting as counsel to Zinke. “It is disappointing that unsubstantiated and anonymous sources have described an IG office referral to members of the media, as this violates DOJ and IG policy direction. The Secretary has done nothing wrong.\"A referral from the Interior IG to DOJ would be a serious escalation of the reviews of multiple allegations of ethical lapses by Zinke.The source for energy and environment news — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.One of the IG probes is examining Zinke's ties to a real estate project in his hometown backed by Halliburton Chairman David Lesar, whose company stands to benefit from Interior’s decisions on oil production. Another is investigation, looking into whether Zinke bowed to political pressure in blocking requests from Native American tribes to open a Connecticut casino, was requested in response to POLITICO's report on lobbying by the tribes' business rivals.It was not immediately clear which of the multiple investigations underway at the Interior IG had been referred to DOJ. The IG's office is also looking into Zinke's role last year in shrinking Grand Staircase–Escalante National Monument, a 1.9-million-acre stretch of land in Utah that President Bill Clinton declared off limits to drilling and mining in 1996.Democrats on the House Natural Resources Committee said referring the case to Justice would provide them more ammunition for oversight hearings they plan to hold if their party takes the House in next week’s elections. “If Democrats are given the opportunity to hold a congressional majority next year, Secretary Zinke will be called to testify in February on why his conduct in office merited referral to the Justice Department, whether that referral was related to the recent attempted firing of his inspector general, and his many other failures and scandals,” ranking member Raúl Grijalva (D-Ariz.) said in a statement to POLITICO. “He has abused the people’s trust and lost any presumption of innocence or good faith.”A spokeswoman for the IG's office said she could not confirm or deny any potential referral. A DOJ spokesman said the department generally does not confirm or deny investigations. Spokespeople for Interior did not immediately return calls for comment. \nEnergy & Environment\n                    By BEN LEFEBVRE, ANTHONY ADRAGNA and ZACK COLMANGovernment ethics experts said a referral wouldn’t bode well for Zinke.“What I can say is, Inspectors general don’t tend to refer matters to the Department of Justice unless they think that it’s likely there’s been a criminal violation,” said Walter Shaub, a former Office of Government Ethics Director in the Trump administration who is now a senior adviser at Citizens for Responsibility and Ethics in Washington. “There are some missing puzzle pieces here, but the fact that the IG referred it suggests to me they feel they have those puzzle pieces.”Zinke's position as Interior secretary puts him in a position to make or change rules that could benefit Halliburton and other companies in the oil industry. That raises red flags in light of Lesar's involvement in the Whitefish, Mont., real estate development that Zinke discussed with the developers last year. A nonprofit foundation now run by Zinke's wife, Lola, agreed to let a Lesar-backed development group build a parking lot on foundation land, and the project will likely increase the value of other nearby properties the family owns. The project also includes plans for a microbrewery that city officials had said they expected to go to Zinke, who has spent years lobbying the city to allow him to build a brewery in the neighborhood. The secretary has denied that he or his wife are involved in building the microbrewery. The IG probe into Zinke's role in the casino project stems from Interior's decision in September 2017 to not approve plans from the Mashantucket Pequot and Mohegan tribes to jointly open a casino in Connecticut. Interior's decision followed intense lobbying from Nevada Republican lawmakers and Las Vegas-based MGM Resorts International, which this year opened a competing property 12 miles away from the tribes' proposed locations. A federal judge recently agreed to dismiss a lawsuit from the Mashantucket tribe challenging the decision, but the tribe this month asked the judge to revive the suit, alleging that Zinke illegally bowed to political pressure. \nWhite House\n                    By NANCY COOKZinke has been the subject of multiple IG investigations for most of his tenure at Interior. The office earlier this month released a report faulting Zinke for trying to skirt or alter department policies to justify his taxpayer-funded trips with his wife. Among the actions the IG flagged was Zinke’s pressuring Interior staff to look into possibly designating his wife as a volunteer at the agency, a move Interior employees said would have enabled her to travel with him at taxpayer expense. Interior’s IG office faced confusion earlier this month over who was in charge after reports that the administration planned to replace Mary Kendall, Interior’s deputy inspector general who has led the office since 2009. A leaked Oct. 12 email from Housing and Urban Development Secretary Ben Carson said HUD Assistant Secretary Suzanne Tufts would lead Interior’s IG office. Critics charged that placing a political appointee to lead the IG’s office was meant to disrupt investigations into Zinke. HUD ultimately said Tuffts had resigned, but the incident sparked a round of finger-pointing between HUD, Interior and White House as to who initiated the move. The move to place Tufts as head Interior watchdog could point to Zinke’s wanting a politically friendly person in the office as the investigations into him took a more serious turn, Chris Saeger, executive director of conservation group Western Values Project, said in a prepared statement. “The mere possibility that an Interior Secretary’s behavior could result in a federal criminal investigation is deeply disturbing,” Saeger said in a statement. “One thing is clear: no one is above the law and Secretary Zinke needs to be held accountable for any wrongdoing or misconduct.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}