{"id": "\n\n\n\nPOLITICO\n\n\nLawyers who vetted Trump executive orders get award\n", "paragraph": "Josh Gerstein on the Courts, Transparency, & MoreGet alerts from Under the Radar blogBy signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n                President Donald Trump signs one of the early versions of his travel ban executive order on Jan. 27, 2017 in Arlington, VA. | Olivier Douliery-Pool/Getty Images\n                    By JOSH GERSTEIN10/24/2018 07:57 PM EDTJustice Department attorneys who pored over a slew of controversial executive orders considered and later issued by President Donald Trump received a prestigious award from their agency Wednesday.At an annual DOJ award ceremony held at DAR Constitution Hall, six attorneys from the Office of Legal Counsel were saluted with an Attorney General's Distinguished Service Award for \"sustained and excellent work in reviewing Executive Orders, other substantial Presidential directives, and Attorney General Orders for form and legality,\" Assistant Attorney General for Administration Lee Lofthus said.Lofthus didn't say precisely which orders gave the team \"sustained\" work but Trump issued 55 formal Executive Orders during his first year in office, including several versions of the hotly disputed travel ban order that was eventually upheld in its heavily-modified form by the Supreme Court.Honored with the award were OLC Special Counsel Rosemary Hart and Attorney-Advisers Matthew Guarnieri, Laura Heim, Kelley Brooke Hostetler, Erica Newland and Leif Overvold. Four of the attorneys joined Deputy Attorney General Rod Rosenstein on stage to accept the award. Lofthus noted, without elaboration, that Hostetler and Newland were not present.\nMedia \n                    By JASON SCHWARTZ and MICHAEL CALDERONEAlso honored for \"exceptional service\" Tuesday was a lawyer who has been at the tip of the spear defending Trump's immigration policies, Civil Division Special Counsel August Flentje. The career DOJ attorney argued for Trump's first travel ban order at the 9th Circuit last year and has overseen litigation the Trump Administration brought against the State of California over laws seen as thwarting federal authority on immigration.Five lawyers, including one who worked for a time on the team of special counsel Robert Mueller, got a John Marshall Award for their success in seizing nearly $75 million in assets related to Megaupload, an online operation that became a clearinghouse for pirated movies, music, TV programs and software. Operators of the sites, including flamboyant Megaupload founder Kim Dotcom, insisted they were not knowingly involved in the piracy. Dotcom and three other defendants have been fighting extradition from New Zealand for years.The Marshall award went to Jay Prabhu and Karen Ledbetter Taylor in the U.S. Attorney's Office in Alexandria, Virginia, Ryan Dickey and Brian Levine of the Computer Crime Section of DOJ's Criminal Division and Allison Ickovic in the Division's Money Laundering section. (Dickey did a long stint handling cyber-related issues on Mueller's team before moving on to other assignment's earlier this year.)The loudest and most protracted applause of the afternoon was reserved for Marshals Service Inspector Basilio Perez Jr., who was attending a country music festival in Las Vegas last year when a man armed with a high powered rifle began firing on the crowd from a nearby hotel. Perez, a Navy veteran, helped evacuate fellow attendees and gave \"lifesaving assistance\" to several of those who had been hit by bullets.Attorney General Jeff Sessions was supposed to speak at the event but was delayed at a White House event. He arrived after the speaking program concluded but joined a reception for the awardees. © 2018 POLITICO LLC"}