{"id": "\n\n\n\nPOLITICO\n\n\nTillis: Trump ‘is right’ to put troops on the Southern border\n", "paragraph": "\n                “The president is right that we have to secure the border,\" said Sen. Thom Tillis (R-N.C.). | Alex Brandon/AP Photo\nImmigration\n                    By DAVID BEAVERS11/04/2018 10:23 AM ESTSen. Thom Tillis on Sunday expressed support for President Donald Trump’s move to put more troops on the U.S.-Mexico border in response to an approaching caravan of Central-American migrants seeking asylum.Appearing on “Fox News Sunday,” the North Carolina Republican said, “I believe that the president is right and doing everything he can to stop the illegal process.”Story Continued Below“The president is right that we have to secure the border, and I think that putting troops down there to make it very clear that we want people who have a legitimate claim to asylum to come through the process and get that asylum granted,” said Tillis, the vice chairman of the National Republican Senatorial Committee.The Trump administration began sending as many as 15,000 troops to the southern border to meet a caravan of Central American asylum seekers heading toward the U.S. through Mexico.The president sparked controversy when he said the U.S. military should treat any rocks or stones thrown by migrants as firearms. Later, he later walked back the comment, declaring that any lawbreakers would be arrested.Sen. Chris Van Hollen (D-Md.) on Sunday slammed Trump for his initial comment.Appearing on the same Fox show, the chairman of the Democratic Senatorial Campaign Committee said: “It was pretty ridiculous for the president to suggest the other day that the United States military would fire on unarmed people, and the military had to tell the president ‘That’s not what we do. That’s not what the United States military does.’”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}