{"id": "\n\n\n\nPOLITICO\n\n\nPompeo was ‘snubbed’ by Beijing. Now it wants to show ‘a friendlier China’\n", "paragraph": "\n                Secretary of State Mike Pompeo speaks with State Councillor Yang Jiechi during a meeting in Beijing, China on Oct. 8. | Daisuke Suzuki /Pool/Getty Images\nSouth China Morning Post\n                    By MINNIE CHAN | SOUTH CHINA MORNING POST10/24/2018 06:57 PM EDTThis story is being published by POLITICO as part of a content partnership with the South China Morning Post. It originally appeared on scmp.com on Oct. 25, 2018.The U.S. secretary of state was given frosty treatment when he visited Beijing on Oct. 8 — part of an Asia tour that also included Japan and the two Koreas — when Chinese officials were openly blunt and accused the U.S. of escalating the trade war, the person said.Story Continued Below“Pompeo hoped to meet President Xi Jinping, but he was rejected. Then he had a meeting with Foreign Minister Wang Yi that lasted less than an hour, and Wang spent nearly the whole meeting chiding the Trump administration for ‘ceaselessly escalating’ trade tensions,” the person said.“Wang and his team didn’t even take Pompeo for a meal after the meeting … it was very disrespectful —China is known as a country that respects etiquette and ceremony,” the person said.“Some of the Chinese defense officials and others didn’t agree with the way Wang handled the visit and they are hoping the Xiangshan Forum will be a chance to show their foreign counterparts a friendlier China,” the person said.In remarks made in front of the media when the pair met, Wang said the US had been increasing trade frictions with China and attacking the mutual trust between the two nations. The atmosphere reflected the deteriorating relations between the two sides — in addition to trade, they are also locking horns over security and the South China Sea, with Beijing accusing Washington of sending military aircraft and vessels to the disputed waters.Sign up for Morning Defense, a daily briefing on Washington's national security apparatus.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Defense Minister Wei Fenghe is expected to talk about China’s “peaceful political stance” in the region during a speech at the forum on Thursday, as Beijing seeks to reassure Washington and its Southeast Asian neighbors that it will not become a threat.More than 500 delegates from the United States, Canada, Southeast Asian nations and NATO will gather for the forum. Politburo Standing Committee member Li Zhanshu also attended a welcome dinner on Wednesday.Washington has taken a hardline approach on China and relations worsened when Vice President Mike Pence hit out at Beijing during a fiery speech at the Hudson Institute at the start of the month, accusing it of interfering in the domestic politics of the United States — allegations Beijing denied.While many countries from the Association of Southeast Asian Nations (ASEAN) — such as Vietnam, Singapore and Malaysia — will send their defense ministers to the regional security forum, the US delegation will be led by Lewis Irwin, commandant of the Joint Forces Staff College at the National Defense University.North Korea will send a six-member delegation to the forum, led by Kim Hyong-ryong, deputy minister of the People’s Armed Forces. Kim will give a speech on international security governance — the first time a Pyongyang representative has addressed a global security forum.Jia Qingguo, an international relations professor at Peking University who will also attend the forum, said Beijing hoped to use the event to find common ground with its Asian neighbors, especially over the South China Sea.“Beijing doesn’t want these territorial disputes with some of its Asian neighbours over the South China Sea to affect its diplomatic ties with the Asean members,” Jia said. “China values its relations with all Asian countries because they are very important to regional security. That’s why the Chinese military also tries to work with its counterparts in the region.”\nTrade\n                    By ADAM BEHSUDIChina and Asean members held their first joint naval exercises on Monday as Beijing seeks stronger regional military ties in the face of growing rivalry with the United States over security, strategic and trade issues.Beijing claims about 90 per cent of the South China Sea and has expanded its military presence in the region by turning some contested reefs and shoals into military outposts. Other claimants includeMalaysia, Vietnam, the Philippines, Indonesia, Brunei and self-ruled Taiwan.China launched the Xiangshan Forum in 2006 to discuss Asia-Pacific security and defense issues, and it is increasingly seen as a rival to the IISS Asia Security Summit in Singapore, also known as the Shangri-La Dialogue after the hotel venue where it is held.The Beijing forum was canceled last year while the top Chinese leaders dealt with an extensive military overhaul at home and diplomatic issues abroad. It is co-hosted by the China Association for Military Science and the China Institute for International Strategic Studies.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}