{"id": "\n\n\n\nPOLITICO\n\n\nNew York sues Exxon Mobil over climate change\n", "paragraph": "\n                The lawsuit follows an investigation by the attorneys general for New York, Massachusetts and the U.S. Virgin Islands into Exxon's own research into climate change. | Mark Humphrey/AP Photo \nEnergy & Environment \n                    By ZACK COLMAN10/24/2018 02:30 PM EDT\n                    Updated 10/24/2018 04:56 PM EDTNew York Attorney General Barbara Underwood sued Exxon Mobil on Wednesday, alleging the oil and gas giant lied to the public and investors about the risks climate change posed to the company.The lawsuit follows an investigation by the attorneys general for New York, Massachusetts and the U.S. Virgin Islands into Exxon's own research into climate change, and whether the company failed to properly warn investors about how potential government regulations on climate change could prevent it from developing its oil and gas reserves.Story Continued Below“Investors put their money and their trust in Exxon — which assured them of the long-term value of their shares, as the company claimed to be factoring the risk of increasing climate change regulation into its business decisions. Yet as our investigation found, Exxon often did no such thing,” Underwood said in a statement. “Instead, Exxon built a facade to deceive investors into believing that the company was managing the risks of climate change regulation to its business when, in fact, it was intentionally and systematically underestimating or ignoring them, contrary to its public representations.”The fraud alleged in Wednesday’s suit reached the highest levels of Exxon management, including former Chairman and CEO Rex Tillerson, Underwood said in a tweet.The source for energy and environment news — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Exxon denied the allegations in the lawsuit, saying in a statement that New York was doubling down on a \"its tainted, meritless investigation\" into the company. Company spokesman Scott Silvestri also criticized the case as the \"product of closed-door lobbying by special interests, political opportunism and the attorney general’s inability to admit that a three-year investigation has uncovered no wrongdoing.\"The basis for the lawsuit rests on the idea of “stranded assets,” and whether companies will be forced to leave oil, natural gas and coal in the ground because of tightening regulations around greenhouse gases. That notion has gained currency in some investing circles, and some analysts have grown concerned about whether fossil fuel companies will remain viable in the coming years given the potential for carbon-constraining climate policies.The lawsuit alleges Exxon told investors it uses a “proxy cost” to price carbon pollution and to assess the effect of carbon regulation on its business, but that the company actually “applied much lower proxy costs or no proxy cost at all,” Underwood’s office said in a statement.The AG's investigation grew out of reporting by InsideClimate News and the Los Angeles Times showing Exxon had known for decades that fossil fuels would drive global climate, even as it spent millions on lobbying efforts to downplay and distort public perception of fossil fuels’ effect on warming the planet.Exxon has said it does not dispute climate change. The company also supported the Paris climate accord and recently pledged $1 million to Americans for Carbon Dividends, a group that supports taxing carbon emissions and returning revenues to people in exchange for barring climate liability lawsuits.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}