{"id": "\n\n\n\nPOLITICO\n\n\nPoll: Georgia governor’s race remains tight\n", "paragraph": "\n                Brian Kemp, Georgia's secretary of state, has a small advantage over Stacey Abrams in the poll of likely voters, 49 percent to 47 percent.  | John Bazemore, Pool/AP Photo \nElections \n                    By DANIEL STRAUSS10/24/2018 05:50 PM EDTRepublican Brian Kemp and Democrat Stacey Abrams are locked in a tight race for Georgia governor less than two weeks before Election Day, according to a new poll from NBC News and Marist College. Kemp, Georgia's secretary of state, has a small advantage over Abrams in the poll of likely voters, 49 percent to 47 percent. The two are deadlocked at 47 percent each among registered voters.Story Continued BelowThose findings come a day after a heated debate between Kemp and Abrams, in which the two argued over voting rights and immigration reform.The poll mirrors other surveys of the Georgia race. All of the public, independent polls have shown a margin of error race with 2 points or fewer separating Abrams and Kemp, though it has typically been Kemp with a 1- or 2-point edge. The campaign also features a Libertarian, Ted Metz. If no candidate gets a majority of the vote in November, there would be a runoff between the top two vote-getters in December to decide the governorship.If elected, Abrams would become the first African-American woman to serve as governor in U.S. history.The poll was conducted Oct. 14 through Oct. 18 among 864 registered voters with a margin of error of plus or minus 3.5 percentage points. Among the 554 likely voters surveyed, the margin of error was plus or minus 4.8 percentage points. Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}