{"id": "\n\n\n\nPOLITICO\n\n\n\nNew Jersey\n\nLesser-known Christie scandal could resurface if he’s tapped for AG\n", "paragraph": "\n                In 2016, the Christie administration paid a $1.5 million settlement to a former assistant county prosecutor who claimed the administration took over his office and fired him. | AP Photo\n                    By MATT FRIEDMAN11/12/2018 03:36 PM EST\n                    Updated 11/12/2018 08:33 PM ESTA scandal not nearly as infamous as Bridgegate could have major implications for former New Jersey Gov. Chris Christie if he’s nominated to become the next U.S. Attorney General.In 2016, the Christie administration paid a $1.5 million settlement to a former assistant county prosecutor who claimed the administration took over his office and fired him, all with the aim of dismissing the office’s 43-count indictment against several of the governor’s allies that embarrassed one of Christie’s major contributors. Story Continued BelowThat whistleblower, Bennett Barlyn, told POLITICO on Monday that he has grave concerns about Christie becoming the nation’s top law enforcement official, and his case could take on new relevance, with the next attorney general poised to take over the department that oversees the special counsel’s investigation into Russia’s interference in the 2016 election. Barlyn said that if Christie is nominated, the Senate should look at this case as just one way the former governor wielded justice, both as governor and U.S. Attorney, for political ends. Barlyn noted that during Christie’s time as U.S. Attorney, some companies entered into deferred prosecution agreements with the office in which, rather than face prosecution, they paid Christie’s allies millions of dollars to monitor them. Barlyn was an assistant prosecutor in Hunterdon County in 2010, when his office issued 43-count indictment against the then-county sheriff, Deborah Trout, and two subordinates, on official misconduct and other charges, including forcing employees to sign loyalty oaths, not conducting required employee background checks and making a fake sheriff’s office ID card for a well-connected Christie campaign contributor. A staffer in the sheriff’s office told a local newspaper in May 2010 that he heard then-Undersheriff Michael Russo, one of the two Trout underlings indicted, say Christie would “step in (and) have this whole thing thrown out.” Indeed, soon after the indictments were unsealed, then-New Jersey Attorney General Paula Dow — whom Christie nominated — took over the Hunterdon County Prosecutor’s Office. Three months after Russo’s alleged statement was reported, Dow successfully asked a judge to dismiss the indictments based on “legal and factual deficiencies.”A month later, Barlyn, who had complained about the handling of the case by the Christie administration, was fired. “I’ve been trying to move on. Of course when he was considered a nominee I got a call from some people saying, ‘What do yo think about this?’” Barlyn, who’s now a fifth grade teacher in Pennsylvania, told POLITICO. “My view is, in one sense he’s absolutely the wrong man for the job in an objective and ethical sense. And then given why he’d be hired, he’s the perfect man for the job.” Christie is reportedly under serious consideration by President Donald Trump’s administration for the attorney general post in the wake of Jeff Sessions’ forced resignation. Christie has been clear in the past that he desires the job. The Hunterdon County case received scant attention until the Bridgegate scandal exploded. But Barlyn sued over his termination, and a New York Times columnist took up his story in 2013. The Christie administration never admitted wrongdoing. Nevertheless, in 2016, after spending several million dollars to defend itself in the case, the state paid Barlyn a $1.5 million settlement.“There’s absolutely no doubt whatsoever that the orders relating to the dismissal of the indictment came straight from the governor’s office. That’s not in dispute,” Barlyn said. Christie, contacted through a spokesman, did not respond to a request for comment.However, in a statement late Monday, Mike DuHaime, a former Christie adviser, said, “Anyone using this case to try to hurt Gov. Christie would only do so because there’s a personal or political motive, not because there are merits to this case.”Trout filed her own lawsuit for prosecutorial misconduct, which a state appellate court dismissed in July 2018.“Four sets of judges reviewed her claim that the grand jury presentation was flawed, and on four separate occasions four separate judges all concluded it was baseless,” Barlyn said. “That’s important because it’s not just me. There are other avenues that really demonstrate that this case was grossly mishandled.”The state refused to allow grand jury transcripts from the indictments and other documents it claimed were privileged to be released to the public — things Barlyn said would have shown not only how strong the indictments were, but that the quashing of the case was ordered by the governor’s office. Initially, speculation surrounding the Christie administration’s quashing of the case focused on Trout and her friendly relationship with Christie and then-Lt. Gov. Kim Guadagno. But Barlyn said he believes it all goes back to one of the men who allegedly received a fake sheriff’s ID from the office: Robert Hariri. A physician, Hariri at the time was a high-ranking executive at the New Jersey-based pharmaceutical company Celgene — a company with numerous links to the Christie administration that would later hire Christie’s then-chief of staff, Richard Bagger.Hariri donated nearly $7,000 to Christie’s first gubernatorial campaign in 2009 and served on his transition team. (Celgene’s former CEO and executive chairman, Bob Hugin, ran unsuccessfully for Senate, losing last week to Democrat Bob Menendez. Staffers with ties to Christie formed a super PAC that spent millions on ads to help Hugin). “I always thought if you’re going to ask the question [of] where was the motive to justify dismissal of the case, to me, it still goes back to Celgene and Robert Hariri,” Barlyn said. Barlyn also told POLITICO that another person who received a fake sheriff’s office ID badge was Keith Schiller, then head of security for the Trump Organization.Schiller, through his lawyer, did not respond to a request for comment. “My case is really a piece of that,” Barlyn said. “[Christie] had no qualms about exercising his law enforcement authority in a way that benefited him politically.”Assemblyman John McKeon, a Democrat from Essex County who chairs his chamber’s judiciary committee, said he’s in court to compel the state to turn over documents from Barlyn’s case. He filed a public records request for them in 2017, but even the new, Democratic administration hasn’t wanted to turn them over, he said.“We’re seeking production of a whole variety of components of the email exchanges — all but the grand jury testimony,” McKeon said.The case should weigh heavily during the Senate confirmation process if Christie is nominated.“I’ve always said that what happened with that [case] makes Bridgegate look like child‘s play,” he said. “We’re dealing with the integrity of a criminal investigation and the potential to have overturned an indictment. There’s probably a good reason they decided to pay Mr. Barlyn in excess of $1 million.“Matt Friedman's must-read briefing on the Garden State's important news of the dayOur morning email about New Jersey health care policy and politicsA morning email with must-read analysis and breaking news on New Jersey politics and policy.POLITICO New Jersey Pro's high-level outlook on the policy issues driving the month in New Jersey.Matt Friedman's must-read briefing on the Garden State's important news of the day\n                        POLITICO ProA morning email with must-read analysis and breaking news on New Jersey politics and policy.\n                        POLITICO ProOur morning email about New Jersey health care policy and politics\n                        POLITICO PROPOLITICO New Jersey Pro’s high-level outlook on the policy issues driving the month in New Jersey.\n                        POLITICO ProOriginal federal and state policy documents © 2018 POLITICO LLC"}