{"id": "\n\n\n\nPOLITICO\n\n\nPoll: Half of voters say views on Warren unchanged by DNA test\n", "paragraph": "\n                Joseph Prezioso/AFP/Getty Images\nPOLITICO/Morning Consult poll\n                    By STEPHANIE MURRAY10/24/2018 12:03 PM EDTRoughly half of voters — 49 percent — say Sen. Elizabeth Warren’s decision to release the results of a DNA test indicating she has some Native American ancestry makes no difference in their view of her, according to a new POLITICO/Morning Consult poll.Prompted in part by President Donald Trump’s derisive references to her as “Pocahontas,” the Massachusetts Democrat made her DNA test results public last week, which indicate there is \"strong evidence\" she had a Native American in her family dating back six to 10 generations ago. Controversy over her ancestry has dogged Warren since she ran for Senate against former Republican Sen. Scott Brown in 2012 and the move was widely seen as an effort to help clear the path for a prospective 2020 presidential run. Story Continued BelowBut the rollout was far from smooth, with some Democrats expressing frustration that Warren would choose to create a media sideshow so close to the important 2018 midterms. And some progressives and Native Americans complained that Warren appeared to be appropriating tribal identity to settle a political controversy.Forty percent of voters surveyed nationally said the test’s release shifted their view in some way — 16 percent said it made their impression of Warren more favorable, while 24 percent said they view her less favorably.Broken down by party, 57 percent of Democrats said Warren's big reveal made \"no difference\" in their opinion of her. The same was true for 40 percent of Republicans surveyed. Morning Consult polled 1,968 registered voters and was conducted online Oct. 18-19, several days after the DNA test news broke. The margin of error is plus or minus 2 percentage points.“Elizabeth Warren’s decision to divulge her ancestry results did little to impact her standing among self-identified liberals,” said Tyler Sinclair, Morning Consult’s vice president. “Notably, over a quarter of liberals (26 percent) have a favorable impression of Warren’s decision to release her DNA results, compared to just 12 percent who have an unfavorable one.”When it comes to Warren's favorability more broadly, 30 percent of voters surveyed view her favorably, 38 percent said they view her unfavorably, and 32 percent either had no opinion or hadn't heard of her.Naturally, views on Warren are polarized. Fifty-two percent of Democrats surveyed view Warren favorably, and only 13 percent of Republicans view her favorably. On the flip side, less than a quarter of Democrats view her unfavorably, while a little over half of Republicans have a negative view of her. Warren shared her DNA test with The Boston Globe last week, and the story quickly dominated national headlines. Nearly two-thirds (61 percent) of those polled said they had seen a significant amount of coverage about Warren's DNA test — 33 percent of registers voters said they'd seen, read, or heard \"a lot\" about its release, and 28 percent said they'd seen \"some\" information about it. Only 15 percent of voters said they'd seen \"not much\" about the test, and 23 percent said they heard \"nothing at all\" about it. As for Warren's decision to list herself as a racial minority in the Association of American Law Schools Director of Law Teachers, a plurality (45 percent) of those surveyed said they agreed it was \"inappropriate\" for her to do. Twenty percent of registered voters polled said it was appropriate, and 35 percent said they did not know or have an opinion. Broken down by party, 61 percent of Republicans surveyed said Warren's decision was inappropriate, while 25 percent of Democrats said the same. In contrast, 34 percent of Democrats said the decision was appropriate, and only 9 percent of Republicans agreed. Morning Consult is a nonpartisan media and technology company that provides data-driven research and insights on politics, policy and business strategy.More details on the poll and its methodology can be found in these two documents — Toplines: https://politi.co/2CCb5m1 Crosstabs: https://politi.co/2Pi55F Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}