{"id": "\n\n\n\nPOLITICO\n\n\n\nFlorida\n\nFlorida recount: Political, legal fights overtake vote counting process \n", "paragraph": "\n                Ajudge is urging both sides to “ramp down the rhetoric” swirling around the recount process that not only involves the Senate race, but also the Florida governor’s race and agriculture commissioner race. | AP Photo\n                    By MATT DIXON11/12/2018 03:38 PM EST\n                    Updated 11/12/2018 06:11 PM ESTTALLAHASSEE — Sen. Bill Nelson is calling on Gov. Rick Scott to recuse himself from overseeing Florida’s midterm recount, a call that will no doubt be ignored but represents the rising tensions in the two-day-old process now beset with courtroom drama and political protests.That call came as a Broward County judge is urging both sides to “ramp down the rhetoric” swirling around the recount process that involves not only the Senate race between Scott and Nelson but also the Florida governor’s race and agriculture commissioner race. Three local legislative races are also under ongoing machine recounts.Story Continued BelowNelson joins the League of Women voters in calling on Scott to no longer oversee a recount that involves his political campaign. After Scott did not respond to their letter asking him to recuse himself, the League filed a federal lawsuit that would require Scott to step aside from overseeing the recount. As governor, Scott oversees the Florida Department of State, which houses the state Division of Elections. “[Rick Scott] should remove himself from any role in the recount process so the people can have the confidence in the integrity of the election,” Nelson said in a video statement released by his campaign. “Given his efforts to undermine the votes of Floridians, this is the only way that we can ensure that the people’s votes are protected,” added Nelson, who has not answered live questions in days.The intensifying jabs come as local election officials continue with a machine recount of 8 million ballots. The deadline for finishing that is Thursday, after which any race within a .25 percent margin would head to a hand recount, a drawn-out process that no doubt would lead to a glaring international spotlight on Florida, potentially for weeks. Brad Todd, a partner with Virginia-based OnMessage, a firm that has long advised Scott politically, swung back at Nelson during a CNN interview Monday, saying he thinks Nelson will have to make a decision about whether to keep the recount going on Thursday, which is the deadline for machine vote recounts.“Nelson’s lawyers get paid a lot. They would like to do this all winter,” Todd said. “He has to decide on Thursday, when he is going to trail significantly, does he want his entire legacy to be painted as the guy who wouldn’t go away when he was voted out by the people of Florida?”Nelson’s call for Scott to step aside from overseeing the recount came the same day that the Democratic National Committee, Democratic Senatorial Campaign Committee and VoteVets, a liberal super PAC, filed yet another lawsuit in Broward County court seeking to count vote-by-mail ballots that were cast before the deadline, but not received until after the deadline for unspecified problems with mail service.“The outright rejection of such ballots, based on arbitrary conditions — namely the timeliness of post office delivery — outside the voter’s control unlawfully infringes upon the fundamental right to vote,” wrote Marc Elias, an attorney representing the groups and, separately, the Nelson campaign.Vote-by-mail ballots must be received by local supervisors of elections by 7 p.m. on Election Day under Florida law. The lawsuit wants to change that, arguing that any vote-by-mail ballot postmarked by Election Day should be counted. This year, 878,818 vote-by-mail ballots were requested and not returned, which could be caused by any number of factors. Scott’s campaign filed its own lawsuit Sunday night asking a judge to invalidate any vote counted in Broward County that came in after noon on Saturday, which is the deadline for supervisors to file their unofficial vote totals. Attorneys for the Broward County Supervisor of Election’s office quickly fired back with their own legal response noting that they had not yet reached the final official deadline.“Plaintiff has invented a false deadline for completing canvass of ballots where none in fact exists,” read the response. “The first unofficial results are just that — i.e., unofficial.”Scott’s campaign Sunday night also filed lawsuits in Democrat-heavy Broward and Palm Beach Counties asking courts to order law enforcement to “impound” voting machines and vote tallying equipment in those counties, two places where election offices have been under heat from Republicans who, without evidence, have said they are hotbeds for voter fraud. A Broward County judge on Monday morning denied attempts by Scott’s campaign to have law enforcement impound voting machines but did add three Broward County sheriff’s deputies to the facility, which attorney Elias said the Nelson campaign supports. During that hearing, a Broward County judge warned both sides to “ramp down the rhetoric” that is getting much of the national spotlight.Scott’s legal push to treat local election offices like crime scenes added gas to what had already been a combustible mix of political and legal fights. Democrats responded by calling Scott a “dictator” for that push, while Scott’s camp said that it only wants to protect the vote.\"In suing to seize ballots and impound voting machines, Rick Scott is doing his best to impersonate Latin American dictators who have overthrown democracies in Venezuela and Cuba,\" Florida Democratic Party Executive Director Juan Peñalosa said in a statement. \"The governor is using his position to consolidate power by cutting at the very core of Democracy.\"Firing back on Twitter, Scott adviser Chris Hartline said Peñalosa needed to \"cut down on the Red Bull.\"\"We requested that ballots and voting machines be protected when not in use,\" he tweeted. \"The only reason not to protect the integrity of the ballots and the voting machines is if you are actively promoting or hoping for fraud.\"A weekly, must-read brief on health care news and moves in Tallahassee and around the stateA morning email with must-read analysis and breaking news on Florida politics and policy.A weekly must-read on budget politics for Florida Pros, with exclusive reporting and analysis, interviews and more. POLITICO Florida Pro's high-level outlook on the policy issues driving the month in Florida.Matt Dixon and Marc Caputo's must-read briefing on what's hot, crazy or shady about politics in the Sunshine State\n                        POLITICO ProA morning email with must-read analysis and breaking news on Florida politics and policy.\n                        POLITICO ProA weekly, must-read brief on health care news and moves in Tallahassee and around the state.\n                        POLITICO ProOur weekly digest of college and university news in the Sunshine State.\n                        POLITICO ProA weekly must-read on budget politics for Florida Pros, with exclusive reporting and analysis, interviews and more. \n                        POLITICO PROPOLITICO Florida Pro's high-level outlook no the policy issues driving the month in Florida.\n                        POLITICO ProOriginal federal and state policy documents © 2018 POLITICO LLC"}