{"id": "\n\n\n\nPOLITICO\n\n\nIntelligence officials:  Saudi crown prince ordered Khashoggi killing\n", "paragraph": "\n                Turkish and Saudi authorities say Jamal Khashoggi was killed by a team from the kingdom on the orders of Saudi Crown Prince Mohammed bin Salman (pictured). | Fayez Nureldine/AFP/Getty Images\nForeign Policy\n                    By ASSOCIATED PRESS11/16/2018 07:36 PM ESTU.S. intelligence officials have concluded that Saudi Crown Prince Mohammed bin Salman ordered the killing of journalist Jamal Khashoggi, a U.S. official said Friday. The Saudi government has denied the claim.The conclusion will bolster efforts in Congress to further punish the close U.S. ally for the killing. The Trump administration this week sanctioned 17 Saudi officials for their alleged role in the killing, but lawmakers have called on the administration to curtail arms sales to Saudi Arabia or take other harsher punitive measures.Story Continued BelowThe U.S. official familiar with the intelligence agencies’ conclusion was unauthorized to speak publicly about it and spoke on condition of anonymity. It was first reported by The Washington Post.Saudi Arabia’s top diplomat has said the crown prince had “absolutely” nothing to do with the killing.Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Khashoggi, a Saudi who lived in the United States, was a columnist for the Post and often criticized the royal family. He was killed Oct. 2 at the Saudi Consulate in Istanbul. Turkish and Saudi authorities say he was killed inside the consulate by a team from the kingdom after he went there to get marriage documents.This week, U.S. intelligence officials briefed members of the Senate and House intelligence committees and the Treasury Department announced economic sanctions on 17 Saudi officials suspected of being responsible for or complicit in the killing.Among those targeted for sanctions were Mohammed al-Otaibi, the diplomat in charge of the consulate, and Maher Mutreb, who was part of the crown prince’s entourage on trips abroad.The sanctions freeze any assets the 17 may have in the U.S. and prohibit any Americans from doing business with them.Also this week, the top prosecutor in Saudi Arabia announced he will seek the death penalty against five men suspected in the killing. The prosecutor’s announcement sought to quiet the global outcry over Khashoggi’s death and distance the killers and their operation from the kingdom’s leadership, primarily the crown prince.President Donald Trump has called the killing a botched operation that was carried out very poorly and has said “the cover-up was one of the worst cover-ups in the history of cover-ups.”But he has resisted calls to cut off arms sales to the kingdom and has been reluctant to antagonize the Saudi rulers. Trump considers the Saudis vital allies in his Mideast agenda.The Post, citing unnamed sources, also reported that U.S. intelligence agencies reviewed a phone call that the prince’s brother, Khalid bin Salman, had with Khashoggi. The newspaper said the prince’s brother, who is the current Saudi ambassador to the United States, told Khashoggi he would be safe in going to the Saudi Consulate in Istanbul to retrieve the documents he needed to get married.The newspaper said it was not known whether the ambassador knew Khashoggi would be killed. But it said he made the call at the direction the crown prince, and the call was intercepted by U.S. intelligence.Fatimah Baeshen, a spokesperson for the Saudi embassy in Washington, said that claim was false.She said in a statement issued to The Associated Press that the ambassador met Khashoggi in person once in late September 2017. After that, they communicated via text messages, she said. The last text message the ambassador sent to Khashoggi was on Oct. 26, 2017, she said.Baeshen said the ambassador did not discuss with Khashoggi “anything related to going to Turkey.”“Ambassador Prince Khalid bin Salman has never had any phone conversations with him,” she said.“You are welcome to check the phone records and cell phone content to corroborate this — in which case, you would have to request it from Turkish authorities,” Baeshen said, adding that Saudi prosecutors have checked the phone records numerous times to no avail.The ambassador himself tweeted: “The last contact I had with Mr. Khashoggi was via text on Oct. 26, 2017. I never talked to him by phone and certainly never suggested he go to Turkey for any reason. I ask the U.S. government to release any information regarding this claim.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}