{"id": "\n\n\n\nPOLITICO\n\n\nTrump promises intel report on Khashoggi murder 'over the next two days'\n", "paragraph": "\n                “It’s a horrible thing that took place, the killing of a journalist,” President Donald Trump told reporters. | Jacquelyn Martin/AP Photo\nWhite House\n                    By QUINT FORGEY11/17/2018 08:45 AM ESTPresident Donald Trump on Saturday declined to say whether American intelligence officials had implicated Saudi Crown Prince Mohammed bin Salman in the murder of Washington Post journalist Jamal Khashoggi, following reports the CIA had concluded the crown prince ordered Khashoggi's assassination.\"They haven’t assessed anything yet. It’s too early,” the president told reporters when asked if the CIA had assessed the crown prince's involvement, according to a pool report.Story Continued Below“It’s a horrible thing that took place, the killing of a journalist,” Trump said. “We’ll be having a very full report over the next two days, probably Monday or Tuesday.” Trump said that report will convey what members of the intelligence community \"think the overall impact was, and who caused it, and who did it.” Trump also said he spoke with CIA Director Gina Haspel earlier in the day.Upon departing the White House on Saturday morning for a trip to survey damage from wildfires in California, Trump heralded Saudi Arabia as a “spectacular ally” — two days after his administration leveled sanctions against 17 Saudi officials for Khashoggi's death. The president demurred on any potential involvement by the crown prince.“As of this moment we were told that he did not play a role,” Trump told reporters. “We’re going to have to find out what they have to say.”Trump also rejected a Thursday report by NBC News alleging that his administration is considering extraditing exiled Turkish cleric Fethullah Gulen in the hope of dissuading Turkish President Recep Erdogan from punishing the Saudis for Khashoggi’s murder.“It’s not under consideration,” Trump said, adding that “we’re having a very good moment with Turkey,” and citing Erdogan’s release of American pastor Andrew Brunson in October.“You know, we also have a great ally in Saudi Arabia,” the president said. “They give us a lot of jobs and a lot of business and economic development. They have been a truly spectacular ally in terms of jobs and economic development.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}