{"id": "\n\n\n\nPOLITICO\n\nA short-term Pelosi speakershipFollow us on TwitterSubscribe to the POLITICO Playbook family", "paragraph": "\n                                                            PoliticoPOLITICO's must-read briefing on what's driving the day in Washington Get the Playbook NewsletterBy signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.By  ANNA PALMER,  JAKE SHERMAN and  DANIEL LIPPMAN 10/20/2018 10:42 AM EDTPresented byTHE L.A. TIMES’ MARK Z. BARABAK -- a Bay Area-based political correspondent -- went on the trail to Miami to interview NANCY PELOSI. Pelosi is crossing the country, trying to whip up support for Democrats. Pelosi said this: “I see myself as a transitional figure … I have things to do. Books to write; places to go; grandchildren, first and foremost, to love.” The L.A. Times storyLET’S GET THIS OUT OF THE WAY FIRST: Nancy Pelosi is the undoubted favorite to be speaker of the House if Democrats take back the majority. The question to most Democratic insiders was: how will she do it? And now a question will be: how does she define transitional?A TRANSITIONAL SPEAKER -- an argument Steny Hoyer has tried to make -- would be a way for Pelosi to get to the speakership. People who would’ve otherwise voted against her might recognize that she did, indeed, help get the majority back for Democrats, and could be persuaded to vote for her if it is a short-term proposition.THERE ARE LOTS OF BENEFITS to Pelosi’s return to the speakership. She has institutional knowledge that no one else has in setting up a majority. She’s been there before. People will ask, though, how long she will want to stay around.THIS MOVE WOULD also set up a try-out period for would-be members of the Democratic leadership. Democrats will be clawing at each other to prove their mettle -- but that could be a healthy process in a Democratic leadership that has been stagnant for years. CHICAGO TRIBUNE: “Ahead of court hearing, Obama Foundation reveals closely guarded design plans”NEW AF1 … NBC’S KELLY O’DONNELL (@KellyO): “NEW AIR FORCE ONE ORDERED @realDonaldTrump in Arizona, ‘It’s going to be a new color system: red, white, and blue. And it looks phenomenal. It’s the right color system. And if it looks as good as it does in print and in the models, it’s going to be fantastic.’”THE LATEST ON KHASHOGGI … -- WAPO’S KEVIN SULLIVAN in Riyadh, LOVEDAY MORRIS in London and TAMER EL-GHOBASHY in Istanbul: “Saudi Arabia fires 5 top officials, arrests 18 Saudis, saying Khashoggi was killed in fight at consulate”: “The Saudi government acknowledged early Saturday that journalist Jamal Khashoggi was killed inside the Saudi Consulate in Istanbul, saying he died during a fistfight, but the new account may do little to ease international demands for the kingdom to be held accountable. “The announcement, which came in a tweet from the Saudi Foreign Ministry, said that an initial investigation by the government’s general prosecutor found that the Saudi journalist had been in discussions with people inside the consulate when a quarrel broke out and escalated to a fatal fistfight. ...“Those fired included Crown Prince Mohammed bin Salman’s adviser Saud al-Qahtani and deputy intelligence chief Maj. Gen. Ahmed al-Assiri. … Ever since he disappeared on Oct. 2 while visiting the mission, Saudi officials have repeatedly said that he left the consulate alive and that they had no information on his whereabouts or fate. … ‘Do you think I can act by myself without taking orders/guidance?’ Qahtani said last year in a tweet that is being widely shared now after the announcement of his firing. ‘I am an employee and a trustworthy executive to the orders of the king and the crown prince.’” WaPo-- WAPO’S SHANE HARRIS: “Saudi claims that Khashoggi died in a ‘brawl’ draw immediate skepticism”: “Claims by the government of Saudi Arabia that Washington Post columnist Jamal Khashoggi died in a physical altercation inside the Saudi Consulate in Istanbul drew immediate skepticism and contradicted earlier dueling accounts from Saudi and Turkish officials.“The Saudi findings, which all but absolved the heir to the throne, Crown Prince Mohammed bin Salman, increased pressure on the Trump administration to mount an independent investigation into Khashoggi’s death.“CIA officials have listened to an audio recording that Turkish officials say proves the journalist was killed and dismembered by a team of Saudi agents inside the consulate, according to people familiar with the matter. If verified, the recording would make it difficult for the White House to accept the Saudi version that Khashoggi’s death was effectively an accident. A CIA spokeswoman declined to comment. ... Current and former U.S. intelligence officials, foreign policy experts and lawmakers were quick to accuse the Saudi government of a whitewash.” WaPoA message from Delta Air Lines:Connecting armed service members with their loved ones while they undergo treatment and recovery is a small way to say thank you to the men and women who bravely serve us. Learn more on how Delta is committed to supporting veterans, active service members and their families nationwide at DeltaTakingAction.com.REACTION … SEN. TIM KAINE (D-VA.) (@timkaine): “The Saudi ‘explanation’ for murdering journalist and Virginia resident Jamal Khashoggi in a consulate—a fistfight gone wrong—is insulting. Since the Trump Administration won’t stand up against atrocity, Congress must.” … … SEN. LINDSEY GRAHAM (R-S.C.) (@LindseyGrahamSC): “To say that I am skeptical of the new Saudi narrative about Mr. Khashoggi is an understatement. … First we were told Mr. Khashoggi supposedly left the consulate and there was blanket denial of any Saudi involvement. Now, a fight breaks out and he’s killed in the consulate, all without knowledge of Crown Prince. ... It’s hard to find this latest ‘explanation’ as credible.”… SENATE FOREIGN RELATIONS CHAIRMAN BOB CORKER (R-TENN.) (@SenBobCorker): “The story the Saudis have told about Jamal Khashoggi’s disappearance continues to change with each passing day, so we should not assume their latest story holds water. … They can undergo their own investigation, but the U.S. administration must make its own independent, credible determination of responsibility for Khashoggi’s murder under the Global Magnitsky investigation as required by law.”BUT! … NYT HEADLINE: “Trump, Breaking With U.S. Intelligence, Appears to Accept Saudi Explanation of Journalist’s Death”-- NYT’S BEN HUBBARD in Beirut and DAVID KIRKPATRICK in Istanbul: “Uproar Over Dissident Rattles Saudi Royal Family”: “The one person who could intervene is the king himself, but senior princes have found it nearly impossible to bring their concerns to the 82-year-old monarch, and some doubt he is fully aware of what is happening or willing to change course. ... ‘They aren’t a particularly draconian bunch,’ said another longtime associate of the royal family, describing the philosophy of some princes as, ‘We just want to eat burgers and go on foreign holidays.’“Associates of the royal family say that senior princes don’t have the access to King Salman that they had to previous kings, making it hard to voice concerns. Some princes cannot enter the royal court or the king’s palace unless their names have been placed at the door ahead of time, one member of the royal family complained. “Otherwise, they see the king at official events where it is considered bad form to raise thorny issues or they visit him at night when he is playing cards, also a bad time for serious talk.” NYTIT SEEMS INCREASINGLY LIKELY that Congress is going to brawl in December over curbing arms sales to Saudi Arabia. Good Saturday morning. If you’re a D.C. area jamband fan, this is a big weekend: Phish is at the Hampton Coliseum and Joe Russo’s Almost Dead is at The Anthem. BIG MONEY … HOUSE MAJORITY PAC raised $14 MILLION in September, including $2.7 million from hedge fund billionaire Jim Simons and a half million from David Geffen (who attended Josh Kushner’s wedding to Karlie Kloss on Thursday -- Instapic). SENATE LEADERSHIP FUND got $25 million from Sheldon and Miriam Adelson Sept. 12 and a quarter million from Boeing.THE PRESIDENT is in Arizona this morning, and he’ll fly to Elko, Nev., for an 11 a.m. rally (2 p.m. East Coast time). He is scheduled to arrive tonight at Andrews at 7:55 p.m. VP MIKE PENCE is going to Richmond to rally for Rep. Dave Brat (R-Va.), Denver Riggleman and Ryan McAdams.INSIDE THE ROOM … WAPO’S DAVID NAKAMURA, JOSH DAWSEY and NICK MIROFF: “‘Close the whole thing!’: Border tensions boil over as Trump’s frustrations grow”: “In the summer, the president was so upset by the border numbers that he proposed sealing the entire 1,954-mile U.S.-Mexico border, including shuttering legal ports of entry, blocking trade flows and halting tourism and travel, according to the senior administration officials, who spoke on the condition of anonymity to discuss sensitive internal deliberations.“‘Close the whole thing!’ Trump demanded at one point during an Oval Office meeting, the officials said. He was talked out of it by advisers who highlighted the effect such a measure would have on more than $600 billion in U.S.-Mexico annual trade, as well as the potential damage to bilateral relations, according to the officials.” WaPo-- NYT’S EMILY COCHRANE (@ESCochrane): “I asked President Trump what evidence he had that ‘hardened criminals’ are trying to enter the country. ‘Oh please, please, don’t be a baby,’ was his response.”DOH! … BURGESS EVERETT and ELANA SCHOR: “Air wars: Hawley flies on lobbyist's plane after blasting McCaskill”: “Josh Hawley has criticized Democratic Sen. Claire McCaskill repeatedly for using a private plane to travel around Missouri. But the Republican Senate hopeful isn’t above taking a ride in a private plane himself.“Hawley received an in-kind contribution of $5,225 for a charter flight in September on a plane owned by lobbyist Travis Brown and his wife, according to public records. Hawley attended a West Virginia fundraiser on that day, social media posts show, before returning to Springfield, Missouri that night – and posting a Facebook video of him driving into the city for a rally with President Donald Trump the next day.” POLITICOMANAFORT UPDATE … DARREN SAMUELSOHN and JOSH GERSTEIN: “Manafort in wheelchair, facing ‘significant issues’ with health”: “Former Trump campaign chairman Paul Manafort appeared in federal court in a wheelchair on Friday and his lawyer said he’s dealing with ‘significant issues’ tied to his health because of his confinement at a Northern Virginia jail. “The attorney, Kevin Downing, didn’t specify what the problem was in open court but a source familiar with the situation later explained the longtime GOP operative who has been confined since mid-June is dealing with an issue related to his diet and has inflammation in his foot. Manafort, 69, was wearing a green prison jumpsuit labeled on the back ‘ALEXANDRIA INMATE’ and no shoe on his right foot during the proceedings.” POLITICOSCOOP -- “U.S. to Tell Russia It Is Leaving Landmark I.N.F. Treaty,” by NYT’s David E. Sanger and William J. Broad: “The Trump administration is preparing to tell Russian leaders next week that it is planning to exit the landmark Intermediate-Range Nuclear Forces Treaty, in part to enable the United States to counter a Chinese arms buildup in the Pacific, according to American officials and foreign diplomats. ... “But the pact has also constrained the United States from deploying new weapons to respond to China’s efforts to cement a dominant position in the Western Pacific and to keep American naval forces at bay. ...“The White House said that no official decision had been made to leave the treaty, known as I.N.F., which at the time of its signing was considered a critical step in defusing Cold War tensions. But in the coming weeks, Mr. Trump is expected to sign off on the decision, which would mark the first time he has scrapped an arms control treaty, the American officials said.” NYT\nPHOTO DU JOUR: Republican U.S. Senate candidate Rep. Martha McSally (R-Ariz.) and President Donald Trump arrive for a campaign rally at International Air Response, Friday, Oct. 19, 2018, in Mesa, Ariz. | Carolyn Kaster/AP Photo2018 WATCH -- “Alaska Gov. Bill Walker ends campaign for re-election, endorses Mark Begich,” by Anchorage Daily News’ Tegan Hanlon and Annie Zak: “Alaska Gov. Bill Walker announced Friday he is dropping his bid for re-election, and threw support to Democrat Mark Begich over Republican Mike Dunleavy. Walker, elected as an independent, made the surprise announcement at the Alaska Federation of Natives annual convention, three days after former Lt. Gov. Byron Mallott abruptly stepped down from both his office and the re-election campaign over unspecified ‘inappropriate comments’ he made to a woman.” ADNGOOD EYE – “Some Of Trump’s Judicial Nominees Have Private Twitter Accounts They Aren’t Sharing With The Public,” by BuzzFeed’s Zoe Tillman: “A review of nominees’ social media activity by BuzzFeed News showed inconsistency in what they’re disclosing to committee members in their Senate questionnaires — which are public and posted online — and what they’re not. “At least six of Trump’s pending and confirmed nominees have locked Twitter accounts. Four of those didn’t list the accounts in their Senate questionnaires; two of the nominees are new and haven’t given their materials to the committee yet. A half dozen other nominees did include Twitter and Facebook accounts in their questionnaires, and produced posts from those accounts for the committee.” BuzzFeedWAR REPORT -- “New details of top U.S. general’s close call in Afghanistan insider attack,” by ABC News Luis Martinez: “The American general and the Afghan officials had moved to an area outside of the governor’s residence to await the arrival of the military helicopter that would transport [Gen. Austin Scott] Miller and his staff ... The group was talking among themselves waiting for Miller’s helicopter when ... a gunman wearing some type of Afghan security uniform opened fire on them with an automatic weapon. ...“Miller was not in the shooter’s line of fire and was firing at the Afghan officials. The gunman was shot immediately. ‘It was over in seconds,’ said Butler. Miller, like the other U.S. personnel around him, pulled out his handgun, which is standard practice in such a situation.’” ABC NewsMEDIAWATCH – “Susan Zirinsky close to clinching top ‘60 Minutes’ job,” by N.Y. Post’s Alexandra Steigrad: “‘48 Hours’ producer Susan Zirinsky has emerged as the front-runner to become the new executive producer of ‘60 Minutes’ at CBS News, sources told The Post. Zirinsky is now the favorite to fill the shoes of veteran producer Jeff Fager, who was fired last month amid accusations of inappropriate conduct and sexual harassment, according to insiders briefed on the situation. An announcement is expected as soon as next week, according to the sources, who asked not to be identified.” NY PostGREAT WEEKEND LISTEN -- “Amb. Scott Brown Plays ‘Dream Police’ in Sydney with Cheap Trick”: 4-min. videoCLICKER – “The nation’s cartoonists on the week in politics,” edited by Matt Wuerker -- 12 funniesGREAT WEEKEND READS, curated by Daniel Lippman:-- “The Crisis of Intimacy in the Age of Digital Connectivity,” by Stephen Marche in the LA Review of Books – per ALDaily.com’s description: “The pernicious social dynamics of the internet. We overshare about our personal lives and fail to understand those of others. Narcissism spreads; empathy vanishes.” LA Review-- “Instagram Has a Massive Harassment Problem,” by The Atlantic’s Taylor Lorenz: “The platform has cast itself as the internet’s kindest place. But users argue harassment is rampant, and employees say efforts to stem it aren’t funded well or prioritized.” The Atlantic (h/t Longform.org)-- “Life’s Little Luxury,” by the Weekly Standard’s Joseph Epstein, author of “Charm: The Elusive Enchantment”: “Charm makes the world seem a more enticing place—but it is going the way of chivalry, good manners, and unmotivated kindness.” TWS … $16.48 on Amazon (h/t ALDaily.com)-- “Your Real Biological Clock Is You’re Going to Die,” by Tom Scocca in Hmm Daily – per Longreads.com’s description: “At 47, Tom Scocca realizes most of us are living under the illusion that we have unlimited time, and are free plot out the different phases of our lives to our liking. He crunches some numbers and comes to the conclusion that sooner or later — and who knows which it will be — every one of us is a goner.” Hmm Daily-- “How a Booming City Can Be More Equitable,” by Barry Yeoman in CityLab: “In Durham, North Carolina, abandoned factories are becoming tech hubs and microbreweries. But building a shared commitment to its most vulnerable citizens could be a trickier feat of redevelopment.” CityLab-- “The Great Rikers Island Art Heist,” by James Fanelli in Esquire: “For forty years, an original Salvador Dalí painting went unnoticed inside New York City’s massive jail complex. Then a gang of thieves decided it might be worth something.” Esquire-- “Why You Can’t Stop Looking at Other People’s Screens,” by John Herrman in the NYT: “You’re not a creep, though you are a thief. You’re also a human.” NYT-- “This Melissa McCarthy Story Just Might (Maybe? Possibly?) Cheer You Up,” by Taffy Brodesser-Akner in the NYT Magazine: “The dynamic star is trying to keep comedy alive at a moment when Hollywood — and its audience — can’t seem to crack a smile.” NYT-- “Inside the Mind of a Voyeur,” by Katherine Laidlaw in Toronto Law: “Pete Forde was a good landlord and a great friend, or so his tenants thought. Then they discovered he was filming them in their most private moments. The sinister world of spying for sport.” Toronto Law-- “The FBI of the National Park Service,” by Rachel Monroe in Outside Magazine: “Many people fall to their deaths in national parks every year. But as [EMT Mark] Faherty dug deeper, several things struck him as strange. For instance, how Harold [Henthorn] insisted he’d given his wife CPR, but her lipstick had been unsmudged when he arrived on scene. Faherty asked Harold about his previous marriage. His first wife had died in an accident, Harold said. He was reluctant to talk about it.” Outside (h/t TheBrowser.com)-- “The Prophets of Cryptocurrency Survey the Boom and Bust,” by the New Yorker’s Nick Paumgarten: “Inside the ongoing argument over whether Bitcoin, Ethereum, and the blockchain are transforming the world.” New YorkerENGAGED – Rosie Gray, contributing editor for The Atlantic, got engaged to Ben Judah, author of the books “This is London” and “Fragile Empire” and currently working on his third book for Picador. The couple met through mutual friends. On her birthday trip to Scotland last weekend, he proposed on a hike in the Glen Nevis in the Highlands. Instapic ... The ringSPOTTED at former RNC chairman Michael Steele’s 60th birthday party last night at the Santa Monica home of “Seinfeld” producer and writer Peter Mehlman and hosted by Zachary Todd and Saumitra Thakur: Peter Thiel, Ann Coulter, Shawna Thomas, Tim and Kiki Burger, Ret. Col. Terry Virts, Jeffrey Chen, Rick Unger, Jordan Rambis, Jack Bryan, Lina Chen, Kathy Magliato, Jenny Alden, Ziva Cooper, Sophia Parsa, Greg Edwards, Allison Kiang and Stephanie Miller.BIRTHDAYS: NYT’s Matt Apuzzo is 4-0 … Sen. Kamala Harris (D-Calif.) is 54 … Greg Lowman, partner at Sphere Consulting, is 33 ... Michelle Malkin is 48 ... Sen. Sheldon Whitehouse (D-R.I.) is 63 ... Sen. Brian Schatz (D-Hawaii) is 46 … former Labor Secretary Hilda Solis, now a member of the LA County Board of Supervisors, is 61 ... L.E. Simmons ... Rep. John Ratcliffe (R-Texas) is 53 ... John Grandy ... Kay Foley … WaPo senior editor at large Ann Gerhart … Gil Klein … Evan Zuckerman ... Josie Martin … Ellison Barber … Nelson Mullins’ Mick Nardelli (hat tip: Vinoda Basnayake) ... Colleen O’Kane … AARP’s Khelan Bhatia … New America’s Clare McCann … Jeffrey Zubricki … Gordon Pennoyer of Chesapeake Energy ... Nicole Bunce of the Virginia Chamber of Commerce (h/t David Abrams) ... Steve Moffitt, COS for Rep. Steve Russell (R-Okla.) ...… Benjamin Schwarz is 55 … Pablo Manriquez, director of comms at Roll Call ... Politico’s Dmitrii Chechetkin and Jason Golomb … Katie Leslie Watkins … Matt Dogali, CEO of the American Distilled Spirits Association ... VICE correspondent Caroline Modarressy-Tehrani ... Christie Boyden ... Anneke Green ... Whitney PakPour ... Morgan Allen ... Roddy Flynn, executive director of the Congressional LGBT Equality Caucus (h/t Mitchell Rivard) ... Stephen Garrison ... Sally Stroup ... Bart Marchant ... Webber Xu ... Lamia Rezgui ... Justin Hart ... Thomas Willard ... Taylor Gerlach ... Beth Mason ... Greg Propper (h/ts Tesresa Vilmain)THE SHOWS, by @MattMackowiak, filing from Austin: “Meet the Press”: Sen. Dick Durbin (D-Ill.) ... Sen. Thom Tillis (R-N.C.) ... Anthony Scaramucci. Panel: David Brody, Peggy Noonan, Eugene Robinson and Katy Tur“State of the Union”: Sen. Ben Sasse (R-Neb.)… Eric Garcetti. Panel: Pam Bondi, Rep. Ted Deutch (D-Fla.), Rep.Matt Gaetz (R-Fla.) and Symone Sanders (live from Tampa).“This Week”: Sen. Ted Cruz (R-Texas) … Rep. Beto O’Rourke (D-Texas) … Sen. Chris Van Hollen (D-Md.) … Nate Silver … Rep. Adam Schiff (D-Calif.) and Tom Bossert. Panel: Mary Bruce, Alex Castellanos, Kim Strassel and author and Juan Williams“Face the Nation”: Pre-empted for NFL football (from London).“Fox News Sunday”: Sen. Rand Paul (R-Ky.) … Rep. Martha McSally (R-Ariz.). Panel: Newt Gingrich and Marc Short … Jane Harman and Charles Lane … “Power Player of the Week”: José Andrés“Sunday Morning Futures”: Rep. Bob Goodlatte (R-Va.) … Sen. Lindsey Graham (R-S.C.) … John Solomon. Panel: Former Sen. Al D’Amato (D-N.Y.) and David Avella“MediaBuzz”: Emily Jashinsky … Sarah Fisher … Mo Elleithee … Fred Hiatt … Leslie Marshall … Gayle Trotter … Stuart Varney … Susan Ferrechio … David Martosko“Inside Politics”: Julie Hirschfeld Davis, Jonathan Martin, Kaitlan Collins and Sahil Kapur“Fareed Zakaria GPS”: Panel: Fawaz Gerges, Martin Indyk and Wendy Sherman … Fred Hiatt … Jonathan Weiler“Reliable Sources”: Charlotte Alter and Philip Bump … Max Boot … Carl Bernstein … More in Common co-founder Tim Dixon“Al Punto”: Justice Sonia Sotomayor … Julian Castro … singer/songwriter Gloria Trevi … transgender activist Brenda del Río … Sen. Ted Cruz (R-Texas) … Rep. Beto O’Rourke (D-Texas)“The Communicators”: UPenn’s Joseph Turow … “Newsmakers”: Guy Cecil, questioned by Steven Shepard and Ken Vogel … “Q&A”: Joel Richard Paul“Kasie DC”: Sen. Ron Wyden (D-Ore.) … Rep. Ben Ray Lujan (D-N.M) … Rep. Brendan Boyle (D-Pa.) … Harley Rouda … Elizabeth Heng … Phil Rucker … Karine Jean-Pierre… radio host John Phillips … Jo Ling Kent … Leigh Ann Caldwell (live from Los Angeles)“Mack on Politics” weekly politics podcast with Matt Mackowiak (download on iTunes, Google Play, or Stitcher or listen at MackOnPolitics.com): Sen. Ben Sasse (R-Neb.)A message from Delta Air Lines:Connecting armed service members with their family and loved ones while they undergo treatment and recovery through Delta’s SkyWish program is just a small way to say thank you to the men and women who bravely serve us. Over the past five years, Delta and its customers have donated 148 million miles to Fisher House and Luke’s Wings to provide air travel to wounded, injured, or ill service members, veterans and their families. Learn more on how Delta is committed to supporting veterans and active service members throughout the U.S. at DeltaTakingAction.com.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}