{"id": "\n\n\n\nPOLITICO\n\n\nTrump returns to the migrant caravan after post-election lull\n", "paragraph": "\n                “Isn’t it ironic that large Caravans of people are marching to our border wanting U.S.A. asylum because they are fearful of being in their country - yet they are proudly waving....,” President Donald Trump wrote on Twitter.  | Nicholas Kamm/AFP/Getty Images\nWhite House\n                    By BRENT D. GRIFFITHS11/16/2018 09:06 PM ESTPresident Donald Trump on Friday night returned to the issue of the migrant caravan, a topic he placed intense focus on before the midterm elections but since then has remained largely silent about.“Isn’t it ironic that large Caravans of people are marching to our border wanting U.S.A. asylum because they are fearful of being in their country - yet they are proudly waving....,” the president wrote on Twitter. Story Continued Below“....their country’s flag. Can this be possible? Yes, because it is all a BIG CON, and the American taxpayer is paying for it!,” he added in a follow up tweet.Before Friday night, Trump had not written about the caravan on Twitter since before the midterm elections. At that time, his claims about the group of Central American migrants, some of whom said that they planned to seek asylum in the U.S., drew the attention of a number of fact checkers, especially to an ad Trump’s reelection campaign released that eventually every cable news network, including Fox News, refused to air.Journalists and pundits had noted how silent the president had been about the topic he called one of the key points of the elections — with CNN going so far as to use a chyron with the word “Caravanished.” Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Part of the White House’s response to the caravan was ordering 5,200 active-duty troops to the Mexican border, a move Defense Secretary James Mattis defended earlier this week.\"I think many of you are aware that President Wilson 100 years ago — a little over 100 years ago deployed the U.S. Army to the Southwest border,” Mattis told reporters on Wednesday. “The threat then was Pancho Villa’s troops, a revolutionary raiding across the border into the United States, New Mexico in 1916. And there's a more recent history of DOD's support on the border.\"Trump praised the border effort as \"tremendous\" in a press gaggle on Saturday morning, saying the troops will stay there \"as long as necessary.\" Of the migrant caravan, Trump said, \"This has nothing to do with asylum, it has to do with getting into country illegally.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}