{"id": "\n\n\n\nPOLITICO\n\n\nPro-Pelosi group opposes effort to change rules over speaker nominee\n", "paragraph": "\n                Democratic leadership elections are Nov. 28, and House Minority Leader Nancy Pelosi  is heavily favored to be the party's choice for speaker. | Al Drago/Getty Images\nCongress \n                    By JOHN BRESNAHAN and RACHAEL BADE11/12/2018 02:58 PM ESTA group of Nancy Pelosi's allies is fighting efforts to change House Democratic Caucus rules so that the California Democrat can't return to the speaker's chair. The issue revolves around whether Pelosi will need 218 Democratic votes — or just a simple majority of Democrats, as the current caucus rule states — to be the party's speaker nominee when the new Congress convenes on Jan. 3. Story Continued BelowAnti-Pelosi forces led by Reps. Ed Perlmutter (D-Colo.) and Kathleen Rice (D-N.Y.) have asked to change Democratic Caucus rules to require the party's nominee for speaker — which will almost certainly be Pelosi in this case — to get 218 Democratic votes in order to move forward. While Pelosi is not named in the motion, it is clearly aimed at her.Pelosi's allies are opposed to the rules change, arguing that it would \"empower a small minority of Members to override how we use our Caucus to select Democratic leaders in the House,\" they said in a letter to other House Democrats on Thursday. The group includes: Jamie Raskin (Md.), Jimmy Gomez (Calif.), Dwight Evans (Pa.), Val Demings (Fla.), Ted Deutch (Fla.), John Garamendi (Calif.), Betty McCollum (Minn.), Louise Frankel (Fla.), Don Beyer (Va.), Eric Swalwell (Calif.), Jan Schakowsky (Ill.), Andre Carson (Ind.), Lloyd Doggett (Texas), and Doris Matsui (Calif.).A daily play-by-play of congressional news in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.The pro-Pelosi group complained that the internal rule could could lead to political or legislative blackmail of party leaders, a role the House Freedom Caucus has played for the last few years among Republicans. \"It would thus invite small groups of Members to form in order to extract this or that concession – a committee or subcommittee chairmanship, a party office, or a legislative commitment – as the price for not holding up the entire process of legislative governance,\" said the pro-Pelosi group.They also called on anyone who wants to challenge Pelosi to declare their candidacy now so the party can move forward with making their leadership selections.\n\"Although we all support Nancy Pelosi for Speaker, and indeed know of no opponents who have declared against her, we are all strong supporters of an open process and would embrace vigorous debate and contest within our Caucus,\" said the group. \"We encourage any Member who wants to run for Speaker or any other elected position to come forward and make his or her case and we plan to listen with an open mind and an open heart.\"House Democrats have scheduled a caucus meeting for Wednesday, their first since their Election Day triumph. Democratic leadership elections are Nov. 28, and Pelosi is heavily favored to be the party's choice for speaker.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}