{"id": "\n\n\n\nPOLITICO\n\n\nAlaska governor Walker suspends campaign, endorses Democrat Begich\n", "paragraph": "\n                Alaska Gov. Bill Walker announces he will drop his re-election bid while addressing the Alaska Federation of Natives conference on Oct. 19 in Anchorage. | Mark Thiessen/AP Photo\nElections\n                    By DANIEL STRAUSS10/19/2018 08:00 PM EDTAlaska Gov. Bill Walker, an independent, suspended his campaign for reelection on Friday and endorsed former Democratic Sen. Mark Begich — scrambling the state's three-way gubernatorial race with just over two weeks until Election Day.The move, first reported by the Alaska Dispatch News, comes just days after Walker's lieutenant governor, Byron Mallott, resigned, citing \"inappropriate comments\" he had made to an unidentified woman. Walker appointed state Department of Health and Social Services Commissioner Valerie Davidson to the post and vowed to press on with his reelection campaign.Story Continued BelowBut, on Friday afternoon, Walker announced at the Alaska Federation of Natives Convention that he was ending his bid for a second term and posted a statement to his campaign's website. He said the decision to abandon his campaign was \"not the first difficult decision I have made this week, but it is one I know I must make.\" Walker's decision could boost Begich against Republican Mike Dunleavy, a former state senator. Recent poling showed Walker and Begich hovering at around a quarter of the vote, with Dunleavy well ahead, with support over 40 percent. Walker will remain on the ballot, with Mallott as his running mate, though neither is an active candidate.Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.In his statement, Walker said, \"I believe we cannot win a three way race.\"\"This week I have talked to many Alaskans to determine whether I or Mark Begich had a better chance of running a competitive race against Mike Dunleavy,\" Walker added. \"The determination was made that, at this point, Begich has the better odds. Alaskans deserve a competitive race.\"National Democrats celebrated Walker's decision. In a statement, Elisabeth Pearson, the executive director of the Democratic Governors Association, called it a \"game-changer\" that puts Begich \"in a strong position\" to win next month's election.Begich served one term in the Senate after defeating then-Sen. Ted Stevens in 2008. He lost narrowly in 2014 to now-Sen. Dan Sullivan, a Republican.The Republicans Governors Association, meanwhile, called Walker’s decision a “political charade” that “reinforces why Alaska urgently needs change.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}