{"id": "\n\n\n\nPOLITICO\n\n\n\nNew York\n\nCuomo’s lead over Molinaro sinks to 13 points, Siena poll finds\n", "paragraph": "\n                The numbers certainly aren’t what a candidate looking for a big win would hope for. But a double-digit lead a week before an election still isn’t exactly tragic news. | AP Photo\n                    By BILL MAHONEY11/04/2018 09:09 AM ESTALBANY — Likely voters prefer Gov. Andrew Cuomo to Republican challenger Marc Molinaro by a 49-36 margin, according to a poll released by the Siena College Research Institute on Sunday. Cuomo's 13-point lead in the five-way race is a significant decrease from past polls. In a survey released at the beginning of October, Siena found Cuomo with a lead of 22 points at a time when there were six candidates in the race, including Cynthia Nixon. In a one-on-one match with Molinaro, Siena gave Cuomo an 18-point lead. A Quinnipiac poll from mid-October found Cuomo with a 23-point edge in a one-on-one contest. Story Continued BelowCuomo’s favorability rating also fell to the lowest level in the eight years since he’s been in office, with 45 percent of likely voters viewing him positively and 49 percent holding a negative view. The shift is due in part to Molinaro making gains among his base. Republicans supported him 59-21 a month ago; they now back him by a 74-12 margin. The challenger also made significant gains among men, who backed Cuomo 44-32 and now support Molinaro 45-41, and residents of the downstate suburbs, whose preference for Cuomo fell from 54-30 to 44-41. The numbers certainly aren’t what a candidate looking for a big win would hope for. But a double-digit lead a week before an election still isn’t exactly tragic news. “Voters are poised to give Cuomo a third-term,” Siena spokesman Steve Greenberg said in a release. “The question appears to be by what margin? Will Democrats and New York City voters turnout in bigger numbers than they have in recent midterms? If so, Cuomo has the chance to run up the score. If not, or if Republican enthusiasm matches increased Democratic enthusiasm — particularly in upstate and the suburbs where there are hotly contested House and State Senate races — then the final results will likely look similar to four years ago.” Cuomo won his 2014 race against Rob Astorino by 14 points. In the attorney general’s race, Democrat Tish James’ modest but comfortable edge over Republican Keith Wofford mostly held steady. A month ago, her lead was 50-36; it’s now 49-37. The two other Democrats seeking statewide office appear poised to win by larger margins. Sen. Kirsten Gillibrand has a 58-35 lead over Chele Farley. And Comptroller Tom DiNapoli's lead over Jonathan Trichter is at 62-25. All of the Republicans continue to suffer from a severe lack of name recognition. Some 46 percent of likely voters don’t know enough about Molinaro to hold an opinion on him. Among the other three, the best-known was Wofford, who has spent significant sums on television advertisements in recent months. But that was only enough to help 16 percent of respondents form a view of the attorney general candidate. Siena spoke with 641 likely voters from Oct. 28–Nov. 1, and the poll has a margin of error of 3.9 points. View the crosstabs here. Essential reading and exclusive insights on the day's top education news, delivered first thing in the morningEssential reading and exclusive insights on the day's top energy news, delivered first thing in the morningEssential reading and exclusive insights on the day's top health care news, delivered first thing in the morningEssential reading and exclusive insights on the day's top real estate news, delivered first thing in the morningOur morning email with must-read analysis and breaking news on state news and politics.A morning email with must-read analysis and breaking news on city news and politics.POLITICO New York Pro’s high-level outlook on the policy issues driving the month in New York State.A weekly round-up of legislation in City Council for politics and policy professionals.Laura Nahmias' must-read briefing informing the daily conversation among knowledgeable New Yorkers\n                        Politico ProOur morning email with must-read analysis and breaking news on state news and politics.\n                        Politico ProA morning email with must-read analysis and breaking news on city news and politics.\n                        Politico ProPOLITICO New York Pro’s high-level outlook on the policy issues driving the month in New York State.\n                        Politico ProOriginal federal and state policy documents © 2018 POLITICO LLC"}