{"id": "\n\n\n\nPOLITICO\n\n\nNewest security worry: Trump without Mattis\n", "paragraph": "\n                Defense Secretary Jim Mattis’ departure from President Donald Trump’s inner circle would also come at a time when much of the top military leadership is looking to retire. | Pablo Martinez Monsivais/pool/AP Photo\nDefense\n                        The Pentagon chief's widely expected departure is fueling anxiety among officials of both parties who have viewed him as a force for stability.\n                    By CONNOR O’BRIEN and WESLEY MORGAN10/20/2018 06:44 AM EDTNational security leaders fear that Defense Secretary Jim Mattis is on his way out — and that Donald Trump’s next Pentagon chief will be far more subservient to the president’s unilateral and bombastic whims.Mattis was instrumental in pulling back on Trump’s vow to “carpet bomb” ISIS or pull troops from Afghanistan. He moderated the U.S. military response to Syria’s use of chemical weapons and openly opposed Trump’s withdrawal from the Iranian nuclear deal.Story Continued BelowNow Trump’s reverence for the retired four-star general has worn thin, and Mattis is widely expected to depart his post sometime after the November elections, according to multiple Pentagon and administration officials with knowledge of personnel discussions. And that’s fueling anxiety among officials of both parties who have viewed him for almost two years as a force for stability.\"Secretary Mattis is one of the only reassuring figures in the Trump administration, and I don’t mean that as a Democratic partisan,\" said Sen. Brian Schatz (D-Hawaii), a member of the Appropriations Committee's defense panel. \"I mean when our partners and our adversaries think about the United States and the Department of Defense, knowing that Secretary Mattis is there strengthens our hand.\"Sign up for Morning Defense, a daily briefing on Washington's national security apparatus.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Current and former government officials say they worry about a repeat of what happened when Trump replaced former National Security Adviser H.R. McMaster with leading hawk John Bolton, and then-Secretary of State Rex Tillerson with conservative stalwart Mike Pompeo.\"Replacements might not be as good, just like Bolton was a real trade down from McMaster,” predicted Sen. Tim Kaine, a Virginia Democrat on the Armed Services Committee.Mattis’ departure from Trump’s inner circle would also come at a time when much of the top military leadership, including Joint Chiefs Chairman Gen. Joe Dunford, are also preparing to retire. Mattis' successor would have major influence on the complexion of the new military command structure that Trump would nominate next year.\"If he leaves, you inject a whole issue of uncertainty,\" Sen. Jack Reed of Rhode Island, the top Democrat on the Armed Services panel, told reporters earlier this week. \"Who's going to succeed him?”For Kaine, the uncertainty goes well beyond just Mattis, whose overwhelming Senate confirmation includes yes votes from members who opposed virtually all other Trump nominees.\"Secretary Mattis and Gen. Dunford are the real pillars of protecting American national security right now,\" he said. \"Either of them going, I think, would be extremely damaging to American defense and the credibility of our national security team.\"That view rests on Mattis’ reputation for a steady hand and a steady voice in the inner circle. Mattis is widely viewed as a force for continuity from the Obama administration on some of the biggest national security issues, including Iran policy and the wars in Afghanistan, Iraq and Syria.On Afghanistan and the fight against ISIS in Iraq and Syria, Mattis successfully championed strategies that broadly echoed the Obama administrations approaches to the campaigns — and rejected Trump’s own impulses toward more drastic changes. Rather than authorizing the “carpet bombing” against ISIS that Trump talked about during his campaign, or encouraging the president’s desire to pull out of Afghanistan, Mattis largely maintained the strategies the military was already pursuing in both theaters, with some tweaks such as giving field commanders more authority for air strikes.Mattis has also made public remarks that seem calculated to shut the door to policy options that reportedly intrigued the president — such as privatizing the combat advisory effort in Afghanistan, a proposal pushed by Blackwater founder Erik Prince.Mattis’ more subtle approach has also been successful in the U.S. response to the Syrian government's use of chemical weapons against civilians. \nDefense \n                    By REBECCA MORINWhen Mattis and Dunford briefed Trump on Central Command’s five potential military options for punishing Syria, Mattis characterized the most restrained option — limited strikes against three targets — as more muscular than it really was, according to a military official involved in the deliberations who described them on condition of anonymity. “He presented the lightest option as a heavy option,” the official recalled. And Trump signed off on it.On Iran policy, Mattis has clashed more openly with the president, unsuccessfully opposing his decision to pull out of the pact negotiated by the Obama administration to try to curtail Tehran's nuclear weapons program.That independence has steadily frayed the relationship between Mattis and the commander-in-chief.In an interview with The Associated Press earlier this week, Trump called his defense chief \"sort of a Democrat.\" That slap came on the heels of journalist Bob Woodward's book \"Fear,\" which quoted Mattis as disparaging the president.Mattis, who was traveling in Asia when Trump made the comment, told reporters: \"I've never registered for any political party.\"\"I'm on his team,\" Mattis added of Trump. \"We have never talked about me leaving.”He also told the reporters that Trump had called to tell him, \"I’m 100 percent with you.\"But many close observers believe the writing is on the wall about Mattis' fate — especially if the growing friction continues to play out publicly as it had with Tillerson.“POTUS is getting rid of him after midterms,\" said the same military official, who agreed to discuss knowledge of internal White House deliberations on the condition he not be identified by name. \"It’s something they’ve wanted to do for a while. They weren’t going to do it before midterms.”\"Mattis has executed his own foreign policy,\" the official added. \"He was able to get away with it by partnering with Tillerson and making McMaster irrelevant. Now with Pompeo and Bolton in, the jig is up.”Loren Thompson, a defense industry consultant with close ties to the Pentagon leadership, put it this way: \"What it comes down to is that Trump and Mattis don't see eye to eye. Trump is a change agent and Mattis is largely a product of the existing viewpoint, the status quo.\"He stopped doing those dinners with the president,\" he added. \"I think they have drifted apart and they probably aren't on the same sheet of music in terms of priorities anymore. \"For many, that is exactly why they worry about what follows.Keeping Mattis is a matter of stability, Reed believes. He said he worries that a new civilian leader will have to get up to speed even as a raft of top generals and admirals begins to retire en masse.In addition to Dunford, whose term is up in September 2019, several members of the Joint Chiefs, including Air Force Gen. Paul Selva, the vice chairman, are expected to retire next year.\nWhite House \n                    By ANDREW RESTUCCIA and BEN SCHRECKINGERSeveral top commanders responsible for various regions of the world or other global missions are also likely to be selected in the coming months. For example, Army Gen. Curtis Scaparrotti, the top commander in Europe, is retiring.\"If he is gone and there is another secretary of Defense, you’re going to see next year … everybody new around the water cooler trying to figure out where the bathroom is,” Reed told reporters. “That’s not going to be good for national defense.\"Others say the bipartisan support that Mattis has enjoyed on Capitol Hill could be difficult to replicate.“It would be hard to imagine that person having quite the same rapport,\" said Michael O'Hanlon, a military and foreign policy specialist at the nonpartisan Brookings Institution. \"It’s almost inevitable that the next person would have less of a bond with Democrats, but it could be much worse than that. It could be almost a poisonous relationship.”Not everyone is convinced that Mattis is on his way out, including O'Hanlon, who said he believes the Defense secretary still offers Trump some political benefits. Another senior administration official said he believes it would still be difficult for Trump to terminate someone with Mattis’ reputation without justification — though he might try to push the secretary out bit by bit by criticizing him.“If he can’t tell you to find the exit, he’ll make you want to find the exit,\" said the official, who was not authored to speak publicly about internal deliberations. \"This may be one of those cases where it’s not worth the daily knife fight.” Others believe Mattis won’t leave unless he’s fired — as one retired senior military officer and longtime friend of Mattis predicted.“I would be very surprised if he leaves without being told to leave,” he said, speaking on the condition he not be named. “His whole view is, leave the politics to the side and forge ahead.” Those who see Mattis is a bulwark against more extreme policies — particularly Democratic lawmakers — say they hope Mattis does stick around. \"It is alarming to think that his tenure would come to an end,\" Schatz said. \"I think it’s in the president’s interest to keep him. I think it’s in the country’s interest to keep him. And I think it’s in the interest of peace and stability to keep him. Which probably means he won’t keep him.\"Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}