{"id": "\n\n\n\nPOLITICO\n\n\nCNN chief rips Trump after suspicious device sent to network\n", "paragraph": "\n                CNN President Jeff Zucker called out the president's frequent attacks on the media after a suspected explosive was delivered to the news network in New York.  | Don Emmert/AFP/Getty Images \nMedia \n                    By JASON SCHWARTZ and MICHAEL CALDERONE10/24/2018 05:20 PM EDTCNN president Jeff Zucker ripped President Donald Trump and press secretary Sarah Huckabee Sanders on Wednesday after a suspected explosive device was found at the network’s New York office, saying White House officials failed to understand \"the seriousness of their continued attacks on the media.\"“The President, and especially the White House Press Secretary, should understand their words matter,\" Zucker said in a statement. \"Thus far, they have shown no comprehension of that.” Story Continued BelowSeveral other frequent targets of the president’s political attacks were sent devices similar to the one found at CNN in recent days, according to law enforcement, including former President Barack Obama, former Secretary of State Hillary Clinton, billionaire liberal donor and activist George Soros and Rep. Maxine Waters (D-Calif.). Since he took office, Trump has missed no opportunity to bash CNN and its reporting, including once tweeting an edited video of himself appearing to body-slam and punch a CNN logo. Last week, at a rally in Montana, Trump praised Republican Rep. Greg Gianforte for body-slamming a reporter, for which the congressman pleaded guilty last year to misdemeanor assault. CNN correspondent Jim Acosta said a Trump supporter made a throat-slitting gesture toward him at the same event, and journalists have reported feeling increasingly unsafe at Trump rallies.\"I don't like 'em either,\" Trump said of reporters Monday night in Houston as his fans yelled “CNN sucks,” a recurring chant at the president’s rallies. Your guide to the media circus — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.On Wednesday, Trump retweeted a statement from Vice President Mike Pence that included CNN in condemning the suspicious packages, though the president did not mention the network in afternoon comments at the White House.\"Acts or threats of political violence of any kind have no place in the U.S.,\" Trump said.Sanders initially released a statement Wednesday condemning “the attempted violent attacks recently made against President Obama, President Clinton, Secretary Clinton, and other public figures.\" After it was widely noted that the statement did not include CNN, she tweeted, “Our condemnation of these dispicable acts certainly includes threats made to CNN as well as current or former public servants. These cowardly acts are unacceptable and won’t be tolerated.”Just two hours after the suspected explosive device was found at CNN, the Trump 2020 campaign sent out a fundraising email bashing the network and the rest of the media. “It’s time for us to give the media another wake-up call,” the email read. Trump campaign manager Brad Parscale later apologized, saying it was a “pre-programmed, automated message.\"Press advocates have long said Trump’s rhetoric toward the media endangers journalists, who he has labeled “the enemy of the people.”\nCrime\n                    By REBECCA MORINThe package delivered to CNN was addressed to John Brennan, the former CIA director under Obama and a frequent critic of Trump. Brennan is a contributor at NBC News and MSNBC, not CNN.CNN employees evacuated their New York offices shortly after 10 a.m. Anchors Poppy Harlow and Jim Sciutto were covering the suspicious packages sent to the Obamas and Clintons when an alarm went off, and staffers could be seen behind them heading for the exits. “There’s a fire alarm here,“ Harlow told guest Tom Fuentes, a senior law enforcement analyst, and CNN's Washington studio took over the broadcast. Fifteen minutes later, Harlow and Sciutto appeared live outside the Time Warner Center on shaky video and speaking into cell phones amid a heavy police presence. For hours, CNN’s coverage shifted from the Washington studio to anchors and correspondents on the street in midtown Manhattan. While broadcasting on the street Wednesday afternoon, Chris Cuomo interviewed Sen. Jeff Flake (R-Ariz), who said the president “shouldn't refer to the press as the 'enemy of the people'” and that “we all need to watch the rhetoric that we use.”CNN journalists noted on air that the president hadn't mentioned the network on Wednesday. “It’s as if it can’t roll off the tongue unless you’re complaining about it,” CNN analyst Gloria Borger said.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}