{"id": "\n\n\n\nPOLITICO\n\n\n\nNew Jersey\n\nHugin calls Trump’s immigration rhetoric ‘inflammatory’ \n", "paragraph": "\n                The remarks by a leading Republican Senate candidate show how the president’s near-daily overtures to immigration hardliners could complicate his party’s efforts in more moderate states and congressional districts. | Getty Images\n                    By RYAN HUTCHINS10/30/2018 06:25 PM EDTROCKAWAY, N.J. — New Jersey Republican Senate candidate Bob Hugin said Tuesday he thought President Donald Trump’s rhetoric on immigration had been “inflammatory” and that the country should instead pursue “comprehensive, compassionate immigration reform.”Hours after news broke that the president wants to unilaterally end birthright citizenship, Hugin sought to distance himself from Trump on the issue. The GOP candidate — a former pharmaceutical executive trying to unseat Sen. Bob Menendez (D-N.J.) — tweeted Tuesday morning that Trump “is wrong” on the issue and that the United States is a “nation of immigrants made better by the diversity of its people.”Story Continued BelowHe doubled down in the afternoon, telling reporters at a campaign stop that he didn’t “believe anybody is well served by inflammatory comments, whether they be racist, anti-Semitic, offensive in any ways.” “Part of the problem is our country is too partisan,” Hugin said. “We’ve got to get people — elect people — who are going to work together to solve the people’s problems.”Pressed on whether he applied those criticisms to Trump, Hugin said he did.“I think there has been much of the president’s rhetoric that has been inflammatory,” Hugin said, though he didn’t know if that was Trump’s goal. “He’d have to speak for himself. I don’t know what his intentions are. But my observation is I find some of the rhetoric inflammatory.”The remarks by a leading Republican Senate candidate, said to be just a few paces behind a 12-year Democratic incumbent, show how the president’s near-daily overtures to immigration hardliners could complicate his party’s efforts in more moderate states and congressional districts.In recent days, Trump has announced plans to send 5,200 active duty troops to the Mexican border and continued to make remarks about a caravan of migrants still some 1,000 miles from the U.S., saying the group includes “some very bad people” and warning they were planning “an invasion of our country.”On Tuesday, a week before the election, Axios published an interview in which Trump he said plans to sign an executive order that would end the practice of granting automatic U.S. citizenship to those born in the U.S. to non-citizen parents. The move is likely to face a legal challenge, with many saying the practice is protected by the U.S. Constitution.Menendez, the son of Cuban refugees, jumped on the immigration issue Tuesday, saying Trump was trying to stir up anger with his remarks and “militarization at the border.”“This is all about the politics of fear,” Menendez said. “It is about the politics of trying to drive his electoral base about one week before the election. But it’s not about bringing this country together at the end of the day.”The president’s repeated and sustained remarks on immigration have the potential to alienate many voters in New Jersey, where there are some 900,000 more registered Democrats than Republicans, and where the GOP hasn’t won a U.S. Senate election since 1972.The messaging comes as Hugin, a deep-pocketed, moderate Republican, claims to be within striking distance of Menendez, as most polls show the incumbent up by single digits and as national Democrats are putting big money into a New Jersey Senate race for the first time in years.Such a state of affairs would have seemed unlikely in any other election year. But Menendez remains bruised by a federal corruption trial in which he was accused of carrying out official favors for a Florida eye doctor — now a convicted Medicaid fraudster — in exchange for campaign cash, private jet flights and lavish Dominican vacations.Menendez avoided conviction when a mistrial was declared and a judge dismissed the charges against him. But the Senate Select Committee on Ethics severely admonished him, demanding he pay back the value of the gifts.Hugin, a former CEO and executive chairman of the New Jersey pharmaceutical firm Celgene, has pumped $27.5 million of his own money into the race and used much of the cash on TV ads highlighting the allegations against Menendez. More recently, Hugin has run ads that raise old, unsubstantiated allegations that Menendez had sex with underage prostitutes — pinning it to an FBI agent's affidavit even though many thought the claims to be discredited.But it’s Hugin's links to Trump that could save Menendez in the end, polling has showed. Hugin donated six-figures to Trump's campaign, and served on his New Jersey finance committee and as a delegate for Trump at the 2016 Republican National Convention.Hugin has worked on the trail to distance himself from the president. He’s repeatedly referred to himself an “independent Republican” and said he won’t be beholden to anyone put New Jersey voters. He had already called for immigration reform prior to his remarks on Tuesday.He sought to highlight that position again, this time under pressure to do so. “Immigration’s been great for our country,” he said. “My grandparents are immigrants. We’re a stronger country culturally and economically. But we need to reform it.” He said he wants to change visa rules to “basically staple green cards to people who are getting degrees in computer science and biochemistry.” And, he said, it’s vital that tourism and agricultural businesses in New Jersey are able to hire seasonal workers.“The fact that we didn’t secure the borders is out fault,” he said. “We’ve got to secure the borders, have safe, secure cities. But the people the people that are here building productive, constructive lives should have a pathway to citizenship — not one that is shorter than people that are here legally.” Matt Friedman's must-read briefing on the Garden State's important news of the dayOur morning email about New Jersey health care policy and politicsA morning email with must-read analysis and breaking news on New Jersey politics and policy.POLITICO New Jersey Pro's high-level outlook on the policy issues driving the month in New Jersey.Matt Friedman's must-read briefing on the Garden State's important news of the day\n                        POLITICO ProA morning email with must-read analysis and breaking news on New Jersey politics and policy.\n                        POLITICO ProOur morning email about New Jersey health care policy and politics\n                        POLITICO PROPOLITICO New Jersey Pro’s high-level outlook on the policy issues driving the month in New Jersey.\n                        POLITICO ProOriginal federal and state policy documents © 2018 POLITICO LLC"}