{"id": "\n\n\n\nPOLITICO\n\n\nGeorgia’s Kemp lobs evidence-free hacking allegation at Democrats on eve of vote\n", "paragraph": "\n                The charge also marks the second time Georgia Secretary of State Brian Kemp has lodged major allegations of hacking without evidence. | John Amis/AP Photo\nElections\n                    By TIM STARKS11/04/2018 06:12 PM EST\n                    Updated 11/04/2018 11:41 PM ESTGeorgia Secretary of State Brian Kemp announced Sunday that he opened an investigation into the state Democratic party, accusing it without evidence of attempting to hack the state's voter registration system.The allegation came two days before Kemp, a Republican, squares off against Democrat Stacey Abrams for governor in a race that's a dead heat according to polls.Story Continued BelowThe charge also marks the second time Kemp has lodged major allegations of hacking without evidence. In 2016, Kemp accused the Obama administration's Department of Homeland Security of trying to hack the state's voter registration, charges the DHS inspector general concluded were untrue.Sunday's announcement arrived shortly after attorneys suing Kemp on behalf of Georgia voters notified his office of a voter registration system vulnerability that they say could render millions unable to vote, said one of the lawyers, David Cross. Rather than address the problem, Cross said, Kemp made bogus allegations that quickly generated headlines about Democrats and \"hacking.\"\"Everyone's focused on the wrong thing and doing exactly what Kemp wants,\" Cross told POLITICO. \"He was worried the vulnerability was going to come to light and he wanted to get ahead of it and have the story focused on something else.\"Kemp's office stuck to its version of events, however. \"While we cannot comment on the specifics of the ongoing investigation, I can confirm the Democratic Party of Georgia is under investigation for possible cyber crimes,\" said Candice Broce, Kemp's press secretary. \"We can also confirm that no personal data was breached and our system remains secure.\"The office said a failed hacking attempt led to the investigation, which began Saturday. The probe comes after Democratic officials and voting rights advocates informed the FBI of an apparent glitch in the voter registration site that could be exposing voters' information. Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.The FBI declined to comment to POLITICO.The Democratic Party of Georgia castigated Kemp's move as a political stunt that underscores his poor track record on cybersecurity issues.\"This is yet another example of abuse of power by an unethical secretary of state,\" said Rebecca DeHart, executive director for the Democratic Party of Georgia. \"To be very clear, Brian Kemp's scurrilous claims are 100 percent false, and this so-called investigation was unknown to the Democratic Party of Georgia until a campaign operative in Kemp's official office released a statement this morning.\"Abrams, who said on CNN Sunday morning that she learned about the investigation on air, responded that Kemp was \"desperate to turn the conversation away from his failures.\"During his term as secretary of state, Kemp has proven to be a controversial figure and was often criticized for his stance on election security in the state.Besides the debunked allegations against DHS, he has fought election integrity advocates and voters in court who have tried to force him to replace the state's electronic voting machines with more secure versions, and who have faulted his office for a leak that exposed the personal information of millions of voters. Georgia is one of only five states that rely solely on electronic voting machines that do not have an auditable paper trail.Additionally, Kemp has come under fire for purging of voter rolls of more than 1 million voters. The fact that he's administering his own election as secretary of state recently inspired former President Jimmy Carter, a former Georgia governor, to call for Kemp to step down from his current job.Kemp's office said it notified federal agencies about the investigation. “The State of Georgia has notified us of this issue,\" a DHS official said. \"We defer to the state for further details.”\nElections\n                    By ELEANOR MUELLERCross said the vulnerability came to light when a Georgia voter noticed the state's My Voter page didn't seek verification of his identity while he was seeking his own voter registration information. That meant that anyone could access voters' personal data through the vulnerability and alter it. The resident sought out one of Cross' clients, and the attorneys spoke to the voter Friday afternoon, Cross said.The attorneys then notified the FBI and Kemp's outside counsel on Saturday, Cross said, and gave them the voter's information. Meanwhile, the resident also contacted the Democratic party as another avenue of addressing it, Cross said.The vulnerability remains, Cross said.\"Nothing has been done,\" he said. \"Nobody has contacted the Georgia resident. We tried to keep it out of the press because we don't want the vulnerabilities to be known the world.\"But Kemp's office portrayed the affair as an attempt to breach the My Voter system.\"We opened an investigation into the Democratic Party of Georgia after receiving information from our legal team about failed efforts to breach the online voter registration system and My Voter Page,\" the office said later Sunday. \"We are working with our private sector vendors and investigators to review data logs. We have contacted our federal partners and formally requested the Federal Bureau of Investigation to investigate these possible cyber crimes.\"Eric Geller contributed reporting to this article.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}