{"id": "\n\n\n\nPOLITICO\n\n\nHatch: ‘Highly unlikely’ Congress will pass Trump’s proposed tax cut this year\n", "paragraph": "\n                Alex Wong/Getty Images\ncongress\n                    By BURGESS EVERETT10/24/2018 12:13 PM EDTSenate Finance Chairman Orrin Hatch conceded on Wednesday that it’s “highly unlikely” that the GOP Congress will pass a new tax cut this year hyped by President Donald Trump. The retiring Utah Republican, who leads the Senate panel that writes tax laws, expressed unfamiliarity with Trump’s proposal this week of a 10 percent tax cut for the middle class. Hatch said he could not comment on any new tax cut proposal and said he has not seen details regarding what the president has been referring to this week.Story Continued BelowThe president said Congress will likely take up a tax cut “resolution” after the election, though he offered scant details on the proposal in a Tuesday interview with the Wall Street Journal.“It would take a real monumental effort to get it through, but it’s always taken a monumental effort. So, a lot depends on the political climate and as you know I’ve seen miracles happen before,” Hatch told reporters on Wednesday after a Senate Judiciary Committee hearing held during the congressional recess. “You can’t count out the Congress.”Hatch said he has not discussed a tax cut vote with Senate Majority Leader Mitch McConnell (R-Ky.). McConnell’s office said it had no scheduling announcements to make.In September, the House passed a bill making permanent the temporary tax cuts for individuals included in last year’s tax reform law. The Senate has declined to take it up because it cannot garner 60 votes and some Democrats in difficult campaigns would likely have voted for it to blunt criticism for opposing last year’s tax reform law. The GOP has declined to use budget reconciliation so far this year, the method used to pass last year's tax cuts with a simple majority in the Senate. A daily play-by-play of congressional news in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.But Trump has been talking about something else: A blunt 10 percent tax cut for the middle class that few in Congress or the administration are aware of. House Ways and Means Chairman Kevin Brady (R-Texas) said this week that if the GOP keeps the House and Senate he would work with the administration to offer the middle class tax relief.Hatch did not offer a similar commitment, but said there very well could be a proposal before Congress in this year’s lame duck session.“We’re going to have to get into more details before I comment about it. But it will come right to me so I’ll be doing my best not to mess it up,” Hatch said. Trump will “say the way he wants to do them and he’s been pretty successful so far. So I’m going to be the last to criticize him.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}