{"id": "\n\n\n\nPOLITICO\n\n\nTrump tries to blame Democrats as his own administration chips away at Obamacare\n", "paragraph": "\n                President Donald Trump is planning a speech at his health department's Washington headquarters Thursday that could touch on drug pricing. | Brendan Smialowski/AFP/Getty Images\nWhite House\n                    By DAN DIAMOND10/24/2018 12:20 PM EDTPresident Donald Trump on Wednesday claimed that Democrats are threatening to endanger patients with pre-existing conditions while Republicans will protect them — an assertion at odds with his administration’s own persistent efforts to dismantle Obamacare. “Republicans will totally protect people with Pre-Existing Conditions, Democrats will not! Vote Republican,” Trump tweeted, part of a ramp-up of his rhetoric on health care ahead of the midterm elections. Story Continued BelowPublic health experts say his claims are inaccurate, given his administration's moves to roll back the Affordable Care Act's safeguards for people for pre-existing conditions. The administration has taken steps to promote the sale of skinnier health coverage that doesn't comply with Obamacare's requirements and could lack protections for sick people and has joined a lawsuit seeking to abolish the health care law.Democrats have cast next month's election as a fight over patient protections and hammered Republicans on the campaign trail for putting tens of millions of vulnerable Americans at risk. A Washington Post/ABC News poll released last week found Americans trust Democrats more on health care than Republicans by a 53-35 percent margin.Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Trump is planning a speech at his health department's Washington headquarters Thursday that could touch on drug pricing, the opioid crisis and patient protections, two individuals tell POLITICO. It would be an unusual venue for a president more comfortable with holding rallies outside Washington than addressing federal workers. HHS and the White House declined requests for comment. Trump’s claims on pre-existing conditions illustrate the GOP’s struggle to support Obamacare’s most popular provisions while signaling to its base that it hasn’t given up efforts to wipe out the law.Trump’s Justice Department and Republican attorneys general from 20 states are trying to abolish Obamacare — or at least its consumer protections — in a federal court case in Texas. Democrats have seized on the case, saying it could imperil children with cancer, adult diabetics and countless others, and holding rallies featuring people who struggled to obtain insurance before Obamacare due to a health condition.The administration also has made it easier to enroll in cheaper, skinnier coverage that doesn’t adhere to Obamacare’s requirements. Just this week, it published a rule that would allow workers to use Obamacare subsidies for non-compliant plans, as well as Obamacare coverage. The administration also has finalized rules making it easier for small businesses and independent contractors to band together to purchase coverage. And it expanded the availability of short-term plans that could remain in place for up to a year, reversing a three-month limit imposed by the Obama administration.\nEmployment & Immigration\n                    By TED HESSONCritics worry the moves will lead consumers to unwittingly purchase coverage that doesn’t cover pre-existing conditions or provide significant financial protection, and that they’ll only discover that when they’re hit with big medical bills.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}