{"id": "\n\n\n\nPOLITICO\n\n\nDemocrats go all-in on clean energy\n", "paragraph": "\n                Sen. Jeff Merkley (D-Ore.) — a potential 2020 presidential candidate — has unveiled legislation that sets the goal of transitioning the country to 100 percent \"clean and renewable\" energy.  | Win McNamee/Getty Images \nEnergy & Environment \n                        Gubernatorial candidates and potential White House hopefuls are embracing a total phase-out of ‘dirty’ fuels in coming decades.\n                    By ANTHONY ADRAGNA10/24/2018 07:07 PM EDTDemocratic candidates are no longer afraid of embracing the war on coal and oil.At least six Democrats running for governor this year have embraced a goal of moving the U.S. completely to clean energy in coming decades, as have potential presidential contenders like Bernie Sanders, Cory Booker and Elizabeth Warren. Story Continued BelowIt’s a sweeping shift in energy policy, going well beyond the Obama administration’s regulations of fossil fuels — and yet another sign of the growing power of liberal ideas in the Democratic Party even as President Donald Trump tries to push the nation to the right.The candidates’ plans leave many details unfilled, and they disagree on questions such as whether clean energy should include nuclear power and natural gas. The strategy could also prove risky for Democrats competing in energy-producing states such as Ohio, Pennsylvania and North Dakota.But climate change activists say it’s encouraging to see so many candidates championing a bold approach to solving one of the world’s biggest problems. The source for energy and environment news — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.“When lots of candidates in widely different political environments are all running on a platform of 100 percent renewable energy, it means that voters are telling them they want leaders who will help solve the climate crisis,” former Vice President Al Gore told POLITICO. “So these candidates have concluded correctly that acting on the climate crisis is a no-brainer.” Climate change allows Democrats to draw a sharp contrast with Trump, who has repeatedly dismissed warnings from scientists about the threat of already-rising seas and extreme weather. And where climate policies based on cap-and-trade programs or carbon taxes may trigger voters' fears of higher energy prices, Democrats can emphasize the jobs they say would come from building millions of new wind turbines, solar panels and electric vehicles. \"Clean energy and clean jobs are good for the planet, and they're just good business,\" Illinois Democratic gubernatorial nominee J.B. Pritzker tweeted last year. Environmentalists say part of the appeal is the goal’s aspirational nature, and that it allows Democrats to tout existing success stories from the growth of renewable energy businesses, even in conservative parts of the country. The goal also meshes with pledges by dozens of major U.S. companies to switch to 100 percent renewable energy. “I think the 100 percent metric is a good target setting and then you can figure out how you get there — each part of the country would probably have to get there a little different way,” said Ana Unruh Cohen, managing director of government affairs at NRDC Action Fund. “That type of vision is one that can have pretty broad support from sea to shining sea and all the places in the middle.”\n2020 \n                    By BILL SCHERSupporters of fossil fuels counter that the 100 percent goal is impractical and a recipe for higher energy costs. They argue that Democrats running on the idea won’t be around when the downsides appear.“They’re just being responsive to the donors and to the environmental groups that are increasingly a powerful force in the Demcratic Party,” said Tom Pyle, president of the libertarian-leaning American Energy Alliance. “We haven't seen any of the pain of these policies yet.”The plans that Democratic candidates have put forward contain important differences, including how quickly they would move and what they would define as a clean source of energy. In some proposals, existing nuclear power plants and future natural gas plants that capture and bury their carbon emissions count toward clean energy goals. In others, Democrats say only truly renewable sources like wind, solar and geothermal should count. Many of the plans also call for the rapid electrification of the transportation sector, which the Environmental Protection Agency says accounted for the greatest portion of the nation’s greenhouse gas emissions in 2016. According to the Energy Information Administration, renewables in 2017 accounted for 11 percent of U.S. energy consumption and about 17 percent of electricity generation.\n                            House progressives, led by Rep. Tulsi Gabbard (D-Hawaii), are backing an aggressive bill, which calls for 100 percent non-fossil fuel energy by 2035 and has the support of nearly four-dozen House Democrats. | Win McNamee/Getty Images Democratic New Jersey Gov. Phil Murphy made transitioning to clean energy a key tenet of his successful 2017 race. Then in May, Murphy signed legislation requiring 50 percent of energy sold in the state to come from renewable energy sources by 2030. In addition, he issued an executive order calling for the state to develop a roadmap for achieving 100 percent clean energy by 2050. In Colorado, Democrat Jared Polis is championing a pitch to transition the state to 100 percent renewable energy by 2040. That is an aggressive goal for a state that today gets around 20 percent of its energy from renewables, and the plan has helped Polis maintain strong support among the state's environmentalists, despite grumbling among some activists over his opposition to a ballot measure that would severely limit fracking. And Pritzker says he \"will be committed to putting Illinois on track to acquiring 25% or more of our energy from clean renewable sources by 2025 and 100% of our energy from renewable sources by 2050.\" Today renewables provide 7 percent of net electricity generated in the state, according to EIA. The League of Conservation Voters Action Fund says Gov. Kate Brown in Oregon and gubernatorial candidates Tony Evers in Wisconsin, Gretchen Whitmer in Michigan and Ned Lamont in Connecticut have also endorsed the policy in response to a questionnaire from the group.California this year passed the country's most sweeping energy law, putting the state on a course to get 60 percent of its electricity mix from renewables by 2030 and 100 percent from broader zero-carbon sources by 2050. Kevin de León, the Democratic former state Senate President pro tem who is challenging Sen. Dianne Feinstein from the left, introduced and championed the new law and told a newspaper in September that \"I stand strongly on 100 percent clean energy. I think it’s going to be a boom for our economy.\" Billionaire environmentalist Tom Steyer attended the bill signing. Even if Democrats win one or both chambers of Congress this year, they are unlikely to get much traction on any ambitious energy or climate change bills while Trump is in the White House. But that hasn't stopped from lawmakers from floating legislation calling for 100 percent clean energy.\nEnergy & Environment\n                    By BEN LEFEBVRESen. Jeff Merkley (D-Ore.) — a potential 2020 presidential candidate — has unveiled legislation setting the goal of transitioning the country to 100 percent \"clean and renewable\" energy by 2050 without explicitly defining those terms. Sanders (I-Vt.) and Booker (D-N.J.) co-sponsored it. California Sen. Kamala Harris, another likely 2020 contender, has not signed onto a bill, but she praised her state for \"continuing to lead the way in the fight against climate change\" when its 100 percent clean energy law passed earlier this year.Merkley, Sanders and Warren (D-Mass.), another likely 2020 candidate, signed onto a 2016 resolution from Sen. Ed Markey (D-Mass.) calling for the transition to \"100 percent clean, renewable energy.\"House progressives, led by Rep. Tulsi Gabbard (D-Hawaii), are backing an even more aggressive bill, which calls for 100 percent non-fossil fuel energy by 2035 and has the support of nearly four-dozen House Democrats. A report from the groups Food & Water Watch and Climate Hawks Vote said 38 non-incumbent congressional candidates would back the House bill. However, the idea does not enjoy universal support among climate activists, including noted climate scientist James Hansen, who supports charging a fee on carbon emissions and distributing the proceeds to the public. In a column earlier this year, he warned that \"tricking the public to accept the fantasy of 100 percent renewables means that, in reality, fossil fuels reign and climate change grows.\"Academics have fiercely debated the feasibility of powering the U.S. power grid by renewable power alone. Stanford professor Mark Jacobson was lead author of a 2015 study concluding that wind, solar and hydropower could fuel the U.S. grid by 2050 “with little downside.” That led to a peer-reviewed critique from 21 academics questioning those conclusions and saying the original paper contained “modeling errors, and made implausible and inadequately supported assumptions,” while also noting that numerous studies have found 80 percent decarbonization could be accomplished “at reasonable cost.” (Jacobson sued over that rebuke and demanded its retraction before ultimately abandoning the lawsuit this February). But momentum has grown as increasingly large cities, including Seattle, San Diego, Atlanta, Salt Lake City, Portland, Ore., and dozens of others committed to transitioning to 100 percent renewable energy. They were joined by more than 100 corporate giants, including Facebook, HP, Johnson & Johnson, Kellogg’s, Lyft and Mars, who’ve made similar voluntary commitments to power their operations by entirely renewable sources. Many experts say the rapid deployment of renewable energy resources is achievable, though it won’t happen overnight. “A goal focused on achieving low or zero-carbon energy targets, rather than just a certain amount of renewables, allows for the broadest possible set of tools of technologies to be brought to bear on the goal of reducing greenhouse gas emissions,” said Jason Bordoff, former senior director for energy and climate change in President Barack Obama’s National Security Council and now the founding director of Columbia University's Center on Global Energy Policy.Some observers think the candidates are seizing upon a transition to renewables already underway, but that completing it will be harder in the coming years. But they acknowledge it's a politically popular idea. “Right now, gas has come into the generation mix to balance renewables. Getting to 100 percent renewables means pushing gas out of the mix. That’s a much bigger challenge,” said Kevin Book, managing director of ClearView Energy Partners. “Over the next 35 years any degree of infrastructure change is possible, but over any period of time no dramatic infrastructure change is easy.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}