{"id": "\n\n\n\nPOLITICO\n\n\nTrump squares off with Biden in dueling Nevada rallies\n", "paragraph": "\n                “Obama came along and took him off the trash heap and made him vice president,\" Donald Trump said of Joe Biden on Saturday. | Carolyn Kaster/AP Photo\nElections\n                        Voters got a preview of a potential 2020 general election matchup.\n                    By JAMES ARKIN and DAVID SIDERS10/20/2018 06:07 PM EDTLAS VEGAS — President Donald Trump and former Vice President Joe Biden squared off at dueling rallies in Nevada on Saturday, a preview of what could potentially become a nasty 2020 matchup in a critical swing state.Trump, rallying the GOP base in the northern city of Elko, labeled the Democrat “Sleepy Joe Biden” and “One Percent Joe,” mocking both the size of the crowd at Biden’s event and the former vice president’s past failed presidential campaigns. Biden responded in kind, telling a crowd of several hundred outside the local Culinary Union here that Trump was “shredding” basic decency and making a deliberate effort to divide the country.Story Continued BelowBiden said he decided to speak out against Trump after the president's response to white supremacists marching in Virginia last year. At the rally, Biden criticized the president’s rhetoric on minorities, his embrace of Vladimir Putin and the separation of families at the Mexican border. “It’s a conscious effort to divide the country,” Biden said. “It’s deliberate. And it worked in part. We can’t let it work again.”A few minutes later, Trump punched back. “I think he ran three times, and he never had more than 1 percent, so we call him ‘One-Percent Joe,” Trump said.“And then remember what happened?” he continued. “Obama came along and took him off the trash heap and made him vice president. But he never had more than 1 percent.”Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.The dueling rallies were intended to gin up each party’s base ahead of hotly contested Senate and gubernatorial races here. Biden implored voters to send first-term Rep. Jacky Rosen to the Senate to help flip the majority; GOP Sen. Dean Heller has led narrowly in several recent public polls. Trump, meanwhile, rallied the GOP faithful behind the freshman senator, who praised him effusively despite their previously contentious relationship.Biden’s rally was just the latest in a steady stream of visits to Nevada by Democrats eyeing 2020. Nevada is both a key swing state in the general election and the “first in the West” caucus, which could help propel the winner out of a likely crowded field of contenders. Nevada served as a significant proving ground for Hillary Clinton with nonwhite voters in 2016, giving her momentum heading into South Carolina and the Southern primaries that followed. Sen. Elizabeth Warren (D-Mass.) said at the Nevada Democratic Party’s state convention in June that the state marked a rare “bright spot” for Democrats two years ago. Clinton carried the state, while Democrat Catherine Cortez Masto became the first Latina senator. Democrats also flipped the state legislature. But Trump lost the state by only 2.4 percentage points, and Republicans expect to compete here in 2020. “It’s not enough to just show who they are,” Biden said of Trump and Republicans. “We’ve got to tell them who we are. What do we stand for. What does the Democratic Party stand for today?”Biden also touted his close relationship with former President Barack Obama, who won Nevada twice and will headline a rally for Rosen here on Monday.“He’s a good friend, man,” Biden said. “I want to make it clear: All those memes, they’re basically true. He made the first friendship bracelet, not me.”\n                            “It’s not enough to just show who they are,” Joe Biden said of President Donald Trump and the GOP. “We’ve got to tell them who we are.\" | Bryan Woolston/AP PhotoThis year, in addition to raising money for Rosen and making visits to the state’s powerful Culinary Union, Democratic contenders have been requesting audiences with former Senate Majority Leader Harry Reid, who remains a powerful force in Democratic politics in Nevada and is expected to become involved in the 2020 presidential primary here.“I’m Joe Biden, and I work for Harry Reid,” the former vice president said in kicking off his rally.Rosen has benefited from the big-name guests. Sen. Jeff Merkley of Oregon joined her for a small event Saturday and will campaign with her in Reno on Sunday. Sen. Bernie Sanders of Vermont will rally for her Thursday, and she’s had fundraising help from Sens. Kamala Harris of California, Cory Booker of New Jersey, Warren and Merkley. Warren headlined a state party event over the summer and got her own split-screen with Trump, who was rallying in Las Vegas that day.Washington Gov. Jay Inslee, chairman of the Democratic Governors Association, talked gun control with Democratic candidates during a swing through Las Vegas in April. Merkley held an event with Rosen on energy and environmental issues in the spring. Booker campaigned with candidates here in August, and, in a social media video for Rosen, said, “This state is in my blood.”Perhaps no Democrat has campaigned as aggressively in Nevada as Los Angeles Mayor Eric Garcetti. At a United Brotherhood of Carpenters International training center in Las Vegas last month, Garcetti noted that he was making his fifth trip this year.Relative newcomers to early primary politics, Nevada Democrats have relished their position on the primary calendar since the state became an early caucus state in 2008. Heightened attention on the contest here is viewed by Democrats as significant to increasing Democratic voter registration in a competitive state.Bob Fulkerson, state director of the Progressive Leadership Alliance of Nevada Action Fund, a progressive group that runs registration and turnout operations in the state, said that as Democratic presidential contenders campaign for Nevada Democrats this year, “The oblique message is, ‘Vote for me in the primary, too,’ although they’re classy enough not to say that.”\nWhite House\n                    By CHRISTOPHER CADELAGOHe said, “I think it’s good. I think it really shows voters, particularly low-propensity voters, want to be talked to directly. … To have candidates come here and actually tell them that they matter is really important.”William McCurdy, the state Democratic Party chairman, said the state represents an important stop for any Democrat with ambitions to challenge Trump. He specifically touted Biden, Warren and Harris for having strong relationships with the party here.“Some of these folks want to run for president in 2020, why not come interact with one of the most exciting bases in the country?” McCurdy said.He added that he was pleased with how many potential 2020 contenders had made trips to Nevada, but he’s not satisfied yet.\"We're looking for a few more; we want a few more,” McCurdy said.Republicans view Nevada as a state in which Trump could compete two years from now. Trump has formed a close bond with Heller, who has won four statewide races here and has embraced the president as he’s run for reelection.“This is Trump country now. He will win this state,” said Michael McDonald, the Nevada GOP chairman. “If you look at the success he's had over 18 months, and I say that with all due respect to the former vice president, there's no one on that side of the aisle that can compete with President Trump.\"Democrats, obviously, disagree, and look at Nevada as central to their path to defeating Trump in two years. In this midterm year, Democrats are investing significantly in Latino turnout in Nevada in an effort not only to oust Heller, but also to capitalize on the state’s changing demographics to close off any opening Trump might have.“I think Nevadans here are going to pick anybody over Trump,” said Megan Jones, a Democratic strategist in Nevada. “And I think that in '20 they will be loaded up for bear no matter who the nominee is.”With such a large potential slate of candidates, no favorites have emerged yet. Margy Feldman, a retiree from Henderson who has been volunteering for Rosen, said before the rally that she loves Biden but is worried about his age. She said she was hoping for someone \"younger, that has super high energy” and someone who isn’t a “household name.\"But immediately after Biden, 75, spoke, Feldman returned to amend her view: “I’m going to go vote for Joe Biden,” she said. “I’m so excited.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}