{"id": "\n\n\n\nPOLITICO\n\nU.K. serves notice on big tech", "paragraph": "\n                                                            PoliticoAn early filing of the day's tax newsGet the Morning Tax NewsletterBy signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.10/30/2018 10:00 AM EDTEditor’s Note: This edition of Morning Tax is published weekdays at 10 a.m. POLITICO Pro Tax subscribers hold exclusive early access to the newsletter each morning at 6 a.m. To learn more about POLITICO Pro’s comprehensive policy intelligence coverage, policy tools and services, click here.U.K. SERVES TAX NOTICE ON BIG TECH: The newly announced U.K. digital services tax made an immediate impression, even if collections aren’t scheduled to begin there until April 2020. Government officials who wrote that timetable for enacting the 2 percent tax in the British budget plan expect others to soon follow. The U.S. tech industry isn’t pleased.Story Continued Below“In his final budget statement before the U.K. leaves the EU next March, Chancellor Philip Hammond jumped ahead of European Union policymakers and the 36-member Organisation for Economic Co-operation and Development (OECD), which are also drawing up proposals, by setting out his own timeline for a new tax that appears to be aimed squarely at the likes of tech behemoths Google, Facebook and Amazon,” our Annabelle Dickson reports from London.The U.K. digital tax would kick in the same year the OECD is supposed to finish an agreement on taxing digital service platforms. Industry opponents and U.S. officials including Treasury Secretary Steven Mnuchin have urged a pause to allow that multilateral process to play out before countries act on their own. Hammond said the U.K. would continue working with the OECD and Group of 20 nations and drop the tax if an appropriate international solution emerges. The tax would also be subject to a formal review in 2025, the Treasury said.The mechanics look simple. The tax, which differs from an online sales tax, would apply to revenues from the use of search engines, social media platforms and online marketplaces from users in the U.K. In a nod to concerns that it could stifle innovation, the tax would only hit profitable businesses with global sales that exceed £500 million, or about $640 million, and tech companies’ first £25 million of U.K. revenues is exempt. Policymakers don’t want to drive the sector out of Britain after Brexit, especially after Google and Facebook announced multibillion-pound investments in London, arguably Europe's biggest tech hub.The U.K. tax could yield an estimated £400 million a year. In March, European Commission officials proposed a 3 percent tax on digital commerce revenues, which they said could generate an estimated 5 billion euros or $5.7 billion annually for member states. The French are pushing to get it adopted across the board by the end of this year despite opposition in a handful of countries, led by Ireland, and rumored reluctance in Germany.While companies are more than concerned about the tax spreading globally, tech trade associations in the U.S. and U.K. warned of the industry being undermined in Britain in the near term. In addition, the National Foreign Trade Council in the U.S. said American companies could be disproportionately affected and that it could ultimately interfere with U.K. trade commitments, potentially endangering future trade relations. But London has signaled it’s leading. As Annabelle writes, one Treasury official said they were “treading softly to start with” and hoped it would “encourage other countries to act too.”WELCOME TO TUESDAY from Morning Tax, where we’re a week away from midterm elections. Be in touch with some tax tidbits in the interim. Email: bbecker@politico.com, teckert@politico.com, bfaler@politico.com, alorenzo@politico.com.Twitter: @berniebecker3, @tobyeckert, @brianfaler, @aaronelorenzo,@POLITICOPro and @Morning_Tax.Election Day is almost here. Have you made your POLITICO Playbook Election Challenge picks yet? Don’t miss your chance to compete against the nation’s top political minds in the POLITICO Playbook Election Challenge by correctly picking the winning candidates in some of the most competitive House, Senate and gubernatorial races in the country. Win awesome prizes and eternal bragging rights. The contest closes at 6 a.m. on Nov. 6. Sign up today. Visit politico.com/playbookelectionchallenge to play.POLITICO Pro announces dedicated California coverage: On Nov. 7, there will be a new authority on California politics and policy. Just in time to help policy professionals and business leaders in the Golden State navigate the twists and turns of a new administration, POLITICO California Pro is the only tool that will arm you with a team of state-level experts. Learn more.RAISING THE CORPORATE RATE: Democrats could look to reconciliation to increase the corporate tax rate, according to Rep. John Yarmuth (D-Ky.), who stands to be the next House Budget Committee chairman should his party take control of the chamber. He told our Jennifer Scholtes he expects proposals to boost the rate to 25 percent or 27 percent from the new level of 21 percent, given how little benefit has flowed to employees and reinvestment from the Tax Cuts and Jobs Act, H.R. 1 (115). “It was $775 billion worth of stock buybacks,” Yarmuth said. “It was not really what was promised.”Republicans last year used the reconciliation budget maneuver to prevent Senate Democrats from halting passage of the new law. Yarmuth, who said the budget panel would explore whether tax cuts can pay for themselves, foreshadowed the likelihood of pushing for more revenue through corporate taxes. “And the only way we can do that is through reconciliation,” he said. But it’s not likely Republicans would agree to such a plan if they retain Senate control, much less President Donald Trump.CLARITY COMING? The Joint Committee on Taxation’s technical explainer on the new tax cuts law, called the Blue Book, should emerge by the end of the year, a staffer said at an American Bar Association meeting. JCT Chief of Staff Thomas Barthold has said he prefers it come out before the absolute end of the year. “So that basically means soon,” said Veena Murthy, JCT legislation counsel, according to Tax Notes. The JCT generally releases its Blue Books at the end of each Congress with explanations of enacted tax legislation, though they sometimes are issued annually, too. WHISTLEBLOWER ADVOCACY: The IRS needs to improve how it rewards whistleblowers who flag violations on Foreign Bank and Financial Accounts (FBAR) reports, according to a new Government Accountability Office report. New law requires the IRS to include FBAR penalties in calculating whistleblower awards, but that wasn’t previously the case, and GAO found that IRS awards could have been $3.2 million more between January 2012 and July 2017. “For the IRS whistleblower program to be successful, whistleblowers need to have confidence in the program’s processes and outcomes, including paying awards when a whistleblower’s information is used,” the report said. The IRS agreed with the recommendations.TAX HIKE EYED ON TOP INCOMES: Taxes would rise on top earners in Colombia under a new proposal that would also trim the corporate tax. The income tax on upper earners would increase to between 35 percent and 37 percent from 33 percent now, depending on salaries, Reuters reported. Taxes on corporate income would be lowered to 30 percent from the current 33 percent. The plan would also extend the country’s value-added tax. It faces an uphill battle for passage in Colombia’s legislature.CARBON TAX KERFUFFLE: Canadian Prime Minster Justin Trudeau was on the carbon tax defensive, worrying that his opponents want to “make pollution free again,” CTV News reported. Trudeau’s critics aren’t serious about broader climate change problems and lack a strategy to address the issue, so they fall back on attacking the carbon tax, he said. “What the critics all have in common is that they want you to think that it’s OK to have no real plan at all,” Trudeau said.RUNAWAY SUBSIDY: Wisconsin’s expanding subsidy for the Taiwanese company Foxconn has now reached some $4.1 billion, according to the Verge, up from an initially forecast $3 billion. At the same time, Foxconn has cut back its job creation promises. Originally thought to be central to GOP Gov. Scott Walker’s latest reelection bid, the deal could end up hurting him. “Polls now show most Wisconsin voters don’t believe the subsidy will pay off for taxpayers, and Walker didn’t even mention the deal in a November 2017 speech announcing his run for re-election,” the story said.PROPERTY TAX PROPOSAL: New property taxes could soon hit Utah residents in Salt Lake County. The potential increase is scheduled for consideration at a budget hearing next month of the Greater Salt Lake Municipal Services District, which manages services in the county’s five metro townships and unincorporated areas, according to the Deseret News. Some 90,000 residents could face the new tax “to help fund road repairs and maintenance,” with a separate new stormwater fee also under consideration. Opinion: Tariff repeal would deliver Trump’s middle-class tax cuts.Another look at what Democrats could do with Trump’s tax returns.Some 13,200 taxpayers could have exceeded annual 401(k) limits and would owe $33 million in extra taxes, watchdog says.The JCT published no Blue Books between 1987 and 1996.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}