{"id": "\n\n\n\nPOLITICO\n\n\nRed-state governor races could bring Medicaid expansion to millions\n", "paragraph": "\n                Georgia’s neck-and-neck governor's race between Democrat Stacey Abrams and Republican Brian Kemp is one of at least half a dozen where a Democrat supporting Medicaid expansion has a fighting chance to replace a Republican who opposes it. |  John Bazemore-Pool/Getty Images\nElections\n                        A blue wave might drive the biggest enrollment spike since Obamacare was first implemented.\n                    By ALICE MIRANDA OLLSTEIN10/30/2018 01:00 PM EDTCONYERS, Ga. — Stacey Abrams paced the brightly lit pulpit of the Kingdom Builders Covenant Church on a cold, drizzly evening before Election Day, preaching the gospel of Medicaid expansion.“When we help the least of these, we help everyone,” said the Democratic gubernatorial candidate, pointing her finger in the air as audience members swayed in their chairs, raised their hands and called out in assent. “Republicans are too mean and too cheap to take the money. But we know that health care is not a privilege in America. Health care is a right in America, and that is why I’m running.”Story Continued BelowGeorgia’s neck-and-neck governor’s race is one of at least half a dozen where a Democrat supporting Medicaid expansion has a fighting chance to replace a Republican who opposes it. Competitive races in Florida, Wisconsin, Kansas, Oklahoma and South Dakota could also flip the status of holdout states that have so far refused Obamacare's Medicaid expansion — though Republican legislatures are not likely to make it easy.In addition, Maine voters who overwhelmingly backed expansion in 2017 will choose between a Republican who vows to continue departing Gov. Paul LePage’s crusade to block Medicaid’s implementation and a Democrat who says she will immediately enact it. Four more states deep in Trump country — Idaho, Utah, Nebraska and Montana — have Medicaid expansion questions on their ballots; in Montana’s case, whether to continue their legislature-approved expansion.Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.The blue wave many experts predict could drive the biggest enrollment spike in the program since the early years of Obamacare’s implementation, and mark a sharp rejection of the Trump administration and congressional Republicans’ efforts to repeal or roll back the Affordable Care Act. All told, the races could expand eligibility to nearly 3 million people without health coverage. In Georgia alone, nearly half a million uninsured, low-income adults could join the rolls, many of them residents of rural, Republican-controlled counties. Abrams, formerly the state House minority leader, has put expansion front and center, calling it her “No. 1 priority.”As she crosses the state in a brightly painted campaign bus, Abrams sometimes makes a “Georgia first” argument, noting that billions of residents' tax dollars are helping fund other states’ expansions, and promising to bring those dollars “back home” by taking federal funding that will cover the lion's share of the added coverage. Other times, she zeroes in on the high number of uninsured Georgians using emergency rooms for primary care, which, she points out, puts a strain on local budgets that could be alleviated by expanding Medicaid.Standing on a basketball court in conservative-leaning Monroe, an hour east of Atlanta, Abrams made a deeply personal argument. She spoke about her younger brother’s years of struggle with a drug addiction and undiagnosed bipolar disorder — and how he got the treatment he needed only after he went to jail. He struggled to find a job with health coverage once released and wound up relapsing.“Until we expand Medicaid, Walter will not be entitled to the very type of health care that he needs to keep him safe,” she said. “We shouldn’t have to have our sheriffs and police chiefs arresting folks because they can’t get the medicine they need for their mental health challenges.” Abrams’ opponent, Republican Secretary of State Brian Kemp, has staked out the opposite position on Medicaid expansion. In the first debate of the race, he warned that taking the federal funding would be the first step on a slippery slope to single-payer universal health care.“Ms. Abrams supports a government takeover of health care,” Kemp charged. “It’s a plan that will make your current insurance illegal. You will not be able to choose who your doctor is.”Kemp has also argued Georgia cannot afford to expand Medicaid. Even though the federal government will pick up 90 percent of the tab, the state would need to invest more than $200 million a year, according to the Robert Wood Johnson Foundation.“Republicans are taking a longer view of health-care costs, saying that while we may make money on Medicaid expansion in the first couple years, they’re worried about the years further out and the impact on the state budget,” said Jimmy Lewis, the CEO of Hometown Health, a rural hospital network in Georgia. “When you get entitlements to grow, they never shrink, and they could get out of control.”\nElections\n                    By RACHAEL BADE and JOHN BRESNAHANMost voters in the state, however, appear to agree with Abrams. A poll conducted earlier this year by the Atlanta Journal-Constitution found that 73 percent of Georgians want to expand Medicaid, including 51 percent of Republicans. An October poll by SurveyUSA found majorities in every age, gender, race and political affiliation favor expansion.The state of Georgia’s health care system may be fueling that sentiment.Eight rural hospitals have shut their doors in the last decade, and more than half of the state’s remaining ones are vulnerable, according to the National Rural Health Association. Sixty-three of the state's 159 counties lack a pediatrician, while nine have no doctor of any kind. One of the poorest counties in the state, desperate for access to a health care provider, recently dipped into its public school funding to open a clinic.“The situation is getting dire,” said Monty Veazey, president of the Georgia Alliance of Community Hospitals. “We have more and more uninsured people going into our ERs every year. One of our rural hospitals had to pay for $140 million in uncompensated care last year alone.”Veazey, a Democrat who previously served three terms in the Georgia House, said he believes Medicaid expansion would help tremendously. He pointed to the impact expansion has had in nearby Kentucky, where the rate of uninsured residents dropped to just over 5 percent, compared to Georgia’s 13.4 percent.“It’s the only thing that is going to keep hospitals from closing and give people access to health care,” he told POLITICO.Still, with at least one of Georgia’s legislative chambers likely to remain Republican and most GOP lawmakers hostile to the idea, Abrams will not be able to expand Medicaid “on Day 1,” as she has promised.Asked about that hurdle during a recent debate, Abrams said she was confident she could persuade skeptical officials.“I spent 11 years in the state legislature, seven as Democratic leader and I know how to work across the aisle,” she said, adding that if Vice President Mike Pence could embrace expansion while he was governor of Indiana, anything is possible. The state’s medical industry is less confident.“I think in the short term, they would remain opposed,” Veazy said of the GOP-controlled legislature. “They always bring up the money the state would have to put up, but there’s a stigma too. It’s an intangible attitude of, ‘We’re funding a population that[doesn’t] ... work. It’s another entitlement program.’” Other pro-expansion gubernatorial candidates could face similar roadblocks if they win their races.\nelections\n                    By MAGGIE SEVERNS and LORRAINE WOELLERTIn Wisconsin, where Democrats are on the cusp of unseating Gov. Scott Walker, Republican Assembly Speaker Robin Vos has already vowed to oppose any effort to expand Medicaid.But like Abrams, Democratic nominee Tony Evers, says he’s confident he can move the ball forward.“It’s easy … in the political time of an election to make comments like that,” Evers told POLITICO after a recent rally in Milwaukee. “I feel confident going forward we will be able to work with the legislature to make that happen. We have to get those resources, and we’re going to get it.\"Mandela Barnes, Wisconsin’s Democratic candidate for lieutenant governor, agreed, telling POLITICO, saying a decisive win in November would put pressure on Republicans to compromise.“There will be a mandate if we win this election that Medicaid expansion is the right way to go for this state, and Vos will have to deal with those consequences,” Barnes told reporters in Madison.Abrams and her allies have vowed to bring similar pressure to bear in Georgia if she wins.Tamika Middleton, a lead organizer of a cadre of home health care aides and other domestic workers that has mobilized for Abrams, told POLITICO she sees a major attitude shift toward taking federal funding to expand coverage.“We’re in such a health care crisis right now that they can no longer avoid the question,” she said. “We’re starting to see some cracks in the opposition to Medicaid expansion.”David Siders contributed to this report.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}