{"id": "  POLITICO Magazine\nDid Beto Blow It?\n", "paragraph": "The Friday Cover is POLITICO Magazine's email of the week's best, delivered to your inbox every Friday morning.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n                Chip Somodevilla/Getty Images\n2018\n                        Texas Republicans believe Ted Cruz was beatable — if only his opponent paid attention to them.\n                    By TIM ALBERTANovember 04, 2018In March 2017, a little-known Democratic congressman named Beto O’Rourke proposed something unusual to Will Hurd, a Republican colleague from a neighboring district: that they rent a car and embark on a 24-hour, 1,600-mile road trip from San Antonio to Washington. Their live-streamed odyssey wound up attracting blushing news coverage and evoking the bipartisan companionship of a bygone era. For Hurd, a pragmatic, swing-district moderate with numerous Democrats employed on his staff, the cross-aisle kumbaya was routine; few lawmakers hug the middle so tightly. For O’Rourke, the demonstration was less likely; he had done little to distinguish himself in the House of Representatives, and what reputation he owned was not that of a centrist. He won his congressional seat in 2012 by running to the left of an incumbent Democrat—a moderate Hispanic who warned voters of the El Paso councilman’s ultra-progressive policies—and spent the ensuing years compiling a safely liberal voting record.Two weeks later, however, the strategic rationale behind the bipartisan road trip was manifest. “Regardless of party or background or geography or any other difference that someone might want to highlight, we all have this in common,” O’Rourke said in announcing his candidacy for U.S. Senate. “We’re Americans. We’re Texans. We want what’s good for this state. We want what’s good for this country.” In running against Ted Cruz, a name and a political brand synonymous with brutal partisanship, O’Rourke would represent the antidote: comity instead of chaos, agreeability instead of animosity, decorum instead of demolition.Story Continued BelowIn selling a symbolic candidacy, the Hurd roadshow was foundationally essential. But it wasn’t enough. To score the biggest upset of 2018, O’Rourke would need a brand that reinforced his rejection of status quo politics. So he created one—a campaign that rejects corporate money, that avoids negative attacks, that refuses to employ pollsters or consultants. And it worked. By offering a cause rather than a candidacy, O’Rourke convinced America that a Texas Democrat could win statewide for the first time since 1994. A staggering $70 million flooded into his campaign. Celebrities came calling on a first-name basis. LeBron James made the black-and-white “Beto” signage famous. National reporters took turns deifying the skateboarding, punk-rocking congressman. And all the while, O’Rourke was flatlining. When Quinnipiac polled the race in April, after he clinched the Democratic nomination, he registered at 44 percent; in July, the same poll pegged him at 43 percent; it was 45 percent in September; and 46 percent in late October. Whenever the race has tightened, it’s due to Cruz dropping below 50 percent. In dozens of public and private surveys this cycle, O’Rourke has never broken 47 percent.\n                            O'Rourke greets supporters near a polling place on the first day of early voting on October 22, 2018 in Houston, Texas. | Loren Elliott/Getty ImagesSomewhere along the line, the rock-concert crowds and record-setting fundraising and JFK comparisons obscured a basic contradiction between Beto O’Rourke the national heartthrob and Beto O’Rourke the Texas heretic. While the coastal media’s narrative emphasized his appeals to common ground, framing him as an Obamaesque post-partisan figure, the candidate himself tacked unapologetically leftward. He endorsed Bernie Sanders’ \"Medicare for all\" plan. He called repeatedly for President Donald Trump’s impeachment—a position rejected by Nancy Pelosi, and nearly every other prominent Democrat in America, as futile and counterproductive. He flirted with the idea of abolishing Immigration and Customs Enforcement. He took these positions, and others, with a brash fearlessness that reinforced his superstardom in the eyes of the Democratic base nationwide. But it likely stunted his growth among a more important demographic: Texans.Over the past six months, I spoke with a host of Texas Republicans about the U.S. Senate race. Many of them dislike Cruz. Some of them privately hope he loses. And all of them are baffled by the disconnect between the superior branding of O’Rourke’s candidacy and what they see as the tactical malpractice of his campaign. In their view, Cruz is uniquely vulnerable, having alienated Texans of all ideological stripes with his first-term antics—and especially those affluent, college-educated suburbanites repelled by Trump. The senator has long lagged 10 to 15 points behind Governor Greg Abbott at the top of the ticket; Cruz’s internal modeling has consistently demonstrated there are several hundred thousand voters committed to Abbott but not to him. This is the paradox of the Texas Senate race: Though it’s clear a significant bloc of soft Republicans and conservative-leaning independents are open to rejecting the incumbent on Tuesday, it’s equally clear the challenger has done little to move them. The Quinnipiac poll in April showed O’Rourke pulling 6 percent of Republicans; by late October that number was 3 percent. And while there are signs to suggest he will win more votes than a traditional Democrat in the metropolitan areas of Dallas and Houston and San Antonio, O’Rourke is almost certain to underperform in the rural and exurban areas of the state.The campaign is a study in extreme contrasts: Cruz, the cartoonishly unlikeable conservative whose machine-like enterprise is run by a platoon of political gurus, versus O’Rourke, the obnoxiously likeable liberal whose garage-band effort is guided by gut instinct and raw emotion. Nothing is certain in such a volatile political climate, and there have been indications of a tightening race in the campaign’s final days. Cruz learned first-hand in 2016 that an organizational advantage doesn’t guarantee victory; O’Rourke can draw inspiration from Trump, of all people, in proving the pollsters wrong. If O’Rourke wins, he will have revealed a blueprint for animating the base and turning out new voters. But if he loses—as Texas insiders in both parties expect—the autopsies will speak of a strategically imbalanced campaign that did too much mobilizing and not enough persuading.“Despite all of Cruz’s problems—and there are plenty—here’s a guy who’s running around talking about Medicare for all, and impeaching Trump, and abolishing ICE. And it’s killing him,” Karl Rove, the former senior adviser to George W. Bush, told me in Austin this summer. “Even for people who dislike Cruz, impeaching Trump strikes many of them as terrible for the country. I’ve got friends and family members who may not vote for Cruz. They don’t like Cruz. But Beto isn’t contesting them. I mean, it’s just weird.”David Axelrod, the former senior adviser to President Barack Obama and Rove’s counterpart as the Democratic Party’s strategic elder statesman, said O’Rourke “has staked out some positions that are difficult positions for some of these voters in the middle to embrace,” adding, “I think one of the strengths of O’Rourke’s candidacy is that he hasn’t shaded his positions. But I acknowledge that may be a problem for some of these independent and moderate Republican voters and conservative Democrats.”Turning out base voters is job No. 1 for any campaign. But rallying Democrats against Cruz was never the difficult part of defeating him. In 2012, Cruz’s general election opponent, Paul Sadler, captured 41 percent of the vote despite having no name recognition and raising roughly $700,000 for the entire election. O’Rourke raised 54 times that amount in the third quarter alone. Yet if the polling holds up, O’Rourke stands to improve on Sadler’s showing by just 3 or 4 points.Maybe 45 percent is simply the ceiling for a Democrat in Texas. But this is overly simplistic. Trump won Tennessee by 26 points—nearly three times the margin of his Texas victory—and that state’s U.S. Senate race has been a dead heat, in large part because the Democrat, former governor Phil Bredesen, is selling a smartly packaged centrism. If O’Rourke loses, Texas might remember him for being singularly positioned to break that ceiling—running in an advantageous environment, against a damaged incumbent, bringing historic resources to bear, at a moment of cultural and demographic transition in the state—and failing to capitalize.“It’s the worst campaign I’ve ever run against—or it’s the most brilliant,\" Jeff Roe, Cruz’s chief strategist, told me. “He’s the best and worst opponent we could have faced. He energized the left and raised tons of money, but had no plan for how to spend it and no plan for building the sort of coalition needed for a Democrat to win in Texas. He ran an entire campaign without pursuing a single Republican vote.” (I reached out numerous times this fall to the O’Rourke campaign seeking an interview about their strategy; his spokesman, Chris Evans, told me after a recent debate in San Antonio that they were no longer talking to national media outlets.)Given his sudden star power and prodigious fundraising abilities, there is already considerable momentum behind the theory that O’Rourke could segue from a losing Senate candidate to a top-tier presidential contender. But with a debate beginning to rage inside the Democratic Party over how best to defeat Trump—galvanizing the left or recapturing the center—a lopsided loss in Texas could force O’Rourke to answer tough questions relating to ideology and strategy. What exactly, inquiring and envious Democratic minds will want to know, did he do with that $70 million? Why wasn’t he barraging persuadable Republicans with mail and phone calls and door knocks? Could he not identify them because of his campaign’s refusal to invest in polling and data analytics? Did he consciously avoid playing on their issues, determining it was more profitable for his political future to lose as a liberal than compete as a moderate? What was to be gained by calling for Trump’s impeachment? And what evidence exists of his appeal to the middle of the electorate?O’Rourke can’t be blamed for receiving media hype. He shouldn’t be penalized for hauling in historic sums of cash. And he didn’t ask to be vaulted into the 2020 presidential conversation. There is no disputing his intelligence, his magnetism, his earnestness. But elections are ultimately defined by wins and losses. Should O’Rourke suffer an anticlimactic defeat, given the fanfare surrounding his ascent, it will be fair to ask: Did the country’s best candidate run its worst campaign?***It was the perfect rebuttal to the perfect back-handed compliment. At the end of their first debate, in late September, the moderators asked Cruz and O’Rourke to compliment one another. O’Rourke observed that Cruz was a devoted father, saluting his public service at the expense of time with his young family. Cruz responded by praising O’Rourke as “passionate” and “energetic,” saying, “He believes in what he is fighting for.” He should have left it there. Instead, Cruz proceeded to compare O’Rourke to Bernie Sanders—ideologues who have crazy ideas, but who are “absolutely sincere” in believing them. “True to form,” O’Rourke said in disgust.The moment crystallized their stylistic divergence: Cruz, the smarmy, calculating bare-knuckle brawler, landing a low blow against O’Rourke, the sincere, fresh-faced romantic. But there was more to it. Beneath the senator’s characteristic lack of self-awareness, his comment about O’Rourke reflected a combination of admiration and relief. Cruz clearly sees a little bit of himself in his challenger—a scrappy underdog rejecting conventional wisdom and running to his party’s flank on every issue. The difference is that Cruz played this role as a conservative in a Republican primary, whereas O’Rourke is a Democrat in a general election. “Sincerity is rare in politics. And I’m a true believer as well,” Cruz told me following the debate. “Both Beto and I are fighting for principles and values we believe in. The difference is, the principles and values I’m fighting for are also the ones the vast majority of Texans support.”Hence the relief. Cruz always knew, coming off his dehumanizing defeat in the 2016 presidential race and heading into his Senate reelection, that Democrats would place a symbolic value on his scalp. He and his team braced for a challenge from the center. This is how Democrats win in red states—not by painting bold contrasts but by minimizing differences. So when O’Rourke entered the race, riding auspicious headlines from the Hurd road trip and preaching the politics of ceasefire, everything seemed to be on schedule. Until it wasn’t. \n                            Cruz and O'Rourke spar during a debate at McFarlin Auditorium at SMU on September 21, 2018 in Dallas, Texas. | Tom Fox-Pool/Getty ImagesAs his candidacy wore on, O’Rourke took ownership of positions further to the left—on guns, immigration, drug legalization—than anyone in either party expected. But he did so delicately, still elevating unifying thematic strokes over divisive policy specifics. Then came the Democratic primary in March. Despite being the de facto nominee, opposed by two unknowns who raised less than $10,000 between them, O’Rourke lost dozens of majority-minority counties to a 32-year-old “Berniecrat” with a Hispanic surname. The takeaway: He had work to do with the base.Instead of pivoting to the center, as spring gave way to summer, the Democratic nominee hardened his positions. Where he had once hedged on his endorsement of \"Medicare for all,\" O’Rourke began forcefully championing a single-payer system. Where he once avoided impeachment talk, O’Rourke reiterated, on the day he and Hurd received an award for civility in politics, that Trump should be removed from office. Where he once carefully straddled the border-security debate, O’Rourke said he was open to abolishing ICE if its duties could be assumed elsewhere.“Everything Beto did to define his campaign early on was about process and anti-corporatizing politics. It really wasn’t issue-based. It was about getting to every county in Texas, talking to people in small towns, hosting townhalls,” said James Aldrete, a Texas Democratic strategist who ran the Spanish-language media strategy for both Obama campaigns and for Hillary Clinton in 2016. As the campaign became more policy-heavy, Aldrete conceded, “He never made a political adjustment to reach out to the middle.”For Cruz, this was manna from heaven. The senator was vulnerable to a persuasion campaign—a contest predicated on mass movement of independents and soft partisans—and O’Rourke had once been poised to run one. Out of the gate, the challenger’s hustle to every one of Texas’ 254 counties had struck a brilliant contrast with the incumbent senator; Cruz had boasted of visiting all 99 Iowa counties when running for president yet hadn’t paid the same attention to his own state. The incumbent, having scrambled since 2016 to repair relations with the Texas business community and establish a more robust presence back home, spent this year campaigning not as a partisan warrior but as a productive legislator. When I followed him for a day in July, there was no talk of government shutdowns or ideological brinkmanship. The senator spoke primarily of the “federal benefits” his constituents were “entitled to” as part of the recovery from Hurricane Harvey. The Cruz of 2012 believed he was elected to burn down the system; the Cruz of 2018 believed his reelection hinged on being the system.All the while, O’Rourke hit populist, mostly nonpartisan notes wherever he went, refusing to go negative against Cruz. But it became increasingly evident that O’Rourke was running a mobilization campaign—seemingly convinced that his best shot was to light a fire on the left and attract historic numbers of new voters. This was apparent in his cultural speak as much as his policy positions. Perhaps the defining moment of the race—and the clearest evidence of an inverse relationship between national enthusiasm and Texas enthusiasm—came in late August at a Houston townhall. When an audience member expressed frustration with NFL players kneeling during the national anthem, asking O’Rourke whether he thought it was disrespectful, the candidate launched into an impassioned monologue reciting America’s history of racial injustice and nonviolent protests. “I can think of nothing more American,” he concluded, “than to peacefully stand up or take a knee for your rights anytime, anywhere, anyplace.”The video went viral, amassing some 50 million views to date. Athletes tweeted their support. Ellen DeGeneres invited O’Rourke on her show. Online fundraising went through the roof. And it was exactly what Cruz needed. His campaign’s internal polls had tightened. Around the time the video exploded online, Cruz had dropped into the mid-40s and the candidates were in a statistical tie for the first time. O’Rourke's response—to a question, it turns out, asked by Roe’s employee—provided just the cultural wedge issue Cruz needed. His team quickly brought in Tim Lee, a double-amputee Vietnam veteran, to tape attack ads. Airing first online and then on television, keeping the anthem story front-and-center for weeks in the Texas press, Lee says in the spots, “I gave two legs for this country. I’m unable to stand, but I sure expect you to stand for me when that national anthem is being played.”By the end of September, according to tracking numbers I reviewed, Cruz’s lead had ballooned back to double digits statewide—and O’Rourke’s support in the outbound areas of the state’s four major cities had plummeted. It seemed unfair: O’Rourke had been nuanced and eloquent in his response, saluting the military and emphasizing that people of goodwill could disagree on the matter, yet Cruz had seized on the final soundbite to paint him as a radical. But distinctions, not fairness, are the currency of a campaign—and the sharper those distinctions, the more primitive and oversimplified, the better. In the boiled-down shorthand of electoral politics, O’Rourke sided with minorities and national anthem protesters; Cruz sided with military members and the American flag.In Texas—for the time being, anyway—it’s not hard to tell which side has majority support.***The signs are everywhere. All across the Lone Star State, lining rural highways and dotting urban cityscapes, “BETO” is inescapable. Texas is dauntingly large, especially for a congressman from El Paso, so in lieu of a ground game O’Rourke’s campaign settled on a strategy of drowning the state in yard signs. For Republicans, the signs became bothersome to a point where some party officials confronted Cruz, both in Texas and in Washington, demanding to know why his campaign hadn’t made a similar effort. The answer—that Roe’s research showed yard signs have zero impact on election outcomes—proved insufficient. As his rival’s logo proliferated around the state, Cruz’s campaign eventually relented and began distributing lawn decor of its own.The black-and-white coloring of the O’Rourke insignia is thematically suiting—hip, futuristic, politically neutral—speaking to the campaign’s slick approach to marketing. The candidate’s online merchandise store offers some variations of the monochrome style. One is a colorful design, oranges and blues, targeting Hispanics: “Beto Por Texas.” Another is geared toward the LGBT community, with the standard “BETO” font splayed over a pride flag. But there is one curious oversight: Nothing in the store says, “Republicans for Beto.” When I searched that phrase online, I found a T-shirt on Amazon with a single review (three stars), as well as an unofficial Facebook page with 211 likes. That was it—no sanctioned apparel, no grassroots organization and certainly no coordinated effort on behalf of the campaign.Democrats in Texas swear that O’Rourke has made inroads with Republican voters. And strategists in both parties have told me that in several of Texas’ competitive, suburban-based congressional districts, O’Rourke’s candidacy has boosted Democratic challengers against GOP incumbents. Yet evidence of widespread defection of Republicans into his camp remains elusive. O’Rourke unwittingly played into this himself when, after months of citing his “lifelong Republican” mother as an example of Texas voters switching partisan allegiances, CNN reported that “Melissa O'Rourke has largely voted in Democratic primaries in Texas since 2000.”\n                            O'Rourke addresses supporters with a megaphone during a campaign rally in Mueller Lake Park on October 31, 2018 in Austin, Texas. | Chip Somodevilla/Getty ImagesThe O’Rourke campaign’s approach to winning self-identified Republicans is critical because they represent the biggest bloc of eligible voters in the state. That won’t always be the case. Much of the intrigue undergirding this campaign owes to the demographic changes engulfing Texas—not just the rising Latino share of the voting-age population, but the massive influx of young, educated liberals drawn to its big cities by the state’s booming job market. The assumption that a growing minority vote would imminently turn Texas blue, as it has other states, ignores the state’s history. Texas was unique in importing huge swaths of the Mexican middle class a century ago, and Latinos in the state have traditionally had higher incomes and education levels than in other states as a result. Combine this with the cultural conservatism of Texas and the state’s practice of electing diversity-embracing Republicans in the mold of George W. Bush, and its Latino population has not behaved politically like those in California or Arizona.As a result, Republicans have typically captured roughly 40 percent of the Latino vote in Texas. But that could change. Trump won just 34 percent there in 2016, and his perceived hostility toward the Hispanic community—warning of Mexican “rapists,” separating migrant families at the southern border, belittling a Mexican-born U.S. judge—could be reshaping its long-term views of the GOP, particularly among younger voters. Cruz is quick to distance himself from the president in this regard—“Donald Trump says many things I would not say”—and predicts he will take 40 percent of the Hispanic vote himself against O’Rourke. But the writing is on the wall. Even if eligible Latinos continue voting at lower rates than whites or blacks, their sheer numbers are making the math increasingly difficult for the GOP to surmount. “For Texas to stay red, Republicans have to do more to earn the votes of Hispanic voters,” Cruz told me. “Those demographic trends are undeniable.”What it means to “do more” depends on which Republican you ask. Hurd, a non-Spanish-speaking black Republican who has nonetheless built an outstanding brand in his majority-Hispanic district, told me last year that the future of Texas’ statewide elections will be won between the 40-yard lines; that a rapidly diversifying electorate will demand more from the GOP than hard-line ideological conservatism. Cruz smirked when I mentioned this. Sensing that Hurd’s point was about immigration policy, Cruz told me “the No. 1 priority for Hispanic voters is jobs.” He then took a moment to clarify that we were talking about his community. “I’m the first Hispanic U.S. senator ever to represent Texas,” he said.This is true. Which makes some of his decisions—allying with Trump on the border wall, palling around with race-baiting congressman Steve King, referring to illegal immigrants as “undocumented Democrats”—somewhat puzzling. Indeed, it is precisely Cruz’s identity that frames the Senate race in potentially Shakespearean terms. Could the Cuban-American tea party sensation who rose to national stardom on the gamble that Texans craved an uncompromising brand of conservatism become the first victim of the state’s shifting political landscape—and of the Hispanic community’s mobilization against Trump’s Republican Party?Probably not. O’Rourke has worked the Latino vote hard, spending millions of dollars in the past few weeks alone on Spanish-language television and radio ads. But between his underwhelming performance in the Democratic primary and the good-but-not-great indicators from early voting in October, Texas insiders believe he simply has too much ground to make up. There’s also the matter of his name. Cruz was widely mocked earlier in the cycle for drawing attention to the fact that O’Rourke is not Hispanic—that Beto is a nickname for Robert—when he was himself born Rafael. It was a cynical ploy, especially given Cruz’s broken bilingualism and O’Rourke’s fluent español. It was also a Machiavellian master stroke: Low-information Hispanic voters have a documented history of voting reflexively for candidates with Hispanic surnames, and Cruz, who suffers nothing among his own base for going by Ted instead of Rafael, knew that every story on the controversy would further inform the masses that O’Rourke is not, in fact, Hispanic.It was a telling episode in Texas’ demographics-driven new era of identity politics. After four consecutive presidential cycles of landslide double-digit victories, Republicans carried the state by 9 points in 2016—a smaller margin than in battleground Iowa—and there were red flags galore. Harris County, anchored by Houston and home to swelling populations of both Hispanics and college-educated whites, was carried by Clinton by 162,000 votes; in 2012, Obama beat Mitt Romney there by fewer than 600 votes. Harris, the state’s most populous county, has never been carried by a Texas Democrat in a non-presidential year. O’Rourke is expected to break that streak this November. And while it may not accompany a statewide victory, these trends in the Houston area—and in the other cities and sprawling suburbs around the state—portend a troubling future for Texas Republicans.“I’ve been here awhile. We were supposed to turn into a blue state by 2006. And then it was going to be 2012. And then 2018,” Rove told me. “I think we’ve got another 12 years. But we’d better get our act together, and that means fewer Ted Cruzes and more George W. Bushes.” Rove grinned. “Robert Francis O’Rourke is running as ‘Beto,’ and Rafael Cruz is running as ‘Ted,’” he said, shaking his head. “Only in Texas could we have the Anglo pretending to be Latino, and the Latino pretending to be Anglo.”***For political junkies, the homestretch in Texas has been as instructive as it has been entertaining. By mid-October, with Cruz’s lead holding steady and O’Rourke running out of time, the Democratic challenger came under enormous pressure to go on the offensive. As the incumbent pummeled his opponent with millions of dollars of attack ads, Democratic panic resembled the Republican freakout months earlier during the yard sign onslaught: Why aren’t you doing something about this? O’Rourke finally took the gloves off during a San Antonio debate, resurrecting Trump’s “Lyin’ Ted” caricature and jabbing the senator’s unsavory reputation in Washington. But within days O’Rourke expressed regret at his tactics, saying he never wanted to run a negative race. The episode highlighted both the upside and downside of O’Rourke’s approach to unseating Cruz. “On the one hand, you give him credit—he’s changing the game. No pollsters, no consultants,” Aldrete, the Democratic strategist, said. “But when you face millions of dollars in negative ads, do you have a process to push back? As they defined him, which I think they have, there were limitations in what he was able to do. But I give him credit for running the race he wants to run.”There is no doubt that O’Rourke has been defined. While his favorability numbers with Texas Democrats are sky-high, several recent polls showed him with the highest unfavorable rating of any politician in the state. Meanwhile, Cruz’s campaign has been unrelenting, rolling out a series of closing attack ads meant to step on the challenger’s neck. On paper, having raised $70 million—at least double what Cruz has accrued since the beginning of 2017—O’Rourke should have the resources to counter every negative Cruz spot with a positive one of his own. Yet that isn’t the case; while O’Rourke continues to pump historic amounts of money into digital advertising, primarily via Facebook, Cruz outspent him on television in the final two weeks of October. And, according to media-buy figures, Cruz is poised to outspend O’Rourke by nearly $1 million in the campaign’s final weeks.\n                            O'Rourke appears at a campaign rally at White Oak Music Hall on October 8, 2018 in Houston, Texas. | Loren Elliott/Getty ImagesStrategists in both parties seemed dumbfounded by this. An acceptable explanation would be that O’Rourke has dumped enormous resources elsewhere—a historic early-voting turnout operation aimed at Hispanics, perhaps. But nobody I spoke with on the ground had seen or heard of such an effort. O’Rourke has, over the past two months, spent millions of dollars on field programs. And Texas did see a considerable uptick in early voting among young people and Hispanics. But Cruz, Abbott and the state GOP have a stellar ground game of their own, and early-voting figures also spiked among whites, suggesting a high-turnout election across the board.For Cruz, that’s actually good news. His team’s forecast of total turnout has hovered between 6 million and 6.5 million, and they have yet to see a model in which O’Rourke hits 3 million votes—making it something of a “magic number” for Cruz. They expect to win 65 percent of whites and hope to hit 40 percent among Hispanics. (There could be an inverted relationship in his performance among the two groups: Cruz’s numbers dropped noticeably in the Houston area following his recent rally with Trump, consultants in both parties told me, but his numbers in the exurban and rural areas spiked in offsetting fashion.)\n\n                                                Politics\n\n                                            By Charlie Mahtesian\n\n                                                Swamp Diary \n\n                                            By Jack Shafer\n\n                                                Letter from Georgia \n\n                                            By Michael GrunwaldThe math for O’Rourke, Democrats acknowledge, is more complicated. He likely needs at least 13 percent of voters to be African-American, and has to win 90 percent of them; he needs at least 17 percent to be Latino, and win 65 percent of them; and then he needs to win 40 percent of white voters. This is not impossible; when Obama flipped Hispanic-heavy states such as Nevada and Colorado in 2008, the key was his breaking 40 percent among whites. The problem for O’Rourke is that white voters in Texas behave more like southern Republicans than western Republicans; many are culturally and politically programmed to lean right of center. In the event of a photo-finish defeat, O’Rourke’s failure to capture more of these voters would be the likely explanation.Texas Democrats I spoke with agreed that their nominee's struggle to persuade Republicans made winning difficult—if not impossible. But placing this election in the contextual sweep of the state’s modern history, they said the lasting sting of a loss would be felt in the Democratic Party’s continued inability to mobilize minority voters. “There needed to be more resources spent around Beto, more organization and more fundamental work done to turn out the base,” said Matt Angle, president of the Lone Star Project, a liberal activist group. “Beto has done a good job of energizing new [white] voters, but there’s an underlying Latino and African-American base here that could have been mobilized. If he loses a close race, I’ll look at that as the missed opportunity.”If he loses a race that’s not close, O’Rourke will be haunted by questions about his campaign operation—especially if he parlays his Senate candidacy into a presidential run. His skyrocketing name ID, personal dynamism and aspirational oratory would no doubt make him formidable in a packed 2020 primary field. There’s a reason that he’s drawing comparisons to Obama. “The policy stuff is important, and he’s definitely staked out positions on the left, but I think the reason people are responding to him has more to do with character, more to do with the positive nature of his presentation, a sense of inclusiveness,” Axelrod said. “I think Beto has in that sense touched a very important chord.”Still, I couldn’t help but recall a different conversation with Axelrod several years ago. This one was reflecting on Marco Rubio’s failed presidential campaign. His words serve as a reminder of the paramount importance of campaign mechanics—and, quite possibly, as a cautionary tale should Betomania migrate from Texas to Iowa.“When you have a candidate as charismatic as Rubio, the people around him buy into the cult of personality,” Axelrod told me. “You know, Barack Obama is a charismatic guy, but we also had a very detailed plan on how to get from A to B. If all we had done was rely on his charisma in Iowa and not built the greatest organization the state had ever seen, we would not have won the Iowa caucuses.”Tim Alberta is chief political correspondent at Politico Magazine.Swamp Diary \n\n                        By Jack Shafer\nThe Friday Cover\n\n                        By Keith Kloor\nPolitics\n\n                        By Derek Robertson\n\n © 2018 POLITICO LLC"}