{"id": "\n\n\n\nPOLITICO\n\n\nSen. Sherrod Brown weighing White House bid amid 'crescendo' of support\n", "paragraph": "\n                Democratic Sen. Sherrod Brown, a progressive who won reelection in a state that has otherwise trended Republican in recent years, said he believes his message appeals \"to Democrats, Republicans and independents.\" | Angelo Merendino/Getty Images\nElections\n                    By REBECCA MORIN11/12/2018 12:30 PM ESTDemocratic Sen. Sherrod Brown is considering a run for president in 2020, he told Cleveland.com in an interview on Monday, adding his name to a long list of potential challengers to President Donald Trump.Brown, who won reelection to a third term last week, told Cleveland.com that he has received an \"overwhelming\" number of requests to run for president. In a separate interview with the Columbus Dispatch, Brown said he's heard a “sort of a crescendo” of interest stemming from his wife Connie Schultz's Facebook page, in addition to a number of calls and emails.Story Continued Below“We’re hearing it increase, so we’re thinking about it as a result,” he told the Dispatch, but added “we’re not close to saying yes.”He said that he was going to discuss the prospect over the holidays with his family.\"This will very much be a family decision,\" Brown told Cleveland.com. \"It would affect a decade of our lives. It is a very personal, serious decision.\"Schultz, Brown's wife, confirmed in a post to Twitter that their family is discussing the possibility.Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\"We’re thinking about it,\" she wrote, along with sharing an article about Brown's possible 2020 candidacy. On Facebook, she also added: \"We are considering this because so many are urging us to. Your thoughts are welcome.\"Brown is one of many senators believed to be considering a presidential campaign, a group that also includes Sens. Elizabeth Warren (D-Mass.), Cory Booker (D-N.J.) and Kamala Harris (D-Calif.). Other Democrats, including former Vice President Joe Biden, attorney Michael Avenatti and Reps. Eric Swalwell (D-Calif.) and John Delaney (D-Md.) have also flirted with or already begun 2020 campaigns.Brown, a progressive who won reelection in a state that has otherwise trended Republican in recent years, said he believes his message appeals \"to Democrats, Republicans and independents\" and that his campaign message \"showed you can get votes by being authentic and standing up for workers.\"\nElection 2020\n                    By BRENT D. GRIFFITHS\"For a progressive to win a state Donald Trump carried by almost double digits by a pretty big margin tells me you can be a progressive, you can stand up for women's rights, gay rights and civil rights, and not compromise on these core values and still win in a state that Trump won decisively,\" Brown said.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}