{"id": "\n\n\n\nPOLITICO\n\nPOLITICO Playbook: Trump says Republicans would save Pelosi, Pelosi world says she'll win with DemsFollow us on TwitterSubscribe to the POLITICO Playbook family", "paragraph": "\n                                                            PoliticoPOLITICO's must-read briefing on what's driving the day in Washington Get the Playbook NewsletterBy signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.By  ANNA PALMER,  JAKE SHERMAN and  DANIEL LIPPMAN 11/17/2018 10:28 AM ESTPresented by\n                            House Minority Leader Nancy Pelosi leaves a news conference at the Capitol on Thursday. | J. Scott Applewhite/AP PhotoTHE PRESIDENT SAYS HE'LL HELP PELOSI -- @realDonaldTrump at 6:37 a.m.: “I can get Nancy Pelosi as many votes as she wants in order for her to be Speaker of the House. She deserves this victory, she has earned it -- but there are those in her party who are trying to take it away. She will win! @TomReedCongress”. -- TRUMP, via a pool report from from Linda Feldmann of the Christian Science Monitor: \"I’m not saying I'd get any [votes from] the super conservative side, but maybe I even get them from there. But I don’t imagine she’d need too many. But whatever number of votes she needs, if it's 50 or 10 or 2 or 1, she’s got em from [me], automatic. So tell her opposition, they’re wasting their time.” PELOSI RESPONDS ... DREW HAMMILL, Pelosi's deputy chief of staff: “Leader Pelosi will win the Speakership with Democratic votes.” -- ALSO ... ANY REPUBLICAN who votes for Pelosi would probably get a primary challenge. Kevin McCarthy -- who is flying with Trump to California today -- might have a different take on this. NOTES ON THE SPEAKER RACE … ONE OF THE NICE things about the Capitol is that reporters have the ability to go everywhere, and lawmakers truly can’t escape us. (Newly elected Democrats are getting accustomed to that). NANCY PELOSI’S office is connected to the Rayburn Room, a large space on the second floor of the Capitol -- and that’s where a bunch of the press corps was camped out yesterday afternoon. It allowed us to see practically everyone who walked into Pelosi’s office -- although they could escape through a back entrance on the way out. IT WAS AN INTERESTING scene. Pelosi had a rotating cast of lawmakers cycling in and out of the office all day. She would ask new lawmakers about their priorities, their districts and they emerged seemingly positive about their interactions with Pelosi. MIKIE SHERRILL, a Democrat who won the New Jersey seat held for decades by GOP Rep. Rodney Frelinghuysen, wouldn’t say a word about who she would vote for when she emerged from a meeting with Pelosi -- despite saying she was against Pelosi on the campaign trail. HALEY STEVENS, a Michigan Democrat, said she hasn’t said no to voting for Pelosi.ABIGAIL SPANBERGER, the Democrat who beat Virginia Rep. Dave Brat, said her conversation with Pelosi was positive, but she would be keeping her campaign promise and voting against her. -- LIZZIE FLETCHER, who beat longtime Texas Rep. John Culberson in Houston, came out in support of Pelosi. As did Katie Porter of California.IT SEEMED as if Pelosi was methodically hearing out everyone in the Democratic caucus. At around 3 p.m., the press corps asked Pelosi’s team how many more meetings she had. They said she would squeeze in another six meetings before the end of the day, before three evening events.Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.BEHIND THE SCENES ... PELOSI attended a Democracy Alliance event at the Capitol Hilton, where she was introduced as \"the original badass woman in Washington and the next speaker of the House.\" PELOSI on winning on health care -- “Two years ago after the election so many people were sad but we said, ‘we don’t agonize, we organize.’ And working together we did that. The very next day we had our conference call with the groups. By next Sunday and ever widening circle of friends, putting together how we would protect the Affordable Care Act.\"We made a plan to launch on Martin Luther King Weekend – which we did... The next day, the brightest day, in spontaneous, organic activism on Washington turned into a march around the world. Much of it focused on health care, women’s health care, family planning, lots of other issues as well – but all shared values. Women marched, and then they ran, and then they won.\"MEANWHILE, there has been a lot of chatter about a letter from 20 or so rebels saying they will not vote for Pelosi. That letter has yet to surface, and Pelosi continues to grind. No one knows how this will end up. -- WAPO’S MIKE DEBONIS on MASSACHUSETTS REP. SETH MOULTON: “Democratic Rep. Seth Moulton, the hard-charging Marine who served four tours of duty in Iraq is leading the challenge to Rep. Nancy Pelosi and her bid for speaker — and is suddenly taking incoming fire from all quarters.“Prominent liberal activists are openly floating a primary challenge to the two-term Massachusetts congressman, the instigator of the nearly 20 Democratic foes to Pelosi and one who helped recruit several of the incoming freshmen opposing her.“Outraged by the treatment of the first female House speaker, Pelosi’s backers have characterized the effort as a sexist putsch and urged calls to Moulton’s office as well as the other male Democratic opponents.“Inside the House, Moulton’s ambition and sharp elbows have long been a subject of his colleagues’ grumbling, and his latest fusillade at Pelosi — this time, after a sweeping electoral win — has angered even some of his admirers. … ‘Never took responsibility for anything, and that’s not what leaders do,’ he said. ‘A good selfless leader shares the credit for a win and owns mistakes.’” WaPoA message from Delta Air Lines:Connecting armed service members with their loved ones while they undergo treatment and recovery is a small way to say thank you to the men and women who bravely serve us. Learn more on how Delta is committed to supporting veterans, active service members and their families nationwide at DeltaTakingAction.com.SNEAK PEEK … PRESIDENT TRUMP on “FOX NEWS SUNDAY” with Chris Wallace: WALLACE: “A federal judge, who you appointed has just ruled that you must give CNN reporter Jim Acosta his press pass back. Your reaction to the ruling, sir.” TRUMP: “Yeah, it’s fine I mean it’s not a big deal. What they said though is that we have to create rules and regulations for conduct etc. etc. We’re doing that, were going to write them up right now. It’s not a big deal and if he misbehaves we’ll throw him out or we’ll stop the news conference.” WALLACE: “What are your rules going to be? What is it that you’re saying?” TRUMP: “They’re doing them now.” WALLACE: “‘This is over the line and you lose your press pass.’” TRUMP: “We’re writing them now. We’ll have rules of decorum you know you can’t keep asking questions. We had a lot of reporters in that room, many many reporters in that room and they were unable to ask questions because this guy gets up and starts you know doing what he’s supposed to be doing for him and for CNN and you know just shouting out questions and making statements too. But I will say this look, nobody believes in the First Amendment more than I do and if I think somebody is acting out of sorts I will leave I will say thank you very much everybody I appreciate you coming and I’ll leave. And those reporters will not be too friendly to whoever it is that’s acting up.”-- TRUMP on Veterans Day: WALLACE: “But here’s the question, you’re back in Washington on Monday, Veterans Day, why don’t you go across the river to Arlington for that ceremony? Barack Obama went every year he was here in D.C.” TRUMP: “I should have done that, I was extremely busy on calls for the country, we did a lot of calling as you know.” WALLACE: “But this is Veteran’s Day.” TRUMP: “I could have done that, as you know I just left the day before the American Cemetery and I probably think, and that was one where it was raining as hard as you can imagine and I made a speech at the American Cemetery the day before and I probably, you know, in retrospect I should have and I did last year and I will virtually every year. But we had come in very late at night and I had just left, literally, the American Cemetery in Paris and I really probably assumed that was fine and I was extremely busy because of affairs of state -- doing other things.” WALLACE: “Why…” TRUMP: “But I would have -- I would have done it.”TWO WAPO BOMBSHELLS … -- WAPO’S SHANE HARRIS, GREG MILLER and JOSH DAWSEY: “CIA concludes Saudi crown prince ordered Jamal Khashoggi’s assassination”: “The CIA has concluded that Saudi Crown Prince Mohammed bin Salman ordered the assassination of journalist Jamal Khashoggi in Istanbul last month, contradicting the Saudi government’s claims that he was not involved in the killing, according to people familiar with the matter. “The CIA’s assessment, in which officials have said they have high confidence, is the most definitive to date linking Mohammed to the operation and complicates the Trump administration’s efforts to preserve its relationship with a close ally. ...“In reaching its conclusions, the CIA examined multiple sources of intelligence, including a phone call that the prince’s brother Khalid bin Salman, the Saudi ambassador to the United States, had with Khashoggi, according to the people familiar with the matter who spoke on the condition of anonymity to discuss the intelligence. “Khalid told Khashoggi, a contributing columnist to The Washington Post, that he should go to the Saudi consulate in Istanbul to retrieve the documents and gave him assurances that it would be safe to do so. It is not clear if Khalid knew that Khashoggi would be killed, but he made the call at his brother’s direction, according to the people familiar with the call, which was intercepted by U.S. intelligence.” WaPo-- WAPO’S GREG MILLER and SOUAD MEKHENNET: “Woman says she married Khashoggi in ceremony kept secret from his fiancee and some in his family”: “An Egyptian woman says she married Saudi journalist Jamal Khashoggi in a religious ceremony in the United States this year, months before he was killed at a Saudi consulate in Turkey while seeking papers needed to marry a different woman. “The disclosure of the marriage, which Khashoggi appears to have kept hidden from his Turkish fiancee and even members of his family, adds to the complicated timeline of Khashoggi’s final months before he was killed by a team of Saudi assassins in October.“In an interview, the woman said she was coming forward to reveal her relationship with Khashoggi because ‘as a Muslim wife, I want my full right and to be recognized.’” WaPoMCCONNELL TO KUSHNER … THANKS, BUT NO THANKS … NYT’S NICK FANDOS and MAGGIE HABERMAN: “Senator Mitch McConnell told President Trump in a private meeting on Thursday that there is not likely to be enough time to bring a bipartisan criminal justice bill up for a vote this year, regardless of the support it has in the Senate and the White House, according to people familiar with the meeting. “Mr. McConnell, who as majority leader controls the Senate floor, delivered the news in a previously scheduled meeting at the White House convened to discuss the chamber’s legislative agenda for the remaining weeks of the term. Lawmakers from both parties have been working furiously to build support for the compromise legislation that would begin to reverse some of the tough-on-crime federal policies of the 1980s and 1990s that incarcerated African-American offenders at much higher rates than white offenders.” NYTELIANA JOHNSON: “John Kelly makes final bid to save Kirstjen Nielsen’s job”: “White House chief of staff John Kelly is fighting to save Kirstjen Nielsen, the Homeland Security chief at whom President Donald Trump has lashed out for the rise in border apprehensions over the past several months. Kelly, whose fate in the administration is also unclear, is working to convince the president that Nielsen is not to blame for a recent surge in arrests at the U.S.-Mexico border that has enraged him, according to two sources familiar with the conversations.“Nielsen also has other supporters, including Secretary of State Mike Pompeo, who have told Trump that Nielsen cannot control the border crossing rate. ... Kelly’s bid to save Nielsen may be motivated in part by an understanding that, with Nielsen gone, he would be almost completely isolated in an administration that several of his onetime allies have departed.” POLITICO THE INVESTIGATIONS … -- WAPO’S SPENCER HSU: “Maria Butina, alleged Russian agent who met with NRA and other groups, is in plea talks”: “Attorneys for a Russian woman jailed on charges of seeking to infiltrate the National Rifle Association and other American conservative groups for the Russian government are in negotiations with federal prosecutors, both sides said in a court filing Friday. Lawyers for Maria Butina, 29, and the U.S. attorney’s office for the District made the disclosure about talks over a potential plea agreement in a two-page filing that asked U.S. District Judge Tanya S. Chutkan to postpone a Dec. 6 court hearing by about two weeks.” WaPo TIM MILLER RESPONDS: “Setting the Record Straight Regarding My Facebook Work”PLAYBOOK METRO SECTION – “National Landing? In Amazon’s new neighborhood, a new and strange name,” by WaPo’s Steve Hendrix\nPHOTO DU JOUR: President Donald Trump boards Air Force One for a trip to visit areas impacted by the California wildfires on  Saturday at Andrews Air Force Base. | Evan Vucci/AP PhotoWRAPPING UP -- “Bill Nelson’s recount comeback hopes slip from slim to ‘virtually impossible’” -- Miami Herald: “Election Day has passed. More than 8 million votes have been counted (twice). And an unprecedented statewide manual recount is all but over. So, too, it seems, is Bill Nelson’s career in the U.S. Senate. Already clinging to the thinnest of reelection hopes, the Democrat’s fast-fading campaign took what appeared to be fatal blows Friday when two court rulings went against him and a manual recount across Florida’s 67 counties progressed smoothly and with little drama.” Miami Herald-- “Stacey Abrams’ defiant speech delights supporters, irks critics,” by Atlanta Journal-Constitution’s Tia Mitchell and Greg Bluestein: “Stacey Abrams chose to end her gubernatorial campaign the way she ran it: by bucking conventional wisdom. Where other losing candidates have been subdued and conciliatory, she was defiant and bold. … [S]he knew her critics would have wanted her to say nice things about Republican Brian Kemp, but she didn’t feel comfortable giving that kind of speech. ... “The Democrat wished Kemp well and said she will pray for his success as Georgia’s governor. But she also blasted his tenure as secretary of state and promised to remain vocal on the issues of election reform and voter suppression.” AJC-- “Rep. Mia Love jumps ahead of Ben McAdams by 419 votes after updates from Utah, Salt Lake counties,” by Salt Lake Tribune’s Benjamin WoodANNIE KARNI: “Another Trump aide tell-all due to hit shelves in January”: “Cliff Sims, a Trump adviser who joined the West Wing staff on Day One as a special assistant to the president after working on the campaign, is writing a memoir about his time working for the president. The book is set to be published in January, two sources familiar with the project said. ... Sims’ book, according to people familiar with the project, has been in the works for months and was described as a thoughtful and introspective portrayal of his time serving in the Trump White House.“The book is modeled, those people said, on George Stephanopoulos’ tell-all memoir ‘All Too Human,’ a personal account of his time serving as communications director in the Clinton White House. ... He’s also in competition with writers who are still telling the story from the inside out. The journalist Michael Wolff is also working on a sequel to his bestseller ‘Fire & Fury: Inside the Trump White House.’” POLITICOCLICKER – “The nation’s cartoonists on the week in politics,” edited by Matt Wuerker -- 12 funniesGREAT WEEKEND LISTEN FROM JAKE: Phish from 21 years ago today at McNichols Arena in Denver. The showGREAT WEEKEND READS, curated by Daniel Lippman:-- “How Podcasts Became a Seductive—and Sometimes Slippery—Mode of Storytelling,” by the New Yorker’s Rebecca Mead: “In our frenetic age, audio narratives offer a rare opportunity for slow immersion. But this intimacy can become manipulative.” New Yorker-- “Everyone Believed Larry Nassar,” by Kerry Howley in the Cut: “The predatory trainer may have just taken down USA Gymnastics. How did he deceive so many for so long?” The Cut (h/t Longform.org)-- “The Mystery of the Havana Syndrome,” by the New Yorker’s Adam Entous and Jon Lee Anderson: “Unexplained brain injuries afflicted dozens of American diplomats and spies. What happened?” New Yorker-- “Quitting Instagram: She’s one of the millions disillusioned with social media. But she also helped create it,” by WaPo’s Elizabeth Dwoskin: “Even in Silicon Valley, where it’s common to hear start-up workers become frustrated with management after an acquisition, the disillusionment of the early Instagram employees is striking: People seldom swear off or criticize the product they built, particularly when it has enjoyed such remarkable success. Instagram reached 1 billion users this year.” WaPo (h/t Longreads.com)-- “Surviving Jonestown,” by Jackie Speier in POLITICO Magazine in an excerpt of her new book “Undaunted: Surviving Jonestown, Summoning Courage, and Fighting Back”: “In 1978, I went to Guyana on a fact-finding mission. By the time I returned, more than 900 people died. I was almost one of them.” POLITICO Magazine … $14.95 on Amazon-- “Billionaire Democrat Tom Steyer on Impeaching Trump, Getting Out the Vote, and Winning in 2020,” by Rob Haskell in Vogue: “In 2007, Tom and Kat started a bank in Oakland, California, now called Beneficial, that is dedicated to serving low-income communities and supporting businesses that are committed to social justice and the environment. Kat serves as its CEO. But as this story went to press, Steyer called with some difficult news. He and Kat had decided that after 32 years of marriage, they were going to try living apart. They will, however, remain a family and work together on that dream of justice that consumes them both.” Vogue-- “Why Are Young People Having So Little Sex?” by Kate Julian on the cover of the December issue of The Atlantic: “Despite the easing of taboos and the rise of hookup apps, Americans are in the midst of a sex recession.” Atlantic-- “Chris Wallace is Fox News’s Man in the Middle,” by Andrew Goldman in the Dec./Jan. issue of Town and Country magazine: “[At an August 2015 GOP primary debate] Trump finished by needling Wallace with a familiar insult. ‘The great Mike Wallace was a friend of mine,’ Trump said. ‘He was a tough cookie and he was great. And the son is only a tiny action of Mike, believe me.’ If Trump’s comment ever stung him, Wallace is over it. ‘One of us has daddy issues, and it isn’t me,’ he says.” Town and Country-- “American Jews Face a Choice: Create Meaning or Fade Away,” by Gal Beckerman in the NYT: “To hear the professional worriers in the Jewish community, it’s love, not hate, that poses the bigger existential challenge. A vast majority of Jews — 72 percent among the non-Orthodox — now marry outside the tribe. The infrastructure of Judaism, from the synagogue to the long-established liberal denominations, is being steadily abandoned. Almost a third of millennial Jews are so unidentified with Judaism they say they have no religion at all.” NYT-- “How This All Happened,” by Morgan Housel in Collaborative Fund: “If you fell asleep in 1945 and woke up in 2018 you would not recognise the world. ... If you saw the level of wealth in New York and San Francisco, you’d be shocked. If you compared it to the poverty of Detroit, you’d be shocked. If you saw the price of homes, college tuition, and health care, you’d be shocked. Our politics would blow your mind.” Collaborative Fund (h/t TheBrowser.com)SPOTTED: Ret. Col. Oliver North attending a Friday evening performance of \"Anastasia\" at the Kennedy Center. SPOTTED at a cocktail party at the Metropolitan Club Friday night to welcome retired Navy Admiral Jim Stavridis (who is now with the Carlyle Group) and his wife Laura back to D.C. after a stint at Tufts: Susan Rice, Michele Flournoy, Richard Danzig, Jeremy Bash, Avril Haines, Stephen Preston, Martha Raddatz, Richard Burt, Robert Kimmitt, Bill Lynn, and Mack McLarty. TRANSITIONS … HOGAN GIDLEY has been promoted to principal deputy press secretary. He is currently deputy press secretary. WSJBIRTHWEEK (was yesterday): Madalene Milano, partner at GMMBBIRTHDAYS: Jarrod Agen, comms director and deputy chief of staff to Vice President Mike Pence, is 41 ... former House Speaker John Boehner is 69 ... Charmaine Yoest, associate director for the WH office of national drug control policy (hat tip: Hannah) ... NBC News president Noah Oppenheim … Susan Rice is 54 ... Lorne Michaels is 74 … Fox News’ Chris Stirewalt ... Paul Lindsay ... Arielle Mueller (h/t Olivia Perez Cubas) … Brian Jones, partner at Black Rock Group ... Howard Dean is 7-0 ... Sen. Jim Inhofe (R-Okla.) is 84 ... Sen. Pat Toomey (R-Pa.) is 57 … U.S. Amb. to China Terry Branstad is 72 (h/t Blake Waggoner) ... Quartz’s Chase Purdy ... Halie Soifer, executive director of the Jewish Democratic Council of America, is 4-0 (hubby tip: Andrew Kauders) ... Pennsylvania Gov. Tom Wolf is 7-0 ... Denver Peacock … Rick Dunham is 62 ... Mike Ricci … Alice Noah ...… Howard Fineman is 7-0 … Politico’s Helena Bottemiller Evich ... Jeff Watters of the Ocean Conservancy (h/t Samantha Bisogno) ... Isaac Baker, partner at AKPD ... Diana Aviv (h/t Jon Haber) ... Christy Osler … Harry Jaffe (h/t Cathy Merrill Williams) ... Lea Anne Foster ... WSJ’s Felicia Schwartz ... Ralph Posner … Martin Fackler … Chris Sloan … Anna Karl ... Kellie Boyle, partner at Boyle Public Affairs (hubby tip: Jim) … Lucas Fleischer ... Gordon Whiting ... Laurie Norton Moffatt ... Erika Compart ... Marty Reiser ... Russ Grote … Michele Tasoff ... Edelman’s Elisa Vitalo ... Alex Gallo ... Greg Croft … Carly Montoya … Owen Baynard … David Kurtz … Andrew Hinkebein ... Mike Defilippis ... Ada Waelder ... Michael Maloof ... Allison Hayward ... Michael Ostrolenk is 48 … Gary Duff ... Linda Moore (h/t Teresa Vilmain)THE SHOWS, by @MattMackowiak, filing from Austin:“Fox News Sunday”: President Donald Trump. Panel: Jason Chaffetz, Donna Edwards, Jerry Seib and Jonathan Swan“Meet the Press”: Sen. Sherrod Brown (D-Ohio) … Sen. Lindsey Graham (R-S.C.). Panel: Yamiche Alcindor, John Harwood, Hallie Jackson and Rich Lowry“This Week”: Rep. Adam Schiff (D-Calif.) … Sen. Roy Blunt (R-Mo.) … new Democrats in Congress panel: Reps.-elect Deb Haaland (D-N.M.), Chrissy Houlahan (D-Pa.), Donna Shalala (D-Fla.), Abigail Spanberger (D-Va.) and Lauren Underwood (D-Ill.) … panel: Chris Christie, Stephanie Cutter, Mary Jordan and Reihan Salam“State of the Union”: Sen. Jeff Flake (R-Ariz.) … new members of Congress panel: Reps.-elect Deb Haaland (D-N.M.), Dan Crenshaw (R-Texas) and Chrissy Houlahan (D-Pa.) … panel: Richard Ojeda, Michael Caputo, Amanda Carpenter and Karine Jean-Pierre“Face the Nation”: Sen. Rand Paul (R-Ky.)… Sen. Joni Ernst (R-Iowa.) … Rep. Elijah Cummings (D-Md.) ... new members of Congress panel: Reps.-elect Dan Crenshaw (R-Texas), Chrissy Houlahan (D-Pa.), Deb Haaland (D-N.M.) and Joe Neguse (D-Colo.) … panel: David Nakamura, Seung Min Kim, Paula Reid and Ed O’Keefe“Sunday Morning Futures”: Sen. Roy Blunt (R-Mo.) … Rep. Devin Nunes (R-Calif.). Panel: Maslansky + Partners president Lee Carter and Mark Penn“MediaBuzz”: Chris Wallace … Sara Fischer … Mo Elleithee … Emily Jashinsky … Gillian Turner“Inside Politics”: Michael Shear, Julie Davis, Kaitlin Collins and Sahil Kapur“Fareed Zakaria GPS”: Panel: Ian Bremmer, Kurt Campbell and Rana Foroohar… Peter Beinart and Democracy in Color founder Steve Phillips … Serbian prime minister Ana Brnabić“Reliable Sources”: Ted Boutrous … Sam Donaldson … Carl Bernstein and Chris Ruddy … Rappler CEO and executive editor Maria Ressa … New Knowledge director of research Renee DiResta“Al Punto”: Jésica Zermeño … panel: Rep.-elect Sylvia Garcia (D-Texas), Rep. Mario Diaz-Balart (R-Fla.), Rep. Salud Carbajal (D-Calif.) and Rep. Henry Cuellar (D-Texas) … Proceso Magazine’s Jesús Esquivel … singer Karol G“The Communicators”: FTC Commissioner Noah Phillips, questioned by John Hendel … “Newsmakers”: Rep. Peter DeFazio (D-Ore.), questioned by Tanya Snyder and Kellie Mejdrich … “Q&A”: author and Rep. Jackie Speier (D-Calif.)“Kasie DC”: Rep. Diana DeGette (D-Colo.) … Doris Kearns Goodwin … Michael Steele … Katty Kay … Jonathan Lemire … Betsy Woodruff … Sam Stein … Nick Confessore … Jackie Alemany“Mack on Politics” weekly politics podcast with Matt Mackowiak (download on iTunes, Google Play, or Stitcher or listen at MackOnPolitics.com): Deltapoll co-founder and director Joe Twyman (from London).A message from Delta Air Lines:Connecting armed service members with their family and loved ones while they undergo treatment and recovery through Delta’s SkyWish program is just a small way to say thank you to the men and women who bravely serve us. Over the past five years, Delta and its customers have donated 148 million miles to Fisher House and Luke’s Wings to provide air travel to wounded, injured, or ill service members, veterans and their families. Learn more on how Delta is committed to supporting veterans and active service members throughout the U.S. at DeltaTakingAction.com.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}