{"id": "\n\n\n\nPOLITICO\n\n\nSaudis confirm Khashoggi's death, claim he died in 'fist fight'\n", "paragraph": "\n                Saudi Arabia said it was questioning 18 Saudi nationals over Jamal Khashoggi's now confirmed death.\nForeign Policy \n                    By NAHAL TOOSI and BRENT D. GRIFFITHS10/19/2018 06:49 PM EDTSaudi Arabia confirmed on Saturday for the first time that Jamal Khashoggi died in the kingdom's consulate in Istanbul earlier this month, claiming that The Washington Post columnist‘s death came after an argument and a \"fist fight\" with men in the facility.The Arab state, which originally insisted Khashoggi had left its consulate alive, also has arrested 18 Saudi nationals suspected of involvement in Khashoggi’s death, according to its Foreign Ministry. Four top Saudi intelligence officials and a top royal adviser have been fired, apparently for their alleged connection to the episode.Story Continued BelowKhashoggi’s death has badly strained relations between Washington and Riyadh, both of whom view each other as key strategic allies. But the new Saudi announcements — which seemed to cast Khashoggi’s death as accidental — may not be enough to repair the damage, especially amid strong suspicions that the country’s powerful crown prince, Mohammed bin Salman, had a role in Khashoggi’s death.The crown prince appears to remain in the good graces of his father, King Salman. According to the announcements from Riyadh, the king has placed the crown prince in charge of a new ministerial committee designed to overhaul the rules, regulations and structure of the country’s primary intelligence apparatus.The fury over Khashoggi‘s death has been especially keen — and bipartisan — in Congress. Following the latest Saudi announcements, some Democrats and Republicans issued statements skeptical of the kingdom’s investigation so far.Sign up for our must-read newsletter on what's driving the afternoon in Washington.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.“To say that I am skeptical of the new Saudi narrative about Mr. Khashoggi is an understatement,” tweeted Republican Sen. Lindsey Graham of South Carolina. “First we were told Mr. Khashoggi supposedly left the consulate and there was blanket denial of any Saudi involvement. Now, a fight breaks out and he’s killed in the consulate, all without knowledge of Crown Prince. It’s hard to find this latest ‘explanation‘ as credible.\"Sen. Bob Corker (R-Tenn.), the top Republican on the Senate Foreign Relations Committee, said the Saudis' explanations have changed so much that \"we should not assume their latest story holds water.\" \"They can undergo their own investigation, but the U.S. administration must make its own independent, credible determination of responsibility for Khashoggi's murder,\" Corker said in a statement. President Donald Trump said Friday evening the Saudi announcement was \"a great first step,\" adding that he thought the statement was credible and he hadn't been lied to by Saudi leaders, according to pool reports. Trump had said earlier Friday that he believed Khashoggi was dead, despite the earlier Saudi denials. The Saudi government said the king had ordered a fuller report into what happened, due within a month.In a statement, the White House said it \"will continue to closely follow the international investigations into this tragic incident and advocate for justice that is timely, transparent, and in accordance with all due process.\"The State Department deferred comment to the White House.Some Saudi sources had earlier floated the possibility that the monarch and his aides would lay the blame at the feet of the country’s deputy intelligence chief, Ahmed Assiri. Some media reports out of the region Saturday indicated that Assiri had been fired. A highly influential adviser to the crown prince, Saud Al-Qahtani, was also reported to have been fired.Khashoggi was a 59-year-old veteran Saudi journalist living in the United States who had become increasingly critical of the Saudi government in recent years. In particular, he had been unhappy with the crown prince, whom he viewed as having authoritarian tendencies.Khashoggi entered the Saudi consulate in the Turkish city of Istanbul on Oct. 2 to get documents related to his hope to get remarried. His fiancee waited outside for him, but he never came back. \nForeign Policy\n                    By MARTIN MATISHAKIn the days that followed, Turkish intelligence and other sources released a series of well-timed leaks that made it clear the Turks believed Khashoggi’s death was no accident. Some U.S. intelligence agencies also are reported to have information strongly suggesting that the crown prince was involved in the plot that led to Khashoggi's death.According to the leaks from Turkey, a 15-member Saudi team had traveled to Turkey and was lying in wait for Khashoggi when he went to the consulate. It was not clear if any of the 15 men were among the 18 the Saudi government said it had arrested.Turkish media, citing unnamed sources, also reported that the Saudis dismembered Khashoggi’s body, having brought along a bone saw. Khashoggi’s remains have yet to be found.Secretary of State Mike Pompeo traveled to Saudi Arabia and Turkey earlier this week amid intensifying outrage. Afterward, he said the Saudis needed a few more days to do an investigation and figure out what happened.Trump himself has hesitated to be too critical of the Saudi government. Riyadh is a key partner in Trump’s desire to crack down on the Iranian regime. Trump also ruled out the possibility of stopping U.S. arms sales to the oil-rich Arab country, saying that would hurt American jobs. Trump was scheduled to speak at a rally later Friday.U.S. lawmakers have floated the possibility that if the Trump administration does not act, Congress can mete out its own punishment to the Saudi government, including imposing sanctions. The congressional anger over the Khashoggi case follows years of increasing unhappiness with the Saudis among U.S. lawmakers, many of whom are critics of the Saudi role in the war in Yemen.Califorina Rep. Adam Schiff, the ranking Democrat on the House Intelligence Committee, said in a statement that the new Saudi explanation is “not credible.”“If Khashoggi was fighting inside the Saudi consulate in Istanbul, he was fighting for his life with people sent to capture or kill him,” Schiff said. “The kingdom and all involved in this brutal murder must be held accountable, and if the Trump administration will not take the lead, Congress must.”In a statement issued Saturday, Washington Post publisher Fred Ryan demanded the Saudis release \"verifiable evidence\" of their claims, saying \"it is a coverup.\"Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}