{"id": "\n\n\n\nPOLITICO\n\n\nTrump, en route to California, says more missing in wildfires 'than anyone thought even possible'\n", "paragraph": "\n                President Donald Trump said he will be meeting Saturday with Gov. Jerry Brown, Gov.-elect Gavin Newsom and emergency workers across the state. | Jacquelyn Martin/AP Photo\nWhite House\n                    By QUINT FORGEY11/17/2018 09:16 AM ESTPresident Donald Trump previewed his trip to California with reporters at the White House on Saturday, lamenting the number of residents missing in the wake of multiple deadly wildfires that blazed across the state this week.“Many more people are missing than anyone thought even possible,” the president said. Story Continued BelowThe confirmed death toll of a single Northern California wildfire that razed the town of Paradise stands at 71, with the list of missing people rising to more than 1,000, authorities said Friday.Trump said he will be meeting Saturday with Gov. Jerry Brown, Gov.-elect Gavin Newsom and emergency workers across the state.“I want to be with the firefighters and the FEMA first responders,” Trump said, anticipating that he would likely be returning to the White House at 4 a.m. Sunday morning, “or something like that.”Our must-read briefing on politics and government in the Golden State.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.The president also hinted at some potentially confrontational discussions he might engage in Saturday with California’s elected leaders, including on the state’s forest management efforts.“I’ve been saying that for a long time this could have been a lot different situation, but the one thing is that everybody now knows that this is what we have to be doing, and there's no question about it,” Trump said. “It should have been done many years ago, but i think everybody's on the right side. It’s a big issue.”The president was widely criticized by state officials last week for a tweet in which he blamed the fires on California’s “gross mismanagement” of its forests and threatening to withhold federal funding from the state.“There is no reason for these massive, deadly and costly forest fires in California except that forest management is so poor,” Trump wrote online. “Billions of dollars are given each year, with so many lives lost, all because of gross mismanagement of the forests. Remedy now, or no more Fed payments!”Later Saturday, Trump tweeted: \"Heading to California with @GOPLeader Kevin McCarthy, @RepLaMalfa, and @KenCalvert. Look forward to being with our brave Firefighters, First Responders and @FEMA, along with the many brave People of California. We are with you all the way – God Bless you all!\"Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}