{"id": "\n\n\n\nPOLITICO\n\n\nCan Trump revoke birthright citizenship? Nearly all on left and right say no.\n", "paragraph": "\n                President Donald Trump indicated on Tuesday that the White House has determined he has the power to end birthright citizenship through an executive order. | AP Photo/Andrew Harnik\nWhite House \n                    By TED HESSON10/30/2018 02:09 PM EDT\n                    Updated 10/30/2018 03:26 PM EDTPresident Donald Trump’s proposal to use an executive order to deny birthright citizenship to babies born in the U.S. to non-citizens and undocumented immigrants has virtually no support from legal experts across the political spectrum.The 14th Amendment of the Constitution states: \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the state wherein they reside.\" A small group of mostly conservative legal scholars argue that Congress could revoke so-called birthright citizenship for undocumented immigrants. But Trump argued in an interview with Axios that he could revoke it by executive order.Story Continued BelowCourt decisions dating back to the late 1800s affirm the citizenship rights of children born to immigrants, which would make it even harder to enforce such an executive order.Nearly all legal experts accept that the amendment applies to nearly all children born on U.S. soil, according to Josh Blackman, a conservative constitutional law professor at the South Texas College of Law Houston.“This is not an issue where there’s a lot of disagreement,” Blackman said. If Trump issues an executive order, he said, “someone will challenge it in five seconds.”Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.A small contingent of legal scholars contend that the 14th amendment phrase “subject to the jurisdiction thereof” allows Congress to pass a law to rescind or restrict birthright citizenship, or allows courts to clarify the amendment’s scope. According to one argument — which most legal experts reject — the “jurisdiction” phrase excludes noncitizens because they can’t vote, serve on juries, or be tried for treason.But even backers of these approaches typically dismiss the idea that birthright citizenship can be eliminated by presidential fiat.Rogers Smith, a left-leaning University of Pennsylvania political science professor who specializes in constitutional law, has argued that the Constitution doesn't require that birthright citizenship be extended to undocumented individuals, and that Congress could pass a law denying it to them. But “I know of no remotely plausible legal theory,\" Smith said, \"under which the president has the power to decide birthright citizenship rules by executive order.\"“No one except the Trump White House thinks it’s a matter of executive discretion,” Smith told POLITICO in an email. “Trump’s announcement of this position a week before the election is clearly playing politics with people’s civic status and lives in the worst possible way.”The White House considered action on birthright citizenship a priority from the start of the administration, according to Jessica Vaughan, a policy director with the restrictionist Center for Immigration Studies, but first it needed to explore whether an executive order was feasible or preferable to legislation. The executive-order idea surfaced publicly in July in an op-ed by Michael Anton, a former spokesman for the National Security Council who left the Trump administration three months earlier.\"An executive order could specify to federal agencies that the children of noncitizens are not citizens,\" Anton wrote in July. \"Such an order would, of course, immediately be challenged in the courts. But officers in all three branches of government — the president no less than judges — take similar oaths to defend the Constitution. Why shouldn’t the president act to defend the clear meaning of the 14th Amendment?\"\nCongress \n                    By BURGESS EVERETT and CAITLIN OPRYSKOAnton, who doesn’t have a law degree, is a lecturer and research fellow at Hillsdale College, an institution with strong ties to the conservative movement. His op-ed was widely criticized from both left and right — a rebuke that he wrote about in a subsequent blog post that blasted anti-Trump conservatives.\"I did not expect self-described 'conservatives' to be just as hysterical as the Left,\" Anton wrote in the blog post, \"and to use precisely the same terms. 'Nativist.' 'Xenophobe.' 'Bigot.' 'Racist.' 'White nationalist.' 'White supremacist.' ... It’s an ugly thing to hear and read the worst of these epithets from ostensible allies.\"The bipartisan legal consensus in favor of the current understanding of birthright citizenship would make a Trump challenge unlikely to succeed, according to Gerard Magliocca, a professor at Indiana University Robert H. McKinney School of Law.“If this ever did reach the Supreme Court, you would get probably eight or nine votes to say it’s unconstitutional,” he said. “The liberal wing of the court won’t like it because they’re not going to like something like this generally. But the conservative wing of the court that believes in following the original meaning of the Constitution cannot possibly look at that and say anything other than, ‘Everyone born here is a citizen.’”The high court tackled birthright citizenship in the 1898 case United States v. Wong Kim Ark, which addressed whether a child born to Chinese parents now living in the U.S. would automatically be a citizen.The case dealt with legal immigration — at the time, there were no federal immigration laws to designate someone an undocumented immigrant — but the justices ruled the San Francisco-born Wong Kim Ark was a citizen.Aside from Native Americans born on tribal lands, the Supreme Court excluded only two groups: children of foreign diplomats and children of enemy occupiers, according to Stephen Legomsky, former chief counsel for U.S. Citizenship and Immigration Services during the Obama administration.“I expect that even the current Supreme Court will find this to be too great a stretch,” he said in a written statement.A 2011 poll by the Pew Research Center found Republicans split on whether to bar children of undocumented immigrants from obtaining citizenship. And Trump’s proposal — at least as it was reported this week — could apply to non-citizens in the country legally, too.“I don’t see this going anywhere,” said Blackman, the professor at the South Texas College of Law Houston. “I see this mostly a way to rally support with the election coming up in a few days.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}