{"id": "\n\n\n\nPOLITICO\n\n\nTulsi Gabbard weighing 2020 presidential bid\n", "paragraph": "\n                Rep. Tulsi Gabbard has distinguished herself with an anti-interventionist approach to foreign policy and the Middle East. | Alex Wong/Getty Images\nElections\n                    By ALEX THOMPSON 10/19/2018 05:02 PM EDTDemocratic Rep. Tulsi Gabbard of Hawaii is considering running for president in 2020, a source with direct knowledge of her deliberations told POLITICO.Rania Batrice, an adviser to the progressive congresswoman and deputy campaign manager on Bernie Sanders’ 2016 presidential campaign, has been putting out feelers for digital and speechwriting staff for Gabbard. One person approached about the positions say that 2020 wasn’t mentioned explicitly, but it was heavily implied. Story Continued BelowBatrice denied that the staffers are being hired for a presidential campaign. She did not dispute, however, that Gabbard is considering joining what’s expected to be a crowded field of Democratic presidential contenders.“I think everybody is focused on 2018, but we will see what happens after that,” Batrice said in an interview. “Someone like Tulsi, with her experience, is an important voice in the party and the country.” Top aides to Gabbard did not respond to multiple requests for comment.Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Amid the clamor of Trump headlines and focus on higher-profile candidates, Gabbard has been quietly making the traditional moves of a presidential candidate. She recently visited Iowa, where locals urged her to run for president, according to the Iowa City Press-Citizen. She keynoted a progressive gathering in New Hampshire in September. And she’s writing a book due out this spring titled, “Is Today the Day?: Not Another Political Memoir.”A 37-year-old Iraq War veteran, Gabbard won her House seat in 2012 and became the first Hindu to serve in Congress. She has distinguished herself with an anti-interventionist approach to foreign policy and the Middle East, and a progressive populist economic policy that has earned her praise from the likes of Sanders and former White House chief strategist Steve Bannon.Gabbard has also drawn controversy, which would surely become a factor in any presidential race. In 2017, she came under heavy criticism for meeting with Syrian dictator Bashar Assad and expressing skepticism that he was behind chemical attacks, urging caution over the use of military force. She also raised suspicion among progressives for meeting with president-elect Donald Trump during the presidential transition in 2016.But Gabbard became a darling of the left in 2016 when she resigned as a vice chair of the Democratic National Committee after fighting against a primary debate schedule that seemed designed to give Hillary Clinton an advantage. She was one of the first members of Congress to endorse Sanders.“There’s a very clear contrast and clear difference when it comes to our two Democratic candidates,” Gabbard said at the time, “and who will exercise good judgment” in matters of war.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}