{"id": "  POLITICO Magazine\nHow to Punish Saudi Arabia\n", "paragraph": "The Friday Cover is POLITICO Magazine's email of the week's best, delivered to your inbox every Friday morning.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n                Evan Vucci/AP Photo \nWashington and the World \n                        Sanctions are a blunt instrument. Here’s what the U.S. can do instead to hold Jamal Khashoggi’s killers accountable.\n                    By JARRETT BLANCOctober 19, 2018Saudi Arabia has now admitted that Jamal Khashoggi was murdered in the Saudi Consulate in Istanbul on October 2. The story: He was killed in a fistfight with 15 intelligence officials sent to interrogate him—a claim that is implausible and would not be exculpatory even if true.Americans are rightfully angry and rightfully mortified by the Trump administration’s limp response, with President Donald Trump repeating the king’s and crown prince’s “very strong” and total denials of foreknowledge and responsibility. On Friday night, he reportedly told reporters, “Well, I think it’s a good first step. It’s a big step. There’s a lot of people involved.” When asked if he found the Saudi explanation credible, he responded: “I do.”Story Continued BelowSenator Lindsey Graham summed up Capitol Hill’s view of the apparent assassination to Fox News, saying “I feel used and abused.” But when asked for solutions, Graham fell back to one of Congress’ favorite national security tools: “I know what I’m going to do. I’m going to sanction the hell out of Saudi Arabia.”Khashoggi’s murder demands a meaningful response from the United States. Washington has a responsibility to stand up for U.S. residents—Khashoggi, a longtime journalist, was living in Virginia—and an interest in standing up for the free press. But sanctions are a lazy and inadequate answer. Instead, the U.S. needs to distance itself from reckless Saudi policies. Trump has tools to do so. If he does not use them, it’s time for Congress to step up.Talk about sanctioning Saudi Arabia is focused on the Global Magnitsky Act, legislation that authorizes sanctions targeting individuals responsible for gross human rights abuses. In part, that is because the Trump administration has shown little appetite to hold autocrats to account, while Congress has a role in Magnitsky sanctions. Congress cannot force the executive to impose sanctions, but can embarrass it for choosing not to.The focus on Magnitsky is also an implicit acknowledgment that other broader sectoral or national sanctions are ill-suited to confronting Saudi Arabia. Saudis close to the government have threatened that oil production could be withheld in response to U.S. sanctions, leading to a price spike. This threat is easy to exaggerate. Saudi Arabia could drive up prices, but in the long term, the Saudis themselves would suffer most from wild fluctuations. Still, Saudi Arabia is much more integrated in and important to the world’s economy than previous targets of broad-based sanctions like Iran, Cuba, Myanmar or even Russia. Trying to isolate them would be difficult and ineffective, even if the Saudi oil weapon isn’t much of a threat.Neither Magnitsky sanctions nor broader economic sanctions are likely to be effective tools to change Saudi policies. If Magnitsky sanctions are used to target small fish like the suspects in the murder or a carefully selected official scapegoat, the sanctions may feel righteous, but they will achieve little. The House of Saud has plenty of ways to motivate its servants. Magnitsky sanctions could instead target the senior-most officials, perhaps even the crown prince himself, making them feel even more righteous, but as with national or sectoral sanctions, Saudi Arabia is just too big to be isolated this way. Also, like Russian oligarchs recently targeted for U.S. sanctions, Saudi leaders own such vast portfolios of international assets that even targeted sanctions are likely to have difficult-to-predict economic consequences. If the latest example of Russia sanctions causing disruption in the global market for aluminum are precedent, the U.S. will (and probably should) back down rather than suffer the consequences of sanctioning Saudi oligarchs without a clear understanding of their impact on the global economy.The bottom line: Sanctions will not work. Here are four things the U.S. should do instead:***Stop supporting the Saudi war in Yemen. The war in Yemen is where the Saudis are most exposed to U.S. leverage. It has been a senseless catastrophe. Ten thousand people have been killed and millions displaced, and it might lead to the worst famine in a century. The U.S. has, appallingly, provided direct support to Saudi Arabia under both Presidents Trump and Obama. Washington should take the opportunity to undo this awful complicity by withdrawing logistical and intelligence support.Step back from the Saudi-Iran regional conflict. Trump has an opportunity to rebalance his regional policy in the coming weeks. Post-nuclear deal sanctions come back in full force on November 4, but the administration has remained vague or contradictory on important details, such as whether it will grant sanctions exemptions for some oil sales or how it will work to make allowed humanitarian trade practical. By taking modestly less aggressive positions in the coming weeks, the U.S. could distance itself from another example of aggressive Saudi policy and reduce U.S. dependence on the Saudis for stabilizing oil markets as Iranian exports are reduced. A more moderate line would have ancillary benefits, as well, such as minimizing friction with European and Asian allies and reducing the harm done to Iranian civilians.Limit military cooperation. The relationship between the U.S. and Saudi security services is important and should not be severed, but it can be cooled. Arms sales can be more carefully scrutinized. Trump’s claims that this would damage the U.S. economy are silly—the Saudis bought about $9 billion in U.S. arms from 2013-17, during which time U.S. economic output exceeded $90 trillion. Just as important, the U.S. should independently identify the security units responsible for the Khashoggi murder and ensure that they are subject to strict vetting in line with so-called Leahy standards, which bar assistance to foreign military units credibly implicated in gross human rights violations.Distance America from Mohammed bin Salman’s excesses. The U.S. may not have a Saudi problem so much as it has a Mohammed bin Salman problem. Saudi Arabia’s crown prince is said to be calling the shots in Riyadh, but he is proving to be as brutal as he is reckless. Unfortunatey, Trump and Secretary of State Mike Pompeo made limiting the problem in that way much more difficult with their gushing embrace of the crown prince this week. It is still possible, though, to marginalize him by insisting on working through the king and other officials.***Here’s the bad news: Trump has given no indication that he’s interested in anything close to this level of accountability for Saudi Arabia. But Congress has options. Lawmakers can use their appropriations power to restrict U.S. support to the war in Yemen, withhold permission for arms sales and exercise their atrophied oversight muscles on other security cooperation.\n\n                                                2020\n\n                                            By Issac J. Bailey\n\n                                                Politics\n\n                                            By Theodore R. Johnson\n\n                                                Washington and the World \n\n                                            By Amy M. JaffeCongress can also conduct a transparent, bipartisan investigation of Trump’s financial relationship with Saudi Arabia. I do not know anything about Trump’s finances. But by looking into the question—regardless of whether there is anything nefarious to find—Congress would clearly signal that the Saudis cannot secure their relationship with the U.S. solely through the president but need to pay full attention to the deep and rapidly growing skepticism they encounter outside the White House.Riyadh knows how much it relies upon Washington for everything from security to economic modernization. And America still needs Saudi Arabia (albeit less than before, and less than it needs us). It is the swing producer that balances oil markets, and as the home of Islam’s two holiest sites, it is inevitably important to our national security.U.S. officials can send clear signals that this relationship is important to us, too, but its future depends on wise Saudi choices—not brutal and reckless ones.Jarrett Blanc is senior fellow at the Carnegie Endowment for International Peace and was the State Department coordinator for Iran nuclear implementation under President Obama.Swamp Diary \n\n                        By Jack Shafer\nThe Friday Cover\n\n                        By Keith Kloor\nPolitics\n\n                        By Derek Robertson\n\n © 2018 POLITICO LLC"}