{"id": "\n\n\n\nPOLITICO\n\n\nPoll: Democrats shouldn’t move to impeach Trump\n", "paragraph": "\n                According to a new POLITICO/Morning Consult poll, only 33 percent of registered voters support impeaching President Donald Trump. | Justin Sullivan/Getty Images\nPOLITICO/MORNING CONSULT POLL\n                    By STEVEN SHEPARD11/12/2018 04:00 PM ESTHalf of voters say the new Democratic-controlled House should not begin impeachment proceedings next year, according to a new POLITICO/Morning Consult poll.But even though overall public support for impeaching Trump is tepid (33 percent) and 51 percent don’t support impeachment, House Democrats could find themselves squeezed by a restive base: More than six-in-10 Democratic voters, 61 percent, want Congress to begin impeachment proceedings next year, while only 22 percent don’t want that.Story Continued BelowSupport is lacking among Republicans (8 percent) and independents (29 percent), however — and continued GOP control of the Senate after last week’s midterm elections means any impeachment effort is unlikely to result in Trump’s removal before the 2020 elections.The POLITICO/Morning Consult poll was conducted November 7-9 — in the immediate wake of last week’s midterm elections, in which Democrats won control of the House of Representatives while Republicans kept the majority in the Senate.Roughly half of voters, 49 percent, describe themselves as “excited” or “satisfied” that Democrats won the House majority — more than the 40 percent who say they are “angry” or “dissatisfied.”But voters render a split decision on continued GOP control of the Senate: 44 percent say they are “excited” or “satisfied,” and the same percentage are “angry” or “dissatisfied.”Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Only one-in-four voters, 25 percent, say Congress will work better now that control is divided between the parties — compared with 29 percent who say things will be worse, and 30 percent who say they will be about the same.Voters, overall, don’t support making Rep. Nancy Pelosi (D-Calif.) speaker of the House again: Only 26 percent say she should return as House speaker, while 46 percent say she should not. But among Democrats, it’s flipped: 48 percent say Pelosi should be made speaker, and 24 percent say she should not.The POLITICO/Morning Consult poll surveyed 1,952 registered voters and has a margin of error of plus or minus 2 percentage points.Morning Consult is a nonpartisan media and technology company that provides data-driven research and insights on politics, policy and business strategy.More details on the poll and its methodology can be found in these two documents — Toplines: https://politi.co/2RMVlkc | Crosstabs: https://politi.co/2Tb4819Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}