{"id": "\n\n\n\nPOLITICO\n\n\nGOP women battle to join Senate leadership\n", "paragraph": "\n                Sen. Joni Ernst (R-Iowa) is popular among other members of the “bear den” class that came in and flipped the Senate to Republicans. | Aaron P. Bernstein/Getty Images\nCongress\n                        Mitch McConnell is eager to add some diversity to his team.\n                    By BURGESS EVERETT11/04/2018 06:53 AM ESTMitch McConnell has wanted a woman on his leadership team for years. And next week he’s almost certain to get one, though not before a battle between a pair of his conference’s key female members.Two conservative GOP senators, Deb Fischer of Nebraska and Joni Ernst of Iowa, are vying for the No. 5 slot in party leadership. The winner of the competition for conference vice chairman will mark the first time a woman has joined the top rungs of Republican leadership since 2010 — and provide a bit of diversity to a caucus dominated by white men.Story Continued BelowThe race is expected to be close, putting the mostly male conference in an awkward position of choosing between two up-and-coming female members. Some Republican senators are trying to pick sides delicately, while others will simply vote on the secret ballot and never disclose which senator they favored.A daily play-by-play of congressional news in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Sen. Richard Shelby (R-Ala.) says he will support Fischer. Asked how he decided, he said it was because the Nebraskan asked him first.“You ever had friends and they’re running for something? You say, ‘God I love you.’ So it’s the first one” to ask, Shelby explained. “I told Joni the same thing. If you had asked me first, more than likely I would have said, ‘Sure, I’d help you.’ But [Fischer] happened to do it.”Neither senator has a clear edge, according to senators and Republicans familiar with the race, the first contested GOP leadership race since 2014. The campaign for the job has been ongoing since this summer but will enter a furious stretch after the midterm elections, with each senator looking to lock up the 26 or so votes needed to prevail in the Nov. 14 leadership elections.Each senator has a different style and different political considerations.\n                            Sen. Deb Fischer (R-Neb.) talks about tax reform flanked by fellow Republican Sen. John Thune (South Dakota). Thune is expected to move up in the party's leadership and Fischer is competing for the vice chairman slot to join the top ranks. | John Shinkle/POLITICOErnst is expected to face a tough reelection campaign in 2020, while Fischer is expected to win reelection handily on Tuesday. Ernst was elected in 2014 and is popular among other members of the “bear den” class that came in and flipped the Senate to Republicans. She also breaks with President Donald Trump’s rhetoric on occasion. Fischer is closer with more senior senators, and her messaging is more consistently in line with Trump's and GOP leaders.The opening is created by the Senate GOP’s leadership term limits, which will cast Majority Whip John Cornyn (R-Texas) out of his No. 2 position after the past three terms. That move is expected to allow Sen. John Thune (R-S.D.) to climb up to whip, John Barrasso of Wyoming to conference chair and Roy Blunt to policy committee chair. In turn, that would create an opening for the vice chair job, which is important for messaging and having a seat at the table with McConnell (R-Ky.).The Senate majority leader has been hoping to diversify his party’s elected leadership for years, aware that the image of six white men in front of the cameras each week doesn’t come across well, according to people close to him.The top five Senate Republicans, plus the National Republican Senatorial Committee chairman, generally attend weekly press conferences. The last woman in GOP leadership was Sen. Lisa Murkowski (R-Alaska), who stepped down from her role after losing her primary and didn’t return after winning reelection as a write-in candidate.The Senate as a whole has a record number of female senators, 23, with the possibility of adding more after Tuesday’s midterms. But Republicans have lagged behind Democrats: This Congress, just six of the 51 GOP senators are women.\nElections\n                    By DAVID SIDERS, ELANA SCHOR, JAMES ARKIN, DANIEL STRAUSS, CARLA MARINUCCI, STEVEN SHEPARD and TIM ALBERTAThe Democratic Caucus is not expected to see as significant a shakeup in leadership, according to Democratic aides and senators, although Sen. Catherine Cortez Masto (D-Nev.) is being courted by senators to run the Democratic Senatorial Campaign Committee.Cortez Masto won a tough election campaign in 2016 to replace former Sen. Harry Reid (D-Nev.) and would join several other Democratic women in the party’s leadership, including Patty Murray (D-Wash.) and Debbie Stabenow (D-Mich.), who serve in the third- and fourth-ranking leadership slots, respectively.The DSCC gig will be more plum than the NRSC job next cycle since Republicans will have roughly twice as many seats up for reelection. Democrats will be making a strong push to take back the chamber if they fall short on Tuesday, as expected, with vulnerable GOP seats in Arizona, Maine, Iowa, Colorado and North Carolina. Democrats will be mostly on offense in 2020, though the GOP is sure to try to oust Democratic Sen. Doug Jones of Alabama. Sen. Todd Young (R-Ind.) is the favorite to chair the NRSC, although some K Street backers are still hoping for Mitt Romney, who is favored to win a Senate seat in Utah on Tuesday. Romney is expected to be a key fundraiser for Republicans, though strategists say he can accomplish that role without chairing the committee.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}