{"id": "\n\n\n\nPOLITICO\n\n\nJohn Delaney expands Iowa 2020 footprint\n", "paragraph": "\n                With an expansive field of candidates already taking shape, Rep. John Delaney’s campaign is attempting to maintain the early toehold it has so far in Iowa.  | Charlie Neibergall/AP Photo \nElections \n                    By NATASHA KORECKI11/16/2018 07:41 PM ESTMaryland Congressman John Delaney is ramping up his Iowa operation, with plans to have 30 full-time staffers on the ground and up to eight offices opened by January, his campaign told POLITICO.Delaney was the first Democrat to announce his candidacy for president and has heavily invested in the first presidential state of Iowa, having already visited all 99 counties and run television ads in the state. Story Continued Below“We’re encouraged by what we are hearing on the ground across the state,” Delaney campaign spokeswoman Monica Biddix said Friday. “We want to build on our early efforts by ramping up the campaign with staff and offices.”Biddix said the campaign wants to expand its footprint in the state and “show up everywhere.”The race for 2020 starts now. Stay in the know. Follow our presidential election coverage.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.With an expansive field of candidates already taking shape, Delaney’s campaign is attempting to maintain the early toehold it has so far in Iowa. Even though Iowa’s competitive midterms saw a flurry of 2020 potential candidates come through, no campaign has held a more expansive presence so far than Delaney’s.The congressman has already aired seven different TV ads, spending nearly $1 million on TV advertising in Iowa alone. Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}