{"id": "\n\n\n\nPOLITICO\n\nCassidy hires former Pentagon official", "paragraph": "\n                                                            PoliticoIntelligence and analysis on lobbyingGet the POLITICO Influence NewsletterBy signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.10/30/2018 03:02 PM EDTWith David Beavers, Sarah Cammarata and Daniel LippmanCASSIDY ADDS FORMER PENTAGON OFFICIAL: Cassidy & Associates has hired Michael Johnson, a retired Army colonel and former Pentagon liaison to Congress, as a senior vice president. He plans to register as a lobbyist, according to the firm. Kai Anderson, the firm’s chief executive, said in a statement that Johnson would bolster the firm’s “national security and federal funding capabilities.” Cassidy lobbies on defense issues for dozens of clients, according to disclosure reports, including BAE Systems, Intel, Palantir, the University of Nebraska and Verizon.Story Continued BelowIN MEMORIAM: MICHAEL ADCOCK: Michael Adcock, a vice president and longtime lobbyist at Van Scoyoc Associates, died on Saturday after a long battle with cancer, according to the firm. He was 64. Stu Van Scoyoc, the firm’s founder, said in an interview that he’d first met Adcock on the Hill in the 1980s while Adcock was working for former Rep. Ronnie Flippo (D-Ala.), who represented Adcock’s home state. Adcock later worked for former Rep. Bud Cramer, another Alabama Democrat, before joining Van Scoyoc Associates. “He was one of the first people as we were growing the firm that I wanted to reach out to,” Van Scoyoc said. Adcock specialized in appropriations and health care work, lobbying for clients including his alma mater, the University of Alabama system.— Adcock was funny and personable, Van Scoyoc said, which were assets in his lobbying work. But he also loved going deep into the weeds researching the issues that mattered to his clients. “He was very nerdy, but most people never saw that side of him,” Van Scoyoc said. He’s survived by his wife, Cynthia Dodd Adcock; his daughters, Alexandra and Avery; and a son-in-law, Chris Ramanauskas. Donations can be made to a University of Alabama scholarship fund created in his name (which can be found here by typing “Adcock” into the search field.) The firm will match up to $12,500 in donations by its employees.Good afternoon, and welcome to PI. Come senators, congressmen, please heed the call. Send me your tips: tmeyer@politico.com. (You don’t have to be a member of Congress to send tips, of course.) You can also follow Marianne and me on Twitter: @theodoricmeyer and @marianne_levine.LAND O’LAKES WON’T BACK KING ANYMORE: In an unusual move, Land O’Lakes Inc. has vowed not to give to Rep. Steve King (R-Iowa) through its PAC anymore. The company made the announcement after Judd Legum, the author of the Popular Information newsletter and former editor-in-chief of ThinkProgress, tweeted on Monday morning that he couldn’t “get @LandOLakesInc to explain why it gave 2.5K to Steve King despite his history of racist comments and, recently, endorsing a white supremicist [sic] for mayor.” The tweet had been retweeted nearly 11,000 times as of Tuesday afternoon. (Legum also highlighted other companies that have supported King through their PACs, including AT&T, Berkshire Hathaway, Purina and Tyson Foods, as well as the American Bankers Association.)— “The Land O’Lakes, Inc. PAC has traditionally contributed to lawmakers of both parties that represent the communities where our members and employees live and work and are also on committees that oversee policies that directly impact our farmer owners,” the company said in a statement. “We take our civic responsibility seriously, want our contributions to be a positive force for good and also seek to ensure that recipients of our contributions uphold our company’s values. On that basis, we have determined that our PAC will no longer support Rep. Steve King moving forward.”— King’s association with far-right elements has drawn condemnations recently even from fellow Republicans. “Congressman Steve King’s recent comments, actions, and retweets are completely inappropriate,” Rep. Steve Stivers (R-Ohio), the chairman of the National Republican Congressional Committee, tweeted on Tuesday afternoon. “We must stand up against white supremacy and hate in all forms, and I strongly condemn this behavior.”Election day is almost here. Have you made your POLITICO Playbook Election Challenge picks yet? Don’t miss your chance to compete against the nation’s top political minds in the POLITICO Playbook Election Challenge by correctly picking the winning candidates in some of the most competitive House, Senate and gubernatorial races in the country. Win awesome prizes and eternal bragging rights. The contest closes at 6 a.m. on November 6. Sign up today. Visit politico.com/playbookelectionchallenge to play.HOHLT REPORTEDLY CONSIDERING RETIREMENT: “Richard F. Hohlt, a longtime lobbyist who has served on the President’s Commission on White House Fellowships since Trump appointed him to the post in June 2017, said in emails with the Center for Public Integrity that his upcoming 71st birthday has caused him to reconsider who he represents,” the Center for Public Integrity’s Sarah Kleiner and Lateshia Beachum report. “’I am currently in the process of reevaluating my representation, my participation, and retirement,’ Hohlt said in an email. Hohlt declined to speak by phone, and did not respond to questions about whether the apparent murder of Washington Post columnist Jamal Khashoggi by Saudi operatives in Turkey has contributed to his reassessment.” Hohlt is a registered lobbyist for the Saudi government. Full story.AFTER KHASHOGGI: Washington lobbyists aren’t the only ones rethinking their relationships with Saudi Arabia in the wake of Jamal Khashoggi’s murder. “U.S. colleges and universities have received more than $350 million from the Saudi government this decade, yet some are rethinking their arrangements in the wake of the killing of a journalist that has ignited a global uproar against the oil-rich nation,” The Associated Press’ Collin Binkley and Chad Day report. “The Associated Press analyzed federal data and found that at least $354 million from the Saudi government or institutions it controls has flowed to 37 American schools since 2011.” Full story.MEANWHILE, IN WASHINGTON STATE: “A ballot showdown that has pitted environmental grassroots activists, aided by billionaires like Bill Gates and Michael Bloomberg, against the oil industry will be decided Nov. 6 as Washington state decides whether it will become the first state to require polluters to pay a fee for their carbon pollution,” POLITICO’s Anthony Adragna reports. “The ballot initiative, known as I-1631, has attracted tens of millions of dollars in campaign spending and galvanized thousands of volunteers to support the effort that would be one of the most ambitious policies in the nation to reduce greenhouse gases — and its approval would send a loud message to the Trump administration that states are stepping in to take the lead on fighting climate change.” Full story.POLITICO Pro announces dedicated California coverage: On Nov. 7, there will be a new authority on California politics and policy. Just in time to help policy professionals and business leaders in the Golden State navigate the twists and turns of a new administration, POLITICO California Pro is the only tool that will arm you with a team of state-level experts. Learn more.JOBS REPORT— Porterfield, Fettig & Sears has hired Kelly McGrath as a director of government relations. She was previously a legislative assistant on the House Financial Services Committee’s capital markets subcommittee.— Katie Hughes is leaving CRC Public Relations. She plans to do part-time public relations work from home while spending more time with her young children.NoneBold Ocean LLC PAC (PAC)CGCN PAC (PAC)NoneHaka: RaytheonHoward Consulting Group, Inc: National Medal of Honor MuseumMurray, Montgomery & O'Donnell: El Paso Water Utilities\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}