{"id": "  POLITICO Magazine\nHow to Mute Trump’s Boombox\n", "paragraph": "The Friday Cover is POLITICO Magazine's email of the week's best, delivered to your inbox every Friday morning.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n                Nicholas Kamm/AFP/Getty Images\nFourth Estate\n                        It ain’t news when he says something that’s untrue or uninformed.\n                    By JACK SHAFEROctober 24, 2018The press gave primo coverage to Donald Trump’s outrageous utterances during the 2016 Republican presidential primaries because, well, he was a front-runner, and when front-runners speak, it’s news. After Trump secured the Republican nomination, the press gave similar notice to his tongue-wagging because—well, because it believes every trill and chirrup from a major-party nominee contains news value. Later, when Trump became president and the press continued to steer his tweets, White House lawn utterances, and MAGA-rally speeches onto Page 1, the justification for the saturation coverage was that no matter what strange noise flowed out of the president’s boombox, it was newsworthy and deserved ink and airtime. And here we are, 21 months into his presidency, and Trump still reaps maximum exposure every time he says something cruel, improbable, or daft. Take his weekend promise to bestow a 10 percent tax cut on middle-class Americans before the midterm elections. Congress is out of session and nobody on Capitol Hill or inside the administration knew anything about the proposal—making passage on Trump’s timetable impossible. But that didn’t prevent the press corps from placing all of its oars in the water and rowing hard to take first place in the race to prove the president’s pitch a fantasy.Story Continued BelowIt’s not that the press and Washington politicians aren’t on to Trump’s tricks. In March 2018, The Associated Press reported how members of his own party have learned to ignore “Trump’s policy whims, knowing whatever he says one day about guns, immigration or other complicated issues could well change by the next.” In its Wednesday edition, the Washington Post reprised this theme, calling the tax cut promise a Trump policy whim and pointed to other whims that come and go: a Space Force, a ban on transgenders in the military, a military parade through the streets of Washington. The president’s lack of follow-through on stuff like this indicates that his wish list is not to be taken seriously. All he desires is the momentary but deep attention of the nation. Having exploited the moment, he’s ready to advance to a new set of whims or attention-getting insults, and the press is all too ready to accompany him. In recent weeks, as Trump has effectively become his own press secretary in spur-of-the-moment pool sprays and bill signings, we’ve been treated to more incendiary comments from the nation’s biggest mouth. In the past, Trump has been candid about why he barks, blusters and fibs so aggressively. “I call it truthful hyperbole. It’s an innocent form of exaggeration—and a very effective form of promotion,” Trump wrote in The Art of the Deal.The rule that everything the president says is newsworthy was established in those days when presidents 1) were less omnipresent that Trump 2) were more circumspect in what they said and 3) in which there was no cable news. Nobody ever claimed that the president had a right to massive mindshare every time he opened his mouth, but that’s where we’ve landed. When Trump denounced kneeling NFL players—over whom he has no control—the press made a big deal out of it. When he claimed that “unknown Middle Easterners“ have joined the migrant caravans, we elevated it. When he described well-reported news stories as “fake news,” we gave it big play. But why? The press long ago established that Trump lies with such frequency that it might be easier to count the number of true statements he’s made than false ones. Like winter rain in Seattle, Trump’s lies, his incessant name-calling, and his baseless rabble-rousing have become so common they merit almost no recognition as “news.” I’m not suggesting that the press ignore Trump when he refers to the “Democrat mob” or makes off-the-cuff threats to impose new tariffs. Reporters should still record his remarks for analysis. But they should abandon the default news-sense setting that dictates that any Trumpian riff deserves top-news treatment. As I brainstormed this idea with my editor, I suggested that newspapers could run columns (buried inside the front section) titled “Shit Trump Says” that would list Trump’s arbitrary policy pitches and verbal berserking. My editor said, no, that would only encourage him to fill the column with the sort of vituperation that would make it destination reading. For once, my editor was right. The threshold for what constitutes news from Trump’s mouth should be reset. Unless his statements are true or his proposals have some chance of advancing, Trump’s loose talk belongs in concise and dismissive stories in the middle pages of the newspaper where we can skim them and move on. The press corps’ new motto should read: “Just because the president said it doesn’t mean it’s news.” Put the president’s boombox on mute.******Send concise and dismissive mail to Shafer.Politico@gmail.com. My email alerts pay no mind to my Twitter feed exhortations. My RSS feed dares the press to ignore it.Jack Shafer is Politico’s senior media writer.Swamp Diary \n\n                        By Jack Shafer\nThe Friday Cover\n\n                        By Keith Kloor\nPolitics\n\n                        By Derek Robertson\n\n © 2018 POLITICO LLC"}