{"id": "\n\n\n\nPOLITICO\n\n\nAbrams says Kemp will be next governor of Georgia, effectively conceding race\n", "paragraph": "\n                John Amis/AP Photo\nElections\n                    By DANIEL STRAUSS11/16/2018 05:33 PM ESTDemocrat Stacey Abrams announced Friday that Brian Kemp, her Republican opponent in the Georgia gubernatorial race, would be certified as governor. \"I acknowledge that former Secretary of State Brian Kemp will be certified as the victor in the 2018 gubernatorial election,\" Abrams said at a press conference Friday, effectively conceding that she lost the race. Story Continued BelowThe announcement comes more than a week after the November midterm elections when Kemp came out as the top vote-getter in the race. But Abrams refused to concede, arguing that there were outstanding votes that needed to be counted. Since then her campaign has filed legal challenges and pushed to have additional absentee and provisional ballots counted. That move lowered the margin of victory for Kemp but not by enough to trigger a runoff or recount. But Abrams also criticized Kemp's handling of the election as secretary of state and said her speech was not a normal concession of a fair election to an opponent. But Abrams still said she was dropping out. \"My assessment is the law allows no further viable remedy,\" Abrams said.Friday was the day all counties had to certify the election results.Since the Nov. 6 election, Abrams and her campaign argued that Kemp, through negligence or indirect moves as secretary of state, worked to suppress the vote for Abrams throughout the state. Abrams officials also argued that Kemp was not doing everything in his power to count every vote. \"Make no mistake, the former secretary of state was deliberate and intentional in his actions,\" Abrams said. \"I know that eight years of systemic disenfranchisement, disinvestment and incompetence had its desired effect on the electoral process in Georgia.\" After election night, the campaign filed multiple legal challenges to ensure absentee or provisional ballots were counted even if they came late in certain cases. The campaign also sued to extend certification deadlines for parts of the state. Abrams, in her speech, acknowledged that she could continue to fight the election results but said that would be counterproductive. \"Now, I could certainly bring a new case to keep this one contest alive, but I don't want to hold public office if I need to scheme my way into the post,\" Abrams said. \"Because the title of governor isn't nearly as important as our shared title. Voters.\" Abrams \"would probably be gov if it would have been a #fairfight. But here we are, we will #keepfightinig,\" Abrams' campaign manager Lauren Groh-Wargo tweeted after the press conference. \"Coming soon: all of this knowledge, analysis and info on what happened, collected by our staff and vols, will be poured into a major lawsuit to force reform.\" Since the election, Kemp and his team have been adamant that Abrams lost. In response to every lawsuit or criticism, Kemp’s team argued that he was the decisive victor and Abrams was just grandstanding. “Governor-elect Brian Kemp earned a clear and convincing victory on Election Day,” Kemp communications director Ryan Mahoney said in a statement on Friday. “The campaign is over and Kemp’s focus is on building a safer, stronger future for Georgia families. Radical Stacey Abrams is beyond desperate with her latest publicity stunt. Georgia voters made their decision at the ballot box. It’s time for Stacey Abrams to end her ridiculous temper tantrum and concede.” Throughout the race, critics including former President Jimmy Carter argued that Kemp had a conflict of interest as both a secretary of state and a candidate. But Kemp only stepped down from his official role after election night as he began his transition to governor. Abrams was one of the most high-profile Democratic statewide candidates in the 2018 cycle and quickly earned endorsements from major figures of the establishment and liberal wings of the Democratic Party. The thesis of Abrams' campaign was that Georgia had an untapped pool of Democratic voters, many of them nonwhite, that could be leveraged into a major statewide win and turn the state purple in elections to come. The race became a rallying point for the respective grassroots wings of the Republican and Democratic parties. Abrams became a favorite of Democratic moderates and liberals while Kemp, who didn't start out in the Republican primary as the frontrunner, earned a surprise endorsement from President Donald Trump. Kemp also built his reputation as secretary of state on being a voter-fraud hardliner. Abrams, prior to running for governor, founded a group aimed at registering new voters in Georgia. The two had seemed to be on a collision course in recent years. In the primary, Abrams was always the frontrunner and handily defeated her opponent, Stacey Evans, raising optimism that her campaign's focus on building a strong field apparatus earlier than most campaigns could work in a general election atmosphere even in a ruby-red state like Georgia. But on election night and even as the margin of Kemp's lead shrank, he always led Abrams by thousands of votes. Late Friday, Trump tweeted: \"Congratulations to Brian Kemp on becoming the new Governor of Georgia. Stacey Abrams fought brilliantly and hard - she will have a terrific political future! Brian was unrelenting and will become a great Governor for the truly Wonderful People of Georgia!\"Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}