{"id": "\n\n\n\nPOLITICO\n\n\nPence rejects any link between Trump's rhetoric and attacks\n", "paragraph": "\n                Vice President Mike Pence dismissed the notion that President Donald Trump has been stepping up immigration actions and rhetoric as a political ploy before the midterms.  | Brendan Smialowski/AFP/Getty Images\nWhite House\n                    By ELI OKUN10/30/2018 11:26 AM EDT\n                    Updated 10/30/2018 12:02 PM EDTVice President Mike Pence on Tuesday rejected any link between President Donald Trump’s rhetoric and recent hate crimes and political violence, saying “it’s important that we don’t connect those acts to the public debate.”At a POLITICO Playbook interview in Washington, Pence said this weekend’s Pittsburgh synagogue massacre and a spate of bombs sent to prominent Democrats and CNN were “evil,” but that the country needs to hold the perpetrators accountable without choking off free speech.Story Continued Below“We will not let violence or anti-Semitism take hold in the United States of America. We will condemn it wherever it rears its ugly head, and the president and I have done that forcefully,” Pence said.Trump has come under heavy criticism for his long history of inflammatory comments and a spike in hate crimes in America during his tenure. He has also received widespread attention for attacking unspecified media outlets as the \"enemy of the people.\"Pence, who as a member of Congress strongly supported a federal shield law to protect journalists, told Playbook that he and Trump believe “the only check on government power in real time is a free and independent press.”\nBut the vice president slammed what he sees as sensationalist coverage connecting Trump to violence, echoing comments the president made on Monday to Fox News' Laura Ingraham.“The headline in one major newspaper didn’t read, ‘Bomb threat, perpetrator captured,’ it actually made reference to President Trump in the headline, because this individual in some respect associated himself or was allegedly a supporter of ours,” Pence said. “Now, the president’s no more responsible for this person’s criminal behavior than Bernie Sanders was responsible for the man who opened fire on a Republican baseball team.”Pence also amplified the administration’s controversial remarks about the caravan of Central American migrants gradually making its way toward the U.S. southern border to seek asylum.Without providing specific evidence, Pence said the caravan had been organized by “left-wing groups, political organizations within Honduras. It was likely financed in part by Venezuela.” And he said law enforcement had told him the caravan includes Middle Easterners.Pence cast heavier deployments of the military to the border — as well as the idea floated by Trump this week of trying to undo the constitutional guarantee of birthright citizenship — as necessary responses to the “crisis on our southern border” and “a broken immigration system that’s being used by people who literally are exploiting vulnerable people.”And the vice president argued that people seeking to enter the country should do so legally, as his grandfather did at Ellis Island. (Seeking asylum at a port of entry is a legal method of entering the United States.)\nIn fact, border arrests this year are on par with numbers during the Obama administration and far below figures in the late 1990s and early 2000s.Pence dismissed the notion that Trump was stepping up immigration actions and rhetoric as a political ploy before the midterms. Asked about a fight in Congress over funding for a border wall in December, Pence said, “The two words the president most often uses are ‘We’ll see.’” But then he took a firmer stand: “We’re going to have that fight before Christmas arrives.”He also said he expected the “blue wave” that polls predict would crash into a “red wall” in next week’s midterm elections.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}