{"id": "\n\n\n\nPOLITICO\n\nKeene will lobby for Algeria", "paragraph": "\n                                                            PoliticoIntelligence and analysis on lobbyingGet the POLITICO Influence NewsletterBy signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.11/12/2018 03:38 PM ESTWith Daniel Lippman, David Beavers and Sarah CammarataKEENE WILL LOBBY FOR ALGERIA: David Keene, the former American Conservative Union chairman, has signed the Algerian government as a client through his firm, Keene Consulting. He’ll represent Algeria’s interests “in face-to-face, written and telephonic contacts with Members of Congress, Congressional staff, Executive Branch staff, and non-governmental decision-makers,” according to a disclosure filing. The filing appears to be Keene’s first registration through Keene Consulting, although he’s a longtime lobbyist. The contract lasts a year and is worth $30,000 a month. Keene did not immediately return a request for comment.Story Continued BelowBARCLAYS HIRES FOSTER CHIEF OF STAFF: From POLITICO’s Zachary Warmbrodt: “Barclays has hired Adam Elias, Rep. Bill Foster's chief of staff, to be its new head of federal government relations. Foster is a Democrat on the House Financial Services Committee. The hire is the latest expansion of the Barclays Washington office under the leadership of Brendan Reilly, who joined the bank from JPMorgan Chase early this year. Barclays recruited Federal Reserve veteran Anna Harrington in June to be its U.S. head of bank regulatory policy. Scott Shewcraft will be Foster's new chief of staff.” Barclays, which spent $90,000 on lobbying in the third quarter, also has Skadden, Arps, Slate, Meagher & Flom and Hogan Lovells on retainer, according to disclosure filings.Good afternoon, and welcome to PI.: Tips, tips, tips. Tell us the latest gossip you have on who is leaving the Hill and who is coming back: tmeyer@politico.com and mlevine@politico.com. You can also follow us on Twitter: @theodoricmeyer and @marianne_levine.APCO GIVES ITS TAKE ON HEALTH CARE AND THE MIDTERMS: APCO is out with an analysis about what the 2018 midterm elections could mean for health care — a policy area where many firms predict there could be compromise between Democrats and Republicans. “Democrats and the Trump administration have seized on the idea that drug prices are too high and that taking actions to lower them is good for the country, and perhaps more importantly, is good politics,” APCO writes. “Republicans in the House and Senate have not shown a great deal of enthusiasm for the administration’s Blueprint to Lower Drug Prices. ... Democrats on the other hand, are more than willing to try and use the hand of government to lower prices. And while Democrats have, so far, not been vocal supporters of the Trump plan, they have not completely dismissed it either. Therefore, there may be an opportunity to for the two sides to cooperate to a limited degree. But even a limited degree of cooperation is politically dicey for Democrats because providing Republicans with any victory on the drug price issue means it may be a less powerful issue for them in 2020.”GOP RUSHES TO MATCH DEM DONATIONS: “Mitch McConnell stood before a roomful of Republican donors on Wednesday night to thank them for their help in the midterms,” POLITICO’s Alex Isenstadt reports. “But the Senate leader also issued a dire warning: Democrats had just thumped them in the all-important online donor game, and the GOP badly needs to catch up. The heart of the problem, McConnell said at the event at party headquarters on Capitol Hill, is ActBlue. The Democratic fundraising tool funneled over $700 million in small donations to House and Senate candidates over the course of the 2018 campaign. The GOP leader said Republicans were getting swamped in the hunt for online givers and that he’d charged his political team with coming up with a solution to enable them to compete in 2020.— “McConnell’s push underscores the urgency confronting Republicans. In race after race, turbocharged liberal donors pumped cash into Democratic coffers — much of it through ActBlue, an easy-to-use site that allows givers to plug in their credit card information and send contributions to their candidate of choice with a click. Republicans have no such centralized fundraising platform. With the next campaign already on the horizon, Republicans view their online donor deficit — particularly acute in House races, but significant in Senate contests, too — as a primary obstacle.” Full story.TODAY’S NOTABLE FILINGS: : Rep.-elects Andy Levin (D-Mich.) and Lucy McBath (D-Ga.) set up leadership PACs. In lobbying news, Ceres Environmental hired McGuireWoods to lobby on the U.S. Army Corps of Engineers’ orders regarding Hurricane Michael disaster recovery.The voters have spoken. Now what do they expect from the new Congress? POLITICO and Morning Consult will host an exclusive hourlong webinar at 10 a.m. on Nov. 14 for a first look at new survey data that provide insight into how voters perceive the new Congress, what they want from it and how they see the 2020 landscape. Visit politico.com/webinar to register today.  TRUMP PROPERTIES RECEIVED $3.2 MILLION DURING MIDTERMS: “Campaigns and PACs spent at least $3.2 million at Trump-owned and branded properties throughout the two-year midterm election cycle, a CNN analysis of Federal Election Commission filings shows,” CNN’s David Wright and Aaron Kessler report. “And the total could rise after post-election financial reports are published by the commission. No single group spent more than the Republican National Committee, which spent at least $1.2 million at the properties since the start of 2017. About half of the RNC spending came in two installments -- $367,000 for travel expenses at Trump National Doral Miami in mid-June, after the group's spring meetings at the Florida club, and $222,000 for ‘venue rental and catering’ at Mar-A-Lago in March connected to fundraising events at the resort. Trump's own presidential reelection campaign was also among the groups spending the most at Trump properties throughout 2017 and 2018, despite not being on the ballot. The campaign has spent more than $950,000 at Trump properties since the start of 2017.” Full story.Join POLITICO on Nov. 14 for special editorial conversations at “The Salute to Military Spouses,” a half-day summit to raise awareness of the challenges and contributions of these unsung heroes. Journalists from POLITICO, the exclusive media partner of the summit, will provide firsthand insight and intelligence on timely political and policy issues facing the military and military spouses. Topics include “improving the financial stability of military families” and “using tech to tackle the high unemployment rate of military spouses.” RSVP here.ICYMI OVER THE WEEKEND: MIRIAM ADELSON TO RECEIVE PRESIDENTIAL MEDAL OF FREEDOM: “President Donald Trump is set to award the Presidential Medal of Freedom — the nation’s highest civilian honor — to the wife of one of the Republican Party’s most prominent patrons, the White House announced Saturday,” POLITICO’s Quint Forgey writes. “Miriam Adelson will receive the medal along with six other ‘distinguished individuals’ at a ceremony on Friday, the White House said. She is married to billionaire Las Vegas casino magnate and GOP megadonor Sheldon Adelson, who joined Trump for a watch party at the White House residence on Tuesday evening to monitor the incoming returns from the 2018 midterm elections. The Adelsons in recent months have emerged as the Republican Party’s biggest financial backers, contributing more than $113 million to GOP causes during the 2018 election cycle.” Full story.NEW MEMBERS MIXER, from POLITICO HUDDLE: “Samsung, Diageo and Spotify are hosting a first-of-its-kind mixer Friday for new members elected to Congress to connect with diverse applicants. Reps. Debbie Wasserman Schultz (D-Fla.) and Alma Adams (D-N.C.) are set to deliver remarks there. The mixer will offer an opportunity for potential Capitol Hill staffers to connect with hiring managers before the next session of Congress begins in January. RSVP here: http://bit.ly/2zLt6ey.” SPOTTED: At the CBC Institute’s 21st Century Council fourth quarter meeting in Seattle, according to a PI tipster : Reps. Bennie Thompson (D-Miss.); Cedric Richmond (D-La.); Marcia Fudge (D-Ohio); Gwen Moore (D-Wis.); Karen Bass (D-Calif.); and Alma Adams (D-N.C.); LaKeitha Anderson of RAI; Paul Brathwaite of Federal Street Strategies; Zoe Cadore of the American Petroleum Institute; Kwame Canty of Edison Electric; Courtney Christian and Ashley Hayes of PhRMA; Saul Hernandez of NCTA; Virgil Griffin of Pitney Bowes; Cory Horton of Entergy; Earle Jones of Comcast; Mike Mullen of NAB; Ashli Palmer of CVS; Phillip Wallace of Intellectual Ventures; and Lance Williams of BP.SPOTTED: At an '80s-themed birthday party hosted by Sean Kennedy of Airlines for America and Greg Selfridge in a Paris speakeasy for their spouses Ashley Kennedy and Tonya Fulkerson, of Fulkerson Kennedy & Co., according to a PI tipster: Heather McHugh  of Resolution Public Affairs, Raquel Welch  of Charter Communications, Dave Culver of DISCUS, Melissa Maxfield of Comcast-NBCUniversal, Dan Turrentine of H&R Block, Kim Kauffman of The Kauffman Group, Jessica Straus of the DISH Network, Diana Doukas of The Libra Group, Emorie Broemel of Viacom, Jeff Cohen of the Federation of American Hospitals, and Karen Kuhlman  of United Airlines.—  Christina Pearson has left Microsoft's Washington, D.C., office, where she was senior director of public affairs. Pearson has not announced what she will do next.— Alex Armstrong has started as a senior environmental communications director at Waxman Strategies. He previously was senior communications manager at Oceana. Nick Horowitz has also started as a senior director at Waxman. He most recently was account director at Racepoint Global.— Charles Spirtos has started at Portland Communications in D.C. as an account executive. He previously was communications fellow at the Democratic Attorneys General Association.Florida Votes Count (Rick Scott for Florida, NRSC)McSally Voter Integrity Fund (McSally for Senate Inc., NRSC)Raw Hope for Humanity Rising (super PAC)Allergy Associates PA Political Action Committee (PAC)Future Fund PAC (PAC)Arizona State AFL-CIO PAC (PAC)Safer and Stronger Communities PAC (leadership PAC: Lucy McBath)American Wounded Veterans PAC (super PAC)Repair the World PAC (leadership PAC: Andy Levin)Alpine Group, Inc.: Naismith Memorial Basketball Hall of FameCavarocchi Ruscio Dennis Associates, L.L.C.: American Society of Blood & Marrow TransplantationCommand Solutions, LLC: Crowell & Moring LLP on behalf of North Star MineralsMcGuireWoods Consulting (A Subsidiary of McGuireWoods LLP): Ceres EnvironmentalSachem Strategies: Coalesce, Inc.Sustainable Strategies DC: City of Frankfort, KYSustainable Strategies DC: City of Port St. Lucie, FLSustainable Strategies DC: City of Weirton, WVThe Smith-Free Group, LLC: East Kentucky Power Cooperative, Inc.The Smith-Free Group, LLC: Bryce CorporationvRide, Inc.: Vride Inc\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}