{"id": "\n\n\n\nPOLITICO\n\n\nStill hopeful of keeping House, Trump torches Democrats in the desert\n", "paragraph": "\n                President Donald Trump speaks to a crowd of supporters during a rally at the International Air Response facility on Friday in Mesa, Arizona. He is holding rallies in Arizona, Montana and Nevada, campaigning for Republican candidates running for the U.S. Senate.  | Ralph Freso/Getty Images\nWhite House\n                    By CHRISTOPHER CADELAGO and BRENT D. GRIFFITHS10/19/2018 11:39 PM EDT\n                    Updated 10/20/2018 12:22 AM EDTMESA, Ariz. – President Donald Trump took his flame-throwing stump speech to the desert Friday night, scorching Democrats in this key border state as weak on immigration and a reckless choice for voters in next month’s midterm elections.\"The Democrat Party has become too extreme and too dangerous to be trusted with power,\" Trump said during a rally in Mesa, Arizona, his second stop in a three-state swing to boost GOP Senate candidates against vulnerable Democrats.Story Continued BelowTrump was in Arizona to highlight the prospects of Republican Rep. Martha McSally, who is in a tight race with Rep. Kyrsten Sinema (D-Ariz.) to replace retiring Republican Sen. Jeff Flake.Trump has been telling aides and allies in recent days that he feels good about his party’s chances of not only picking up Senate seats, but maintaining control of the House, if everything breaks his way.The president’s cautious optimism that Republicans will defy history by keeping the number of losses in Congress’ lower chamber to a minimum is due in large part to what he views as his record of success, which he considers unmatched by any of his modern predecessors. One presidential adviser compared Trump’s reasoning to his attitude about fighting off Democratic-led impeachment — saying he feels like the job he’s done should insulate him from political punishment.Trump, more than a half-dozen of his advisers told POLITICO, is deeply skeptical of public polls showing anything approaching a blue wave election — in part because he personally experienced surveys predicting his doom during the 2016 campaign, before pulling out the upset over Hillary Clinton.Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.The president also sees his rallies as landscape-defining events that seep into the ground of states and districts — his views in this case shaped by polls in states like Montana, Indiana and North Dakota, as well as in close House districts where he believes his spirited campaign events and primary endorsements have been pivotal.“The president still has that magic to at least get people to show up to a rally. Now, can [the candidate] get people to show up to Election Day?” a Republican close to the president told POLITICO. “That’s the hope. That’s why we have them stand on the stage with the president.”“He puts his arm around them and says, ‘come out in November.’ That’s something President Obama didn’t do,” to the same degree, “and President Bush couldn’t do.”Internally, Trump has stressed the need to stay motivated and flexible — mostly avoiding engaging in talk about planning for losing, while opening a new messaging front in the final weeks before the midterms focused on Democrats’ treatment of Supreme Court Justice Brett Kavanaugh, the migrant caravan heading toward the U.S., law and order and common sense.“Democrats produce mobs,” he said in unveiling a new attack line that has drawn big cheers on the Western swing. “Republicans produce jobs.”In Arizona, Trump torched Sinema as a \"far-left extremist\" who protested American involvement in Afghanistan while McSally was fighting in combat. \"A vote for Kyrsten Sinema is a wasted vote, and more importantly, it is a dangerous vote if you don't want Schumer, cryin' Chuck, for [Nancy] Pelosi and Maxine Waters,\" Trump said, adding that a vote for McSally would be \"the second greatest vote you'll ever cast\" — the greatest being a vote for him.But hearkening back to lines from the 2016 campaign trail, he slammed \"bad hombres\" immigrating illegally to the U.S., later pointedly asking Hispanic attendees in the crowd whether they supported him or not.\"And catch and release, how about that? That's my favorite,\" Trump said of the practice of releasing undocumented immigrants detained at the border. \"Catch. You catch a damn killer. You catch a bad hombre. You catch a bad one.\"The president has seized on reports of a so-called \"caravan\" of Central American migrants, many of whom reportedly plan to seek asylum in the U.S., as fresh evidence that Democrats have failed to enact tough immigration policies like his long-proposed border wall. Repeating a favorite line of his, Trump said the notion that \"good people\" are coming across the border is simply untrue.Earlier in the day, he told reporters that “many of those people – a fairly big percentage, of those people, are criminals.”\"You think they're all wonderful people. You've got some bad people in those groups,\" Trump said. “You've got some tough people in those groups. And I'll tell you what, this country doesn't want them. OK?\"When pressed before the rally if he had any evidence that undocumented immigrants were bad people, specifically \"hardened people,\" Trump lashed out at the reporter.\"Oh, please. Please,\" Trump said, emphasizing that he did not say it applied to all immigrants. \"Don't be a baby. OK?\"Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}