{"id": "\n\n\n\nPOLITICO\n\nPublic universities seek to boost low-income enrollment, degree completion", "paragraph": "\n                                                            PoliticoA daily overview of education policy newsGet the Morning Education Newsletter By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.11/12/2018 10:00 AM ESTEditor's Note: This edition of Free Morning Education is published weekdays at 10 a.m. POLITICO Pro Education subscribers hold exclusive early access to the newsletter each morning at 6 a.m. To learn more about POLITICO Pro's comprehensive policy intelligence coverage, policy tools and services, click here. PUBLIC UNIVERSITIES START EFFORT TO BOOST COLLEGE ACCESS, COMPLETIONS: More than 100 public universities on Sunday unveiled what they said was the largest-ever drive aimed at improving college access – with a goal of awarding hundreds of thousands more degrees, especially to low-income students.Story Continued Below— The initiative, organized by the Association of Public and Land-grant Universities, includes 130 public universities and systems enrolling 3 million students — a third of whom receive Pell Grants. How it works: Schools will work in \"clusters\" of four to 12 institutions that will test ways to enroll more low-income students and get them to graduation.— The APLU says the goal is to create a \"playbook\" of reforms that can be adopted by a variety of colleges, including those with limited resources. Benjamin Wermund has more here.GOOD MONDAY MORNING AND WELCOME TO MORNING EDUCATION. Drop me a line with your tips and feedback: mstratford@politico.com or @mstratford. Share event listings: educalendar@politicopro.com. And follow us on Twitter: @Morning_Edu and @POLITICOPro.Join POLITICO on Nov. 14 for special editorial conversations at “The Salute to Military Spouses,” a half-day summit to raise awareness of the challenges and contributions of these unsung heroes. Journalists from POLITICO, the exclusive media partner of the summit, will provide firsthand insight and intelligence on timely political and policy issues facing the military and military spouses. Topics include “improving the financial stability of military families” and “using tech to tackle the high unemployment rate of military spouses.” RSVP here.NEW DATA ON VETERANS ELIGIBLE FOR STUDENT LOAN DISCHARGES: More than half of the veterans with disabilities whom the Education Department has identified as eligible to have their student loans canceled are already in default on their debt, according to new federal data.— The Education Department earlier this year identified more than 42,000 veterans who collectively owe more than $1 billion in federal student loans but are entitled to a discharge of that debt based on their “total and permanent disability.” That data was released to the advocacy group Veterans Education Success on Friday in response to a Freedom of Information Act request. Of the veterans identified, according to the data, more than 25,000 are already in default on their debt. — Education Secretary Betsy DeVos earlier this year announced plans to identify and inform veterans with disabilities that they’re eligible to have their federal student loans discharged. The Education Department matched its student loan records with disability records provided by the Department of Veterans Affairs – and sent customized letters explaining veterans’ rights to have their loans canceled. Veterans must sign and return an application in order to obtain the loan discharge.— But veterans’ groups and a bipartisan group of lawmakers on Capitol Hill have urged the Education Department to automatically provide the loan discharges, expressing concern about the paperwork burden, especially for veterans who are severely disabled.— The Education Department has previously said that it can’t automatically forgive the loans because of the potential tax consequences of the loan discharge. The Republican tax law, H.R. 1 (115), last year removed any federal tax liability associated with loans canceled through the program. But the department reiterated in its FOIA response on Friday that it’s still concerned about the “potential state tax implications” associated with the loan discharges.— Veterans Education Success and several other groups sent a letter to DeVos on Friday that suggests that the state tax issues are largely overblown, urging automatic loan cancellations with an opt-out option. “It is not fair to ask severely disabled veterans to have to complete paperwork, especially given that some catastrophic disabilities will interfere with their ability to complete the paperwork,” the groups wrote. Read the letter here.— Senate Democrats also sent a letter to DeVos on Friday, asking her to automatically discharge the loans. The letter, led by Sens. Patty Murray (D-Wash.) and Jack Reed (D-R.I.), also urges the department to address inadvertent data errors in the process for identifying disabled veterans. Read it here.TOP DEMOCRAT: I WON’T HAND OUT SUBPOENAS LIKE ‘CANDY ON HALLOWEEN’: The congressman likely to lead the bulk of House Democrats’ investigations into President Donald Trump’s administration cautioned today that he would use his subpoena powers sparingly, and work to advance issues that matter to everyday Americans, reports POLITICO’s Quint Forgey. Democrats have said that oversight of the Education Department and DeVos will be a priority in the coming Congress.— “I’m not going to be handing out subpoenas like somebody's handing out candy on Halloween,” Rep. Elijah Cummings (D-Md.) told host George Stephanopoulos on ABC’s “This Week. “If I have to use them, they will be used in a methodical way,“ he said, “and it must be in the public interest.” Read more. REPORT: STUDENT FRAUD CLAIM PROCESSING STALLS: The Trump administration’s processing of student fraud claims under the “borrower defense to repayment” provision of federal law has slowed further, according to The New York Times. The newspaper reported on Sunday that the Education Department does not have any employees who “are devoted full time to investigating” student claims, citing “three people familiar with the agency’s operations.” More here.TRUMP TOUTS SCHOOL CHOICE IN PROCLAMATION FOR EDUCATION WEEK: President Donald Trump touted his administration’s support for school choice policies and workforce training in a White House proclamation for “American Education Week,” which is celebrated this week. — Trump said that his administration is “protecting and expanding parents’ access to a wide range of high-quality educational choices, including effective public, charter, magnet, private, parochial, online, and homeschool options.” The message added that the administration is “committed to ensuring that America’s students and workers have access to education and job training that will equip them to compete and win in the global economy.” Read it here.— Losses pile up at student loan refinancing company SoFi as interest rates rise: The Wall Street Journal.— With Democratic wins, charter schools face a backlash in New York and other states: The New York Times.— Federal appeals court agrees that Texas owes federal government millions for special education: Texas Public Radio. — Audit finds school authorities in Utah failed to report teacher misconduct claims: The Associated Press.Follow the Pro Education team: @caitlinzemma (cemma@politico.com), @khefling (khefling@politico.com), @mstratford (mstratford@politico.com), @BenjaminEW (bwermund@politico.com), @MelLeonor_ (mleonor@politico.com) and @JaneNorman (jnorman@politico.com). \n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}