{"id": "\n\n\n\nPOLITICO\n\n\nPompeo not worried by North Korean 'rhetoric' ahead of New York talks\n", "paragraph": "\n                Secretary of State Mike Pompeo told Fox News: “I’m not worried about rhetoric. We’ve seen this as we go through negotiations.”  | Andrew Harnik/AP Photo\nDefense\n                    By DAVID BEAVERS11/04/2018 11:05 AM ESTWith denuclearization talks set to continue in New York, Secretary of State Mike Pompeo reiterated Sunday that the United States would offer no relief on North Korea sanctions until full denuclearization is achieved.Pressed by “Fox News Sunday” host Chris Wallace on his reaction to North Korea's threat to resume nuclear activity if the U.S. doesn’t remove economic sanctions, Pompeo dismissed it as “rhetoric.”Story Continued Below\"I’m not worried about rhetoric. We’ve seen this as we go through negotiations. Stray voltage happens to be all around us,” Pompeo said. “We’re very focused. We know with whom we’re negotiating. We know what their positions are. And President Trump’s made his position very clear: No economic relief until we have achieved our ultimate objective.”Pompeo said he would be meeting in New York this week with key North Korean officials as denuclearization discussions that started over the summer pick up.The secretary of State also touted progress made since the president met in June with North Korean leader Kim Jong Un in Singapore.Sign up for Morning Defense, a daily briefing on Washington's national security apparatus.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.“We haven’t had any missile tests. There’ve been no nuclear tests. We’ve had the returns of American remains. These are all good steps,\" Pompeo said.\"We’re continuing to negotiate with North Koreans,\" he added, \"to achieve what President Trump set out: the full denuclearization, verified by the United States, of the Korean Peninsula, and then a brighter future for the North Korean people.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}