{"id": "  POLITICO Magazine\nWeek 78: Will the Left Get Its Revenge on Assange?\n", "paragraph": "The Friday Cover is POLITICO Magazine's email of the week's best, delivered to your inbox every Friday morning.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n                Jack Taylor/Getty Images \nSwamp Diary \n                        A mysterious court filing hints the Wikileaks maestro, blamed by many for Hillary’s defeat, has already been secretly charged. But for what?\n                    By JACK SHAFERNovember 17, 2018Having conditioned the press corps to think that he loves nothing better than to spend his Fridays filing criminal indictments, special counsel Robert S. Mueller III had Washington reporters fidgeting all week long in the expectation that Roger Stone or Jerome Corsi or someone else connected to the scandal would get slapped in the kisser with criminal charges. Late on Thursday, news of a criminal indictment did bring joy to the press, but it wasn't what they expected at all. News dribbled out that—thanks to a clip-and-paste flub into a court filing by federal prosecutors—international man of mystery and WikiLeaks chief Julian Assange stands secretly charged with something or other.That something or other could be, take your pick, his role in 2010 in disseminating via WikiLeaks the diplomatic cables and other materials stolen by Chelsea Manning or for posting to his site the purloined Democratic Party emails in 2016. Or maybe both. Or who knows? The indictment was sealed in deference to the “needs of law enforcement,” the passage states, and “due to the sophistication of the defendant and the publicity of the case.” The news galvanized First Amendment Twitter. Flush with its temporary restraining order victory in the Jim Acosta affair, it rose to defend Assange even before anybody—outside the Department of Justice, that is—knew what crimes he’d been charged with. Story Continued BelowDuring his decade in the spotlight, Assange has hit the cardinal as well as the ordinal points on the public’s compass. He’s been lionized by the left as a truth-teller and savaged by the right as a traitor to the West. He’s cozied up to the Russians (his deputy helped ensconce whistleblower Edward Snowden safely in Moscow) but become a TV buddy of Fox News Channel talker Sean Hannity. Depending on his most recent performance, he’s denounced as a sociopath or celebrated as a savior. Who in the 21st century has forced so much sputtering indignation and flip-flopping? The prospect that he might soon appear in a U.S. courtroom and defend his deed is both chilling and thrilling to the journalists who have covered and sometimes abetted him. The Assange indictment doesn’t appear to be the product of Mueller’s investigation, but interest in Assange occupies a place of primacy in the Mueller investigation timeline. WikiLeaks posted the trove of emails allegedly stolen from Democrats during the campaign by previously indicted Russian intelligence officers, although Assange has consistently—and not very convincingly—denied that the Russians were the source of the emails. The nature of the connections among the Trump campaign team, WikiLeaks, and the Russian officers has been one of the mainstays of the Mueller probe. Stone, an unreliable witness if ever there was one, was an early Trump supporter who has both bragged about his intimate relationship with WikiLeaks and Assange and denied having an intimate relationship with the operation. He's also claimed intimate foreknowledge of the WikiLeaks dump of the emails and denied that he knew anything that wasn't public domain. Donald Trump Jr., the easy mark of the Trump campaign, has also dallied with WikiLeaks. President Donald Trump, of course, has been effusive in his praise for WikiLeaks, speaking of his “love” for the organization and its email dumps repeatedly during the presidential campaign. Using a criminal indictment to muscle Assange into telling all he knows about the provenance of the stolen emails and what part—if any—Trump and his campaign played in spreading them would track with standard federal prosecutor conduct. Assange, who appears to be on the verge of eviction (with his cat) from his safe space in the Ecuadorean Embassy in London, has long feared extradition to the United States on Espionage Act charges. Although the feds don't appear to have an open-and-shut case against him in the Manning or email affairs—he can cite legitimate First Amendment protections for much of his work—prosecutors might have secret dirt on him that would stick in court. Perhaps the indictment is part of a plea-deal scheme to extract from Assange everything he knows about the Russians in return for a light sentence for his “crimes.” Or maybe I’m wrong and this theory is just more Washington columnist fidgeting.The press corps wasn’t alone in its high anxiety this week. The president, who has reportedly spent the week completing the homework questions Mueller sent over to the White House, reached new heights of ferocity in his Twitter account, calling the “inner workings of the Mueller probe” a “total mess” and a “disgrace.” Who might have told him about the inner workings? Could it be our faux attorney general, Matthew Whitaker? If true, CNN reported, “that would raise concerns that Trump was possibly trying to interfere with the probe.” He wouldn't do that, would he?He would if he could. Meanwhile, former Roger Stone aide Andrew Miller is attempting to do what Trump dreams about. Miller is challenging a grand jury subpoena to testify by invoking the legal theory that Mueller's appointment to the position of special prosecutor was unconstitutional to begin with. (His argument boils down to this: Mueller has too much unaccountable power.) This dispute could stretch for months, further elongating the Mueller investigation until it's resolved. And my Politico colleagues reported this week that Mueller and Paul Manafort had pushed back to Nov. 26 the filing of a status report that precedes Manafort's sentencing. It’s safe to speculate that Manafort is still sharing information with Mueller. Rick Gates, who also plead guilty to Mueller charges, is likewise in sentencing limbo as he continues to talk. \n\n                                                History Dept.\n\n                                            By David Greenberg\n\n                                                The Friday Cover\n\n                                            By Keith Kloor\n\n                                                Politics\n\n                                            By Natasha KoreckiEverybody seems to be talking, even Trump himself, who said he has answered the special counsel’s questions but hasn’t turned them in yet. The latest cooperator is accused and jailed Russian agent Mariia Butina, who although not a target of the Mueller probe, appears to have roamed similar turf. In July, she was charged with having conspired against the United States as an agent directed by a high-level member of the Russian government. Now, Butina is working on a plea agreement with prosecutors according to court filings (previously she asked the court to dismiss the charges as “unconstitutional”). According to the Washington Post, Butina tried to cultivate “back-channel” relationships with the Republican Party’s 2016 presidential candidates and bridge build with the National Rifle Association in a way that would give Russian official access and influence over the party.“Silence is a weapon,” former FBI agent Ali Soufan told GQ, referencing the stealthy, no-nonsense tactics of his one-time boss, Mueller. Mueller’s disciplined silence has made intuiting his intentions impossible, so it doesn’t pay to speculate too long on whether he’s got Assange in his sights. But let’s say he did. Isn’t this the way he’d land the big fish that nobody else has been able to hook? ******How best to condition the press? Wind-sprints or beatings? Send your ideas via email to Shafer.Politico@gmail.com. My email alerts avoids dinner-party invitations by protesting they are unconstitutional. My Twitter feed usual invokes natural law in its refusals. My RSS feed never gets dinner-party invitations. Jack Shafer is Politico’s senior media writer.Swamp Diary \n\n                        By Jack Shafer\nThe Friday Cover\n\n                        By Keith Kloor\nPolitics\n\n                        By Derek Robertson\n\n © 2018 POLITICO LLC"}