{"id": "\n\n\n\nPOLITICO\n\n\nTrump launches early blame game on markets and the economy\n", "paragraph": "\n                President Donald Trump on Tuesday attributed recent stock market declines to the Fed’s campaign of rate hikes as well as fear over the midterm outlook. | Andrew Harnik/AP Photo \nWhite House \n                        The president looks to blame Democrats and the Fed for declines in the stock market. Analysts cite many other explanations.\n                    By BEN WHITE10/30/2018 05:10 PM EDTPresident Donald Trump is setting up a simple strategy if markets and the economy cool over the next two years: Blame Democrats and the Fed.In recent days, Trump and his senior advisers have repeatedly argued that recent turbulence in the stock market reflects investor fear that Democrats will retake the House in the midterm elections next week. “If you want your Stocks to go down, I strongly suggest voting Democrat,” Trump tweeted Tuesday. And he has repeatedly bashed the Federal Reserve in recent interviews for its modest campaign of rate hikes.Story Continued BelowThe Trump campaign’s closing ad of the midterm cycle — using footage from the 2008 financial crisis — suggests that handing power to Democrats would bring back sky-high unemployment. “I think election risk is a big part of this correction,” Larry Kudlow, Trump’s top economic adviser, said in an interview. “The market doesn’t want to see an overturning of the business tax cuts or the deregulation or the energy boom. Until this is settled, it’s going to be hard.”Economists and market analysts say these arguments bear little connection to reality.Instead, they note that the economy is following a pattern many predicted when Trump and Congress slashed corporate tax rates last year: a period of faster growth followed by a return to the pace of around 2 to 3 percent that has persisted for nearly a decade with annual deficits rising.Political intelligence on Washington and Wall Street — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Market analysts and traders also attribute much of the recent volatility in stock prices to fear over Trump’s bitter trade war with China and concern that corporate profits have hit their high point for the current economic expansion, which is now in its 10th year and approaching the longest expansion on record. Panic over Democratic gains in Congress does not rank high on the list of worries. “Markets aren't dumb. They can read the same polls as everybody else,” said Ian Shepherdson, chief economist at Pantheon Macroeconomics. “They know that at the moment there is a very high probability that Democrats will take the House. I think from a rational market perspective, that news is pretty much in the price at this point.\"Trump once again on Tuesday attributed recent stock market declines to the Fed’s campaign of rate hikes as well as fear over the midterm outlook. But the sharp decline that took place Monday afternoon directly followed a report that Trump could slap tariffs on an additional $260 billion of imports from China as soon as December. That would entail putting tariffs on just about everything the U.S. imports from China, from clothing to electronic goods. Tariffs on China currently at 10 percent are scheduled to rise to 25 percent in January unless a deal is struck. A reduction in exports in the third quarter dragged down overall economic growth by the largest amount in over three decades, adding to investor fear. Corporate earnings remain strong, but many large firms are now warning that tariffs on imports and exports threaten their long-term profits. That’s left markets concerned that the U.S. economy could be headed south, though not because of the Fed or Democrats. Instead, there is more concern in the recent report showing economic growth decelerated to a still strong 3.5 percent pace in the third quarter. In that reading, capital investment was up a disappointing 0.8 percent.\nWhite House\n                    By ALEX ISENSTADT“The worry you now have is you look at GDP and you have seen quite a surprising slowdown in capital expenditure,” said Torsten Slok, chief international economist at Deutsche Bank. “Maybe this slowdown is temporary. Or maybe there is something more worrisome going on, and the trade war could expand and we could be in a situation where we may have a more extended slowdown.” Trump’s comments about the stock market sinking under Democrats also contradict history. In every midterm cycle since 1946, the Standard & Poor’s 500 has risen in the year after the election, regardless of the partisan outcome. So the president’s claim doesn’t explain what’s going on in the stock market, which is now flat for 2018. In 2017, the first year of Trump’s tenure, the S&P rose about 23 percent. The president prefers to date the market rise to Election Day of 2016. Since then, the S&P is up 24 percent. (In the first year of President Barack Obama’s tenure, the market rose around 43 percent.) “I don’t think market volatility is all about the midterms,” said Steve Massocca, managing director at Webdush Equity Management. “If we get into a four-year, slug-it-out battle with the Chinese where they wait to see if a new president comes along, that’s not going to be good news.”Administration officials reject the idea that the third-quarter numbers suggest any real slowdown from the faster pace of business investment under Trump. White House Council of Economic Advisers Chairman Kevin Hassett noted in an interview that capital goods orders and shipments remain strong. “The story of the tax cuts is they cut the cost of capital, which should lead to higher capital spending,” he said. And Hassett rejected the idea that the economy is running on a tax-cut-infused sugar high. “If we continue to see a capital spending boom, then productivity goes up and wages go up, and you can sustain higher consumption because you increase supply. And all that can happen without causing runaway inflation.”\nWhite House\n                    By QUINT FORGEYEconomists are less convinced that the third-quarter slowdown was a one-time event. “In terms of business spending, I was a bit concerned about that,” said Beth Ann Bovino, chief U.S. economist at S&P Global. “You do have to say, ‘It’s one quarter, and let’s see what happens.’ But it’s worth watching particularly what happens with equipment spending.” On the Fed, economists say the central bank is doing exactly what it should be doing — especially with unemployment near historical lows, inflation running near the Fed’s 2 percent target and tariffs running the risk of driving up consumer prices at a faster pace. This makes Trump’s bashing of the central bank look more like scapegoating.“We have 2 percent interest rates and 2 percent inflation, so real interest rates are zero,” said Shepherdson. “I could quite happily make the case that they are actually a little bit behind. You can’t wait until inflation pokes you in the eye before you do something about it.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}