{"id": "  POLITICO Magazine\nForget Pelosi. Challenge Hoyer.\n", "paragraph": "The Friday Cover is POLITICO Magazine's email of the week's best, delivered to your inbox every Friday morning.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n                AP Photo/Jacquelyn Martin\nCongress\n                        It would be folly to dislodge the once and future speaker. If they want fresh blood in party leadership, Democrats should replace her deputy instead.\n                    By BILL SCHERNovember 12, 2018Enough newly elected and incumbent House Democrats have expressed opposition to returning the speaker’s gavel to Rep. Nancy Pelosi to make things interesting. It may be unlikely, but the possibility exists that they can persuade enough Democrats to support an alternative in next month’s party caucus vote or, if that fails, deny Pelosi a victory on the House floor. But any serious attempt to oust Pelosi would be brutal and divisive, potentially harming the ability of Democrats to maintain a unified front against the Trump administration. Moreover, Pelosi is one of the most ruthless and effective politicians of her generation. Not only should critics worry about the consequences of losing to her, they should also worry about the consequences of replacing a skilled, experienced tactical leader with an amateur. Story Continued BelowSo what should restless Democrats hungering for “new leadership” in the House do instead? Skip Pelosi. Challenge Steny Hoyer.The Maryland congressman has long been the No. 2 in the House Democratic Caucus, and is positioned to be the next majority leader. At 79, he’s a year older than Pelosi. He has been rivals with her—losing a 2002 contest against her for whip and then, upon her initial ascension to speaker, defeating her preferred candidate for majority leader. But they have since maintained a working relationship. Many Democratic members of Congress have appreciated Hoyer’s tireless fundraising efforts, traveling this election cycle to 134 congressional districts, including critical battlegrounds in Republican-leaning areas. He has also irritated progressive activists , however, by advocating for fiscal restraint of Social Security and Medicare, chiding protesters for confrontational tactics and pressuring left-wing candidates to bow out of swing-district House races.\nDislodging Pelosi is difficult in part because as the first woman to be speaker, she is a historic figure with loyal supporters, both inside the Capitol, among the donor class and across the country. There’s also the argument that since Democrats won back the House, she can’t have been much of a drag on the ballot after all. Unceremoniously tossing her out would stoke anger among some Democrats, both of pragmatic and progressive stripes. Not to mention that she’s a master vote-counter, and anyone seeking to unseat her would have to contend with her intimate knowledge of the needs and wants of her caucus. Dumping Hoyer does not present the same risk. More important, for whoever has the gumption to take him on, by jumping the line to become majority leader cues one up to become speaker upon Pelosi’s eventual retirement, which she has already signaled won’t be too far off.But isn’t Pelosi a terrible standard-bearer for the Democratic Party? Wasn’t she a magnet for Republican attacks this year? Wouldn’t insurgent Democrats be doing their party a favor by taking on the burden of forcing out Pelosi, removing the political dead weight and presenting a fresh face for 2020?First, let’s gauge how effective those midterm election attacks actually were. “I think you’d have to be an idiot to think we could win the House with Pelosi at the top,” said Democratic Rep. Filemon Vela in 2017. The idiots were right.Yes, 48 Democratic challengers expressed, in some fashion, opposition to Pelosi’s continued leadership. But 32 of those lost anyway (a few others are in races that haven’t been called yet). And only two winners, Joe Cunningham of South Carolina’s 1st District and Abigail Spanberger of Virginia’s 7th, have unequivocally stated they would oppose Pelosi on the House floor; others could abide by the letter of their campaign pledges by voting against Pelosi in the party caucus vote but then, once she wins, falling in line for the final speaker vote. Another two who have signaled opposition, Rashida Tlaib of Michigan’s 13th and Jahana Hayes of Connecticut’s 5th, represent districts that were already in Democratic hands and unquestionably did not need to distance themselves from Pelosi to win.Meanwhile, at least 25 Democrats flipped districts without criticizing Pelosi, enough on their own for Democrats to claim a House majority, albeit barely. Distancing from Pelosi may have helped extend the scope of Democratic victories—and new Democratic congresspeople from conservative areas will likely need to keep showing flashes of independence to stay in office—but it wasn’t the primary reason Democrats won the House.Still, isn’t Pelosi wildly unpopular? Wouldn’t Democrats be better off without her? After all, last month’s Harvard-Harris Poll pegged her favorable rating at an awful 28 percent. But how does that compare with her peers? Outgoing Speaker Paul Ryan is slightly better at 31 percent. Both Senate leaders are worse: 24 percent for Majority Leader Mitch McConnell, 27 percent for Minority Leader Chuck Schumer.The fact is: Anyone who is a prominent legislative insider is destined to be unpopular. You’re either making the sausage or obstructing it, neither of which looks appetizing from the outside. If you are expecting a speaker to also serve as the appealing face of your party, you are likely to be disappointed.The question about the speakership for Democrats to ask is not, “Who would be the best face of the party?” There’s a little thing about to happen that will answer that soon enough, and it’s called the presidential primary. The correct question to ask about the speakership is: “Who would be the best speaker?” Who can count heads? Who can keep a caucus unified as much as possible? Who can protect vulnerable members from tricky votes? Who knows when to lean on a member for a tough vote, and when to let him or her go their own way?For all the criticisms of Pelosi, none of them have cast doubt on her ability to actually do the job of speaker.One of her chief Democratic critics, Rep. Seth Moulton, earlier this year was asked on POLITICO’s Off Message podcast why doesn’t he run for speaker. He responded in a most revealing way: “I don’t have any interest in being the speaker … because I think to be an effective speaker you have be very good at the, sort of, transactional, inside politics, and understanding favors. … [Pelosi is] great at that!” Yes. Yes she is.Herding Democrats is always exhausting, but this caucus will be particularly challenging for the next speaker. The incoming majority includes avowed socialists from Brooklyn and Queens, wealthy business owners from Maryland and Minnesota, former CIA operatives from Virginia and Michigan, and Democrats representing Trump-friendly cities like Charleston and Oklahoma City. The speaker will have to balance progressive base’s demand for aggressive investigation of Trump, if not his immediate impeachment, with the pledges of many new members to pursue bipartisan cooperation. The left flank may demand floor votes on wish list items like “Medicare for all“ that risk dividing the Democrats, while others may prefer to keep pressure on Republicans to produce legislation. Though it has yet to show this level of sophistication, perhaps the Trump administration will try to pick off moderates and score some legislative wins, and the speaker will have to decide when to lean on Democrats to resist, or to compromise. Why would Democrats want to put an amateur in that tortuous position, when an experienced and proven tactician is already in place? After all, it was Pelosi who, in 2007, helped broker the last increase in the federal minimum wage by attaching it to Iraq War spending and securing President George W. Bush’s signature. It was Pelosi who helped enact the Affordable Care Act in 2010, first by passing a version that included a public health insurance option, then by persuading her more progressive colleagues to sacrifice it out of political necessity. And this year, it was Pelosi who cagily opposed the bill to keep the government open, on the grounds it failed to lock in protections for immigrant Dreamers, while signaling to her vulnerable members they were free to break ranks and avoid a protracted shutdown. It’s no coincidence that last week not a single incumbent Democrat lost reelection.But Democrats can’t have Pelosi work her parliamentary magic forever. It is long past time to groom a successor, someone who can work by her side and learn the ropes before ascending into the hot seat. If Hoyer won’t step aside and offer someone the opportunity to serve as majority leader, then the opportunity should be seized.Bill Scher is a contributing editor to Politico Magazine, and co-host of the Bloggingheads.tv show “The DMZ.”Swamp Diary \n\n                        By Jack Shafer\nThe Friday Cover\n\n                        By Keith Kloor\nPolitics\n\n                        By Derek Robertson\n\n © 2018 POLITICO LLC"}