{"id": "\n\n\n\nPOLITICO\n\n\nHUD official resigns following reports of reassignment to Interior\n", "paragraph": "\n                HUD Assistant Secretary Suzanne Tufts \"has offered her resignation and it has been accepted,\" HUD spokesman Raffi Williams wrote in an email. | Mark Wilson/Getty Images\nWhite House \n                    By BEN LEFEBVRE10/19/2018 06:13 PM EDTA top official at the Department of Housing and Urban Development who had been announced as a candidate for the Interior Department's top watchdog position has resigned from the Trump administration, HUD said Friday.HUD Assistant Secretary Suzanne Tufts \"has offered her resignation and it has been accepted,\" HUD spokesman Raffi Williams wrote in an email.Story Continued BelowThe announcement closed a week of finger pointing by the White House, Interior and HUD on the choice of Tufts, a GOP operative with no experiencing investigating allegations of unethical behavior. The Interior Department's office of inspector general has opened several investigations into Zinke's actions, and a report obtained by POLITICO on Thursday faulted him for seeking to skirt or alter department policies to justify his taxpayer-funded trips with his wife.Earlier Friday, the White House denied that it had suggested Tufts as a candidate to lead the Interior watchdog.\"The claim we hand-picked her is completely inaccurate,\" White House deputy press secretary Hogan Gidley told POLITICO. Gidley did not immediately offer more information.Sign up for our must-read newsletter on what's driving the afternoon in Washington.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Interior said Thursday that Tufts, a Republican political appointee, \"was referred to the Department by the White House as a potential candidate for a position in the inspector general's office.\"HUD Secretary Ben Carson told staff in an Oct. 12 email that Tufts was leaving his department to become the Interior IG's \"acting director.\" The director position has been vacant for 10 years, and the office is being led by Deputy IG Mary Kendall.Interior said Thursday Carson's email \"had false information in it\" and that \"anonymous claims from 'White House officials' that the Department blindsided them are absolutely false.\"A HUD source blamed Carson's email on miscommunication at the staff level.Democrats have asked for more information on Tuft's vetting. Katy O'Donnell contributed to this report.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}