{"id": "\n\n\n\nPOLITICO\n\n\nGOP zeroes in on Minnesota in fight for House control\n", "paragraph": "\n                Minnesota 1st District congressional candidate Jim Hagedorn works a parade in Waterville, Minn.  | Jim Mone/AP Photo\nElections\n                        Republicans are mostly on defense, but flipping two Democratic districts Trump carried could boost their hopes of retaining the majority.\n                    By ELENA SCHNEIDER10/20/2018 06:41 AM EDTMANKATO, Minn. — In a congressional debate last week, Republican Jim Hagedorn touted his support for “extreme vetting” of immigrants, took shots at California Rep. Maxine Waters and at times sounded as though he was running against Hillary Clinton, saying that if she had won in 2016, “we would’ve lost the country.”In short, he’s running as a local version of President Donald Trump — and banking on the president lifting him to victory in a Democratic-held House district for the first time in his three congressional campaigns.Story Continued BelowMost House Republicans around the country are playing defense this election, as Democrats try to flip 23 districts and take the House majority. But Hagedorn is one of two Minnesota Republicans seeking to flip rural, Democratic-held districts in the other direction — a key piece of Republicans’ narrow hopes of retaining the House.Winning those districts would mean that Democrats have to beat another couple of incumbent Republicans elsewhere in the country, potentially making the difference on a close election night. And even as many of those Republicans try to stem shrinking GOP support in the suburbs in the Trump era, Hagedorn is hoping that he can build on the president’s supercharged rural appeal in 2016, when Trump carried Minnesota’s 1st District by double-digits while Democratic Rep. Tim Walz narrowly won reelection.“This is a miniature national election,” Hagedorn said in an interview with POLITICO before the debate. “We’ve approached it this way the entire time … we’re running on national issues.”Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Trump, who held a rally in the district earlier this month, brought Hagedorn on stage in Rochester, asking the crowd “to stop radical Democrats and to elect proud Minnesota Republicans.”Hagedorn’s opponent, Democrat Dan Feehan, is unsurprisingly taking the opposite approach in double-digit Trump country, leaning on a grab-bag of local and federal issues further outside the Trump-driven national news.Feehan, an Iraq War veteran and former Pentagon official, talked about crushing student loan debt with two-dozen Winona State University students last Sunday. Down the road in La Crescent two hours later, Feehan launched volunteer canvassers from a local sports pub with a pep talk on health care.Missing from much of those conversations? Trump.Feehan, in an interview, said that he would work with the president “when it benefits southern Minnesota,” citing infrastructure as one example. But he insisted that the voters “aren’t hyper-partisan here,” and while “there are things [voters] like about the president, being a check on him would bring stability.”“That’s the contrast: A check and balance for the president, or a rubber stamp,” Feehan added. Feehan’s tightrope walk over Trump is emblematic of how Democrats in other rural, blue-collar districts throughout the country are dealing with the president: “They’re not talking about Trump, and they probably shouldn’t talk about Trump,” said Ian Russell, the former political director of the Democratic Congressional Campaign Committee. “They’re talking about health care because that’s what’s hurting Republicans.”“Trump, well, isn’t hurting Republicans’ chances in places like that,” Russell added.Struggling to connect with rural America isn’t a new problem for Democrats. It started a decade ago when “way too many” Democrats “wrote off small towns and lesser populated counties as Republican territory,” said Democratic Rep. Cheri Bustos, who represents a swathe of rural Illinois. Back in 2009, Democrats held 57 percent of Midwestern districts, including many rural ones. But by 2017, they hold just over one-third of them, according to Bustos’ “Hope from the Heartland” report.That feeling is echoed by Sadredin Moosavi, a 49-year-old voter waiting outside the Hagedorn-Feehan debate who said that “working class voters have been ignored by Democrats for eight years, so it’s been building up,” Moosavi, who once supported Walz, said that voters like him are “tired of being demeaned, so we’re going to vote for Republicans.” “Our party is concentrated in cities and urban areas, which is a long-term structural problem for us in the Electoral College and the House,” said Anna Greenberg, a Democratic pollster.The Democratic Party — dominated by leadership who hail from New York City and San Francisco — can easily “be fed to these rural voters” as “Democrats just want to abolish ICE and impeach Trump,” said a Democratic consultant, granted anonymity to speak candidly. “There’s a heavier burden on Democrats in these districts to cross a threshold with these voters because of the way non-rural Democrats have come to define what the party is in those areas.”\nElections \n                    By DAVID SIDERSBut national Democrats haven’t written off the Feehan and Hagedorn match-up yet. The DCCC is spending nearly $2 million on TV ads attacking Hagedorn, while small-dollar donors from across the country poured more than $2 million into Feehan’s campaign coffers last quarter.Local Democrats – who emphasized Feehan’s military resume as similar to Walz’s – hope that the district will course-correct, suggesting that Trump was “maybe an anomaly, a fluke,” said Debra Hoegenson, the vice chairwoman of the Democratic-Farmer-Labor Party in the 1st District. “It was as much an anti-Hillary vote as it was a pro-Trump vote, so maybe it’ll revert back this year.”But things look grimmer up north for Democrats. In Minnesota’s 8th District, Republicans appear poised to flip a congressional seat that has Democrats had held almost uninterrupted for generations, before Democratic Rep. Rick Nolan announced his retirement earlier this year. This week, the DCCC pulled its TV ad reservations in the district, leaving Democrat Joe Radinovich, who managed Nolan’s previous congressional races, to fend for himself. Radinovich, for his part, raised more than $1 million last quarter.Republican Pete Stauber also said that he talks frequently about Trump on the trail because “he has the backs of men and women here,” so he’s “very popular here,” he said.But Bustos insisted that the slate of candidates in these rural seats “fit their districts like a glove,” and the Democratic Party is poised to make inroads back into these communities.“We’re on the frontlines,” Feehan said in an interview, acknowledging that he’s one of the few Democrats defending rural territory. “What is being defined here, I think, will help define the Democratic Party and the country. What happens here will have a ripple effect.” Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}