{"id": "\n\n\n\nPOLITICO\n\n\nMississippi senator deflects questions about 'public hanging' comment\n", "paragraph": "\n                \"I put out a statement yesterday, and we stand by that statement, and that's all I'm going to say about it,\" said Republican Sen. Cindy Hyde-Smith. | Emily Wagster Pettus/AP Photo\nElections\n                    By REBECCA MORIN11/12/2018 04:36 PM ESTSen. Cindy Hyde-Smith sidestepped questions Monday about her recent remark about attending a \"public hanging,\" repeatedly pointing to a statement in which she said her comment carried no \"negative connotation.\"\"We stand by that statement,\" the Mississippi Republican said during a news conference Monday. Story Continued Below\"I put out a statement yesterday, and we stand by that statement, and that's all I'm going to say about it,\" she continued.Hyde-Smith, who is white, is in a runoff with Democrat Mike Espy, who is black.A video clip posted Sunday showed Hyde-Smith saying: “If he invited me to a public hanging, I'd be on the front row.” She was campaigning with a cattle rancher when she made the comment, and no further context was available in the video. But she said in her statement that she was referring to \"accepting an invitation to a speaking engagement.\"\"In referencing the one who invited me, I used an exaggerated expression of regard, and any attempt to turn this into a negative connotation is ridiculous,” Hyde-Smith said in the statement.\nElections\n                    By JAMES ARKINEspy, who was drawn into a runoff with the senator after neither earned 50 percent of the vote on Nov. 6, has called her comment \"reprehensible\" and out of touch in Mississippi, which has a history of lynchings. Hyde-Smith was appointed to the Senate seat after Republican Thad Cochran resigned. The winner of the runoff will serve the remaining two years of Cochran's term.Mississippi Gov. Phil Bryant, also a Republican, said at the event Monday that sometimes politicians say things they \"could have phrased better,\" but he said he believes that Hyde-Smith did not mean any offense by her remark.\"I know this woman, and I know her heart. I knew it when I appointed her, and I know it now,\" he said. \"There is nothing in her heart of ill will.\"\"Absolutely we have been sensitive to race relations in this state,\" he said, adding that when he invited President Donald Trump to the opening of the Mississippi Civil Rights Museum in Jackson, some African-American leaders refused to attend in protest.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}