{"id": "\n\n\n\nPOLITICO\n\n\n\nFlorida\n\nBay County allowed voters to cast ballots online despite law, Scott's orders\n", "paragraph": "\n                In some cases, voters used fax machines to email their ballots in, which is currently permitted by state law for overseas voters | Alan Diaz/AP Photo\n                    By ANDREW ATTERBURY and MARC CAPUTO11/12/2018 02:33 PM EST\n                    Updated 11/16/2018 03:32 PM ESTTALLAHASSEE — The election supervisor in hurricane-wracked Bay County allowed some voters to illegally cast ballots by email — an act specifically prohibited by Gov. Rick Scott when he issued an emergency order to expand voting opportunities there after the storm. Despite the prohibition, Bay County Election Supervisor Mark Andersen says he stands by his decision in the Republican-rich county after Hurricane Michael. In all, he said, 147 voters returned ballots through email but only 10 were purely email-to-email interactions. In the other cases, voters used fax machines to email their ballots in, which is currently permitted by state law for overseas voters.Story Continued Below“Whoever has a problem with this should be ashamed,” Andersen told POLITICO. “This area was hit by a hurricane and some people still don’t have power, some still don’t have water and one of my staff doesn’t have a home. Other staff need to fix their roofs.Neither the state’s elections division or Scott’s office immediately responded to requests for comment about the story, which was first reported by WJHG/WECP in Panama City.The voters who cast ballots through email signed an oath, verified identification and secured the information, according to WJHG/WECP.A similar policy is used for overseas voters, Andersen told the outlets. Democrats accuse Scott — who has raised the specter of “widespread fraud” in Democrat-heavy South Florida counties without providing clear evidence — of hypocrisy by saying nothing of the apparently illegal email voting that he specifically said shouldn’t take place. “Why does this supervisor in this county not have to follow the law?” asked state Sen. Kevin Rader (D-Delray Beach), whose district includes parts of Palm Beach and Broward counties where Scott has sued the elections supervisors amid the recount in his U.S. Senate race. “Email ballots aren’t legal,” Rader said. “Why the double standard?\"But Andersen said this was an extreme case. He said his office still verified voter signatures to make sure lawful votes were cast.“We sent out ballots to get people to vote. If you cancel these votes, you cancel Democratic and Republican votes,” Andersen said. “Elections are for voters. They’re not for the candidates.”The Florida Department of State has received reports of Bay County’s fax and email votes, spokesperson Sarah Revell said by email. Outside of that acknowledgment, the state offered no further information Monday.“Supervisors of Elections are independently elected constitutional officers and it is each Supervisors’ responsibility to adhere to the law at all times,” Revell wrote.Scott on Oct. 18 issued an emergency executive order to help ensure voters in the counties hit hardest by Michael would have opportunities to vote. The order allowed counties to open mega-precincts for all voters in eight counties: Bay, Calhoun, Franklin, Gadsden, Gulf, Jackson, Liberty and Washington.In a statement on Oct. 18, Scott explicitly said voting through fax or email would not be allowed.“In the hardest hit areas, communication via phone, fax and email remains challenging and would be an unreliable method for returning ballots,” a written statement from Scott’s office said. “Additionally, past attempts by other states to allow voters impacted by natural disasters to fax or email ballots have been rife with issues. The Department is actively reviewing ways to provide more absentee ballots to those voters in the counties severely impacted by Hurricane Michael.”In Bay County, Scott received 73.1 percent of the vote — 46,646 votes — compared to Nelson’s 26.1 percent, or 16,684 votes, according to unofficial election results.Republican gubernatorial candidate Ron DeSantis was ahead by a similar margin: 71.6 percent, or 45,694 votes, against Democrat Andrew Gillum’s 26.2 percent, or 16,738 votes.A weekly, must-read brief on health care news and moves in Tallahassee and around the stateA morning email with must-read analysis and breaking news on Florida politics and policy.A weekly must-read on budget politics for Florida Pros, with exclusive reporting and analysis, interviews and more. POLITICO Florida Pro's high-level outlook on the policy issues driving the month in Florida.Matt Dixon and Marc Caputo's must-read briefing on what's hot, crazy or shady about politics in the Sunshine State\n                        POLITICO ProA morning email with must-read analysis and breaking news on Florida politics and policy.\n                        POLITICO ProA weekly, must-read brief on health care news and moves in Tallahassee and around the state.\n                        POLITICO ProOur weekly digest of college and university news in the Sunshine State.\n                        POLITICO ProA weekly must-read on budget politics for Florida Pros, with exclusive reporting and analysis, interviews and more. \n                        POLITICO PROPOLITICO Florida Pro's high-level outlook no the policy issues driving the month in Florida.\n                        POLITICO ProOriginal federal and state policy documents © 2018 POLITICO LLC"}