{"id": "\n\n\n\nPOLITICO\n\n\nAfter trading barbs all year, Newsom and Trump meet at California fire zone\n", "paragraph": "\n                President Donald Trump talks with California Gov.-elect Gavin Newsom during a visit to a neighborhood destroyed by wildfires on Saturday. | Evan Vucci/AP Photo\nCalifornia\n                        Since the president announced his visit, there had been speculation as to whether he would be joined by the governor-elect, who campaigned as an alternative to Trumpism.\n                    By JEREMY B. WHITE11/17/2018 02:35 PM EST\n                    Updated 11/17/2018 04:56 PM ESTYUBA COUNTY, Calif. — Two weeks after decisively winning an election framed as a referendum on President Donald Trump, California Gov.-elect Gavin Newsom met his foil for the first time on a smoke-stifled tarmac as the state burned.Newsom and Gov. Jerry Brown were on hand when Air Force One touched down at Beale Air Force Base north of Sacramento on Saturday, Trump's second visit to California since assuming the presidency. The three shook hands and exchanged words, the silhouettes of trees at the end of the tarmac barely visible through a grey haze.Story Continued BelowFrom the moment Trump announced his visit, there was speculation as to whether he would be joined by Newsom, who has framed his imminent governorship as a counterweight to the president.But as California reels from the deadliest wildfire in state history, Trump's visit affords the incoming governor an ability to rise above the animosity and work with the federal government when the need arises - even as he faces pressure from liberals at home to do the opposite.\"A smart woman once told me that you campaign partisan and you govern bipartisan,\" Dana Williamson, an adviser to Brown, told POLITICO. \"It's imperative that the victims of these horrible fires and the thousands of first-responders have the full attention of our federal, state and local leaders regardless of politics.\"A spokesman for Brown said he joined at Trump's invitation.Our must-read briefing on politics and government in the Golden State.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Trump and the two California leaders later toured the town of Paradise along with Mayor Jody Jones and FEMA Director Brock Long.“This is probably the worst disaster that I’ve seen in my career,” Long told Trump, according to The Sacramento Bee, one of the pool outlets.It was the first time Trump has visited California in the past 13 months of deadly disasters the state has faced. He did not travel here after last year's massive wildfire in Santa Rosa, the January mudslide in Montecito or the fatal Carr Fire in Redding this summer.Trump and Newsom at times paused to speak to each other in front of the charred wreckage.Trump appeared to assent as Newsom spoke to him and gesticulated, and Trump repeatedly called Newsom by his first name during subsequent remarks to the media.“Jerry and I have been speaking and Gavin and I have gotten to know each other and we’re all going to work together,\" Trump said, flanked by Newsom and Brown. He offered Newsom a chance to speak, which the governor-elect declined.Trump said they were “all on the same path” regarding the need “to work in the floor, the forest floor.\"\"We’ll be working also with environmental groups,\" he added. \"I think everybody has seen the light.”\nWhite House\n                    By QUINT FORGEYJoining Trump on Air Force One were two of his top allies from California’s diminishing Republican congressional delegation: newly elected minority leader Kevin McCarthy and Rep. Doug LaMalfa, who represents the area ravaged by flames.After arriving at Beale Air Force Base, they left with Brown and Newsom by helicopter to the Paradise fire zone about 60 miles north.As he sought to consolidate support for his leadership bid, McCarthy aligned himself closely with the president. In Paradise, Trump heralded their relationship, thanking McCarthy for “the support you’ve given in Washington.”“Kevin, anything we can do, you know we’re here. Just bring it over to the office,” Trump said.Newsom and Trump have long been locked in a dance of mutual enmity, each regularly invoking the other to galvanize their respective bases: Newsom positions himself as the champion of California's alternative to Trumpism, while the president caricatures Newsom on the campaign trail as an extreme liberal who wants to open borders and distribute free health care.Still, the social media reaction underscored the political peril, with detractors questioning Newsom's decision and equating it to an act of betrayal.\n\n                    By BEN SCHRECKINGER and CHRISTOPHER CADELAGONumerous users said Newsom and Brown should use the opportunity to demand that Trump apologize for his tweets faulting California for the severity of the fires or to challenge the accuracy of his claims. While some praised the show of unity, others said Newsom should have slipped the appearance to send a statement. More than a few mentioned that Newsom’s ex-wife Kimberly Guilfoyle is now dating Trump’s son Donald Jr. and wondered if the relationship would come up.When Trump a week ago responded to the natural disaster ravaging California by deriding the state's management and threatening to halt federal help, Newsom joined Democrats heaping on criticism. \"Lives have been lost. Entire towns have been burned to the ground. Cars abandoned on the side of the road. People are being forced to flee their homes. This is not a time for partisanship,\" he said.The sight of Brown alongside Trump was also jarring, given how the current governor has sparred with Trump - particularly over the White House's unraveling of policies intended to blunt the effects of climate change, a signature issue for Brown. Trump told Fox News' Chris Wallace in an interview set to air Sunday that while an altered climate contributed \"a little bit\" to voracious wildfires, forest management was the larger culprit, and he reiterated on Saturday that he believes better managing forests is the paramount issue.While Trump is reviled by much of the California electorate, the area at the heart of the fire's devastation supported the president in 2016. In the town of Paradise almost completely destroyed by the Camp Fire, Trump won 53 percent of votes in 2016, compared to 37 percent for Hillary Clinton.LaMalfa, the Republican who represents the area, told McClatchy that he had invited Trump and echoed the president's calls to better manage the trees that fires feed on.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}