{"id": "\n\n\n\nPOLITICO\n\n\nFire death toll rises to 71 ahead of Trump’s California visit\n", "paragraph": "\n                A firefighter searches for human remains in a trailer park destroyed in the Camp Fire on Nov. 16 in Paradise, Calif.  | John Locher/AP Photo\nCalifornia fires\n                    By ASSOCIATED PRESS11/16/2018 10:09 PM ESTCHICO, Calif. — With the confirmed death toll at 71 and the list of unaccounted for people more than 1,000, authorities in Northern California on Friday searched for those who perished and those who survived the fiercest of wildfires ahead of a planned visit by President Donald Trump.The president on Saturday is expected to get a look at the grief and damage caused by the deadliest U.S. wildfire in a century, and he could face resentment from locals for blaming the inferno on poor forest management in California.Story Continued BelowIn an interview taped Friday and scheduled for broadcast on “Fox News Sunday,” Trump said he was surprised to see images of firefighters removing dried brush near a fire, adding, “This should have been all raked out.”Late Friday, Trump tweeted: \"Thank you @JerryBrownGov. Look forward to joining you and @GavinNewsom tomorrow in California. We are with you!\"Deputies found eight more bodies Friday, bringing the death toll to 71.The number of people unaccounted for grew from 631 on Thursday night to more than 1,000 on Friday, but Sheriff Kory Honea said the list was dynamic and could easily contain duplicate names and unreliable spellings of names.Our must-read briefing on politics and government in the Golden State.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.He said the roster probably includes some who fled the blaze and do not realize they’ve been reported missing.Some on the list have been confirmed as dead by family and friends on social media. Others have been located and are safe, but authorities haven’t gotten around to marking them as found.In last year’s catastrophic wildfires in California wine country, Sonoma County authorities at one point listed more than 2,000 people as missing. But they slowly whittled down the number. In the end, 44 people died in several counties.The wildfire this time all but razed the town of Paradise, population 27,000, and heavily damaged the outlying communities of Magalia and Concow on Nov. 8, destroying 9,700 houses and 144 apartment buildings, authorities said.Firefighters were gaining ground against the blaze, which blackened 222 square miles. It was 45 percent contained and posed no immediate threat to populated areas. Crews managed to stop it from spreading toward Oroville, population 19,000.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}