{"id": "\n\n\n\nPOLITICO\n\n\nTrump disputes NYT report that he asked aides about Pence's loyalty\n", "paragraph": "\n                President Donald Trump referred to Vice President Mike Pence as “a trooper” who has “already been tested, in many ways.”  | Al Drago - Pool/Getty Images\nWhite House\n                    By QUINT FORGEY11/17/2018 01:26 PM ESTPresident Donald Trump on Saturday reaffirmed his confidence in Mike Pence, repeatedly slamming a report in the New York Times that asserted Trump has questioned the loyalty of his vice president, while claiming against available evidence that the newspaper had not sought comment before publication. “The New York Times did a phony story, as usual, about my relationship with @VP Mike Pence,” the president wrote on Twitter. “They made up sources and refused to ask me, the only one that would know, for a quote....”Story Continued BelowTrump added: “....I can’t imagine any President having a better or closer relationship with their Vice President then the two of us. Just more FAKE NEWS, the Enemy of the People!”In a story published Friday, the Times reported that Trump has recently been querying White House aides and advisers as to whether they considered Pence loyal ahead of the president’s 2020 reelection campaign.\nWhite House\n                    By QUINT FORGEYEarlier Saturday, speaking to reporters at the White House before departing for California to survey damage from the state’s wildfires, Trump dismissed the Times’ report.Trump, who is known to hold personal loyalty as a deciding factor in many of his friendships and hiring decisions, referred to the vice president as “a trooper” and “a terrific person” who has “already been tested, in many ways.” “I don’t question his loyalty at all,” the president said of Pence, according to a pool report. “He is 100 percent loyal. It was a phony story.”Trump also suggested that neither he nor White House press secretary Sarah Huckabee Sanders were contacted for comment on the Times’ story.“How do you do a story like that, and you don’t call the principal?” Trump said. “I would give them a quote, I would say it’s not true. And that’s the end of their story. But they don’t do that.”\nMedia \n                    By JASON SCHWARTZThe president added: “You know what the quote would be? Mike Pence is 100 percent. Now you can't do your story. So that’s why they don’t like calling me for a quote.”Maggie Haberman, a White House correspondent for the Times and a co-author of the story (who is also a former POLITICO reporter), disputed the president’s account in a tweet Saturday. Haberman said she corresponded with Sanders via email ahead of the story’s publication, and pointed to a quote from White House deputy press secretary Hogan Gidley that is featured in the story.“FACT CHECK: Emailed with @PressSec and spoke with first deputy Hogan Gidley, who is quoted,” Haberman wrote online. “POTUS would need to talk to them about why they didn’t provide us with a quote from him.”Pence was in Singapore on Thursday for the multinational East Asia Summit, where he and National Security Adviser John Bolton talked briefly with President Vladimir Putin of Russia. On Saturday, Pence represented the U.S. at an Asia Pacific Economic Co-operation summit in Papua New Guinea.Asked by reporters Saturday about the veracity of the report, Pence said he and the president enjoyed “a very close” and “a very strong” relationship, according to a pool report. The vice president also revealed that the story was mentioned in a recent conversation he shared with the president.“It came up,” Pence said. “We had a good laugh.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}