{"id": "\n\n\n\nPOLITICO\n\n\nAir wars: Hawley flies on lobbyist's plane after blasting McCaskill \n", "paragraph": "\n                Republican Missouri Senate candidate Josh Hawley received an in-kind contribution of more than $5,225 for a charter flight on a plane owned by a lobbyist and his wife, according to public records. | Jeff Roberson/AP Photo\nElections\n                        Missouri's Senate candidates duke it out over whose flights are more unsavory.\n                    By BURGESS EVERETT and ELANA SCHOR10/20/2018 09:45 AM EDTJosh Hawley has criticized Democratic Sen. Claire McCaskill repeatedly for using a private plane to travel around Missouri. But the Republican Senate hopeful isn’t above taking a ride in a private plane himself.Hawley received an in-kind contribution of $5,225 for a charter flight in September on a plane owned by lobbyist Travis Brown and his wife, according to public records. Hawley attended a West Virginia fundraiser on that day, social media posts show, before returning to Springfield, Mo., that night — and posting a Facebook video of him driving into the city for a rally with President Donald Trump the next day.Story Continued BelowBrown is a registered lobbyist in Missouri whose clients include the St. Louis Blues hockey team and wealthy businessman Rex Sinquefield, a Hawley donor who’s linked to a state-level effort to permit medical marijuana use. The plane in which Hawley flew, a Pilatus PC-12/47, is registered to Brown’s business address, and flight records show it leaving Missouri for West Virginia on Sept. 20 and returning later that night. In campaign finance disclosures, Hawley also reported charter plane expenses of $8,732 for a flight in August and three flights in September. It is unclear who owned those planes or where Hawley went; his campaign declined to provide details about the flights.Hawley has slammed McCaskill for using her own private plane during the campaign. In particular, he blasted the senator after she flew between stops on two days she had billed as an RV tour of the state, calling her \"out of touch.\"Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.A spokeswoman for Hawley's campaign, Kelli Ford, said Hawley’s use of “a single engine propeller plane” for the travel to and from West Virginia is unrelated to his rebuke of McCaskill’s use of her family-owned plane. “Josh’s criticism of Senator McCaskill's use of her personal plane is threefold: 1) she secretly flew when she said she was on an RV, 2) she claims ‘normal’ middle class people own private planes, 3) she won’t release her family tax returns so voters can understand how she can afford to own a plane,” Ford said in an email.But McCaskill campaign spokeswoman Meira Bernstein said Hawley's own plane ride shows his insincerity.\"As if Missourians needed more evidence that Hawley is beholden to his billionaire backers. There's no hypocritical level to which Hawley won't stoop,\" she said.The private plane used by McCaskill and owned by her husband, Joseph Shepard, is the same model that Hawley used in September, a Pilatus PC-12/47, according to reports dating back to Shepard's purchase of the aircraft in 2013. In 2011, facing a controversy that threatened her reelection, McCaskill reimbursed the Treasury Department for more than $88,000 in charter air flights in 2011 and repaid nearly $300,000 in back taxes on an older plane she later sold. Afterward, McCaskill vowed to pay personally for any travel she took on the new plane bought by Shepard’s company. \n\n                    By ELANA SCHOREven as he took aim at her use of the private plane, Hawley has said he would be fine with the trips if McCaskill would just “own it.” He also has challenged her to stop using the plane for a month as the two duke it out in one of the most hotly contested Senate races of the midterm elections. “I say, ‘Look, I’m driving everywhere, why don’t you drive?’” Hawley said in a July interview. “She can’t do it. She’s totally addicted to her luxury lifestyle. This is the thing, she talks about, ‘Oh, I want to spend all this time on the trail.’ She doesn’t spend that much time on the trail. She flies everywhere.”Republicans have dubbed McCaskill “Air Claire,” shadowing her at events and waving air traffic control wands. But McCaskill has continued to use her family’s plane during the campaign. The two-term incumbent says most people running for statewide office in Missouri charter planes, as do most senators.“It’s a way I can contribute to my campaign personally in a way that’s meaningful. It doesn’t take away from our budget for our other things. And it allows us to get more places,” McCaskill said in an interview this July. “I’m not aware of very many candidates for the U.S. Senate or governors in this state that haven’t used a chartered plane.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}