{"id": "\n\n\n\nPOLITICO\n\n\nHeller, Rosen go on the attack in lone Nevada debate\n", "paragraph": "\n                Republican Sen. Dean Heller and Democratic Rep. Jacky Rosen stuck to the core messages of their respective Nevada Senate campaigns in their lone debate in Las Vegas. | John Locher-Pool/Getty Images\nElections\n                        Republican Dean Heller and Democrat Jacky Rosen traded barbs over health care, Kavanaugh and taxes.\n                    By JAMES ARKIN10/20/2018 12:12 AM EDTLAS VEGAS — Sen. Dean Heller accused Rep. Jacky Rosen of shirking her duties in Nevada to fundraise in California. Rosen accused Heller of lying when he promised to back protections for pre-existing conditions. Heller, a first-term Republican senator, pitched himself as a man of results, touting his relationship with President Donald Trump and his ability to work with the president, from the Republican tax cuts to veterans bills. Rosen, a first-term congresswoman, cast herself as bipartisan and not a “career politician” while labeling Heller a “rubber stamp” and repeatedly attacking her opponent for being unwilling to stand up to the president. Story Continued BelowHeller, the only Republican senator running for reelection in a state won by Hillary Clinton, has held a slight lead in recent public polls in this battleground Senate race. The lone debate came on the eve of early voting in the state, and Trump, former Vice President Biden and former President Barack Obama will all hold rallies in the coming days to boost the candidates. The initial confrontation in the debate came on health care, which Rosen has made her most significant issue in the race. Rosen attacked Heller for supporting Republicans' Obamacare repeal, saying he “promised to protect hundreds of thousands of Nevadans and their health care and he went back to Washington and broke that promise.” Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Heller pushed back, taking credit for writing the his party’s Obamacare replacement bill, which he said included a mandate to cover pre-existing conditions.They also disagreed sharply on the recent confirmation of Justice Brett Kavanaugh to the Supreme Court. Rosen attacked Heller for a comment he made calling the allegations of sexual assault against Kavanaugh a “hiccup” in his confirmation. She also criticized him for backing Kavanaugh with “no reservations” after having refused to meet with Merrick Garland, Obama’s nominee in 2016. Heller said the hiccup comment was out of context, and defended his vote to support Kavanaugh, saying he carefully reviewed the FBI investigation into the allegations against him.“You can be for MeToo, you can be for the MeToo movement and you can be for the rule of law at the same time,” Heller said.Heller also attacked Rosen for voting against Republicans’ tax cuts, which he took credit for writing. He said she would “take us back to the Obama era of 2 percent growth.\"Rosen, meanwhile, attacked Heller for the corporate tax cuts in the legislation being permanent while the middle-class portion expires after a decade, and for the increase to the national debt. Both repeatedly attempted to tout their bipartisan credentials, with Heller referring to himself multiple times as the “fifth most bipartisan senator” in the chamber, and Rosen touting her work for the “problem solver’s caucus.” While Rosen knocked Heller's relationship with Trump, the Republican criticized Rosen for having a 90 percent voting record with Minority Leader Nancy Pelosi. Both also took specific shots at their opponents. Heller accused Rosen of shirking her duties in Congress to take a “photo-op” at the southern border following the administration’s policy of separating families. Rosen said Heller had “rubber stamped” every one of Trump's nominations without a second thought. \nWhite House\n                    By CHRISTOPHER CADELAGO and BRENT D. GRIFFITHSHeller, however, defended his relationship with the president. Asked about his previous remark that he was 99 percent against Trump during the 2016 campaign, Heller said the two had formed a working relationship that had blossomed into a friendship.“We have developed this friendship based on trust,” Heller said. “Yeah, we've had our differences and we'll continue to have our differences. I'll be the first to tell you I don't agree with everything he says but I agree with most of what he does.\"Given the opportunity to ask each other a single question, both turned back to attacks that have become central to their campaign, and that they each repeated over and again Friday night. Heller accused Rosen of missing multiple congressional events in Nevada to raise money in California, and asked, “Was it worth it?” Rosen challenged Heller to look into the eyes of a Nevada family and tell them why he had lied over his support for protections of pre-existing conditions.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}