{"id": "\n\n\n\nPOLITICO\n\n\nTrump touts dubious African-American support in midterm homestretch\n", "paragraph": "\n                President Donald Trump won only 8 percent of the black vote in the 2016 election. | Mark Wallheiser/Getty Images\nWhite House\n                    By QUINT FORGEY11/04/2018 03:25 PM ESTPresident Donald Trump on Sunday boasted of his support among African-Americans by citing questionable polling data, two days before voters cast their ballots in a midterm election with historic implications for black candidates.“New Fox Poll shows a ‘40% Approval Rating by African Americans for President Trump, a record for Republicans.’ Thank you, a great honor!” the president wrote on Twitter.Story Continued BelowTrump’s post is an apparent reference not to a survey by Fox News, but instead to a recent poll by Rasmussen Reports featured in a Fox News segment on Sunday morning. That Rasmussen survey, a daily tracking poll from Oct. 29, showed that 40 percent of black respondents approved of the president’s performance. A Fox News poll from Oct. 17 found that 29 percent of all nonwhite registered voters approve of Trump’s job performance.Rasmussen's methodology is frequently questioned by mainstream pollsters, and its work has been accused of harboring a pro-Republican bias.In a weekslong slate of campaign rallies for Republican candidates ahead of Election Day, Trump has consistently bragged about low minority unemployment rates he claims are a byproduct of his administration's economic policies. In August 2016, he memorably implored black voters to elect him president by asking, “What the hell do you have to lose?”Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Trump won only 8 percent of the black vote in the 2016 election, while roughly 88 percent of black voters opted for his Democratic opponent, Hillary Clinton. Among the many high-profile minority candidates vying for office on Tuesday, Democrat Stacey Abrams of Georgia is competing to become the nation’s first black female governor. Her Republican opponent, Georgia Secretary of State Brian Kemp, has been accused of trying to disenfranchise minority voters and has been the subject of multiple lawsuits related to limiting voting rights.Tallahassee Mayor Andrew Gillum, a Democrat, could be elected Florida’s first black governor. His opponent, former Republican Rep. Ron DeSantis, was criticized for using racially loaded language in August when he called Gillum “articulate” and said voters shouldn’t “monkey this up” by electing Gillum governor.On Saturday, a member of Trump’s Cabinet, Agriculture Secretary Sonny Perdue, used the term “cotton-pickin’” at a rally for DeSantis to describe the importance of the state’s gubernatorial race.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}