{"id": "\n\n\n\nPOLITICO\n\n\nMueller asks FBI to probe scheme seeking sexual assault dirt on him\n", "paragraph": "\n                Lorraine D. Parsons of Fort Myers, Fla., said she worked with Special Counsel Robert Mueller in 1974 and was recently offered money to make false claims about him. | Saul Loeb/AFP/Getty Images\nLegal \n                        POLITICO received emails saying a man was offering tens of thousands of dollars to accuse Mueller of sexual misconduct.\n                    By DARREN SAMUELSOHN10/30/2018 03:24 PM EDT\n                    Updated 10/30/2018 05:26 PM EDTSpecial counsel Robert Mueller has asked the FBI to investigate an alleged scheme to manufacture sexual assault stories about him. At issue is an email widely circulated this month among journalists from someone who claimed she’d been approached with an offer to pay her tens of thousands of dollars if she’d answer questions about Mueller and then sign a sworn affidavit accusing him of sexual misconduct and workplace harassment.Story Continued Below“When we learned last week of allegations that women were offered money to make false claims about the Special Counsel, we immediately referred the matter to the FBI for investigation,” Mueller spokesman Peter Carr said in an email. The FBI did not comment. The person, who identified herself to POLITICO and other news organizations as Lorraine D. Parsons of Fort Myers, Fla., said she worked with Mueller in 1974 when she was a paralegal at the law firm Pillsbury, Madison and Sutro. In her email, which POLITICO could not independently confirm, Parsons said a man named Bill Christensen contacted her by phone to inquire about Mueller.Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.“I'm not sure how he knew that I ever worked there or worked with Robert Mueller. I reluctantly told Mr. Christensen that I had only worked with Mr. Mueller for a short period of time, before leaving that firm to have my first son,” she wrote in her email.Parsons said Christensen “then changed his tone, and mentioned that he might be able to help me pay off some debt. He knew exactly how much credit card debt I had, right down to the dollar, which sort of freaked me out.”The woman said she told Christensen she wasn’t interested in his offer and hung up on him. But she said he called back two days later offering to pay off $34,000 in credit card debt and also write her a $20,000 check if she made the allegations against Mueller.In addition, Parsons said that Christensen offered her a $10,000 bonus from his client, the Republican lobbyist Jack Burkman.Parsons in an email declined to speak by phone with POLITICO about her interaction with Christensen but she did forward a screen shot from a text message she said came from a person with a Northern Virginia area code that said, “Lorraine, we need to get this done. Last chance.”Three days later, Parsons wrote to POLITICO that she working with The New Yorker “to expose these hucksters.”A representative from The New Yorker referred POLITICO to a tweet by staff writer Jane Mayer, who also received the email.\"This started w/ a person claiming to be 'Lorraine' emailing that 'she' worked with Mueller at a law firm in 1974. The law firm she named, Pillsbury, says no Lorraine worked in its S.F. office with Mueller in the 1970's. That's a fact. The rest seems fishier than a tuna sandwich,\" Mayer tweeted. Burkman said in a Facebook video posted Tuesday that he is planning a press conference at “high noon” on Thursday in Arlington, Va., to “unveil the first of the sexual assault victims of Robert Mueller.\" \nLegal\n                    By JOSH GERSTEIN and DARREN SAMUELSOHNBut in a phone interview, Burkman insisted he had nothing to do with Parsons’ story.“We never paid anyone. This woman named Lorraine Parsons, I don’t know who it is. I’ve never heard of her,” he said. “I’m not sure a Lorraine Parsons exists.”Burkman is a Virginia-based Republican lobbyist with ties to the Mueller probe and other aspects of the 2016 presidential election. Last year, he organized a legal defense fund for Rick Gates after Mueller indicted the former Trump campaign deputy on charges of money laundering and failing to register as an agent of a foreign government.A federal judge rebuked Gates for violating a gag order after he appeared in a video thanking donors who gave to the fund. Burkman earlier this year also said he was shot and run over while conducting his own investigation into the murder of Seth Rich, the Democratic National Committee staffer who is the subject of a conspiracy theory claiming he played a role in the release of hacked Hillary Clinton campaign emails that WikiLeaks posted online during the 2016 presidential election.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}