{"id": "\n\n\n\nPOLITICO\n\n\nPoll: Biden, Bernie, Beto lead 2020 Dem field\n", "paragraph": "\n                More than a quarter of Democratic voters, 26 percent, say former Vice President Joe Biden is their first choice to be the 2020 Democratic nominee.  | Scott Olson/Getty Images\n2020\n                    By STEVEN SHEPARD11/12/2018 04:00 PM ESTFormer Vice President Joe Biden and Sen. Bernie Sanders (I-Vt.) enter the 2020 election cycle as the leaders for the Democratic presidential nomination to take on President Donald Trump, according to a POLITICO/Morning Consult poll conducted in the immediate aftermath of last week’s midterms.More than a quarter of Democratic voters, 26 percent, say Biden is their first choice to be the Democratic nominee. Another one-in-five, 19 percent, would pick Sanders, the runner-up for the nomination in 2016.Story Continued BelowThe two septuagenarians — Biden will be 77 on Election Day, 2020, and Sanders will be 79 — are the only two prospective candidates to garner double-digit support. The third-place candidate is Rep. Beto O’Rourke (R-Texas), who built national name-recognition through his losing Senate bid last week, with 8 percent.“Beto O’Rourke is emerging to be an outside contender for the 2020 Democratic nomination, outpacing other potential nominees,” said Tyler Sinclair, Morning Consult’s vice president. Following O’Rourke are three senators, all thought to be likely candidates: Sens. Elizabeth Warren (D-Mass.), Kamala Harris (D-Calif.) and Cory Booker (D-N.J.). Warren is at 5 percent, Harris at 4 percent and Booker at 3 percent.Of the 14 other possible Democratic candidates tested, no one else earned more than 2 percent support.The POLITICO/Morning Consult poll was conducted November 7-9, surveying 1,952 registered voters. The margin of error is plus or minus 2 percentage points.Morning Consult is a nonpartisan media and technology company that provides data-driven research and insights on politics, policy and business strategy.More details on the poll and its methodology can be found in these two documents — Toplines: https://politi.co/2RMVlkc | Crosstabs: https://politi.co/2Tb4819Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}