{"id": "\n\n\n\nPOLITICO\n\n\nXi, Pence trade barbs over trade war at APEC summit while selling visions for regional cooperation\n", "paragraph": "\n                Vice President Mike Pence and Japanese Prime Minister Shinzo Abe arrive for a family photo with leaders and their spouses during the APEC Economic Leaders Meeting summit in Port Moresby, Papua New Guinea on Saturday. | Mark Schiefelbein/AP Photo\nSouth China Morning Post\n                    By KINLING LO | SOUTH CHINA MORNING POST, LEE JEONG-HO | SOUTH CHINA MORNING POST and BHAVAN JAIPRAGAS | SOUTH CHINA MORNING POST 11/17/2018 03:14 PM ESTThis story is being published by POLITICO as part of a content partnership with the South China Morning Post. It originally appeared on scmp.com on Nov. 17, 2018.Chinese President Xi Jinping and Vice President Mike Pence traded barbs at the Asia-Pacific Economic Cooperation summit in Papua New Guinea on Saturday, with each laying the blame for the trade war and growing geopolitical rivalry at the other’s doorstep, while also seeking to sell their vision of a regional development strategy.Story Continued BelowIn a speech lasting almost 40 minutes, Xi urged the business and political leaders gathered in Port Moresby to uphold free trade and promote a multilateral system.“Unilateralism and protectionism will not solve problems but add uncertainty to the world economy,” he said. “History has shown that confrontation, whether in the form of a cold war, a hot war or a trade war, produces no winners.”When it was his turn to take to the podium, Pence was equally fervent but far more direct in his criticism.“We have great respect for President Xi and China, but as we all know, China has taken advantage of the United States for many, many years and those days are over,” he said.A speed read on global trade news — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.He then leveled a number of accusations at Beijing, including its insistence on forced technology transfers and intellectual property theft.“The U.S. will not change course until China changes its ways,” Pence said, adding that there was still room for the White House to introduce new tariffs on Chinese goods.Since July, Washington has imposed tariffs on $250 billion worth of Chinese imports, while Beijing has slapped similar duties on $110 billion worth of goods it imports from the US. In September, President Donald Trump threatened to extend the tariffs to all of the products it imports from China.Neither Xi nor Pence listened to the other’s speech, both of which were delivered from a conference room on a cruise ship moored in Port Moresby harbour.Despite his hard line, Pence said Washington “believed progress could be made” when Trump and Xi meet in the Argentinian capital Buenos Aires at the end of the month on the sidelines of the Group of 20 summit. The talks will be the first between the two leaders since the trade war began.Aside from airing their grievances on trade, Xi and Pence were equally keen to promote their nations’ respective plans for regional cooperation, respectively the “Belt and Road Initiative” and Indo-Pacific strategy.“The belt and road [plan] is an open platform for cooperation. [It is] neither designed to serve any hidden political agendas nor to target anyone,” Xi said.“It does not cause debt traps, as some want to label it, [but] is a transparent project that brings common development to the world.”\nPOLITICO MONEY PODCAST\n                    By BEN WHITEXi launched the trillion-dollar program in 2013 as a way to boost connectivity between China and the Eurasian land mass.Pence, however, made a thinly veiled attack of China’s controversial overseas infrastructure building spree.“As we are all aware, some are offering infrastructure loans to governments across the Indo-Pacific and around the world,” he said. “Yet the terms of those loans are often vague at best, projects they support are often unsustainable … too often they come with strings attached.”While he made no specific references to China, Pence urged governments in Asia to consider Washington’s Indo-Pacific Strategy, which is backed by Australia and Japan, as a preferable alternative to the belt and road plan.“Know that the U.S. offers a better option,” he said. “We don’t drown our partners in a sea of debt, we don’t coerce, or compromise your independence … We don’t offer a constricting belt or a one way road.”On the issue of China’s growing militarization of the disputed South China Sea, Pence said the U.S. would partner Australia on the upgrading of the Lombrum naval base on the Pacific nation’s Manus island.Infrastructure development, including roads, railways, ports, pipelines and airports, would be the priority of the Indo-Pacific Strategy, Pence said, adding that the U.S. would adopt a “principled approach that will stand in contrast to some other nations”.The tension between the two nations was also evident at a photo call for the leaders of the 21 Apec member nations on Saturday afternoon. While Xi stood beside Papua New Guinean President Peter O’Neill, Pence was noticeably absent from the shot.Meanwhile, Taiwan’s foreign ministry reported that the vice president met the self-ruled island’s envoy to Apec, Morris Chang, and discussed ways to “boost inclusive growth and shape the digital future”.Pence described his meeting with Chang as being “about economics”. “They were strong supporters of TPP [Trans-Pacific Partnership] and made a case for being considered for a free-trade agreement. And I assured them we would carry back that ask,” he said.In contrast, there were no reports of meetings between Chinese and American officials at the event.Xi is currently on a seven-day tour of the Asia-Pacific region. After leaving Papua New Guinea he will travel to Brunei and the Philippines for state visits, and attend the G20 summit from November 30 to December 1 in Buenos Aires.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}