{"id": "\n\n\n\nPOLITICO\n\n\nTrump administration is very 'tough on Iran,' Pompeo says\n", "paragraph": "\n                Secretary of State Mike Pompeo touted the effectiveness of the Trump administration’s so-called maximum pressure campaign. | Evan Vucci/AP Photo\nForeign Policy\n                    By DAVID BEAVERS11/04/2018 12:00 PM ESTWith new U.S. sanctions on Iran set to take effect Monday, Secretary of State Mike Pompeo boasted Sunday of the Trump administration’s efforts to be “tough on Iran.”“No one’s going to argue that Secretary Pompeo isn’t tough on Iran,” Pompeo said on “Fox News Sunday.” “And no one is going to argue that President Trump isn’t doing the same.”Story Continued BelowThe secretary of State said the administration's sanctions, which he described as the “toughest sanctions ever put in place on the Islamic Republic of Iran,” have badly hit the oil-exporting country’s economy.“We’ve already reduced Iranian crude oil exports by over a million barrels per day,” Pompeo said. “That number will fall farther.”The sanctions are being put in place as a result of the Trump administration’s withdrawal from the Obama-era nuclear deal with Iran. In addition to targeting Iran’s critical oil sector, the sanctions aim more broadly to force other countries to cut financial ties with Tehran.\nForeign Policy\n                    By DAVID BEAVERSPompeo on Sunday touted the effectiveness of the administration’s so-called maximum pressure campaign.“I’m very confident that the sanctions that will be reimposed this Monday, not only the crude oil sanctions but the financial sanctions being put in place by the Treasury Department of over 600 designations of individuals and companies in Iran, will have the intended effect: to alter the Iranian regime’s behavior,” Pompeo said. “That’s our expectation. It’s the reason for President Trump’s policy.”Pressed by host Chris Wallace to respond to critiques from some Republican lawmakers that the administration’s approach to financial sanctions is not strong enough, Pompeo pushed back.“The Iranian banks that engage in sanctionable behavior will be sanctioned by the Department of Treasury,\" he said. “Period, full stop.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}