{"id": "\n\n\n\nPOLITICO\n\n\nLast days: Midterm candidates shake, battle and troll\n", "paragraph": "\nPhoto GalleryCandidates across the country embarked this weekend on a furious dash of final-hour campaigning, racing through diners, football stadiums and even a petting zoo to rally supporters ahead of Tuesday’s midterm elections. Here’s a look at contenders making their final pitch before Nov. 6.\n                    By QUINT FORGEY11/04/2018 05:06 PM EST\n                    Updated 11/05/2018 08:32 AM ESTRepublican Senate candidate Josh Hawley greets diners during a campaign stop at Cowan's Restaurant on Saturday in Washington, Mo. | Scott Olson/Getty ImagesAbigail Spanberger, Democratic House candidate for Virginia’s 7th Congressional District, uses a rotary sander while touring Solar Mill, a sustainable manufacturing company powered entirely by solar power, on Friday in Richmond. | Win McNamee/Getty ImagesCalifornia Republican gubernatorial candidate John Cox and Young Kim, a GOP House candidate running to represent the state's 39th Congressional District, take a group photo with supporters during a campaign stop Saturday in Rowland Heights. | Jae C. Hong/AP PhotoDemocratic congressional candidate Ilhan Omar speaks to a group of supporters in Minneapolis on Saturday. | Kerem Yucel/AFP/Getty ImagesArizona congresswoman and Republican Senate candidate Martha McSally sings the national anthem before a football game at Arizona State University's Sun Devil Stadium on Saturday in Tempe. | Christian Petersen/Getty ImagesDemocratic candidate for Kentucky’s 6th Congressional District Amy McGrath greets a campaign volunteer with her daughter during a canvassing launch   Saturday in Mount Sterling. | Alex Wong/Getty ImagesRepublican Senate candidate Mike Braun arrives for a campaign stop on Saturday in Lowell, Ind. | Aaron P. Bernstein/Getty ImagesDave Young, Democratic candidate for Colorado treasurer, prepares to greet canvassers before they set out to talk to voters   Saturday in Denver. | David Zalubowski/AP PhotoRepublican Senate candidate and Florida Gov. Rick Scott speaks at a rally at Skyline Attractions on Friday in Orlando. | Jeff J Mitchell/Getty ImagesDemocratic House candidate Sharice Davids takes a photo with supporters during a rally at her campaign office  Saturday in Overland Park, Kan. | Charlie Riedel/AP PhotoTennessee Republican Senate candidate Marsha Blackburn looks at an emu in a petting zoo at Franklin Family Day at Harlinsdale Farm on Saturday in Franklin. | Drew Angerer/Getty ImagesTallahassee Mayor Andrew Gillum, Democratic candidate for Florida governor, greets people as he stumps for votes during a visit to the L.A. Lee Terrace apartment complex Saturday in Fort Lauderdale. | Joe Raedle/Getty ImagesRepublican candidate for Kansas governor Kris Kobach speaks during a rally hosted by the American Conservative Union on Friday in Kansas City, Missouri. | Charlie Riedel/AP PhotoTexas  Democratic Senate candidate Beto O'Rourke takes a break from canvassing to have lunch with his family and campaign staff  Saturday at a Whataburger in Dallas. | Chip Somodevilla/Getty ImagesFormer Republican presidential nominee and Utah Senate candidate Mitt Romney reads a children's book  Friday during a bonfire at Cornbelly's Corn Maze & Pumpkin Fest at Thanksgiving Point in Lehi, Utah. | Rick Bowmer/AP PhotoIncumbent Sen. Claire McCaskill, D-Mo., gives a thumbs-up to supporters as she appears with former Vice President Joe Biden during a campaign rally on Wednesday in Bridgeton, Missouri. \n                                                            AP Photo/Jeff RobersonA supporter (L) crosses her fingers as she talks with Democratic Senate candidate Kyrsten Sinema (R) at a get-out-the-vote event at the Arizona Education Association headquarters in Phoenix on Saturday.\n                                                            AP Photo/Bob Christie © 2018 POLITICO LLC"}