{"id": "\n\n\n\nPOLITICO\n\n\n\nFlorida\n\nScott mum, DeSantis supports Trump's proposal to end birthright citizenship \n", "paragraph": "\n                When asked by reporters in person at an 8:30 a.m. press conference held to announce funding for an Everglades project, Gov. Rick Scott did not answer and walked away.  | Getty\n                    By MATT DIXON10/30/2018 04:17 PM EDTTALLAHASSEE — President Donald Trump’s proposal to use an executive order to unilaterally get rid of “birthright citizenship,” which grants citizenship to those born in the United States, has put GOP candidates on the spot, including those at the top of the ticket in Florida.Gov. Rick Scott, who is running for Senate against Sen. Bill Nelson (D-Fla.), and Ron DeSantis, in a tight gubernatorial race against Democrat Andrew Gillum, are considered two of Trump’s closest political allies but are taking different approaches to the presidents proposal, which was floated a week before Election Day.Story Continued BelowThough not a border state, Florida is home to one of the nation’s largest immigrant populations. Though not monolithic politically, the state’s immigrant population keeps that issue in the forefront. A CBS News/YouGov poll taken earlier this month found 91 percent of respondents said immigration was “important” or “somewhat important.”Scott, who raised $20 million for Trump’s 2016 presidential bid, is noncommittal. “I have not seen the details of what the president is suggesting and would need to fully review the proposal,” his campaign said in a statement. “My priorities continue to be securing the border and fixing the long-broken immigration system.”Scott’s campaign sent that statement to reporters who asked for comment, but did no larger email blast addressing the issue. In addition, when asked by reporters in person at an 8:30 a.m. press conference held to announce funding for an Everglades project, Scott did not answer and walked away, according to the Miami Herald.The question is more difficult for Scott, who is in a race where both he and Nelson have tried to run towards the middle, seeking to file off any extreme policy edges and appeal to moderate voices. DeSantis, though, is in a race that has been focused on base voters on both sides. He and Gillum have not drastically changed campaign messages from those used in contentious primary contests. DeSantis said at an event in Tampa on Tuesday that he supports the idea, but is not sure it would survive the courts.“As a matter of policy, I don’t think the Constitution intended that people could come illegally in order to get citizenship,” DeSantis said, according to the Tampa Bay Times. “That being said, there has been a long list of our decisions that I think you’d have to reckon with.”Trump floated the idea of using an executive order to do away with the right to citizenship for those born in the U.S. and was greeted with swift push back, including from Republican House Speaker Paul Ryan, and promises of legal challenges if he ever actually signs an order. Trump told news site Axios that his legal counsel assured him the move could be done with executive order outside of congressional action.“It was always told to me that you needed a constitutional amendment,” Trump said. “Guess what? You don’t.”A weekly, must-read brief on health care news and moves in Tallahassee and around the stateA morning email with must-read analysis and breaking news on Florida politics and policy.A weekly must-read on budget politics for Florida Pros, with exclusive reporting and analysis, interviews and more. POLITICO Florida Pro's high-level outlook on the policy issues driving the month in Florida.Matt Dixon and Marc Caputo's must-read briefing on what's hot, crazy or shady about politics in the Sunshine State\n                        POLITICO ProA morning email with must-read analysis and breaking news on Florida politics and policy.\n                        POLITICO ProA weekly, must-read brief on health care news and moves in Tallahassee and around the state.\n                        POLITICO ProOur weekly digest of college and university news in the Sunshine State.\n                        POLITICO ProA weekly must-read on budget politics for Florida Pros, with exclusive reporting and analysis, interviews and more. \n                        POLITICO PROPOLITICO Florida Pro's high-level outlook no the policy issues driving the month in Florida.\n                        POLITICO ProOriginal federal and state policy documents © 2018 POLITICO LLC"}