{"id": "\n\n\n\nPOLITICO\n\n\nDemocrats bank on female voter surge to flip the House\n", "paragraph": "\n                “It means something to have representatives who look like the people we’re here to represent,” Democratic House candidate and Virginia State Sen. Jennifer Wexton said on Tuesday. | Alex Wong/Getty Images\nCongress \n                        There are early signs of a wider turnout gap between the genders than is typically seen in midterm elections.\n                    By ELANA SCHOR and STEVEN SHEPARD10/30/2018 02:30 PM EDTSTERLING, Va. — If Jennifer Wexton and fellow Democrats ride a midterm “blue wave” to take back the House, it’ll be in swing districts like this one — and in large part because of the women who showed up last weekend to canvass for her.Many of the 100-plus volunteers for the Democratic candidate on Saturday were women, reflecting what polls show is a significant advantage for the party among college-educated women in the most hotly contested districts. A midterm cycle that’s already seen record numbers of female nominees for Congress is also bringing signs of a significant boost in women donating to campaigns and ample anecdotal evidence of more women engaging in grassroots activism.Story Continued BelowWomen have historically voted at higher rates than men, and it remains to be seen whether that gender gap will grow further this year as even more women turn out to vote. But Wexton, who’s challenging Rep. Barbara Comstock (R-Va.) in a district long held by the GOP, said she’s been seeing more women participating in campaigns since last fall, when Democratic women snagged 11 of the 15 state House of Delegates seats that the party took from Republicans.“It means something to have representatives who look like the people we’re here to represent,” Wexton said in an interview after she and former Secretary of State Madeleine Albright snapped a selfie with volunteers.Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.“And these women who have come together — not just to run, but also to advocate and to create networks and to help elect people or to help advocate for particular issues — I don’t think that’s going away, no matter what happens on Nov. 6.”To the extent that the anecdotal uptick in women’s involvement on the ground can be measured, the lion’s share of it appears to be boosting Democrats’ prospects in the midterms. One Wexton volunteer, Renise Leresche, said attendance at an annual women’s summit run by an activist group she works with leaped from 350 to 750 this year. The group, Network NoVA, is “for electing Democratic — hopefully, women,” Leresche said. “But we have a lot of men who are involved in the efforts.”College-educated women favor Democrats over Republicans in 69 swing House races by 27 percentage points, according to a Washington Post/Schar School poll released earlier this month. And 78 percent of Democratic women reported themselves as “very motivated” to vote in an average of the past three weeks of POLITICO/Morning Consult polling — greater than for Republican women (65 percent), Democratic men (72 percent) or Republican men (72 percent).Democratic pollster Anna Greenberg said that while it’s tough to predict whether women will turn out at higher rates, she sees women more engaged in this election “than they have been in the past. … This enthusiasm among women is not just for women candidates.”The fact that the 2018 campaign has become a referendum on President Donald Trump’s polarizing first two years in office is stoking enthusiasm among the entire electorate, not just women. An average of 68 percent of women and 69 percent of men said they are “very motivated” to vote. But the enthusiasm edge among Democratic women tracks with what Laurie Wolfe, 43, is seeing on the ground as a co-chair of the liberal group Indivisible’s chapter in Minnesota’s 3rd District.Wolfe recalled in an interview that while she is a longtime voter, she “wasn’t active politically before the 2016 election.” Now, she added, “I’m leading a whole group of activists, mainly women, in our district.”\nInteractivesThat effort is benefiting a male Democrat, Dean Phillips, whom polls show leading Rep. Erik Paulsen (R-Minn.). As the pollster Greenberg observed, women’s high level of enthusiasm isn’t just helping female candidates such as Wexton, one of a record 235 female House nominees from both parties this year.At the liberal activism network Swing Left, which focuses on routing grassroots energy into battleground races, political director Adrienne Lever said volunteers have “a general understanding that it’s not just about supporting women. It’s [also] about supporting male candidates who are supporting women.”Though no single metric can gauge female Democrats’ motivation levels ahead of next week’s midterms, a Swing Left survey of its members who most regularly respond to calls for phone banking, canvassing and other volunteer efforts found that 73 percent were women. It’s not just volunteering that women are doing in greater numbers: The nonpartisan Center for Responsive Politics found in March that 31 percent of donations to House candidates were from women, a high-water mark since the group began tracking data in 2000.What pollsters won’t know until after next week’s votes are tallied is whether signs of heightened enthusiasm among women yield higher turnout. In the previous midterm election, in 2014, men voted for Republican House candidates by a 16-point margin, 57 percent to 41 percent, according to exit polls. Women, meanwhile, tilted blue, giving 51 percent of their votes to Democratic candidates, compared with 47 percent to Republicans.The gender gap — the difference in vote preference between men and women — could be even larger in 2018. This year, polls show men are close to evenly split between the two parties, while women go for Democrats by double-digit margins. A recent New York Times Upshot/Siena College poll of Wexton's race in Virginia found Comstock with a 2-point lead among men, 45 percent to 43 percent. But the Democrat had a 17-point lead among women, 54 percent to 37 percent.While women have historically voted at higher rates than men, the difference in turnout rates is smaller in midterm elections than in presidential years. In both the 2012 and 2016 presidential elections, the turnout rate for women was 4 percentage points greater than for men. The gap between the two genders was roughly half of that, however, in the two most recent midterms: 2014 (2.2 points) and 2010 (1.6 points).\nelections\n                    By MAGGIE SEVERNS and LORRAINE WOELLERTDemocrats' advantage among college-educated women, and the signs of rising female enthusiasm for the midterms, is likely to pay off more in the House's suburban battlegrounds than in the deep-red states where five Democratic senators are struggling to hang on. In Montana, one of those states that Trump carried by double digits, Democrat Kathleen Williams recently downplayed her reliance on female voters even as she touts her aim to bring \"stateswoman-ship\" to Congress.“Women are motivated. I think men are motivated. I think young people are motivated,\" Williams, who's challenging Rep. Greg Gianforte (R-Mont.) in an at-large House race that recent polls show statistically tied, said in an interview in Billings. \"That’s the coalition we need: progressives, independents, moderates and Republicans.\"Still, Williams said the contrast with a GOP congressman who body-slammed a reporter last year has been beneficial to her. When Trump praised Gianforte, she recalled, she was flooded with money: \"Boy, did I get a lot of donations from across the nation.\"Burgess Everett contributed to this report.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}