{"id": "\n\n\n\nPOLITICO\n\n\nTop police official seeking Trump job reversed position on criminal justice bill\n", "paragraph": "\n                Chuck Canterbury, the head of the Fraternal Order of Police, stood beside President Donald Trump on Wednesday at an event celebrating the proposed criminal justice bill.  | Tasos Katopodis/AFP/Getty Images \nWhite House \n                        Critics of the sentencing reform measure note that the Fraternal Order of Police dropped its opposition to the measure at a time when its chief, Chuck Canterbury, is a candidate to run the ATF.\n                    By GABBY ORR, BURGESS EVERETT and ELIANA JOHNSON11/16/2018 07:34 PM ESTPresident Donald Trump is considering a top national police official to be his director of the Bureau of Alcohol, Tobacco, Firearms and Explosives, an appointment that critics say could be a potential reward for his support of a White House-backed sentencing reform bill.Opponents of bipartisan legislation to overhaul federal sentencing guidelines were surprised to see Chuck Canterbury, the head of the influential Fraternal Order of Police, standing beside Trump on Wednesday at an event celebrating the proposed measure. The police group, which Canterbury has headed for more than a decade, had previously opposed the legislation.Story Continued BelowIt was an unusual move for the law enforcement veteran, who enthusiastically testified at last year’s Senate confirmation hearing on behalf of Jeff Sessions, Trump's recently dismissed attorney general and a high-profile opponent of the criminal justice reform legislation. Canterbury’s group said in a statement ahead of the president’s endorsement that the First Step Act would boost safety “in our streets and neighborhoods” and better protect police.“We are proud to stand with President Trump on this issue,” he said Wednesday.Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.But Congressional opponents of the bill are suspicious of the FOP's endorsement, given that Canterbury has been seeking a top job in the Trump administration, according to two Republican aides. “They should get something out of this,” said one law enforcement official, who opposed the plan and thought Canterbury went “out on a limb” by signing off on it. “I would guess in some way this is not going to be the perfect bill.”The legislation hit an additional snag after Senate Majority Leader Mitch McConnell said he may not have time to bring it to the Senate floor for a vote this year, emphasizing that time is tight and he plans to prioritize a spending bill that would prevent the government from partially shutting down on Dec. 7, as well as a farm bill that will funnel money to rural parts of the country that form the bedrock of the Republican Party's support. Canterbury recently emerged as a contender for ATF, where deputy director Thomas Brandon has served as the acting head since April 2015, according to three sources familiar with the situation. He has for months been lobbying for a “big job” in the administration, according to a former White House official, who said Canterbury’s name was bandied about for several roles.Canterbury has a “very good relationship” with Trump, according to a close friend, and has been a regular presence at White House listening sessions on immigration and issues affecting law enforcement. At a late October board meeting, he told colleagues he was flattered to have had his name floated for ATF chief, but had not formally been offered the job, according to a person in the room. This person said Canterbury is currently running for an eighth term as head of the FOP, describing the competitive re-election process as “like running for Congress nationwide.”“Chuck is one of the most honorable people I’ve ever worked with and if he is selected, I can’t think of a finer person to take the position,” Jonathan Thompson, executive director of the National Sheriffs’ Association, told POLITICO.\nMedia \n                    By JASON SCHWARTZBut Thompson’s group, which represents over 3,000 elected sheriffs in the U.S., was among several to forcefully push back on the legislation, claiming in a statement this week that the bill would “release dangerous criminals back into our communities… [and] falls far short in the funding, personnel and social services needed to protect our communities.”Republican senators who have withheld support for the measure, which would require 60 “yes” votes to pass the upper chamber, cited the opposition by Thompson’s organization in defending their own position.“I put great weight on the views of those sheriffs,” said Sen. Tom Cotton (R-Ark.). “They have grave concerns about a ‘social experiment’ of this kind.”Like other opponents, Cotton said he would prefer that the legislation “focus on prison reform and give prisoners who are on their way out of prison a chance to land on their feet,” instead of introducing greater leniency in mandatory minimum sentencing for serious offenders.The Fraternal Order’s endorsement puzzled its law enforcement community allies in part because it was a reversal of its earlier position. Canterbury and his team had several meetings and phone calls with White House officials, including the president's son-in-law, Jared Kushner, between August, when the group reportedly described the proposal as “unworkable,” and Trump’s declaration of support this week. “There were regular phone conversations with staff and we sent a letter to the president articulating our concerns,” said FOP executive director Jim Pasco.\nCongress\n                    By RACHAEL BADE“Pasco said the group struck “common ground” after changes were made to the bill, including the removal of conditions that would have eased existing limitations on early release for persons who used firearms in the commission of their crimes.”“We wanted it to be well-defined that violent felons wouldn’t get reduced sentences,” Canterbury told the Washington Post.Others suggested the FOP was never truly against the legislation and made it easy for the administration to secure their support. “They were ready to fold pretty quickly,” said the law enforcement official, who claimed the group at one point simply requested a “study on the effects” of the legislation in order to throw their weight behind it.Those claiming the group’s endorsement was linked in some fashion to Canterbury angling for a Trump administration post are playing “part of the game in Washington,” Pasco said.“It was a confluence of timing. I don’t think there’s anything nefarious or untoward,” added the person close to Canterbury.Should the bill pass the Senate, it would return to the House where proponents of the legislation have already begun whipping support in its favor. One potential problem as the plan moves forward is acting Attorney General Matt Whitaker, who has privately warned Trump about aspects of the bill related to illicit drugs. However, Sen. Lindsey Graham (R-S.C.) told the Post that Whitaker “doesn’t want to kill it” following a meeting with the interim attorney general.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}