{"id": "\n\n\n\nPOLITICO\n\nPOLITICO Playbook: New polls show Democrats hold an advantage to win the HouseFollow us on TwitterSubscribe to the POLITICO Playbook family", "paragraph": "\n                                                            PoliticoPOLITICO's must-read briefing on what's driving the day in Washington Get the Playbook NewsletterBy signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.By  ANNA PALMER,  JAKE SHERMAN and  DANIEL LIPPMAN 11/04/2018 11:02 AM ESTPresented by\n                            Mark Wilson/Getty ImagesTHE WHITE HOUSE is not releasing PRESIDENT DONALD TRUMP’S schedule this week. Tomorrow, the president will hold rallies in: Cleveland, Fort Wayne, Ind., and Cape Girardeau, Mo. -- TODAY … TRUMP will be in Macon, Ga., for a 3:55 p.m. rally. He then will fly to Chattanooga, Tenn., for a 7:05 p.m. rally. VP MIKE PENCE will be with him in Tennessee. CONSISTENCY: The Washington Post/ABC and Wall Street Journal/NBC polls are showing generally the same thing: voters prefer Democrats by seven or so points. Top Republicans have been telling us all year that the generic needs to be at D+4 to D+6 for Republicans to have a chance. WAPO’S DAN BALZ and SCOTT CLEMENT lay it out on A1: “Democrats lead in House preferences, but positive views of the economy and concern about border security may buoy Republicans, poll finds”: “Democrats retain their advantage in the battle for the House, but Republicans could be buoyed by increasingly positive assessments of the economy and by President Trump’s harsh focus on the issues of immigration and border security, according to a new Washington Post-ABC News national poll.“The poll finds that registered voters prefer Democratic candidates for the House over Republican candidates by 50 percent to 43 percent. That marks a slight decline from last month, when Democrats led on the generic congressional ballot by 11 points, and a bigger drop from August, when they enjoyed a 14-point advantage.“Democrats also have a 51-to- 44 percent advantage among likely voters identified by The Post. That seven-point margin, which is in line with other polls taken in the past two weeks, puts Democrats roughly within range of what they probably will need in the overall national vote for the House to capture a majority from the Republicans, based on calculations from previous midterm campaigns.” WaPo-- WSJ poll story, by Janet Hook.Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Happy Sunday morning. There are TWO DAYS until Election Day 2018.MILITARY BUILDUP AT THE BORDER … -- GETTY IMAGES’ JOHN MOORE (@jbmoorephoto): “U.S. Army troops, part of ‘Operation Faithful Patriot’ arrived to the U.S. border with Mexico, deployed by President Trump ahead of midterms. Soldiers spread out barbed wire along the Rio Grande in south Texas. #immigration #border #caravanamigrante #undocumented #army”. 4 pix-- OH BOY … WAPO: MARY LEE GRANT in Falfurrias, Texas and NICK MIROFF: “U.S. militia groups head to border, stirred by Trump’s call to arms”: “Gun-carrying civilian groups and border vigilantes have heard a call to arms in President Trump’s warnings about threats to American security posed by caravans of Central American migrants moving through Mexico. They’re packing coolers and tents, oiling rifles and tuning up aerial drones, with plans to form caravans of their own and trail American troops to the border.“‘We’ll observe and report, and offer aid in any way we can,’ said Shannon McGauley, a bail bondsman in the Dallas suburbs who is president of the Texas Minutemen. McGauley said he was preparing to head for the Rio Grande in coming days.” WaPoA message from Delta Air Lines:Connecting armed service members with their loved ones while they undergo treatment and recovery is a small way to say thank you to the men and women who bravely serve us. Learn more on how Delta is committed to supporting veterans, active service members and their families nationwide at DeltaTakingAction.com.LAST GASP … MIDTERM ROUNDUP … -- DES MOINES REGISTER: “New Iowa Poll suggests closer contest than usual for Steve King as he battles controversy,” by Brianne Pfannenstiel: “In King’s 4th District, the unnamed Republican candidate leads the unnamed Democrat by 4 percentage points. That's in contrast to Republican Gov. Kim Reynolds, who leads the 4th District by 9 percentage points in her race against Democrat Fred Hubbell.” DSM-- CHICAGO TRIBUNE, on the blueing suburbs and exurbs: “The 6th Congressional District seat [Henry] Hyde held until making way for Peter Roskam in 2007 is one of the top targeted seats for a Democratic takeover through challenger Sean Casten of Downers Grove.“Much of Hyde’s old congressional territory in eastern DuPage is now represented by Democrats — U.S. Reps. Mike Quigley of Chicago and Raja Krishnamoorthi of Schaumburg — and former Republican Congressman Harris Fawell, who represented what is now Roskam’s 6th District, has a Casten sign in his front yard in Glen Ellyn.“Additionally, an exurban congressional seat that includes portions of DuPage, held by Republican U.S. Rep. Randy Hultgren of Plano, is under intense competition from Democratic challenger Lauren Underwood of Naperville.” Chicago Tribune … The Guardian's Ben Jacobs on Roskam-- L.A. TIMES: “Decline of white Republicans on L.A.’s northern outskirts puts GOP at risk in midterm election,” by Michael Finnegan: “California’s sorely diminished Republican Party has few footholds left in Los Angeles County, and it risks losing its biggest one in the midterm election on Tuesday: the House seat of Rep. Steve Knight of Palmdale.“Rapidly expanding racial and ethnic diversity on the northern edge of L.A.’s suburban sprawl has opened a path for Knight’s Democratic rival, Katie Hill, to seize this once-solid Republican turf.“The state’s 25th Congressional District — it covers the Antelope Valley, Santa Clarita and Simi Valley — is a lot less white and less Republican than it used to be. The white share of the population has dropped to 40%.“As the campaign draws to a close, President Trump’s stop-the-caravan, troops-to-the-border crusade could further imperil Knight and other Republicans on the ballot in L.A. and Orange counties. For more than two decades, the party’s belligerence on immigration has proved toxic in California.” LAT-- MATT DIXON in Tallahassee: “At DeSantis rally, Perdue says Florida governor’s race ‘so cotton-pickin’ important’”: “During a Saturday rally for Florida Republican gubernatorial candidate Ron DeSantis, President Donald Trump’s top agriculture official used the term ‘cotton-pickin’ to describe the importance of Florida’s gubernatorial race, which also features Democrat Andrew Gillum, who is running to be Florida's first black governor. “‘Public policy matters. Leadership matters,’ said Agriculture Secretary Sonny Perdue said at a Lakeland rally, according to audio provided by American Bridge. ‘And that is why this election is so cotton-pickin’ important to the state of Florida. I hope you all don’t mess it up.’” POLITICO … AudioDONALD TRUMP JR. says NANCY PELOSI is “TIRED OLD” in a radio ad for HOUSE FREEDOM CAUCUS CHAIRMAN MARK MEADOWS (R-N.C.): “This is Donald Trump Jr. and I need to tell you something of the utmost importance to my dad, our president, and how we can continue making America great again. We need you to vote for my good friend, Congressman Mark Meadows, the chairman of the Freedom Caucus. “MARK IS ONE OF MY DAD’S closest allies in Congress. Without Mark Meadows, the MAGA agenda would not be working. If you don’t vote, the Democrats will take control of Congress and tired old Nancy Pelosi will take the gavel in the House of Representatives, where she’ll try to impeach my father and Justice Kavanaugh and enact her radical socialist agenda of government-run healthcare, high taxes and gun bans. “AND THAT’S ALL BEFORE JANUARY 15TH. Once again, this is Donald Trump Jr. and we need you to vote for my dad’s number one ally, Congressman Mark Meadows, or every part of the MAGA agenda and my father’s presidency is in serious jeopardy.” Listen to the ad-- PELOSI has been in 30 cities in 31 days in October, so she doesn’t appear tired. And she has said she would not move to impeach Trump and Kavanaugh. But this does appear to be a useful preview of how Republicans are going to talk about Pelosi if she becomes the speaker of the House.-- JAMES ARKIN: “Don Jr. to attend 6 rallies in 1 day for House Republicans”SUNDAY BEST … -- CHRIS WALLACE spoke with DSCC CHAIRMAN CHRIS VAN HOLLEN (Md.) on “FOX NEWS SUNDAY”: CVH: “This is the toughest political map any one party has faced in 60 years. And if you were to have asked people a year and a half ago where we would be, you would not even be asking the question about whether or not we have a path to a Senate Democratic majority. The answer is: we do have a path, it is a very narrow path, as you indicate, but the fact that we’re as competitive as we are is a real testament to our senators and our candidates who have always said that their North Star is standing up for the people of their states, that’s their first and foremost priority, and that’s what they’ve been doing.”-- CHUCK TODD spoke with STACEY ABRAMS on NBC’S “MEET THE PRESS”: TODD: “The president’s going to be in Macon, Georgia today. He said you just simply weren’t qualified to be governor. He didn’t say why. How did you take that assessment?”ABRAMS: “I find his assessments to be vapid and shallow. I am the most qualified candidate. I am a business owner. I’m a tax attorney, who was trained at Yale Law School. I am a civic leader who helped register more than 200,000 Georgians. I am a very accomplished political leader who worked across the aisle to improve access to education, transportation, and I blocked the single largest tax increase in Georgia’s history. There is no one more qualified standing for this office in Georgia. And I look forward to having the voters of Georgia say the same.” -- NOTE: Josh Hawley dropped out of his scheduled appearance on MTP, according to an NBC spokesman.-- GOTTA BE A JOKE, RIGHT? … RONNA ROMNEY MCDANIEL to GEORGE STEPHANOPOULOS on ABC’S “THIS WEEK”: “The president’s talking about all of the accomplishments. The media's talking about immigration, and I get that.”-- JAKE TAPPER spoke with MCDANIEL on CNN’S “STATE OF THE UNION” about the controversial web video that blamed Democrats for letting a killer into the U.S.: TAPPER: “You don’t -- it’s factually inaccurate and it’s racially incendiary. You don’t have any issue with that?” MCDANIEL: “It’s -- I have an issue with our immigration system that’s not being fixed, and Democrats won’t work with the president. And we have caravans coming.”WHAT AMERICA IS READING … L.A. TIMES: “GOP enters loss-cutting mode: Vulnerable in the House, party focuses on firing up base and gaining in Senate” … BOSTON GLOBE: “Democrats seek to repair their Blue Wall: Midterms offer opportunity to reclaim Mich., Pa., Wis.” … CHARLOTTE OBSERVER: “Trump on minds -- if not ballots -- of voters in NC”CONSULTANTS STILL RIDING HIGH IN RIYADH ... “Consulting Firms Keep a Lucrative Saudi Alliance, Shaping Crown Prince’s Vision,” by NYT’s Michael Forsythe, Mark Mazzetti, Ben Hubbard and Walt Bogdanich: “[W]hile Mr. Khashoggi’s death prompted investors from around the globe to distance themselves from the Saudi government, Booz Allen and its competitors McKinsey & Company and Boston Consulting Group have stayed close after playing critical roles in Prince Mohammed’s drive to consolidate power.“In addition to standard consulting work like doling out economic advice and helping burnish Prince Mohammed’s image, they have taken on more unconventional assignments.“Booz Allen trains the Saudi Navy as it runs a blockade in the war in Yemen, a disaster that has threatened millions with starvation. McKinsey produced a report that may have aided Mr. Qahtani’s crackdown on dissidents. BCG advises Prince Mohammed’s foundation. The work is lucrative — the three firms have earned hundreds of millions of dollars altogether on projects in Saudi Arabia. McKinsey’s work in the kingdom grew from two Saudi projects in 2010 to almost 50 the following year and kept accelerating, to almost 600 projects from 2011 to 2016.“McKinsey consultants spread across the kingdom in recent years to advise government agencies such as the planning ministry, nicknamed the ‘Ministry of McKinsey’ by some Saudis; the royal court; and a coterie of companies in industries such as banking, media, telecommunications, real estate and energy, internal McKinsey documents viewed by The New York Times showed. Last year, McKinsey bought a politically connected Saudi consultancy, adding that firm’s 140 employees to more than 300 already in the region.” NYTTAKE THE PLAYBOOK ELECTION CHALLENGE -- See if you can correctly pick the winning candidates in some of the most competitive House, Senate and gubernatorial races in the country. Sign up today!\nPHOTO DU JOUR: President Donald Trump and Vice President Mike Pence wave to supporters at a rally on Saturday, Nov. 3, 2018, in Pensacola, Florida. | Butch Dill/AP PhotoAT WAR … “Utahns mourn loss of ‘genuine hero’: North Ogden Mayor Brent Taylor killed in Afghanistan in apparent insider attack,” by the Salt Lake Tribune’s Paighten Harkins: “After he got his orders in January to deploy to Afghanistan, North Ogden Mayor Brent Taylor went live on Facebook to tell his constituents he’d be gone and what to expect. It was an easy choice for him, one that was months in the making, rooted in decisions he’d made years ago to serve God, his family and his country.“‘While I am far from perfect in any of these respects,’ he said, ‘I have given my life to serve all three of these loyalties whenever and however I can.’ The plan was to be gone one year. Family learned Saturday he’d never return. Taylor was killed during an apparent insider attack early Saturday in Kabul. The attacker was immediately killed by Afghan Forces, according to NATO.” Salt Lake TribuneDEEP DIVE -- “How the Trump Administration Fought to Ask About Citizenship on the Census,” by NYT’s Michael Wines: “Pressed on whether partisan politics colored consideration of the question, [Commerce Secretary Wilbur] Ross said in sworn testimony to Congress in March that he was responding ‘solely’ to a Justice Department request for data to enforce the 1965 Voting Rights Act. He also said he knew of no talks with the White House about the matter. But that story has since unraveled. Internal government documents produced in the principal lawsuit on the issue, in New York, show Mr. Ross pressured the Justice Department to request the citizenship question, not the other way around.“They also show the involvement of President Trump’s chief strategist at the time, Stephen K. Bannon, in the discussions. After Mr. Bannon requested that Mr. Ross ‘talk to someone about the census,’ Mr. Ross met with Kris Kobach, a fierce immigration opponent whom President Trump had appointed to a panel on voter fraud.” NYTBONUS GREAT WEEKEND READS, curated by Daniel Lippman:-- “The Big Meltdown,” by Craig Welch in NatGeo: “As the Antarctic Peninsula heats up, the rules of life there are being ripped apart. Alarmed scientists aren’t sure what all the change means for the future.” NatGeo (h/t Longform.org)-- “The planet’s hidden climate change” – Reuters: “The seas cover 71% of the Earth and are home to the vast majority of living things on the planet. Water temperatures are rising.” Reuters-- “The Museum of J. Stalin’s Underground Printing Press,” by Christopher Marcisz in Popula: “Just blocks away from the press museum is a George W. Bush Street, and another named for the Russophobic late Polish President Lech Kaczynski.” Popula-- “A Hundred Years After the Armistice,” by Adam Hochschild in the New Yorker: “If you think the First World War began senselessly, consider how it ended.” New Yorker-- “The Unsolved Murder of an Unusual Billionaire,” by Matthew Campbell in Bloomberg Businessweek: “Last December, a Canadian pharmaceuticals executive and his wife were strangled in their home. No one knows who did it or why, but everyone has a theory.” Bloomberg-- “U.S. Law Enforcement Failed to See the Threat of White Nationalism. Now They Don’t Know How to Stop It,” by Janet Reitman on the cover of next Sunday’s NYT Magazine: “For two decades, domestic counterterrorism strategy has ignored the rising danger of far-right extremism. In the atmosphere of willful indifference, a virulent movement has grown and metastasized.” NYT … The cover-- “My Father Says He’s a ‘Targeted Individual.’ Maybe We All Are,” by Jean Guerrero in Wired – per Longreads.com’s description: “When Jean Guerrero’s father told her that the CIA was monitoring him, she didn’t dismiss him as sick or crazy. She investigated his claims the way a journalist should, and she began to see our digital world very differently.” Wired-- “America’s Other Family-Separation Crisis,” by the New Yorker’s Sarah Stillman: “Sending a mother to prison can have a devastating effect on her children. Why, then, do we lock so many women up?” New Yorker-- “The Time Bandits of Southern California,” by Amy Wallace in GQ: “The true story of a ring of thieves who stole millions of dollars’ worth of luxury watches—and the special agent who brought them down.” GQ (h/t Longform.org)-- “Tricky Dick and the Man in Black” – The new Netflix film started streaming this weekend as episode two of the series “ReMastered” – per the film’s consulting producer John Meroney: “What happens when Johnny Cash, a self-described ‘dove with claws,’ performs for President Richard M. Nixon as the Vietnam War rages?” Netflix ... The trailer-- “Cancer-linked Chemicals Manufactured by 3M Are Turning Up in Drinking Water,” by Tiffany Kary and Christopher Cannon in Bloomberg Businessweek: “3M’s manufacturing plant along the banks of the Mississippi River in Cottage Grove, Minnesota.” BloombergSPOTTED: Anderson Cooper yesterday at Vida Fitness on U St. He was doing shoulders and arms, according to our tipster.MEDIAWATCH – AP’S KEN THOMAS (@KThomasDC): “Excited to announce I’ll be joining @WSJ in mid-Nov. to cover Democrats + the 2020 campaign. Grateful to @AP for the chance to work in IA FL + DC (and countless datelines) w/ the best colleagues anyone could ask for in journalism.”WEEKEND WEDDING – “Katelyn Polantz, Jared Soares” – N.Y. Times: “Ms. Polantz, 31, is a senior writer at CNN, covering justice and law in Washington. She graduated from the University of Pittsburgh. ... Mr. Soares, 36, is a documentary and portrait photographer in Washington whose work has been published in The New York Times, The New Yorker, Rolling Stone magazine and other publications. He graduated from the University of Kansas.” With a pic. NYT … Wedding picBIRTHDAYS: Jeremy Bernard (hat tip: Tammy Haddad) ... Kathy Griffin ... Kit Seelye ... Laura Bush is 72 ... BuzzFeed editor-in-chief Ben Smith … U.S. Chamber’s Blair Latoff Holmes … Craig Stevens … Ashley Estes Kavanaugh … Rima Sirota of the Georgetown University Law Center (h/t Jon Haber) … Michael Fontneau … Alice Tong … Ken Weinstein, president and CEO of the Hudson Institute, is 57 ... Eric Wagner of Bloomberg Government … Toby Lam … AP’s Alex Sanz … WTOP’s Hillary Howard … WaPo’s Mike DeBonis ... Carlos Gutierrez, chair at Albright Stonebridge and former Secretary of Commerce under Bush 43 (h/t Ben Chang) ... Will Shaw ... Michael Clauser ... Rep. John Yarmuth (D-Ky.) is 71 ... Rep. Richard Hudson (R-N.C.) is 47 ... Emma Kenyon of Sen. McCaskill’s office (h/t Sophie White) ... Laylee Ghiasi ... Darla Bunting ... Jessica Reis, VP at Greenberg Quinlan Rosner, is 35 (h/ts Anthony DeAngelo and Mitchell Rivard) ... … Politico rising star Gabby Orr (h/t Sarah Westwood) ... Rick Ungar ... Politico’s Olivia Rogin ... Amanda Thayer ... GPG’s Max Gleischman (h/t Lilly) … Julie Siegel, banking counsel for Sen. Warren (D-Mass.) ... Jean Roseme ... Katie Hughes, who recently left CRC ... Jonathan Damato ... Tim Saler (h/t Matt Moon) ... Catherine De Castelbajac … Ezra Mechaber ... Florencia Iriondo ... Lucy Tutwiler Hodas … Brian J. Siebel … Jacques Haeringer … Kevin McVicker ... Trish Turner … Carol Miller ... Michael Hough ... Matt Goulding ... Aaron White … Elena Chiriboga … Markus Palmgren … Joe Vidunas … Morgan Mohr ... Kari Kant … Jeremy Chwat is 43 ... Ira Fishman, COO/managing director of the NFL Players Association ... Danny O’Driscoll ... Kristin Hardy-Artikaslan … Susan Knapp ... Jared Kleinstein ... Sloan Rappoport ... Julie Tippens ... Lynde Uihlein ... Casey Sinnwell ... Hal Malchow (h/ts Teresa Vilmain)A message from Delta Air Lines:Connecting armed service members with their family and loved ones while they undergo treatment and recovery through Delta’s SkyWish program is just a small way to say thank you to the men and women who bravely serve us. Over the past five years, Delta and its customers have donated 148 million miles to Fisher House and Luke’s Wings to provide air travel to wounded, injured, or ill service members, veterans and their families. Learn more on how Delta is committed to supporting veterans and active service members throughout the U.S. at DeltaTakingAction.com.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}