{"id": "\n\n\n\nPOLITICO\n\n\nTrump schedules Mississippi rallies to boost Hyde-Smith\n", "paragraph": "\n                President Donald Trump's upcoming rallies for Sen. Cindy Hyde-Smith will mark his first campaign stops since his mad dash of appearances across the country leading up to the midterm elections on Nov. 6. | Rogelio V. Solis/AP Photo\nElections\n                    By QUINT FORGEY11/17/2018 02:46 PM ESTPresident Donald Trump will appear in Mississippi later this month to shore up support for Republican Sen. Cindy Hyde-Smith, whose once-bulletproof bid for another two years in the chamber has become increasingly imperiled following comments involving a public hanging and voter suppression.Trump’s visit has been in the works for several days, and the National Republican Senatorial Committee is expected to spend more than $1 million on a TV ad blitz bolstering Hyde-Smith ahead of Election Day on Nov. 27.Story Continued BelowAppointed by Gov. Phil Bryant in March to fill retiring GOP Sen. Thad Cochran’s seat, Hyde-Smith is facing Democrat Mike Espy in a runoff election to serve out the remainder of Cochran’s term, which ends in January 2021.But her campaign in deep-red Mississippi has become the subject of national scrutiny over the past week, after a video appeared on social media Sunday of the senator saying that if she were invited by one of her supporters to a \"public hanging,\" she would be in \"the front row.\"Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.On Thursday, another video surfaced of Hyde-Smith telling a group of people that “there's a lot of liberal folks in those other schools who that maybe we don't want to vote. Maybe we want to make it just a little more difficult. So, I think that's a great idea.”The high-profile missteps in the campaign's final weeks have alarmed national Republicans, and fueled Democratic hopes that the party might be able to narrowly capture a previously unattainable Senate seat in an overwhelmingly conservative state. The president won Mississippi by nearly 18 percentage points in the 2016 presidential election.Trump is scheduled to headline two Make America Great Again rallies for Hyde-Smith on Nov. 26, the eve of the election, in Tupelo and Biloxi. Those events will mark the president’s first campaign stops since his mad dash of appearances across the country leading up to the midterm elections on Nov. 6.“President Trump is so committed to getting out the vote for Cindy Hyde-Smith that he scheduled two rallies in the great State of Mississippi on the day before the run-off election,” Trump campaign chief operating officer Michael Glassner said in a news release. “The President needs all hands on deck on Election Day on November 27 so he can continue to count on Senator Hyde-Smith’s outstanding support for his America First agenda.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}