{"id": "\n\n\n\nPOLITICO\n\n\n\nFlorida\n\nJeb Bush: Broward election chief should be removed from office\n", "paragraph": "\n                “There is no question that Broward County Supervisor of Elections Brenda Snipes failed to comply with Florida law on multiple counts, undermining Floridians’ confidence in our electoral process,” the former Florida governor tweeted.  | AP Photo/Pablo Martinez Monsivais\n                    By MATT DIXON11/12/2018 03:55 PM ESTTALLAHASSEE — Former Florida Republican Gov. Jeb Bush on Monday called for embattled Broward County election chief Brenda Snipes to be removed from office, adding fuel to a Republican effort to cast doubt on the validity of statewide election results.The Broward County Supervisor of Elections Office, to which Bush appointed Snipes in 2003, has come under fire since Tuesday’s election. The office continued on Monday to count tens of thousands of ballots, leading some Republicans — cheered on by President Donald Trump — to accuse the office of fraud without offering any evidence of wrongdoing.Story Continued Below“There is no question that Broward County Supervisor of Elections Brenda Snipes failed to comply with Florida law on multiple counts, undermining Floridians’ confidence in our electoral process,” Bush tweeted to his 1.4 million followers. “Supervisor Snipes should be removed from her office following the recounts.”At several points in recent days, Snipes’ office could not say how many ballots were left to count. The office has already lost a public records fight with the Senate campaign of Republican Gov. Rick Scott. And she’s losing the support of fellow Democrats, too.Snipes has been one of the most scrutinized election officials in the country since she was first appointed by Bush. In May, a federal judge said she violated state and federal laws by destroying ballots from the 2016 reelection bid of Democratic Rep. Debbie Wasserman Schultz.She has become the scapegoat upon which many Republicans are blaming the Florida GOP’s midterm election woes. Some state officials say her lax oversight has created an office where election fraud can happen. On Twitter, Trump has pointed to Scott’s shrinking lead over Democratic Sen. Bill Nelson as evidence of fraud in Broward County, though state law allowed local election offices to count ballots until noon Saturday. Last week, Trump tweeted about “The Broward Effect,” and wondered why none of the “found” votes were for Republicans. The president tweeted Monday, Veteran’s Day, that the counting should stop and the results from election night should stand — an outcome that, some noted, could lead to the disfranchisement of military members stationed overseas.“The Florida Election should be called in favor of Rick Scott and Ron DeSantis in that large numbers of new ballots showed up out of nowhere, and many ballots are missing or forged,” Trump wrote. “An honest vote count is no longer possible-ballots massively infected. Must go with Election Night!A weekly, must-read brief on health care news and moves in Tallahassee and around the stateA morning email with must-read analysis and breaking news on Florida politics and policy.A weekly must-read on budget politics for Florida Pros, with exclusive reporting and analysis, interviews and more. POLITICO Florida Pro's high-level outlook on the policy issues driving the month in Florida.Matt Dixon and Marc Caputo's must-read briefing on what's hot, crazy or shady about politics in the Sunshine State\n                        POLITICO ProA morning email with must-read analysis and breaking news on Florida politics and policy.\n                        POLITICO ProA weekly, must-read brief on health care news and moves in Tallahassee and around the state.\n                        POLITICO ProOur weekly digest of college and university news in the Sunshine State.\n                        POLITICO ProA weekly must-read on budget politics for Florida Pros, with exclusive reporting and analysis, interviews and more. \n                        POLITICO PROPOLITICO Florida Pro's high-level outlook no the policy issues driving the month in Florida.\n                        POLITICO ProOriginal federal and state policy documents © 2018 POLITICO LLC"}