{"id": "\n\n\n\nPOLITICO\n\nPOLITICO Playbook PM: Pelosi sends letter, says Dems ‘need to be unified’Follow us on TwitterSubscribe to the POLITICO Playbook family", "paragraph": "\n                                                            PoliticoPOLITICO's must-read briefing on what's driving the afternoon in Washington  Get Playbook PMBy signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.By  ANNA PALMER,  JAKE SHERMAN,  DANIEL LIPPMAN and  GARRETT ROSS 11/12/2018 12:57 PM ESTPresented by\n                            House Minority Leader Nancy Pelosi (D-Calif.) sent a letter to House Democrats today ahead of Congress' return for the lame-duck session. | Alex Wong/Getty ImagesNANCY PELOSI sent a letter to House Democrats today … HIGHLIGHTS: “As we travel to Washington for this lame duck period, House Democrats are anything but lame ducks. We are flying high and taking pride in the greatest Democratic victory in the House since 1974. … “We have great opportunity, and therefore great responsibility to get results for the American people. In the next few weeks, we need to be unified, find common ground with Republicans in our legislative engagements, but stand our ground when we must.” The full letter NYT’S SHERYL GAY STOLBERG -- “Meet the New House Democrats: They Could Be a Management Headache”: “When these and other newly elected House Democrats arrive in Washington for their orientation this week, they will reflect the most diverse, most female freshman class in history — a group of political neophytes, savvy veterans of the Obama and Clinton administrations, as well as the first Muslim women and Native American women ever elected to Congress.“The class is ideologically diverse as well, spanning the philosophical spectrum from Alexandria Ocasio-Cortez, a self-described democratic socialist from New York, to Joe Cunningham, a South Carolina lawyer who won a stunning upset victory in the Charleston suburbs, on the strength of his promises to put ‘country over party’ and work with President Trump.” NYT SPOTTED: John Kerry walking around Paris alone. COLUMBUS DISPATCH’S JESSICA WEHRMAN: “Sherrod Brown for president? He’s thinking about it”: “‘My first mission is to encourage people to start talking about (American workers) more, reaching out to people in the industrial Midwest,’ he said. ‘We’ll see later on about the presidential race. But we are thinking about it for the first time seriously.’“Brown ... said regardless of whether he runs, he wants Democrats who are seeking the White House to use lessons from his race as a blueprint for how to run in the industrial Midwest.” Columbus Dispatch PREPPING THE ATTACK … THE PRESIDENT, at 10:34 a.m.: “The prospect of Presidential Harassment by the Dems is causing the Stock Market big headaches!”-- MOST ECONOMISTS believe the economy will slow down, but Trump has a useful foil: House Democrats. Also, “presidential harassment” is clearly in the talking points. SENATE MAJORITY LEADER MITCH MCCONNELL (R-KY.) used it last week in the Capitol.REALLY, WALL STREET JOURNAL OPINION SECTION? REP. JASON LEWIS, a Minnesota Republican who lost last week, writes this: “Who Lost The House? John McCain: His July 2017 vote killed ObamaCare repeal and made Democratic lies impossible to refute.”-- THIS IS TASTELESS, for starters. And it also doesn’t make any sense. Lewis writes that McCain’s decision to vote against the health care bill “prompted a ‘green wave’ of liberal special-interest money, which was used to propagate false claims that the House plan ‘gutted coverage for people with pre-existing conditions.’” How did the Republicans’ inability to repeal Obamacare spark a flood of Democratic donations?Good Monday afternoon.A message from Delta Air Lines:Connecting armed service members with their loved ones while they undergo treatment and recovery is a small way to say thank you to the men and women who bravely serve us. Learn more on how Delta is committed to supporting veterans, active service members and their families nationwide at DeltaTakingAction.com.WHAT’S ON THE PRESIDENT’S MIND -- @realDonaldTrump at 7:03 a.m.: “Just returned from France where much was accomplished in my meetings with World Leaders. Never easy bringing up the fact that the U.S. must be treated fairly, which it hasn’t, on both Military and Trade. We pay for LARGE portions of other countries military protection,........”… at 7:10 a.m.: “.....hundreds of billions of dollars, for the great privilege of losing hundreds of billions of dollars with these same countries on trade. I told them that this situation cannot continue -- It is, and always has been, ridiculously unfair to the United States. Massive amounts.....”… at 7:21 a.m.: “.....of money spent on protecting other countries, and we get nothing but Trade Deficits and Losses. It is time that these very rich countries either pay the United States for its great military protection, or protect themselves...and Trade must be made FREE and FAIR!”… at 7:44 a.m.: “The Florida Election should be called in favor of Rick Scott and Ron DeSantis in that large numbers of new ballots showed up out of nowhere, and many ballots are missing or forged. An honest vote count is no longer possible-ballots massively infected. Must go with Election Night!”Sign up for our must-read newsletter on what's driving the afternoon in Washington.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.THE LATEST FROM FLORIDA -- AP’S KELLI KENNEDY and TERRY SPENCER in Fort Lauderdale: “Mishaps, protests and litigation overshadow Florida recount”: “All 67 counties are facing a state-ordered deadline of Thursday to complete their recounts, and half had already begun. Many other counties were expected to begin the work Monday after a weekend of recount drama in Broward and Palm Beach counties, home to large concentrations of Democratic voters. ...“This recount process is unprecedented even in a state notorious for settling elections by razor-thin margins. State officials said they weren’t aware of any other time a race for governor or U.S. Senate required a recount, let alone both in the same election.” AP -- “Will a recount change anything in the Florida statewide races?” by Tampa Bay Times’ Kirby Wilson: “According to an analysis by the nonpartisan group FairVote, which advocates for electoral reforms that make it easier to vote, out of 4,687 statewide general elections between 2000 and 2016, just 26 went to a recount. “Of those 26, just three recounts wound up changing the initial result of the race: The 2004 Washington governor’s race, the 2006 Vermont state auditor's race and the 2008 Minnesota U.S. Senate race. The average swing in those three elections after the recounts? About 311 votes. … Essentially, Nelson — and to a greater extent, Gillum — would need a systematic error to be discovered during their recounts if their results are to be reversed.” Tampa Bay Times 2018 WATCH -- AP’S DAVID SHARP: “New way of voting faces test in Maine congressional district”: “The four-way political battle won’t conclude until a computer algorithm has the final say this week on whether Republican Rep. Bruce Poliquin wins re-election or is ousted by Democratic state lawmaker Jared Golden. …“Under the system, a candidate wins with a majority of first-place votes. If there’s no majority, the last-place candidate’s second-place votes are reallocated to remaining candidates. The computerized process can be repeated until there’s a winner. Across the country, voting reform advocates are watching as the system faces its biggest test in the most expensive race in Maine history.” AP 2020 WATCH -- NEW YORKER’S JEFFREY TOOBIN: “Deval Patrick’s Presidential Prospects: Can an Obama acolyte be elected after Trump?”: “Patrick has no illusions about the difficulty he will have distinguishing himself from the crowd. As governor from 2007 to 2015, he was little known outside New England, and he hasn’t spoken much in public since. …“Even within his own state, he is one of five potential candidates, along with Warren, John Kerry, and Representatives Joe Kennedy III and Seth Moulton. Still, Patrick would enter the race with one significant distinction: he is a kind of political heir to Barack Obama, and enjoys broad support from people close to the former President.” The New Yorker AT THE BORDER … “They Were Stopped at the Texas Border. Their Nightmare Had Only Just Begun,” by NYT’s Manny Fernandez in McAllen, Texas: “The Border Patrol’s parent agency, Customs and Border Protection, is the largest law enforcement agency in the country, with nearly twice the staff of the F.B.I. Through the years, a small number of officers have succumbed to temptation and reached for a share of the millions of dollars generated in the smuggling of drugs, weapons and people across the southwest border. “But a civil suit stemming from [a] March 2014 attack near McAllen, now making its way through the courts, is shedding light on a more sinister kind of corruption. Over the past four years, at least 10 people in South Texas have been victims of murder, attempted murder, kidnapping or rape — all, according to prosecutors and officials, at the hands of Border Patrol agents who suddenly and violently snapped.” NYT TRADE WARS -- “U.S. Adopts New Battle Plan to Fight China’s Theft of Trade Secrets,” by WSJ’s Kate O’Keeffe: “The Trump administration is broadening its China trade battle beyond tariffs with a plan to use export controls, indictments and other tools to counter the theft of intellectual property, according to people familiar with the matter. …“The new approach could help the Trump administration win friends in the business community, which has criticized the president’s tariff policy as broad and ineffective when it comes to protecting trade secrets, whose theft costs the country hundreds of billions of dollars a year, according to some U.S. government estimates.” WSJ AFTERNOON READ … VANITY FAIR’S MARIE BRENNER: “I See Him As a Modern-day Pablo Escobar”: Inside Bill Browder’s War Against Putin: In a series of revealing new interviews, Putin’s public enemy No. 1 offers scintillating details about his investigation into Russian financial malfeasance, running for his life, and the Helsinki fallout.” VF TRANSITION -- Christina Pearson has departed Microsoft’s D.C. office after nine years where she was senior director of public affairs. Pearson, who worked in the Bush 43 HHS as assistant secretary of public affairs, has not announced her next steps yet.ENGAGED -- Polly Zintak, account supervisor at Edelman, and Nick Desien, senior business analyst at Alliance of Community Health Plans, are engaged after Nick proposed at their home in Petworth on Friday night. Pic-- David Molina, who works for Rep. Lou Correa (D-Calif.), proposed to Mallory Howe, an account executive at FiscalNote and an Edelman alum. The couple’s mothers introduced them in January 2014. Pic ... The ringWELCOME TO THE WORLD -- Emily Ngo, national politics reporter at Newsday, and Curtis Dann-Messier, CUNY’s university director of workforce programs, welcomed their second child, baby Robert, who came in at 7 pounds, 13 ounces. Instapic– Rebecca Heinrichs, senior fellow at the Hudson Institute and a Trent Franks alum, and Hanz Heinrichs, professional staff member for the Senate Defense Appropriations Subcommittee, welcomed John Victor Heinrichs. Pic-- OBAMA ALUMNI -- Cameron French, VP at SKDKnickerbocker and an Obama HUD, Education and OFA alum, and Johnna French, senior attorney adviser at U.S. Customs and Border Protection, welcomed Lenox Danny French. Pic by Gaga PhotosWEEKEND WEDDING – OBAMA ALUMNI: Jessica Menter, former COS of the office of legislative affairs in the Obama White House and now the director of board relations at the Children’s National Health System, married National Guard officer Joseph Andrews at their alma mater William and Mary on Veterans Day weekend. Pic by Abbey Welsh ... Another pic by Bryant Jones\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}