{"id": "  POLITICO Magazine\nHow World War I Became the First Modern War of Science\n", "paragraph": "The Friday Cover is POLITICO Magazine's email of the week's best, delivered to your inbox every Friday morning.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n                AP Photo\nHistory Dept.\n                        One hundred years ago, a group of U.S. academics and soldiers revolutionized warfare. We’re still seeing the results today. \n                    By THEO EMERYNovember 12, 2018Dense fog wreathed the woods where Harold Higginbottom lay deep asleep. In the inky early morning darkness, “Higgie”—as the fellows as in the First Gas Regiment called him—lay rolled snug in his blankets on a bed of leaves, not far from the German lines in the Meuse district of northeast France. A hand shook him awake at about 4 a.m. Bombs were falling, said the private who woke Higgie. German artillery was getting close, and he should take refuge deeper in the woods, along with the officers in charge of the platoon. Higgie shrugged off the warning. After 10 months in France, with more than his share of close scrapes setting chemical mortars and scrambling through no-mans-land, the artillery didn’t worry him. If the bombs come any closer, then wake me up, Higgie told the private. Then he rolled over and went back to sleep. Story Continued Below It was November 11, 1918. A few hours later, the armistice would end World War I, a cataclysmic conflict that reshaped Europe and the world, marked the beginning of American global ascendance, and set the stage for World War II two decades later.  President Donald Trump flew to France on Friday for ceremonies marking the centennial, which has been a rolling, multi-year commemoration in Europe since 2014. Within a day, he had created an international scandal by canceling a Saturday appearance at the memorial for the Battle of Belleau Wood “due to scheduling and logistical difficulties caused by the weather.” During the June 1918 battle, U.S. Marines successfully fought off German divisions, suffering almost 10,000 casualties and just over 1,800 deaths in vicious fighting, often with knives, bayonets or hand-to-hand combat.  The president’s absence elicited ferocious criticism both domestically and abroad, as well as ridicule that rain would have nixed memorializing a war in which mud was so deep that men and horses drowned. But the furor drowned out a different kind of scandal: For many Americans, the conflict is barely understood or even remembered. Eclipsed by World War II and other conflicts, the Great War seemingly erupted from an inconsequential spark, sucked in the United States for baffling reasons and embroiled the country for ambiguous goals.  To see the war as such is a mistake. This centennial and Armistice Day—the predecessor of Veterans Day—is an opportunity to correct amnesia about a war whose consequences still reverberate today. From the unraveling of Middle Eastern countries reshaped in the war’s aftermath, to the shaping of strategic deterrence that guided the Cold War, to the re-emergence of banned chemical weapons, the Great War’s legacy is still very much with us. World War I was extraordinary for many reasons: the staggering scope of the conflict, the more than 8 million battlefield deaths and more than 20 million casualties, the horrific conditions on the battlefield. It was also the first modern war of science, enlisting the aid of physicists, chemists and engineers to build weapons that had been the stuff of science fiction, including the chemical weapons that Higgie had been trained to use in France. The research for my book Hellfire Boys principally focused on the largely forgotten story of the U.S. Chemical Warfare Service, which was established to answer Germany’s use of chemical weapons on the battlefield. Germany first used chlorine gas on April 22, 1915, to break through the intractable deadlock of trench warfare on the Western Front.  The German’s use of chemical weapons initially sparked international outrage, but soon all of the major combatants were rushing ahead with their own gas programs. Ultimately, chemical weapons gave none of the armies the edge on the battlefield they sought; rather, it just added a new layer of toxic misery to an already horrific war.   What I initially thought would be a narrow sliver of the war proved instead to be a window into the wider consequences of this catastrophic clash for dominance of Europe. One of those consequences in the United States was a realignment of science and academia to the military. For the first time, scientists would be seen as vital to the war effort, volunteering to work on scientific problems from aviation to submarine detection to—yes—chemical warfare. War would never be the same again. ***With the United States’ late entry into the war in April 1917, the War Department was completely unprepared for gas warfare, as it was then called, having made almost no preparations for U.S. troops facing chemical weapons on the battlefield.  The Army sought to correct that by establishing a research campus in Washington called the American University Experiment Station to work on both defensive measures, like the desperately needed gas masks and protective gear, as well as offensive capabilities—explosives, bombs and American-made chemical warfare agents to answer those of the Germans. By the end of the war, there would be nearly 2,000 soldiers and scientists working on research problems there. Thousands more worked at chemical manufacturing plants, gas mask factories and satellite labs around the country, including the massive chemical warfare boomtown, Edgewood Arsenal in Maryland. That enormous effort has parallels to the Manhattan Project of World War II, and not just because of its scope and secrecy—in some ways, the effort to surpass Germany’s use of chemical arms was a dry run for the race to build a nuclear bomb, with some of the very same scientists involved in both.  The War Department also knew that it would need gas troops, like the British Special Brigade and the German Pioneer Regiments that prepared and carried out gas attacks, which by mid-1917 included sulfur mustard—the so-called king of the war gasses. In mid-October of 1917, Secretary of War Newton Baker authorized the formation of a new regiment, the 30th Engineers (Gas & Flame), initially comprised of a single battalion of two companies that would go to Europe to use these fearsome new weapons. Higgie was one of the earliest recruits. Barely 21, he worked at a textile plant in Lawrence, Massachusetts. A few days after the regiment was authorized, he spotted an announcement in the local paper seeking volunteers. During his lunch break at the factory, he strolled down to the recruitment office to find out more.  “Everything seemed alright, so I told them I would be back later,” he wrote in his diary. By that Friday, he was on a train to Fort Slocum in New York, wearing a new wristwatch with glow-in-the-dark hands that his church buddies gave him as a goodbye gift. On November 7, 1917, he boarded a Washington-bound boat, and by that night, he was among the first soldiers in what would soon be called the “Hellfire Regiment.” Though the United States entered the chemical arms race far behind its allies and Germany, it had more than caught up by the war’s end. After modest beginnings, the War Department created seven companies of gas troops that went to France to fight, and authorized the formation of many more—36 companies in all. The capacity for domestic production of chemical weapons had surpassed all of Americas allies, and even Germany. By the end of the war, the United States had used about 1,100 tons of chemical warfare agents—a tiny fraction of the 57,000 tons that Germany used—but was prepared to deluge the Central Powers with chemical weapons in spring 1919.  Chemical weapons today are rightly seen as primitive and atavistic, cruel weapons that indiscriminately maim and kill civilians and soldiers alike. Yet even though laws of war had forbidden chemical weapons for centuries, the combatants in World War I were loath to surrender these new arms after the war.  The result was the 1925 Geneva Protocol, which forbade chemical warfare but fell short of a ban on chemical weapons. Under this regime, nations could maintain chemical stockpiles to ensure that their adversaries didn’t use them. The standoff between chemically armed nations didn’t prevent World War II, but it probably prevented all-out chemical warfare from erupting again after 1939. It also provided a blueprint for nuclear deterrence in the Cold War, the “peace through strength” axiom which prevented—for the most part—direct military confrontation between the U.S. and the U.S.S.R.   Over time, chemical weapons slipped into expensive obsolescence, and an international consensus emerged that the world would be better off without them. That led to the 1997 Chemical Weapons Convention, which replaced flawed earlier treaties and banned chemical weapons altogether, instituting inspection regimes to prevent production and development of new chemical arms. And yet chemical weapons remain a threat a century after the end of the war. Bashar Assad’s regime is accused of using chemical weapons dozens, perhaps hundreds, of times in the Syrian civil war. Russia is accused of violating the Chemical Weapons Convention with the attempted assassination of former spy Sergei Skripal in Salisbury, England, earlier this year. The nerve agent VX killed the estranged half-brother of North Korean leader Kim Jong Un in 2017, and North Korean defectors report that artillery regiments along the Korean Peninsula’s demilitarized zone are armed with chemical weapons that could kill hundreds of thousands, if not millions, of South Koreans in Seoul. “Everything old is new again,” one arms expert told me. \n\n                                                Law And Order\n\n                                            By Lara Bazelon\n\n                                                Primary Source\n\n                                            By Matt McCoy\n\n                                                Politics\n\n                                            By Tim Alberta Higgie, the Hellfire Boy from Lawrence, Mass., wasn’t preoccupied with the geopolitics of the war, or what would come after—he was concerned with survival. He had been gassed multiple times, and had seen soldiers blown to bits beside him. One of his friends from American University died instantly at his side when shrapnel drilled into his head, and he had hugged the ground as German planes bombed the regimental encampment near Montfaucon, close to the Argonne Forest, in October 1918. In the early days of November 1918, the weather in France had turned cold. The men held one another at night to stay warm and warmed their frozen boots in the morning with flaming pieces of paper. Rumors of peace had reached all the way to the front, and Austria and Turkey were both out of the war. Still, the Hellfire Boys thrashed their way north, slogging through mud and mire with mortars for smoke and chemical attacks against the Germans as the American troops surged forward. When Higgie awoke again about 8 a.m. on November 11, the wan daylight barely pierced the dense fog that still lay over the forest. He pulled himself from his warm cocoon of blankets to make breakfast. The mist was so thick he couldn’t see more than 10 feet away.  And then, the lieutenant emerged like a phantom from the mist with the best news that Higgie had ever heard. At 11 a.m., the guns would fall silent. The war was over. After so much bloodshed, after seeing death visited upon the men beside him and the carnage on the battlefield around him, Higgie was taking no chances. He rolled up his pack and retreated back into the forest, just in case the peace didn’t hold or it was another false rumor. It seemed to good to be true. But the armistice was real, and at 11 a.m., an eerie silence fell across the blasted landscape.  When Higgie was finally able to write down his thoughts, there was a sense of wonderment, a tone of awe, in the diary entry that began that day. “A day we will never forget,” he wrote, words that a century later, should remain true today.Theo Emery is the author of Hellfire Boys: The Birth of the U.S. Chemical Warfare Service and the Race for the World’s Deadliest Weapons.Swamp Diary \n\n                        By Jack Shafer\nThe Friday Cover\n\n                        By Keith Kloor\nPolitics\n\n                        By Derek Robertson\n\n © 2018 POLITICO LLC"}