{"id": "\n\n\n\nPOLITICO\n\nTech takes on opioids", "paragraph": "\n                                                            PoliticoA daily download of technology news from Washington and Silicon ValleyGet the Morning Tech NewsletterBy signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.10/24/2018 10:00 AM EDTWith help from Steven Overly and John HendelEditor’s Note: This edition of Morning Tech is published weekdays at 10 a.m. POLITICO Pro Technology subscribers hold exclusive early access to the newsletter each morning at 6 a.m. To learn more about POLITICO Pro’s comprehensive policy intelligence coverage, policy tools and services, click here.Story Continued BelowTECH TAKES ON OPIOIDS — Amazon, Google and Facebook will trek to the White House today to stand alongside President Donald Trump as he signs sweeping legislation aimed at curbing the nation’s opioid crisis. The package expands access to drug treatment and prevention programs across federal agencies. The tech giants are expected to outline ways they can help public health officials address the nationwide scourge of overdoses and deaths. Google, for one, will mark 1,000 Walgreens locations on Google Maps where people can dispose of unused prescription drugs. The gathering comes days out from National Prescription Drug Take Back Day on Saturday, which companies like Twitter have highlighted on their platforms in an effort to combat the opioid epidemic. — With great power comes great responsibility: Internet companies have been thrust into the debate over how to address opioid addiction as dealers have used their platforms to market and sell controlled substances like oxycodone and fentanyl. “Do you all feel any responsibility?” West Virginia Democrat Sen. Joe Manchin asked Facebook COO Sheryl Sandberg and Twitter CEO Jack Dorsey during a Senate Intelligence Committee hearing in September. “A lot of people have been affected and a lot of people have died receiving information about how to obtain drugs through y’all’s platforms.”— One way, or another: If the industry doesn’t tamp down on online drug activity, Congress may find a way to force it. Manchin has already floated the idea of amending Section 230 of the Communications Decency Act, a landmark provision of internet law, to make firms more legally liable for the online sale of opioids. Earlier this year, Congress caused a rift in the tech industry when it passed a law that altered Section 230 to make websites more responsible for online sex trafficking.ALSO TODAY: TIM COOK TALKS PRIVACY IN BRUSSELS — POLITICO Europe’s Mark Scott sets the scene in Belgium, where the Apple CEO is on hand to deliver an address at the 40th International Conference of Data Protection & Privacy Commissioners. Cook’s trip, Mark writes, sets the stage for “a triumphant return to Europe two years after the Apple CEO clashed with Margrethe Vestager, the EU’s antitrust czar, in the Belgian capital.” Read the full dispatch here. GREETINGS AND WELCOME TO MORNING TECH, where your host is still no closer to finding that perfect Halloween costume. Got a news tip? Drop me a line at clima@politico.com or @viaCristiano. Don’t forget to follow us @MorningTech. And catch the rest of the team’s contact info after Quick Downloads.Have an event for MT’s tech calendar? Email us the details at techcalendar@politicopro.com.PRESIDENT DONALD TRUMP SAYS A RED WAVE IS COMING ON ELECTION DAY. Is he right, or will the tide turn blue? Compete against the nation’s top political minds in the POLITICO Playbook Election Challenge, by correctly picking the winning candidates in some of the most competitive House, Senate and gubernatorial races in the country. Win awesome prizes and eternal bragging rights. Sign up today: Visit politico.com/playbookelectionchallenge to play.** A message from Charter Communications: Charter is investing in the network infrastructure and the technologies that will power smart cities and connected homes from coast to coast – creating a future of ubiquitous connectivity. Building the foundation of tomorrow’s connected future, today: policy.charter.com **FACEBOOK’S FOOTNOTE ON POLITICAL ADS — The social networking site delivered on its pledge to roll out a macro-level tool for analyzing political ad spending on the platform this week by unveiling its Ad Archive Report. “Making this report available to the public is part of Facebook's efforts to increase transparency in advertising,” the company wrote in its announcement. The report will offer a weekly glance at who the big spenders on the platform are, and its debut installment already provided some interesting nuggets. It notes that Democratic Senate candidate Beto O'Rourke of Texas beat out President Donald Trump as the top spender and that advertisers shelled out more than a quarter-billion dollars on Facebook ads since May.— But tucked away at the bottom was an even more tantalizing tidbit: “During this same time period Facebook spent $12,499,995.00 on ads related to politics and issues of national importance,” the company noted. That figure, for reference, dwarfs the over $5 million spent by O’Rourke and more than $4 million spent by Trump’s reelection groups — making Facebook the actual top political ad spender on its own platform. For months, those Facebook ads have focused almost entirely on the company’s efforts to beef up platform security before the midterms, while those by Facebook-owned Instagram have largely focused on voter registration and turnout efforts. — Cognitive dissonance? The Trump campaign’s multimillion dollar Facebook ad buy strikes a contrast with his public remarks about the tech industry, in which he has railed against the tech platforms as biased against conservatives. Just yesterday, Trump’s 2020 campaign manager Brad Parscale accused “Big Tech companies” in a Breitbart op-ed of “threatening to stamp out one of America’s most cherished freedoms — the right to free speech.”— Other takeaways: While Trump led the way, the rest of the top 10 Facebook spenders were all Democratic candidates: O’Rourke, Illinois gubernatorial candidate JB Pritzker, Sen. Kamala Harris of California, New York Gov. Andrew Cuomo, Sen. Claire McCaskill of Missouri, Sen. Heidi Heitkamp of North Dakota, Sen. Kirsten Gillibrand of New York, Georgia gubernatorial candidate Stacey Abrams and California House candidate Andrew Janz. Also of note: In the digital media sphere, the Eric Bolling-led CRTV spent nearly $1.5 million promoting its lineup.TECH’S 2018 ELECTION OUTLOOK — The Cook Political Report released updated ratings for House districts on Tuesday, shedding light on several key races for tech industry watchers. Among them: Rep. Mike Coffman of Colorado, the only Republican in the House to sign on to a Congressional Review Act resolution to restore the Obama-era net neutrality rules, is running a tight race in a Democratic-leaning district, according to the report. And Rep. Will Hurd, a cybersecurity alum and leading Hill figure on tech issues, is also running a tight race in a Texas district that leans Republican. — Meanwhile Rep. Marsha Blackburn (R-Tenn.), chair of the House Energy and Commerce subcommittee on communications and technology, remains deadlocked in a toss-up race with Democratic Senate candidate Phil Bredesen to fill Sen. Bob Corker’s seat. — How blue a wave? The latest findings, in which eight House districts shifted to the left, show a difficult path for Republicans to maintain control of the House. According to the report, the likeliest outcome in the upcoming elections is a “Democratic gain of between 25 and 35 seats.” If that pans out, Democrats would clinch a House majority. That outcome could cause headaches for Republicans on issues like net neutrality, which Democrats figure to reinstate in the event they retake the House. (For more on how a Democratic takeover of the House might affect the FCC, re-read this dispatch from John.)‘SPRINT’S SAUDI PROBLEM’ — Softbank’s connections with Saudi Arabia may cause headaches for the proposed merger of its subsidiary, Sprint, and T-Mobile because of the killing of journalist Jamal Khashoggi. The Japanese tech giant is set to retain four seats on the new company’s board of directors as well as a 27 percent stake, which could give the company influence over what would be America’s third-largest wireless carrier. And critics are sounding the alarm on the possibility the merger could allow Softbank to surveil or collect data on U.S. citizens through expanded back-channel access to telecom networks.— Watch for a five-figure digital campaign launching today that raises some of these national security concerns, according to a source familiar with the efforts. That’ll include the launch of a website called Sprint’s Saudi Problem (for Pros, here’s an infographic). Despite attacking Softbank for its funding, the campaign remains shadowy, not disclosing its own funding sources. Its targets are national security and human rights influencers in Washington, D.C., the source added, noting this is a prelude to a larger campaign outlining merger concerns. The unnamed group is lining up on-the-record surrogates to detail concerns about the merger and plans to unveil a video soon. T-Mobile, Sprint and Softbank didn’t comment when asked about Softbank’s Saudi connections. — Under pressure: The tech industry at large, meanwhile, has remained mum on its deep financial ties to the Arab kingdom amid scrutiny from some Democratic lawmakers. Rep. Ro Khanna (D-Calif.), whose tech-heavy district encompasses the headquarters of Apple, Tesla and Intel, told your host and Steve on Tuesday that “in addition” to tech leaders pulling out of this week’s high-profile Future Investment Initiative summit in Saudi Arabia, “Silicon Valley needs to be quite clear that they’re not going to accept any additional Saudi investment.” But the Khashoggi affair isn't the first time Silicon Valley has been pressed to reckon with Saudi Arabia's record on human rights. Read on here.UTILITIES TO FCC: STAY OFF OUR SPECTRUM — The Utilities Technology Council issued a lengthy and fierce rebuke to Thursday’s FCC vote to proceed to a rulemaking on expanding the use of 6 GHz spectrum, which advocates like Public Knowledge celebrate for its potential use for unlicensed technology like Wi-Fi. — Broadband broadside: “Although we understand the need for expanded wireless broadband, the risk of radio frequency interference to utilities’ mission-critical networks outweighs the potential benefits from unlicensed use of the band,” said Joy Ditto, who leads the utility trade group. “We are greatly concerned that the proposed rulemaking as drafted would not sufficiently mitigate potential interference to utility systems from these new unlicensed operations.” She argues “there are other spectrum bands more suitable to achieve the Commission’s goals.”— ICE, ICE baby: Amazon huddled with federal immigration authorities over the summer to pitch the use of their facial-recognition software to identify immigrants, The Washington Post reports. — Do as I say, not as I do: Google wants to teach kids how to be safe online, even as its own security practices are under scrutiny, The New York Times reports. — Cool, cool: BuzzFeed News found that millions of Android phones tracked user behavior through a sophisticated ad fraud scheme. — Dolla dolla bills: Amazon, Microsoft and other top tech firms are making millions from U.S. immigration enforcement, The Guardian reports. — Political messaging: Snapchat has helped register 400,000 voters, The New York Times reports. — When your eyes don't work like they used to before: A Pew Research study found that those over 50 years of age are worse at differentiating between fact and opinion, The Atlantic reports. — You get a streaming service! You get a streaming service! Apple plans to launch a TV subscription service in more than 100 countries, a move that would put it immediately in competition with Amazon and Netflix, The Information reports. ** A message from Charter Communications: A connected future isn’t an aspiration – it’s becoming a reality. Charter is investing in next generation broadband and building out its network across big cities, small towns, and rural areas – to power the future of connectivity: policy.charter.com **\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}