{"id": "\n\n\n\nPOLITICO\n\n\nSanders admits his age is an issue in 2020\n", "paragraph": "\n                Sen. Bernie Sanders, who touched off a nine-state tour stumping for Democrats on Friday, has not yet said if he will run for president again. | Rogelio V. Solis, File/AP Photo \nElections \n                    By DAVID SIDERS10/19/2018 07:58 PM EDTBLOOMINGTON, Ind. – Sen. Bernie Sanders on Friday agreed with Joe Biden — a fellow septuagenarian — that age will be an issue if he runs for president in 2020.But he added, “I’m very blessed with my health.”Story Continued Below“It’s part of a discussion, but it has to be part of an overall view of what somebody is and what somebody has accomplished,” Sanders, who is 77, told POLITICO. “Look, you’ve got people who are 50 years of age who are not well, right? You’ve got people who are 90 years of age who are going to work every day doing excellent work. And obviously, age is a factor. But it depends on the overall health and well being of the individual.”Sanders’ remarks came after Biden, who turns 76 next month, acknowledged age would be a \"legitimate issue\" if he runs for president.\"I think they're gonna judge me on my vitality,\" Biden told \"CBS This Morning\" this week. \"Can I still run up the steps of Air Force Two? Am I still in good shape? Am I – do I have all my faculties? Am I energetic? I think it's totally legitimate people ask those questions.\"Sign up for our must-read newsletter on what's driving the afternoon in Washington.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Biden and Sanders, the independent senator from Vermont, hold higher profiles than most of their potential competitors in the Democratic primary. And President Donald Trump is 72. But a crop of younger Democrats is preparing to run, as well. Sens. Elizabeth Warren (D-Mass.) and Cory Booker (D-N.J.), are taking aggressive steps in early primary states, among other candidates. Earlier this week, Sen. Kamala Harris (D-Calif.) proposed a new tax break for average Americans, calling for a $6,000 tax credit for families earning up to $100,000.Sanders declined to comment on the proposal, saying, “I just heard about it yesterday” and that he wants to “study the implications.”But he said he has taken heart in more progressive policy proposals from Democrats since his unsuccessful presidential bid in 2016.“What people perceive is this country’s in a very different place than it was three years ago,” Sanders said. “I think we opened up the door for people to understand that the American people want real change.”Now, Sanders said, “You’re seeing candidates coming up with ideas to try to address those issues.”Sanders, who touched off a nine-state tour stumping for Democrats on Friday, has not yet said if he will run for president again. On Friday, he briskly walked several blocks with supporters to a voting center from a rally for Democratic congressional candidate Liz Watson, who is challenging Republican Rep. Trey Hollingsworth.Asked later about his age, he said, “I am very happy that – and I thank God for this, I’m very lucky – I’m very blessed with my health … I literally cannot remember the last time I missed a day because of illness. I’ve been sick, but I go to work.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}