{"id": "  POLITICO Magazine\nThe Caravan Is Real \n", "paragraph": "The Friday Cover is POLITICO Magazine's email of the week's best, delivered to your inbox every Friday morning.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n                Rodrigo Abd/AP Photo\nOpinion\n                    By RICH LOWRYOctober 24, 2018The last thing the left wants prior to the midterms is an image dramatizing the weakness of our southern border.So the caravan of thousands of migrants, emanating from Honduras and headed toward the United States, is considered an illegitimate story, a shoddy excuse for President Donald Trump’s chest-beating and fear-mongering. Story Continued BelowIt’s certainly true that Trump and his allies have thrown up a lot of chaff around the caravan. It’s not being paid for by George Soros, as Congressman Matt Gaetz insinuated. There’s no evidence that it is infiltrated by unknown Middle Easterners, as Trump tweeted (before walking it back). Trump at times loosely talks as if the caravan is a Democratic conspiracy, which obviously isn’t true, either. But he gets the big point right: We have borders, and should enforce them. Whatever Trump’s exaggerations, the caravan itself isn’t a fabrication. It started as a group of 160 people in Honduras. It quickly grew to 1,600. Guatemala tried to close its border to the migrants, but rapidly gave in. By the time the caravan reached the Mexican border, it had gathered about 3,000 people, and grew to as large as 7,000 as it crossed into Mexico. The media has run with the story because it isn’t every day that a group of thousands of migrants crashes through a Mexican border-crossing in defiance of the governments of Mexico and the United States. The images, of a throng of migrants as far as the eye can see on a Mexican highway or of migrants hanging off a truck, are compelling. To which the response of progressive commentators has been: No fair.There have been complaints that The New York Times ran front-page photos of the caravan two days running, drawing comparisons with the newspaper’s supposedly disproportionate coverage of the Clinton email scandal. Then, there’s the footage on TV. “Make no mistake,” Bill Maher says, “the TV media is helping Trump and his enablers win the upcoming election.”This is all misbegotten. Rather than urging that the media ignore the caravan, Democrats would be better advised to lessen their vulnerability on immigration by not treating concerns over border security as inherently fake or hateful.How hard would it be to say that this isn’t how people should enter the United States? That it’s an affront to immigrants who have scrupulously followed the rules? That the caravan should disperse and legitimate asylum-seekers try to get protection in Mexico, long before they reach the U.S. border? Asked about Trump’s tone on the caravan, Senator Kamala Harris made it sound as though it’d be un-American to turn the migrants away: “We are a country that—our strength has always been that we are a tolerant country, that we are welcoming, in particular, to those who have fled harm.” She denounced “vilifying some group for the sake of fear-mongering and politics.”Another typical response is to tsk-tsk worries about the border by citing a decline in illegal border-crossings since the 2000s. But this misses the point: Our laws and rules have conspired to render the southern border almost null and void for the category of migration that has been growing at the most rapid clip, families and minors from Central America.What migrants in the caravan understand is that, as members of a family unit from Central America, if they set foot in the United States, they have a good chance of staying (hundreds of migrants from a 1,500-strong caravan earlier this year reportedly made it into the United States). The so-called Flores settlement, an anti-trafficking law affecting minors from noncontiguous countries, and lax asylum policies mean that migrants can surrender to border agents and probably get a bus ticket to somewhere in the interior of the country, pending proceedings for which they may never show up.This is an enormous incentive to make the trek, and it’s reflected in the increased arrivals of family units from Central America. The caravan is dramatic, but it isn’t different in kind from the daily reality on the border of Central American minors and members of family units showing up, and getting in.Trump is correct that this is an insane way for a sovereign country to run its immigration policy, and that Republicans want to try to fix it by tightening the rules, while Democrats support the latitudinarian status quo.If Trump’s opponents don’t want to see more caravans on TV, they could agree that the border shouldn’t be arbitrarily open to a swath of migrants from Central America and help do something about it. They have no interest in doing this, of course. So they can only cry foul when Trump points out the obvious deficiencies in the current system and hope news organizations don’t notice a group of thousands of people heading north to try to take advantage of our laxity.Rich Lowry is editor of National Review and a contributing editor with Politico Magazine. Swamp Diary \n\n                        By Jack Shafer\nThe Friday Cover\n\n                        By Keith Kloor\nPolitics\n\n                        By Derek Robertson\n\n © 2018 POLITICO LLC"}