{"id": "\n\n\n\nPOLITICO\n\n\nGOP floods new House seats with cash in late rescue effort\n", "paragraph": "\n                America First Action is also going up in Ohio’s 12th District, the Republican-leaning seat narrowly won by GOP Rep. Troy Balderson in a closely watched August special election. | Justin Merriman/Getty Images\nElections\n                        The NRCC and two super PACs are swooping into a handful of districts with TV ads to prop up candidates in close races.\n                    By RACHAEL BADE and ELENA SCHNEIDER10/24/2018 03:13 PM EDTRepublicans are launching 11th-hour rescue missions into a set of longtime GOP House districts that have tightened weeks before the election, highlighting the limits of the recent boost in voter enthusiasm touted by the GOP — and the dangerous cash deficit haunting some Republican candidates.Two weeks until Election Day, a constellation of groups — including the National Republican Congressional Committee’s independent expenditure unit; Congressional Leadership Fund, the House leadership-aligned super PAC; and America First Action, the principal super PAC backing President Donald Trump — are pouring millions of dollars into TV ads to help GOP members in Florida, Georgia, Michigan, New York, North Carolina and Virginia. It’s a last-minute effort that Republican operatives say will shore up lawmakers in seats that once leaned Republican but have become increasingly competitive.Story Continued BelowIt’s also a troubling sign for the GOP’s prospects of keeping the House. Most of Republicans’ new defensive fortifications are coming in districts where the GOP has won easily in the past and has been expected to do so again in 2018, and Democrats have not considered them top targets or must-wins on their path to flip 23 seats and retake the House majority. While Republicans in some districts have benefited from Trump’s rising approval rating and a boost of energy following Supreme Court Justice Brett Kavanaugh’s confirmation, the new ad spending shows Democrats are still making inroads into a range of Republican-held seats, including some where the GOP candidates are getting massively outspent.“When the committees or CLF go in late, it means the race is within the margin of error — up a couple points or down a couple points for Republicans — so that means it’s winnable, so they’re not going to walk away, despite what the candidate cash shows,” said a Republican consultant working on House races, who was granted anonymity to discuss internal party decisions. “But it’s happening because these incumbents don’t have the cash, which is worrisome.”Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.The NRCC jumped into a trio of suburban seats this week where Democrats raised more money than Republican incumbents last quarter. The GOP House committee dumped $1.4 million into the northern Atlanta suburbs to support GOP Rep. Karen Handel, who’s facing Democrat Lucy McBath, a gun control activist. The NRCC also threw down $600,000 apiece to help Rep. Ted Budd (R-N.C.) on Wednesday and the same amount for Rep. Brian Mast (R-Fla.).CLF is simultaneously swooping in to three more districts, blitzing TV air waves with ads benefiting Republican Reps. John Katko of New York, Fred Upton of Michigan and open-seat contender Denver Riggleman, the Republican running to replace retiring Rep. Tom Garrett (R-Va.).America First Action is also going up in Ohio’s 12th District, the Republican-leaning seat narrowly won by GOP Rep. Troy Balderson in a closely watched August special election.But since then, Balderson — who is defending a mix of suburban and rural counties — fell steeply behind in fundraising against Democrat Danny O’Connor. O’Connor entered October with more than $1 million in his campaign account, while Balderson had $388,000.O’Connor’s campaign released an internal polling memo on Wednesday claiming the race is tied at 47 percent.\nRepublicans appear to have put away some districts that seemed on paper to be prime Democratic opportunities this election, including Hispanic-majority seats in California and Texas. But that's just a fraction of the larger battleground map. Democrats are vying for more than 75 GOP-held seats, giving the party multiple opportunities to breach the Republican firewall and flip the 23 districts needed to take the House.Add the Democratic cash advantage to the equation and the picture looks grim for the right. The White House was enlisted recently to help cash-poor candidates in open seats, planning a Trump-hosted fundraiser on Thursday for three Republicans vying to replace a retiring GOP incumbents: Jay Webber of New Jersey’s 11th District, Ross Spano of Florida’s 15th District and Carol Miller of West Virginia’s 3rd District.House Democrats portrayed Republicans’ new financial infusion as a sign their party was expanding the map, cutting into GOP territory that many leaders viewed as safe and many political analysts long considered “likely” or “lean” Republican seats. \nElections \n                    By MARC CAPUTO“Our ability to win the early air-war forced Republicans to already abandon some vulnerable incumbents and expand the map into new districts where they didn’t want to spend,” Democratic Congressional Campaign Committee spokesman Tyler Law said in a statement. “Despite increasingly desperate Republican rhetoric, our strategy is working and we have built multiple paths to the majority.” CLF executive director Corry Bliss pushed back on that assertion and expressed confidence that all the incumbents in question would win. He downplayed the GOP’s new ad buys as “maintenance” — spending to counter liberal outside groups flooding the zone with their own money.“As we have been saying for two years, this is a very difficult environment and if a Republican incumbent gets outspent 2-to-1 or 3-to-1, you’re asking for trouble,” Bliss said in a statement.Another Republican source familiar with the buys also acknowledged that “a lot of this is about the significant amount of Democratic resources going into lower-tier, fringe races, where a massive spending advantage could shrink a margin,” adding that “this is about filling spending voids.”Indeed, it was a recent DCCC ad buy against Mast that triggered the NRCC to wade into the coastal district Trump carried by 9 points, two GOP sources said. House Democrats invested in the seat in mid-October after Global Strategy Group, a Democratic polling firm, said candidate Lauren Baer was “within striking distance” of Mast. Back in May, Baer trailed Mast 18 points, according to a polling memo from Global Strategy Group; by late September, Baer, an ex-State Department official, was only 3 points behind the Republican incumbent. In New York, Katko also faces an onslaught of Democratic spending in a district that Clinton won by 3 points in 2016. House Majority PAC, a super PAC aligned with Minority Leader Nancy Pelosi (D-Calif.), and the super PAC arm of EMILY’s List have more than $1 million worth of TV ads reserved to run against Katko. \nElections \n                    By DAVID SIDERSGOP leaders have long seen Katko as a battle-tested member who has won tough races and could withstand the Democrat-favored political climate. He led Democrat Dana Balter by 15 points in a Siena College poll in late August, though CLF’s internal polling has him up by about half that margin: 8 points. Another Republican source admitted the direction of the race was not trending in Katko’s favor.In Georgia, the NRCC’s million-dollar buy comes as Handel lead shrinks and outside groups wade in. Democrat Lucy McBath has benefited from more than $2 million in outside spending from Everytown for Gun Safety Action, her former employer.A recent poll by Bold Blue Campaigns/JMC Analytics showed Handel leading McBath but the Democrat within the margin of error, 49 percent to 45 percent.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}