{"id": "\n\n\n\nPOLITICO\n\n\nDemocrats traumatized by 2016 are having pre-midterms nightmares\n", "paragraph": "\n                People watch  results come in at  Hillary Clinton's election night event at the Jacob K. Javits Convention Center on Nov. 8, 2016, in New York City. | Win McNamee/Getty Images\nElections\n                        Despite forecasts of a Democratic House takeover, liberals grappling with 'PTSD' are braced for another surprise election disaster.\n                    By BEN SCHRECKINGER11/04/2018 06:50 AM ESTOn the eve of the midterms, President Donald Trump’s approval is falling, young voters are energized, and Republicans look poised to lose their House majority.It’s enough to make Democrats nervous, miserable wrecks.Story Continued BelowHaunted by memories of 2016, liberals around the country are riven with anxiety in the campaign’s homestretch. They’re suspicious of favorable polls and making election night contingency plans in case their worst fears come true. Some report literal nightmares about a Democratic wipeout.“We're kind of just in the bed-wetting phase now,\" said Democratic pollster John Anzalone, a Hillary Clinton campaign alumnus who spent election night 2016 in Clinton’s Manhattan war room.Two years later, even thinking about the prospect of a repeat of that night’s letdown is still too much for many Democrats to bear.“Stop it!” shouted Nadeam Elshami, a former chief of staff to House Minority Leader Nancy Pelosi, when asked about that possibility. To be fair, the possibility has literally haunted his dreams.Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Elshami, who is now a Washington lobbyist, said that after staying up late reading campaign coverage and polls one recent night, he dreamed about watching tense House election results. His dream concluded with a Democratic House, but he doesn’t consider that a prophecy, and he said the pre-election knot in his stomach is tighter this year than ever before.Anzalone said the shock of Donald Trump’s upset victory, which was missed by most forecasts, still hangs over many in the party. “There’s some PTSD,” he said.That is not an exaggeration. A study published last month in the Journal of American College Health found that one-quarter of college students experienced “clinically significant” symptoms of trauma from the 2016 election results. At Vassar College in upstate New York, the college Democrats are moving their results-watching party to a new venue over concerns that revisiting the scene of their 2016 letdown would be too upsetting for some students, according to a member of the group. At Brown University in Rhode Island, the College Democrats have taken the same precaution after experiencing a “collective flashback” to Trump’s victory during a discussion of election night planning.A September AP/MTV poll found that 61 percent of Democrats ages 15 to 34 reported feeling anxious over the midterms, up 22 percentage points from July.But pre-midterm stress syndrome isn’t afflicting only young people: A YouGov survey released Friday found that Democrats are 50 percent more likely than Republicans to report that they are “eating their feelings” ahead of the midterms. Other recent polling has registered high levels of stress among Democrats ahead of Tuesday’s elections.For many traumatized Democrats, heading into Tuesday feels like flying again after surviving a plane crash. Some say the stakes feel even higher than in 2016: It was one thing for Trump to win in an electoral fluke, despite losing the popular vote, when he was still a political newcomer. It will be downright terrifying, they say, if Americans can’t place a check on him after two years of his megalomaniacal rule. \"I'm old enough to remember when The New York Times gave Hillary Clinton an 85 percent chance of winning on election night and to have been traumatized by the New York Times election needle,\" said Ezra Levin, who co-founded the Resistance organization Indivisible with his wife, Leah, after their election night gathering turned into the worst house party of their lives.\nElections\n                    By DAVID SIDERS, ELANA SCHOR, JAMES ARKIN, DANIEL STRAUSS, CARLA MARINUCCI, STEVEN SHEPARD and TIM ALBERTAMany liberals consider it bad luck — or, worse, an excuse for apathy — to embrace talk of big Democratic gains on Tuesday.When House Minority Leader Nancy Pelosi predicted to \"Late Show\" host Stephen Colbert last week that Democrats “will win” the House, the liberal comedian worried she might be jinxing the outcome.“Please don’t say that,” Colbert replied. “Do you want to say that on Hillary’s fireworks barge that she canceled?” (Clinton’s campaign had prepared a fireworks display to celebrate her expected 2016 win.)Perhaps reflecting a once-bitten, twice-shy mentality, national Democratic leaders had not announced election night plans as of press time. In 2006, the last time they waged a midterm campaign against an unpopular incumbent, they rang in their landslide victory with an all-night, open bar bash at which over 1,000 revelers spread across two ballrooms at the Hyatt Regency on Capitol Hill.Democrats still have plenty of worst-case-scenarios to fret over. Though the House map favors them, control of the chamber comes down to roughly 30 toss-up races. Assuming the polls are not systematically flawed, Republicans would have to win roughly twice as many of those toss-ups as Democrats to maintain control of the chamber, a feat that is unlikely but far from impossible.Young and minority voters — whose turnout tends to drop significantly in midterm years — are showing greater than normal enthusiasm this cycle, but if they end up turning out in typical midterm numbers, Democrats could fall short.Meanwhile, polling shows bleak Democratic odds for wrenching the Senate away from Republicans, meaning that just two dozen to three dozen House races will decide whether Democrats have any real legislative and oversight power for the next two years.\nPolitics\n                    By CHARLIE MAHTESIANAnother important wild card is the group of new and irregular voters who turned out for Trump in 2016 — a group whose behavior pollsters have found hard to predict. It remains unclear how many will vote without Trump’s name on the ballot, but the president has courted them hard, and a strong turnout could deliver a better-than-expected showing for Republicans.Democrats are also agonizing over exotic threats they’ve never had to worry about before — including the prospect of undetected foreign interference. A recent Pew survey found that Democrats are far more stressed than Republicans about the threat of voting systems being hacked.All that anxiety does have a silver lining for the left: motivation.“There's this feeling that we're losing until we win,\" said Levin, who has visited with activists campaigning across the country. “None of them I talked to is confident and planning on a win,” he said. “Every one of them doesn't trust the polls, doesn't trust that this is in the bag.”For Democrats like these, haunted by “the ghosts of 2016,” Anzalone predicted that “Tuesday will be an exorcism.”Unless it’s not, right?\"That made me want to say, ‘Fuck you,’” Anzalone said. “But yes. Yes.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}