{"id": "\n\n\n\nPOLITICO\n\n\n'A great first step': Trump praises Saudi statement on Khashoggi's death\n", "paragraph": "\n                President Donald Trump speaks during a defense roundtable at Luke Air Force Base in Phoenix, Arizona where he is for a \"Make America Great\" rally on Friday night. | Nicholas Kamm/AFP/Getty Images\n                    By CHRISTOPHER CADELAGO, BRENT D. GRIFFITHS and QUINT FORGEY10/19/2018 09:40 PM EDT\n                    Updated 10/20/2018 10:20 AM EDTLUKE AIR FORCE BASE, Ariz. — President Donald Trump on Friday evening praised Saudi Arabia's statement acknowledging the death of journalist Jamal Khashoggi in its Istanbul consulate, adding that he would prefer \"some form\" of sanctions on the kingdom while stressing that arms sales should remain untouched. \"I think it’s a great first step,” Trump said in Arizona, where he will be holding a rally later, according to a pool report.Story Continued BelowHis statement comes just hours after the Saudis publicly confirmed that the Washington Post columnist died in their consulate in Turkey on Oct. 2, after saying for days that Khashoggi had left the building after a routine appointment.Trump and senior administration officials have stressed the need to wait for a full investigation into what happened to Khashoggi, who frequently wrote critically of the Saudi royal family and fled the kingdom last year. Along with confirming Khashoggi's death, the Saudis also announced that 15 individuals had been arrested in regards to their claims that Khashoggi was killed following a \"fist fight\" inside the consulate.Though Trump said Friday he found that explanation credible and applauded the Saudis' response as \"sooner than people thought it would happen,\" the president appeared hesitant to fully embrace the kingdom's account that Khashoggi perished in a physical scuffle.\"Well, I don’t know that that was — I don’t know that that’s — I mean, that’s a theory that’s being thrown out,\" Trump said, according to a White House transcript. \"I don’t think anybody said that. But they’re saying there was a fight. But that’s a theory that was put out. But they’re going to be giving us a full report.\" But Trump insisted he was not concerned that the Saudi royal family was lying to American officials regarding the circumstances surrounding Khashoggi's death.\"No, I don’t think so at all,\" Trump said. \"Because they weren’t out front with me in terms of, you know, what happened. This is really a — we just got this report from them. And you got it, along with a lot of other people. No. I think that we’ll be talking to them. We’ll see what happens. We may have some questions. We do have some questions.\"The president also said he intends to speak with Crown Prince Mohammed bin Salman within the next few days. Trump already spoke to King Salman by phone on Monday, and told reporters following the conversation that the Saudi leader “firmly denied any knowledge of” what happened to Khashoggi. \"They’ve been a great ally in the Middle East. We need them as a counter-balance to Iran. And so it’s not the simplest solution. It’s not the simplest situation to be in,\" Trump said.\"But I think we’re doing very well,\" the president added. \"And I think we’ve come a long way in a short period of time. And it’ll get solved. It'll get solved. OK?\"Trump has argued that halting arms sales to Saudi Arabia would have devastating effects on the economy. Saudi Arabia was the first country Trump visited as president during his first trip abroad and he has repeatedly touted a $110 billion arms deal he inked with the kingdom, although those numbers have been the subject of some speculation.Accompanied by Arizona Senate candidate Martha McSally during his tour of Luke Air Force Base in Maricopa County, the president at a roundtable called her Democratic opponent Kyrsten Sinema “very strange.”McSally and Sinema are engaged in a heated campaign to determine who will replace retiring Sen. Jeff Flake (R-Ariz.). The seat is viewed as one of the best pick-up opportunities for Democrats if they want to defy expectations and flip control of the Senate.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}