{"id": "\n\n\n\nPOLITICO\n\n\nGOP alarmed Obamacare attacks could cost them the House\n", "paragraph": "\n                Rep. Glenn Grothman represents what's been a GOP stronghold in Wisconsin, but health care attacks have contributed to a tightening of the race, Democrats say. | Zach Gibson/Getty Images \nElections \n                        Republican incumbents are getting pummeled after voting to scrap protections for pre-existing conditions.\n                    By RACHAEL BADE and ELANA SCHOR10/24/2018 07:43 PM EDTFor weeks, vulnerable Rep. Glenn Grothman had been getting pummeled by his Democratic opponent for voting to curb protections for people with pre-existing conditions — most recently with an attack ad depicting a little boy with an oxygen mask over his face gasping for air.So on a conference call with GOP leaders last week, Grothman pleaded with party leaders to invest in a nationwide TV ad that could run in competitive districts like his, defending the House GOP’s Obamacare repeal bill that passed the chamber last year, according to three sources on the call.Story Continued BelowYou’re on your own, was the response. It would be too expensive, Republican leaders told Grothman.House Republicans are increasingly worried that Democrats’ attacks on their votes to repeal and replace Obamacare could cost them the House. While the legislation stalled in the Senate, it’s become a toxic issue on the campaign trail for the House Republicans who backed it.Toxic and ubiquitous: Democrats have maintained an almost single-minded focus on health care in their campaign messaging. More than 54 percent of pro-Democratic campaign ads in federal races mentioned the issue between mid-September and mid-October, according to a recent study by Wesleyan University’s Media Project.Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Data provided by Advertising Analytics shows that Democratic candidates and left-leaning outside groups have spent $90.3 million on health care ads this cycle. That's 43 percent of the total $209.1 million they’ve spent on TV ads.Republicans have tried to fend off the attacks by accusing Democrats of lying — and by trying to claim that they’re the ones who want to protect insurance safeguards for the infirm. In a Tuesday morning tweet, President Donald Trump wrote that “Republicans will totally protect people with Pre-Existing Conditions, Democrats will not! Vote Republican.”But those claims ring hollow given what Republicans voted for last year. The House bill allowed states to opt out of provisions protecting the elderly and the sick from higher premiums in hopes of lowering costs for everyone else.  On top of that, the Trump administration has been trying to repeal Obamacare — including its popular safeguards for the sick — through a lawsuit supported by 20 GOP state attorneys general, including two of four Republicans running in competitive Senate races who have endorsed the court challenge.That’s given Democrats ample fodder to dog vulnerable Republicans on an issue that’s increasingly driving voters to the polls. “I’m getting my ass kicked” for backing the House repeal plan, Republican Rep. Martha McSally, who’s running for an open Senate seat in Arizona, acknowledged to Sean Hannity this week. Though she insisted that the repeal bill is “being misconstrued by the Democrats,” it’s clear she thinks the ads are taking a toll.“They’re trying to invoke fear in people who have family members and loved ones with pre-existing conditions,” she told Hannity. McSally is airing her own ad in response claiming that she’s “leading the fight to ... force insurance companies to cover pre-existing conditions.”Grothman represents what’s been a GOP stronghold in Wisconsin, but the health care attacks have contributed to a tightening of the race, Democrats say. Grothman has been forced to spend money parrying the attacks, and he argued during a debate against his challenger, Democrat Dan Kohl, last night that he never voted to gut protections for people with pre-existing health problems.\nElections\n                    By RACHAEL BADE and ELENA SCHNEIDER“I’m Glenn Grothman, and I won’t take a dime from pharmaceutical companies,” Grothman said in a new ad released this week. The video aired just a few days after Kohl’s ad depicting the sick child and asserting that “insurance companies love Glenn Grothman,” because he “does what they want, so they give thousands to his campaigns.”“Health care is the No. 1 issue I hear about on the trail,” Kohl said in an interview Wednesday. “People here are rightfully concerned about their health care being taken away.”Sen. Chris Murphy (D-Conn.) said in a recent interview that his party’s “turnout data tells us health care is the No. 1 issue that’s going to move low-frequency Democratic voters to the polls in a few weeks.”While the debate over health care used to favor Republicans, a Washington Post/ABC News poll released last week found that voters trust Democrats on the issue more than Republicans by a 53 percent to 35 percent margin.The idea of scuttling protections for pre-existing conditions is unpopular across the political spectrum. More than seven in 10 voters, including two-thirds of Republicans, said it should be illegal for insurers to be allowed to charge more for coverage of individuals with earlier health problems, according to a Morning Consult poll released last month.Senate Democratic candidates have intensified their focus on health care in the campaign in recent days, after Majority Leader Mitch McConnell (R-Ky.) said he could take another crack at repealing Obamacare next year, depending “on the outcome of the election.” Murphy described that interest in revisiting Obamacare repeal as “a gift” to Democrats, and Senate Republican candidates are tiptoeing around the issue.Indiana GOP nominee Mike Braun, who’s running neck-and-neck with Democratic Sen. Joe Donnelly, walked that rhetorical tightrope on Wednesday. He told reporters on a conference call that he “won’t be for [Obamacare] repeal unless we’ve got a great replacement” that addresses pre-existing conditions as well as caps on coverage that Obamacare eliminated.“When we do repeal” Obamacare, Braun said, “we need to have something ready to go or else we will lose the trust of the public that we’ve got something that’s going to replace it.”McConnell, for one, has praised Senate GOP candidates for being “able to deal with” the onslaught of Democratic ads slamming his party on Obamacare repeal.\nElections\n                    By ELENA SCHNEIDER“There’s nobody in the Senate that I’m familiar with who’s not in favor of covering pre-existing conditions,” the Senate GOP leader told Bloomberg last week.Dodging the topic is tougher for House Republicans because many of them voted for repeal. The text would have allowed states to define their own “essential health benefits” rather than using Obamacare’s definition of health care services that all insurance companies had to cover. And states could decide to opt out of requirements that insurance companies charge healthy and sick people the same.Additionally, the bill would have given insurance companies more leeway to charge seniors higher premiums; Democrats and AARP have called that proposal an “age tax.” A recent Democratic attack ad in GOP Rep. Brian Mast’s coastal Florida district, a hotspot for retirees, highlighted the vulnerable lawmaker’s vote for the House GOP replacement plan.“Here at home, Brian Mast’s votes could increase premiums almost $3,000 per family,” the narrator says in the ad. “Florida can’t afford to pay more for health care. And we can’t afford Brian Mast.”House Republican are trying to argue that their failed bill would have protected people with pre-existing conditions because it also created a stopgap, or “risk pool,” to cover anyone priced out of the market. But the bill had a finite amount of funding for that: $138 billion, which some health care analysts said was way too little to work.Democrats like Kohl are calling the GOP claim that they’re protecting sicker individuals a “flat-out lie.” And Democrats around the nation predict that Republican attempts to wiggle away from the effect of their Obamacare repeal legislation won’t pass muster with the electorate.“Once the Titanic hits the iceberg,” said veteran Democratic strategist Jesse Ferguson, who works with multiple health care groups, “you can’t fix the problem by changing your navigation system.”James Arkin and Adam Cancryn contributed.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}