{"id": "\n\n\n\nPOLITICO\n\n\nFinal polls point to narrow House majority for Democrats\n", "paragraph": "\n                President Donald Trump, more focused on statewide races in the campaign's closing days, held an evening rally in Tennessee for GOP Senate nominee Rep. Marsha Blackburn. | Alex Wong/Getty Images\nElections\n                        The head of Senate Democrats' campaign arm, meanwhile, said the party has a 'narrow path' to taking the chamber.\n                    By STEVEN SHEPARD11/04/2018 12:40 PM EST\n                    Updated 11/04/2018 08:40 PM ESTDemocrats’ marathon campaign to seize the House sped toward the finish line Sunday, with national indicators suggesting the party is on track to end Republicans’ eight-year majority in Tuesday’s elections.New ABC News/Washington Post and NBC News/Wall Street Journal polls show Democrats with high-single-digit leads on the generic congressional ballot. That edge will likely translate into the 23-seat gain required to win control, but not necessarily enough to capture a more significant majority, given the GOP’s structural advantages in the way congressional districts have been drawn.Story Continued BelowThat was confirmed by CBS News’ “Battleground Tracker” — a data-based model that, as of Sunday, showed Democrats leading Republicans, 225 House seats to 210 seats, but with a majority-flipping margin of error of plus or minus 13 seats.While the House is in major peril for Republicans, President Donald Trump is more focused on statewide races in the closing days of the campaign — looking to protect the GOP’s Senate majority and a number of key governorships. Trump had two stops planned on his red-state whistle-stop tour Sunday to boost Republican candidates: a late-afternoon rally with Georgia governor candidate Brian Kemp and an evening event in Tennessee for Rep. Marsha Blackburn, the GOP’s nominee to hold a Senate seat there.It’s unlikely Democrats will gain the two seats they need to win the Senate. Sen. Chris Van Hollen (D-Md.), the freshman senator leading Democrats’ campaign arm, acknowledged his party’s long odds but said it's not impossible.“We do have a path,” Van Hollen said on “Fox News Sunday.” But, he added, “It is a very narrow path.”\nTrump tried to foreclose part of that path when he rallied for Blackburn on Sunday evening in Chattanooga. He talked up his administration's economic record but also went heavy on the immigration, which has become central to his party's closing message ahead of Tuesday. He dinged Blackburn's opponent, former Gov. Phil Bredesen, by tying him to national Democrats, and said a vote for Blackburn would send a message to the resistance. \"[Senate Minority Leader Chuck] Schumer begged Phil to run because he knows that Phil will always do what Schumer says and always, always do what Nancy Pelosi wants him to do,\" Trump said.Blackburn, in her brief remarks during the rally, pitched red meat to the friendly crowd. \"If you want to vote 'no' on Hillary Clinton and her cronies one more time, stand with me,\" she said.Hours before the Trump event in Chattanooga, Bredesen hosted an interfaith prayer lunch in the city, predicting the president’s attacks against him but sticking to his centrist message that he’s willing to work with Trump after the election ends. “I want to emphasize this, that whatever is said in the heat of the campaign won’t affect my willingness, eagerness even, to work with the president,” Bredesen said. “When this election is over, it’s over.” Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.A Fox News poll last week showed Blackburn 9 points ahead. But strategists in both parties say the race is closer and point to the large number of votes cast during the now-concluded early voting period in Tennessee and other Senate battlegrounds as reason for greater uncertainty.Two states, Texas and Nevada, have already surpassed total turnout levels in 2014 as citizens rush to the polls during early voting, according to data from the U.S. Election Project, which tracks voter turnout and is run by University of Florida professor Michael McDonald. Arizona and Tennessee are close behind, with early voter turnout within 60,000 votes of total turnout in the 2014 midterms in both states.“The early vote in states like Nevada and Arizona has been very strong,” Van Hollen said Sunday. “It does appear young voters are coming out.”That higher youth turnout in Arizona is good news for Democratic Rep. Kyrsten Sinema, who is battling GOP Rep. Martha McSally in one of the cycle’s most hotly contested Senate races, which recent polls show is neck-and-neck. Sinema spent Sunday stopping by events to greet voters, while McSally prepared for a tele-town-hall with her supporters after linking up with Gov. Doug Ducey and other GOP candidates. McSally, who accepted a “Tax Ax” award for her record of supporting conservative tax policies, rapped Sinema’s past protests against the Iraq War and her approach to immigration, drawing cheers from the crowd at a pancake breakfast in one of the state’s rural red strongholds. While McSally has spent significant energy on tarring Sinema as too liberal for the state, the Democrat’s concerted efforts to bill herself as more independent than the rest of her party have helped inoculate her to some degree.\n                            Republican Rep. Martha McSally, campaigning to become the first female U.S. Senator from Arizona, holds an ax presented to her as a symbolic gesture of efforts to cut taxes on Sunday at a mall in Prescott, Arizona. | M. Scott Mahaskey/POLITICOIn Florida, Sunday is the final day of early voting in some of the state’s largest counties, and a number of black churches were expected to participate in what they dubbed “Souls to the Polls” trips to early voting locations. That could help Democrats chip away further at Republicans’ dwindling relative advantage: As of the end of the day Saturday, registered Republicans had cast only 28,000 more votes than Democrats out of 4.8 million early and absentee votes thus far.Trump was joined Sunday in Macon, Ga., by Kemp — who bailed on a long-planned televised debate with his Democratic opponent, Stacey Abrams, to join the president on the hustings instead. There, Trump repeatedly praised Kemp and contrasted the Republican with Abrams, describing her as “one of the most extreme far-left politicians in the country\" who \"wants illegal aliens to be part of the blue wave\" and will restrict gun ownership if elected.The president added that he thinks the chances of a Democratic wave seemed to be fading. “But you better get out and vote; otherwise I’m going to look very bad with this statement,\" he added.Kemp's position as secretary of state in Georgia has put him in the controversial role of having oversight of an election in which he’s competing. Voting rights and integrity were reignited as election flashpoints Sunday morning, when Kemp’s office announced, in a press release, that it had opened an investigation into the state Democratic Party after what it called “a failed attempt to hack the state's voter registration system.”“While we cannot comment on the specifics of an ongoing investigation, I can confirm that the Democratic Party of Georgia is under investigation for possible cyber crimes,\" said Candice Broce, Kemp’s press secretary. \"We can also confirm that no personal data was breached and our system remains secure.\"The Democratic Party of Georgia, in a statement, called the announcement a “political stunt.” And Abrams, in an interview on CNN on Sunday, slammed Kemp.\"I've heard nothing about it, and my reaction would be that this is a desperate attempt on the part of my opponent to distract people from the fact that two different federal judges found him derelict in his duties,\" Abrams said on “State of the Union,\" citing court decisions that said Kemp's office was too restrictive in its application of voting laws regarding registrations and accepting absentee ballots.\nElections\n                    By BEN SCHRECKINGERWhile Trump was headed to Georgia, former President Barack Obama was in Gary, Ind., campaigning for Sen. Joe Donnelly, one of the most vulnerable Democratic senators up for reelection this year. While there, Obama went after Trump and Republicans’ closing message of the election, arguing that their focus on the migrant caravan and immigration was done to inspire fear in voters, but that sometimes “tactics of scaring people and making stuff up work.\"“While they're trying to distract you with of all this stuff, they're robbing you blind,” Obama said. “They'll be like, 'Look, look, look: Caravan, caravan,' and then they're giving tax cuts to their billionaire friends.”Later Sunday, Obama traveled to his hometown of Chicago to stump for gubernatorial candidate J.B. Pritzker and two Democratic congressional hopefuls in northern Illinois: Sean Casten and Lauren Underwood, who are challenging GOP Reps. Peter Roskam and Randy Hultgren, respectively. More than 5,000 people were in attendance at the University of Illinois-Chicago.Meanwhile, in Massachusetts, where Elizabeth Warren is ahead by 20 percentage points in her bid for a second term this week, the potential Democratic presidential candidate was still on the campaign trail Sunday, warning about the possible consequences of continued GOP control of Congress. \"If they get the votes, they're coming back after health care again,\" Warren said, reiterating a well-traveled Democratic talking point this fall.The potential Democratic takeover of the House has drawn the lion's share of attention in the final days of the campaign. On Saturday, in two suburban Philadelphia districts, candidates cast the outcome as either a badly needed check on Trump — or the start of a worrisome phase of governance.In Bucks County, Pa., Democrat Scott Wallace, who’s running against GOP Rep. Brian Fitzpatrick, rallied with Gov. Tom Wolf, Sen. Bob Casey and Senate Minority Whip Dick Durbin of Illinois. “We have to turn the House blue,” said Wallace. “Then we can get some real accountability in Washington.”But across the Delaware River in New Jersey, GOP Rep. Tom MacArthur — who’s locked in a tight race with Democrat Andy Kim — warned Republicans outside the Burlington County GOP headquarters of what might happen if Democrats win back control of Congress.\"Tuesday, we have to win, because we don't want a dysfunctional government for the next two years,\" MacArthur said. \"And that's what we'll get if Nancy Pelosi and Chuck Schumer are just there to divide the country.\"And in California's Central Valley, endangered GOP Rep. Jeff Denham, joined on the trail by underdog gubernatorial candidate John Cox, avoided any mention of Trump, who lost his Modesto-based district in 2016. Instead, Denham tried to keep it local, focusing on water issues and casting the race as an attempt by liberals to hijack the conservative district.Contributing to this report: Elena Schneider in Chalfont, Pa.; Marc Caputo in Miami; Elana Schor in Prescott, Ariz.; Daniel Strauss in Macon, Ga.; Jeremy B. White in Modesto, Calif.; Stephanie Murray in Worcester, Mass.; Shia Kapos in Chicago; and James Arkin, Scott Bland and Aubree Eliza Weaver in Washington.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}