{"id": "\n\n\n\nPOLITICO\n\n\nJohn Kelly makes final bid to save Kirstjen Nielsen’s job\n", "paragraph": "\n                White House chief of staff John Kelly’s bid to save Homeland Security chief Kirstjen Nielsen may be motivated in part by an understanding that, with Nielsen gone, he would be almost completely isolated in the administration. | Drew Angerer/Getty Images\nWhite House\n                        The White House chief of staff is trying to convince Trump that his embattled Homeland Security secretary is not to blame for a recent uptick in Mexican border crossings. \n                    By ELIANA JOHNSON11/16/2018 06:37 PM ESTWhite House chief of staff John Kelly is fighting to save Kirstjen Nielsen, the Homeland Security chief at whom President Donald Trump has lashed out for the rise in border apprehensions over the past several months. Kelly, whose fate in the administration is also unclear, is working to convince the president that Nielsen is not to blame for a recent surge in arrests at the U.S.-Mexico border that has enraged him, according to two sources familiar with the conversations.Story Continued BelowNielsen also has other supporters, including Secretary of State Mike Pompeo, who have told Trump that Nielsen cannot control the border crossing rate.Much like several since-fired officials before her, Nielsen — who stood next to Trump with hands clasped at a Friday photo-op to tout new cybersecurity legislation — has carried on with her duties well after Trump has signaled he wants her gone. Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Kelly’s bid to save Nielsen may be motivated in part by an understanding that, with Nielsen gone, he would be almost completely isolated in an administration that several of his onetime allies have departed. But the retired Marine general and his former top aide are hardly the only ones whose jobs are at risk in what could be one of the most dramatic Cabinet and staff shakeups in modern presidential history.The two weeks since the midterm elections have served as a long wind-up for the president to make big changes to his Cabinet. But aside from firing his attorney general, Jeff Sessions, Trump has yet to make a move, instead letting advisers including Nielsen, Kelly, Interior Secretary Ryan Zinke and Commerce Secretary Wilbur Ross dangle in a state of awkward public limbo.White House officials would like to plan for orderly firings and replacements, but acknowledge that — particularly when it comes to personnel issues — it is almost futile to expect Trump to follow a plan.\n                            Homeland Security Secretary Kirstjen Nielsen looks on as President Donald Trump speaks during a signing ceremony in the Oval Office on Friday. | Evan Vucci/AP PhotoIt's far from an unfamiliar plight. Past officials including former Secretary of State Rex Tillerson, former chief of staff Reince Priebus and former national security adviser H.R. McMaster were all treated to weeks or months of reports about their impending doom before their official dismissal, with Trump pawing at them like a cat toying with wounded mice. In the cases of Tillerson and Priebus, the deed was done with a presidential tweet.But even longtime Trump observers say his public dithering is being exacerbated by special counsel Robert Mueller’s intensifying probe and by the upcoming Democratic takeover of the House, which threaten to constrain the Trump presidency in ways yet unknown. The president has spent hours with his lawyers over the past several days answering written questions from Mueller and his team, and Trump told reporters on Friday that he had recently finished the process. “I think he’s feeling the pressure of both the Mueller investigation and that the House is going to have all of this institutional power over him, and he likes to feel unfettered,” said Trump biographer Tim O’Brien. “And I think that’s why you have this heightened sense this week that everybody is walking on eggshells — these institutional forces are really causing him to lash out.”The big question in the White House now is when — and how — Trump conducts the multiple firings and reassignments that his inner circle assumes are coming.\nCongress\n                    By RACHAEL BADEWhite House aides are looking ahead to several upcoming Air Force One flights, which will provide the president with hours of open TV and iPhone time, as potential killing fields for advisers in jeopardy. The president will fly from Washington to California on Saturday to visit with victims of the wildfires that have ravaged the state, and then to his Mar-a-Lago resort on Wednesday for Thanksgiving.“I wouldn’t want to be on that plane,” said a Trump friend who speaks with the president frequently.In a move few White House aides were prepared for at the time, Trump dismissed Priebus by tweet while sitting aboard his plane — announcing Kelly as Priebus’ successor before he had formally offered Kelly the job.“I am pleased to inform you that I have just named General/Secretary John F Kelly as White House Chief of Staff. He is a Great American and a Great Leader,” Trump wrote, as Air Force One idled on the tarmac at Andrews Air Force Base. That announcement came during another period of turmoil for the administration, the day after Trump named Anthony Scaramucci his communications chief.Beginning on election night, Trump has made clear to virtually everybody with whom he has come in contact that he wants Nielsen gone. He acknowledged publicly on Wednesday that he is mulling widespread changes, telling the Daily Caller in an interview that “always in an administration after the midterms you make changes, so, I’m looking at things and I’ve got a lot of options. A lot of people want to come in. A lot of politicians that have had very successful careers that are very good want to come in.”“I will be making a decision on Homeland shortly,” he added. But by Friday evening, there was still no word from the White House.While Trump has expressed skepticism about the 46-year-old Nielsen from the time she succeeded Kelly as DHS chief last December, after Kelly moved to the White House, the president has been particularly upset by recent data showing that border arrests — generally considered an indicator of illegal immigration rates — are on the rise.Trump has boasted in the past about low border-crossing rates, which he considers a critical metric of a Homeland Security director’s effectiveness, even though many factors determine rates of illegal immigration, including how many jobs are available within the U.S. for migrants.After a plunge in border apprehensions around the time of Trump’s 2016 election — a drop for which Trump has taken credit, and for which he also credited then-DHS chief Kelly — that rate has steadily risen since mid-2017 and is now close to levels predating Trump’s presidency, according to the Pew Research Center.While Kelly, Pompeo and others are pushing the president to keep her on, Nielsen is not without her critics in the administration. They include national security adviser John Bolton, who engaged in a heated argument with Kelly in the Oval Office last month after Bolton said Nielsen's department was to blame for not doing more to discourage illegal immigration. Trump became particularly focused on the issue during this fall’s election campaign, when he warned that a caravan of several thousand Central American migrants headed to the U.S.-Mexico border amounted to an “invasion” of America.\nwhite house\n                    By ANNIE KARNINielsen’s departure would leave Kelly more isolated than ever in the administration. Some of his closest West Wing collaborators have departed in recent months, including former White House counsel Don McGahn and former White House deputy chief of staff Joe Hagin. Nielsen’s ouster would serve as an exclamation point.Nielsen guided Kelly through his confirmation hearings to be secretary of Homeland Security and accompanied him to the White House, where she served as his deputy, before she was nominated to be secretary of Homeland Security. Republicans on Capitol Hill and in the White House speculated Wednesday that if Trump dismisses Nielsen in a humiliating manner, that might be enough to prompt Kelly to depart as well.Some of the president’s allies are urging him to announce several dismissals at once, along with a handful of replacements, in order to stanch what one characterized as the “drip, drip” of salacious news stories.Trump has upended his own administration’s plans for orderly mass firings before, though. His dismissal of McMaster by tweet last March ruined plans for an announcement of a wider administration shakeup that included the dismissal of Veterans Affairs Secretary David Shulkin, among others. The president has also made clear the blizzard of news coverage about personnel intrigue inside the White House is an irritant, declaring on Twitter on Thursday, “The White House is running very smoothly and the results for our Nation are obviously very good. We are the envy of the world. But anytime I even think about making changes, the FAKE NEWS MEDIA goes crazy, always seeking to make us look as bad as possible! Very dishonest!”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}