{"id": "\n\n\n\nPOLITICO\n\n\nTrade war: Chinese exporters’ front-loading beats U.S. tariffs, but for how long?\n", "paragraph": "\n                Chinese shipping containers are unloaded at the Port of Long Beach in Los Angeles County. Chinese exporters have accelerated production to avoid the upcoming tariff increase. | Mark Ralston/AFP/Getty Images\nSouth China Morning Post\n                    By HE HUIFENG | SOUTH CHINA MORNING POST 11/04/2018 11:42 AM ESTThis story is being published by POLITICO as part of a content partnership with the South China Morning Post. It originally appeared on scmp.com on Nov. 4, 2018.Guangzhou Seagull Kitchen and Bath Products, which relies on the U.S. market for over a third of its revenues, has been running its production lines in China around the clock for the past three months, according to its workers.Story Continued BelowUniformed employees outside its factory compound said they were working 12-hour shifts to expedite orders for early next year, making sure their tap handles arrive in the United States ahead of a scheduled tariff increase.The bathroom fixtures Seagull makes are on the list of $200 billion worth of Chinese products on which the U.S. imposed a 10 percent duty starting on Sept. 24, and which is set to rise to 25 percent on Jan. 1 if Beijing does not make trade concessions.“Many of us have to work rotating [12-hour] shifts from 8 p.m. to 8 a.m. or 8 a.m. to 8 p.m. each day,” said a migrant worker in his forties, who declined to be named. He and his colleagues were having a late lunch, costing 12 yuan ($1.70 in U.S. dollars) each, in a small restaurant outside the factory on the outskirts of Guangzhou, the capital of south China’s Guangdong province.A speed read on global trade news — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Analysts have said the practice by Chinese exporters of accelerating production and shipment now to avoid the upcoming tariff increase — or “front-loading” orders — is one probable reason behind China’s strong export performance since Washington started to levy its first round of tariffs on Chinese imports in early July.The practice may be widespread, because Chinese exports of chemicals, non-ferrous metals, plastics and special industrial machinery were the fastest-growing Chinese export categories in September, according to Chinese customs data, despite all of them being included on U.S. tariff lists.But fulfilling next year’s orders so far in advance could lead to a significant slowdown in future sales if U.S. clients reduce their next orders accordingly. China’s official purchasing manager’s index has shown new export orders have been contracting since June.Ding Shuang, the chief China economist at Standard Chartered bank, who has just visited exporters in the eastern province of Zhejiang, said many companies were doing the same as Seagull and the production frenzy could last the rest of the year.“Increased demand for shipments has pushed up shipping rates and some exporters are even having trouble finding any space on cargo ships,” Ding said. But the situation could quickly turn bad next year, he warned, as exporters face a double blow from fewer new orders and a sharp depletion of existing orders.So far, the trade war has not had any significant impact on China’s trade and broad economy. Manufacturers’ front-loading may be partly responsible.China’s exports rose 14.5 percent in September from a year earlier, accelerating from a 9.8 percent rise in August. Meanwhile, its trade surplus with the U.S., its biggest export market, widened to a record $34 billion last month.In Guangdong, China’s export manufacturing hub, the economy expanded 6.9 percent during the first three quarters of 2018 from a year ago, or slightly higher than the nationwide growth rate of 6.7 percent for the period.Guangdong’s exports posted a modest rise of 0.4 percent in the first nine months of the year, rebounding from a 3.3 percent decline in the first half, implying strong third-quarter gains.The stronger exports figure was supported by activity at factories like Seagull’s. The question is what will these factories do once those orders have been completed, particularly if U.S. clients reduce or even stop orders because of the extra tariff costs.Listed on the Shenzhen Stock Exchange, Guangzhou Seagull is one of a few Chinese listed companies to have disclosed the possible impact on their operations from the U.S. tariffs.The maker of high-end kitchen and bath plumbing products and bathroom furnishings for brands in the United States, Europe and Asia said in a statement that its tap components, the main product line it exports to the U.S., were on the new tariff list.The company’s U.S. sales exceeded 372 million yuan in the first half of this year, accounting for about half of its export revenue and more than 35 percent of its total revenue.Seagull said it was working with its U.S. clients to apply for a one-year exemption from the tariffs.If this does not work, its U.S. clients will have to raise sales prices. Some of its U.S. clients have asked Seagull to “shoulder part of the extra costs”, but the company said it was trying to avoid that.It said it had started talking to some U.S. clients about moving production out of China. “We will proactively explore the proposal of setting up factories abroad to maintain relations with U.S. clients,” it said in a statement.Its investor relations office declined to comment further on its plans for managing the impact of the trade war. It also declined to reveal information about its internal production arrangement.Guangzhou Seagull was set up in 1998, backed by Taiwanese businesspeople, with China’s labor-intensive export-oriented manufacturing industry thriving thanks to cheap labor and high demand from the United States, Europe and Hong Kong.Mainland officials rolled out red carpets for investors from Taiwan and Hong Kong to build factories. A local worker in Guangzhou cost 400 to 500 yuan a month, whereas a skilled Hong Kong worker made 20 times that at the time.The business grew quickly in the 2000s by making products mainly for the U.S. and Europe, but the fundamentals that made it successful have changed since. Labor, rent and raw material costs have soared, eating up profits and making Chinese products less competitive. Tariffs have only made things worse.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}