{"id": "\n\n\n\nPOLITICO\n\n\nRoger Stone ally expecting Mueller indictment\n", "paragraph": "\n                Jerome Corsi said he's raising money for his legal defense. | AP Photo\nLegal\n                        Jerome Corsi, a longtime Stone associate and conspiracy theorist, said Mueller snared him in a 'perjury trap.'\n                    By KYLE CHENEY and DARREN SAMUELSOHN11/12/2018 05:48 PM EST\n                    Updated 11/12/2018 06:32 PM ESTJerome Corsi, an ally of longtime Donald Trump associate Roger Stone, said Monday that he expected to be indicted by special counsel Robert Mueller for perjury.Corsi, a conspiracy theorist who has been meeting with Mueller‘s team for two months, said that he spoke to prosecutors for around 40 hours but that talks had “all blown up.“Story Continued Below“I‘m going to be indicted,“ he said in a livestreamed video. “I anticipate being indicted.“Reports have suggested that Mueller‘s interest in Corsi stems from a review of communications between him and Stone in 2016 about an impending release of Clinton campaign emails by WikiLeaks, the transparency activist organization. Mueller is investigating whether any Americans had advance knowledge of the email dump, which dominated the final weeks of the campaign. Corsi called the impending indictment the result of a “perjury trap,“ though he emphasized that he wasn‘t totally sure what the indictment might be for. Corsi‘s attorney declined to comment. Corsi also repeatedly emphasized his continued support for Trump‘s presidency and urged backers to send him money for his legal defense. “I think my crime, really, is supporting Donald Trump,“ he said, in between long rants about voter fraud and suggesting that Democrats intend to overthrow Trump. \nCongress\n                    By BRENT D. GRIFFITHSCorsi said prosecutors showed up at his house on Aug. 28, just before his 72nd birthday, and presented a subpoena. He said he didn‘t talk to them at the time. But later, with his lawyer present, Corsi said, he met multiple times with Mueller‘s team in Washington. He recalled prosecutors Jeannie Rhee, Aaron Zelinsky and Andrew Goldstein being present.Corsi also said he was raising money for his legal defense.His hourlong remarks meandered among various conspiracy theories, suggesting “criminals“ were running the Justice Department and that Democrats were seeking to “overthrow“ Trump. “In prison, if I‘m allowed to write, maybe I‘ll do some fiction about this,“ he said.Corsi gained notoriety as the author of a book questioning John Kerry‘s military service during the 2004 presidential campaign. He also fomented birtherism, a conspiracy theory that Trump ultimately championed as well. Trump once retweeted a Corsi article claiming baselessly that Obama‘s administration fabricated jobs numbers. According to an ABC report last month, Corsi was scheduled to appear before the Mueller grand jury on Nov. 2. But reporters at the Washington courthouse that day did not see him enter or leave the building. During a webcast last Monday, Corsi said he’d been involved “in a really constant basis” with the Mueller investigation for about two months.“It’d been one of the biggest pushes of my life,” he said on the show. Beyond that, Corsi said, he couldn’t talk about the special counsel inquiry.“There will come a time when I can and will talk about it,” he said, “but right now I’m going to continue to follow my lawyer’s advice and be in a ‘no comment‘ mode.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}