{"id": "\n\n\n\nPOLITICO\n\n\nThousands flock to Bernie rally in run-up to 2020\n", "paragraph": "\n                Sen. Bernie Sanders owns a national profile that most of his potential rivals have yet to develop.  | Carlos Osorio/AP Photo \nElections \n                        The Vermont senator rips Trump at an appearance in Bloomington, Indiana.\n                    By DAVID SIDERS10/19/2018 04:53 PM EDTBLOOMINGTON, Ind. — Bernie Sanders can still draw a crowd.Touching off a nine-state midterm election blitz here Friday, rally-goers clad in T-shirts from Sanders’ 2016 campaign cheered as the independent senator from Vermont reprised his progressive credentials on student debt, health care and the minimum wage. And they jeered along with Sanders as he mocked Trump — a prelude to a potential 2020 campaign.Story Continued Below“Now Trump, he’s a very, very tough guy,” Sanders told about 3,000 people in this college town. “He’s a very, very strong guy when he tears little children at the border from the arms of their mothers. What a tough guy. But he ain’t such a tough guy when he has to deal with Putin … He is not such a tough guy when he has to deal with his billionaire friends in Saudi Arabia, who just tortured and murdered a courageous journalist.”No longer the curiosity that he was when he entered the 2016 presidential primary — with his then-meager fundraising base and Hillary Clinton’s near-inevitability staring him down — Sanders now wields one of the most coveted email lists of progressive voters and donors in the country. He owns a national profile that most of his potential rivals have yet to develop. And while Sanders may run into a buzz-saw as early as Saturday, when he visits the less hospitable early primary state of South Carolina, he proved here Friday that he remains a popular force on the left.Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.The rally — and a brisk march that Sanders led from the rally to a voting center blocks away — opened Sanders’ nine-state blitz ahead of the midterms, with planned appearances in the early 2020 nominating states of Iowa, Nevada and South Carolina. But his first and last appearances, in Indiana and California later this month, are freighted with significance, as well: Sanders won the Indiana primary in an upset in 2016, and his prospects in 2020 would rely on a large delegate haul in California, where Sanders campaigned for weeks in his losing race to Clinton.Jeff Weaver, Sanders’ 2016 campaign manager and closest political adviser, said Friday that he does not know whether Sanders will run in 2020.But caught up in the throng of supporters surrounding Sanders as he led supporters to the voting center — with the crowd spilling from the sidewalk onto the street — Weaver said, “From my perspective, this is an auspicious start.”By the end of his tour, Sanders will have visited 32 states since the 2016 election. He has raised about $1.8 million for fellow candidates, with that total to exceed $2 million by the end of the election cycle.“Back in the [2016] primaries, just prior to that, people almost thought we were conspiracy theorists,” said Laurie Cestnick, a former Sanders campaign volunteer and founder of Occupy DNC Convention, which held dozens of protests during the 2016 Democratic National Convention.Now, she said, “I think the awareness [of Sanders] is just there, where it wasn’t before … I think he has a far greater chance.”If he runs in 2020, the challenges will be stiff. In part because of Sanders’ prodding on issues ranging from health care to the minimum wage, the Democratic Party has shifted closer to his leftist profile since the 2016 election, and Sanders will almost certainly face opposition from other high-profile progressives.“It’s a different environment for him: The landscape for progressive Democrats has shifted pretty substantially, and largely in our favor,” said Arshad Hasan, a Sanders delegate in 2016 and former executive director of the activist group Progress Now. “But that’s a double-edged sword … You’ve got Bernie, who has a much higher profile than he did four years ago. But at the same time, there’s more room” for other progressive candidates to run.\nThe Friday Cover\n                    By ANNIE KARNIIn the run-up to the 2016 election, Democracy for America was part of an unsuccessful effort to recruit Sen. Elizabeth Warren (D-Mass.) to run for president, before ultimately endorsing Sanders. This year, Warren is poised to enter the race, and Sen. Jeff Merkley (D-Ore.), the only senator to endorse Sanders in 2016, is mulling a run.While Charles Chamberlain, DFA’s current executive director, said his members’ support for Sanders is “definitely strong,” he added, “Will he be the choice of our membership for the presidential race? I think that’s an open question.”In 2016, Chamberlain said, “It was [Sanders] versus Clinton. What we’re going to be looking at in [2020] is Bernie Sanders versus 20 other people.”In an expansive 2020 presidential field, Sanders is likely to be squeezed not only by progressive rivals, but by many moderate Democrats who continue to keep their distance from him. Earlier this week in Indiana, Democratic Sen. Joe Donnelly cut a campaign ad criticizing “socialists” and “the radical left” for positions on health care and immigration, while moderate Democrats in South Carolina, where Sanders will be on Saturday, have responded tepidly to his pre-election tour.“If Bernie wants to run again, as he is definitely thinking about, then it’s clear that he has to approach it differently than he did the first time,” Hasan said. “I think the first time, he really kind of made it about, ‘There’s two visions of the Democratic Party: progressive and not,’ and that was kind of his singular analysis.”Now, Hasan said, “One of the things that he’s really come to learn is that there are so many different factions and flavors of the Democratic coalition.”In addition to the three early nominating states that Sanders will visit, his tour will take him to Michigan, Iowa, Wisconsin, Arizona, Colorado and California. The last stop is critical to his 2020 chances, with Sanders’ advisers believing the weeks he spent campaigning there in a losing effort in 2016 — effectively his last stand of the primary campaign — could pay off with a large delegate haul in 2020.Sanders has used the midterm election cycle to lay groundwork for a 2020 campaign in subtler ways, as well. In recent months, he has expanded his focus on foreign policy — a perceived weakness in 2016 — articulating his brand of progressivism not only as a domestic matter, but as a vehicle to counter authoritarianism abroad. More significantly, he has used the midterm elections to align himself with several prominent African-Americans, whose lack of support in 2016 hobbled Sanders in the South.\nElections\n                    By ALEX THOMPSON This year, he has supported all three African-American Democrats running for governor in November. In addition to backing Stacey Abrams in Georgia and Ben Jealous in Maryland, Sanders delivered a crucial endorsement to Andrew Gillum, now Florida’s Democratic gubernatorial nominee, when few thought Gillum could prevail in the primary.Still, Sanders has a ways to go to overcome his landslide loss to Clinton in South Carolina and his failure to gain traction with African-American voters in the South.Antjuan Seawright, a South Carolina-based Democratic strategist who worked for Clinton’s campaign in 2016, said he’s doubtful Sanders can significantly expand his coalition.“With the potential of several other candidates being African-American, and there’s some talk about a possible Latino or two to also be in the race, I think that presents a real challenge for Sen. Sanders and a lot of other people who are entering the race,” he said.Sanders has demurred when asked about his 2020 plans, telling CNN recently that “we will see what happens.” But the effort to distinguish Sanders from the rest of the burgeoning Democratic field has been ongoing since the 2016 election, with Sanders’ supporters casting his economic populism as a 2020-ready alternative to Trump’s.Larry Cohen, a former head of the Communications Workers of America who now chairs the board of Our Revolution, a political offshoot of Sanders’ 2016 campaign, said that in 2016, “Working people weren’t feeling listened to.”“Bernie was [listening], and Bernie is,” Cohen said. “He’s authentic, in terms of decades of saying working people matter … People may not agree with him, but they don’t doubt he means what he says.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}