{"id": "\n\n\n\nPOLITICO\n\n\nPress struggles with amplifying Trump's pre-midterms claims\n", "paragraph": "\n                President Donald Trump speaks to reporters before boarding Air Force One in Elko, Nevada, on Oct. 20.  | Nicholas Kamm/AFP/Getty Images\nMedia\n                    By JASON SCHWARTZ and MICHAEL CALDERONE10/30/2018 06:44 PM EDT\n                    Updated 10/30/2018 10:11 PM EDTPresident Donald Trump appears to be throwing spaghetti against the wall in the run-up to the midterms — and seeing what he can get journalists to choke down.Earlier this month, he promised a 10 percent middle-class tax cut before the election in November, even though Congress wasn’t in session. He ordered troops to the border with Mexico to prevent a caravan of migrants from entering, yet that group is months away from reaching the U.S. And on Tuesday, he proposed ending birthright citizenship via executive order, which virtually all legal experts agree would be unconstitutional.Story Continued BelowA pattern has emerged: Trump's proposals are usually reported quickly — often credulously passed along in headlines and tweets — before thorough vetting later yields more skeptical reports.“I think there is a pattern of at least the first reports on Trump statements being insufficiently skeptical,” said Daniel Dale, a Toronto Star correspondent in Washington who has gained a large following on Twitter for his real-time fact-checking of Trump. He said reporters were too willing to assume a statement was true or a proposal realistic.“I don’t think I have all the coverage answers, but my mini-crusade has been trying to get people to not simply amplify Trump statements that are untrue without pointing out that they’re untrue,” Dale said. “Three years into this, it’s still not being done well enough, I don’t think. It’s just a core part of what we do. It’s not a departure from basic journalism.”Your guide to the media circus — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Trump’s relationship with facts has caused hand-wringing among journalists, who are still struggling with how to treat a president who says many things that don't check out after further research. Trump’s rise to political prominence was built on his false claims that President Barack Obama was not born in the U.S. As president-elect, he claimed — without any evidence — that millions of undocumented immigrants voted for Democrat Hillary Clinton, claims some news organizations initially reported verbatim. And he's been doling out new proposals freely in the weeks leading up to next week's midterms, many of which critics say are impractical and geared mainly at ginning up his base. It's not clear how that approach will play with voters, who are expected to send more Democrats to Congress in 2019.The latest test for media outlets emerged Tuesday, when Axios published a video interview in which Trump declared he could single-handedly end birthright citizenship — the idea that most people born in the U.S. are automatically citizens, as provided by the U.S. Constitution — and falsely claimed that the United States “is the only country in the world” that has such a practice. More than 30 countries have similar policies.Almost immediately, the Associated Press blasted out Trump’s false claim about other countries to more than 300,000 Twitter followers, only to later delete the tweet. Axios also initially failed to challenge Trump’s remarks — both during the interview itself and in print — although its piece was updated later Tuesday. The New York Times made similar updates to its own piece, and POLITICO also initially reported Trump's quote without push-back.But despite the mid-day course correction, Trump's comments were enough to get attention focused on the White House's preferred topics, tweeted Atlantic writer David Frum, a Trump critic.“Trump's birthright citizenship vaporware is intended to prod cable TV into discussing something exciting to him, not boring stuff like pre-existing conditions and why would-be murderers are allowed to amass arsenals that could equip the police department of a small town,” Frum tweeted. “Or the worst month on world stock markets since 2009.”Kathleen Bartzen Culver, the director of the Center for Journalism Ethics at the University of Wisconsin-Madison, said Trump understands how conflict, novelty and his own out-sized persona increase the news value of stories, and he exploits news outlets’ race to report on him as soon as possible, despite the fact that he has racked up more than 5,000 falsehoods in office, according to a Washington Post tally.“Donald Trump is particularly good at playing into some of the traditional practices of news and elevating coverage of himself,” Culver said.\nElections\n                    By DAVID SIDERSThe key to resisting that tactic, according to journalists and media experts, is not ignoring what the president says but adding context, even if it means taking longer to publish a story.“Presidents often make proposals that may not have much chance of ever becoming law, sometimes to shape a campaign and sometimes just to generate a national debate on an issue they care about,” New York Times chief White House correspondent Peter Baker said in an email. “That doesn't mean we shouldn't cover them. It means we should help readers understand the context in which the proposals are made and the circumstances that surround them.”Tim Franklin, a senior associate dean at Northwestern University’s Medill School of Journalism, said that in the case of Trump’s claim that he can end birthright citizenship with the swipe of a pen, that means journalists should be “talking to legal experts who can analyze whether this is really feasible or not” before reporting what he said.Individual journalists on Twitter quickly pushed back against Trump’s claims Tuesday. “This is false,” CNN’s Jake Tapper tweeted in response to a Bloomberg Politics tweet repeating the claim that the U.S. was the only country to respect birthright citizenship. Tapper, who boasts nearly two million followers, wrote that “at least 30 countries offer birthright citizenship, including almost every country in Central and South America.”Dale said he has seen some improvement, citing how news outlets deleted tweets or updated their stories.“I think there has been growth,” he said, “it’s just been painfully slow.” Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}