{"id": "\n\n\n\nPOLITICO\n\n\nSenate’s bid to push Trump to act on Khashoggi may fall on deaf ears\n", "paragraph": "\n                Senate Foreign Relations Chairman Bob Corker said in an interview this week that he believes the administration is taking the sanctions-triggering investigation he requested “seriously.”  | Drew Angerer/Getty Images \nCongress\n                        But the president on Friday said he will 'very much listen to what Congress has to say' on how to respond to the Saudis. \n                    By ELANA SCHOR10/19/2018 06:36 PM EDT\n                    Updated 10/19/2018 06:55 PM EDTLawmakers in both parties are incensed by Saudi Arabia’s apparent role in the killing of journalist Jamal Khashoggi — but they could end up virtually powerless to force the Trump administration to do anything about it.Republicans and Democrats have partnered in seeking an investigation into Khashoggi’s death under a law that allows sanctions to be imposed on anyone responsible, giving the administration up to four months to respond. Yet that lengthy time frame, combined with the midterm election and possible reshuffling of congressional control, raises significant questions about when and whether lawmakers will be able to leverage their power to push back if the administration doesn’t act. Story Continued BelowSenate Foreign Relations Chairman Bob Corker (R-Tenn.) said in an interview this week that he believes the administration is taking the sanctions-triggering investigation he requested “seriously.” “If there is any sense that is not being taken seriously,” Corker added, lawmakers “may well need” to consider their own “surgical piece of legislation” imposing sanctions.Corker is one of several GOP lawmakers decrying Khashoggi’s assassination and pointing to Saudi Crown Prince Mohammed bin Salman as  likely being involved in the dissident journalist's disappearance. On Friday night, the Saudi government confirmed for the first time that Khashoggi was killed, saying it was a “fist fight” gone bad. A daily play-by-play of congressional news in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.President Donald Trump said on Friday that he would “very much listen to what Congress has to say” on handling the Khashoggi crisis in U.S.-Saudi relations, leaving the door open to an affirmative decision on sanctions. However, Trump also avoided criticizing the Saudi regime’s alleged role in the Khashoggi case and reaffirmed his disinterest in any cutoff of U.S.-Saudi arms sales as a possible punishment. The president has distanced himself from reported intelligence that points to the crown prince’s knowledge of the alleged attack on the journalist, who vanished after entering the Saudi consulate in Istanbul on Oct. 2.If the administration delays imposing sanctions or slow-walks its response, it remains to be seen whether Corker would have time to pursue any narrow legislation on the issue before leaving Congress later this year. His likely successor on the Foreign Relations panel next year, Sen. Jim Risch (R-Idaho), joined last week’s bipartisan push for the administration to investigate Khashoggi’s death and decide within 120 days on sanctions for any individuals found responsible. Still, it’s not clear that Risch would push to hold Saudi Arabia accountable as strongly as Corker, who also warned of a “clampdown” in intelligence sharing on Khashoggi.  Sen. Chris Murphy (D-Conn.), one of Congress’ most vocal critics of the Saudi government’s human rights record, said in an interview: “I trust that Sen. Corker’s really serious about this, and I don’t know that will be the case if he’s not chairman.”“We’re going to be into shutdown crises after the election, given the way the president is talking about the border wall. So I do worry that some other crisis and some new dominant news cycle will take over very shortly,” Murphy said. “I think the Saudis and the Trump administration seem to be playing from the same book, which is to try to ride this out and wait until some other story grabs reporters’ attention.”Murphy and Sen. Rand Paul (R-Ky.) are poised to force a vote on blocking a U.S.-Saudi arms deal when the next one comes before Congress. It’s the sort of showdown they came close to winning last year amid bipartisan frustration over Riyadh’s role in the violent war in Yemeni. But a looming hold on those arms deals from New Jersey Sen. Robert Menendez, the Foreign Relations panel’s top Democrat, casts doubt on when lawmakers will have their next opportunity to weigh in on Trump's $110 billion in Saudi weapons sales.\nForeign Policy\n                    By MARTIN MATISHAKTrump said Friday, during an appearance alongside several House Republicans, that it “would be very hurtful to this country if we said, ‘Oh, we’re not going to sell’” promised goods to Saudi Arabia. “So, there are other things we can do.”Trump’s administration has previously used the human rights law that Congress is invoking in the Khashoggi case to sanction multiple foreign individuals, paving the way for a potential use against any Saudi official potentially found responsible for the journalist’s alleged murder. But beyond Trump’s professed openness on Friday, the State Department has been cool to the prospect of an investigation, with spokeswoman Heather Nauert saying on Oct. 15 that lawmakers are “getting ahead of themselves at this point.”When former President Barack Obama signed the human rights law at issue in 2016, he released a signing statement reserving the right to “decline to act on such requests where appropriate.”Brian McKeon, a longtime Obama administration national security aide and former senior Pentagon official, said, “I think the president’s lawyers will be saying to him, as they did in writing that signing statement for Obama, that a letter from a handful of members of Congress can’t require the president to make a determination.” “The Trump administration could either write back and say, ‘We don’t think this is a valid provision of law under the Constitution,’” added McKeon, who’s now at the Penn Biden Center for Diplomacy and Global Engagement. “Or they could, as a matter of comity, to avoid upsetting people, write back within 120 days and say we’re going to do the following number of things.”If the administration tries to wait out the current crisis or offer what lawmakers deem perfunctory punishment, then it could be up to next year’s Congress — potentially divided between a Democratic House and a GOP Senate — to try to work on a response with more teeth. The two parties successfully worked together on a Russia sanctions bill last year in response to Moscow’s electoral meddling, but it remains to be seen whether any Saudi sanctions bill could muster the same veto-proof majority that the Russia legislation notched.Four months “should be enough for them to come to us with a serious determination as to whether there was any foul play here,” one Senate Democratic aide said. “I do agree if the pressure is maintained or increases, and if the White House continues to downplay things, Congress will likely act on its own. Whether or not that means targeted sanctions — that’s likely, but I wouldn’t say that is the only option that exists.”Burgess Everett contributed to this report.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}