{"id": "\n\n\n\nPOLITICO\n\nHedge fund, VC said to buy athenahealth", "paragraph": "\n                                                            PoliticoA daily report on the intersection of health care and technology Get the Morning eHealth NewsletterBy signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.11/12/2018 10:00 AM ESTWith help from Mohana Ravindranath and Darius TahirEditor's Note: This edition of Free Morning eHealth is published weekdays at 10 a.m. POLITICO Pro eHealth subscribers hold exclusive early access to the newsletter each morning at 6 a.m. To learn more about POLITICO Pro's comprehensive policy intelligence coverage, policy tools and services, click here. Story Continued BelowBIRDS OF PREY SETTLED ON ATHENAHEALTH?: Private equity firm Veritas Capital and hedge fund Elliott Management are buying the EHR and practice management company for $5.5 billion, according to a Reuters report Sunday night. The company will hold a conference call later today after announcing third quarter earnings Friday. Athenahealth earnings were up 9 percent from the same quarter last year, thanks in part to layoffs that were part of the restructuring that began when Elliott drove out founder Jonathan Bush and hired former General Electric CEO Jeff Immelt as chairman last spring. …Expectations of the sale have raised concerns among customers, who worry that the company will lose the human element of its service, one of its main attractions, Morning eHealth’s Mohana Ravindranath reports. … Athenahealth sells its software mostly to small, independent practices. Some elements of those systems are automated, but athenahealth employees remotely manage key operations. The service business has always been athenahealth’s selling point – “letting doctors be doctors,” notes Todd Rothenhaus, the company’s former chief medical officer. Longtime customers tell POLITICO that while the technology isn’t perfect, it’s the responsiveness of the staff – and the willingness of executives to talk to them personally – that keeps them using athenahealth.NURX WURX, APPARENTLY: Providing easy access to birth control and AIDS prevention drugs has proven to be smart business for startup Nurx (it recently obtained $36 million in funding) – and has attracted some politically connected Democrats. The startup offers an app that patients use to connect with doctors via telemedicine and texts to obtain birth control and HIV-prevention drugs. In an interview with Darius Tahir, CEO Hans Gangeskar announced that former Surgeon General Regina Benjamin is joining the company’s board of directors, which also includes Chelsea Clinton. “We wanted someone with a history in public health who is passionate about expanding access … someone who can help us figure out how to reach all these people who we, from the outset, wanted to reach: people in rural areas who often been going through abstinence-only sex education, and are struggling to navigate this space,” Gangeskar said. The complete interview for Pros here. Tweet of the Day: Dan Lyons @realdanlyons Nobody in SV can solve homelessness or figure out how to hire with diversity. But 11 electric scooter companies have raised VC funding. Oh, and a company that uses robots to make pizza. You wonder why there’s a tech backlash?Welcome to Monday morning eHealth, where we’re wishing we had extra ears and hands to cover everything that’s happening this week, particularly Wednesday. I’ll be in Boston covering three events, and my colleagues will remain in D.C. performing superhuman feats of news detection. Tips on that really important thing we’re missing to aallen@politico.com, or sock it to us at @ravindranize, @arthurallen202, @dariustahir, @POLITICOPro, @Morning_eHealth.Join POLITICO on Nov. 14 for special editorial conversations at “The Salute to Military Spouses,” a half-day summit to raise awareness of the challenges and contributions of these unsung heroes. Journalists from POLITICO, the exclusive media partner of the summit, will provide firsthand insight and intelligence on timely political and policy issues facing the military and military spouses. Topics include “improving the financial stability of military families” and “using tech to tackle the high unemployment rate of military spouses.” RSVP here.** A message from the American Clinical Laboratory Association: Millions of seniors depend on lab tests to manage medical conditions and stay healthy. Deep cuts to Medicare lab services made in 2018, and growing in 2019, further jeopardize seniors’ access to the care they need. Congress must act now to protect America’s seniors. Learn More. **‘VA CRISIS IS OVER’: VA Secretary Robert Wilkie made that assessment in a National Press Club speech Friday to mark Veterans Day. Wilkie praised the work of Pentagon and VA officials collaborating on the Cerner EHR implementation, among other projects, saying veterans’ satisfaction was on the rise. “We are on the cusp of the VA’s greatest transformation since Omar Bradly sat in the chair I occupy,” he said. Bradley had to handle the demobilization of 11 million Americans \"with carbon paper and a telephone,\" Wilkie said. \"… No problem is insurmountable today.”The election results mean he “expects to answer more questions” from House Democrats, but he feels confident about the spirit of bipartisanship in the congressional VA committees, he said.GOOGLE BUILDING HEALTH TEAM: The company has named Linus Upson, an engineering leader at life sciences subsidiary Verily, to be the interim head of its health team until Geisinger CEO David Feinberg takes over next year, CNBC reported Friday. At Verily, Upson is responsible for \"Debug,\" the company's project to curb the spread of mosquitoes that carry disease, along with a variety of other initiatives. More details here.PREAUTHS, PDMPs CAN CAUSE HARM, SAYS AMA CHIEF: At the organization’s interim meeting over the weekend, president Barbara McAneny described the near disaster that befell a metastatic prostate cancer patient when she tried to increase his time-release morphine dose from two to three per day. The pharmacist in Gallup, N.M., where McAneny practices, called for the prior authorization but was denied by the health plan. Then he checked the PDMP and learned that her patient had multiple prescriptions written by McAneny and her partners. Suspecting the patient was a drug seeker, he did not notify her the prescription was denied. “My patient, a very proud man, felt shamed and didn’t know what to do. So, he went home to be as tough as he felt he could be. That worked for about three days … and then he tried to kill himself.” He ended up in the ER, though he survived. \"My patient nearly died of an under-dose,” she said, describing the case as symptomatic of “our current dysfunctional health care system.” AN EHR FOR PLUMBERS: Plumbers Local 130 in Chicago recently decided to implement a Cerner EHR at a health center it’s setting up for members and their families next year. “Local 130 is dedicated to building and maintaining a healthy and happy workforce, and Cerner looks forward to joining them in this important effort,” said Mike Heckman, Cerner's VP for population health services. Cerner will also manage the health center’s operations, an unusual arrangement. More here. Forbes: Davidy Shaywitz on the disconnect between what AI shows and what doctors wantCBS 60 Minutes: How Europe's privacy law could change things hereBMJ blogs: Are medical errors a growing problem--or a cottage industry for consultants?PewTrusts: Brief on innovative approaches to opioid addiction** A message from the American Clinical Laboratory Association: America's seniors depend on reliable access to clinical laboratories to ensure effective monitoring, diagnosis and management of their medical conditions. Last year, CMS made deep cuts to Medicare lab services putting this access at risk. Unfortunately in 2019 seniors will face another round of drastic cuts to lab tests including tests for some of the most commonly diagnosed conditions like diabetes, heart disease and cancer. Recently CMS has made some changes, but those changes do not stop the next two years of double-digit cuts. Millions of beneficiaries are counting on action from Congress to ensure they have access to the lab tests they need. It’s time to make sure the Protecting Access to Medicare Act (PAMA) is implemented in the right way. Learn More. **\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}