{"id": "\n\n\n\nPOLITICO\n\nPOLITICO Playbook PM: The latest from our Pence interviewFollow us on TwitterSubscribe to the POLITICO Playbook family", "paragraph": "\n                                                            PoliticoPOLITICO's must-read briefing on what's driving the afternoon in Washington  Get Playbook PMBy signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.By  ANNA PALMER,  JAKE SHERMAN,  DANIEL LIPPMAN,  ELI OKUN and  GARRETT ROSS 10/30/2018 01:14 PM EDTPresented by\n                            Vice President Mike Pence speaks at a POLITICO Playbook Interview on Tuesday. | Rodney Lamkey Jr. for POLITICOBREAKING … WHITEY BULGER, the Boston mobster, was killed in prison in West Virginia, per several news outlets. The Boston Globe storyA FEW NUGGETS FROM OUR INTERVIEW WITH V.P. MIKE PENCE … -- ON TRYING TO END BIRTHRIGHT CITIZENSHIP … PENCE said, “We all cherish the language of the 14th Amendment, but the Supreme Court of the United States has never ruled on whether or not the language in the 14th Amendment, ‘subject to the jurisdiction thereof,’ applies specifically to people who are in the country illegally.”-- QUICK FACT-CHECK from CAITLIN OPRYSKO and TED HESSON: “The issue of whether birthright citizenship could be applied to children born to non-U.S. citizens was the focus of an 1898 Supreme Court ruling. In U.S. v. Wong Kim Ark, the court held that a man born to Chinese-national parents in the U.S. was in fact a U.S. citizen.” POLITICO-- THE VP did not endorse Kevin McCarthy to be the next top House Republican. “I support having a Republican speaker of the House.” But he said McCarthy has done a “tremendous job” as House majority leader, while noting that others “have expressed interest.”-- WE ASKED HIM how he squared his historic support for the press with PRESIDENT DONALD TRUMP calling reporters the enemy of the people. Pence said he and Trump believe that “the only check on government power in real time is a free and independent press.” But he slammed media coverage that connected Trump’s rhetoric to last week’s mail bombs or right-wing extremism. “That to me was an example of the media going too far … instead of just reporting the straight facts.”-- HE REJECTED THAT HEATED RHETORIC had anything to do with the shooting in Pittsburgh. “It’s important that we don’t connect those acts to the public debate,” including the pipe bombs sent to prominent Democratic figures last week. “We will not let violence or anti-Semitism take hold in the United States of America. We will condemn it wherever it rears its ugly head, and the president and I have done that forcefully.”-- WE ASKED if Pence would be on Trump’s 2020 ticket. He said: it “would be the greatest honor of my life to serve a second term with this president. … The last two years have just been an incredible experience.” Video of the entire eventTHE LATEST FROM PITTSBURGH … “Trump to console Pittsburgh alone as local, congressional leaders skip visit,” by Jesus Rodriguez: “A spokesman for Mayor Bill Peduto’s office confirmed that the mayor will be attending funerals as Trump arrives in town. Peduto, a Democrat, previously urged Trump to consider ‘the will of the families’ and to avoid a visit ‘while we are burying the dead.’ …“The four top congressional leaders in both parties — Senate Majority Leader Mitch McConnell (R-Ky.) and Minority Leader Chuck Schumer (D-N.Y.), as well as Speaker Paul Ryan (R-Wis.) and House Minority Leader Nancy Pelosi (D-Calif.) — were invited to join Trump in Pittsburgh but declined, according to a source familiar with the matter. But that move isn't necessarily a sign of eagerness to avoid Trump by the GOP leaders — both McConnell and Ryan had previous commitments with the midterms just one week away.” POLITICO MICHAEL CALDERONE (@mlcalderone): “NY Times evacuated its London office today because of suspicious package -- police issued all-clear and staff returned. This follows suspicious envelope -- later deemed harmless -- yesterday at the NYC newsroom.”Good Tuesday afternoon. FROM CALIFORNIA PLAYBOOK -- SPLIT-UP OF POWERHOUSE FIRM ... “After 25 years of crafting political campaigns with one of the most successful teams in state politics. the ‘N’ of the powerhouse SF-based campaign consulting firm, SCN Strategies -- Dan Newman -- has decided to split from the firm he co-founded at the end of this year, POLITICO has learned. ...“A seasoned operative with a reputation for no-holds-barred politics, Newman told POLITICO that he’s ‘looking forward to a new chapter’ -- and emphasized the amicable nature of his decision, saying ‘the folks at SCN are the smartest and most successful in the business, and they'll continue to win at every level, doing ever bigger and better things.’ One of those things, political observers suggest, is likely to be SCN’s involvement with a 2020 presidential campaign by [Sen. Kamala] Harris, who has been visiting Iowa and South Carolina, and is widely viewed as a prospective candidate.”Sign up for our must-read newsletter on what's driving the afternoon in Washington.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.WHAT’S ON THE PRESIDENT’S MIND -- @realDonaldTrump at 8:33 a.m.: “The Stock Market is up massively since the Election, but is now taking a little pause -- people want to see what happens with the Midterms. If you want your Stocks to go down, I strongly suggest voting Democrat. They like the Venezuela financial model, High Taxes & Open Borders!”… at 11:10 a.m.: “Just out: Consumer Confidence hits highest level since 2000.”A message from Delta Air Lines:Connecting armed service members with their loved ones while they undergo treatment and recovery is a small way to say thank you to the men and women who bravely serve us. Learn more on how Delta is committed to supporting veterans, active service members and their families nationwide at DeltaTakingAction.com.2018 WATCH … ONE WEEK OUT -- “Female Candidates Break Barriers, Except When It Comes to Money,” by NYT’s Kate Zernike: “[W]omen who run for office are still struggling to raise as much as men, particularly if they are Republican, or challenging incumbents, or running in places where the opposing party has a big advantage — as is the case with many Democratic women this year. Men are still making the large majority of political contributions, and male candidates are still raising more money.“Female candidates have relied on different or new ways to raise money, getting more in small donations, from individual donors and from women. Still, even in a year when fervor for a ‘blue wave’ has allowed many competitive female candidates to raise staggering amounts of money, it has taken them longer to raise it.” NYT -- JAMES ARKIN and ALEX THOMPSON with a Kansas City, Mo., dateline: “Will Democrats blow it with black voters again?”: “Can the party energize and turn out black voters in 2018 in ways they so spectacularly failed to do in 2016? National black political activists said the Democratic Party’s failure to prepare for President Barack Obama's departure from the White House — and the drop-off in minority voting that was likely to follow — goes back years. … “In Missouri, conversations with nearly a dozen elected officials, activists and voters reveal a mixture of cautious optimism and concern about whether McCaskill has done enough to secure high turnout here in Kansas City and in St. Louis … African-American progressive activists across the country say that the national party appears to be taking their concerns more seriously this year than in recent election cycles.” POLITICO-- WSJ’S DANTE CHINNI and AARON ZITNER in Harrisburg, Pa.: “GOP Works to Rally the Trump Skeptics Within Party”: “In most years, the congressional district here wouldn’t be in play. The GOP holds a six-point advantage in party registration, and the region has a tradition of voting Republican. But the GOP majority here rests in part on a certain kind of voter: relatively affluent suburbanites who are skeptical of President Trump’s leadership or oppose him altogether.“They represent the pre-Trump Republican Party, and GOP leaders worry they may sit out the midterms, an option the party can ill-afford in hard-fought House races. … As is the case in Pennsylvania, many party Republicans are clustered around state capitals … That means the party has to work to motivate this type of Republican in Pennsylvania’s 10th District and others with a large number of college-educated, suburban residents earning higher incomes.” WSJ -- VOX’S ELLA NILSEN: “Exclusive: Republicans are outspending Democrats 5 to 1 in key statehouse races”-- WSJ’S REID EPSTEIN in Roswell, Ga.: “Georgia House Race Shows Educated Women Are Midterm Prize”: “GOP Rep. Karen Handel is vying to retain the House seat she won in a special election last year, which, at $60 million, was the most expensive House race ever. Both her campaign and that of Democratic challenger Lucy McBath—along with scores across the country—are drawing from the experience of that June 2017 election … “[A]fter campaigning in the special election with President Trump with funding from House Speaker Paul Ryan’s super PAC, Ms. Handel is now pitching herself as an independent voice focused on local issues, a shift that has accompanied falling approval ratings for Mr. Trump in the district.” WSJ AD WARS -- NBC’S SUZANNE GAMBOA in Austin, Texas: “Democrats launch first multi-state Spanish language TV ad to turn out Latino vote”: “The Democratic Congressional Campaign Committee spent more than a half million dollars to run the ad on Univision, Telemundo and other stations in eight large media markets.” NBC … The adFIGHTING PHARMA -- “Pharma’s ‘come-to-Jesus moment’: The industry braces for a Pelosi speakership and Democrats’ drug pricing agenda,” by Stat’s Lev Facher: “Nancy Pelosi marched into PhRMA’s offices this July with the law on her side. Never mind that the law in question has never been put to use: Pelosi spoke in detailed terms of a federal statute that allows the U.S. government to effectively strip drug companies of exclusive licenses to some blockbuster medicines. ... “The boardroom ambush from Washington’s most powerful Democrat could prove the first of many such moments for drug manufacturers, which have come under fire from the White House and lawmakers from both parties in the past two years. Interviews with drug industry lobbyists and Democratic aides across the Capitol suggest the same: that the wing of Pelosi’s party outlining an ambitious agenda to combat high drug costs could turn 2019 into PhRMA’s doomsday scenario.” Stat THE INVESTIGATIONS … WSJ’S DREW FITZGERALD and SHELBY HOLLIDAY: “Mueller Investigators Probe Roger Stone Conference Calls”: “In at least two August [2016] conference calls advertised online to the public and promoting himself as “the ultimate political insider,” Mr. Stone told callers about WikiLeaks’ plans to release information that he said would affect the 2016 presidential campaign before the election.” WSJSPOTTED: Newt and Callista Gingrich yesterday at the Delta Sky Club in the Minneapolis airport, heading to DCA in first class on Delta 1689.SPOTTED at the Thurgood Marshall College Fund awards gala Monday night at the Washington Marriott Wardman Park Hotel: Rep. Mark Walker (R-N.C.), Virginia Lt. Gov. Justin Fairfax, Jim Clifton, Katrina Pierson, Leah Le’Vell, Paris Dennard, Kára McCullough, Jennifer Decasper, Dwayne Carson, Rhonda Foxx, Leonard Haynes, Gabby Cuccia, Yebbie Watkins, Roland Martin, Johnny Taylor, Lauren Victoria Burke, Veronique Pluviose-Fenton, Ben Chavis and Raven Reed.TRANSITION -- Rebecca Zimmerman will be on the board of directors at Impl. Project. She is also a Truman Project national security fellow.WEEKEND WEDDING -- Kristin Matzen, director of communications for Time, married Christopher Grosse, VP of investment banking at Bank of America Merrill Lynch, on Saturday at the Ryland Inn in New Jersey. The couple met three and a half years ago through friends during a summer in Montauk. Pic\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}