{"id": "\n\n\n\nPOLITICO\n\n\n\nNew Jersey\n\nNew Jersey GOP congressional candidate receives letter threatening his family \n", "paragraph": "\n                 “Criticizing a candidate on the issues is part of politics. Threatening my children is not,” Republican congressional candidate Jay Webber tweeted on Wednesday.  | Seth Wenig/ AP Photo\n                    By RYAN HUTCHINS10/24/2018 03:17 PM EDTNew Jersey Republican congressional candidate Jay Webber received a threatening letter that mentioned his children and urged him to drop out of the race, his campaign said Wednesday.“What the f--- is wrong with you … scumbag?” the typed letter, addressed to “Jay,” states. “You BETTER hope that you don’t win! Or else. How many kids do you have… 7? Unlucky 7. What is what we think of you. Time to get out of politics.”Story Continued BelowThe letter and a ripped up “Webber for Congress” campaign sign were sent to the candidate’s place of business, his campaign said. Law enforcement officials are investigating.“Criticizing a candidate on the issues is part of politics. Threatening my children is not,” Webber tweeted on Wednesday. “We are thankful for the support of law enforcement as we work to find whoever is behind this gutless act. We will not be intimidated as we work to make #NJ11 better for everyone.”News of the threat comes as authorities are investigating potential explosives sent to CNN and Democratic figures including former President Barack Obama, former Secretary of State Hillary Clinton and billionaire donor George Soros.Webber, a five-term state assemblyman from North Jersey, is running in the state’s 11th District in what has become one of the most competitive races in the country. The voting demographics in the district have shifted so much that longtime Rep. Rodney Frelinghuysen, a Republican who has represented the district for nearly a quarter-century, chose to retire rather than face his first competitive general election.Webber is running against Democrat Mikie Sherrill, a former Navy helicopter pilot and former federal prosecutor. Sherrill condemned the threats against Webber.“This is absolutely appalling,” she said in a statement. “No one who decides to run for public office should feel that, by doing so, they are putting their family in danger. I condemn this in the strongest terms and hope law enforcement determines who was behind this and holds them accountable.”Matt Friedman's must-read briefing on the Garden State's important news of the dayOur morning email about New Jersey health care policy and politicsA morning email with must-read analysis and breaking news on New Jersey politics and policy.POLITICO New Jersey Pro's high-level outlook on the policy issues driving the month in New Jersey.Matt Friedman's must-read briefing on the Garden State's important news of the day\n                        POLITICO ProA morning email with must-read analysis and breaking news on New Jersey politics and policy.\n                        POLITICO ProOur morning email about New Jersey health care policy and politics\n                        POLITICO PROPOLITICO New Jersey Pro’s high-level outlook on the policy issues driving the month in New Jersey.\n                        POLITICO ProOriginal federal and state policy documents © 2018 POLITICO LLC"}