{"id": "\n\n\n\nPOLITICO\n\n\nTrump riles up Florida voters for Scott, DeSantis\n", "paragraph": "\n                President Donald Trump drummed up support for former Rep. Ron DeSantis' gubernatorial campaign and Gov. Rick Scott's Senate bid. | Evan Vucci/AP Photo\nElections\n                    By AUBREE ELIZA WEAVER11/03/2018 08:46 PM EDTPresident Donald Trump is holding onto hope that his pre-midterm rally sprint will ensure the “blue wave” hits a “red wall” during Tuesday’s elections — and he didn’t pass up an opportunity to talk up his own 2020 reelection push, either.After a brief introduction by Vice President Mike Pence during Saturday evening’s rally in Pensacola, Fla., Trump launched right into his endorsement of two Republicans in hotly-contested races in Florida — former Republican Rep. Ron DeSantis in his gubernatorial run against Democrat Andrew Gillum, who currently serves as mayor of Tallahassee, and Republican Gov. Rick Scott in the tight Senate race against incumbent Democratic Sen. Bill Nelson.Story Continued Below“In Rick’s case, he’s going against somebody that’s falling asleep,” Trump said. “And in Ron’s case, he’s going against somebody who’s got a lot of energy, but he runs one of the worst — one of the biggest problem cities anywhere in the country. He’s not doing his job. You don’t want to have him running Florida, that I can tell you.”From there, Trump talked about how Democrats across the country should expect a tough fight, because of the recent success of Republicans, including himself.“In the history of our country, today, more Americans are working than ever before in the history of our country. That’s a good sound bite,” he said. “I was just saying, that’s awfully tough to beat somebody when I’m debating one of the far-left candidates that the Democrats will produce — when you have two of them running against our two friends,” he added. “But can you imagine in the debate? We have the most successful economy ever. What are they going to say? We have the best job numbers ever. What are they going to say? It’s going to be hopefully very easy debates.”Your guide to the permanent campaign — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.However, Trump also mentioned that even with those numbers, one of the hardest parts of any election is dealing with the media, especially during debates.“But we always debate three people. It won’t be one. It’ll be three,” he said. “It’s the person plus the media, against me. So that makes it a little tougher. That makes it a little bit tougher.” “Remember the way they treated Hillary [Clinton],” he posited, referencing the 2016 presidential debates. “‘Oh Madame Secretary. Oh, what did you have for breakfast, Madame Secretary? Did you enjoy it? And as far as you, Mr. Trump, bah bah bah.’ No, we have three people on that stage.”He also hit at the media — a common theme of his rally run, so far.“Could the cameras please pan out and show this crowd? It would be really nice,” Trump said. “Would you do that? You know, they never like to do that, folks. They never like to do that. Could you pan out? See, they won’t turn that camera. They don’t want to turn the camera. They never do, unless there’s a little problem — in which case that camera bends in 15 different directions, right? That camera can bend and turn. They never show the crowd, but people hear the crowd.”And returning to the original reason behind the eight-state, 11-rally effort, Trump called out several Democrats currently in office.“But if Cryin’ Chuck Schumer — you know Cryin’ Chuck — Nancy Pelosi or the legendary genius Maxine Waters,” he said. “If they take power, then they will try to wipe away all that we’ve done and at the same time double and triple and quadruple your taxes. And we’re not going to let it happen.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}