{"id": "\n\n\n\nPOLITICO\n\n\nStivers ‘could not stay silent’ on Steve King\n", "paragraph": "\n                Rep. Steve Stivers' (R-Ohio), head of House Republicans' campaign arm, comment shook party leaders in the final stretch of the campaign. | Andrew Harnik/AP Photo\nCongress\n                    By RACHAEL BADE and JOHN BRESNAHAN10/30/2018 05:05 PM EDTSteve Stivers had had enough.In an extraordinary moment just a week before the critical midterm elections, the chairman of the House Republican campaign arm called out a sitting colleague, accusing him of being racist.Story Continued BelowStivers, who leads the National Republican Congressional Committee, had been briefed on racially charged comments made recently by Iowa Republican Steve King, an immigration hard-liner with a history of controversial and insensitive remarks. And so with not even a heads-up to GOP leaders, Stivers went on Twitter and blasted his colleague.He “could not stay silent,” said one source familiar with his thinking.“Congressman Steve King’s recent comments, actions, and retweets are completely inappropriate,” Stivers wrote on Tuesday afternoon. “We must stand up against white supremacy and hate in all forms, and I strongly condemn this behavior.”King has a history of racially insensitive comments, but he’s recently sparked even more of a backlash over his decision to endorse Faith Goldy — a white nationalist running for mayor of Toronto — and his latest criticism of liberal donor George Soros. In an interview with members of a far-right Austrian political party with historical Nazi ties, he tied Soros to the “Great Replacement” — a far-right conspiracy theory describing a push to replace white Europeans with minorities.A daily play-by-play of congressional news in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.King quickly pushed back on Stivers’ remarks, suggesting he was part of the “establishment” wing of the GOP that had it out for President Donald Trump.“Americans, all created equal by God, with all our races, ethnicities, and national origins-legal immigrants & natural born citizens, together make up the Shining City on the Hill,” King wrote on Twitter on Tuesday afternoon. “These attacks are orchestrated by nasty, desperate, and dishonest fake media. Their ultimate goal is to flip the House and impeach Donald Trump. Establishment Never Trumpers are complicit.”Stivers’ comment shook party leaders in the final stretch of the campaign. Voters head to the polls on Tuesday, and House Republicans are likely to lose their majority. They need every seat they can get. But the NRCC won’t support King’s candidacy, according to Matt Gorman, the group’s communications director.\"The NRCC and Congressman Stivers haven't been afraid to show moral leadership when the time calls for it,” he said in an interview on Fox News on Tuesday. “We believe Congressman King's words and actions are completely inappropriate and we strongly condemn them. We will not play in his race.”King was projected to win his race, but his Democratic opponent, J.D. Scholten, has seen a surge of fundraising. The Cook Political Report currently rates the seat “lean Republican.\"\nWhite House\n                    By JESUS RODRIGUEZ and ANDREW RESTUCCIAMultiple GOP sources told POLITICO they had not known of Stivers’ intentions. Some were privately not happy about it. Others, however, praised Stivers on Twitter.GOP leaders, including Speaker Paul Ryan and House Majority Leader Kevin McCarthy, did not respond about whether they agree with Stivers. But they will be pressured to weigh in and side with a controversial colleague or their own NRCC chairman.Either way, Stivers’ tweet forces the party to confront sensitive matters of race at a politically precarious time, as Trump ramps up his attacks on undocumented immigrants and the country grapples with the worst anti-Semitic attack in American history and a pipe bomb suspect targeting Soros and top Democratic leaders.On the campaign trail, race has come to the fore in places like Florida, where fringe Republican groups have run ads using the “N” word against Democrat Andrew Gillum, a black mayor running for governor. Trump on Tuesday called Gillum a “thief” without any evidence or explanation as to why. The controversy has spilled into House campaigns as well this cycle.\nReligious leaders, Democrats and even a few Republicans have criticized the NRCC and Ryan’s super PAC, Congressional Leadership Fund, for attacking a black candidate in New York as “not like us.” Both have run ads highlighting Antonio Delgado’s previous work as a rapper. And TV ads have played his old music and shown images of him leering into the camera wearing a dark hoodie.Delgado, who is running against Rep. John Faso, is now a prominent lawyer, graduate of Harvard Law School and Rhodes scholar.King has long courted controversy. Last December, he tweeted that \"Diversity is not our strength,\" adding: \"Hungarian Prime Minister Victor [sic] Orban, 'Mixing cultures will not lead to a higher quality of life but a lower one.'\"King once called former President Barack Obama \"very, very urban,\" and in 2016, he said: \"Where did any other subgroup of people contribute more to civilization” than white people? In 2013, King infamously stated that some undocumented immigrants have \"calves the size of cantaloupes because they’re hauling 75 pounds of marijuana across the desert.”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}