{"id": "\n\n\n\nPOLITICO\n\nBattle over the border wall", "paragraph": "\n                                                            PoliticoYour daily speed read on employment and immigration policy Get the Morning Shift NewsletterBy signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.11/12/2018 10:00 AM EST\n                    Updated 11/12/2018 05:31 PM ESTWith help from Rebecca Rainey and Daniel LippmanEditor's Note: This edition of Free Morning Shift is published weekdays at 10 a.m. POLITICO Pro Employment & Immigration subscribers hold exclusive early access to the newsletter each morning at 6 a.m. To learn more about POLITICO Pro's comprehensive policy intelligence coverage, policy tools and services, click here. Story Continued BelowBATTLE OVER THE BORDER WALL: President Donald Trump still wants funding for that border wall — and the lame duck session that begins Tuesday might his best shot at it for the next two years. House Republicans plan to push a bill from Majority Leader Kevin McCarthy, H.R. 7059 (115), that would devote $25 billion to border barriers and technology. On the Senate side, Majority Leader Mitch McConnell sees $5 billion as a more realistic sum. But without concessions, Democrats are unlikely to agree to either amount.Rep. Tom Cole (R-Okla.) said recently that lawmakers could pair wall funding with a fix for “Dreamers” covered by the DACA program. But bipartisan negotiations along those lines floundered in the Senate back in February, and there’s no reason to believe it would fly this time around. In February, the White House repeatedly torpedoed the bills with the most bipartisan support — and it’s hard to imagine that dynamic changing now.The border wall was Trump’s signature promise during the 2016 campaign, but he hasn’t gotten much funding yet. Congress devoted $1.7 billion to new and replacement barriers in fiscal year 2017 and 2018, according to an analysis by the non-partisan Migration Policy Institute. That’s a fraction of the $18 billion the administration requested in February for a two-year period. Related read: “White House to press tough immigration laws, border wall in Congress’s lame duck session,” from McClatchy’s Franco Ordoñez and Andrea Drusch. Find it here.GOOD MORNING! It’s Nov. 12, and this is Morning Shift, POLITICO's daily tipsheet on employment and immigration policy. Send tips, exclusives, and suggestions to rrainey@politico.com, thesson@politico.com, ikullgren@politico.com and tnoah@politico.com. Follow us on Twitter at @RebeccaARainey, @tedhesson, @IanKullgren and @TimothyNoah1. Join POLITICO on Nov. 14 for special editorial conversations at “The Salute to Military Spouses,” a half-day summit to raise awareness of the challenges and contributions of these unsung heroes. Journalists from POLITICO, the exclusive media partner of the summit, will provide firsthand insight and intelligence on timely political and policy issues facing the military and military spouses. Topics include “improving the financial stability of military families” and “using tech to tackle the high unemployment rate of military spouses.” RSVP here.Join Nelson Mullins and POLITICO for a breakfast briefing on the implications of the midterm elections for U.S.-Canada relations. Introductory remarks by Nelson Mullins partner David Wilkins, a former U.S. ambassador to Canada, will be followed by a POLITICO reporter briefing. RSVP here.ACLU PUSHES TO HALT ASYLUM CHANGES: A federal judge could rule this week over a request by the American Civil Liberties Union to immediately halt Trump administration actions to block asylum seekers at the U.S.-Mexico border. The ACLU filed a complaint Friday over the fast-track regulation and presidential proclamation, and later pressed the court to issue a temporary restraining order. The regulation and proclamation cut off asylum for migrants who enter the U.S. between ports of entry. Under federal immigration law, migrants physically present in the U.S. may seek asylum whether or not they arrived at a port of entry. But the Trump administration argues that it has the authority to impose barriers to asylum — a theory that will be tested in court.The asylum bar extends to unaccompanied minors who arrive at the border. U.S. Citizenship and Immigration Services guidance posted online late Friday stated that unaccompanied kids who cross the border between ports of entry will be barred from seeking asylum. A Justice Department official said precisely the opposite on a call with reporters Friday morning — that unaccompanied minors would not be subject to the ban — but a DOJ spokesman confirmed that the USCIS guidance describes the true policy.SCOTUS COULD HEAR SEX DISCRIMINATION CASES: “The U.S. Supreme Court will decide as soon as Nov. 30 whether to hear a trio of closely watched discrimination cases that ask the justices to decide whether Title VII’s ban on sex discrimination protects gay and transgender employees,” Vin Gurrieri writes in Law360. “The dockets for the three Supreme Court cases — Altitude Express v. Zarda, Bostock v. Clayton County, Georgia, and R.G. & G.R. Harris Funeral Homes Inc. v. EEOC — were each updated on Nov. 7 with an entry stating that the justices will consider cert petitions in all three matters during its Nov. 30 conference,” Gurrieri writes. SCOTUS could decide whether to take up the cases at any time after that date. “All three cases have been closely monitored throughout the employment community as speculation has run rampant in recent years that the high court would take a case that clarifies at least the sexual orientation question, which for now is the subject of a deeper circuit split than is the gender identity question,” Gurrieri writes. More here.UPS WORKERS RATIFY CONTRACT: UPS Freight workers represented by the Teamsters ratified a new five-year contract, which will avoid the prospect of a strike during the busy holiday season. The agreement, which covers roughly 11,600 workers, was approved with 77 percent in support, according to a spokeswoman for the union. UPS said the contract “rewards our employees for their contributions to the success of the company, while enabling UPS to remain competitive.” Read more from the Atlanta Journal Constitution here.PAYOUT AFTER FIRING PRO-UNION WORKERS: “A California cloud-software startup has agreed to pay 15 former employees $775,000 to resolve a dispute over the elimination of its entire non-managerial programming workforce in the U.S.,” Bloomberg’s Josh Eidelson and Hassan Kanu report. “National Labor Relations Board prosecutors in August issued a complaint accusing the company, privately held Lanetix Inc., of violating federal labor law by terminating its coders because a majority of them had petitioned to unionize.” More here.MARRIOTT WORKERS END STRIKE: Hotel workers represented by Unite Here Local 19 in San Jose, Calif., approved a labor agreement that will end a 37-day strike, Martha Ross reports for the Mercury News. “Workers at the Bay Area hotels went on strike Oct. 4 to demand higher pay, more job security and smaller workloads,” Ross writes. “In the Bay Area, about 12,000 Unite Here members work as housekeepers, dishwashers, servers and bartenders, cooks and bellmen at various hotels, including Marriott.” More here.** A message from the Society for Human Resource Management: As the voice of all things work, SHRM members are in Washington this week advocating for smart workforce policies, including tax-protected tuition assistance and Workflex options for all employees. Working with Congress, we can build a better workplace. Learn more. **NLRB TO TWEAK UNION ELECTION RULES: “A [NLRB] plan to change elements of its union election rules won’t feature a broad reconsideration of a contentious Obama-era regulation that streamlined voting procedures,” Bloomberg Law’s Robert Iafolla reports. The board will issue a proposed rule sometime this winter that will address the NLRB’s ‘blocking charge’ policy to pause elections if workers or unions file complaints alleging employers interfered with the elections, Bloomberg reports, citing comments by NLRB Chairman John Ring at a Nov. 8 event. More here.BUSY WEEK FOR HSGAC: The Senate Homeland Security and Governmental Affairs Committee gets back to work this week. Here’s what to expect:Vote on Census nomination: The committee will vote Tuesday on the nomination of Steven Dillingham to become director of the U.S. Census. The Trump administration’s decision to include a citizenship question on the 2020 Census has sparked several lawsuits amid accusations that it will depress the count in immigrant communities. The vote will take place at 5:30 p.m. in S-216. Find more info here.ICE director confirmation hearing: The committee will hold a hearing Thursday over the nomination of Ronald Vitiello to become director of U.S. Immigration and Customs Enforcement. Vitiello, a long-time Border Patrol official, was named acting ICE director in late June following the retirement of Thomas Homan. The hearing takes place at 10 a.m. in Dirksen 342. Find more info here.Hearing on Alabama manufacturing: The committee will hold a field hearing that looks at the effects of tariff and trade policy on Alabama manufacturing and agriculture. The hearing takes place Nov. 19 at the University of South Alabama. Find more info here.CUTRONA OUT AT DOJ: Danielle Cutrona, a senior counsel to former Attorney General Jeff Sessions, has left the Justice Department, POLITICO’s Daniel Lippman reports. A DOJ spokesperson confirmed that her last day was Friday and that she accepted a new job \"a while back\" but didn't reveal details about the new role. Cutrona, who previously served as chief counsel to then-Senator Sessions on the Judiciary Committee, handled immigration issues on Trump’s transition team.TRIBUNE PLANS LAYOFFS AFTER MASS SHOOTING: Tribune Publishing (the company formerly known as Tronc), told staffers last week that it will offer buyouts to employees — and partly pinned the job cuts on costs related to a June shooting at the Annapolis-based Capital Gazette, Kimberly Pierceall reports in the Virginian-Pilot. Predictably, journalists both inside and outside the company blasted the decision to link job cuts to the tragic shooting, which took the lives of five employees. “The company provided grief counseling and quickly relocated the Capital-Gazette offices, while finding and preparing a new permanent home. But to mention the costs -- and not the lives -- even just to investors -- is disgusting,” tweeted Scott Dance, a reporter at the Baltimore Sun (another Tribune property). Read more from the Virginian-Pilot here and HuffPost here.No events today. Take a moment to gear up for the lame duck. COFFEE BREAK:—“Deployed Inside the United States: The Military Waits for the Migrant Caravan,” from the New York Times—“It ended in 1767, yet this experiment is still linked to higher incomes and education levels today,” from the Washington Post—“Lawsuit targets Greyhound over warrantless stopping of buses by border agents,” from the Washington Post—Op-ed: “Lawsuit Charges USCIS Move Against Foreign Students Is Illegal,” from ForbesTHAT’S ALL FOR MORNING SHIFT. ** A message from the Society for Human Resource Management – SHRM, the voice of all things work: The world of work is rapidly changing – and America is counting on Congress to back policies that deliver for employees, employers and the entire economy.“Work” is more flexible than ever, so workplace rules need to be too. The Workflex in the 21st Century Act would provide paid leave and Workflex opportunities to all employees to help meet their work-life needs.Congress can ensure more people are equipped to thrive in the jobs driving the modern economy and give America’s workforce a leg up by supporting tax-protected tuition assistance for people learning new skills. SHRM Members and Congress – Together, We Can Build a Better Workplace. Learn more. **CORRECTION:  Due to a miscalculation by the Migration Policy Institute, an earlier version of Morning Shift misstated how much funding Congress devoted to new and replacement barriers in fiscal 2017 and 2018. It was $1.7 billion.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}