{"id": "\n\n\n\nPOLITICO\n\n\n'A sword hanging over our heads': Trump discovers new weapon against media \n", "paragraph": "\n                To reporters, the threatened new rules represent another obstacle to covering President Donald Trump, who views his battle with the media as an unambiguous positive. | Andrew Harnik/AP Photo \nMedia \n                        The administration is drawing up rules for White House reporters' behavior, and the president said if journalists don't follow them, 'we'll end up back in court, and we'll win.'\n                    By JASON SCHWARTZ11/16/2018 06:13 PM ESTCNN and Jim Acosta may have won their battle with the White House in court on Friday, but President Donald Trump has found a new weapon in his long war against the media.After a judge ruled that the White House violated the CNN correspondent’s right to due process by stripping him of his press badge, press secretary Sarah Huckabee Sanders declared that the administration was drawing up new rules to govern reporters’ behavior — and a process for booting them if those rules are broken.Story Continued Below“We have to create rules and regulations for conduct,” Trump told Chris Wallace in a Fox News Sunday interview, echoing Sanders’ announcement. “It's not a big deal. If he misbehaves, we'll throw him out or we’ll stop the news conference.”\"If they don't listen to the rules and regulations,\" he told reporters at a separate event at the White House, \"we'll end up back in court, and we'll win.\"The race for 2020 starts now. Stay in the know. Follow our presidential election coverage.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.To reporters, the threatened new rules — which one person close to the White House said were in the works before the court ruling Friday — represent another obstacle to covering Trump, who views his battle with the media as an unambiguous positive with his conservative base. It was Trump and Sanders, after all, who escalated the Acosta situation after a dispute at a news conference by yanking his press pass and, to justify it, pointing to an apparently altered video of his interaction with a White House aide. Now, future legal encounters appear certain, as journalists deemed to have broken the rules are also likely to take the administration to court.The situation is akin to having a “sword hanging over our heads,” said New York Times chief White House correspondent Peter Baker. “It leaves this idea that they are going to be the judge of who gets to cover them based on some probably arbitrary criteria that they will be the only ones to determine.” He added, “The idea that suddenly you’re going to try to determine who is polite enough to ask the president questions is just kind of ridiculous.”White House Correspondents’ Association president Olivier Knox said Friday afternoon that the White House had not reached out to him for input on any new rules for reporter behavior.“As the organization that defends the interest of a free and independent news media at the White House, we have our role to play, but what that role will be, I don’t know yet,” he said.The White House might see political victory in battling the media, but the court ruling Friday was a legal win for CNN, long a favorite target of Trump's. Federal Judge Timothy Kelly, a Trump appointee, ruled that the administration had denied Acosta due process in revoking his security pass, citing shifting White House explanations, no clear process, no advance notification to Acosta and no chance for him to rebut the allegations. Kelly ordered the White House to return Acosta’s credential on a temporary basis, while the rest of the case moves forward. \nwhite house\n                    By ANNIE KARNIThe White House did not reply to questions Friday about whether it would continue fighting Acosta and CNN in court. But Trump has kept up a confrontational stance with reporters in the past two weeks.He berated CNN's Abby Phillip for asking a “stupid question,” after she asked whether he wanted acting Attorney General Matthew Whitaker to rein in the Russia investigation. And at the same news conference in which he tussled with Acosta, Trump accused Yamiche Alcindor of \"PBS NewsHour\" of asking a “racist question” when she brought up his use of the phrase “nationalist” and its links to white nationalism.“Acosta is one thing, but I think they tip their hand by going after people like Abby Phillip and going after Yamiche Alcindor, who have done nothing but show how professional they are,” Baker said. “This is meant to intimidate.” Trump's frustration with relatively straightforward questions such as those will almost certainly lead reporters to wonder whether they are being targeted for their coverage, not their behavior.CNN has argued that was the case with Acosta, alleging that the White House yanked his hard pass — which allows reporters to freely enter and exit the grounds — because it was attempting to stifle coverage it disliked, in violation of the First Amendment. But Kelly did not address that in his ruling, saying only that Acosta's due process rights were clearly violated. Now, the administration says it's creating a process for banning reporters who do not show “decorum” at events.In excerpts of the Fox News interview — which will air in full Sunday — Wallace asked Trump what the rules for reporters should be. \"You can't keep asking questions,\" the president replied. \"We had a lot of reporters in that room, many, many reporters in that room, and they were unable to ask questions because this guy gets up and starts ... just shouting out questions. And making statements, too.\"Trump added, “But I will say this: Nobody believes in the First Amendment more than I do. And if I think somebody is acting out of sorts, I will leave and say, 'Thank you very much. Thanks for coming.' And I'll leave. Those reporters will not be too friendly to whoever it is that's acting up.”\nWhite House\n                    By JESUS RODRIGUEZThe White House will have broad discretion in formulating rules for reporters’ behavior, so long as none of them discriminate against anyone based on their views or coverage, said Katie Fallow, a senior attorney at the Knight First Amendment Institute at Columbia University.“The fight will likely be over how they’re applied,” she said.Once the new rules are established, the White House likely would not be able to kick out Acosta, or anyone else, for past offenses, said Nathan Siegel, a First Amendment lawyer with Davis Wright Tremaine who previously served as in-house counsel for ABC.“Probably the biggest question is whether it will use those rules to try to eject reporters, whether it’s Acosta or others, in the future,” Siegel said.He said any reporter ejected from the White House under the new rules and procedures would be able to challenge them in court. The result could be an ongoing carousel of legal fights between Trump and the press — something the president seems to relish.In the case of Acosta, Baker said the White House has an easy solution before it.“If they really think that Jim Acosta is too rude, don’t call on him,” he said. “They want what’s happening right now. They want to be in a war with us.”Gabby Orr contributed to this report.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}