{"id": "  POLITICO Magazine\nDemocrats Aren’t Moving Left. They’re Returning to Their Roots.\n", "paragraph": "The Friday Cover is POLITICO Magazine's email of the week's best, delivered to your inbox every Friday morning.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n                AP Photo\nHistory Dept.\n                        Many on both sides are worried about the party’s leftward swing. They say it’s a deviation from the mainstream. It’s not.\n                    By JOSHUA ZEITZNovember 04, 2018Be advised: “Democrats are in danger of going too far left in 2018.” So warn Republicans like Mitt Romney and ex-Democrats like Joe Lieberman and public personae as diverse as James Comey and Howard Schultz. In recent months, the pundit class has determined that the party’s leftward lurch heralds the rise of a “liberal tea party”—a movement that could very well unmoor Democrats from their longstanding center-left traditions, in close imitation of the spiral of events that caused the Republican Party to turn sharply to the right in recent years.What’s fueling this argument? For one, more Democrats have rallied, either noisily or cautiously, around such policy innovations as “Medicare for all,” universal college and a universal basic income. That a smattering of Democratic candidates have elected to call themselves “democratic socialists” has only fueled the claim that such programs are “socialist.” “The center is Harry Truman and Daniel Patrick Moynihan, not Eugene Debs and Michael Harrington,” warned New York Times opinion columnist Bret Stephens recently. (Debs and Harrington were self-identified socialists.)Story Continued BelowBut there’s something wrong with this historical interpretation: Truman strongly supported single-payer health care. Moynihan supported a universal basic income in the 1960s. Dating back to World War II, Democrats sought to make a government-paid education available to as many Americans as possible. If Democrats are marching to the left, that road leads directly back to platforms and politicians who, in their day, commanded wide support and existed firmly in the mainstream of political thought. What’s more, to label these programs “socialist”—which is to say, far outside the center of the political spectrum—reveals a constrained worldview. For over six decades, center-right parties in Europe—in Britain and France, Germany and Austria, and almost everywhere between—have either participated in or acceded to the very same policies.In a remarkable way, today’s debate today strongly resembles a broader discussion that occurred in the United States and Europe in the 1940s, amid wartime mobilization and economic reconstruction, and in the decades following. It’s perfectly reasonable to dispute the progressive agenda on its merits. There are strong policy arguments running in both directions. But to argue that it breaks with the party’s roots, or that it falls dangerously outside the mainstream, is ahistorical.***What pundits today decry as a radical turn in Democratic policy and politics actually finds its antecedents in 1944. With the country fully mobilized for war, President Franklin Roosevelt called for “a second Bill of Rights … an economic bill of rights” that would entitle all Americans to a “useful and remunerative job,” “the right to earn enough to provide adequate food and clothing and recreation,” the “right … to a decent home,” “the right to adequate medical care” and the “right to a good education.” His speech found partial inspiration in a report by the National Resource Planning Board, which advanced the necessity of a “socially provided income.”In effect, FDR proposed to jumpstart the New Deal, a vital and inventive program of economic and social reform that necessarily stalled after the start of World War II. His “Economic Bill of Rights” was bold in its contours and vague in its policy prescriptions, but it would effectively form the basis of the Democratic Party’s aspirations for the better part of four decades. This was certainly true of health care policy. In the 1940s, Senators Robert Wagner and James Murray and Congressman John Dingell Sr. introduced legislation that would have established a national program for hospital and medical insurance. It was stymied by a coalition of Southern Democrats and conservative Republicans, as was also the case with Truman’s efforts after 1949 to achieve the same result. But it was central to the party’s core ambition for many years after. Only in the 1960s did Democrats abandon the concept of universal, single-payer health care and champion a narrower program of guaranteed hospital insurance and voluntary medical insurance for the elderly—the program that we now know as Medicare. They didn’t abandon universal coverage because they viewed it as too radical. Rather, they believed it was no longer necessary. After World War II, major employers began extending unprecedented benefits to workers, including annual cost-of-living adjustments to wages, defined benefits pensions and private health insurance. Given this reality, they turned their focus to a narrower subset of the population that, by definition, would not benefit from employer-based health programs: senior citizens.The same trajectory was generally true of the party’s commitment to ensuring that every family enjoyed an adequate income. Roosevelt’s initial pledge seemed to augur a government-supported basic family wage. In 1946 the Democratic Congress passed—and Truman signed—the Employment Act, which codified the government’s responsibility to “foster and promote free competitive enterprise and the general welfare; conditions under which there will be afforded useful employment for those able, willing, and seeking to work; and to promote maximum employment, production, and purchasing power.” In its original form, the bill would have guaranteed all Americans remunerative work and required the government to create public-sector or private-sector jobs to meet this mandate. In this way, it would have met Roosevelt’s quality of living standard for many families. Conservatives blocked that provision.By the 1960s the American economy seemed so manifestly robust that an income or jobs guarantee no longer seemed necessary. During his tenure as assistant labor secretary in Lyndon Johnson’s administration, Moynihan argued for a minimum family income program, to be enforced by means of a negative income tax, but his was a lone voice. Most liberals believed that if the poorest Americans had access to supplementary job training and education, they would be adequately positioned to capture the benefits of shared prosperity. Interestingly, the next major figure to take up the idea was no other than Richard Nixon, who as president attempted to overhaul the nation’s welfare system by introducing a family income program. The idea stalled in Congress, with conservative Republicans opposing it as too generous, and liberal Democrats decrying it as too stingy.Still, even into the 1970s, Democrats continued to embrace the idea that government should in some way grant every American a good job and, thereby, income. In 1977, Democrats in Congress passed the Humphrey-Hawkins Act—an ambitious proposal reminiscent of the Employment Act. Once again, conservatives watered down the bill such that it lost most of its force.As was true of health care and income policy, Democrats for the better part of the postwar era supported broad access to education. Roosevelt’s GI Bill of Rights extended free university and vocational education to over 16 million veterans of World War II. Millions more veterans of the Korean War would enjoy the same benefits. While liberals found it politically impossible to create a universal right to higher education, many historians generally argue that the GI Bill was meant to create a foundation for a broader guarantee, and indeed, spending on college grants and loans greatly expanded during and after Lyndon Johnson’s administration.To be sure, Democrats never came close to delivering on the promise that FDR established in 1944. It was always an aspirational goal—a North Star that would compete with the gravitational pull of political reality. As well, a booming economy between the mid-1940s and mid-1970s demanded that liberals recalibrate their ambitions and propose a more patchwork system of support for people who had been left behind.In fits and starts, from the 1970s onward, a new generation of Democratic leaders moved their party closer to the center. From the Watergate babies of the 1970s, many of whom rejected the party’s traditional anti-monopoly stance and big-ticket spending agenda, to the Democratic Leadership Council—whose crowning moment came with the election of Bill Clinton in 1992—Democrats continued to pay homage to FDR even as they trained their sites on a more modest set of policy aspirations. In this sense, it is true that many Democrats are moving back to their roots. And those roots lead to policies that commanded broad support—and to leaders who commanded broad popularity—in their day.It’s also ahistorical to decry such policies as “socialist.” To be sure, conservative critics have used the term for the better part of 80 years. In 1936, the chairman of the Republican National Committee warned that America was on a path to become “a socialistic state honeycombed with waste and extravagance and ruled by a dictatorship that mocks the rights of the States and the liberty of the citizen.” In 1952, during his campaign for the presidency, Dwight D. Eisenhower, a relative moderate in the Republican Party, denounced universal health care as “socialized medicine.” In 1961, while speaking on the circuit as a representative of General Electric, Ronald Reagan warned that a pared-down proposal to provide guaranteed hospital insurance for senior citizens constituted “a short step to all the rest of socialism.” “If you and I don’t do this,” he implored his audience, “then you and I may well spend our sunset years telling our children’s children what it was once like in America when men were free.” (Remembering Reagan’s days as an FDR and Truman Democrat, a liberal skeptic asked him, “How much are they paying you for this shit?”)But this criticism ignores ways in which the Republican Party accommodated itself to much of the American welfare state. Republican votes were critical in passing and expanding the GI Bill, Medicare and Medicaid, and other social welfare policies—well into the 2000s. Moreover, European policies that American conservatives regard as staples of Scandinavian-style socialism—universal health care, government-provisioned child care, free or nearly free vocational and university education—were in fact born of a postwar accommodation between conservative and social democratic parties throughout Western and Central Europe. Having endured a half century of intense warfare, as much the product of ideological as ethnic conflict, mainstream politicians and voters from across the political spectrum were eager to fashion a more stable social order. The Conservative Party in the United Kingdom, the Christian Democratic Union in Germany, Christian Democrats in Italy, the Austrian People’s Party, and the Popular Republican Movement in France are prime examples of center-right organizations that collaborated with socialist and centrist parties in establishing a welfare state that defined what historian Tony Jundt called the “‘European way’ of regulating social intercourse and inter-state relations.” The contours of this welfare state varied from country to country, and to be sure, socialists, liberals and conservatives contested—and continue to contest—just how generous the state should be to its citizens. But by the turn of the 21st century, Jundt argued, the “European Way” had become “a beacon … and a global challenge to the United States and the competing appeal of the ‘American way of life.’” In fact, many scholars credit such policies with having forestalled the rise of extreme left-wing movements throughout postwar Europe. (It was precisely this idea that FDR had in mind several years earlier when he declared that he was “fighting Communism, Huey Longism, Coughlinism, Townsendism”—references to highly redistributionist policies proposed by Long, Father Charles Coughlin and Dr. Francis Townsend—to “save our system, the capitalist system.”)\n\n                                                Politics\n\n                                            By Charlie Mahtesian\n\n                                                Swamp Diary \n\n                                            By Jack Shafer\n\n                                                Letter from Georgia \n\n                                            By Michael GrunwaldIn Europe, most of what we know today as the Democratic Party’s “progressive agenda” is normative. It’s the bare minimum of a social contract that enjoys wide support from conservatives, socialists and centrists alike.***So why are Democrats dusting off the policies and political rhetoric of FDR’s day? It could be because, in some ways, the United States more closely resembles the year 1932 than it does 1992, when Clinton pulled the party closer to the center. Income inequality has grown, fewer people enjoy employer-based health care, defined benefits pensions, a living wage or savings to cushions their families in times of bad luck or economic downturn. But if the terms of debate are eerily familiar, our historical perspective is lacking. Almost alone among developed nations, we decry as “socialist” rights and protections that other people around the world regard as foundational to a well-functioning civil society—rights that have long commanded support from across the political spectrum. Our center has drifted further right, leaving Americans to view the world through a uniquely skewed prism.We can have a vigorous debate about “Medicare for all,” a universal basic income and guaranteed college. We should have the debate. These might not be the right answers. But if we begin from the proposition that such ideas are alien to America’s civic tradition—that they are far outside the mainstream—that they are a political nonstarter, we’re not only constricting the terms of debate. We’re betraying the historical record in the process. Joshua Zeitz, a Politico Magazine contributing editor, is the author of Building the Great Society: Inside Lyndon Johnson's White House, which will be released on January 30. Follow him @joshuamzeitz. Swamp Diary \n\n                        By Jack Shafer\nThe Friday Cover\n\n                        By Keith Kloor\nPolitics\n\n                        By Derek Robertson\n\n © 2018 POLITICO LLC"}