{"id": "\n\n\n\nPOLITICO\n\n\nTrump pauses divisive rhetoric to visit grieving Pittsburgh\n", "paragraph": "\n                President Donald Trump, accompanied by first lady Melania Trump, lit candles in honor of each victim and placed white flowers and small stones at a memorial to those who died. | Saul Loeb/AFP/Getty Images \nWhite House\n                        Though a swarm of journalists tracked the president's every move, he did not speak to them — a rare moment of restraint.\n                    By JESUS RODRIGUEZ and ANDREW RESTUCCIA10/30/2018 10:53 AM EDT\n                    Updated 10/30/2018 09:04 PM EDTPresident Donald Trump traveled to Pittsburgh on Tuesday to offer condolences to families of the victims of the recent mass shooting at a synagogue, momentarily pausing his heated rhetoric to grieve with the mourning city.Trump, who ignored the pleas of some local officials to cancel the trip, visited the Tree of Life synagogue in the city's Squirrel Hill neighborhood, where an attacker on Saturday allegedly yelled anti-Semitic statements as he killed 11 congregants. The president, accompanied by first lady Melania Trump, lit candles in honor of each victim and placed white flowers and small stones at a memorial to those who died.Story Continued BelowHe later went to a nearby hospital to meet with medical staff and people wounded in the attack.Though a swarm of journalists tracked the president's every move, he did not speak to them nor did he make any public remarks — a rare moment of restraint for a president who has a reputation for stepping on his own message.\"He wanted today to be about showing respect for the families and the friends of the victims as well as for Jewish Americans,\" White House press secretary Sarah Huckabee Sanders told reporters traveling with Trump.Local and congressional leaders declined to accompany the president on his trip, heeding the warning of some area officials who worried it would distract from ongoing funerals. But Tree of Life Rabbi Jeffrey Myers joined Trump on his visit to the synagogue, despite criticizing politicians' overheated rhetoric earlier in the day. Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Trump has sometimes struggled to play the role of consoler in chief, often reigniting outrage soon after a national tragedy with his outlandish, off-the-cuff remarks. But Trump took pains Tuesday to project an air of seriousness after facing a week of fierce criticism following the shooting and a series of attempted package bombings that targeted his political opponents. With key Democrats and Republicans either declining to attend or not receiving an invitation, Trump was instead joined by the first lady, as well as his daughter Ivanka and son-in-law, Jared Kushner. Other administration officials also traveled to Pittsburgh, including Treasury Secretary Steven Mnuchin and Jason Greenblatt, Trump's envoy to the Middle East. Also there was Ron Dermer, Israel’s ambassador to the United States.But several prominent figures were notably absent.A spokesman for Pittsburgh Mayor Bill Peduto's office confirmed that the mayor would be attending funerals as Trump arrived in town on Tuesday afternoon. Peduto, a Democrat, previously urged Trump to consider \"the will of the families\" and to avoid a visit \"while we are burying the dead.\"\"The mayor's sole focus today is on the funerals and on supporting the families of the victims,\" the spokesman, Timothy McNulty, told POLITICO. At least two funerals were to be held Tuesday, according to local outlets.Trump's contentious visit comes as the city is still reeling from a shooting considered one of the worst instances of anti-Semitic violence in U.S. history. The Department of Justice has filed hate crime charges against Robert Bowers, the alleged shooter.The four top congressional leaders in both parties — Senate Majority Leader Mitch McConnell (R-Ky.) and Minority Leader Chuck Schumer (D-N.Y.), as well as Speaker Paul Ryan (R-Wis.) and House Minority Leader Nancy Pelosi (D-Calif.) — were invited to join Trump in Pittsburgh but declined, according to a source familiar with the matter. Both McConnell and Ryan had previous commitments with the midterms just one week away.Sens. Pat Toomey (R-Pa.) and Bob Casey (D-Pa.) also decided against joining the president, according to a source close to Toomey and Casey spokeswoman Jacklin Rhoads. Matt Dinkel, a spokesman for Democratic Rep. Mike Doyle, whose district includes the Squirrel Hill area, confirmed the congressman was not invited to join Trump's visit.\nWhite House \n                    By ANDREW RESTUCCIAAllegheny County Executive Rich Fitzgerald also did not join the visit.Myers, who initially said Trump was \"certainly welcome\" to visit, appeared to break with the president earlier Tuesday, decrying the rhetoric of public officials, which he said can fan the flames of violence.\"When you speak words of hate, when you speak ill of the other candidate, any words of hate, Americans listen to you. They get their instructions from you,\" Myers told CNN's \"New Day\" on Tuesday. \"When you speak words of hate, you say to them, 'This is OK, you can do it as well.'\"\"Tone down the hate. Speak words of love, speak words of decency and of respect. When that message comes loud and clear, Americans will hear that and we can begin to change the tenor of our country,\" Myers added.Asked during a POLITICO Playbook interview on Tuesday whether politicians should tone down the rhetoric, Vice President Mike Pence said, \"Well, everyone has their own style, and there's strong rhetoric on both sides of the aisle.\"\"I never want to tell anyone in the public debate that you can't express yourself from the heart,\" Pence added. \"And again, I think it's important that we don't connect the evil acts we witnessed ... to the public debate.\"Since the shooting, several local leaders have publicly spurned Trump, linking the president's rhetoric with the violence even as Trump condemned the attacker and the \"scourge of anti-Semitism.\" Eleven progressive Jewish leaders penned a letter to Trump urging him to stay away.\"For the past three years your words and your policies have emboldened a growing white nationalist movement. President Trump, you are not welcome in Pittsburgh until you fully denounce white nationalism,\" read the letter, which had garnered more than 68,000 signatories as of Tuesday morning. \"Our Jewish community is not the only group you have targeted. You have also deliberately undermined the safety of people of color, Muslims, LGBTQ people, and people with disabilities. Yesterday’s massacre is not the first act of terror you incited against a minority group in our country,\" the letter went on.Elana Schor contributed to this report.CORRECTION:  An earlier version of this article incorrectly characterized Israeli Ambassador Ron Dermer as a member of the Trump adminstration.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}