{"id": "\n\n\n\nPOLITICO\n\n\nTrump points to possible antitrust problems for Comcast\n", "paragraph": "\n                The Comcast-NBCU deal was approved by the Obama administration with conditions in 2011, but those conditions have expired in recent months. | Jeff Fusco/Comcast via AP Images\nMedia\n                    By JOHN HENDEL11/12/2018 04:12 PM ESTPresident Donald Trump on Monday suggested possible antitrust scrutiny for Comcast, which owns one of Trump's frequent targets, NBC News.“American Cable Association has big problems with Comcast,” Trump tweeted. “They say that Comcast routinely violates Antitrust Laws.” Story Continued BelowThe association, which represents smaller cable companies, has asked the Justice Department’s antitrust division to investigate Comcast's merger with NBCUniversal, saying it poses a threat to competition.The Comcast-NBCU deal was approved by the Obama administration with conditions in 2011, but those conditions have expired in recent months.Trump quoted from a Fox Business Network segment in which journalist Charles Gasparino cites the cable group as saying Comcast could be much more damaging to consumers than the AT&T-Time Warner merger, a deal that the Trump administration is fighting in court. Your guide to the media circus — weekday mornings, in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.Comcast, in a statement, didn't directly address the president's tweet, but said the market is \"incredibly competitive.\"“[W]e are competing in this dynamic environment the way we always have — by continuing to innovate and conducting our business in compliance with antitrust laws and other legal requirements,” said spokesperson Sena Fitzmaurice. \"We believe that ACA’s letter is without merit and constitutes an inappropriate attempt to gain leverage in the commercial marketplace.\"Both the Comcast and AT&T mergers involve news networks Trump criticizes as \"fake news\" — Comcast-owned NBC and AT&T-owned CNN. Trump last year threatened to yank NBC's broadcast licenses, prompting his FCC chairman to defend the First Amendment and explain his agency can't revoke the license of a broadcaster based on its content. (Also, NBC doesn’t have a broadcast license.)Trump has had Comcast in his sights for some time, even suggesting on the campaign trail that his future administration would consider breaking up Comcast. “Comcast's purchase of NBC concentrates far too much power in one massive entity that is trying to tell the voters what to think and what to do,” Trump said in October 2016. “Deals like this destroy democracy.” Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}