{"id": "\n\n\n\nPOLITICO\n\n\nDeSantis wins Florida gubernatorial race as Gillum concedes \n", "paragraph": "\n                Ron DeSantis, a former congressman, aligned himself closely with President Donald Trump during his campaign. | Jeff J Mitchell/Getty Images\nElections\n                    By MARC CAPUTO11/17/2018 05:36 PM ESTMIAMI — Andrew Gillum, the Florida Democratic Party’s first African-American candidate for governor, officially called it quits Saturday and congratulated Republican Ron DeSantis as the governor-elect of Florida.Gillum’s announcement follows an automatic recount that ended Thursday and showed him gaining just one net vote in the process, making the margin against DeSantis officially 33,683 votes, or 0.41 percentage points.Story Continued BelowGillum, who conceded on Election Night Nov. 6 and then withdrew his concession when the race headed to an automatic recount, was hoping that lawsuits from Democratic Sen. Bill Nelson in his race would turn up more votes. But it didn’t happen, and Nelson is sure to lose as well. The 2018 Florida midterm election results are scheduled to be certified Tuesday. “We said we would fight until the last vote is counted. We are now closing out the hand recount phase in two of the statewide races,” Gillum said in a Facebook video address, referring to Nelson’s contest and the race for agriculture commissioner, where Nikki Fried appears to be the only Democrat elected statewide.“We wanted to make sure that every single vote including those that were overvotes, undervotes — as long as it was a legally cast vote — we wanted those votes to be counted,” Gillum said, standing next to his wife and adding that they “wanted to take a moment to congratulate Mr. DeSantis on becoming the next governor of the great state of Florida.”\nThe 39-year-old mayor of Tallahassee came closer than any other Democrat in 20 years to beating a Republican candidate for governor. Gillum’s unlikely win in the Democratic primary and his dynamic speaking style earned him a national fan base, and signaled that he’s likely to run for office again because, he said, his campaign was part of a “movement.”In conceding, Gillum opted not to keep his options open by contesting the election, a long-shot effort that he and his advisers believed would be doomed to fail and corrosive for his brand. Even President Donald Trump, who trashed Gillum as corrupt and feckless, had kind words about Gillum and said he was someone to watch.“Congratulations to Andrew Gillum on having run a really tough and competitive race for Governor of the Great State of Florida,” Trump said on Twitter. “He will be a strong Democrat warrior long into the future - a force to reckon with!”Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}