{"id": "\n\n\n\nPOLITICO\n\n\n\nFlorida\n\nAt DeSantis rally, Perdue says Florida governor's race 'so cotton-pickin' important'\n", "paragraph": "\n                Agriculture Secretary Sonny Perdue made the comments at a rally for Republican gubernatorial candidate Ron DeSantis. | AP Photo\n                    By MATT DIXON11/03/2018 07:00 PM EDTTALLAHASSEE — During a Saturday rally for Florida Republican gubernatorial candidate Ron DeSantis, President Donald Trump’s top agriculture official used the term “cotton-pickin'” to describe the importance of Florida’s gubernatorial race, which also features Democrat Andrew Gillum, who is running to be Florida's first black governor. “Public policy matters. Leadership matters,” said Agriculture Secretary Sonny Perdue said at a Lakeland rally, according to audio provided by American Bridge. “And that is why this election is so cotton-pickin' important to the state of Florida. I hope you all don’t mess it up.”Story Continued BelowPerdue is a former governor of Georgia.“You would have to ask Governor Perdue about any of his remarks,” Stephen Lawson, a spokesman for DeSantis’ campaign, said by email. “We were happy to have him in Polk County campaigning with us.“The phrase “cotton-pickin‘” bedeviled another Trump Republican earlier this year when the president’s former deputy campaign manager, David Bossie, apologized in June for telling a black guest on Fox News, “You’re out of your cotton-pickin' mind.”Before Bossie could apologize, program host Ed Henry called the phrase “deeply offensive and wholly inappropriate.”From the start of the general election, race has played a dominating factor in Florida’s nationally-watched governor‘s race. The day after the Aug. 28 primary election, on a different Fox show, DeSantis called Gillum “articulate” and said voters shouldn’t “monkey this up” by electing him. Like Bossie, DeSantis was rebuked on air by a Fox News personality, but the former three-term congressman, who is white, refused to apologize because he said he did nothing wrong and his comment was not about race.During an Oct. 21 debate, Gillum directly addressed the “monkey this up” remark in a racial context after the moderator asked DeSantis about the comments.“He has only continued in the course of his campaign to draw all the attention he can to the color of my skin,” Gillum said. “The truth is, I’ve been black all of my life. So far as I know, I will die black.”DeSantis has fiercely pushed back against any accusations he is racist, offering up his time as a Navy JAG officer as evidence.“When I was down-range in Iraq, we worked as a team regardless of race,” DeSantis said during the second and final gubernatorial debate on Oct. 24.The moderator at that debate asked DeSantis about the fact he has spoken at conferences organized by conservative David Horowitz, who has in the past sparked controversy for statements like “the country’s only serious race war is against whites.”“How the hell am I supposed to know every single statement someone makes?” DeSantis said. “I’m not going to bow down to the altar of political correctness, I’m not going to let the media smear me.”Gillum’s response drew loud reaction from the audience, and later went viral.“I’m not calling Mr. DeSantis a racist,” Gillum said. “I’m saying the racists believe he’s a racist.”Marc Caputo contributed to this report.A weekly, must-read brief on health care news and moves in Tallahassee and around the stateA morning email with must-read analysis and breaking news on Florida politics and policy.A weekly must-read on budget politics for Florida Pros, with exclusive reporting and analysis, interviews and more. POLITICO Florida Pro's high-level outlook on the policy issues driving the month in Florida.Matt Dixon and Marc Caputo's must-read briefing on what's hot, crazy or shady about politics in the Sunshine State\n                        POLITICO ProA morning email with must-read analysis and breaking news on Florida politics and policy.\n                        POLITICO ProA weekly, must-read brief on health care news and moves in Tallahassee and around the state.\n                        POLITICO ProOur weekly digest of college and university news in the Sunshine State.\n                        POLITICO ProA weekly must-read on budget politics for Florida Pros, with exclusive reporting and analysis, interviews and more. \n                        POLITICO PROPOLITICO Florida Pro's high-level outlook no the policy issues driving the month in Florida.\n                        POLITICO ProOriginal federal and state policy documents © 2018 POLITICO LLC"}