{"id": "  POLITICO Magazine\nYes, Political Rhetoric Can Incite Violence\n", "paragraph": "The Friday Cover is POLITICO Magazine's email of the week's best, delivered to your inbox every Friday morning.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n                Brendan Smialowski/Getty\nPolitical Science\n                        People already inclined toward aggression become even more so when exposed to hostile political speech.\n                    By NATHAN KALMOEOctober 30, 2018Over the past week, a gunman targeted an African-American church in Kentucky in what is being investigated as a hate crime; another shooter, shouting ant-Semitic epithets, killed 11 people at a Jewish synagogue in Pittsburgh; and a third man mailed 14 pipe bombs to Democratic ex-presidents, members of Congress and other critics of President Donald Trump. After this spate of violence, many Americans are wondering whether the president’s hostile political rhetoric—attacking “globalists,” minorities, the media and Democratic “mobs”—contributed to the attacks; Democrats are accusing him of direct incitement, while some Republicans, including the White House, call that idea absurd.What does social and psychological research tell us about the potential link between political rhetoric and violence? Can words really lead to actions? Cause and effect are hard to establish conclusively, especially in individual cases. But researchers have good circumstantial evidence from the real world as well as evidence from scientific experiments concluding, overall, that rhetoric is probably not the main cause in most attacks—but violent, hateful language can inflame people who are already inclined toward violence and focus their rage.Story Continued BelowIn a series of experiments I conducted in 2010, I found that exposure to mildly violent political metaphors such as “fighting for our future” increased general support for political violence among people with aggressive personalities.After participants answered personality questions about aggression, I randomly assigned them to read a short campaign speech that included either violent metaphors or nonviolent substitutes. Then, participants responded to questions about political threats, property damage and physical violence against leaders. Among interpersonally aggressive people, those who read the violent text had higher average political violence scores compared with those who saw nonviolent language. People with low aggressive personality scores were unaffected by language differences. In other words, aggressive people are already more likely to support political violence, and violent language makes them more so. The mild metaphors I used in these studies match well with common political language, so the explicit violent language we have heard recently could have stronger effects.My findings are consistent with other research about how media violence primes aggressive behavior in people who are predisposed to it. What’s more, perpetrators of political violence, most of whom are men, often have histories of interpersonal violence and domestic abuse. We also have evidence that Trump’s own words have caused audiences to behave worse in the past. In national experiments from 2016 and 2017, University of Massachusetts political scientist Brian Schaffner found that exposure to Trump’s racist comments about Mexicans during his campaign made people more likely to write offensive statements that were toward not just Mexicans but other groups. Indeed, people with prejudices toward one group often dislike other groups, suggesting that bigoted language has consequences beyond targeted groups. Furthermore, people whose racial and religious identities align with the demographics of their political party are more hostile toward partisan opponents, as Lilliana Mason, of the University of Maryland, College Park shows in her book. Thankfully, the vast majority of Americans reject violence in politics entirely. This was the case in the 1990s and in my 2010 studies. More recently, in 2017, Mason and I fielded a national survey that found similarly low levels of support for partisan violence, even when participants reported intense partisan hostility in other questions. And even among those who hold violent views, very few act on them. Of course, as we’ve seen, even a few people can do horrible damage.Vilification in general makes it easier to harm people without damaging one’s good self-image, a process psychologists call “moral disengagement.” Vilifying rhetoric has contributed to mass violence and even genocide when weaponized against minority groups, as in Nazi Germany, and in Rwanda and the Balkans during the 1990s. This campaign season, the president and other Republicans have praised violence against journalists, described refugees as violent monsters, and promoted cynical conspiracy theories combining anti-Semitism, racism and unfounded fears of election fraud. Political scientist Erin Cassese, of the University of Delaware, has found that partisan dehumanization is common in campaigns, too.Of course, violent rhetoric and demonization are not new in politics. The American founders accused one other of treason in partisan newspapers. Yale historian Joanne Freeman’s recent book, Field of Blood, documents how vitriolic rhetoric between 19th-century congressmen caused dozens of brawls before the Civil War. Hyperpartisan vitriol, conspiracy-mongering and threats led directly to the war itself—the nation’s bloodiest. Extreme rhetoric also coincided with real violence in the political turmoil of the 1960s and 70s—assassinations and hundreds of bombings. More recently, we have witnessed several abortion clinic attacks, the 1995 Oklahoma City bombing, the 2017 shooting of the Republican congressional baseball team, brawls at political events, Islamist-inspired attacks and scores of violent hate crimes. The Secret Service and FBI investigate hundreds of threats against leaders each year, along with recurring assassination attempts. What’s new is violent, demonizing rhetoric directly from a president. That’s alarming because he has the country’s loudest megaphone, which has brought extreme language and views into mainstream politics. Consider that multiple people charged with crimes, or their lawyers, have recently pointed to Trump’s words as bearing some responsibility for their own acts.We might usefully distinguish between a general climate fueling violent hate and more detailed inspirations for violence. Both are worrisome. But naming specific individuals and groups as “enemies of the people” focuses ire on specific targets. American leaders and citizens singled out in this way have subsequently received deluges of hateful, bigoted and violent messages. It is no surprise to see the next step into physical violence against those targets, with perpetrators spouting the same rhetoric.The president is not alone in this language. Fox News and far-right websites alternately lead the president, then follow. Other politicians either share or parrot those views. That echo chamber expands the audience and reinforces the animosity by creating the impression of party consensus against certain “enemies.” Partisan citizens generally take their opinion cues from these party leaders. True, Trump has denounced hate and violence on occasion, but he subsequently undercuts his denunciations. Heated rhetoric by Democratic leaders, while it certainly exists, comes nowhere close.Of course, conflict is inherent in politics, and leaders have a responsibility to criticize opponents to inform the public. Anger can have a mobilizing effect and can drive desirable, nonviolent political action—even contentious protest—but it’s also the emotional fuel of aggression.Ultimately, leaders bear responsibility for protecting the peace and upholding norms necessary for a healthy democracy. There may not be legal consequences for violent, hateful words from the nation’s highest officials—and violence against them is out of the question—but we can ensure that they face electoral consequences when they channel violent prejudices.Nathan Kalmoe is assistant professor of political communication at Louisiana State University in the Manship School of Mass Communication and Department of Political Science.Swamp Diary \n\n                        By Jack Shafer\nThe Friday Cover\n\n                        By Keith Kloor\nPolitics\n\n                        By Derek Robertson\n\n © 2018 POLITICO LLC"}