{"id": "\n\n\n\nPOLITICO\n\n\nSinema wins Arizona Senate race\n", "paragraph": "\n                Rep. Kyrsten Sinema's victory in Arizona's Senate race gives Democrats their second pickup of the election in the chamber. | Rick Scuteri/AP Photo\nElections\n                        The Democrat pulled out a come-from-behind victory to flip a formerly Republican seat.\n                    By JAMES ARKIN11/12/2018 04:42 PM EST\n                    Updated 11/12/2018 09:06 PM ESTDemocratic Rep. Kyrsten Sinema has defeated Republican Rep. Martha McSally in the battle for the open Senate seat in Arizona, giving Democrats their second Senate pickup of the cycle.Sinema had 49.7 percent of the vote to McSally’s 48 percent when The Associated Press called the race Monday evening. Though McSally led narrowly on Election Night, Sinema took the lead in the race two days later and continued to pad her edge as the state counted outstanding votes through the weekend and Monday.Story Continued BelowSinema’s victory gives Democrats their second pickup of the election, and limits Republican gains in the chamber to just one seat so far, pending a recount in Florida and a runoff in Mississippi. Her victory guarantees Democrats will hold at least 47 Senate seats.McSally, in a Twitter video Monday evening, said she called Sinema to concede the race and congratulated the Democrat for becoming Arizona’s first woman elected to the Senate after a “hard-fought battle.” She thanked her campaign staff and voters who supported her.“We sure wish it came out with a different result, but I’m so thankful for you,” McSally said.\n                            Republican Rep. Martha McSally, a former fighter pilot first elected to Congress in 2014, jumped into the race following GOP Sen. Jeff Flake’s retirement announcement. | Matt York/AP PhotoSinema, in her victory speech Monday night, said she was grateful to McSally for her service, but said there was a clear choice in the race between them. “Arizonans had a choice between two very different ways forward: One focused on fear and party politics, and one focused on Arizona and the issues that matter to everyday families,” Sinema said. “Arizona rejected what has become far too common in our country: name-calling, petty personal attacks, and doing and saying whatever it takes just to get elected.”She also praised late Sen. John McCain (R-Ariz.) several times, calling him “irreplaceable” and saying “his example shines a light on our way forward.” In addition to being Arizona’s first female senator, Sinema is the first Democrat to win a Senate election there in three decades. She will replace outgoing Sen. Jeff Flake, a first-term Republican who announced last fall that he would retire after repeated clashes with President Donald Trump.\nSinema, a three-term House member, announced her campaign a month before Flake left the race. McSally, a former fighter pilot first elected to Congress in 2014, jumped into the race following Flake’s retirement announcement.McSally kept close to the president as she navigated a Republican primary against two well-known immigration hardliners: former state Sen. Kelli Ward, who challenged McCain in a 2016 primary, and former Maricopa County Sheriff Joe Arpaio, who was pardoned by Trump last year after being convicted on criminal contempt charges.McSally ultimately dispatched both Republican challengers, winning slightly more than 50 percent of the vote in the late-August primary. But Sinema had already staked herself to a substantial lead in most public polls after running millions of dollars of ads on TV throughout the summer touting independence and bipartisanship. Republicans hardly countered the spending as they fought to boost McSally in the primary.Sinema focused relentlessly on health care throughout the race. She sharply criticized McSally for supporting the failed Republican health care plan in the House in 2017, saying McSally abandoned those with pre-existing conditions by supporting a bill that weakened protections. But she also tacked decisively to the center, distancing herself from the national party, including being the first Democratic Senate candidate to pledge not to vote for Sen. Chuck Schumer as Democratic leader.\nElections\n                    By POLITICO STAFFMcSally and her Republican allies painted Sinema as too liberal for the state, highlighting her past as a Green Party activist. They attacked her late in the race with a stream of videos showing past jokes Sinema had made aimed at Arizona, and ran TV ads scrutinizing Sinema’s antiwar activism during the George W. Bush administration, including one in which she was wearing a tutu while protesting. McSally accused Sinema of supporting “treason” during their sole debate. But the attacks weren’t enough to diminish the lead and reputation Sinema had created through the earlier months of the campaign.The race saw tens of millions in outside spending flow into the state, flooding the airwaves with largely negative ads on both sides.Democrats are likely to continue to target Arizona in the 2020 presidential election and in future statewide contests. Sen. Jon Kyl is currently Arizona’s other senator, having been appointed earlier this year to replace McCain, who died in August. Kyl has not pledged to serve the remainder of his term, but Kyl or a potential replacement would have to run in a special election in 2020, and again in 2022.Sinema is the first Democrat to win a Senate election in Arizona since Dennis DeConcini in 1988. Other than DeConcini, no Democrat has represented Arizona in the Senate since Carl Hayden retired in 1968.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}