{"id": "\n\n\n\nPOLITICO\n\n\nSaudi prince: Khashoggi slaying  a ‘heinous crime that cannot be justified’ \n", "paragraph": "\n                Saudi Crown Prince Mohammed bin Salman said that his government would cooperate with Turkish officials and warned that some around the globe are trying to use Khashoggi’s murder to “drive a wedge” between Saudi Arabia and Turkey.  | AP Photo/Amr Nabil\nForeign Policy \n                    By MARY LEE10/24/2018 12:13 PM EDTSaudi Crown Prince Mohammed bin Salman called the killing of Washington Post columnist Jamal Khashoggi a “heinous crime that cannot be justified” but maintained his innocence in the murder that took place inside his kingdom’s Istanbul consulate. “The crime was really painful to all Saudis and I believe it is painful to every human in the world,” he said Wednesday, sitting on a panel at the Future Investment Initiative summit at the Ritz-Carlton Hotel in Riyadh. “It is a heinous crime that cannot be justified.”Story Continued Below The crown prince said that his government would cooperate with Turkish officials and warned that some around the globe are trying to use Khashoggi’s murder to “drive a wedge” between Saudi Arabia and Turkey. He said he wanted to “send a message” to those working pit the two against once another: that they would “not be able to do that as long as there is a King called Salman bin Abdulaziz Al Saud and a crown prince called Mohammed bin Salman in Saudi Arabia and a president in Turkey called Recep Tayyip Erdoğan.”Turkey and Saudi Arabia are regional rivals in the Middle East who have jockeyed for influence and power among their neighbors as well as within the Muslim world.Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time. The Saudi crown prince’s comments pledging cooperation with the Turkish government followed demands from Erdoğan that those responsible for Khashoggi’s killing face justice, “from the highest ranked to the lowest.” In remarks to Turkey’s parliament, Erdoğan said plans to kill Khashoggi were hatched days before he entered the Saudi consulate in Istanbul and that the journalist was murdered by a team of Saudi assassins. Erdoğan's claims directly refute the kingdom’s account that the 59-year old journalist died during an interrogation that escalated into a fistfight. Turkey has also implicated possession of evidence that Khashoggi was tortured and dismembered, and died in the consulate on Oct. 2. The Saudi journalist, who was living in exile in the U.S., was critical of the Saudi monarchy. While scores of powerful executives and top officials boycotted the conference, the crown prince, who has cast a carefully fashioned image as a reformer in the strict Arab kingdom, received standing ovations in two appearances thus far. Responding to a moderator's question, the 33-year old prince emphasized that he is cooperating with the Turkish government and plans to “present perpetrators to court.” As the moderator pivoted from the journalist’s slaying to the economies of the Middle East, the crown prince said “the new Europe is the Middle East,” and then added that “the kingdom of Saudi Arabia in five years will be totally different.”\nForeign Policy \n                    By ALENA SADIQ and NAHAL TOOSI In Washington, President Donald Trump for the first time during the three-week long international uproar pronounced the latest official Saudi account as “the worst cover-up ever,” reversing course after initially withholding criticism of the oil-rich kingdom’s leaders.“They had a very bad original concept, it was carried out poorly and the cover-up was the worst in the history of cover-ups, very simple,” Trump told reporters in the Oval Office on Tuesday.The administration responded by revoking the visas of 21 Saudis suspected of involvement in the journalist’s death. CIA Director Gina Haspel is also expected to return to Washington on Wednesday to brief the president on her talks with Turkish officials.Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.\n                                            By Jack Shafer\n                                            By Keith Kloor\n                                            By Derek Robertson\n                                            By POLITICO Staff © 2018 POLITICO LLC"}