{"id": "Warcraft 3: Reforged is more than just a remaster of Blizzard’s classic RTS", "paragraph": "Blizzard describes Warcraft 3: Reforged as a “complete reimagining” of its real-time strategy classic, which is probably the best way of explaining what it’s doing with the 16-year-old game. Part remaster, part rebalancing, part retcon, Reforged will be a major upgrade for the game that won’t leave players of the original behind.During an interview at BlizzCon 2018, Blizzard’s Brian Souza and Pete Stillwell explained that players who own the original Warcraft 3 will be able to play against those who own Warcraft 3: Reforged, and vice versa. Maps and other community created content made in the original Warcraft 3 are also compatible with Reforged. Stillwell, senior producer on Warcraft 3: Reforged, said that from a technical standpoint, the two versions of the game will live under one client to achieve that compatibility.Warcraft 3: Reforged was developed with a different goal in mind than last year’s StarCraft: Remastered, Stillwell said.“When we went to Korea [for StarCraft: Remastered] and talked with pros and people still playing in game rooms, the overwhelming feedback was ‘Please don’t change the game,’” Stillwell said. “‘Make it pretty, give us a modern matchmaker and then quietly step away, Blizzard.’ Getting those marching orders made the endeavor not just easier but more focused. But with [Warcraft 3: Reforged], we’ve talked with the communities in Europe and in China [who say], ‘Hey, we don’t think this game is done.’”The goal is not just to give Warcraft 3 a new coat of paint, but “do more with it.”“Let’s push it,” Stillwell said. “Let’s get it to be as perfectly balanced as StarCraft. Let’s add more to the editor, because it’s already powerful. And like a good Blizzard game, it’s easy to learn, difficult to master, [but let’s] also make it even deeper.”There is rebalancing in the works for Warcraft 3: Reforged, “hundreds of balance changes to heroes, units and buildings” to modernize the game, Blizzard says. And those changes will go back into the original Warcraft 3, which Blizzard has been updating over the past year in preparation for Reforged.Blizzard is also promising to “reforge” the game’s cinematic cutscenes, and will tweak portions of the game to fall in line with the past decade and a half of lore established by World of Warcraft.Writer Christie Golden, who has worked with Blizzard on multiple novels set in the Warcraft universe over the past two decades, is helping to bring “parity” to the stories of Warcraft 3 and World of Warcraft, which will require retconning some of the strategy game’s story. Those changes will bring “renewed focus to a few central characters that we thought deserved a little bit more time in the limelight,” Stillwell said.“There’s been 16 years of evolution of this franchise outside of this game,” Stillwell explained. “Some of that, especially central characters like Jaina and Sylvanas, these people who mean so much more to the world now who didn’t get as much focus [in the original Warcraft 3] because we just didn’t know where they were going to be.”There will also be updates to Warcraft 3’s world layout and locations ... and even its Murlocs.“The missions themselves, like what you see in ‘The Culling,’ we didn’t just replace the artwork, we relayed it out to be what people expect from World of Warcraft,” Souza, a lead artist on Reforged, said. “[Players have] gone through Stratholme while it’s burning. They’ve gone through Stratholme with Arthas as he’s doing the Culling, and that’s one of those things where we’re recreating the [Stratholme] that people know, rather than one that was in the original Warcraft 3, which if you looked at it really didn’t make much sense — it had Greek columns, and these whale statues and this river going through it. So where we can make those changes where it brings parity with World of Warcraft which has done so much with the characters, with the lore, and the locations...”“And a lot of stuff in Warcraft 3 was just kind of put in as ‘Hey, isn’t this awesome? This is cool.’ Like the Murlocs for instance. One of the artists back in the day, he came in over the weekend because he felt that there needed to be more creeps on the maps ... so he just retextured what the ghoul was and he made a Murloc. That was how the Murloc was born. Just this guy [being] really passionate wanting more stuff. Then in World of Warcraft, Murlocs are everywhere — they’ve gotten a society, they’ve got heroes — so we want to make sure that [Reforged’s] Murlocs, are those Murlocs.”Warcraft 3: Reforged will be released for Mac and Windows PC in 2019."}