{"id": "A serious debate about Pikachu’s fur in the Detective Pikachu trailer", "paragraph": "On Monday, the first trailer for Detective Pikachu, Warner Bros. Pictures’ and Legendary Entertainment’s stab at a live-action Pokémon feature film, revealed a world populated by the living, breathing creatures, rendered with photorealistic computer animation. The movie makes a bold choice: While the classic Pokémon designs come to life alongside human actors, there’s a delicate push toward texture and zoological expectation. What would a Pokémon look like if it were real? Well, Pikachu would probably have fur. For better or worse.After we picked our jaws up off the floor, a few of Polygon’s staffers jumped into the ring to discuss the decision to give Detective Pikachu some scruff on which his deerstalker could sit. We encourage you to join the debate in a mannered, Pokémon trainer-like fashion in the comments.\n    Related\n  Matt Patches, entertainment editor: So Pikachu, formally an Electric-type Pokémon cartoon, is now a 3D, CG, detective-hat-wearing companion voiced by Ryan Reynolds. This is not the surprising part of the trailer — we knew what we were getting, and our imaginations probably came somewhere close to what the trailer promises. The surprising part is that Pikachu has fur. He is kitty-like. And it’s shocking. Based on reactions, I might be the only one who approves of hairy Pikachu. This was the only direction the movie could have gone to remain faithful to reality. (As far as a world where Pokémon run around the Blade Runner-esque streets is “reality.”)Jenna Stoeber, video producer: Faithful to the reality of an electric mouse?Chelsea Stark, managing editor: I think he’s cute! Honestly, each time I watch the trailer, Pikachu grows on me. Petrana Radulovic, entertainment reporter: I’m fine with hairy Pikachu, but this is furry Pikachu. Mice hair is not that long.Jenna: It’s not even realistically mouse-like.Petrana: It’s like a subtle fuzz. Look at Incineroar in [Super Smash Bros. Ultimate]: He has fur. He’s cat-based. But it’s shorter and more closer to mouse. Whereas this Pika looks like a Persian.Patches: I see, the problem isn’t the existence of texture, it’s the particular texture for you. Petrana: Yes. All the textures in this trailer should be ... less.Allegra Frank, deputy news editor: There are two hypotheses I have that would make me okay with this Pikachu’s texture: (1) His hair is perpetually standing up because he’s full of electric currents. (2) His hair is perpetually standing up because he’s shocked himself repeatedly. Those would make sense to me.Patches: So you want the movie to canonize his fur as constantly static-charged?Allegra: Yes! If they’re going to go this direction by making him have the same fur length as, like, a A LONG-HAIRED CAT, then heck yeah, I want that to be the canonical explanation for this.Patches: How do we feel about the Super Bowl commercial from a few years ago that literally copy/pasted the Pokémon designs and dropped them into what amounted to a football arena?I think the spot proved that Pokémon could look like themselves while standing next to live-action actors. But we didn’t want Detective Pikachu to look like Who Framed Roger Rabbit?, right? So you have to go full hair. Or full fur! Like the Christopher Robin movie.Allegra: Hold up, this is what Pikachu looks like in that Super Bowl commercial — furry, but not that furry:Patches: They went the extra mile for our boy Pikachu.Petrana: I would’ve absolutely preferred that treatment. I think some of the Pokémon do look cooler in the movie, but it also feels ... very different from the Pokémon we know.Jenna: I also would have preferred a Roger Rabbit look.Petrana: There’s a lot going on in their eyes seeming so real.Jenna: Detective Pikachu lands in an uncanny valley of detail.Petrana: It’s almost there, but not.Allegra: The eyes ... look like human eyes. Like, if anime were real. Jenna: The amount of detail in Pikachu’s expressions is also displeasing.Allegra: Speaking of expressions though: JIGGLYPUFF. There is no reason Jigglypuff should be that furry. Why does it look like a gremlin? Jenna: The intense detail on the Jigglypuff hair curl is absolutely unacceptable.Allegra: JIGGLYPUFF. IS. ILLEGAL.Patches: Diego Luna is to Jabba the Hutt as Allegra is to Jigglypuff. What did you imagine Jigglypuff to feel like? Jenna: Like a MARSHMALLOW.Petrana: It’s a balloon Pokémon. That’s its name.Patches: You think Jigglypuff feels like rubber?Jenna: Jigglypuff is CANDY, and we should not give candy hair.Chelsea: So like a Kirby.Petrana: Can you eat Jigglypuff?Jenna: “Here, I made a Peep with a mullet for you.” Get out.Patches: If it was coifed the right way, I’d eat a Peep with a mullet. Moving on, I want to get to the bottom of this uncanny valley line: When is it too much, and why does Pikachu come close to being a grand slam design? For me, it’s the kind of trippy disconnect I felt watching Where the Wild Things. The Wild Things had real bodies and CG faces. Detective Pikachu achieves a similar living-but-not effect with CG. He feels like a puppet, but with living eyes. Maybe they’re Ryan Reynolds’ eyes.Allegra: Ryan Reynolds’ eyes, but blown up to be twice as big!Patches: I should stare deeper and luxuriate in them like a pool of milk.Allegra: Don’t do that.Jenna: My biggest concern about this movie is the Pokémon we DIDN’T get to see in the trailer. There’s a huge number of horrifying variations of beloved creatures that we haven’t yet been inoculated to.Petrana: I am curious enough about seeing the rest of the world that I will get over Pikachu’s eyes.Chelsea: Which Pokémon looked right to y’all?Jenna: Mr. Mime, who looked how I expected and was not bad to look at.Patches: Mr. Mime is my Babadook.Petrana: Charmander and Bulbasaur were also good!Chelsea: So anything without fur. Bulbasaur was also my favorite.Petrana: I’m sure Eevee would’ve been fine too. I think it’s just things that we don’t expect to have lots of fur having lots of fur.Allegra: Greninja also looked okay, but I am less attached to it. I think it’s just been so many years of me loving Pokémon and dreaming of what Pokémon would be like in real life that this is movie was probably never going to sit right with me. It’s not my vision.Patches: What was your vision, Allegra? How have you dreamed of running alongside a real-life Pokémon?Allegra: Something cuter! These are not CUTE. Pikachu gets there, despite the furriness. But those eyes are just … evil. Patches: Maybe he’ll be cuter when he bonds with the boy and they solve a mystery together and everything turns out OK and they become best friends for life. Chelsea: Not to make Allegra mad, but this is very similar to the reactions comic fans have when they first see a new character revealed. \n    Related\n  Patches: Remember when they revealed Iron Man had fur?Allegra: I’m the Comic Book Guy of Pokémon, and I will never apologize.Chelsea: It’s an emotional moment.Allegra: I admit, I’ve actually gotten really teary about this [movie] sometimes. Ultimately, I’m happy that Detective Pikachu exists. It’s a huge deal for Pokémon! This is seriously a dream come true. It’s just not my dream.Petrana: As Jenna said, while Pikachu’s eyes are a little off-putting, I am really dang curious about how they’re going to render some of the others. There’s a lotta fan art out there of photorealistic Pokés, so the bar is set.Patches: Hey, at least they didn’t go with Muscle Pikachu."}