{"id": "Peter Jackson on Fallout, Far Cry and his future in video game movies", "paragraph": "Peter Jackson has always loved games, but after a brief stint in the mid-2000s with Ubisoft’s King Kong, and then a cancelled Halo live-action project, he hasn’t worked directly with the industry. Earlier this month we caught up with Jackson at a press event for Mortal Engines, which he co-wrote and produced for his protégé Christian Rivers, to get a sense of whether he’d like to return to the world of gaming.“I haven’t had much time to play games,” he said. “I’m a big fan of Fallout and I haven’t played the latest one of those [Fallout 4]. I love Far Cry, but I missed the last Far Cry. I was always so busy because when I play those games, I like to have a clear week or so to just play it. Not to rush home at night at 11 o’clock at night and trying to do a bit before I go to bed. I want to be able to savor playing a game like that so I haven’t had time, really the last year or year and a half because I’ve been so busy on the film.”He went on to explain why there was no game based around Mortal Engines, pinning it to the required production time and uncertainty of the film’s success. “They very rarely make a game based on the original movie, you know. You generally get the games on the second film when the first one was successful. Games themselves, as you know, are hugely expensive and they take two years to develop. So there’s no game with this first Mortal Engines film, but I’m hopeful there will be, if this film successful enough to make a sequel, then hopefully a game will arise at that point.”Jackson also spoke about the challenges of making that transition from a movie to a game. “The whole concept of putting similar narratives in games is interesting one because you can’t emulate the plotting and the narrative of the film in a game because of the mere fact that the player of the game dictates the pace and, to some degree, dictates the choices. But the best games do manage to tell quite interesting stories.”He does see a lot of potential in the advancements that games have made in terms of storytelling. “They’ve hired good actors to play characters in games, you know, they have taken a lot more care that bring cinematic performances and in directing. Even some of the cutscenes, which used to be appallingly bad in the old days, now they’re fantastic. Sort of mini-films in themselves. I think there’s a lot of crossover from Hollywood and game making these days.”That said, it does seem like it’ll be a while before Jackson is tied to another video game project. In the meantime, he’s just happy to enjoy gaming on his own time.“It’s more like reading a novel really in a way. It’s more like sitting in savoring a good novel and that you get to control the speed that you go. And if you want to go back over and read a chapter again, you can. Unlike a film, you get to just control the pacing that you’re taking. I always feel sorry for those people that are good at playing games where they sit there and just kill, kill, kill, kill, bang bang. I kind of think, well I need to slow down and enjoy it. I mean, I know I get shot a lot. It means I’ve got to go back and start the level again. But I think, oh well it’s cool. I get to enjoy it again.”"}