{"id": "Fallout 76 impressions: Testing my will to rebuild a wasteland", "paragraph": "The story of Fallout 76 is that we’re rebuilding America. I feel like we’ll end up rebuilding a game instead.This has become a trend. A humongous, much-hyped game ships incomplete — both literally and creatively — then months, or years later, the designers release patch two-dot-whatever, and the critical and fan consensus is that we finally have the game either the studio promise of the fans pre-conceived all along. Fallout 76’s publisher Bethesda Softworks already has weathered this cycle with the maligned-then-praised The Elder Scrolls Online, one of the better and better-supported MMOs running four years after its weak launch. So perhaps they will work their way through this process faster than most.Whatever the case, there is a lot of infrastructure in Fallout 76 upon which to build. Lord knows there is plenty of potential, and plenty of good if you’re willing to see through to it. If this ends up being an enjoyable game, it’ll be because the players willed it into one, despite all the things Fallout 76 currently does unnecessarily to test that will.Still, I’m going to persist with Fallout 76. I’m still trying to piece together what’s keeping me locked into this desiccated West Virginia countryside. Calling Fallout 76 an early access or unfinished game is inaccurate and unfair. It is a finished product. The unimaginative, chorelike events it foists, unwanted on its players, and a storyline in which it is literally impossible to empathize with any other character because they’re all either dead or brainless, means its makers stopped — only for now, one hopes — well short of what could have been done.The biggest roadblock for fans, as we’ve discussed on Polygon, is the assumptions of the franchise. Fallout 76’s creators have opted for a rigid design proscription against human NPCs. This means many of the most familiar and enjoyable components of a Fallout RPG are scrapped in the name of a boring and rote journey. The result is like going to the supermarket for the sole purpose of completing the grocery list, not to enjoy the delicious food you’re cooking for dinner.The real problem with Fallout 76 is it feels like a game that accepted, without ever challenging, the premise that Fallout plus more people is innately a good thing. Instead, it’s a game whose multiplayer highlights the wrong things in the Fallout experience, and whose Fallout experience highlights the wrong things in the multiplayer. Some bread-and-butter experiences of Fallout — and they are still staples in Fallout 76, too — are simply too boring for group play. Hey, want to group up? No thanks, I was going to scavenge for adhesive because I got the gunsmith perk and I want to put all these high-level mod recipes I unlocked on my pipe gun. How about a trade? I’ll pass, I have tons of gunpowder and scrap in reserve and the Scorched drop weapons galore. How about we run a mission together? Well, assuming we’re even at the same point in the storyline, we’re not actually cooperating on a single mission, we’re both running the same tasks concurrently. In the case of yet another training questline (how many are there in this game?) it means someone is usually at the end of the objective, waiting on others and telling them where to find something before they can all move on.There are true cooperative encounters in Fallout 76, they just happen to be the worst part of the game. These are the “Events.” It’s bad enough they’re so unimaginatively designed; it’s worse how they barge in on your schedule if you wander too close to the activation area. Case in point: Early in the game the story takes you up to Morgantown Airport to investigate what happened to the Responders (spoiler alert: They’re dead). But there’s a part of the base that overlaps with a mission goal. Step inside that boundary while you’re searching for someone’s computer terminal and it triggers wave after wave after wave of ammunition-sucking Scorched for a who-gives-a-damn loot reward.I found what I thought to be a scenic location for my CAMP — this is the personal base everyone gets to build up, and while it’s largely the same thing as building a workshop in Fallout 4, it’s still fun and creatively satisfying. It was on a hillside underneath the New River Gorge Bridge. It’s also, I learned too late, right next to the infernal “Fertile Soil” event, which during a prolonged stretch of crafting, building or maintenance will send a bunch of Protectrons and Mister Handies up the hill to bang on my door and tell me about the tent revival on Wednesday night. I seriously have to move my CAMP, which I’m really proud of otherwise, because of that stupid event going on, like jerk neighbors throwing a rager on every day that ends with a “y.”\n    Related\n  Loading into a game at your CAMP, or fast traveling to it, also betrays another unimaginative design decision: There are always enemies on the scene when you show up. I suppose this is to encourage me to build turrets and other defenses, but the crossfire damage from the firefights makes growing crops (to create vegetable starch and therefore adhesive) very difficult. Combat on the whole has never been Fallout’s forte; that has always been hedged and accommodated by other features that, again, accentuated the role-playing game elements instead of those of a first-person shooter. But in an online multiplayer game with no pause, you’re now getting that substandard first-person shooter combat come hell or high water, and thanks to so many glitches, it’s usually the former.A bug that only breaks the sense of immersion or excitement is one thing, and frankly should be expected in online multiplayer games. But bugs that affect or frustrate gameplay are far worse, and Fallout 76 already has plenty. It was agonizing to run across Mothman in the middle of the highway at night, and get myself ready to run or be killed, only for it to sit there doing nothing as I fired repeatedly. Common enemies to super-bosses are all susceptible to batty behavior.The heads-up display frequently sticks when it calls out a hostile. That has left me searching fruitlessly in the area for another feral ghoul, not realizing the health bar on my screen was for the one I’d already killed. Once, when I was working on my CAMP, I heard the interminable snarling and lurching of a Scorched, and it was nowhere. I wasted large chunks of my time trying to find and kill it, believing I was surely going to be sneak attacked by a desynchronization error. That’s because I only know where Scorched are by direct visual contact. The footfalls of a Scorched always sound like they are right next to you, even if they are on a floor above or below, or dozens of meters away out of sight. I never see anything highlighted on my radar, even when they’re screaming and slobbering and bearing down on me. What is even the point of the perception attribute? Nosing around the inside of a trainyard’s wheelhouse with no problem one moment leads to a pitched battle with 12 Scorched the next, probably because they’re respawning on a timer. I’m not above taking my time and trying to avoid or counteract an ambush, but when moving cautiously through a building gets me the same thing as walking in standing straight up with my Pip-Boy light on, I throw up my hands in disgust. The fact all of this trash combat serves missions whose givers are all dead (robbing everything of purpose, much less suspense, before it begins) and who all want you to do the same fetch-this task is, again, an example of the game contriving ways to spotlight its weakest parts.Even without human NPCs — a controversial choice, but one Bethesda Game Studios is sticking by — I was willing to go along with the concept of trying to rebuild and survive in a no man’s land even wilder and more primal than New Vegas or the Capital Wasteland. But the problem is there are plenty of other folks running around, thwarting the sense of isolation that would make some of the despondency I hear in these holotapes more impactful. I had an easier time admitting I am an alcoholic than I did waking up today and admitting to myself that I did not enjoy Fallout 76. I dreaded typing those words. Because I know over the next year I am still going to sink as many hours into this game as I have into the other three entries in the modern takes on the series over the past decade. But in that time I also learned that I can love someone without liking their behavior. Similarly, Fallout 76 will require more patience from lifer fans than any other entry. Yes, Bethesda Game Studios should reciprocate in its post-release support, and highlight the themes and features that have made it so enjoyable — starting with, maybe, NPCs. But speaking for myself, it will require me to not bring my expectations along when I boot up the game. It will require me to do more work, as a player, figuring out what the game really intends to become, and how I can help it get there, if at all. There is still a nagging feeling that there is something worth my time in Fallout 76. It will just take a while longer to discover what that is."}