{"id": "‘What the heck is The Nutcracker and the Four Realms?’ and other burning questions, answered", "paragraph": "As Polygon’s entertainment team geared up for our screening of The Nutcracker and the Four Realms — re-reading the Nutcracker story, rewatching the better Fantasia segments — we discovered that many of our co-workers had no idea what The Nutcracker and the Four Realms was all about.They had been struck, some might say dumb, by posters and trailers for Four Realms. They were intrigued by the combination of a 126-year-old ballet, stunt casting and the promise of a CGI extravaganza the likes of which only a modern Hollywood fantasy film can provide. We took down their questions and now provide you with the fruits — sugar plums, specifically — of our research. You might need it, too.Yes. Directed by Lasse Hallström and Joe Johnston, The Nutcracker and the Four Realms is Walt Disney Studios’ big holiday-themed release of the year, based on Tchaikovsky’s The Nutcracker ballet. It stars Mackenzie Foy as Clara, Keira Knightley as the Sugar Plum Fairy, Morgan Freeman as Drosselmeyer, Helen Mirren as Mother Ginger, Jayden Fowora-Knight as the Nutcracker and ballerina Misty Copeland as the Ballerina Princess. The movie runs around 99 minutes, which is around the length of a performance of the ballet. Faithful!Hallström (What’s Eating Gilbert Grape?, Chocolat) wrapped initial production in January of 2017. But almost a year later, in December 2017, Disney announced that Joe Johnston (Captain America: The First Avenger, The Rocketeer) would oversee a “significant shoot of additional photography” based on new script material written by a new screenwriter, and lasting 32 days. There didn’t seem to be any bad blood over the reshoots. Hallström was unavailable to direct due to scheduling issues, and planned to oversee post-production. But enough changed that both men share a co-directing credit in the final billing.\n    Related\n  Originally, yes. Disney’s upcoming live-action Mulan remake was scheduled to premiere on Nov. 2, but the company has since pushed the movie back more than a year, until March 27, 2020. In July 2018, Nutcracker took Mulan’s former spot. Barely. Four Realms is about a young girl named Clara whose well-off London family — her father, older sister and younger brother — is struggling with getting through their first Christmas after the loss of Clara’s mother. While attending a ball thrown by Clara’s godfather, the genius clockwork engineer Drosselmeyer, Clara’s search for the secret of her mother’s last gift, a locked mechanical egg, leads her to discover four secret magical realms where she is a princess. She meets a Nutcracker, a Sugar Plum Fairy, a Mouse Prince and Mother Ginger. In The Nutcracker ballet, Clara is a young girl celebrating Christmas with her family, and her mysterious godfather, the toymaker Herr Drosselmeyer. Her adventure begins near midnight on Christmas Eve, when she watches her Christmas gift from Herr Drosselmeyer, a wooden nutcracker, come alive to battle the Mouse King, a fearsome multi-headed rodent. Clara saves the Nutcracker by hurling her slipper at the Mouse King, killing him. The defeat transforms the Nutcracker into his true form: a handsome prince. In gratitude, the Nutcracker takes Clara on a trip to his kingdom of candy people. That all happens in the first act, and the second act is a series of loosely “international”-themed dances, with regions of the world represented by different kinds of candy or food — chocolate for Spain, candy canes for Russia, etc.The Four Realms in Four Realms are a combination of references to the second act of The Nutcracker ballet and the Nutcracker segments that that appeared in Disney’s 1940 animated film, Fantasia. The Realm of Candy and the evil Fourth Realm (spoiler: it’s the “Realm of Amusements”) are references to Tchaikovsky’s candy and clockwork toy motifs. The Realm of Flowers and the Realm of Snowflakes correspond to the animated flowers and snowflakes that visualized the music of Tchaikovsky’s “Russian Dance,” “Dance of the Flutes,” and “Waltz of the Flowers.” The ballet version of “The Nutcracker” is based on a short story by Alexandre Dumas entitled “The Story of a Nutcracker,” which in turn is based on E.T.A. Hoffmann’s “The Nutcracker and the Mouse King,” first published in 1812. In The Nutcracker and the Four Realms, the character of the Nutcracker shares a surname with Hoffmann (though it’s spelled Hoffman in the film’s promotional material). And in Hoffmann’s original short story, the young girl in the lead was named Marie, though Dumas’ version changed it to Clara. In Four Realms, Clara’s mother is named Marie — a little nod to the original. To the first question: Not really. To the second question: Not at all. Characters don’t sing in The Nutcracker and the Four Realms, and while Tchaikovsky’s Nutcracker orchestrations are recurring motifs, there’s nearly as much original music in the soundtrack as there is Nutcracker melodies. Outside of Misty Copeland’s two cameos, and a sequence during the end credits, there’s barely even any dancing, let alone ballet. Sort of? The Mouse King is a giant pile of mice that forms the shape of a man-sized mouse, and is led by the Mouse Prince. What’s really weird about the Mouse King is that it doesn’t dance. At the company’s D23 Expo in 2017, when the movie was still mid-production, Disney hyped up the participation of dancer Lil Buck. Buck has gained renown for performing the street dance style of jookin — characterized by smooth footwork and pantomiming — to classical music. At the time, Disney said that the production was using motion capture technology to capture Lil Buck’s movements and create a “style of dance that defines the character” of the Mouse King. But in the final movie, the Mouse King doesn’t dance. He just fights enemies and sometimes spooks the film’s heroes, Clara and the Nutcracker. No. Despite how much The Nutcracker and the Four Realms seems tailored to reach the same audience as Tim Burton’s Alice in Wonderland, it doesn’t make any direct sequel setups, and it doesn’t have an end or mid-credits scene. As far as the two Polygon staff members who have seen The Nutcracker and the Four Realms can remember, no nuts appear in The Nutcracker and the Four Realms. The movie’s Nutcracker always appears as a living being, the same size as Clara. There is a bit where Clara’s little brother receives a nutcracker for Christmas, but he does not crack any nuts with it during its brief appearance. "}