{"id": "RimWorld colony simulation leaves early access with a full first-version release", "paragraph": "RimWorld, the ambitious colony simulation from the small team at Ludeon Studios, has exited early access. The title now sells for $34.99 and is compatible with Mac, Linux and Windows PCs. You can also purchase the game on Steam.The game was available for players to purchase at a discount during early access, and according to the team, they have already sold more than one million copies.The colony simulation genre is a fairly small where hardcore titles, such as Dwarf Fortress, tend to loom large. In RimWorld, players take on the role as the overseer of a threesome of colonists crash-landed on an alien world. Like other games in the genre, players do not have direct control over these colonists. Players can issue orders, set priorities or otherwise suggest tasks for them to accomplish, but they lack direct influence over their in-game actions. Instead, each colonist has a simulated set of wants, needs and desires that will impact their performance. \n    Related\n  RimWorld differentiates itself by its setting, which, developers say, was inspired by not only the Firefly TV show, but also the epic scale of the Warhammer 40,000 and Dune universes. The team at Ludeon also stresses that it is very intentionally built to be a storytelling machine. Each game has its own unique narrative that is controlled behind the scenes by a sophisticated AI.Development on RimWorld has been ongoing for the past five years and led by Ludeon founder Tynan Sylvester, whose resume includes work on BioShock Infinite. The project made headlines in 2016, after one writer questioned its portrayal of gender and sexuality. At the time, Sylvester called such accusations a “moralistic ... witch hunt.”Sylvester took the opportunity of the game’s release earlier this week to take a break from working on the game, as well as to inform fans about his team’s next steps.“As for the future,” Sylvester wrote, “I plan to continue updating the fan-made translations and creative content. There will also likely be a bug-fixing patch. Beyond that, though I won’t promise anything and nothing’s decided, I can think of a variety of interesting directions to go with the game. For today, though, I’m just celebrating.”"}