{"id": "The best gaming headsets", "paragraph": "Competitive multiplayer games like Fortnite, which require clear voice communication and positional audio, and the rise of the Nintendo Switch, which has mediocre internal speakers, have boosted the video game headset market. But the sheer variety of options can be intimidating. We’re here to help.Over the past two years, Polygon has solicited samples from many of the biggest names in the industry, building out a huge library of test units. Over the past month, I’ve put them all to the test, playing everything from experimental indie games to big-budget AAA shooters. I sought the very best headphone solutions for each of the four major platforms: Mac and Windows PC, Nintendo Switch, PlayStation 4, and Xbox One.First, a note about my selection criteria. The goal was to find the best headphones to match the unique capabilities of each platform. For the current-generation consoles from Sony and Microsoft, the goal was to find a wireless solution that paired well with the systems’ wireless controllers. For Switch, I identified headsets compatible with that platform’s unique mobile app-based chat features. On PC, I elected this year to focus attention on the new breed of digital-to-analog converters.Read on for Polygon’s picks for the best gaming headphones on the market today. We hope you enjoy the results.Polygon Essentials is a collection of persistently updated lists of the best of the best games for each platform — from the hardware’s launch to its end of production — as well as the best entertainment across virtually every medium. For folks new to a platform, think of this as a starter kit. For long-term fans, consider it a list of what to play or watch next. We’ll be updating these lists often, with entries listed in reverse chronological order. To see a collection of other titles we recommend that might not have made the Essentials lists, check out Polygon Recommends.Vox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. For more information, see our ethics policy.Last year’s winner was the Astro A50. That pair provides excellent sound quality and a host of handy features like an optical pass-through — useful if you own a high-end receiver. However, after using that headset over the last year, a number of frailties in its design have turned up. First, the battery life has not lived up to expectations. Often the headset will completely run down after just a few days of sitting around unplugged. It’s also among the heaviest wireless sets that I’ve tested, which has led to some uncomfortable late-night gaming sessions.For those reasons, this year I’m recommending the SteelSeries Arctis Pro Wireless instead. This new headset is more than a match for the audio quality of the A50s, but is smaller and lighter. The $329.99 kit features a replaceable onboard battery that’s good for a week’s worth of heavy gaming. Best of all, the Arctis Pro Wireless comes with two of those batteries. One goes in the headset, of course, while the other one sits charging on standby inside its Apple TV-sized transmitter.This offering from SteelSeries bundles up some of the best features of the Siberia 840, which made our list last year in the multimedia category but is no longer in production. The Arctis Pro Wireless provides excellent surround sound for gaming, making it a valuable asset for action-heavy shooters like Destiny 2 and Call of Duty: Black Ops 4. It is also one of the very few gaming headphones on the market to support DTS Headphone:X 2.0, which is designed to simulate the sound of modern 11.1 movie theaters. I’ve taken to using it exclusively for viewing movies at home. Just be sure to turn off the volume limiter in the settings, which the manufacturer says is required in some international markets, to boost its power.The Arctis Pro Wireless features an optical audio-out, along with hooks for standard 3.5 mm input and output jacks. That means it’s compatible with your Nintendo Switch while it’s docked with your TV. Finally, the headset also features integrated Bluetooth support, meaning it works with the Switch’s mobile app at the same time. That makes it compatible with your laptop and your phone, too. The range is spectacular thanks to a 2.4 GHz transmitter. It’s by far the most feature-rich device in our round-up.Last year, the Plantronics Rig 800HS surprised me with its incredibly high-quality stereo audio and a sub-$150 price tag. After a full year of consistent use, it’s become my go-to solution for extended sessions of Destiny 2 and Red Dead Redemption 2 on the PS4.Simply put, the Rig 800HS is always ready to go. The battery lasts an extraordinarily long time: In the past month I’ve only had to charge mine up once. What’s more, it tends to hold that charge much better than the other headsets I’ve tested. I put the Rig 800HS aside for several months over the summer, and was astounded to find that when I fired it back up, it was still fully charged. It’s a remarkable feat for a device that is so small and so incredibly light.One drawback with the Rig 800HS is its minimalist construction. Instead of adjusting the fit with a traditional sliding mechanism, to change the size of this headset you must physically remove each of the ear cups — speaker and all — and insert them into the next open slot on the plastic headband. That makes the transition to the next size up or down fiddly, with each assembly left tethered to the headband by a thin, fabric-covered wire. I haven’t been so nervous messing with a piece of kit since the last time I cleaned the sensor on my digital SLR camera. But if you take your time and read the instructions, you shouldn’t have any problems.The Rig attaches to the PS4 via a matchbook-sized dongle that requires both USB and optical connections. As a bonus for dual-console households, the headset that comes with the Rig 800HS is also compatible with the dongle from the Rig 800LX that Plantronics makes for the Xbox One. So, if you want to pick up both, you can platoon your two pairs of headphones between both consoles.The SteelSeries Arctis 3 Bluetooth returns this year as the best headset solution for the Nintendo Switch. SteelSeries is the only headset manufacturer we’ve found making headsets that will physically connect to the Switch console while also pairing with a smartphone or tablet so that you can run Nintendo’s wacky companion app at the same time.From last year’s impressions piece by Ben Kuchera:The main draw is the fact that it can handle audio through 3.5mm cables as well as a Bluetooth connection to your PC or mobile device at the same time. This allows you to connect the headphones to your Switch for in-game audio while you’re connected to your smartphone through Bluetooth for voice chat on the Switch, or you can connect the headphones to your PlayStation 4 or Xbox One using the cable while piping in sound from another Bluetooth source if you want to stay on Discord or listen to a podcast.You’ll need to mix the audio levels on the source if you’re mixing things this way however, as the headphones themselves only come with a single volume knob. [...]Sound is clear and and detailed, and delivers the sort of performance you expect for the price and feature set. The cushioning and fit are comfortable enough to wear for extended periods of time without any discomfort. You may need to make a small adjustment to the velcro on the “ski goggle” headband when you first get the headphones, but I’ve passed the hardware around my friends and family and have yet to hear a complaint.This year’s version of the Arctis 3 Bluetooth is much the same as last year’s, with some modest enhancements to the microphone and the comfort of the earcups. The price has also dropped to $99.99.While the SteelSeries Arctis Pro Wireless mentioned above will also do the job, at $329.99 it costs more than the Switch itself. It also comes with plenty of bells and whistles that Nintendo’s console simply isn’t capable of utilizing. But, if you own both a PS4 and a Switch, then that more capable model should be your first choice.The only redeeming quality of the Hori Splat and Chat headset is the cable it comes with. It allows you to plug into the 3.5 mm jack on your Nintendo Switch and a smartphone or tablet at the same time. There’s also a handy crossfader to adjust the balance between the two. You can find it online for $29.99 and, if you elect to purchase one, we recommend tossing the included behind-the-head headphone and microphone combo directly in the trash. I take that back, actually. You could keep it on hand in case you need to quickly slap together some Splatoon 2 cosplay.Otherwise, plug in your headset of choice and you’re good to go. The Kingston HyperX Cloud earbuds, specially made to go with the Nintendo Switch, are a nice choice and will work well even without the Splat and Chat cable, thanks to a right-angle 3.5 mm adapter.Last year, I was a bit flummoxed by Sennheiser’s decision to send along an early model of its new GSX 1000 Gaming Audio Amplifier. There wasn’t anything on the market to compare it to, so I put it aside while testing other headphones, and later elected to include it as an honorable mention in the PC category. In the year since, I’ve discovered that it’s secretly the best way to listen to video games, and a sign of things to come for the PC gaming headphone industry as a whole.The GSX 1000 is a combination amplifier and digital-to-analog converter (DAC). The amplifier bit is fairly straightforward. The little black box attaches to a USB port on your computer, and pushes a bit more power to your headphones than would otherwise be available. If your headphones can handle that input, it has the effect of making the sound in your games richer, with more character and definition even at lower volumes.The DAC bits inside perform an even more important function, filtering your computer’s ones and zeros into an analog audio signal. DACs are integral components in everything from your smartphone to your computer itself. With traditional PC gaming headsets, they’re usually buried inside a tiny, in-line dongle (like the one in the Kingston HyperX Cloud Revolver S). They also work in tandem with dedicated software that runs in the background on your desktop (as utilized by last year’s winner, the Sennheiser PC 373D).Sennheiser’s GSX 1000, on the other hand, has more in common with audiophile-grade preamps than it does with anything in the gaming space that’s come before. The closest approximation is a dedicated internal sound card, but those require you to crack open the case of your computer and aren’t compatible with modern gaming laptops. The bottom line is that you can connect virtually any pair of headphones to the GSX 1000, and experience high-quality 7.1 surround sound on your Mac or Windows PC.Of all the headsets I tested, the GSX 1000 provided the very best listening experience on the PC. Even compared to the runner-up, which also uses a dedicated DAC, the difference is night and day. The sound stage presented in Battlefield 5, for instance, is deeper, richer and wider than what I thought was possible. Sennheiser’s virtual 7.1 mix and EA DICE’s own, custom 3D binaural audio mix for headphones both sound incredible. But it’s not just AAA games that benefit from the capabilities of the GSX 1000. The soon-to-be-released indie platformer Gris, with its stirring soundtrack from composer Marco Albano, sounds like a million bucks in stereo.The other benefit of the GSX 1000 is that it removes the need to regularly wade into your computer’s dedicated sound settings. Once you set it up, the included OLED touchscreen provides access to all the options that you need. It’s also motion-sensing, with a built-in dimmer that responds when you hover your finger over the control surface. The four LED lights at the corners aren’t for show. Each one is a hotkey for a different custom programmable preset. It also includes a 3.5 mm output, so you can easily toggle between a headset and a pair of stereo speakers.The GSX 1000 isn’t perfect. It could use a proper equalizer, rather than the presets it comes with. Many users have complained in online forums that it compresses microphone audio a bit more than they would like, while others bemoan that it simply isn’t powerful enough to drive audiophile-grade nongaming headphones. But as far as the depth and richness of the sound and the acuity of the positional audio, I haven’t found anything in the gaming space that even comes close. Paired with the virtually bulletproof and obscenely comfortable Kingston HyperX Cloud Alphas, which are known for their lack of distortion at higher volumes, you can’t go wrong.The SteelSeries Arctis Pro + GameDAC features virtually the exact same headset as the wireless option included as my pick for the best PS4 headset above, with one exception. This $249.99 kit includes a stand-alone DAC.As described above, a dedicated DAC does the heavy lifting of converting your computer’s ones and zeros into an analog signal, taking some of the strain off your CPU and adding richness to the audio. But the GameDAC is special. It’s the first ever dedicated gaming DAC to support high-definition audio, defined as 96 kHz, 24-bit sound. That allows you to listen to better than CD-quality audio in games that support it, like Wolfenstein 2: The New Colossus. The GameDAC goes a step further by including the ESS Sabre 9018 chip in its design, a much sought-after piece of tech among audiophiles. I’m not a huge music fan myself, but if that’s something you’re into, then the GameDAC should be at the top of your list.As far as sound quality, the Arctis Pro + GameDAC provide excellent positional audio for gaming. My only complaint is that the cables feel a little cheap. They could also be a heck of a lot longer. Here’s hoping that gets improved in the next iteration but, for now, it’s a small compromise for such excellent sound quality.The Plantronics Rig 800LX remains our top pick this year for the Xbox One. We already showered the Plantronics Rig 800HS for the PS4 with praise above, thanks to its expansive sound and long battery life. The deal is even sweeter on Xbox One, since this model comes with a free code to unlock Dolby Atmos, a defining audio feature of Microsoft’s console.In fact, the Xbox One is the only console that supports Dolby Atmos, which takes the traditional 5.1 and 7.1 audio formats and adds a height layer. Now, instead of hearing other players to your left or right, you can actually tell if they’re above or below you as well. It’s effective in games like Overwatch, but the list of compatible games is very limited.The Rig 800LX is always ready to go. The battery lasts an extraordinarily long time: In the past month I’ve only had to charge mine up once. What’s more, it tends to hold that charge much better than the other headsets I’ve tested. I put the Rig 800LX aside for several months over the summer, and was astounded to find that when I fired it back up, it was still fully charged. It’s a remarkable feat for a device that is so small and so incredibly light.One drawback with the Rig 800LX, as I mentioned with the Rig 800HS above, is its durability. Instead of a traditional sliding mechanism to adjust the fit, this one’s a little more fiddly; it involves taking it apart and putting it all back together again. You could easily shred the cables and destroy it. But if you take your time and read the instructions, you should be good to go.The Rig 800LX is compatible with the Xbox One, Xbox One S and Xbox One X, and requires only a single USB connection. In fact, it’s the exact same model that we reviewed last year. In the interim, Plantronics has focused its attention on a series of new wired solutions, which are also excellent devices by any measure. But if your controller is wireless, why shouldn’t your headphones be as well? Here’s hoping Plantronics dedicates more resources to the wireless side of the house, and that the 800LX and 800HS both get a refresh for next year.The Rig attaches to the Xbox One via a matchbook-sized dongle. As a bonus for dual-console households, the headset that comes with the Rig 800LX is also compatible with the dongle from the Rig 800HS that Plantronics makes for the PS4. So, if you want to pick up both, you can platoon your two pairs of headphones between both consoles.I was surprised not to see a headphone hardware refresh from Astro Gaming this year. Instead, the company announced a customizable wireless controller for the PS4. Perhaps that has something to do with its transition from being an independent manufacturer to becoming part of Logitech. Nevertheless, I tested Polygon’s old pair of Astro A50s up against newer solutions from companies such as Kingston and Turtle Beach. I still think the Astros sound better.The A50 for the Xbox One and PC is plug-and-play compatible, and features Dolby 7.1 surround sound. The sound stage is big, and the multiple channels are clear and distinct all across the spectrum. Aside from rock-solid audio quality, the A50 has a number of excellent quality-of-life features. The included base station features wireless charging. Just plunk down the headphones, and they’re ready to go the next time you put them on. There’s also a USB port, so you can charge them while you play.The Astro A50 for Xbox One and PC retails for $299.99, which feels a little high two years after its release. The biggest differentiator for the A50 is the game/voice balance toggle, which Astro calls a MixAmp. It’s one massive toggle switch that occupies the entire right side of the headset. That means no more fumbling for a dial or a dongle when you’re in the middle of a raid or a firefight.The base station also includes optical pass-through, so this headset works in concert with a dedicated receiver. You can even connect your console and a PC at the same time, and flip between the two with a toggle switch. LEDs show the battery’s charge at a glance, which you’ll want to keep tabs on. A 3.5 mm auxiliary input on the base station means you can blend in sound from another source on top of the game and chat audio, or use the Astro A50 to transmit wireless stereo sound from a docked Nintendo Switch (so long as all other inputs are turned down or off).Truth be told, however, after living with them both for the last year, the A50s sound just about as good as the Rig 800LX — which costs half as much and has a much longer battery life. Meanwhile, I’ve had some issues with the A50s running out of power during long play sessions, and simply not holding a charge when not docked in the charger.The A50 is also available in a model compatible with the PS4 and PC. Both models cost the same. "}