{"id": "Does Red Dead Redemption 2 contain a hidden reference to developers’ crunch?", "paragraph": "Thanks to a flurry of recent media reports, Red Dead Redemption 2 maker Rockstar Games has gained notoriety in a very unflattering light: the company’s culture of crunch during the development of its biggest games, including the massive new open-world Western and its 2010 predecessor. Now it appears that the developers who labored to produce Red Dead Redemption 2 may have snuck a reference to their working conditions into the game.Arthur Morgan, the game’s protagonist, starts out with a six-shooter known as the Cattleman Revolver. He later gains the ability to dual-wield sidearms such as revolvers and sawed-off shotguns. At that point, the player can visit a gunsmith and buy a second Cattleman Revolver to give Arthur twice the stopping power. While browsing the gunsmith’s catalog — which is a literal book that Arthur flips through — Reddit user obZenDF noticed that the page advertising the Cattleman Revolver had some interesting wording, considering the stories we’ve been reading about Rockstar.“A sidearm for many years of the US Army, it is manufactured at a factory we own and control in Worcester Mass [sic],” the revolver’s description reads. “It is made by skilled laborers who work tireless hours each week and on the weekends for little pay in order to bring you the finest revolver in the field today.”In multiple media reports published around the Oct. 26 launch of Red Dead Redemption 2, developers across Rockstar’s eight studios around the globe — many of them speaking anonymously for fear of reprisal — said they were sometimes asked to work many extra hours above the typical 40-hour workweek in order to finish the game. Aside from “mandatory overtime” on nights and weekends, Rockstar employees described feeling that there was an expectation at the company that people should stay late at the office, sometimes just for appearance’ sake.The Cattleman Revolver’s description in Red Dead Redemption 2 may just be some jokey flavor text, the kind that is peppered throughout both the Red Dead Redemption and Grand Theft Auto franchises. The gun in question is modeled after the Colt Single Action Army, which was the standard service weapon for the U.S. military from 1873-1892; Rockstar often imbues its games with realism and humor by designing items such as weapons and vehicles that are clearly inspired by real-world objects.\n    Related\n  But the more notable part of the sentence about the Cattleman Revolver’s manufacturing is the mention of the city of Worcester, Massachusetts. Worcester is in the center of the state, and as Eurogamer points out, it is about an hour’s drive southwest of Andover — the home of one of Rockstar’s subsidiaries, Rockstar New England. If you were staying late at the office toiling away on a video game and wanted to call out your working conditions by sneaking a reference to them into the game, you probably wouldn’t be as obvious as to name the city that your studio is actually located in.It’s worth noting that three current employees at Rockstar New England who spoke to Kotaku had mostly positive things to say about the studio. One said they were “working very reasonable hours,” although Kotaku reported that another person who said they loved working at the company noted that they’d been “told to work 55- to 60-hour weeks during crunch over the past year.” Either way, there is no doubt that thousands of “skilled laborers” around the world worked “tireless hours” to bring Red Dead Redemption 2 to fruition.Rockstar has not responded to Polygon’s request for comment on the Cattleman Revolver’s in-game description. We’ll update this article with any information we receive."}