{"id": "Axis & Allies & Zombies reinvents the classic board game with one small tweak", "paragraph": "Axis & Allies & Zombies, first unveiled here in June, is finally on the shelf at your friendly local game store and on Amazon. So how does the classic game of World War II strategy hold up with the added weight of the undead? Amazingly well, it turns out. The $40 package provides for hours of entertainment and has tremendous replay potential, aside from one big issue with the rulebook itself, Created by Larry Harris and first published in 1981, Axis & Allies is practically the model for the modern grand strategy genre. Two-to-five players take on the roles of Stalinist Russia, Nazi Germany, the United Kingdom, Imperial Japan and the United States in a dice-driven battle for global domination. The game famously models industrial production, logistics and scientific advances using the same six-sided dice used to fight its battles. Each of its units have different characteristics, leading to dynamic strategies and exciting twists of fate. Despite its notoriously lengthy playtime of anywhere from four-to-five hours, the game is study in balance and design minimalism.Axis & Allies & Zombies doesn’t do all that much to change up the rules of the classic. Instead, it bolts a few new rules on top.Every time an infantry unit dies it turns into a zombie and gets replaced with a unique miniature on the board. Thanks to a special deck of cards, zombies can also spawn randomly all over the map, so it makes sense that miniatures are sculpted to include both soldiers and civilians. At the beginning of their turn, the player pulls a card from a deck filled with random events, which can include things like technology upgrades, or buffs and debuffs to their forces or their economy for that turn.In practice, the undead tend to loiter on the battlefield during and after engagements. That complicates the decision to invade enemy territory quite a bit. Determining if you will have enough manpower to overcome the enemy forces is pretty straightforward. Figuring out if you’ll have enough men and machines that survive the conflict left to actually hold the territory against the zombie hordes is something else entirely.During our game, most of eastern Russia became a frozen wasteland teaming with the undead. The side effect was that Japan, already smarting from its naval losses in the Pacific, was not able to press its advantage on the Asian mainland. Meanwhile, the United States narrowly avoided disaster when zombies sprang up in South America. That outbreak delayed the Arsenal of Democracy from traveling across the Atlantic to aid the United Kingdom. That left the U.K. to assault Normandy on its own, only to be pushed back into the sea not once but twice by the reanimated corpses of German soldiers. Later, the Japanese and American strategy of “island hopping” would grind to a halt as several of those islands, including the Philippines, were completely overtaken by the undead.As a result of the disruption by the zombies, new and unusual strategies were put into motion. Japan invaded Australia, and then fortified it with armor and artillery. That presented two targets for the advancing American fleet, but also raised the specter of another protracted battle against the undead if things went wrong. After the botched invasions of Fortress Europe, the U.K.’s only sizable land army was left stranded in North Africa. Before long, they began to set out on an arduous forced march over the Suez Canal, through the Middle East, and into Europe through the Caucasus. These are things that would rarely, if ever, happen in a regular game of Axis & Allies.Overall, the zombies themselves don’t take all that much effort to maintain. They’re largely automated, with each player controlling those inside the territories they control on their turn. At the beginning of your turn, zombies have a chance to inflict damage on your troops. That means placing one or two infantry units on the board is no longer a guaranteed way to retain control. Games of Axis & Allies can tend to drag on as analysis paralysis kicks in. With Axis & Allies & Zombies, however, the game has a sort of built-in doomsday timer. If the total value of zombie-controlled territories adds up to 25, it’s game over. That has the benefit of giving the game an extra sense of urgency.The manual inside the game box is a mishmash of the best rules from all the previous versions of the game, and it does a great job of teaching you how to play Axis & Allies. It’s less useful, however, at teaching you how to play Axis & Allies & Zombies. The only gripe that my group had came early on, as we tried to sort out how to actually remove the undead from the board. What the manual is lacking is an expanded walkthrough of a single battle that includes zombies in the territory being attacked. Instead of referring back to that walkthrough — which doesn’t exist — we were forced to string together inferences from elsewhere in the manual to formulate a basic understanding. It’s not ideal, and honestly, all it would take to clear the issue up is just a single page of information. Perhaps that’s something that will be inserted into the box in future printings.The product itself is extremely well made. Inside the box are plenty of custom dice to fight the game’s battles and over 200 plastic miniatures, with unique variations for every faction. There’s no assembly required, and the game comes ready-to-play out of the box. Once you’re finished, the pack-in even has divots to keep all the bits organized. As a bonus, there’s also a set of cards that will allow you to add zombies to your copy of Axis & Allies 1942, a slightly more complex version of the original game.Overall, Axis & Allies & Zombies comes highly recommended. It’s simply a tremendous value and a novel new engine for generating alternate history at the table."}