{"id": "Spider-Man update addresses the game’s puddle controversy", "paragraph": "Today’s update for Marvel’s Spider-Man on PlayStation 4 adds a bunch of new things: new game plus mode, three new suits for Spider-Man and some helpful improvements to the game’s photo mode. It also adds puddles — in the form of new stickers that you can stick onto your shots in photo mode, adding back some sorely missing pools of water to the game.The 4.7 GB update for Spider-Man, which Insomniac detailed earlier this week, is available now. Shortly after its release, Insomniac Games’ user interface/user experience lead Gil Doron tweeted about its most amusing addition:We have a new patch today! Not only do we have NG+, but we added a bunch of stuff in Photo Mode, including:stickersframesrotation for stickersshortcut to Photo Mode with the D-Pad......and I fixed this for you :) pic.twitter.com/SW7Jxrxab6The addition of new puddle stickers is Insomniac’s in-game response to accusations that the developer had “downgraded” Spider-Man’s visuals between its showing at E3 2017 and the game’s release in September. A Reddit thread (with more than 30,000 upvotes) and tweets about the game’s visuals, primarily focused on the shrinking of a very large puddle, rankled some PS4 owners who worried that Spider-Man’s final product wouldn’t live up to earlier previews of the game.“It’s just a change in the puddle size,” Insomniac said at the time, “there’s no downgrade at all.”Insomniac community director James Stevenson later addressed other accusations that the game had degraded visually during its development, responding to a tweet, “I am telling you I talked to the technical and engineering and art staff, and looked at the live code of this from the final build. There was NO DOWNGRADE.”That mildly roiling controversy is, now, ultimately every Spider-Man player’s gain, as they have new stickers to slap onto photos they otherwise wouldn’t have."}