{"id": "You need to play Tetris Effect in VR", "paragraph": "Tetris Effect on PlayStation VR had a profound emotional impact on me during a recent marathon session, and the experience left me with more questions than answers. Why was I responding so strongly, and with such emotional force, to a game in which you line up blocks in order to make them disappear? Why was this happening when playing in virtual reality, and why couldn’t it be replicated as strongly when I tried the “flat” version of the game on a standard display?I have a few theories, but words are only going to be so helpful with this one. If you have the opportunity, please try to track down Tetris Effect in PlayStation VR and give it a shot. I don’t think you’ll be disappointed. Think of a standard weekday — whether it’s good or bad — in terms of friction. Oversleeping adds friction, since you then have less time to get ready for work or school. Being out of coffee or a favorite breakfast adds friction, leading to either less energy or even a headache due to caffeine withdrawal. A day can quickly become horrible before it even begins. \n    Related\n  But when friction is removed? It all feels like it’s going your way. The coffee is right there. The traffic lights turn green right as I pull up. My laptop is fully charged, and the writing comes easily. Good days, the days where everything is moving in my direction, are defined by a lack of friction. Most days are a combination of good and bad moments, but pop culture has given me an effective way to communicate what it feels like when everything is going my way: Everything is synced to a beat. If a director or editor wants to show a character being in complete control of their environment, they bring in a musical selection and match the rhythms of the beat with the editing. Edgar Wright took this to the extreme in Baby Driver, a movie that features a soundtrack that the titular character uses to organize and adapt to his reality. Take a look:Tetris Effect — along with past games from producer Tetsuya Mizuguchi, like Rez and Lumines — puts me into that ecstatic state of flow by syncing the soundtrack to the visuals, but that’s just the first part of the equation. The actions on the screen, which I control, are also locked into how the game looks, sounds and feels. Doing poorly means that you’ll be booted out of a song or level without finishing it, but doing well allows you to lose yourself in the experience. The world is working with you, helping you to see the right path forward. And when you find it? You’re rewarded by every tool the game has at its disposal to celebrate your work. Everything I’m doing suddenly feels right, as if I were conducting the rhythm of the universe through puzzle pieces. While previous Tetris games allowed me to impose order on chaos by lining up the pieces, Tetris Effect presents a spectacle where playing well means that I impose order on all the input coming into my senses. The friction is removed. Everything in my virtual life is suddenly going my way. This sense of harmony is not something you get from many other games, and the only other examples I can think of were also developed by Mizuguchi.  Tetris Effect feels good when played on a standard screen, but that sense of harmony and “rightness” is multiplied in VR. The sprays of pixels and particles, which cover the screen when you do well, now move across your entire field of view. The shapes and animations that were once confined to the screen now exist in 3D space, wrapping around me completely. The window into a world that I can make harmonious expands, until it feels as though I exist within that world. There can be no distractions, because I can only see and hear the game. It’s overwhelming, in a positive way, and the experience can’t be delivered through any other medium. Tetris Effect, when playing on the PlayStation VR, delivers harmony on command. That’s a heavy thing for a game to offer, but it’s a big reason why Tetris Effect is one of my favorite games of the year. I’m not sure I would feel the same way had I only played it on a standard TV. There’s no “right” way to play any game, despite what the internet might tell you. But you should give this a shot if you can.The VR version of Tetris Effect is much more effective at delivering the sort of euphoria the game seems designed to evoke. And who doesn’t need a bit of euphoria on the days where nothing else seems to be going your way?"}