{"id": "Red Dead Redemption 2 companion app now live on Android, iOS", "paragraph": "Rockstar Games will release a companion app for Red Dead Redemption 2 on Oct. 26, the same day the full game hits stores, that will deliver “real-time interactive information” to Android and iOS devices.The Red Dead Redemption 2 app will let players view the game’s world map, and set waypoints and mark areas of interest as they explore, according to a post on Rockstar Games’ website. The app also promises real-time information on Arthur Morgan’s health, stamina and other stats, which Rockstar says will aid players who prefer a HUD-less game presentation.Players can also examine Arthur’s in-game journal, which is updated with new entries and illustrations over the course of the game’s story, in the app. It will feature stat tracking and a digital game manual, too.Red Dead Redemption 2 will hit PlayStation 4 and Xbox One on Friday, Oct. 26. Players will be able to download the companion app from the Apple App Store and Google Play Store the same day.Update (Oct. 26): Red Dead Redemption 2’s companion app is now live on the App Store and Play Store, but you might be having trouble finding it by searching for the game’s title. That’s because the app is listed under the title “RDR2: Companion” — it doesn’t come up if you simply search “Red Dead Redemption.”We’ve got you covered with direct links to download the Red Dead Redemption 2 companion app on Android and iOS. It’s a big one, weighing in at 193 MB on Android and 211.7 MB on iOS. In case you’re wondering about what kinds of in-app purchases it offers, customers can pay $9.99 to unlock a full strategy guide, the Red Dead Redemption 2 Complete Official Guide by Piggyback. (The physical versions are more expensive.)With Red Dead Redemption 2 having launched less than 11 hours ago, there aren’t vast numbers of people who have tried RDR2: Companion yet — somewhere north of 10,000 users have installed it on Android so far. But there are already a number of complaints in the app reviews from people who are frustrated that the Android version isn’t compatible with certain tablets, including relatively new ones such as a Samsung Galaxy Tab from 2017. (It seems like the app should work with at least some Android tablets, since the Play Store listing features both tablet- and phone-sized screenshots.)A Rockstar representative told Polygon that the company plans to support most modern Android devices with RDR2: Companion, including tablets, and is regularly rolling out updates with additional compatibility."}