{"id": "‘I’m Already Tracer’ critics tear teens down just for having fun", "paragraph": "Tik Tok, the lip-syncing video app that has surged to popularity in recent weeks, often finds itself as the subject of derision on YouTube “cringe compilations.” Across the internet, many content creators have made it their duty to collect and mock some of Tik Tok’s more earnest uploads, featuring teens singing and dancing along to all kinds of songs. The latest Tik Tok clips to flood into the limelight are renditions of what’s been dubbed “I’m Already Tracer.” The viral hit, an Overwatch-themed clip from a fan-made song released over a year ago, has become one of Tik Tok’s biggest of late. On other areas of the web, however, it has garnered infamy, as its tenuous connection to video game player culture creates an intense level of scrutiny that goes beyond the usual degradation of Tik Tok.Tik Tok’s rise to internet notoriety only happened over the past few months, but the Chinese-developed app has been around since 2014. Like the similar app Musical.ly before it, Tik Tok allows users to make and share short videos using various audio clips, where they lip sync and perform over popular songs. When Tik Tok acquired Musical.ly back in August, it inherited most of Musical.ly’s teenage community. In June, before its merger with Musical.ly, Tik Tok had over 500 million users. Since then, it’s only grown, absorbing the 200 million, predominantly teen female users of Musical.ly. Now that the app is more popular, Tik Tok’s long-time user base is working on accepting the new communities, ranging from Facebook moms to furries, most who joined because of the ability to make some silly videos and express themselves. There’s a subsection of people joining the app with different, more mean-spirited intentions. This is where cringe compilations come in, as they’re mostly made by people who don’t use Tik Tok to play along, but to make fun of those already on there. This is par for the cringe-culture course: People take whatever popular fandom is blowing up among a different crowd and deride both the content and its fans. Just searching Tik Tok online brings up derision across the internet, even if you’re not looking for general compilations of clips to mock.Much like Cole Sprouse and the cast of Riverdale; leggings; and the music of Taylor Swift before it, Tik Tok occupies a space in pop culture where it is undeniably popular — but its acclaim with teen girls means it’s just as likely to be mocked as it is loved. Whether things made popular by teenage girls hold up later (think The Beatles versus Westlife), critics are quick to deem these fandoms as invalid because of the demographics of their fanbase. Even when their clips don’t involve fandoms, Tik Tok users are regularly ridiculed simply for using the app the way its meant to be used. Add in the fact that “I’m Already Tracer” is an Overwatch-themed anthem, and the internet shows its ugly side. Tik Tok users came late to “I’m Already Tracer,” which dates back to January 2017, before the Tik Tok days. It’s pulled from an animated music video by Mashed of The Living Tombstones’ “No Mercy,” and sung by two Overwatch teammates: a male player who keeps threatening to quit because his team keeps losing due to their lack of support heroes, and a female player who doesn’t want to be forced to play support, a role male players usually assign to women (or assume that women prefer). Ultimately, neither budges, which costs their team the match. The original video doesn’t depict either of the players in a good light — both are too stubborn to just pick a support hero. The point is to show how “unappreciated” support players are, according to the YouTube description for the Mashed version.Since it found a surprise renaissance on Tik Tok, however, it’s been the sole subject of  many cringe compilations that mock whoever is singing the female part. Overwatch fans on Twitter and YouTube are holding Tik Tok users to an even higher standard of mass critique. Make a 15-second clip about video games, and every action you take will come under fire. Just a quick glance at the compilations’ comments sections reveal violent, often misogynistic threats towards the subjects. At best, commenters ridicule the teens making the short silly clips, usually focusing on their appearances: either they make fun of how the performers look or accuse them of borrowing their boyfriends’ controllers. At worst, the comments sections house overly dramatic cheers for the girls’ deaths — quite a histrionic reaction to a bunch of 15-second clips.Performers are lambasted for not plugging in their controllers, using a wrong controller in the first place, or for “spamming the buttons.” (Though even those who claim to know better debate which controllers the girls are using.)Creators will make their own “ironic Tik Tok” videos in response, where they write out comments to the girls ranging from “Overwatch isn’t on PS3” to “Turn on your controller, bitch.”It’s all classic internet talk, one could argue, but the reactions are aggressive. Occasionally a brave commentator will dare to question the spam of “THE CONTROLLER ISNT ON!!!” comments, asking why it’s necessary that the controller be on for a quick Tik Tok video — only to have other commentators jump into replies raging about how girls are “attention whores.”The idea that teenage girls should be punished for putting themselves out there is laughable. While some teens have gotten famous off Musical.ly and Tik Tok, most just use it to have fun and share videos with their friends. Lip-syncing is just entertaining, so much so that there’s a whole show devoted to celebrities doing it. The girls making these videos probably didn’t intend for anyone outside of the app to see them. The only reason people are seeing them right now is because others went on Tik Tok to actively find and ridicule them. The misogyny of the matter is hammered home when you realize that some clips included in these cringe compilations don’t actually show anything “wrong” with what the performers are doing — they’re using the right controllers, or playing on PC, or just lip-syncing without any props. And most of all, it’s hard to ignore the gendered nature of the vitriol. It’s not just girls making the “I’m Already Tracer” videos. But most are, as are the majority of Tik Tok users who have been called out for not correctly playing Overwatch or not being real fans, despite no evidence suggesting otherwise. One of the clips included in many of these compilations is of 17-year-old cosplayer and Tik Tok user majaringsby, who is wearing full D.Va cosplay. She’s using a controller that’s not for PS4 (though it’s hard to tell from the 15-second clip), but her cosplay is fully detailed and accurate. Glancing at her cosplay Instagram profile reveals that she’s a veteran cosplayer, has enough Overwatch knowledge to know D.Va’s civilian name and regularly uses Tik Tok while dressed as her favorite characters.Despite majaringsby’s commitment to the character, people on the internet are quick to call her a fake fan for how she moves.There is certainly valid critique of “I’m Already Tracer” itself. Out of context, it could cast a poor light on female gamers in general; the singer’s stubborn refusal to play support seems belligerent and uncooperative to some, especially when excised from the original song. It no longer matters that both the guy and girl only want to play the more offensive Overwatch heroes; the woman’s refusal makes her look like a bad teammate. Watching teen girls sing along while absentmindedly playing with irrelevant controllers can feed right back into the notion that “women don’t play games,” or that their love of games is fake. The spread of “I’m Already Tracer” across Tik Tok could just reinforce stereotypes, and male commenters reflect this theory. Some women will also comment that they’re ashamed of these girls in the videos for poorly representing an already marginalized community. But a lot of female commenters on these videos aren’t defending their place in the gaming community; they’re spreading the same misogyny, reducing the girls in the videos to “thots” or calling them fakers.There’s a conversation to be had about how the 15-second cut of the song portrays the female gamer as recalcitrant. But mocking the clips doesn’t analyze the negative implications of “I’m Already Tracer” or how it reflects toxicity in Overwatch. The majority of these “ironic” cringe-y videos exist to deride the teens — young women — who are making these catchy, silly Tik Tok clips for the fun of it. And for a lot of the naysayers, that alone seems to be the big problem. Never mind that some of these Tik Tok women might genuinely love the game. If the gamer culture jury rules that you’re not a true representative of the fandom, they won’t stop until you do. "}