{"id": "Battlefield 5’s battle royale mode not launching until spring 2019", "paragraph": "Electronic Arts and developer EA DICE have laid out the post-launch timeline for Battlefield 5, and it includes at least one major surprise: The game’s battle royale mode, Firestorm, won’t launch until 2019.The mode’s release window starts in March, according to the timeline image in a new blog post, with no further specifics given on the timing.“During spring, DICE and Criterion start the fire with Battlefield V’s battle royale experience,” DICE’s Jonas Elfving wrote. Elfving described Firestorm as an experience that “elevates the [battle royale genre] by bringing in the best of what Battlefield is known for.” In a trailer in early September, EA said the mode would offer 64-person action across 16 four-player squads, along with vehicles and destructible buildings.Tides of War itself — EA’s name for Battlefield 5’s post-launch live updates — will kick off two weeks after the game is out, with the first chapter coming in “early December.” “Overture brings the Panzerstorm map, where the German mechanized war machine plunges into Belgium, smashing into Allied defensive forces,” Elfving wrote. “On this tank-focused arena, you’ll roll across ridges, ditches, and elevated roads with a massive force of armor, carving a path of destruction through the countryside.”Additional single-player content in the form of a War Story called “The Last Tiger” will be released during the December-January window, along with vehicle customization. A practice mode will also be added to the game then.“During this period, we’ll add the initial iteration of Practice Range to Battlefield V,” Elfving explained. “A seat of learning or just messing around, this area will contain trials to work on your shooting, driving, and flying. Based on the Hamada map, this is an environment that can’t kill you — until someone finds the Friendly Fire button, that is.”The co-op mode, Combined Arms, will launch during the January-March 2019 window, along with two new takes on the classic Battlefield game modes Rush and Squad Conquest. Updates and improvements will be released throughout the entire schedule, as will “weekly events and rewards.”All of this content will be free for players who purchase Battlefield 5; EA won’t be offering a season pass or charging extra for future modes or maps. There will be cosmetics of some kind for sale, although little has been announced about the game’s premium economy."}