{"id": "Diablo: Immortal feels like a Diablo game, just not one that’s for me", "paragraph": "Diablo: Immortal was recently announced at BlizzCon 2018. It’s a game that looks and plays a lot like Diablo 3, all from the comfort of your mobile phone. But how does it actually work, and is it fun to control? I ran through the BlizzCon demo three different times in order to answer those questions. The BlizzCon demo starts out by asking which class you want to play. I picked Barbarian my first time and jumped into the dungeon to slay some demons. I was playing on a sizable Samsung Android phone, which seemed to be about the size of my iPhone XS Max.The game is controlled completely with a touchscreen, with a virtual thumbstick on the left side of the screen and an ability cluster on the right. When using abilities that require precise aiming, holding down the button will let you draw where you want to aim. Despite being a fast-paced action game on a phone, the controls work pretty well. I was able to do what I wanted almost all of the time, and rarely struggled to pull off quick combos. The abilities themselves were pretty familiar for Barbarians; a quick slam of a hammer here and some whirlwinding over there. I didn’t really get a chance to play with anything new until I got my hands on the Wizard, who can now shoot out an eruption of electricity that quickly returns to her, dealing damage a second time. But it was with the Wizard that that I first noticed some flaws in the control system. Directing where I wanted to charge and slam my face for a Barbarian charge is easy enough, but as soon as I want to accurately drop a meteor on some demons, I ran into trouble. Like with all mobile games of this nature, it’s difficult to be precise, or to make your movements without your fingers slipping.With Diablo: Immortal, it’s easy to feel like you’re playing Diablo, but it also feels like an illusion. It looks like Diablo, it sounds like Diablo, and it even plays like Diablo. And yet it feels like it’s missing the sense of satisfaction that comes each time you crumple a demon corpse in every other Diablo game. The soul of Diablo doesn’t feel present. As a hardcore Diablo player, Diablo: Immortal just seems too similar to what I’ve been playing for years. With the recently released Switch version of Diablo 3, I can play a game that I know and love anywhere — it’s fabulous. But Diablo: Immortal is asking me to learn something only mildly new on hardware that doesn’t feel designed to play that kind of game. From the small slice I’ve played, the new content doesn’t feel worth the transition to less precise hardware.It’s hard to look at Diablo: Immortal and not think about what the Diablo community needs right now. Diablo 3 is six years old, and needs something drastic to be exciting again. The Switch version is great, but even it’s still the same damn game I’ve already sunk thousands of hours into. Diablo: Immortal has potential, thanks to its lore and setting (between Diablo 2 and 3), and it looks and feels like Diablo 3, all in the palm of your hand. The gameplay is admittedly impressive, and the usual smash and grab of Diablo is still fun. But Diablo: Immortal also feels like an imposter. It isn’t for me, but maybe it’ll be for the many millions of smartphone owners who don’t play games on PC or console. If it brings more players to the beloved Diablo franchise, then at least we can all have a beer together when Diablo 4 is finally ready for release."}