{"id": "Dark Souls creator Miyazaki takes lifetime honors at Golden Joysticks", "paragraph": "Hidetaka Miyazaki, the chief executive of From Software and the creator of Bloodborne and the Dark Souls series, was honored with the lifetime achievement award of the 36th Golden Joystick Awards yesterday in London.Miyazaki’s career honor was one highlight of an evening that also saw Fortnite Battle Royale take overall game of the year honors; God of War win for Best Storytelling; Red Dead Redemption 2 take the Critics’ Choice Award, and the Xbox Adaptive Controller earn a citation for Outstanding Contribution.“To receive such a prestigious award from the Golden Joysticks fills me with great surprise and a sense of great honor.” Miyazaki said in his acceptance speech. “I am tremendously grateful to everyone who has played, enjoyed and appreciated our games. Rather than myself, this award goes to the many people who have built these games with me, and shared their passion with me over the years.”God of War also won Best Visual Design, Best Audio and PlayStation Game of the Year; its four honors were the most of any one game. Also notable: Unknown Worlds and its survival adventure Subnautica won the Breakthrough Award and PC Game of the Year, respectively. Subnautica is due to launch for PlayStation 4 and Xbox One on Dec. 4. Subnautica had also been nominated for Ultimate Game of the Year, which Fortnite won.Accepting the Outstanding Contribution Award, Evelyn Thomas, Microsoft’s Accessiblity Program Manager called the Xbox Adaptive Controller “designed with inclusivity at heart.“We continue to be moved by the recognition it has received, helping it to stand out as a true first-of-its-kind, in gaming and beyond,” she added.With the Lifetime Achievement Award, Miyazaki joins the company of Ken Levine (2013), Hideo Kojima (2014), Satoru Iwata (2015), Eiji Aonuma (2016) and Sid Meier (2017).The 2018 Golden Joystick Awards can be viewed on Twitch. The full list of awards and their winners:"}