{"id": "The best Game Boy Color colors, ranked", "paragraph": "On Oct. 21, 1998, the Game Boy Color was born. And what a life it quickly led: The handheld arrived with Game Boy compatibility, granting games like Tetris a chance to continue its world domination. It brought us the best Pokémon games of all time; series like The Legend of Zelda, Super Mario Bros. and even Metal Gear Solid were all represented, and done well at that.But the best thing about the Game Boy Color? How colorful it was. Yes, it supported more than 32,000 color combinations (!), worlds away from its older brother, the Game Boy. But we’re talking about what matters much more, and that’s all those dope colors the hardware itself came in.You can’t just launch something called the Game Boy Color and not release it in myriad color schemes, right? How very trendy of Nintendo to do so, too (remember those cutesy iMacs, and all those Nintendo 64 color options?). The Game Boy Color did it best, naturally, and it’s only right to take a look back at the palette we all got to choose from when we bought one of the best systems ever.We’re also going to rank all six of them — and we’re focusing on the U.S.-available basic colors, mind you — because, uh, why not? Here we go:6. KiwiThe neon-green Game Boy Color is one of those things that sounds ... interesting ... on paper, but fails to win anyone over in practice. This was the most obnoxious color you could get your GBC in. If you had that kiwi handheld, you either had parents who got really, really close to nailing your birthday present and missed by mere inches, or you just had to be the most extra person at school. Kiwis should be eaten, not played with.5. BerryPersonal side note: My sister had a berry-colored Game Boy Color, because she was super into pink at the time. My sister, bless her heart, was led astray. This is not pink; this is fuchsia. Nay, this is hot pink. This is unequivocal, perpetually clashing trash. Love you, girl; did not love your Game Boy.4. GrapeThe deep purple Game Boy Color is actually totally fine, but it’s bested by the much cooler transparent purple hardware. (That one’s coming up.) Maybe you asked your grandpa for a Game Boy Color for Chanukah, and you told him you wanted the “purple” one. You probably meant the cooler purple one, the one that everyone else had. But Grape threw a wrench into things, so Pop-Pop bought you this guy instead. Again: Fine! But not what you wanted.3. TealOne of the best things about this system is that once you reach the upper parts of the list, you have a lot of good choices. Teal is one of the better blue variants, and so, too, is this Game Boy Color one of the nicest out there. I’m more of a sky blue person, myself, but good job here, Nintendo.2. DandelionShowing my bias here. This was my Game Boy Color, and it was the first video game system I ever owned. Love you forever, my little baby. Yellow maybe seems ostentatious to some, but this is the most subtle, charming, beautiful yellow on the color spectrum. Also, it reminds me of Pikachu, which is good. 1. Atomic PurpleHere he is, folks: The Best Game Boy Color Color. Atomic Purple is a defining look, a trendsetter in the world of transparent electronics. Look at those beautiful insides — that marvel of machinery. That right there is how your Game Boy Color works. The Atomic Purple GBC was our teacher as much as it was our idol, and deservedly so. How we miss the days of looking inside our handhelds, or any of our systems at all. "}