{"id": "Paradox reins in White Wolf after offensive passages in Vampire: The Masquerade RPG", "paragraph": "Heads are rolling at White Wolf, the company behind the classic Vampire: The Masquerade tabletop role-playing setting. Leadership changes are underway, after the studio used the imprisonment, torture, and murder of Chechnya’s LGBTQ community as the backdrop for a major plot point in that game. For the last several years, an independent team at White Wolf, owned by Paradox Interactive, has been working to refresh the tabletop RPG for a modern audience with a fifth edition. Even before the launch of that ruleset in August, however, White Wolf was already courting controversy. A series of unforced errors prompted statements disavowing perceived links to neo-Nazi and white-supremacist ideology in its game materials. In the past few weeks, it expanded on that launch by releasing several new sourcebooks, among them Camarilla and Anarchs. Unfortunately, those books made reference to the murder of gay Chechens in a context that used the ongoing human right violations in that country as fodder for their in-fiction narrative.“In the Chechnya chapter of the V5 Camarilla book, we lost sight of this,” wrote Paradox’s vice president of business development, Shams Jorjani, in a statement. “The result was a chapter that dealt with a real-world, ongoing tragedy in a crude and disrespectful way. We should have identified this either during the creative process or in editing. This did not happen, and for this we apologize.”Jorjani said that sales of digital versions of Camarilla and Anarch, as well as the ongoing production of physical copies of those books, will be suspended effective immediately. Sections on Chechnya will be removed in their entirety over the course of the next three weeks; shipping will be delayed as a result.It’s clear that Paradox is taking the steps needed to rein in White Wolf. Shams Jorjani has now assumed the role of interim manager, and Paradox will have greater oversight of White Wolf’s projects.\n    Related\n  “In practical terms, White Wolf will no longer function as a separate entity,” Jorjani said. “The White Wolf team will be restructured and integrated directly into Paradox Interactive, and I will be temporarily managing things during this process. We are recruiting new leadership to guide White Wolf both creatively and commercially into the future, a process that has been ongoing since September.”Paradox, traditionally known for publishing lavish strategy video games, purchased White Wolf from Eve Online creator CCP Games in 2015. The move made sense, since its marquee property, Vampire: The Masquerade, is also the source material for several well-regarded digital games, including Vampire: The Masquerade — Bloodlines. At the time, then-CEO Fredrik Wester said that his organization had “great respect for White Wolf’s gaming worlds” and that he saw “big opportunities for their expansion in the future.”Following the sourcebook dilemma, White Wolf will “no longer develop and publish” products in the World of Darkness universe, which was shared by the Vampire line as well as several other RPG products. Instead, those duties will be handled by licensees, with White Wolf overseeing the brand’s lore.“This has always been the intended goal for White Wolf as a company,” Jorjani said, “and it is now time to enact it.”Jorjani concluded the post with an apology, which we’ve included here in full.The World of Darkness has always been about horror, and horror is about exploring the darkest parts of our society, our culture, and ourselves. Horror should not be afraid to explore difficult or sensitive topics, but it should never do so without understanding who those topics are about and what it means to them. Real evil does exist in the world, and we can’t ever excuse its real perpetrators or cheapen the suffering of its real victims."}