{"id": "Every movie and show coming to Netflix in November", "paragraph": "Even with Netflix’s recommendation algorithm steadily serving you new movies, new TV shows and original programming tailored to your binging habits, the streaming service’s firehose of content makes what’s coming and going difficult to parse.That’s why we break down each month’s additions (plus the roster from two months prior, and what’s about to bounce from the platform, just so you don’t miss a thing) with a spotlight on what to keep on your radar. Netflix’s own “new releases” category is an info dump. Consider us a picture-in-picture talking head, screaming recommendations at the screen.Angela’s Christmas (Netflix Original)From Netflix: A trip to church with her family on Christmas Eve gives young Angela an extraordinary idea. A heartwarming tale based on a story by Frank McCourt.Bram Stoker’s DraculaBring It On: In It to Win ItCape FearChildren of MenClose Encounters of the Third KindCloverfieldDeuce Bigalow: European GigoloFair Game - Director’s CutFollow This: Part 3 (Netflix Original) From Netflix: BuzzFeed reporters research sexbots, superbug snipers and more in the third installment of this documentary series.\tFrom Dusk Till DawnGood Will HuntingJet Li’s FearlessJulie & JuliaKatt Williams: The Pimp Chronicles: Pt. 1National Lampoon’s Animal HouseNext Avengers: Heroes of TomorrowPlanet HulkScary Movie 2Scary Movie 3Sex and the City: The MovieSixteen CandlesStink!The English PatientThe Judgement (Netflix Original) From Netflix: After a traumatic incident at a party makes her a target of gossip and derision, a young college student tries to change her school’s toxic culture.The Untold Tales of Armistead MaupinThe Water Horse: Legend of the DeepTranscendenceVayaBrainchild (Netflix Original)From Netflix: From germs and emotions to social media and more, it’s the science of your world explained in a way that’s refreshingly relatable.House of Cards: Season 6 (Netflix Original)The Netflix series returns after Kevin Spacey’s exit. Robin Wright’s Claire Underwood steps up as the first female president, but still faces threats from those who wish to undermine her legacy.ReMastered: Tricky Dick & The Man in Black (Netflix Original)From Netflix: This documentary chronicles Johnny Cash’s 1970 visit to the White House, where Cash’s shifting ideals clashed with Richard Nixon’s policies.The Holiday Calendar (Netflix Film)From Netflix: A talented photographer stuck in a dead-end job inherits an antique Advent calendar that may be predicting the future — and pointing her toward love.The Other Side of the Wind (Netflix Film)From Netflix: A completion and restoration of Orson Welles’s unfinished film, this satire follows the final days of a legendary director striving for a comeback.They’ll Love Me When I’m Dead (Netflix Original)From Netflix: This engaging documentary explores Orson Welles’s unfinished film, “The Other Side of the Wind,” which he worked on for a decade before his death.Trolls: The Beat Goes On!: Season 4 (Netflix Original)From Netflix: With her sunny attitude, Poppy leads her friends in rescuing Mr. Dinkles, supporting Guy Diamond’s new invention and teaching Smidge to be helpful.Hoodwinked Too! Hood vs. EvilDisney’s Pirates of the Caribbean: At World’s EndPatriot Act with Hasan Minhaj (Netflix Original, streaming every Sunday)From Netflix: In this weekly show, Hasan Minhaj brings his unique comedic voice and storytelling skill to explore the larger trends shaping our fragmented world.Homecoming: Season 1John Leguizamo’s Latin History for Morons (Netflix Originals)From Netflix: With a rapid-fire lesson in overlooked Latin history, Colombian-American actor John Leguizamo comes to Netflix with his one-man Broadway show John Leguizamo: Latin History For Morons. Examining 3,000 years of Latino history, Leguizamo charts everything from a satirical recap of Aztec and Incan history to stories of Latin patriots in the American Civil War, revealing how whitewashed history truly is. Latin History For Morons earned a 2018 Tony Award nomination for Best Play on Broadway.Into the ForestThe Sea of TreesBeat Bugs: Season 3 (Netflix Original) From Netflix: Music keeps the Beat Bugs going and points the way to problem-solving solutions in another season of fun and adventure.\tLa Reina del Flow (Netflix Original) From Netflix: Seventeen years after being wrongly imprisoned, a talented songwriter seeks justice against the men who caused her downfall and killed her family.Medal of Honor (Netflix Original) From Netflix: This emotional docudrama tells the stories of Medal of Honor recipients from U.S. military operations in Iraq, Afghanistan, Vietnam and more.Outlaw King (Netflix Film)From Netflix: This period drama follows Robert the Bruce’s battle to regain control after being made an outlaw by the King of England for taking the Scottish Crown.Spirit Riding Free: Season 7 (Netflix Original)From Netflix: Seasons change, and so do Lucky’s adventures, whether she’s racing through the snow, outsmarting villains or soaring high in the sky!Super Drags (Netflix Originals)Former RuPaul’s Drag Race contestants Trixie Mattel, Shangela, Willam and Ginger Minj voice some of the characters in this show about a trio of Drag Queens who fight crime. The Great British Baking Show: Collection 6 (Netflix Original)From Netflix: The mouth-watering contest returns to the big white tent with 12 new bakers and another season bursting with delicious surprises.Treehouse Detectives: Season 2 (Netflix Original) From Netflix: Brother-and-sister detectives Toby and Teri are back on the case, helping others, being brave — and asking big questions about the world around them.Westside (Netflix Originals)From Netflix: Westside offers an unscripted and deeply personal glimpse into the journeys of nine young L.A.-based musicians as they follow their dreams. Each episode sheds light on their creative processes and personal struggles, interspersing cinema verité-style documentary footage with beautifully produced music videos featuring original songs.Green RoomLoudon Wainwright III: Surviving Twin (Netflix Original) From Netflix: Grammy-winning singer Loudon Wainwright III reflects on the close but complicated relationships between fathers and sons in this intimate evening of music and storytelling, from executive producer Judd Apatow, director Christopher Guest and produced by Funny Or Die.Oh My Ghost (Netflix Original)From Netflix: When a skilled but timid chef is possessed by a sassy spirit, her newfound confidence catches the eye of her longtime crush, a culinary hotshot.Warrior (Netflix Original) From Netflix: A war veteran plagued by guilt over his final mission teams up with his best friend’s widow to infiltrate a dangerous Copenhagen biker gang.May The Devil Take You (Netflix Film)From Netflix: When her estranged father falls into a mysterious coma, a young woman seeks answers at his old villa, where she and her stepsister uncover dark truths.The Crew (Netflix Film)From Netflix: Work-life balance breaks down for Paris’s most gifted armed robbers when a grave mistake forces them to work for a crime boss in a high-stakes heist.Cam (Netflix Film)From Netflix: Her online life’s been stolen. Her real life’s unraveling. There’s only one way out: beat the impersonator at her own game. Narcos: Mexico (Netflix Original) From Netflix: See the rise of the Guadalajara Cartel as an American DEA agent learns the danger of targeting narcos in Mexico.\tPonysitters Club: Season 2 (Netflix Original)From Netflix: Skye and the Rescue Ranch gang return for another round of action-packed adventure, incredible friendship and adorable animals.\tPrince of Peoria (Netflix Original) From Netflix: When an easygoing 13-year-old prince goes incognito as a U.S. exchange student, he strikes up an unlikely friendship with a fastidious overachiever.She-Ra and the Princesses of Power (Netflix Original)The highly anticipated She-Ra reboot caught whiffs of controversy from naysayers who critiqued the animation style, but has since garnered a strong, passionate fanbase. From graphic novelist Noelle Stevenson, this reimagining of She-Ra does away with He-Man, focusing on Adora herself as she leads a rebellion. The Ballad of Buster Scruggs (Netflix Film) The latest from the Coen brothers explores the nuances and cliches of the Western genre, but falls flat when it comes to the depiction of Native American characters. The Break-UpThe Kominsky Method (Netflix Original) From Netflix: Michael Douglas stars as a briefly successful actor turned revered Hollywood acting coach. A Chuck Lorre comedy series also featuring Alan Arkin.The Princess Switch (Netflix Film) From Netflix: When a down-to-earth Chicago baker and a soon-to-be princess discover they look like twins, they hatch a Christmastime plan to trade places.The Pixar StoryThis documentary details the evolution of Pixar Animation studios, starting from the very beginning, before the studio went to infinity and beyond. The Last Kingdom: Season 3 (Netflix Original) From Netflix: As Alfred’s health weakens -- and with it his dream of a united England — Uhtred must take command and confront a new threat, Danish warlord Sigrid.Kulipari: Dream Walker (Netflix Original) From Netflix: Now the Blue Sky King, Darel must lead a rescue mission to save a Dream Walker — leaving the village under the protection of the Kulipari youth.Motown Magic (Netflix Original) From Netflix: Imaginative boy Ben transforms his city by bringing colorful street art to life, armed with a magic paintbrush — and the classic sounds of Motown.Sabrina (Netflix Film) From Netflix: A toymaker and his wife are terrorized by a demonized doll after their adopted child tries to summon her late mother’s spirit using a spooky ritual.The Final Table (Netflix Original)From Netflix: The Final Table is a global culinary competition show featuring the world’s most talented chefs fighting for a spot at the elite, Final Table made up of the greatest chefs from around the globe. The series features 12 teams of two chefs from around the world cooking the national dishes of Mexico, Spain, England, Brazil, France, Japan, the U.S., India and Italy. Each episode focuses on a different country and its cuisine, with celebrity ambassadors, food critics and the country’s greatest chef eliminating teams until the finale. In that last episode, only one of our competing chefs will win a place at the Final Table, joining the nine legendary culinary icons -- Enrique Olvera (Mexico), Andoni Aduriz (Spain), Clare Smyth (UK),  Helena Rizzo (Brazil), Vineet Bhatia (India), Grant Achatz (US), Carlo Cracco (Italy), Yoshihiro Narisawa (Japan) and Anne-Sophie Pic (France). The series will be presented by Andrew Knowlton, James Beard Award-winning Writer and Editor at Large, Bon Appétit.  Created and exec produced by Robin Ashbrook & Yasmin Shackleton. The production company is theoldschool.Trevor Noah: Son of Patricia (Netflix Original) From Netflix: Trevor Noah gets out from behind the “Daily Show” desk and takes the stage for a stand-up special that touches on racism, immigration, camping and more.The Tribe (Netflix Film)From Netflix: An executive-turned-viral sensation loses his reputation and his memory, but finds a new life with his biological mother and her empowered dance group.Jiro Dreams of SushiAn intimate profile of Jiro Ono, master and owner of Michelin three-star restaurant Sukiyabashi Jiro, the documentary showcases his life, his restaurant, and the sushi he has dedicated his life to crafting. Mystery Science Theater 3000: The Gauntlet (Netflix Original)From Netflix: This season, Kinga subjects Jonah and the bots to a devious new experiment: a back-to-back marathon of six hilariously cheesy — and riffworthy — films.The Christmas Chronicles  (Netflix Film) From Netflix: Two siblings team up with Santa Claus for a high-flying holiday adventure. A new Christmas classic from the makers of Harry Potter and Home Alone.Frontier: Season 3 (Netflix Original)From Netflix: While Harp pursues Lord Benton to rescue Grace, Michael takes command of the Black Wolf Company and Sokanon embarks on a righteous crusade.Fugitiva (Netflix Original)From Netflix: A woman organizes a escape plan camouflaged as a kidnapping to protect her children from her husband’s enemies.Sick Note (Netflix Original)From Netflix: This black comedy series follows a slacker misdiagnosed with cancer whose lies lead him into an absurd web of secrets, blackmail and suspicion.Sick Note: Season 2 (Netflix Original)From Netflix: Rupert Grint, Nick Frost and Lindsay Lohan star in the second dose of the brilliantly dark comedy. And the lies just keep on coming...To Build or Not to Build: Season 2My Little Pony Friendship is Magic: Best Gift EverBumping Mics with Jeff Ross & Dave Attel (Netflix Original)From Netflix: Veteran comedians Jeff Ross and Dave Attell roast each other, the audience and special guests.Pocoyo: Season 41983 (Netflix Original)From Netflix: In a totalitarian Poland, law student Kajetan Skowron and detective Anatol Janów unravel a terrible conspiracy stretching to the country’s foundations.A Christmas Prince: The Royal Wedding  (Netflix Film) From Netflix: A year after helping Richard secure the crown, Amber’s getting ready to walk down the aisle with him. But she’s not so sure she’s cut out to be queen.Baby (Netflix Original)From Netflix: By day, Chiara is a promising student at one of Rome’s most elite private high schools. But by night, she leads a scandalous secret life.Death by Magic (Netflix Original)From Netflix: British magician Drummond Money-Coutts, or DMC for short, is on a mission to uncover the stories of magicians who died performing the most dangerous stunts ever attempted. He travels the world to track down where the fatal performances took place and to work out exactly what went wrong, sharing his magic with the people he meets along the way. It’s a journey that spans four continents and eight cities around the world. His aim is to pay homage to the craft by creating his own updated versions of the stunts that cost these magicians their lives, from being buried alive under tons of wet concrete, to playing a game of Russian roulette, to escaping from a collision with a speeding steam train. The series will follow DMC as he recreates the stunts where others have failed, in the most extreme magic show ever attempted. To succeed he must avoid the fate that met those who came before him and paid the ultimate price: Death by Magic.F is for Family: Season 3 (Netflix Original)From Netflix: When Frank befriends a handsome young fighter pilot — voiced by Vince Vaughn — the family embarks on a whole new set of adventures.Happy as Lazzaro  (Netflix Film) From Netflix: Ordinary teen Lazzaro is content with life as a sharecropper in rural Italy, but a visit from the aristocrat landowner’s son changes everything.Rajma Chawal  (Netflix Film) From Netflix: An internet-rookie father attempts to use social media to enhance his faltering relationship with his millennial son.Spy Kids: Mission Critical: Season 2 (Netflix Original)From Netflix: Finally feeling like a real team, the Mission Critical kids face their toughest test as they set out to destroy Golden Brain’s lair once and for all.The World Is Yours  (Netflix Film) From Netflix: To escape his life of crime, a small-time mobster in Paris accepts one last job involving Spain, drugs, the Illuminati and his overbearing mother.Tiempo compartido (Netflix Film) From Netflix:  Two men join forces to rescue their families from a tropical paradise, convinced a U.S. timeshare conglomerate has a sinister plan to take them away."}