{"id": "Battlefield 5 won’t have paid microtransactions at launch", "paragraph": "Battlefield 5, the World War II multiplayer shooter being released on Nov. 20, will not launch with the option to purchase premium currency with real-world money. Instead, players will initially only be able to earn a free in-game currency as they progress, with the option to buy a paid currency post-launch. The game’s developer, DICE, made the announcement this week in a post detailing the game’s economy. DICE producer Ryan McArthur outlined Battlefield 5’s two currencies — Company Coin and Battlefield Currency — and reiterated many of DICE’s talking points from when the game was formally announced in May, including the goal that the game will not be pay-to-win. While Battlefield 5 will feature single-player missions and several styles of multiplayer action, at the core of the experience will be an individual player’s collection of soldiers and equipment, called the Company. Both gameplay items (like weapons, perks and vehicles) and cosmetic items (like jackets, helmets and weapon skins) can be unlocked for your Company using the currency called Company Coin. Premium currency, called Battlefield Currency, will be sold for real-world money, but will only be used to unlock cosmetic items. The decision to hold that premium currency back, McArthur said, is in order to help ease players into the concept of the Company as a whole.“Battlefield Currency can be used to acquire specific cosmetic items for your Company,” McArthur wrote. “We want players to get hands-on experience with their Company, the progression system, and earning Company Coin before introducing premium currency.”Because we want every Battlefield player to join us on this journey, Battlefield V has no Premium Pass: you progress by playing. Learn about ranks, rewards you can unlock as you play as well as the currencies of Battlefield V: https://t.co/BOg7zQNKz5 pic.twitter.com/Ilnb0J3NFsNo date for the release of Battlefield Currency was given. Battlefield 5 launches officially on Nov. 20, but players can access the game as early as Nov. 9 through an EA Access or Origin Access subscription. The deluxe edition of the game grants access to Battlefield 5 on Nov. 15.During last year’s several controversies involving loot crates, premium currencies were front and center. At the time, Electronic Arts, the publisher of Battlefield 5, famously made the decision to remove premium currency from Star Wars Battlefront 2 just hours before it was scheduled to launch world wide. Premium currency eventually returned, but not before the game’s economy was completely revamped. EA later blamed the loot crate controversy for the game’s lackluster sales."}