{"id": "The Detective Pikachu trailer is full of Pokémon Easter eggs", "paragraph": "The Detective Pikachu trailer is here, and it’s chock full of two things: ultra-realistic Pokémon and tiny references to various parts of the series. From additional monsters, to regions and more, we’ve rounded up the Easter eggs to keep an eye out for upon your umpteenth rewatch of the trailer. (And if you’re looking for every Pokémon in the trailer, we got you covered, too.)We’re going to start with something attached to the trailer, but not in the trailer itself. The first official poster for Detective Pikachu has so many Easter eggs to pore over. Here’s the list of what we’ve noticed:Maybe “billboards” isn’t the right word, but in the first shot of the trailer, you can see big signs of the following Pokémon: Victini, Wooper, Petilil, and, a little more obscured, Goomy. Gengar and Jigglypuff balloons can be seen in the next shot, seemingly ready to fly in a parade. On the ground alongside them are handlers dressed as Squirtle and Gengar, with a man dressed as Bulbasaur also walking into frame.Tim Goodman, the 21-year-old human lead of Detective Pikachu, is clearly a big Pokémon fan. He’s got a ton of posters from championship Pokémon matches scattered across his room, including:Tim also has a headboard that looks like Pikachu’s ears. This isn’t an explicit reference to the Pokémon universe, but it’s my favorite sight gag in the trailer. The one-way ticket that Tim has to Ryme City, where most of Detective Pikachu takes place, lists his departure stop as Leaventown. Get it? He’s leaving town — and that town is Leaventown. I love it. (There’s also the idea that leaving references a big concept in Pokémon: evolution, which is sure to be a key theme in the movie too.) The Unown alphabet is used occasionally in this trailer. We see the letter H on a sign among the bustling Ryme City nightlife, and Tim later wears a shirt with the letter O on it.When Jigglypuff makes its first appearance, there’s another poster for a battle behind it. It’s advertising a big match between a Machamp and a Primeape.Spot anything we may have missed? Drop it into the comments, and we’ll be sure to add it to the post.Detective Pikachu is due in theaters May 11, 2019. "}