{"id": "The beta that isn’t", "paragraph": "The first beta test for Fallout 76 — or B.E.T.A., as it’s officially known — has come and gone. It lasted from 7-11 p.m. EDT on Oct. 23, and performance chugged, even when playing on an Xbox One X. But that’s the point; it’s a beta test. It’s not supposed to be polished or highly optimized. The goal is to figure out where that polish or optimization needs to go, based on the data collected during the test. “We all know with the scale of our games, and the systems we let you use, that unforeseen bugs and issues always come up,” developer Bethesda Game Studios explained in an open letter to the Fallout community on Monday. “Given what we’re doing with 76, we know we’re opening everyone up to all new spectacular issues none of us have encountered. [...] We need your help finding them, and advice on what’s important to fix. We’ll address all of it, now and after launch.” You’ll sometimes hear about something being a “real” beta test in discussions about this sort of thing, and that’s due to the fact that modern beta tests can sometimes feel more like demos. There will always be some players who are upset if the game they play during the beta test isn’t the game they want to buy at launch, no matter how well a publisher or developer tries to manage expectations before the test goes live. The Fallout 76 beta is different from other betas in that it’s not a map or two, and players weren’t limited to part of the experience for those initial four hours. This was the whole game, and players were free to explore and do as they wished while it was live. The acronym itself stands for “break-it early test application,” with the pronoun “it” referring to the entire game. Nothing was held back during those four hours, at least that we know of. And last night was just the first stage of access; the servers will be turned on and off at different times between now and the game’s launch on Nov. 14. Data will be collected and changes will be made. If it all falls apart? Well, that’s just part of the plan. “During the B.E.T.A. one of our primary goals is to stress test and break the game,” the Fallout 76 team wrote on the beta’s official FAQ page. “As such, the servers will not be running 24/7; instead, they’ll be online during targeted timeframes so we can get as many people as possible playing at the same time. Why? Because that’s the best way put all our systems to the test and see how they respond.”The other interesting detail is that Bethesda plans to let you keep any progress you’ve made during the beta when the final game is launched. You’re not just testing the game; you’re playing the game, in a meaningful, persistent sense. The gear and levels you’re gaining during the test will give you an advantage when the final game launches. It matters. “Our current plan is for your progress to carry over once Fallout 76 officially launches on November 14,” the writer of the official FAQ states. “Stay tuned for more information.” Entry into the beta is automatic if you pre-order the game through Xbox Live, the PlayStation Network or the Bethesda Launcher for PC players, or you can use the code given to you when you pre-order the game through another retailer to unlock your beta code using the following steps: There’s no indication that Bethesda will cap these test at a maximum number of players, so I’m going to assume that if you buy the game, you’re in the beta. This is one of those situations that isn’t quite early access, but it’s not quite a traditional beta test either. It’s full, early access to the game for a price, with the ability to carry your time playing the beta into the full version, which has a definite release date. It’s almost like a highly disciplined form of early access, without the baggage that comes with those words. And we’re going to be seeing more of this sort of thing as more developers and publishers push their biggest series into become online services; the launch of Battlefield 5 almost seems like it’s taking place across a number of months. Fallout 76 doesn’t have a beta, not exactly, but it does have a way that anyone can pay to play an unfinished version of the game early and begin a journey that they’ll carry with them onto the final game. So what do you call that? "}