{"id": "Final Fantasy 14 getting new Shadowbringers expansion, Blue Mages and more", "paragraph": "Final Fantasy 14’s Fan Festival is underway in Las Vegas and the developers of the game took the stage to announce some big changes coming to the MMORPG. Producer and director Naoki Yoshida, with the help of translator and English localization lead Koji Fox, announced a new expansion, a new job and teased a highly anticipated new race to play as.Here’s a roundup of the Final Fantasy 14 news Square Enix brought to its annual fan fest.Shadowbringers will finally bring Final Fantasy 14 to version 5.0. In this expansion, players will be able to fight the Garlean Empire and dive back into the fantastic storyline that FF14 has to offer. Multiple new jobs will also be released as part of the expansion, and the level cap will be raised from 70 to 80. Following the pattern of previous expansions, it will also bring about new areas to explore, new beast tribes, new dungeons and more.Thancred, one of the main NPCs from the game, was seen in the Shadowbringers trailer carrying a gunblade, similar to ones we’ve seen in previous Final Fantasy games. Fox and Yoshida both laughed and directed players back to the trailer when referencing some of the new jobs to be introduced in Shadowbringers expansion, so this could definitely be one of them.If you ever wanted to re-experience the story of Final Fantasy 14 from the beginning but didn’t want to make a new character, Square Enix is adding a new game plus option. You’ll be able to play the main scenario quests and job quests again at higher levels for fun. Neat!Blue Mage is a job we’ve seen in the Final Fantasy universe since its debut in Final Fantasy 5. The job has always been a magician that learns from monsters, and that’s no different in FF14. You will not learn your job actions as you level, rather you’ll have to go learn them from monsters on the field.This job is considered “limited” as it’s not connected to any class the way other jobs in the game are. It will release in patch 4.5 with a level cap set at 50. The level cap will expand in later patches.Viera, the rabbit people from Final Fantasy Tactics Advance, have been in hot demand since Final Fantasy 14 launched. Yoshida and Fox both joked throughout the keynote about Yoshida’s shirt, which featured Bugs Bunny on a motorcycle. The camera zoomed in dramatically on his rabbit shirt, just after announcing an unknown new playable race. So unless this is bringing about a class of playable motorcycles, we’re betting on Viera people.Yoshida noted that this will probably be the last new race that will be added to the game, as it’s a difficult task to do. Main scenario writer and world lore creator Banri Oda previously told Polygon that even thinking about writing up new race interactions made his stomach hurt.The Viera race was considered to be added in the first FF14 expansion, Heavensward, but was scrapped in place of Au Ra, the horned dragon-like race. The race will come out with the Shadowbringers expansion and a “massive hint” will be dropped when patch 4.5 releases.If your friend is playing in a different server within your data center, you’ll be able to travel to them! From the three main cities in the game, Ul’dah, New Gridania and Limsa Lominsa, you’ll be able to teleport to other worlds. This is great for friends playing in different servers, though it is limited within data centers. After all, moving between a Japanese and American data center would be a lot of work.Another two data centers are opening for North America and Europe. Worlds will have to be regrouped across data centers to prevent congestion once Shadowbringers goes live. Yoshida noted that Square Enix will offer free world transfers to help compensate this issue.More details about Blue Mage and the Shadowbringers expansion will be revealed as Fan Fest continues throughout the weekend."}