{"id": "This is the best Batman Halloween story ever", "paragraph": "This story was originally published October 2016 as part of Polygon’s 13 Days of Halloween series.For a character whose whole thing is striking fear, there’s precious little work in the area of Halloween-themed Batman stories worth talking about. Adaptations from Batman Returns to Batman: The Animated Series have generally favored Christmas as the holiday setting of choice, with its traditional focus on family and cheer to contrast against Batman’s dour isolation.Where do we turn, then, for Batman stories of All Hallows’ Eve? To Jeph Loeb and Tim Sale’s Batman: Haunted Knight, of course.On Halloween, falling bullets from celebratory gunshots kill innocents in Los Angeles, proclaims the first page of Haunted Knight. Cincinnati institutes a curfew, fire sweeps through Detroit on Devil’s Knight, \"but in Gotham City, on Halloween ... \"This is the opening of only the first of the three stories in Haunted Knight. The collection reprints \"Fears,\" \"Madness,\" and \"Ghosts,\" three collaborations between Jeph Loeb’s writing and Tim Sale’s art that became yearly Halloween specials in DC’s Legends of the Dark Knight title from 1993 through 1995. In each story, Bruce Wayne faces a challenge that calls the fundamental principles of his life into question.But, yes, he also combats the Scarecrow, the Mad Hatter, Penguin, Poison Ivy and the Joker.Legends of the Dark Knight was a unique anthology series, set nebulously \"in the early years of Batman’s career\" rather than current continuity. That allowed each creator on the book to use as much or as little of Batman’s wider comics canon as the creators desired — effectively making every Legends story that holy grail of superhero comics: the self-contained story. Sale and Loeb’s Halloween stories are essentially three small graphic novels — though you can get them all in one package these days.In our first and longest story, \"Fears,\" Scarecrow wreaks havoc on Gotham night after night — while a new woman in Bruce Wayne’s life causes him to question everything about his responsibilities toward his city. In \"Madness,\" Loeb packs three separate character arcs into one story, expertly juggling three separate narrators — Batman struggling to recall memories of parents without reawakening his own trauma; James Gordon figuring out how best to parent his newly adopted teenage niece; and a pre-Batgirl Barbara Gordon facing the worst Gotham City has to offer, and finding herself up to the challenge. And in our final piece, \"Ghosts,\" Bruce Wayne is visited by the ghost of his dead father, who is bound by the chains of isolation he forged in life and promises that before the night is done, Bruce will be visited by three spirits of the past, the present and the future.Yes: it’s A Christmas Carol but Halloween, Batman is Scrooge and his villains are his ghostly spirits.Loeb and Sale would go on to create Batman: The Long Halloween, the best Batman graphic novel of all time, and a major inspiration for the Nolan Batman trilogy — but Loeb’s understanding of what makes the character tick is apparent even in these comparatively quick stories. Does Bruce Wayne choose to be Batman, or is it an obsession — and which option is actually more compelling? Is Bruce’s inability to move past his parents’ murder a character strength or a weakness? Is dedicating his life solely to vigilantism the best way to honor his parents’ legacy? Is it even the best way to save Gotham City? These are the questions Loeb asks, and answers, within the 180-odd pages of Haunted Knight.In addition to his usual stunning compositions of color and blacks, fine lines and gigantic dark spaces — not to mention his unforgettable villain designs — Sale channels the look of David Mazzucchelli’s James Gordon in Batman: Year One, Frank Miller’s enduring Batman origin story. The stories even have the same master letterer as Year One, Todd Klein, who reprises the visual motifs he used for James Gordon’s Year One narration for \"Madness.\" The effect is almost surreal, if you’ve read Year One — like recognizing an actor or a voice but not being able to remember from where. Except, of course, there are no actors, no voices. It’s all an effect of art and text.Batman: Haunted Knight does everything you want in a Halloween special. It features the creepiest spooks in Batman’s already terrifying rogues gallery. It’s instantly accessible to a new reader. It showcases some of the best talent of the time. And on top of all that, it’s still a great exploration of the major themes of Batman through the lens of Halloween.Make sure you read it with the lights out."}