{"id": "Destiny 2’s Haunted Forest fixes Curse of Osiris’ biggest letdown", "paragraph": "Destiny 2’s Curse of Osiris expansion brought with it the Infinite Forest, an activity that promised players some semi-random combat engagements. But when the mode actually released, it was nothing more than a glorified loading zone and only accessible as part of certain missions.The Infinite Forest is one of the most disappointing additions in any Destiny expansion, but the Festival of the Lost Halloween event has transformed it into the mode that I wanted almost a year ago. The Haunted Forest — a spooky makeover for the Infinite Forest — works similar to the greater rifts in Diablo 3. You and your Fireteam enter into the Infinite Forest and push through randomly spawning arenas of enemies. Once you’ve killed enough to fill up the in-game meter, you’ll be instantly summoned to a boss chamber. Killing the boss will start you over with another set of random arenas — called a branch — on a slightly higher difficulty. The higher you climb, the harder the enemies and boss become. But the entire mode is timed, and you only have 15 minutes to get as high as you can. Once time is up, you’re locked into your current branch. The rewards for the mode are pretty limited — a few Fragmented Souls, the event’s special currency — but the mode itself is extremely fun in a group. Haunted Forest asks you to kill strategically and move as quickly as you can through the arena. In a group of randoms, it’s a good casual time, but a full squad of coordinated individuals can push high branches and stack buffs to take down bosses at incredible speeds. The Haunted Forest is inherently random, something that Bungie said it purposefully avoided when creating the Infinite Forest. Bungie originally feared that randomness and procedurally generated maps would ruin the curated fun of the Infinite Forest. Instead, it felt like the team had created something special with the Infinite Forest, but put so many restrictions on it that it could never truly be what players wanted: an endless end-game activity.Haunted Forest takes what the Infinite Forest was and removes Bungie’s restrictions. It isn’t a loading zone in a separate activity, it’s a stand-alone, end-game mode filled with strategies and players willing to push as hard as they can to reach the end. The randomness that Bungie feared is the modes greatest strength; it keeps it fresh every time.  In games like Diablo 3, randomness can be a blessing and a curse. Sometimes you get lucky with enemy spawns, and sometimes you don’t. But the good always outweighs the bad. You can fix bad luck by pushing as hard as you can, and sweating it out for the full 15 minutes. But good luck can create easy runs that are fun to breeze through. In a mode like Haunted Forest, where the goal should be to master it through hours of playing, the randomness will eventually even out.This flip on Bungie’s part is a reminder of the studio’s journey over the past year. When Curse of Osiris first came out, it felt like the community was begging for one thing while Bungie delivered another. But the Haunted Forest transforms what players hated into something else entirely: a fun mode that’ll be missed after it leaves on Nov. 6.The biggest issue with the Haunted Forest is that it’s time-limited. Bungie is onto something here that could eventually be an end-game activity for the franchise, just like the Prison of Elders was for Destiny. It just needs a real reason to play and the ability to play it all year long.The work put into Haunted Forest makes me hopeful it will come back in some way, as more than just a holiday event with its own set of rewards. But for now, it’s taken Curse of Osiris’ greatest disappointment and re-purposed it into a fantastic new mode."}