{"id": "The best comics of 2018, so farOngoings", "paragraph": "The comics world is big and varied — and it’s also never been so relevant, as comic book adaptation after comic book adaptation hits every theater, console and streaming service available to humankind. It can be hard to know where to start and what to read next, but that’s where we come in. Here are the comic books that came out in 2018 that made me, Polygon’s comics editor, lean in and lose myself or sit up and go “Wow.” From Marvel to DC — from superheroes to teen romance — and from the grandest stories of the fantastic to the most relatable works of nonfiction, these are the best comics of 2018. Comic book timing and releases can get murky, so here’s where I set my boundary: If it was published in paperback form for the first time in 2018, or first published in 2018 but will not be collected until well into 2019, it’s eligible. And keep checking this page, because 2018 is not over yet. Polygon Essentials is a collection of persistently updated lists of the best of the best games for each platform — from the hardware’s launch to its end of production — as well as the best entertainment across virtually every medium. For folks new to a platform, think of this as a starter kit. For long-term fans, consider it a list of what to play or watch next. We’ll be updating these lists often, with entries listed in reverse chronological order. To see a collection of other titles we recommend that might not have made the Essentials lists, check out Polygon Recommends.Vox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. For more information, see our ethics policy.The Unbeatable Squirrel Girl drove one of Marvel’s most notorious goof characters to bestselling fame, a solo graphic novella and star billing in two upcoming television shows. And for four years, The Unbeatable Squirrel Girl was defined by a single creative team — writer Ryan North and artist Erica Henderson — until Henderson took leave of the title to pursue her creator owned work this year. Her replacement, Derek Charm, does not disappoint; the series is still a ball of delight. But Henderson’s send-off issue, The Unbeatable Squirrel Girl #31, is the best of every aspect the title, squished into one single-issue story. Following a series of events, Doreen “Squirrel Girl” Green and her best friend and roommate Nancy find themselves cursed to move so fast that everyone around them appears to be standing still. They’ll live an entire lifetime in a single New York City weekend. Naturally, they decide to fight crime and mount their own rescue. The issue is an excuse for North and Henderson to show off the best of their partnership, with Henderson’s nose for fashion and character expression, and North’s story about weird science principles, framing the touching, life-long partnership between Doreen and Nancy. Buy it on Comixology | Marvel Comics | Your local comic shopDark Nights Metal was a fireworks show in which each new explosion seems like it must be the beginning of the finale — then next one is even bigger. For writer Scott Snyder and artist Greg Capullo, Metal took the wild, sci-fi principles and emotional core of their legendary run on the Batman series and blew it out wide, into a Justice League crossover that spanned the length of time and space. The book sees seven evil alternate-universe Batmen arrive on Earth to destroy the Justice League, motivated by hatred and envy that our universe will live on while their twisted alternative worlds are destined to decay in the depths of the Dark Multiverse — the place where broken worlds go to die. And why is the whole thing metal themed? Because like the best heavy metal music, Dark Nights Metal exists on the razor’s edge between self-awareness and earnest enthusiasm. On one side we had the terrifying and sadistic Batman Who Laughs, but on the other we had the Justice League teaming up to restart the universe with the power of their hope and love. Both silly and serious, cosmic in scope but individual in emotion, the series overflows with the joy of embracing the Rule of Cool. (And may we also recommend Dark Nights: Metal: Dark Nights Rising, a collection of all the origin story issues for the Nightmare Batmen.)Buy it on Comixology | DC Comics | Your local comic shopNo matter how much you think you know about a subject, you can always learn more. That’s the lesson I got from Comic Book History of Comics: Comics for All — sitting with my mouth hanging open when I realized that France’s comics industry is so different from the ones in the UK and the US because the country had basically missed the entire Golden Age of Superheroes. The reason was obvious — it’s not like the Nazi occupation was letting comics where American-flag-clad heroes socked Hitler in the jaw through the blockades — but this book points it out in the most elegant way possible. In the comics world, there are a lot of resources that will teach you about fictional history, but there are far fewer that will put that history in the context of the real world events that shaped it. Comics for All is the second installment in writer Fred Van Lente and artists Ryan Dunlavey and Adam Guzowski’s Comic Book History of Comics. It’s a comic book that tells the history of comics, this time with an international focus, particularly on how the comics communities of different countries — America, England, France, Japan and more — influenced each other. If you’re not interested in it yourself, trust me: This is a perfect gift for your friend who thinks they know everything about comics. Buy it on Comixology | IDW Publishing | Your local comic shopSleepless was nothing that I expected when I opened its first issue, which begins with the main character mournfully draped across the tomb effigy of her royal father in a skull-filled crypt, mentally preparing for the uncertainty of her life at court without him. Now, it’s one of my favorite new series of 2018. Lady Pyppenia, our heroine, is the only child of the old king — but her mother was not his queen. Now, her uncle sits on the throne, and although Pyppenia (or Poppy, as she prefers) has no designs on it whatsoever, her mere existence is a threat to his dynasty. Things spiral from there: Poppy yearns for her mother’s homeland, survives assassination attempts and upgrades her relationship status with the Sleepless bodyguard she’s been magically bonded with since childhood to It’s Complicated. Sarah Vaughn and Leila Del Duca’s story pulls us into an exquisitely designed world of intricate patterns, whether in the brocade of a skirt or the machinations of a royal court. It’s the only comic I’m reading right now where I finish every issue with a frustrated groan, because I know I’ll have to wait a month to find out what happens next. Buy it on Comixology | Image Comics | Your local comic shopNicolas Cox is one of the least experienced fencers on his all-boys prep school’s team — but he’s the one with the biggest axe to grind. He’s there for one reason only: to train hard enough to beat his half-brother, a nationally renowned teen fencer and the favored scion of the father who abandoned Nicolas and his mother. But that’s going to be hard if he can’t even make the team, and harder when his roommate is another sour-tempered but very hot fencing prodigy. And they both hate each other, of course. Writer C.S. Pacat and artist Johanna the Mad combine all the best aspects of sports anime, teen drama and slow burn romance stories into Fence. The ongoing series is up to 12 issues and counting; Vol. 1 collects the first four. Buy it on Comixology | Boom Studios | Your local comic shopWhen Black Panther roared onto screens this year, there weren’t many books you could hand to the character’s new fans that actually felt like it related to the movie they just watched. As good as the first arcs of Ta-Nehisi Coates’ Black Panther were, they were still heavily rooted in Marvel Continuity. Meanwhile, in the movie, major characters like Nakia, M’Baku and Killmonger had been given big — and necessary — facelifts to bring them from the comics to the big screen. Enter Evan Narcisse and Paul Renaud’s Rise of the Black Panther, a retelling of T’Challa’s canonical origin story from the time his grandfather tussled with Captain America in World War II to the international aftermath of his decision to reveal Wakanda’s existence to the world. Narcisse condenses and reframes decades of Marvel continuity with an expert eye to adaptation, shaking off the many creaky bits of early Black Panther stories and repackaging them for a modern and more diverse audience. If you want something to read after watching Black Panther, Rise is your best bet. ...At least until Shuri gets a trade collection. Buy it on Comixology | Marvel Comics | Your local comic shopThe Nib Magazine, a quarterly print periodical from online non-fiction comics outlet The Nib, shipped its first issue this fall. Holding a copy in my two hands took me back to my halcyon teen days of getting a copy of Cicada literary magazine in the mail every month. Which is ironic, considering that the theme of first issue of The Nib Magazine is “death.” Within that theme, the Nib’s cartoonists deliver essays, short-form memoir and investigations on subjects ranging from the history of how the death penalty is administered in the United States to the adoption of Halloween traditions into celebrations of the Day of the Dead to coping with the loss of an infant child — all through the medium of comics. Everybody’s seen a documentary film, read an investigative report or devoured a well-researched book about popular science. But outside of memoir — which, thanks to folks like Alison Bechdel, Marjane Satrapi and Harvey Pekar, is a well-known genre of the medium — nonfiction in comics doesn’t have a lot of outlets. The Nib is already doing the job of supporting political cartooning and nonfiction comics as print journalism takes hit after hit. The Nib Magazine feels like the culmination of those very worthy efforts. Subscribe to it at The NibAll X-Men books are political books — at least when they’re embodying the promise of the characters. But among the X-Men titles of 2018, X-Men Red was the political X-Men book. Tom Taylor and artists Pascal Alixe and Mahmud A. Asrar gave the reader a fresh-from-the-dead Jean Grey assembling a team of mutants and mutant allies to begin the foundation of a stable mutant nation. Set against her is one of the most formidable villains of the X-Men universe: Cassandra Nova, the psychic ghost of Professor X’s stillborn twin, who has infested humanity with a global army of nanites that chemically pushes a person’s mutant hostility into violent action. No matter how serious his subject matter, Taylor has a strong humorous voice, which he used to set the tone for his multi-year run on All-New Wolverine. That tone — as well as X-23 and her clone/sister, Taylor’s breakout superhero creation of Honey Badger — comes along for the ride in X-Men Red. Nanites notwithstanding, Taylor knows exactly what he’s playing with when he pits the X-Men up against the weaponization of online hatred, and it made X-Men Red the best X-book I read all year. Buy it on Comixology | Marvel Comics | Your local comic shopThe Dead Hand begins like a yarn about an elite Cold War Spy dragged back into the game, but reveals itself almost immediately to be about a secret all-American small town hidden in Russian Siberia. An issue later we find out that it was built by an international group of spies for one reason only: To keep the child-like artificial intelligence with all of Russia’s nuclear launch codes from triggering World War III. Kyle Higgins and Stephen Mooney could have told many different stories with that setup, which makes the one they chose, about the surprising potential of children, so interesting. And all of it is wrapped up in Mooney’s striking and graphic page spreads (colored by Jordie Bellaire). Buy it on Comixology | Image Comics | Your local comic shopComic book milestones are a dime a dozen. With the rate of re-numberings and reboots multiplied by the number of series out there, you could probably find at least one big, even number anniversary every month. Even Action Comics #1000 did not arrive without its own layer of accelerated shipping and reversion to old numbering. But in the case of Action, the series that debuted in 1938 with the first Superman story, the spark that lit the big bang of the entire genre and has defined American comics for 80 years — issue #1000 was still a moment worth stopping to consider. This year, Superman stood at a crossroads. A #MeToo victory had opened the character’s office to a new editorial blood for the first time in years, just in time for one of Marvel Comics’ biggest creators to take the reins. For the occasion of #1000, DC Comics brought in more than two dozen artists and writers from the character’s history — and future — to craft a tribute to the super man who started it all. The book is full of beautiful art and touching stories, enough to show any reader why the Man of Steel has lasted this long and spawned so many reflections, subversions and imitators. Buy it on Comixology | DC Comics | Your local comic shopIt’s easy to forget, given his modern film appearances — and given the likability of Mark Ruffalo — that the Incredible Hulk is a monster, and he always has been. While it’s true that the monstrous sympathetic is an important part of the monster story genre, Hulk stories have always owed themselves to the myth of Dr. Jekyll and Mr. Hyde, the struggle with the monster within us all. It was this philosophy that animated Al Ewing’s Immortal Hulk, an ongoing series exploring the life of Bruce Banner in a living hell, after he realizes that he cannot die. If he is killed, he simply rises as the Hulk at the next sunset. Ewing’s series has a general narrative that he’s taking his time with, but issue-to-issue, he and artist Joe Bennett are crafting one-shot Hulk horror stories on par with the output of any classic EC Comics horror anthology. Bennett’s art knows exactly when to bust out the full page spread, and how to go close on the Hulk without sacrificing sense of scale. Reading the first arc of Immortal Hulk was an exercise in never knowing what kind of story I was going to get next, and that’s something I can wholeheartedly recommend. Buy it on Comixology | Marvel Comics | Your local comic shopThis list is purposefully focused on trade collections or similar, but we also wanted to spotlight a few nascent titles for monthly pull list reader. Remember, buying monthly issues is still the best way to support new comics. So if you’re a monthly comics buyer, these are the 2018 series you can’t go wrong with. X-Men: Grand Design has an excellent and concise hook: the entirety of Marvel’s retcon-heavy X-Men continuity, distilled and adapted into a six-issue series. But there’s more than just the hook, as the artist doing all the condensing and explaining is the Eisner Award-winning cartoonist and historian, Ed Piskor. Piskor is best known for Hip Hop Family Tree, his comic series chronicling the rise of the eponymous musical genre and the culture surrounding it, and before that he turned his eye to another cultural revolution with The Beats: A Graphic History. With X-Men: Grand Design, he tackles fictional history for the first time, and the result is a masterful work of comic book design work and narrative adaptation. The first four issues have already been collected into two larger volumes at the time of this writing, with a final two on the way in 2019. Buy it on Comixology | Marvel Comics | Your local comic shopWhat if The Last Unicorn was a bit more metal? What if Schmendrick the Magician was a bard, and also a bit less nice and a bit more self-centered, and also rode an enormous, hairy, foul-tempered, obsidian, five-horned unicorn? I walked into writer Si Spurrier and Matías Bergara’s Coda expecting a simple heavy metal yarn about a taciturn warrior wandering the wasteland of a magical apocalypse. Our hero, Hum the Bard, is on his Mad Max-esque wander through the fantasy post-apocalypse because he wants to rescue his wife, who he says was kidnapped by orcs. I was surprised to find that Hum’s pentacorn is almost the most badass thing about him. Hum may luck into heroic actions, but never for anything other than selfish reasons, and as Spurrier pulls back the layers on Hum and his fantasy world, the whole story becomes very satisfyingly complicated. On top of that, you have Bergara filling the book with broken cities and crumbling dragon skeletons, riotous color imbuing trading caravans run by a mermaidmatron in a bathtub and mobile bandit cities drawn by lumbering giants. Five issues of Coda are out at the time of this writing, with seven to come in the 12-issue limited series. Buy it on Comixology | Boom Studios | Your local comic shopIn a warped future world where every job is assigned by an app, Reapr is the Kickstarter of assassination. Nominate a target and anyone else who’d like to see them bite it can donate, crowdfunding the payout to whatever amateur killer caps them before the four-week timer is up. Writer Christopher Sebela and Ro Stein’s Crowded is the story of odd couple target and bodyguard Charlie Ellison and Willa Dourlet — who Charlie hired through the gig economy app for bodyguards, Dfend, of course — attempting to evade everyone who wants the million dollar price on Charlie’s head. And for her part, she has no idea why everyone in her life would apparently prefer it if she was six feet under. Crowded. Crowd-ded. Crowd-Dead. Get it? Sebela has a deft hand with parodying online culture that’s often lacking in such stories, and Stein’s got the kind of talent for varied character design and page layouts that I’d love to see in any book. Buy it on Comixology | Image Comics | Your local comic shopI’ve called Border Town “the Mexican-American Stranger Things.” Writer Eric M. Esquivel and artist Ramon Villalobos have called their series “Scooby Doo, but Mexican;” a fusion of Archie, Lucha Libre and Supernatural. The two Mexican-American creators know precisely what they were getting into, sitting down to craft a story about mixed-race Latinx kids set in an Arizona town on the Mexican-American border in 2018. What they perhaps did not expect was that Border Town #1 would be the first DC Vertigo book to sell out and require a second printing in five years. (The last was no less than Sandman: Overture #1, Neil Gaiman’s long-awaited return to the Sandman setting.) After finishing their first issue with the Aztec god of the dead bellowing “YOU. FUCKED. UP.” at a Chupacabra, Esquivel and Villalobos followed up with a #2 that unveiled a who’s who lineup of monsters of Mexican folklore — and drew the reader even more into the lives of its teen heroes. It’s understating things to say that Border Town is off to a strong start, and you should consider jumping aboard. Buy it on Comixology | DC Comics | Your local comic shopThe Sandman is the rare example of a hugely popular comic book setting that hasn’t been picked over by subsequent follow-ups — despite being corporate-owned. You could say it’s because of the healthy respect that Neil Gaiman’s talent inspires, but if you asked my cynical side, I’d say it’s also because his talent inspires a healthy level of fear in anybody trying to imitate it. Simon Spurrier and Bilquis Evely’s The Dreaming is the first of four new Sandman spinoffs from DC Vertigo. In it, the Dreamlord goes missing — he may even have quit — and his realm is falling apart without him, the surreality and immense variety of a crumbling Dreaming packed into every page by Evely’s flowing pen. At the same time, a mysterious and powerful new dream entity, the eternally hungry and occasionally monstrous Dora, is struggling with her own place in the world of her absent creator. So far, The Dreaming stands to be the Sandman Universe title most likely to both scratch that itch for new Sandman stories and to contribute to the Sandman setting in a way that feels as important and additive as Endless Nights or Sandman: Overture. Buy it on Comixology | DC Comics | Your local comic shopVox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. For more information, see our ethics policy."}