{"id": "Halloween director David Gordon Green on pushing Michael Myers’ horrors to the limit", "paragraph": "The spine-tingling idea for the new Halloween only seems obvious in retrospect: Circle back to Jamie Lee Curtis’ Laurie Strode 40 years later, treat the masked killer Michael Myers like one of America’s incarcerated “true crime” icons, witness another episode of slasher horror through the lens of generational trauma, and resurrect the style of John Carpenter’s original film — ice-cold and home-movie gritty — for a new generation. For David Gordon Green, the concept was a hunch and gamble, but most of his movies have been. After entering the filmmaking fray with a string of critically acclaimed indies (2000’s George Washington, 2003’s All the Real Girls and 2004’s Undertow), he teamed with Seth Rogen for Pineapple Express, spoofed ’80s fantasy with Your Highness, returned to his indie roots for Prince Avalanche and the Nicolas Cage-led Joe, then became the guy who could shepherd A-list actors — Sandra Bullock in Our Brand Is Crisis and Jake Gyllenhaal in last year’s Stronger — in prestige performances. He’s a director who makes the pieces fit and adapts his stylistic instincts to the genre sandbox. Dying to do a horror movie, Halloween became the high-stakes IP puzzle he was more than ready to crack.Polygon had a chance to talk to Green, who despite playing the Hollywood game, still gushes about making movies through a laid-back Texas drawl. Here, the director and co-writer talks about taking on the job, Halloween’s one-shot murder streak sequence that defines his vision, and whether he’d come back for more.  [Ed. note: this interview contains mild spoilers for Halloween.]Before we get to Halloween: You were going to direct the Suspiria remake, which now opens a week after your movie. What happened? David Gordon Green: It’s going to be awesome if the previews are any indication. I wrote a draft of it and was going to direct it and that and developed that with Luca Guadagnino for awhile. Luca was going to produce it for me and then … that didn’t happen. My career is so bizarre. When I’m asking people to invest in my films, sometimes they don’t really understand what I’m trying to do because I haven’t developed that kind of signature filmmaker move. I don’t have that thing that you did. I say, “Hey, I make serial killer movies” or “I make broad comedies” or whatever the genre might be that could help me solidify a little bit more stability and people investing in me. Did you chase Halloween because you had the itch to make a horror movie?Green: This was an opportunity. I’d known Jason [Blum] for a long time, and I brought him some ideas for horror movies that I could make after Suspiria fell through. We talked about certain things and we never really found something that gelled. Then I got an email from him that just said “Halloween?” It was like a psychic premonition I had. You could interpret a vague email like that in infinite ways, but I knew what it meant and I knew that I was going to do it. I had great confidence in it. When there’s someone with the power that [Jason] has, and the entity that he’s created right now [in Blumhouse Productions], it’s literally just a matter of him saying yes. So it’s not a big committee, it’s not a huge legacy property burdened with a massive machine behind it. It’s Malek Akkad and Jason Blum and Bill Block, the producers, [are in charge of the Halloween IP]. And they just said, “Let’s go make a movie.”What scene in the movie signifies what you hoped to get out of returning to the vibe of the original movie? Green: I think Michael going door to door. The senseless killing of it, the randomness of it, the trick-or-treat of it all. To me I wanted that signature scene to be something that we’d rehearsed and put a lot of thought and time and into, and use it to define what was specific about our movie. Strangely, in Halloween II, there’s a woman that he looks at it through a window and she’s cutting a sandwich. So we kind of alluded to that and then we fulfilled that evening’s quest a little bit more graphically and thoroughly than they did in Halloween II. That sequence says here we are honoring the thoroughness of the original film. We’re in some ways showing how we separate ourselves from Halloween II and beyond. Is the movie ripe with other nods to the less distinguished sequels?Green: Not really. There are some trick-or-treaters wearing masks from Halloween 3: Season of the Witch. There are some subtle things. The art department on this movie, Richard Wright, our production designer, is a huge fan of all the later ones — he knows them more scientifically than I do. I know there’s a lot that I don’t even know what’s going on because he just would like try to surprise me and then tell me later. Some of the details like the ice machine at a gas station or something I had no clue of. Then he points out it’s something from Halloween 5. That’s probably an incorrect example [laughs]. But the team set out to do that and have fun with that. \n    Related\n  So you kill a kid in this movie.Green: [laughs] I don’t know if he’s a kid … he’s armed!OK, he’s a teen. You kill a teen. And at one point during that long scene you’re describing, Michael considers killing a baby. How did you decide to inch towards that line?Green: It’s certainly a choice. And that was a last-minute idea. We put a baby crib in the living room. We did that the day of. We scrambled to put it together just to have this moment ... an ethical choice. He is doing horrific things. Like there’s a kind of a defenseless lady making a sandwich and watching Voyagers! on television and then he murders her. It’s not like she had done anything harmful. So then I thought it was a fun thing to nod to an obvious ethical consideration and moving on. It added a level of Oh shit, what’s going to happen? You also have an amazing kid actor who brings tremendous comedic energy to the end of that killing spree scene. Where did you find him?Green: Jibrail [Nantambu]. Most of what he says is improvised. That was his first movie. He had great energy and so we just kind of let him loose. In the audition, when we were auditioning kids, there was a closet door in the room, and I was like, “Now I want you to open the closet door,” because it’s just interesting to see what kids would do. And he was like, “No, I’m done.” He wasn’t going to let some annoying, nerdy director tell him to go into a closet. I know you’re pals with the elusive [Tree of Life director] Terrence Malick, who produced a few of your early films, but I was curious: Do you keep in touch? Do you talk about the movies you’re working on? What’s that relationship now? Will he see Halloween?Green: I moved away from Austin about a year to South Carolina and I haven’t kept up with him. So I haven’t talked to him recently — hopefully he’ll see this movie and give me his thoughts. But anytime you talk to him about movies, you’re just talking to him about comedies, which is the most genius conversation you could have. I once got a voicemail from one time after he watched Eastbound and Down that was just hilarious. He likes like White Men Can’t Jump a lot. It’s just funny: He’s a very dramatic, serious filmmaker that he sets a lighthearted personality and his choices of entertainment. I really wish he’d make a comedic film, that would be the best.Would you come back for a sequel to Halloween?Green: We’ve got to make a hit out of this, but if there’s a cool idea and there’s good opportunity, sure.Wouldn’t you be coming up with the idea? You haven’t made many movies written by other people or clicked into the obvious studio strategy. You seem lucky in that regard.Green: [laughs] It’s kind of up to this one to make me more commercially relevant because that’s long since faded.If Halloween is a success, do you have a passion project on which you’d cash in some chips?Green: The one thing I developed for years that I’ve always wanted to do is Confederacy of Dunces. But that was caught up in so many legal snafus and rights issues and things like that. That’d be fun someday to get that cleared off. Right now it’s just basically overburdened with dead weight and nobody wants to go for it. Maybe someday."}