{"id": "Will GoldenEye’s oldest speedrun record ever fall?", "paragraph": "About a year ago — 11 months, more precisely — Karl Jobst took down a 15-year-old speedrunning record long thought to be unassailable: GoldenEye 007’s Dam stage, Agent Difficulty, in 53 seconds. Jobst did it in 52.“Dam Agent 53” was one of four GoldenEye 007 speedrun records set between 2002 and 2004. Jobst has picked off three: Dam Agent (52 seconds) on Dec. 2, 2017, Archives Agent (15 seconds on Dec. 17, 2017, since tied by Gus Riolo in October) and Bunker 1 Agent (16 seconds on Sept. 3, 2018). That leaves Runway Agent, in 22 seconds, first achieved by Bryan Bosshardt on March 9, 2004 and tied 118 times since (including by Jobst on Sept. 11, 2013) but never surpassed. It is the oldest standing record in one of speedrunning’s gold standard games. The video above by RWhiteGoose examines if a 21-second time in Runway, Agent difficulty, is even possible. To the layperson, it’s interesting that the first thing standing in Jobst’s way is modern timing technology. Because Bosshardt’s record was recorded on VHS, there’s no way to measure fractional seconds. The record has to be rounded to the whole second and has to be taken from the stage ending report card. Considering that many other speedruns in games this old or older are being set by single frames, this is a huge disadvantage.RWhiteGoose’s 17-minute breakdown pivots on the grenade-boost tactic, which is explained in detail and made all the difference in Bosshardt’s original run (he picked up five grenade boosts). RWhiteGoose theorizes that making eight grenade boosts might deliver a time that, taking advantage of the game’s whole-second rounding, comes in at 21 seconds. But while all the components to get a 21-second run are achievable individually, various “technical challenges” ranging from the AI guards’ shooting accuracy to other details, make pulling all of them off in one run statistically impossible, RWhiteGoose reasons.But, by making this video and showing his homework that he thinks Runway 21 is impossible, he hopes that will inspire others to either hurl themselves at the record or look for other ways to clip a second off the mark before it turns 15. As speedrunning fans know, the appeal here is when something is believed to be impossible, then it turns out it’s possible."}