{"id": "The voices of the Marvel Cinematic Universe remember Stan Lee", "paragraph": "On Monday, Marvel Comics legend Stan Lee died at the age of 95, leaving the comics industry — and the other sides of the entertainment business he influenced — in mourning. Not only was Lee a co-creator of some of the most famous superheroes of all time, his work persevered over the ages, becoming fodder for one of Hollywood’s most epic tentpole franchises: the Marvel Cinematic Universe.“No one has had more of an impact on my career and everything we do at Marvel Studios than Stan Lee,” Marvel Studios president Kevin Feige remarked on Twitter. “Stan leaves an extraordinary legacy that will outlive us all. Our thoughts are with his daughter, his family, and his millions of fans.” Feige, well aware of what he owed Lee professionally and spiritually, made room for the writer in nearly every Marvel movie. Though Lee filmed a cameo for Blade that ultimately wound up on the cutting room floor, his first appearance was in 2000’s X-Men, running a hot dog stand as a mutated Senator Kelly emerges from the ocean. Lee saved the day in 2002’s Spider-Man, pulling a girl away during Green Goblin’s first big attack. When the Marvel Cinematic Universe emerged with 2008’s Iron Man, Feige gifted Lee a Tony-worthy cameo: playing a Hugh Hefner type walking the gala with three bombshell blondes on his arms. Future MCU cameos would bring him down to Earth: In The Avengers, Lee appears on a newscast exclaiming how it was next to impossible that there’d be superheroes in New York; in Captain America: Civil War, he appears as a FedEx delivery man who mistakenly refers to Tony Stark as “Tony Stank.” The creme de la creme of Lee cameos might have been his brief appearance in Guardians of the Galaxy Vol. 2, in which the comics titan appears as an astronaut regaling the alien entities known as The Watchers about his adventures on Earth — a scene that prompted serious theorizing about his place in the universe.“Stan Lee was as extraordinary as the characters he created,” said Disney CEO Bob Iger in a statement. “A super hero in his own right to Marvel fans around the world, Stan had the power to inspire, to entertain, and to connect. The scale of his imagination was only exceeded by the size of his heart.”As reactions came rolling in, several MCU stars also voiced their tributes to Lee. Polygon will update this story as more cast and crew share their memories. There will never be another Stan Lee. For decades he provided both young and old with adventure, escape, comfort, confidence, inspiration, strength, friendship and joy. He exuded love and kindness and will leave an indelible mark on so, so, so many lives. Excelsior!! I owe it all to you,,, Rest In Peace Stan... #MCU #Excelsior #legend #rip #stanlee #TeamStarkA post shared by  Robert Downey Jr. (@robertdowneyjr) on Nov 12, 2018 at 11:26am PSTTHANK YOU, @TheRealStanLee. You gave us characters that continue to stand the test of time and evolve with our consciousness. You taught us that there are no limits to our future as long as we have access to our imagination. Rest in power! #EXCELSIOR #StanLee #rip pic.twitter.com/hnSmnHIDlnRest in Peace Stan Lee  Stan Lee, RIP. Thanks for inspiring so many of us to pick up a pen or pencil and put your dreams onto paper. Excelsior! pic.twitter.com/L33eTjUQdIStan Lee. A gentleman and a genius. It was an honor to be a small part of his universe. Rest In Peace. pic.twitter.com/iZNtQRRqKDThank you for filling our childhoods with such joy. You will be dearly, dearly missed... pic.twitter.com/Qt2sZqaNlcToday we lost one of the greats. @TheRealStanLee, you were a inspiration and superhero to us all. Thank you for contributing so much- and giving us all something to aspire to!   #ripstanlee pic.twitter.com/GzFhwgU0WAThank you @TheRealStanLee for the escape from this world & great joy inhabiting the ones you created!! You made so many believe in the good, the heroic, the villainous, the exciting, most of all, you were giving & gracious to us all. RIPI believe with all my heart that #StanLee would want to be celebrated today.  Even through your tears, let’s flood the internet with all the artwork, good, great or awful, that’s ever been created in Stan’s name. #BreakTheInternetForStan #ArtForStan@MarvelStudios @Marvel pic.twitter.com/w9pyY18sZ5You were a man before your time... now it feels like you are gone before your time. RIP Stan the Man... thanks for the laughs and words of support. It’s a honor to live in your universe! #MarvelKnight pic.twitter.com/1TXdPqUB3x How many millions of us are indebted to this guy, none more so than me. The father of Marvel has made so many people so incredibly happy. What a life and what a thing to have achieved. Rest in peace StanA post shared by  ✌️ (@tomholland2013) on Nov 12, 2018 at 11:54am PSTSad, sad day. Rest In Power, Uncle Stan. You have made the world a better place through the power of modern mythology and your love of this messy business of being human... pic.twitter.com/x6yZ6ClNSX"}