{"id": "Fallout-themed smartwatch could convince me to hand over my caps", "paragraph": "The smartwatch craze kind of missed the boat with me, but I could be convinced to get one for this Pip-Boy themed Fallout watch going on sale this week for $149.99. It helps that I’m just that much of a Fallout fan, and also that my old watch has been seven minutes slow for about the past five years.This is the (adjusts glasses) “first-ever Fallout Superfan Smartwatch,” from One61 Studio, which earlier this year launched a line of three DC Comics smartwatches packing the same kind of functionality and slick design. One61 is the wearables division of Bioworld, a maker of licensed apparel and collectibles. Their first three watches were for Batman, Wonder Woman and The Flash. (Variety said back in October that one for Rick & Morty is also on the way.)The Pip-Boy is a natural theme for wearable and mobile computing, of course; 10 years ago I jailbroke my first iPhone to make it look like a Pip-Boy, and bought the collector’s edition of Fallout 4 — whose full-size Pip-Boy could house a smartphone running the game’s companion app. (“As far as stupid gimmicks go, this is the best fucking one I’ve ever seen,” director Todd Howard said at E3 2015.)Well, now there’s a better fucking one, at a smaller size, doing a lot more. The Fallout Superfan Smartwatch synchronizes with both iOS and Android devices via Bluetooth and an app. From there, users can integrate with their phone’s voice assistant, contacts and phone dialer.The watch also supplies notifications, controls the camera, finds the phone, and keeps track of one’s steps, heart rate and other biometrics. (The physical activity/pedometer seems to have some gamified stuff riding along with it.) The only fine print I could see is that it can’t send or reply to messages with an iOS device, only view them. And it’s not compatible with any Motorola Android mobile devices.This one-sheet has a lot more details. A news release said the Fallout Superfan Smartwatch will be on sale through one61.com beginning Tuesday, Nov. 20, but that site does not yet have it listed."}