{"id": "Fallout 76’s beta already has mods", "paragraph": "Mods for Fallout 76 are already available, and the game is still only in its beta.As spied by PC Gamer, a baker’s dozen of cosmetic mods for the Fallout 76 B.E.T.A. are on Nexus Mods, the modding supermarket where Bethesda’s Fallout and Elder Scrolls series dominate the thousands of files available for free.All of the 13 are cosmetic changes, ranging from retextures of the fishing hat, Nuka Cola bottles and even bobby pins. Others replace the menu music with an acoustic guitar version of the game’s theme (which is pretty sweet) or “Take Me Home, Country Roads,” the song used in the game’s marketing since its initial announcement back in May.Others give characters bizarre hair colors, a black Vault 76 suit, or alter the opening menu to show a collection of Vault-Boy cartoons or cinematic shots from the game’s live-action trailer. There’s also one that remakes the game’s map in Fallout 4’s map style.In-game cosmetics exist only for the player who installs them, and so therefore won’t appear to other players who don’t have the mod. Fallout 76 sells cosmetic items through its “Atomic Shop” for “Atoms” a new currency that is freely acquired but can also be bought for real money. The fact these mods don’t (yet) copy existing alternate looks in the Atomic Shop, nor can they be seen by others, probably means Bethesda isn’t too worried about cracking down on them right now.That said, past mods have gotten C&D nastygrams, but usually because they infringed some third party’s intellectual property; to wit, a Fallout 4 mod giving players a Boston Red Sox jersey that drew the attention of Major League Baseball.\n    Related\n  These mods are only for the PC version, of course. Instructions for installing and using them are on their pages at Nexus Mods. Officially, Bethesda Game Studios has said that mods and private servers will eventually be supported, probably through Creation Club, the modding suite Bethesda brought to consoles in 2017. But the studio hasn’t offered any kind of timeframe for when that will arrive.  As for how users are already modding a game that hasn’t even launched? Well, that’s simple. As redditor tonightm87 said, “People know this engine like the back of their hand.” When Fallout 76 launches on Nov. 14, the beta client will become the full game (on PC, not PlayStation 4 or Xbox One) for those who have purchased it, so these mods will still be good for the full game.The Fallout 76 beta continues today from 2 to 9 p.m. ET. Additional beta times have not been announced; Fallout 76 launches Nov. 14 for PlayStation 4, Windows PC and Xbox One."}