{"id": "The infinite horrors of Pokémon’s Mr. Mime", "paragraph": "If you’re anything like the people in the Polygon offices, you’ve probably spent most of the day somewhere between captivated and horrified by the first trailer for the upcoming Detective Pikachu film. Whether it’s a version of Jigglypuff that is entirely too real, the voice of Deadpool coming out of a small CGI mouse or these terrifying still images of the sculptures they made for the film, there’s no shortage of things to have strong feelings about in this trailer. But, one of the Pokémon people have had the most positive reaction to in the trailer is Mr. Mime’s scene near the end. This is not the correct reaction to Mr. Mime. The correct reaction is abject horror. At first glance Mr. Mime appears to be only somewhat strange looking. Sure, he looks a little like a person dressed halfway between a clown and a mime, but we know he’s a Pokémon so we’ll give him a pass. But let’s take a slightly closer look at his appearance and the reason behind it. First thing’s first: What’s on top of his head. It looks like it’s just his hair right? Well, turns out that’s not exactly true. The official entry for Mr. Mime on Bulbapedia says this, “blue growths resembling clown hair extend from the sides of its pale pink head.” Yep! Those “blue growths” are basically just horns that for some reason look like clown hair, and it gets worse. See those shoes? They aren’t shoes. “Its dark blue feet curl upward at the tips,” says Bulbapedia, which means that whatever is growing out of Mr. Mime’s head is also growing out of the bottom of his legs and for some reason makes feet/shoes for him. So, technically he could probably stand on his blue horns. If you’re starting to get the idea that Mr. Mime doesn’t actually wear clothes, despite how he may look, you are correct. Every part of him, from what looks like a poofy white shirt, to his terrifyingly-large gloved hands, are just his body. He’s just shaped that way ... all the time. But if you’re still willing to look past his objectively monstrous exterior, the mythology around Mr. Mime is even stranger. According to an almost ageless internet fan-theory, in the Pokémon anime, Mr. Mime — or a specific Mr. Mime — might be Ash Ketchum’s father. The evidence for this isn’t what you’d call overwhelming. Basically, a wild Mr. Mime often helps Ash’s mom around the house and seems to have an extremely close relationship with her. Add this on to the fact that Ash doesn’t know his father and, much like Pokémon in the universe, never seems to age, and fans have decided that Ash must be some kind of half-human, half-Pokémon hybrid. Also there’s this screenshot from the anime, which we aren’t even going to talk about. The evidence is obviously thin here, but the fact that it’s a theory that’s still worth talking about is reason enough for us to never mention Mr. Mime again. There are plenty of reasons to be excited about the new Detective Pikachu movie. The trailer has genuine charm and uses a song from the Shrek Swamp Karaoke Dance Party — both equally important facts. There are also plenty of reasons to be justifiably terrified of the photo-realistic Pokémon. But the one thing that’s clear is that no matter how funny his scene in the trailer may be, Mr. Mime is terrifying. "}