{"id": "Five things to know about Destiny 2 patch 2.0.5", "paragraph": "Destiny 2: Forsaken is getting yet another update this week. Patch 2.0.5 brings much needed changes to the game, as well as a new quest as part of Festival of the Lost. So Before you dive in and start trying to avenge Master Ives, take a second to learn what’s changed. Here are five things you need to know before logging into to Destiny 2 today.For a full list of changes, check out the patch notes on Bungie’s website. It’s been a long, fruitless road of exotic grinding for players over the last six weeks since Forsaken released. With the latest expansion’s reduced exotic drop rate, it’s hard enough for players to complete their collections of Destiny’s most powerful weapons and armor. But the frequent drops of exotics that players have already earned has been a real morale killer.Thankfully, patch 2.0.5 changes the game to prevent frequent duplicates from dropping. Now, there will be a much higher chance that players will receive an exotic they haven’t earned before. And when duplicates do happen, there’s a higher chance that players will receive armor instead of weapons, since they have a chance to roll different perks. Weapons that players acquire from quests will now be completely removed from the potential exotic pool as well.A new patch means a weapons balance pass. The Wish-Ender exotic bow is seeing an increase in base damage. There is also a bug fix that will cause the weapon to deal more reliable damage against moving targets, and will no longer sometimes deal half damage. The Malfeasance hand cannon is having its explosion damage increased. The weapon will also deal even more damage to invaders and Taken. Trace Rifles as a whole are also getting a buff. They’ll spawn with more ammo in PvP, and receive benefits from auto rifle-specific armor perks like auto rifle loader. Masterwork Cores have been hard to find in Forsaken, but they should be a bit easier to acquire after today’s patch. Now named Enhancement Cores, they’ll be rewards in scrapper bounties and will be included in some of Spider’s weekly bounties. While they’ll still be included in infusion, they should be far less rare.Patch 2.0.5 brings tons of minor but exciting changes to the game. Players will now be able to hold 20 ghost fragments for Spider, up from 10. Nightfall-specific rewards gain a greater chance to drop each time a player completes a strike without receiving one. The Gunsmith will take higher stacks of materials at one time and — most importantly — it now only takes .25 seconds to delete a shader. With the release of 2.0.5, the hunt to find Master Ives’ killer is on. The Cryptarch from House of Wolves has been murdered, and it’s up to the Guardians to avenge him. Not much is known about the quest, but there’s a rumor that players will return to the Cosmodrome and earn the Thunderlord exotic for their trouble. All players are eligible for this quest, regardless of if they own Forsaken or not. "}