{"id": "Getting fired from a Miyazaki movie was ‘a good thing’ for this anime director", "paragraph": "With the kind of brand recognition and clout that Studio Ghibli has built up over the past 33 years, getting picked to direct a film for the legendary animation studio seems like a huge breakthrough for any up-and-comer. Not so for Mamoru Hosoda, one of Japan’s freshest, most respected anime auteurs in recent years. Hosoda, whose credits range from the original Digimon anime to this year’s fantasy film Mirai of the Future, told Polygon that forfeiting a huge Studio Ghibli gig helped grow his career for the better.In 1999, Hosoda’s first film premiered in Japan. The short film Digimon Adventure served to introduce the franchise to audiences, premiering a day prior to the TV anime’s premiere. Although it was attached to a Pokémon-like multimedia machine, Digimon was different — it had heart, and humor, and human leads with realistic relationships. After Hosoda’s follow-up theatrical short, Digimon Adventure: Our War Game!, came out in 2000, both he and the series earned increasing critical praise in their home country. Hosoda’s work had won the attention not only of young audiences, but of the biggest animation company in Japan.“When I did the Digimon movie, Ghibli producer [Toshio Suzuki] came to me, saying, ‘We have a feature coming up. Do you want to work on it?’” said Hosoda, speaking to Polygon during a Western press tour for Mirai. That movie was Howl’s Moving Castle, based on the beloved fantasy novel by Diana Wynne Jones. Hosoda was asked to direct, a huge get for a director who had previously only directed one feature-length film.But after a few months, Hosoda was off the project. “I was really excited, but with Ghibli, there’s a certain ... tone, and rules they had to follow,” he explained.Some ex-employees have alluded to what those may be in interviews about working at the studio. In 2016, former production coordinator Hirokatsu Kihara described Ghibli as a place with high turnover, where co-founder Hayao Miyazaki (the award-winning director of Spirited Away, Kiki’s Delivery Service and more) dominated all of his fellow creatives. Hosoda wasn’t as harsh as Kihara, who said one person in charge “speaks like a Yakuza and rules [Ghibli] like a politician.” But Studio Ghibli’s core focus on Miyazaki was incompatible with his vision.“I was told to make [the movie] to similar to how Miyazaki would have made it, but I wanted to make my own film the way I wanted to make it,” he said. “The difference between the film I wanted to do and ho they wanted to do it was too great, so I had to get off the project.”Miyazaki certainly comes off as strong-willed — and slightly cynical — in The Kingdom of Dreams and Madness, a documentary that takes us inside Studio Ghibli during the production of the director’s then-final film. And both he and fellow co-founder Isao Takahata were in charge of the majority of Studio Ghibli’s films during their tenure. Since their simultaneous departures, the animation company’s release slate has slowed to almost a complete halt.Hosoda, now the head of his own studio, doesn’t regret walking away from the house of Miyazaki — a film that Hayao Miyazaki went on to direct himself, after it was put on ice for two years. Howl’s Moving Castle has maintained a huge fanbase since its 2004 premiere, even with its early production troubles. Meanwhile, Hosoda has had the chance to assert creative control, achieving commercial and critical success on his own.“If I had to make Howl’s the way Ghibli wanted me to make it, I think my career would have been over,” he said. “When I got off the project, people thought, ‘Oh, he failed, he’s over.’ But it’s a good thing that I went on to make my own thing, instead of making it the way Miyazaki would have made it.”In 2006, Hosoda released The Girl Who Leapt Through Time, a coming-of-age film that immediately compelled critics to name him “the next Miyazaki.” Subsequent works include Summer Wars and The Boy and the Beast. Mirai, the latest in his slate of heartstrings-pulling, fantastical anime, will show in select theaters nationwide beginning Nov. 30. "}