{"id": "Thronebreaker misses sales expectations because of GOG’s small reach, says CD Projekt Red", "paragraph": "Thronebreaker: The Witcher Tales, was a sales disappointment for CD Projekt Red when it launched at the end of October on Windows PC, and the publisher suggested that original plans to launch exclusively on GOG.com — which CDPR owns — is to blame.In a financial call earlier this week, co-chief executive Adam Kicinski said CD Projekt Red had high expectations for sales based on community anticipation of the game, which took what had been planned as a small singleplayer campaign for Gwent: The Witcher Card Game and expanded it into a 30-hour standalone game.But to investors, Kicinski said “the reach of GOG is incomparably smaller than that of Steam,” and so CDPR decided to launch there, too. Kicinski said “a Steam release had always been considered,” but the company originally announced that Thronebreaker would be exclusive to GOG.com for its Oct. 23 PC launch, a significant step for the Steam competitor. Thronebreaker was listed on Steam on Nov. 9.The sales may be a disappointment but that is no reflection on community or critical reception; Thronebreaker has a “very positive” reputation among user reviews on Steam and GOG.com, and it’s gotten praise from the games press.Whether this has ramifications for Cyberpunk 2077 and how CD Projekt Red will handle its launch, “You should not draw unwarranted conclusions concerning the future,” Kicinski said. “Thronebreaker is a very unusual project from our perspective and it should not be viewed as a mold for other releases.”That goes for whether The Witcher Tales gets additional installments. “Of course, depending on the results of Thronebreaker — I assume that it will continue to positively affect our bottom line; it is not, of course, a financial failure, it’s just that our expectations are very high — these factors will be considered when making decisions regarding future releases of this type,” Kicinski said, “but it’s too early to provide any specifics.”Thronebreaker is due to launch Dec. 4 for PlayStation 4 and Xbox One."}