{"id": "Kids-vs-monsters survival horror game The Blackout Club hits Early Access today", "paragraph": "The Blackout Club, a co-operative survival horror game by indie studio Question, launches in Early Access today on Windows PC via Steam.With elements reminiscent of Stranger Things and kids-versus-monsters movies, The Blackout Club players team up to investigate a friend’s sudden disappearance and uncover a larger, darker truth about their small Appalachian town.“Together, they uncover a conspiracy of occult-obsessed adults who have turned the town’s population into sleepwalkers,” a news release said. “The club must infiltrate labyrinthine tunnels that emanate hypnotic melodies from beneath the town’s seemingly idyllic surface. To save the day, up to four players will sneak out on nocturnal surveillance missions to capture the conspiracy on camera.”\n    Related\n  The Blackout Club is the second game from Question, which is known for 2015’s The Magic Circle, a puzzle game that was also an ironic commentary on video games development itself. Question was founded by developers with credits on AAA console games, including the creative director of BioShock 2 and the lead effects artist of BioShock Infinite. A third was a programmer for 2012’s Dishonored.Polygon previewed The Blackout Club back in April. In the game, players try to survive a night of procedurally generated adventures. Stealth and teamwork play big roles, as most adversaries are too big to take on in physical combat. The Blackout Club has been designed with drop-in/drop-out multiplayer in mind.Since April, Question has shown off The Blackout Club at PAX West and conducted a closed beta. A news release today said the Early Access version will feature content not seen in either, including new locations to explore, more character customization, and new missions. Developers said additional content will be delivered to the game throughout this period.The Blackout Club is $19.99 in Early Access. A full launch on PlayStation 4, Windows PC and Xbox One is expected in the first quarter of 2019."}