{"id": "The Coen brothers’ new Western grapples with the genre’s history — and their own career", "paragraph": "The Ballad of Buster Scruggs, the new film from No Country for Old Men filmmakers Joel Coen and Ethan Coen, drew every imaginable response during its U.S. premiere at the 56th New York Film Festival earlier this month. Originally conceived as a six-part Netflix series — it will still premiere on the platform on Nov. 16 — the film has been trimmed to a manageable feature-length work while retaining its chaptered structure, which elicited everything from roaring laughter to slack-jawed silence.A book called The Ballad of Buster Scruggs and Other Tales of the American Frontier provides the framing device, its pages turning between each of the film’s six stories. The book also serves as a reminder: What we’re about to witness is a folkloric retrospective on the past, viewed in some future moment, with requisite awareness — or lack thereof. Buster Scruggs isn’t just a Coen brothers Western. It’s a Coen brothers film about Westerns and, in many ways, a film about their entire body of work and the way they see cinema. Understanding the movie within their recent filmography, and within the broader history of American movies and Western storytelling, is part of the viewing experience.[Ed. note: This post contains minor spoilers for The Ballad of Buster Scruggs.]The film’s six parts, reportedly written over the entire breadth of the Coens’ career, are unconnected by plot or tone, but they play off each other like tracks on a country concept album. The first chapter, also titled “The Ballad of Buster Scruggs,” is an uproarious Western musical steeped in comedic violence. In it, the eponymous folk hero, played by Coen regular Tim Blake Nelson, strolls through a small town, sizing up locals against his moral code and responding to minor slights with delightfully ludicrous gunslinging. It’s an all-out farce, but through satirical edge, the Coens remind us that those killed in the course of action were real people with real lives and real loved ones. There’s something haunting about each time Scruggs glares at the screen to speak to us. He smiles a wide and welcoming smile, but he’s dead behind the eyes, as if carrying the weight of the Western, and the breadth of cinematic violence, on his shoulders. We question what it is we’re laughing at, and whom we’re laughing with.Buster Scruggs continues to call out cinema in its far more serious second chapter, “Near Algodones,” in which the Coens subvert a traditional bank robbery. The chapter finds an unnamed outlaw played by James Franco holding up a loopy bank teller (Stephen Root), who is armed with an arsenal of pots and pans. Franco’s outlaw eventually finds himself on the wrong end of a noose and on the wrong side of a tribe of “savage” Native Americans — a sore sticking point in an otherwise razor-sharp entry.Without spoiling too much, the rest of the film continues to mine tradition for commentary and pleasure. “Meal Ticket” drifts into more macabre, contemplative territory, echoing the Coens’ Inside Llewyn Davis as it chronicles the relationship between a stone-faced carriage driver (Liam Neeson) and the limbless actor he ferries from town to town (Harry Melling). The actor performs history’s greatest speeches for steadily waning crowds, from Shakespeare and Shelley to the Gettysburg Address, and the Coens lament the thankless task of preserving culture and history in the signature, green-tinged eeriness of cinematographer Bruno Delbonnel, who also shot Inside Llewyn Davis. ”All Gold Canyon” finds a prospector (Tom Waits) discovering a lush-green patch of nature by a cool and calming river, then immediately digging for gold. It’s the birth of the American West itself, presented as being at odds with a peaceful state of being. Chapter V, “The Gal Who Got Rattled,” departs from the action-oriented narratives for the longer tale of Alice Longabaugh (Zoe Kazan), a sweet, soft-spoken girl figuring out how to pay her sudden debts along the Oregon Trail, and the kindly trail leader (Bill Heck) helping her find a solution. It’s among the Coens’ more romantic work — Kazan and Heck’s dynamic has a butterfly-inducing sweetness — but it also wouldn’t feel like the Coens without a signature dash of irony to make us question how we view violence in cinema, albeit through the reintroduction of “savage” Native Americans who shake up the plot.One needn’t look further than the Coens’ last two efforts — Hail, Caesar! and Inside Llewyn Davis — to know that the brothers have entered an introspective period. Hail, Caesar! takes place in early ’50s Hollywood, satirizing the moral bankruptcy of the postwar studio system while Inside Llewyn Davis, a ’60s-set New York City drama shot with a dreamlike haze, takes place at an important historical nexus for folk music, centering on a character who’s fundamentally unable to change.Hail, Caesar! happens to be set when much of the cinema that influenced the Coens came about — lest we forget, its delightful “oh, would that it were so simple!” scene centers on Hobie Doyle (Alden Ehrenreich), a Western star unable to progress beyond his limitations — while Inside Llewyn Davis feels like the duo’s melancholy ballad to one another, a look at the stagnation of art when one loses their creative partner, or at least their creative spark. The willfully obtuse Ballad of Buster Scruggs might come the closest to answering the Coens’ unspoken questions about their own work. The language of the Western is perfect for the Coens’ reflexive statement on their cinema — and not just because they remade True Grit. Some call No Country for Old Men the definitive Coen film, but its status as anti-Western, modern Western, revisionist Western or whatever academic label you hit it with speaks to their interrogation of American cinema. No Country for Old Men features many of the Western’s hues and locales transposed to a more modern setting — the warmth that cinematographer Roger Deakins brings to most of their films feels descended from the platonic ideal of the Western itself — but the film turns its back on the neatness of Hollywood, revealing who lives or dies with jarring edits before pivoting toward the unknowable in the form of dreams we never even get to see. Blood Simple came out a full 34 years ago, but it still feels right on the tip of the Coens’ tongues. The first chapter in The Ballad of Buster Scruggs features a direct callback to the Coens’ debut film and the close-up of the kill shot that takes down Julian Marty. The anthology’s first chapter was written decades ago but filmed only recently, so the use of the close-up alone feels like a microcosm of the larger film, as if examining the Coens’ own past instincts as creators. In Blood Simple, the shot feels at one with the rest of the film, a brutal descent into moral anarchy; in Buster Scruggs, the shot is a disorienting stylistic departure from a farcical romp, suddenly reminding us that there’s meaning behind even the most mindless violence.Leaning into classic American cinema, especially the Western, comes with the risk of leaning into the oppressive structures that birthed it. And while The Ballad of Buster Scruggs questions the social and political rules commonly featured in Westerns, what it presents entirely uncritically is the Native American, whose “savage” imagery was (and continues to be) part and parcel of the American myth. Historically, a vast number of cowboys were nonwhite, but the cowboy in American cinema — the white gunslinger adjudicating both death and morality — doesn’t really exist without a whiteness-as-nobility default or without the savage “Injun,” which makes the faceless, dehumanized portrayal of natives in not one but two chapters of Buster Scruggs all the more troubling. The satirical, deconstructed approach to Westerns and American cinema isn’t entirely negated by this violent presentation, of course, but it does map out the extent to which the Coens are willing to subvert the artistic language through questions of human existence.The Coens have, in the past, been accused of a largely white-skewing focus in their films. Prior to the debut of Hail, Caesar!, The Daily Beast questioned them on the “overwhelming whiteness” of their work. One might argue, as the Coens did in that interview, that issues of representation can’t be tackled by asking one film to solve them (“Why aren’t there this, that, or the other thing? It’s a fundamental misunderstanding of how stories are written,” said Joel Coen). But the default whiteness of the Coens’ output and narrative focus, whether or not it “should” be questioned, hits its crescendo in Buster Scruggs as the duo seemingly question the very meaning behind their filmography. This nexus paints a picture of their narrative impulses that feels almost accidentally whole — whiteness is the invisible antimatter to all of their intentional elements — as if they’ve provided their own answer as to whether their films should be beyond reproach when it comes to representation.Almost every Western archetype — rather, every white Western archetype — from the silent to the nameless to the morally questionable and even to the “white damsel” is afforded an exploratory purpose in The Ballad of Buster Scruggs. And while Native Americans don’t make up more than five or so minutes of the film’s two-hour runtime, their retrograde depiction sticks out in an environment where the audience has, by and large, evolved to the point of at least noticing the disparity in framing. From minute one, Buster Scruggs questions “the way things were” (and in many ways, continue to be) on film, but even the Coens’ satire has its limitations, treating natives much as it does hats and spurs: mere fixtures of the genre, unworthy of a second look.This isn’t to suggest that the Coens aren’t in control of their message for the most part, especially as it pertains to life, death and the unknown. The brothers have always ridden the strange and uncomfortable line between violence and humor (Fargo is a prime example), and their use of death to induce both shock and laughter reached its apex in Burn After Reading, a film whose bizarre politics no longer seem to read as satire. That said, death itself is never something they really allowed themselves to dwell on until Inside Llewyn Davis. Donny’s death and even his funeral are played for laughs in The Big Lebowski, while the major deaths in No Country for Old Men take place off screen; these are admittedly purposeful. But the sixth chapter of The Ballad of Buster Scruggs, written decades after the first and immediately prior to filming, feels like their most direct confrontation of death to date. The anthology’s first chapter alone goes from treating death as casual entertainment to almost begging the film to take it more seriously. The second asks us whether it’s something we ought to root for; the third refutes the notion entirely. The fifth chapter treats death with a more tender hand, as one of its main characters pieces together the memory and complexity of someone they recently lost.But Chapter VI, “The Mortal Remains,” approaches death from an existential standpoint, something akin to the haunting dybbuk prologue of A Serious Man but with a never-before-seen stylistic gusto, as if introducing us to a whole new world-weary, aging Coen perspective. While the first five chapters all fall somewhere on the Western spectrum, the sixth trades in their gorgeous landscape shots for a more claustrophobic setting. Unfolding almost entirely within the confines of a carriage, “The Mortal Remains” barely gives us an establishing shot before hitting its five passengers with garish, stagelike, expressionistic lighting that grows noticeably colder as their journey continues. That final chapter of The Ballad of Buster Scruggs seems to have more in common with Jean-Paul Sartre than with the American Western, at least in terms of textural approach, but it’s also a nightmarish crystallization of the film’s philosophy up until that point. Brendan Gleeson and Jonjo O’Neill play a pair of singing bounty hunters tasked, as the Coens often are, with adjudicating the moment of death. Their methods are carnival-esque, involving entertaining sleight of hand before delivering the final blow, and the three passengers seated opposite them — Tyne Daly as an uptight conservative woman; Saul Rubinek as a gallivanting Frenchman; and Chelcie Ross as a wayward trapper — play audience to the duo as they themselves attempt to construct a coherent moral argument around all of humanity.While functioning as a creator-and-audience dichotomy — one bench in the carriage providing questions about our limited existence, the other stumbling amid a search for answers within the questions themselves — both sides of this confining vehicle are hurtling toward the same destination. Their carriage driver, an unseen, cloaked figure, refuses to stop until they get there. We’re all headed for the grave, creators and audiences alike, and the function of art often becomes, as Andrei Tarkovsky phrased it, “to prepare a person for death.”The Coens’ recent films have, by design, searched for meaning and come up short, seeking order within chaos ... only to find only more chaos. The journeys can be nihilistic (No Country for Old Men) or farcical (Burn After Reading), or some blend of the two (A Serious Man). Even the Coens’ own creative process, or at least the parts of it they project in Barton Fink — written during the making of Miller’s Crossing as a mentally hygienic reprieve — feels like being trapped in a perpetual hell with no answers. The Ballad of Buster Scruggs plays like the ultimate acceptance of this repetitive process, providing some of the most side-splitting laughs of the year at the cost of human lives (albeit fictional ones), even as we’re made to question this long-standing narrative paradigm. Moments of entertainment between the dread — nuggets of gold, much as Tom Waits’ prospector finds, while putting humanity’s worst foot forward — make The Ballad of Buster Scruggs one of their funniest yet hauntingly pessimistic films in years, asking whether questions about how or why we exist can have answers at all.The Ballad of Buster Scruggs is one of the most enjoyable films you’ll see this year. It’s a work that wants to you to question the familiar elements of what you see, so the backward step it takes in the framing of native peoples may as well be treated as a part of that equation, regardless of intent — an ugliness that has permeated cinema the way it has permeated ourselves, lingering like an unshakable thought. It’s Western folklore that, like folk singer Llewyn Davis and Western actor Hobie Doyle, can’t seem to progress beyond its worst creative instincts. But just as Llewyn and Hobie are two of the Coens’ most lovable and complex recent creations, so too will The Ballad of Buster Scruggs and its tales of the Western frontier likely be beloved, for better or worse. Siddhant Adlakha is an actor, independent filmmaker, television writer and freelance film critic. He lives in Mumbai, New York and online."}