{"id": "Am I the only one who cares that Days Gone was delayed again?", "paragraph": "Look, I just want my motorcycle gang video game, alright?I was hard pressed to find any sympathy yesterday when Sony said Days Gone was delayed another two months, now launching in April 2019. The game, under development since 2015 by Sony’s Bend, Oregon studio and announced at E3 2016, is a rather straightforward pitch — The Last of Us meets Sons of Anarchy, right? Who doesn’t like that? Boom, I just made you a million dollars. Yet it took forever to get a launch window and has been delayed twice now. The latest delay is probably just to get it out of the way of bigger premieres like Crackdown 3 and Anthem in late February.Dammit, I’m a paunchy, 45-year-old man with toilet-seat pattern baldness and the clock is ticking here. I’m going to have my first polyp removed before a proper motorcycle gang video game comes out on consoles. Every mid-life crisis trigger I’ve had I can self-medicate with a video game, except this one. Sports cars? Forza Horizon. Rugged exceptionalism? Red Dead Redemption 2 is out next week. College glories? Listen, not only did I create myself as a superstar quarterback in NCAA Football 13, I created myself as a coach to recruit myself.Yet somehow, the most toxically masculine fantasy of the consumer demographic with the most disposable income — i.e. paunchy 45-year-old men with toilet-seat pattern baldness — can’t find big time in a video game if you gave it a shovel and a map. Full Throttle was lovely but that was a point-and-click adventure that came out almost a quarter-century ago. Grand Theft Auto 4: The Lost and The Damned is a decent biker story, but that’s an expansion to the larger game. And then there’s Ride to Hell: Retribution, which is the only video game ever that a GameStop clerk tried to convince me not to pre-order. (He actually said, “Are you sure?”) Ride to Hell was announced in 2008, launched in 2013 and played like development stopped in 2010. It had sex scenes with people wearing pants (SFW), like a Cinemax movie from 1989. But it had a great theme song.Sons of Anarchy itself — whose Mayans M.C. spinoff premiered on FX in September and just got renewed for a second season — got into a deal for a video game adaptation. Creator Kurt Sutter promised he wouldn’t go in on “some slapcrap browser thing.” Instead it was a slapcrap mobile game. Ten episodes were planned for Sons of Anarchy: The Prospect. The game only delivered one, was removed from mobile marketplaces and its makers granted refunds to those who’d signed up for the rest.In other words, the bar here is incredibly low. If I was a video game, I would kill to have that kind of an emotional reference group. (That’s a term your therapist will use when you’re my age.) All you have to do is show up, Days Gone. You’re a PlayStation 4 exclusive. You’ve got everything in the world going for you. Why aren’t you happy?"}