{"id": "The greatest warriors of Apokolips are getting their own DC Comics miniseries", "paragraph": "The Female Furies are the greatest warriors of Darkseid, the fascist god of DC Comics’ Fourth World stories, and a new miniseries will show what happens when Apokolips’ most loyal soldiers realize that their devotion is getting them nothing. The first issue of Cecil Castellucci (Shade, The Changing Girl) and Adriana Melo’s (Plastic Man) Female Furies will hit shelves in February 2019, giving comics readers a nuanced story about some of the biggest, and yet baddest, women to grace the pages of comics. That story will begin with Granny Goodness, whose sadistic techniques have brainwashed thousands to die for Darkseid, growing frustrated that her Female Furies are always left behind when the men go to war. But what does a thirst for equality and recognition look like when it happens within a deadly, backstabbing, evil hierarchy? “The fact is that the Furies are kept down by the circumstances of where they live and who is in power,” Castellucci says. “How do women in that kind of world have an awakening, and ultimately a reckoning, with their lot? And how do they come into their own true power and become a team to make a change for better or worse? What does it mean to have someone’s back after years of stabbing people in the back?” Darkseid’s ultimate goal is to acquire the power to mold every mind in the universe to his will. But for now, Granny Goodness’ “orphanage” is his chief way of amassing his armies, and Castellucci is clearly interested in the complexities of control and complicity that Jack Kirby baked into the Fourth World. “Darkseid wouldn’t have kept Granny around if she wasn’t excellent at what she does,” Castellucci says, “He knows she’s exceptional and he is terrified of it. It is very common for people with absolute power to control people who are perhaps better, smarter, and stronger than them very close in order to control them. Dictators and power mongers tend to keep the people they are most afraid of down and strip opportunities away from them by keeping them on a tight leash.” DC’s Fourth World setting is having a bit of a renaissance these days, with celebrations of Jack Kirby’s centennial year in 2017, an upcoming feature film adaptation from Ava DuVernay and a bestselling Mister Miracle miniseries from Tom King and Mitch Gerads. But Female Furies is not spinning out of King and Gerads’ book — though Gerads will be providing covers for all six issues of Female Furies. Like Castellucci’s Shade, the Changing Girl, a reimagining of DC’s trippy hero Shade, the Changing Man, Female Furies aims to take a complicated facet of the DC Universe and draw a modern, stand-alone story from it. The series is set before the most famous of the Furies, Big Barda, escaped Apokolips. Castellucci said she would be pulling on a thread from Mister Miracle #8, “to unravel the way that Apokolips and the Furies are viewed.” “Sadly,” Castellucci says, “sometimes just because a woman is in power, it doesn’t mean that she is lifting all other women [...] I think that there is an existential sadness to being so suppressed that you are constantly forced to turn to the dark, rather than the light. How do you bear it? And what does reaching for something more grand look like?” The first issue of Female Furies will be released in February 2019. The six-issue miniseries will be written by Cecil Castellucci and drawn by Adriana Melo with a covers by Mitch Gerads. Here’s the official solicit text, from DC Comics: For their entire lives, the Female Furies have been raised to be the meanest, most cunning, and most ruthless fighting force on all of Apokolips. So why is it that Granny Goodness’ girls are left behind every time the men go to war? With the might of New Genesis hanging over the planet, and the Forever People making mincemeat of Darkseid’s army, Granny thinks it’s time all of that changed.And so it is that Big Barda, Aurelie, Mad Harriet, Lashina, Bernadeth, and Stompa set out to beat the boys at their own game. Little do they know, the game is rigged and one mistake could spell disaster for our heroines!FEMALE FURIES is an exciting new series featuring some of Jack Kirby’s coolest Fourth World characters, brought to life by the writer of SHADE, THE CHANGING GIRL and the artist of PLASTIC MAN!"}