{"id": "Netflix’s The Night Comes For Us is the wildest martial arts film of the year", "paragraph": "Early word compared The Night Comes for Us, the new film from Headshot and V/H/S/2 director Timo Tjahjanto, to the bloody spectacle of The Raid movies. There are surface-level similarities: Both are set in Indonesia, feature simple plots, pack spectacularly choreographed action and feature some of the same cast members, mainly Joe Taslim and Iko Uwais, who did fight choreography for both films. But where The Raid had a bigger focus on the character drama, The Night Comes for Us aims to play out like the most brutal rounds of Mortal Kombat brought to life. Now on Netflix, the film is a bloody good time for genre fans with steel stomachs.[Ed. note: this article contains mild spoilers for The Night Comes For Us.]The Night Comes for Us opens with a text crawl — Tjahjanto isn’t wasting screen-time on exposition —  explaining how The Southeast Asian Triad controls the smuggling trade in the region and operates “The Six Seas,” a secret group of badass assassins deputized by the Triad to do whatever it takes — maim, kidnap, kill — to keep the peace. Ito (played by Joe Taslim), one of the Six Seas, decides he’s had enough killing, and spares an innocent little girl after his troops burn down her village. When asked to execute the girl, Ito turns his weapon on his squad mates and kills them off instead, then takes the girl and runs home, knowing once the other Seas find out, everyone he knows is done for.Tjahjanto is not terribly concerned with plot. A big MacGuffin moves the plot forward, but the writing is trope-filled and self-aware, knowing most people who watch will require the minimal amount of emotional investment. Instead, the carnage comes quickly; once the Triads send Ito’s childhood best friend and unstoppable force of destruction, Arain (Iko Uwais) to take out the man he considered a brother, the film kicks into high gear. From the start, we are promised a big battle with the Final Boss, and the interim encounter wave after wave of expendable henchmen. Tjahjanto makes every fight relentlessly violent and exciting.I can’t emphasize this enough: At least 85% of The Night Comes For Us is just people punching, stabbing, shooting, maiming, and otherwise killing each other. Tjahjanto, cinematographer Gunnar Nimpuno, action coordinator Iko Uwais and visual effects artist Greg Dora deliver some of the most jaw-dropping action scenes since John Wick: Chapter 2. “Bodies aren’t supposed to do that!” is the message of most of the set-pieces, as so many broken bones burst through the skin, chest get chopped, limbs get snapped, heads get smashed, sharp weapons slash through all kinds of body parts, and thousands of bullets go in and out of bodies in such astonishing violent and creative ways that the mind drifts to hours spent in biology class. Violence of this level could get repetitive or boring, but Tjahjanto constantly one-ups his last move, defies the limits of what this type of movie is supposed to do, to the point where one can barely spare a second to blink.The plot is meager, yet the performances are absorbing — we feel the excruciating pain and the rush of 15-minute long fight scenes. Taslim keeps the adrenaline pumping to sell us on what’s at stake (the life of a sweet, innocent girl), the pain of having to fight your former comrades, and the complete disregard for the laws of nature. Ito should have died eight times over the course of The Night Comes For Us, as he endures the most brutal beatings captured on camera, but he picks himself back up each time. Iko Uwais, while not a great villain, does a ridiculously satisfying performance that looks like he’s having the time of his life — and after the whole Mile 22 thing, it’s a welcome sight to see him in his environment. The real standouts of the film are three badass female fighters, each with unique weapons and fighting styles, who easily put the rough guys in their place with the film’s finest set-piece.\tThe Night Comes For Us is not without fault. A bunch of overly complex details make the rules of the film’s world a bit confusing, and you certainly won’t be able to remember a single character name or plot point when the credits finally roll. If gaps in logic concern you, beware: the characters’ ability to stay alive after so many stabbings and gunshots instantly obliterates any credibility. That said, Tjahjanto is not working in the real world. The Night Comes For Us is an almost two-hour parade of button-mashing fight-game mayhem. It also manages to be very educational: Did you know any inanimate object — caution signs, pool table pockets and balls, plastic drapes, meat locker hooks, a cow femur — can be a weapon in the right hands? Anyone holding out hope for The Raid 3 should instead look at this daring, extreme piece of action filmmaking. To the masters of excess before him, Timo Tjahjanto pretty much says “hold my beer.”Rafael Motamayor is a freelance TV/film critic and reporter living in Norway. You can find more of his work here, or follow him on Twitter @GeekwithanAfro."}