{"id": "Pokémon Go players are finding this shiny Pokémon all over the place", "paragraph": "The odds are against anyone trying to find a shiny Pokémon in Pokémon Go — unless you’re hoping for a shiny Shinx, a gen-four Pokémon that’s now in the game. Numerous players worldwide are sharing the sparkling Shinx they’ve caught just days into its availability, a huge surprise about this otherwise hard-to-find Pokémon.Shinx is an electric-type quadruped (and it’s one of Sinnoh’s cutest Pokémon), appearing infrequently in Pokémon Go thus far. It’s most readily found in Raid Battles, along with the occasional 10-kilometer Egg. Wherever they’re getting it from, people are surprised to see the Shinx they’ve just captured as a bright-yellow cub, instead of the blue one it usually is. That a fourth-gen Pokémon already has an obtainable shiny form is already a big deal, but the amount of people sharing their special finds is a particular surprise.OMG.. my all time favourite pokemon.. I got it in shiny, with awesome IV‘s   couldnt wish for more, absolutely grateful! #shiny #shinx #luxray #Gen4 #barefoot pic.twitter.com/yvaktVTmFAWHAAAAAAAAAAAAT?!?!?!?!SHINY SHINX IS AVAILABLE IN RAIDS?!DUDE, LUXRAY IS MY FAVORITE GEN 4 POKÉMON I'M HELLA HYPE!!!#PokemonGO (sorry for the caps but NOT REALLY, IM HYPE WTF!) pic.twitter.com/m6HwPCUyOiI didn’t think I’d be back to playing pokemon go yet here I am 2 years later, losing my shit because I just hatched a Shiny Shinx. pic.twitter.com/xzTe5fPowTThe bad news is that Raid Battles featuring Shinx can be hard to come by. The Pokémon isn’t yet available in the wild, so the most anyone can do is cross their fingers and check out as many gyms in the area as possible. It’s a first-tier Raid Battle boss at that, which is the least exciting type for players. The odds of finding a Shinx at all don’t seem great, as members of The Silph Road are pointing out. “The number of Shinx raids you’d have to hit to have a good chance of getting a shiny is pretty ridiculous,” wrote one Redditor. “I think you usually want to double or triple the 450 number [the traditional shiny-Pokémon odds] before you can reasonably say ‘I should have this by now.’ Hitting near 1000 Shinx raids when it’s not even the only thing that can come out of T1 eggs would be a very difficult if not impossible feat.”All that said, it’s surprising to see so many people still manage to find shiny Shinx after only a few Raid Battles. And some players think that Niantic may have boosted the rates at which you can find a Shinx Raid — and, better yet, a shiny Shinx."}