{"id": "Blizzard responds to Diablo: Immortal backlash", "paragraph": "Blizzard unveiled Diablo: Immortal, a new game set in the the Diablo universe built for mobile devices, at BlizzCon 2018’s opening ceremony yesterday, and reaction from fans has been unkind at best. The game’s announcement trailer has racked up more than a million views but it’s also received more than 257,000 dislikes. Multiple threads on the Diablo series subreddit have bemoaned Diablo: Immortal as a reskin of a pre-existing mobile game, calling Blizzard “out of touch” and equating the announcement to “a slap in the face.” During a BlizzCon panel, one attendee who stepped up to the microphone during a Q&A session sarcastically asked whether Diablo: Immortal was a delayed April Fool’s Day joke.Suffice it to say, a vocal portion of the Diablo fan base isn’t happy with Blizzard’s Diablo: Immortal announcement.Today, Polygon spoke with Allen Adham, executive producer and Blizzard co-founder, and Dan Elggren, production director, about the response to Diablo: Immortal. The pair repeatedly stressed that Immortal is just one of the Diablo games currently in development at Blizzard and they hoped that fans will remain patient for future announcements.“We have said that we have multiple Diablo teams working on multiple Diablo projects and that remains true, even after releasing [Diablo 3 for Nintendo] Switch and announcing Diablo: Immortal,” Adham said. “We still have multiple Diablo teams working on multiple unannounced Diablo projects. Diablo is a tentpole franchise for us. And it always will be. We love it. We hope our fans understand what we’re saying when we say that.”Adham said that Diablo: Immortal was developed as a way to bring the Diablo experience to the hundreds of millions of people who play games every day on their mobile device, including those who have transitioned from console and PC.“The world is evolving both geographically and demographically,” he said. “Younger folks now, many of them, mobile is their primary gaming device. And then around the world in many regions it’s their primary gaming device, and so it’s always been our aspiration [to bring games to them]. \n    Related\n  “We’ve been around for around three decades and we’ve been making games on many different platforms during that time, going all the way back to Amiga and Commodore 64 to the Super Nintendo and Sega Genesis. So to us, this is another gaming platform ... The opportunity to bring this to an all new audience or to bring it to players who have shifted their play patterns to mobile and bring them all together with an authentic Diablo experience, it’s super exciting for us.”“[Diablo: Immortal] was created from the ground up — from the initial get-go [our intention] was to create that Diablo experience on mobile,” Elggren said. “So the feel, the UI and everything around this game is built with the philosophy to make the best Diablo experience we can on a mobile platform.”Regardless of Blizzard’s intention to do right by Diablo, reaction to Immortal has been largely negative. Part of that response may be the hardcore gaming audience’s aversion to watered-down mobile versions of long-running game franchise. It’s also likely that backlash can be chalked up to high expectations for BlizzCon and hunger for a long-awaited sequel to 2012’s Diablo 3.In our interview, Adham said that some Diablo fans will probably change their opinion of Immortal when they actually get their hands on it.“We definitely feel that playing is believing,” Adham said, “and we definitely value our fans. We feel that they’re passionate about the franchise ... and they put their heart into it just as we put our heart into it. And we hope that as they get opportunities to see people play, see more of the gameplay, they’ll see that passion that’s in this game... What we see is anybody who actually holds it and plays it feels great about it. “The way I’ve been kind of looking at the mixed comments is what those folks are really saying is they desperately, passionately want the next big thing. So I actually think that those two items are being conflated. So I don’t think that the mixed comments are necessarily anything other than when a really passionate audience that desperately wants to see what they hope to see one day ... It’s pretty clear to us that there is a huge audience around the world that is gonna love this title. So hopefully we’ll get there.”Finally, I asked Adham and Elggren about how they approached the reveal of Diablo: Immortal, and if they had concerns beforehand that fans would bristle at the game’s announcement.“We did,” Adham said. “We’ve had many conversations — and I’m sure we’ll have many more actually in the aftermath of this — about the strategy of weaving mobile gaming into our BlizzCon audience, which is a very passionate desktop PC and console audience. We had a fairly similar reaction when we announced Hearthstone; if you think back to the Hearthstone announcement at [PAX] our audience at the time, [fans were] a bit unsure of what to expect from a digital card game given our history of making other game types. But then if you look at our history, part of what we do at Blizzard over many years is make different games and different genres, one after another on different platforms. So we’ve done this for a long time, and it usually starts with a little bit of sort of uncertainty and then we win [over] our community over time.”“We take the time to iterate to put out the best experience,” Elggren said, “You know, we’ll listen to the passion we have from fans, and we we’ll definitely take those things to heart and make sure we do right [by them].”"}