{"id": "5 new comics to check out this week", "paragraph": "A trove of new comics arrives to stores and digital platforms each week, from DC Comics and Marvel Comics’ latest to smaller publishers’ releases that hope to catch some attention.But with all the books out there, jumping in can be a daunting task. Not sure where to start when it comes to this week’s comic releases? Here are six picks to get you started (and don’t forget to read out running list of the best comics of 2018).Written by Brian Michael BendisArt by Ryan SookAfter reaching the #1000 milestone earlier this year, The Man of Steel continues his adventures, tackling what might be the most complicated task of all: dealing with his relationship. After Lois Lane returns from a trip in space, Superman confronts her about why she hasn’t contacted him — and if she still loves him. The two redefine their relationship in this issue, handling the problems of their rather unconventional marriage in a mature way. Written by Kat HowardArt by Tom FowlerNeil Gaiman’s iconic comic miniseries gets a new rendition. Part of the greater, growing Sandman universe, the original Books of Magic stories followed young Timothy Hunter, a bespectacled dark-haired British teenager (pre-dating the other magical bespectacled dark-haired teenager by a few years) destined to become the world’s greatest magician, as he grew up and realized his destiny. This new take goes back to Tim’s youth and explores his early involvement with magic. For those looking for more Sandman, the 30th anniversary edition of The Sandman Vol. 1: Preludes and Nocturnes is also out this week.Written by Daniel KibblesmithArt by Ricardo Lopez OritzA humorous showdown from Lockjaw and The Late Night with Stephen Colbert writer Daniel Kibblesmith, Deadpool Vs. Black Panther takes two Marvel favorites and pits them against each other. After accidentally injuring an innocent man during a fight with the Wrecker, Deadpool goes on a search for Vibranium to save Willie Lumpkin, the mailman. But since it’s Deadpool, he doesn’t exactly go about this hunt in a typical way, which makes the King of Wakanda a little pissed off. Written by Paul JenkinsArt by Marco CastielloFor the first time, writer Paul Jenkins (Hellblazer, Spider-Man) takes on the futuristic judge in Judge Dredd Toxic. Though Judge Dredd takes place in a future dystopia, this issue tackles some heavy immigration issues that hit close to home. After the death of a genetically-modified toxic waste worker, the residents of Mega-City One make some shocking discoveries, which fuels an anti-immigration frenzy.Written by Kyle StarksArt by Chris SchweizerThe cult classic, sci-fi trading-card series returns to comic book stands with a fun new reimagining. Slacker Spencer finds himself entangled up in an alien invasion! The series debuts with six different cover variants out by Tom Mandrake (The Spectre), Ruairí Coleman (KISS/Army of Darkness), Eoin Marron (James Bond: The Body), Robert Hack (Dr. Who), Chris Schweizer (The Creeps), and Ken Haeser (The Living Corpse), plus a blank version for readers to draw their own Martian invasion. "}