{"id": "Red Dead Redemption was a fantastic hunting game ", "paragraph": "Red Dead Redemption is the kind of game — even years later — that was perfect for different people for completely different reasons. For some, it was all about good-ol’ John Marston and his “I wanna be good, but I have to do bad first” dilemma. For others, it was a game that let them twirl their mustache and rob banks. But for my friends and me? Red Dead Redemption was all about the hunt. The great American plains made for the perfect hunting landscape. In single player, any kind of movement in the open world was an excuse to jump off the path and track down any varmints I could find. Even better, hunting was an easy way to make money in Red Dead Redemption, so I got paid for doing what I loved.But playing online is truly where hunting had the biggest impact on me. Before the explosive success of GTA Online, Red Dead Redemption’s online mode let players peacefully, or not-so-peacefully, roam the world in a posse. In these groups, anyone could accept hunting challenges that would pit them against especially tough animals.The challenges started out easy — we’d have to take out some deer, or a couple of coyotes — but difficulty really spiked when it came time to fight the most dreaded beast in all of Red Dead Redemption: cougars. Cougars could be found in the northeastern parts of the map, in the woods. While you may think bears are the most vicious animal in these parts, the cougars were far more deadly. They moved at the speed of light and were capable of killing anyone in a single swipe if they weren’t careful. What started as an in-game hunter challenge that required us to kill five cougars in the woods soon evolved into a sort of cougar-themed Thunderdome for my friends and me. For years after Red Dead Redemption launched, we would group up online and pit ourselves against nature’s hellcats. The location was always the same. In the forest, a single cabin stood in among the trees. Cougars would roam in packs around this area, constantly encroaching on the cabin’s space. While their bulky bodies were too wide to fit through the cabin doors, everywhere nearby was fair game. Friends and I would play for hours at a time, picking off cougars through the windows of the frozen cabin. Sometimes we’d run out into the snow and face them with our knives, just to see how long we could last. Other times, we’d take pot shots through the cabin’s tiny windows, always dumping more ammunition into the finely crafted wood than the pelts of the cougars. But no matter which extra challenge we posed to ourselves, we made our own fun in this giant, cougar-filled sandbox. Of course, Red Dead’s cougars were overpowered and broken — one wrong move and you were toast. But some of my most cherished gaming memories come from running around that cabin, trying to blow up a cougar with dynamite, and laughing when it all went to hell. "}