{"id": "Indiana Jones mini-land may finally come to Disney’s Hollywood Studios", "paragraph": "After many years of trial, an Indiana Jones mini-land may finally come to one of the Walt Disney World resorts, Orlando Weekly reports. More specifically, it could be added to Disney’s Hollywood Studios, which most recently received a Toy Story-themed land, with the upcoming Star Wars: Galaxy’s Edge also in the works.According to Orlando Weekly, it seems that this proposed Indiana Jones mini-land will include an indoor family ride, an outdoor rollercoaster attraction and a possible themed resort, much like the nearby Star Wars land. We reached out to Disney for confirmation.The concept of an Indiana Jones mini-land has floated around Disney for quite some time, bouncing from a proposed subsection of a possible India Pavilion in Epcot to Indiana Jones taking on the dinosaurs in Animal Kingdom’s Dinoland. None of those ideas gained much traction, possibly due to the awkwardness of a white, tomb-raiding interloper in the India Pavillon and the weirdness of Indiana Jones punching a dinosaur, so Disney turned back to Hollywood Studios, which houses their only Indiana Jones attraction anyway. Originally, Hollywood Studios — previously known as Disney-MGM Studios Theme Park — was a showcase of film, television and theater inspired by the Golden Age of Hollywood, while also housing a working production studio. In recent years, most of the “Hollywood” and “studios” parts of the park have been closed down or revamped, however. Production work stopped there in the 2000s, the Great Movie Ride closed last summer, and priority has been given to Disney’s third-party properties including Pixar, Star Wars and the Muppets. But one of the featured attractions in Hollywood Studios does currently star Indiana Jones: the Indiana Jones Stunt Spectacular, intended to give parkgoers a behind-the-scenes look at stunt action. The Indiana Jones mini-land is planned for sometime after 2021. Hold onto your whips for further announcements."}