{"id": "The Crimes of Grindelwald’s big ending shakes up the Harry Potter timeline", "paragraph": "Fantastic Beasts: The Crimes of Grindelwald takes us back to the wizarding world of Harry Potter, but with a goal of shaking up what we thought we knew. This time, Newt Scamander (Eddie Redmayne) journeys to Paris, along with the characters from the first Fantastic Beasts, plus a few familiar faces and names from the original Harry Potter show up to join in on the action. For most of the runtime, it’s your standard magical adventure.But the ending of the movie shocks even the most diehard fans with a mysterious character reveal, one tied to the existing canon though way out of left field. What we thought we knew, we didn’t, and saying anything without flagging for spoilers would get us locked up in Azkaban. So about the grand finale...[Ed. note: This article contains major spoilers for Fantastic Beasts: The Crimes of Grindelwald.]The movie juggles multiple plot lines, but at the very core of it all is the desire by Credence Barebone (Ezra Miller) to find out his real lineage.After at least three separate breaking and entering situations and a showdown in an eerie tomb, it turns out that the lead he’s been chasing this entire time is a red herring. Credence isn’t the lost Lestrange baby as we’ve been led to believe, because Leta Lestrange (Zoe Kravitz) swapped babies on an ill-fated boat journey and actually has no idea which baby she picked up. All is for naught. Except ...In the very last moments, Grindelwald reveals that he has known who Credence is all along — and it’s not a Lestrange. Credence is actually Aurelius Dumbledore, suggested to be a mysterious fourth Dumbledore sibling that no one ever knew about. And apparently, his brother is bent on killing him. Here’s what we knew about the Dumbledore family before The Crimes of Grindelwald: Albus, played by Jude Law here and Richard Harris and Michael Gambon in the original Potter movies, was the eldest of three siblings, born in 1881. His younger brother Aberforth (played by Ciarán Hinds in Deathly Hallows) was born a few years later, sometime between September 1883 and August 1884. The two had a little sister named Ariana, born in 1885.As we learn in the Deathly Hallows book, when Ariana was 6 years old, she was assaulted by a group of Muggle boys, which deeply scarred her and left her unable to properly control her magic. Furious, the father of the family Percival attacked those boys, and was then thrown in Azkaban in 1891, where he later died in 1900. Ariana was raised by her mother, Muggle-born witch Kendra, until Ariana lost control of her magic in 1899 and an explosion killed Kendra.A few months later, Ariana was killed by a stray spell during a disastrous duel between Aberforth, Albus and Grindelwald (who had become a close friend — and more — to Dumbledore). The fallout sent each man in different directions: Albus became a teacher, Aberforth raised some goats and Grindelwald got a bad undercut. So where does Credence — now Aurelius — fit in with all of this? The canonized timeline makes the Crimes of Grindelwald reveal seem a little wonky. Credence’s adoption certificate (a prop created by MinaLima Designs, the company that has worked on the Potter films since Sorcerer’s Stone) lists his birthday as Nov. 9, 1904 — both Dumbledore parents were dead at this time. The certificate itself is for a year later, in October 1905, but it’s highly unlikely that they passed a 1-year-old as an infant, especially considering he was essentially in Muggle hands at the time.Percival Dumbledore was in Azkaban starting from 1891, so if Credence was realistically his and Kendra’s child, he would’ve been 14 at the very least. It’s unlikely that Credence would be Percival and Kendra’s child, though, because when Aberforth tells the Dumbledore family backstory in Deathly Hallows, he never mentions any siblings beyond Albus and Ariana. There’s the argument that maybe Percival had a kid with some prisoner in Azkaban and that’s the reason the baby was being sent off on a boat when Leta Lestrange swapped them, but that still requires Credence being at least 4 years old (and implies that Azkaban is lax enough to allow prisoners to get it on whenever). The official script for The Crimes of Grindelwald, published in tandem with the film’s release, says that boat journey where the babies were swapped took place in 1901, three years before Credence’s birth, so something is definitely up. But let’s consider another angle: While Grindelwald did tell Credence earlier that he is the only one who can kill Dumbledore, and that a brother wants to kill Credence, he didn’t explicitly say that Albus or Aberforth are Credence’s brothers. The Tales of Beedle the Bard mentions that Albus and Aberforth have an aunt named Honoria. Though it’s not mentioned whether she’s maternal or paternal, there’s a story about how she was once engaged to a wizard. Since Kendra was a Muggle-born, we can assume Honoria is Percival’s sister, making her a Dumbledore. It could very well be possible that Credence is her child and she has another son — a whole family of Dumbledores that we don’t know about.Albus Dumbledore himself never opens up about his family within the original Potter series; the brunt of his backstory is revealed in Deathly Hallows by Aberforth, who has yet to make an appearance in the Fantastic Beasts series. Beyond Aberforth (and eventually Harry, Hermione and Ron), we don’t know any other character who knows the Dumbledore family’s full backstory. There’s no references to another Dumbledore family member in the original series, but considering the secretive nature of Albus’ character and his fractured relationship with his brother, it’s not completely out of the realm that Albus would keep the information to himself, even after discovering a long-lost family member at one point in the next three movies. Since none of the other Fantastic Beasts characters appear in the original series, Dumbledore’s own silence on his personal life render this a possibility.But we can’t count out the fact that Grindelwald, who has a very intimate knowledge of the Dumbledore family, is just preying on Credence’s deep need to belong and feel like a part of something, and twisted up some complicated backstory to compel him to murder Dumbledore. A comforting thought, since it doesn’t retcon the details about the Dumbledores as illustrated in Deathly Hallows. Then again, J.K. Rowling isn’t one to let anything stay as it was."}