{"id": "The Coen bros’ Buster Scruggs channels Red Dead Redemption 2’s side missions", "paragraph": "The Coen brothers aren’t strangers to the Wild West, but with their new film, The Ballad of Buster Scruggs (now streaming on Netflix), they take things in a different direction. In many ways, the anthology film brings to mind this year’s biggest game release, Red Dead Redemption 2.It’s not just the Wild West setting. The tone of Buster Scruggs, which strings together six individual stories to form a feature, is reminiscent of a very specific aspect in Red Dead 2: The side missions.The main story of Red Dead Redemption 2 focuses on Arthur Morgan and the van der Linde gang as they struggle for survival. It’s overwhelmingly serious and dark, with that single through-line spanning dozens of hours.Sprinkled among that odyssey are side missions that offer some levity, variety and outlandishness to keep things from becoming too much to bear. In these side missions, Arthur’s character essentially vanishes into the background as minor characters take center stage. From a duo of masochistic brothers to an esoteric nature photographer, these characters are blunt, almost cartoonish character studies that would never be mistaken for realistic portrayals of life in the west.The Ballad of Buster Scruggs, built from stand-alone tales of varying outrageousness, summons a similar energy with its troupe of eccentrics and Western stock characters The title story, “The Ballad of Buster Scruggs,” features the title character (Tim Blake Nelson) traveling through a movie lot-styled West in a pure-white cowboy getup, whistling and singing along with his horse. That is until we learn that he’s a merciless, unthinking murderer, capable of gunning down entire bars of unseemly (yet undeserving) outlaws. And despite the initial tone of this story, the Coens’ do not pull any punches when it comes to gore, which attains levels that would make Robocop director Paul Verhoeven blush.In another story, “Near Algodones,” we’re introduced to a banker (played marvelously by Stephen Root) who has never been successfully robbed. Perhaps it has something to do with his willingness to cover himself in frying pans as a western take on full body armor? “Pan shot!” he cries whenever James Franco, the outlaw in this scenario, unsuccessfully goes for a fatal shot.Like Red Dead, not every story in Buster Scruggs reaches this level of cartoonishness. “All Gold Canyon,” starring Tom Waits, is a simpler tale of a prospector hunting for a payday all alone in the wilderness. You follow along with his life and process as he gathers food and gets closer to his beloved “pocket” of gold.Could any of these characters sustain an entire movie? Probably not. But like the side characters you meet throughout Red Dead 2, they offer a brief, often entertaining glimpse into a small corner of the filmic Wild West that doesn’t always get much attention. They’re a respite from the intensity that tends to overwhelm the the Western genre and I’m more than happy to spend a few minutes with them."}