{"id": "Rainbow Six Siege content censored for China launch, angering fans", "paragraph": "Art assets in Rainbow Six: Siege will be toned down to conform to Chinese censorship requirements as the game gets ready to expand into Asian markets. The news, and Ubisoft’s rationale, have alienated many fans of the multiplayer shooter.Developers vow that the changes being made will have no impact on gameplay. That said, “there will be some adjustments made to our maps and icons to ensure compliance.” Ubisoft Montreal said it won’t maintain two parallel builds, one for Western audiences and a China-compliant one, in order to “reduce the duplication of work on the development side. This will allow us to be more agile as a deelopment team, and address issues more quickly.”What kind of changes can players expect in Siege’s next season? Well:and:and:and even:The ban on skulls extends even to the icons in the action feed. (China’s content censors have a weird thing about the undead, I was told a while ago, which is why Call of Duty Online has cyborgs instead of zombies.)Again, Ubisoft Montreal swears “We are adjusting art and visuals, but are not compromising what makes Rainbow Six Siege the game you know today.”Fans in the game’s subreddit still feel condescended to, and resent having Chinese censorship limitations imposed on the game they’ve played for three years. It didn’t help that a community manager popped in to give an explanation that sounds like China is getting its own version of the game anyway.“Moving forward, we do recognize and understand that for some elements, it is not possible to have a completely global build. Thus, there will be some things that are split build-wise,” the manager said. “This branched build will be region locked, and will not have access to the worldwide data centers to engage with our existing player base — furthermore, VPNs will not function as a workaround.”That explanation, by the way, has a score of negative 3,054. Here’s one top reply:“If they have two builds anyways then leave us what we have now (Clubhouse, Skull-headgears, etc.) and do your new commie-censorship game moving forward without making us feel like your taking away,” said redditor salbatross.“Make a totally uncensored build for everyone outside of China, it’s that simple,” said kungfukai. “Valve does it with Dota 2 and CSGO, you guys can do it with R6S.”Rebel952 summarizes it thusly: Please understand it is not the changes that are upsetting most people. It is the reason being given that changing the game that we have all given you money for because it needs to be held to a communist regime’s standard. The changes were announced on Ubisoft’s official blog yesterday and will be implemented in Year 3, Season 4 coming later this year. Rainbow Six Siege launched in December 2015. The game’s third season, third year (Operation Grim Sky) launched back in September.Earlier this year, Ubisoft moved aggressively to sanction players for hate speech in the game’s chat. Some complained about the swift justice handed out, but it didn’t seem to harm player numbers. Earlier this year, Rainbow Six Siege hit an all-time high player count that was more than triple what it had been the year before."}