{"id": "Destiny 2 Xur location and items, Oct. 19-22", "paragraph": "\nOur Destiny 2 guide explains everything you need to know, including choosing a class, a guide to Exotic armor, emotes, weapons, sparrows and ships, how to trigger Heroic Public Events and much more. \n  If you played Destiny, you may be familiar with Xur, the weekly Exotic item merchant. In Destiny 2, he’s back, and now appears all over the map. This week, he’s on Io. You can find Xur hanging out inside a small cave to the east of the Giant’s Scar landing zone.Xur’s inventory this week consists of the following:Xur’s inventory to caps out at 581 if you’re at 600 power — one Light above your Collection. He also offers specific rolls on each armor piece each week, giving out different perks for the same pieces. We’ve highlighted any great rolls below. The Crimson hand cannon arrived in Destiny 2 with the Curse of Osiris downloadable content. However, Destiny players may recognize it as an offshoot of the fan-favorite weapon Red Death. Its first exotic perk is Banned Weapon, which causes it to fire in three-round bursts. Its secondary perk. Cruel Remedy, causes Crimson kills to heal the player. If they’re precision kills, the magazine is instantly refilled.Crimson is an awesome hand cannon, capable of some real destruction in the right hands. This is one of those weapons that players will either love or hate, depending on their preferences. If you enjoyed Red Death in Destiny or just love pulse rifles (which also fire in bursts), this is an awesome weapon. If none of that sounds appealing to you, you can probably skip it.In terms of Hunter exotics, Dragon’s Shadow is only decent. Its exotic perk, Wraithmetal Mail, will reload all of the Hunter’s weapons when they dodge, which also increases movement and handling speed for a brief time after. This bonus is mostly valuable in PvP. However, Hunters already have Foetracer and other excellent PvP exotics to take. If you’re a hardcore PvP player or find yourself caught 2v1s frequently, pick this up. If none of that applies to you, skip it.This week’s roll: Low mobility and high resilience, with a choice between resilience and recovery. Tier one gives a choice between unflinching fusion rifle aim, unflinching bow aim, and unflinching sniper rifle aim. Tier two offers scout rifle reserves and special ammo finder. This is an OK roll for PvP, nothing to get too excited about if you don’t use snipers or fusions much. Best Hunter Exotic armor in Destiny 2Ashen Wake is one of the new exotics in Destiny 2: Warmind. Its main exotic perk is Bring the Heat, which causes the Fusion Grenades used by solar Titans to explode immediately on impact and travel faster in mid-air. This is a cool exotic on paper, but it doesn’t actually add any damage to your grenades.When other grenade related exotics like the Armamentarium exist, Ashen Wake is a hard sell for your single exotic spot. However, the effect is still pretty fun to use, especially if you’re accustomed to more instant gratification grenades like the Striker’s Pulse Grenades. If you’re a collector or hammer Titan enthusiast, pick these up.This week’s roll: High resilience, with a choice between resilience and recovery. Tier one offers a choice between hand cannon loader, fusion rifle loader and impact induction — melee damage refunds grenade energy. Tier two gives the choice between shotgun scavenger and heavy ammo finder. This is a fantastic roll for PvP, and you should definitely pick it up this week. Best Titan Exotic armor in Destiny 2Crown of Tempests is a pretty great Warlock Exotic, especially if you like Stormcaller. This helmet’s main perk, Conduction Tines, causes Arc ability kills to recharge your Arc abilities and increase the duration of your Super. The only bad news about this helmet is that it needs to be used with Stormcaller, which is a great PvP Super now and decent for enemy clear in strikes and raids. If you don’t have this helmet for your Warlock, you should definitely consider picking it up.This week’s roll: Medium mobility and low recovery, with a choice between mobility and recovery. Tier one offers a choice between bow targeting, hand cannon targeting and hands on — melee kills grant Super energy. Tier two gives the choice between shotgun reserves and heavy ammo finder. This roll is pretty decent in PvE, especially if you’re an aggressive Warlock player.Best Warlock Exotic armor in Destiny 2Destiny 2 guide"}