{"id": "The Criterion Collection will launch stand-alone streaming channel", "paragraph": "The Criterion Collection, which had a foot in streaming before the announcement that FilmStruck would shut down at the end of November, will return to devices in the near future with its own stand-alone channel, the company announced on Friday.Known as the Criterion Channel, the service will launch in spring 2019, and will be an entirely separate service from the previous partnership with FilmStruck. One of the primary goals of FilmStruck was to help users better identify and choose films by highlighting specific genres, directors and themes, through careful curation handled by filmmakers and film scholars. In the company’s announcement of its new service, Criterion doubled down on this idea, ensuring that fans know that curation will continue to be a top priority when the new service launches. The announcement also mentions that part of what helped Criterion decide to create its own channel was the legion of support it has received since the announcement of FilmStruck’s demise from both fans and major filmmakers. This week, a petition put together by some of Hollywood’s most famous creators — including Paul Thomas Anderson, Guillermo Del Toro, Leonardo DiCaprio and Sofia Coppola — as well as personal pleas from Steven Spielberg and Martin Scorsese, urged FilmStruck’s parent company WarnerMedia to reconsider scrapping the service.While this seems to have worked in getting the Criterion Collection films a new home for streaming, it’s unclear if the rest of FilmStruck’s library, which included films from Turner’s Classic collection as well as MGM, will find a new home. Some of these films could be available as a part of the larger WarnerMedia streaming service, which is also set to release sometime next year, but no plans have been announced in the wake of FilmStruck’s collapse. Criterion’s new service will eventually be available as a channel on the planned WarnerMedia service.Criterion’s announcement of the new channel ends with an impassioned plea asking FilmStruck fans to subscribe to the new channel, which is offering charter subscriptions now. The charter subscription includes a free 30-day trial as well as a reduced subscription fee: $9.99 per month, instead of the $10.99 for regular subscribers."}