{"id": "Preview program for PS4 name change update comes with a long list of warnings", "paragraph": "PSN ID changes are finally on the way for PlayStation 4 users, but it looks like the process might not be as painless as we hoped. According to several ResetEra users who have received invitations to the PlayStation Preview Program’s system software 6.10 preview, a whole list of warnings accompanies the name change feature. One testing email, which appears to have only gone out to PlayStation customers in the United Kingdom thus far, was posted on the forum by user AbandonedTrolley. The initial message confirms that the upcoming patch 6.10 will include the chance to change PSN IDs. However, a follow-up post on that same thread, from user Azdoune, quotes the numerous caveats that the change comes with. The message starts by warning players, “Not all games and applications for the PS4™, PS3™, PS Vita, and other PlayStation® systems support the Online ID change feature.” The warning continues, by listing the possible consequence of changing your ID:You may lose access to content (including paid-for content) that you have acquired for your games, including content like add-ons and virtual currency. You may lose your progress within games, including game saved data, leaderboard data and progress toward trophies. Parts of your games and applications may not function properly, both online and offline.Your previous Online ID(s) may remain visible to you and other players in some places.The message also specifies some of the details that are, at least for now, specific only to the preview version of the ID change feature. First change is free for all users. Second change will be charged at €9.99 / £7.99 (PlayStation®Plus subscribers receive a 50% discount). If your previous Online ID violates any of the current Terms of Service, you will not be able to revert back to your previous Online ID. You can revert to your previous Online ID once per account during the preview period. Sub-Accounts cannot utilise the Change Online ID feature. After you change your Online ID, it may take a few hours for some services and applications to reflect the new ID. The notice also informs players of what will happen should they choose to switch back to their original ID, which can be done once during the preview program. Apparently, switching back to your previous ID will not necessarily give you access to any old content you lost in the first change, and changing back may also lose addition content. It’s unclear just how likely it is that players will actually lose content or paid-for add-ons in the process of changing names, but Sony at least feels that it’s enough of a possibility to warn preview program users about. Polygon has reached out to Sony for confirmation of the detailed changes, and will update when we hear back. Update (Oct. 26): Sony confirmed the list of potential issues they sent to members of the Preview Program to Polygon.A Sony representative also offered further clarification:As we noted in our announcement, this feature is compatible with PS4 games originally published after April 1, 2018, and a large majority of the most-played PS4 games that were released before this date. While there is a possibility that select games may encounter issues when changes are made to a user’s online ID, we expect this to be a small amount of games that are affected."}