{"id": "Fallout 76 desperately needs private servers", "paragraph": "Fallout 76 is in desperate need of private servers. The time I spent with the beta Tuesday night on Xbox One felt awkward, with other players as well as global events intruding on what has traditionally been a solitary experience. I understand that Bethesda is taking a calculated risk with its next game by trying to add something new to the Fallout series, but if the company isn’t careful, Fallout 76 may diminish the franchise in the eyes of its most dedicated fans.Last night’s beta was weird. I was dropped into the game world rather unceremoniously, waking up inside my bedroom underground in Vault 76. From there it was a straight shot past a few tables filled with supplies and a few helpful tutorial messages. In minutes I was outside the vault, squinting into the daylight.And there was someone standing next to me. They were trying to punch me in the face. Then they switched to a machete. I could hear them mumbling into their headset to someone else in the room.“This fucking sucks, dude,” they said, before wandering off into the wasteland.Left blissfully alone, I began exploring. I found a small shack with a banjo. When I hit the action button, the camera shifted to the third person as my character sat right down and played an Appalachian tune. On the horizon, the sky began to lighten. Now we were getting somewhere. For my troubles, I was given a small buff called Well Tuned, which granted me an hour’s worth of faster action point regeneration. Nearby, on the shores of a meager creek, I found an abandoned tent. Next to it sat a corpse with a story to tell. Popping a holotape into my Pip-Boy, I was pleased to find a well-acted audio diary about a woman suffering from a broken heart. Not far from there I found one of my first quests, nestled inside a dimly lit abandoned building. And that’s where my troubles started up again. Inside were two other players running the same quest. They busied themselves rummaging through cabinets and storage closets ahead of me and killing enemies along the way. Following behind them, I found that some containers were empty, while others had been magically refilled with top-notch loot. It was jarring, to say the least, and worked to sour my immersion. At least I didn’t have to waste any ammunition.But, before I left that starting town, the same public event would kick off twice in a row. Enemies began to spawn into the town while I was exploring. Each time, I had to stop what I was doing to fight them off while other players bunny-hopped around the map doing the same. When the event began for a third time, I abandoned my search and elected instead to simply run away.What had once been an escape for me, a world filled with dark mysteries and tiny, alternate-history storylines to uncover, was transformed last night into something else entirely. It was as if my local library had been swapped out for an inflatable bouncy castle. We’re still very early in the beta process, and I’m still cautiously optimistic about getting the opportunity to explore a new place in the Fallout universe with other players at my side. But I don’t come to the Fallout franchise the same way that I go to a theme park, expecting good times and cotton candy as I make my way around the midway. For me, at least, it’s always a fairly somber endeavor. If I have to play it with other people, I’d much rather play with folks who want to respect that tone. It’d be nice if the game itself provided the same courtesy.Bethesda’s Todd Howard has indicated that private servers are on the drawing board, but he’s been cagey about when they’ll be implemented. Some people think fans could have to wait as long as a full calendar year. For me, private servers can’t come soon enough. As it stands, the game is simply not meeting my expectations for a Fallout adventure.The situation reminds me quite a lot of another game that failed to meet the expectations of fans when it launched. That’s The Elder Scrolls Online from Bethesda Game Studios’ sister company, ZeniMax Online Studios.When ESO entered its early beta, the feedback from players told the developers that they’d succeeded in making a decent massively multiplayer online game. But those same players wanted a true Elder Scrolls experience, which included things like first-person view, long multipart quest lines, and interactive and collectible items in the world. In the end, it was a massive list of changes that needed to be made — so massive, in fact, that the developers were barely halfway done with it when the game finally launched on Windows PC in 2014.Two years later, it had completed its transformation from a bog-standard MMO into something distinct — something that represented the rich history of the Elder Scrolls series of massively single-player games, but in a new way. It’s successful today because ZeniMax Online Studios put in the effort to satisfy the expectations of devoted fans.For Fallout 76, the issues are slightly different. The world feels extremely well-detailed. It’s a place with characters, with nuance, and with mysteries to explore. It’s just that it’s also full of other people and online features that I find distracting. Simply casting that all aside in favor of private servers, even ones that rely on peer-to-peer connections, is likely to be a tall order for those working hard to build the game.Here’s hoping that Bethesda makes the decision to prioritize private servers, despite the challenges that will create. I, like many who have enjoyed the Fallout series over the years, value the solitude that single-player games provide. So far, Fallout 76 just isn’t doing it for me."}