{"id": "Blizzard reveals World of Warcraft: Rise of Azshara, Battle for Azeroth’s second major patch", "paragraph": "World of Warcraft’s first major patch — Tides of Vengeance — is just around the corner, set to launch on Dec. 11 in North America. But at BlizzCon 2018, the Blizzard team unveiled the second major patch of the expansion as well. Patch 8.2 will be called Rise of Azshara, and will send players into the depth of the sea to fish out N’zoth’s favorite minion. Queen Azshara and her army of snake-like Naga will be the focus of 8.2. Players will set sail and find a great crack in the ocean. The champions of Azeroth will then disembark to discover that this new landmass is the famed Nazjatar, home of the Naga. Players will be able to explore the zone and discover all of the replayable content there. In the heart of Nazjatar, players will find Azshara’s eternal palace, the raid location for patch 8.2. The raid — cleverly named “Azshara’s Eternal Palace” — will house eight bosses for players to eliminate. Blizzard teased that players will take on a Naga hatchery, a fully underwater boss and Queen Azshara herself in the raid. Rise of Azshara will also contain a second, completely unrelated continent: Mechagon. Mechagon is the ancient gnome city, where residents replace their fleshy bodies with robot parts to increase their societal standing. Here, players will be able to explore the zone and uncover what Blizzard is calling a “megadungeon.” This Mechagon dungeon will contain eight bosses and will be limited to the Mythic difficulty only — at least when it first releases. 8.2 also brings a few other changes to World of Warcraft, such as flying in Battle for Azeroth. Players will also be able to embark on new island expeditions and take on more difficult, more rewarding heroic Warfronts. Gnomes and Taurens will also be able to earn their own sets of heritage armor. After 8.2, it seems that 8.2.5 will finally bring the Worgen and Goblin model updates — something players have been waiting for since Warlords of Draenor released in 2014. While Blizzard hasn’t officially revealed anything for 8.3, the studio did show a small teaser in the final slide of their presentation that looked like it had the eye of N’zoth in the background — suggesting that players will tackle the old god before the expansion’s end.Rise of Azshara won’t be released until sometime next year, likely in the spring toward the beginning of April — assuming Blizzard holds to the release pattern they started in Legion."}