{"id": "Battlefield 5 review: a rough draft for an excellent multiplayer shooter", "paragraph": "In terms of raw scope, Battlefield 5 is one of the year’s biggest games. To better serve our readers, we will be publishing stand-alone reviews for both the single-player campaign and multiplayer modes. What follows is our multiplayer review.At their most effective, successful World War II tankers famously fought at only two speeds: full power or full stop. Battlefield 5’s multiplayer plays similarly. It is one of the fastest military shooters to be released in years. The experience left me breathless at times. After a full weekend of play, all I want is more. But to buy into Battlefield 5 in 2018 is to accept a number of flaws and compromises. With multiple game modes still in development, including a battle royale mode that is still months from being available, Battlefield 5 is a work in progress.Battlefield 5 multiplayer completely sells the chaos of war. Moment-to-moment, it’s exceptionally demanding, even to an experienced player. I still feel like I have a lot to learn, and that’s something I look forward to. But it’s just the first step in a long campaign to capture and keep the attention of a notoriously picky group of fans. Between balance issues and a handful of annoying bugs, Battlefield 5 feels unfinished. Casual fans of military shooters will find a lot to absorb over the next few weeks if they have the patience to dive in, but I’m concerned that the hardcore community — which the game is clearly targeting — may lose interest if things don’t get buttoned up soon.Developer DICE’s stated goal with Battlefield 5 is to bring the classic multiplayer franchise back to its roots in World War II and recapture how longtime fans remember the early entries, while layering on the modern graphics and gameplay tweaks that newer players expect. The stages are visually stunning, collapsing into rubble as matches progress. Destructible environments allow attackers to soften up enemy-held buildings and structures from afar, while challenging defenders to hold and later rebuild fortifications during lulls in the fighting. As an example, take my favorite map, Arras. Named after the city in the Pas-de-Calais region of northern France, it was the site of heavy fighting early in the war as Nazi forces poured through the Belgian border. At the beginning of a match, it’s filled with pastoral fields and picturesque hamlets, gorgeously rendered with an autumnal color palette and bathed with golden light. Flying over the landscape at low altitude, it looks like a painting.Over the course of a single 64-player battle, however, all of that changes.As the attacker, I’ll generally choose to advance into enemy-held territory behind a friendly tank. The grain in the fields will actually bend out of the way as I run through it. Once I make contact with the enemy, sometimes they attempt to obscure my squad’s sightlines with smoke, which is as authentic as it is effective. Pressing closer, tiny gun battles will break out around key buildings as multiple squads work together to clear rooms. Then, once the heavy weapons are down, there’s nothing stopping our friendly tank from smashing through the other buildings to root out remaining defenders.Being inside one of those houses as it crumbles is a terrifying and disorienting experience. Ceilings collapse and walls cave in. Often, the best escape is to leap through windows and run frantically for the next piece of cover. If you can’t make it to safety, you’ll likely be left behind in the rubble, grievously wounded. When the tanks have passed, the colorful buildings are gone. All that’s left in their place are the muddy ruts of tracked vehicles and filthy courtyards that soon fill with reinforcements streaming in.Then it’s time to prepare to hold the position. Once everyone is patched up or spawned back in, I generally try to lend a hand rebuilding the defenses. What was once a quaint cottage has been reduced to an internal skeleton, so we fill in the gaps with sandbags and other defensive positions. Then the whole process begins again. The enemy arrives, and their counterattack begins. The story of the overall battle is told visually like this again and again, in multiple places all over each map.What keeps the tension artificially high is Battlefield 5’s new “attrition system,” as DICE is calling it. Essentially, every player spawns into the game undersupplied. Before you even take one step, you’ve got to make a decision: Do you press the attack, or do you run off and resupply? If you elect to push forward, you likely won’t get very far. But, if you divert, you’ll lose the momentum, giving your enemy time to heal up and rebuild their fortifications.It’s in these moments where the game’s new squad mechanics shine. As in previous games in the Battlefield series, players can spawn in on their teammates. In fact, Battlefield 5 allows players to spawn in on anyone in their four-person squad, not just the squad leader. If your team uses cover and coordinates well, it’s possible to hold even the worst of positions for a time against overwhelming odds.Where things become frustrating, however, is with the game’s buggy medical system. If you get wounded, you don’t die straight away. Instead, you’re sort of stunned as you fall to the ground. Then you have another decision to make: Do you click and hold the mouse to bleed out, so that you can respawn faster? Or do you call out to your squad for a revive? Every member of a four-person squad can revive every other member of that squad, while medics can revive anyone on their side of the conflict. But running out to save you could get them killed.The result is the accumulation of piles of bodies where the fighting is most intense. They will all be writhing in pain and waving blood-slick hands in the air, screaming for help. It’s quite a sight to behold as surviving players cower behind sandbags nearby, trying to determine if enemy fire has fallen off enough to risk running out to render aid.But pulling off a revive consistently can be tricky. When they go down, characters will often clip through walls, structures, even other character models. At that point, actually getting the revive option to appear on screen is unreliable. Once you do begin a revive, there’s a chance that you’ll become locked in the revive animation. Even worse, as a downed player, I’ve fallen entirely through the map. Those who risked everything to save me by running from cover arrived to find I had vanished.While I’m not sure that DICE can fix the clipping issues in the short term, the studio simply must improve the consistency of revives soon. The problem spoils the flow of an entire session, committing one of the biggest sins of competitive games: imparting the sensation that you are losing because of the game’s flaws, not because your lack of skill.So, too, must be the balance in Battlefield 5’s marquee Grand Operations. These multi-session battles were heavily marketed to fans in the lead-up to the game’s release. Succeed in the first mission and your side gains advantages, like a faster rate of vehicle spawns or more tickets to burn down on the way to victory. In practice, however, they usually end up being extremely one-sided affairs with one team completely stomping the other round after round.Part of that frustration, I feel, is bound up in the map design itself. Narvik, one of my least favorite maps, is an especially difficult one for a Grand Operation. It presents the Allies with a very narrow avenue of advance as they attempt to push forward from their beachhead without any armor or air support. There’s simply no room to maneuver like there is on Twisted Steel, which has a much wider front line.The second issue I’ve encountered in Grand Operations is the overwhelming power of airborne bombers. A single bombing run has the power to take out several squads in one fell swoop, especially as the contested area of the map collapses. This is especially true on Twisted Steel and Arras, which can see the defending force pushed back into a single fortification. Anti-air units are extremely weak in comparison to bombers. Flak guns feel particularly underpowered. On Fjell 653, the situation is even worse as the rugged terrain gives very little opportunity to place your shots before the target bomber is obscured behind a mountain range. Fighter planes also feel weak. Aside from dueling with other fighters, they seem to have little impact on battles. In my experience, you need two or more firing on the same bomber to have any chance of bringing it down.Even straightforward ground showdowns need some TLC. I’ve unlocked a few longer-range weapons, but at range I’m beginning to have difficulty hitting distant targets on the move. The trouble, I’m afraid, is dropped frames. What I’m seeing through the gunsight simply isn’t matching up fast enough to allow me to land solid hits. I’ve tried to muscle through, switching to submachine guns and working at closer ranges, but it looks like I’ll need to spend some time in the game settings to see if I can coax a little more performance out of my already beefy gaming PC.All these issues of performance and balancing make for an unenviable situation for the developers at DICE. More work needs to go into the core systems in place now to support the live game, but there’s a timetable they must meet with the coming Tides of War. DICE has promised more maps for multiplayer, as well as elaborate cooperative experiences for small groups of players. All of this is expected to come out over the next few weeks and months.For the team at DICE, there’s simply no time to stop and lick their wounds. Like a good WWII-era mechanized unit, they’ve got to advance quickly to keep attention on their game during a busy holiday release schedule. Here’s hoping that their supply lines can keep up with them. Battlefield 5 was reviewed on Windows PC using a final “retail” Origin download code provided by Electronic Arts. You can find additional information about Polygon’s ethics policy here."}