{"id": "Red Dead Redemption 2’s companion app makes the game much better", "paragraph": "There is a free companion app for Red Dead Redemption 2 that works on both iOS and Android phones and tablets. You’re going to want to pick it up if you’re playing the game, despite how tricky it can be to track down due to neither app store being concerned about clones or misleading app icons and names. Make sure you’re getting the app developed by Rockstar Games — it helps to search for “RDR2: Companion” and not “Red Dead Redemption 2.” Or you can follow these direct links to the Android and iOS versions.But why does this app add so much to the game when the concept of the “second screen experience” seems to have failed so conclusively in the past few years? This is counter-intuitive, but the companion’s usefulness is due to the design of the game, not the app. Red Dead Redemption 2 indulges in a lot of skeuomorphic design, which is a way to present information or interactions on a screen so they resemble objects in the real world. The idea is that if your app looks like a notebook, everyone will understand how to take notes. A music application that looks like the front of a radio should have less of a learning curve. It’s an idea that gets tricky now that we have generations of people growing up on apps and not actual notebooks or radios, but you can see why it was so attractive in the early days of smartphones. But skeuomorphism works well with the setting of Red Dead Redemption 2. The game presents catalogs, complete with illustrations and color text, when you go into stores. Reading things isn’t the best experience on most displays, even in 4K, but scrolling through the catalogs to enjoy the pictures and descriptions on your phone or a tablet is a joy. It feels as if you’re holding an object from the game. The same thing happens when you read Arthur’s journal through the app; it’s presented like a real book, open in front of you. You can page through it and read the text and look at the hand-drawn images even when you’re not playing the game. There are some annoyances here, such as the catalogs loading in a browser and not saved in the app itself, and the inability to zoom in to see details while you’re reading the journal. These decisions were likely made to keep the size of the app down, but they’re still a bummer for those of us with plenty of storage space on our phones. But the rest of the app shows its value when it’s linked to the game as you’re playing. The map comes alive and shows your location in real time, while allowing you to zoom in and out, browse missions, and set waypoints. And you can do this at any point, without leaving the game itself. This changed how I was interacting with the game itself, and I’m not the only one. “I actually found the companion’s map distracting at first, as I’d always be looking down at my phone, and yanking my eyes off the screen all the time made the whole thing harder than if I’d just left the HUD on,” Kotaku’s Luke Plunkett wrote. “After a while though I found myself changing my habits; instead of always looking at the app as though it was an on-screen minimap, I started adapting and treating it more like an actual map.”Looking at my options when I was trying to decide what to do next, or even going through the compendium to see what weapon I should use for hunting specific game — without pausing the game — helps maintain the illusion that this world is alive. I would often look at my map to see how close I was to my destination when I’d go into the cinematic camera mode during long journeys, which helped make some of those trips less tiresome. It doesn’t solve the problem of long, annoying trips where you’re stuck traveling at another character’s pace, but it at least makes them easier to tolerate. It’s not that this app offers anything new. But it’s such a good fit because it works so well within the design language and pace of the game it’s meant to support. Companion apps don’t make sense for every game, but Red Dead Redemption 2 is improved by the use of this one."}