{"id": "5 things to know about Fortnite’s Halloween patch v6.20", "paragraph": "Fortnite’s newest patch, v6.20, is the biggest of the year so far, and not just because of the Halloween event. While Fortnitemares is likely going to be what holds most players’ attention, this patch also includes a few more additions to the game.First, v6.20 will return the revolver from the vault, while also updating the gun to give it a more defined place in the game. Meanwhile, Epic is also adding some new items to Playground mode and testing out some changes that would allow players to redeploy their glider during any Battle Royale game. Finally, there are a few changes coming to the storm that will make it move a little faster, which should speed games up especially in games that last until the final few circles. Find more explanation and details below. As always, if you want the full rundown of everything that’s included with this week’s patch, you can check out our full patch notes. A new event in Fortnite is always something special, but this time around it’s a little more involved. For Halloween this year, Epic Games is hosting the Fortnitemares event. The biggest addition are the new AI enemies that wander the map and fight anyone who gets close. If you are lucky enough to kill them they’ll also drop items and give you a little bit of shield as a reward. For more information on all of the changes coming with Fortnitemares you can check out our post on the event. The revolver was vaulted not too long ago because it didn’t really have a place in the game. Essentially, the gun was a worse version of the hand canon — which also got buffed this patch. Now the revolver is back, but it’s got a new name: the six shooter. This “new” gun works like the revolver did when you aim it, shooting an accurate high-damage shot. But when fired from the hip, the six shooter widely sprays in-front of you, unleashing all of its bullets in a matter of seconds.Yep, just like in the limited-time Soaring mode, you can now open your glider anywhere in mid-air as long as it’s above 10m in the air. All you have to do is press jump and your glider will redeploy. While this feature addition has already caused some concerns for players, who think it will reduce the importance of items like the launch pad, Epic has stated that the features addition is just a test and that the company is looking for player feedback on it. This change isn’t much more complicated than it sounds. After the second storm, all of the other storms will start moving quite a bit faster. Rather than the 120 seconds players had to negotiate their way from the third circle to the fourth they’ll have 90 second and the time is moving from 70 to 50 between the fifth and sixth circles. Thankfully the storm’s damage is getting a bit of a nerf to help players that don’t move as quickly as they should. In all honesty, this change likely won’t make a huge difference in most games, outside of making them feel a little faster.Playground mode is more than just a place for players to practice their skills and have fun: now, it’s also a place for players to take on new challenges. Epic is adding new items to the mode called Port-A-Challenge which will add obstacle courses, building challenges, and a firing range, all with different, increasingly difficult goals, that they will ask players to complete. "}