{"id": "Netflix’s horror movie Cam preys on your assumptions", "paragraph": "In Netflix’s new thriller Cam, Alice (Madeline Brewer), a popular cam girl who goes by the name Lola, is gripped by terror when she discovers someone else named Lola, baring her exact physical identity and performing a show on an alternate page. Not only does Other Lola dethrone Alice’s own rank, but the imposter duplicates her hook of using performative violence for clicks. Alice goes so as far to call the police, who send two male officers to investigate, but all they do is ask superficial questions about her online activities — and practically jerk off at the thought of her in a scant school girl costume. They saunter out of her home without even pretending to pursue the case. Yet there’s still a mystery to solve.   We’re not used to seeing characters like Alice, making it difficult to recognize her as the protagonist when we first see her, dressed in tiny white panties, socks, and an open high school football jacket just barely covering her exposed chest, and spanking herself in front of a camcorder. We expect her to die, but she doesn’t die. A more traditional female character doesn’t replace her. \n    Related\n  Instead, we watch her entire video while she takes breaks to scan her online feed, which is riddled with comments ranging from “you are so sexy” to “how much for you to use a knife?” which she quickly blocks. She’s on the clock. Just like that, she becomes human. Alice’s encounter with the police speaks to a bigger truth of how sex workers are completely unprotected under the law, while still objectified by men who not only consider them subhuman forms of entertainment, but dictate the culture they navigate. Horror, a genre dominated by male directors, has a similar perspective; sexual female characters are routinely murdered off in favor of virginal heroines (see Halloween and Friday the 13th). Audiences come to expect bloodshed and gory punishment towards women who embrace sexuality. Cam, in a fascinating flip, gets us rooting for a character who in any other movie might be the first to go. We’re happy for Alice when she scores highly among her audience and, later, we’re legitimately horrified for her when she feels both her business and life are in jeopardy. When a mystery user makes a dangerous online mockery of her identity, she can’t even go to the police for support. “If you want stuff like this to stop happening, stay off the Internet,” the cop tells her, shaming her over a career as a cam girl. Before anything too elevated even happens in Cam, Alice takes a verbal beating over her legitimate living. It’s bullshit. In Cam, Alice is both a victim and her own hero. She has to be. Director Daniel Goldhaber and screenwriter Isa Mazzei, a former sex worker herself, illustrate the vulnerability of online cam girls. They’re still considered part of a conflicted subculture that is both hidden and immensely beloved, yet when it comes to the camera talent’s humanity, it’s every woman for herself. So we see Alice take on the horror of Other Lola on her own because she has no one else by her side. When she eventually leaves the smoky pink lights of her bedroom, she emerges in the sunlight with no one to talk to and no one to hear her. That incldues her own mother (Melora Walters), who also doesn’t take her seriously when she tries to explain what Lola is doing to her. For Alice, the hunt for the truth is like screaming into a void.The terror of Cam is not jump scares or gore. What makes Cam scarier than so much other horror is that it leaves its protagonist out to dry. The movie makes you believe that our heroine may not win this fight because there is no one who actually wants her to come out on top. It confronts the genre’s longtime statement on who gets to live and die by creating a whole new set of rules in which the sexual woman finally prevails. Candice Frederick is a freelance TV/film critic living in New York City. You can find more of her work here."}