{"id": "World of Warcraft quest will offer player choice in upcoming patch", "paragraph": "In World of Warcraft: Battle for Azeroth’s upcoming 8.1 patch, Horde players will be sent on a quest to find Saurfang, a grizzled orc veteran. A few weeks ago, players discovered on the public test realm that they’ll be teaming up with Zekhan to help save the orc general. But a recent update has revealed that there is another, darker side to this quest as well.[Warning: This post contains potential spoilers for World of Warcraft: Battle for Azeroth patch 8.1, Tides of Vengeance.]This quest line — called the Fate of Saurfang — will now have a rare player choice inside of it. When players meet up with Zekhan, they’ll now have an option to accept his quest or reject it.Accepting the quest will have it play out like normal, but a rejection will lead players down a darker, more loyal path. Players can essentially tell Zekhan that they stand with Sylvanas, Warchief of the Horde. They’ll be met with a message saying Zekhan will remember this choice, and also that they won’t receive a unique disguise from the quest. Upon rejecting Zekhan, loyal Horde players will be given a quest to return to Sylvanas and tell her of this treachery. Sylvanas then reveals that she has “special plans” for Zekhan, which doesn’t sound particularly good for anyone.World of Warcraft has offered light choices like this in the past, but these quests usually involve if the player character kills someone or if an NPC does it for them. This choice with Zekhan is far more involved than most other World of Warcraft choices, especially since it has the potential to drastically impact the narrative. Player agency is something MMO players rarely get to see, but it’s an important topic in this very dramatic era of loyal versus honorable Horde players. Patch 8.1, Tides of Vengeance, is expected to be released early next month. More details on future World of Warcraft content will be unveiled in only a few weeks, at BlizzCon 2018, which runs Nov. 2-3. "}