{"id": "Pokémon: Let’s Go! gives you the whole starter trio", "paragraph": "Pokémon: Let’s Go! limits your partner pick to one of two Pokémon: Eevee or Pikachu, depending on which version of the Switch game you get. What with these being Pokémon Red/Blue makeovers, though, this may be disappointing. Maybe you just want to pal around with your starter Bulbasaur, Charmander or Squirtle from the start.Thankfully, you can truly have it all in Let’s Go!, and with ease. All three of the original starters can be yours relatively early on into your adventure — and there’s even a chance to own more than one of these rare Pokémon.Bulbasaur is likely the first of the starters you’ll pick up as a gift along your travels. In Cerulean City, a woman who lives near the Pokémon Center will have a Bulbasaur with her. But she has no need for the grass-type Pokémon in her life anymore. If you’ve already caught 30 Pokémon total, she says, that Bulbasaur can be yours. We’ve also spotted a wild Bulbasaur in Viridian Forest, which you travel through just before arriving in Pewter City, where your first gym battle is. But they’re hard to come by in the grasses of that maze.Charmander is also available in Cerulean City. Run along the Nugget Bridge and defeat all the trainers along the way. Once on the other side, you’ll see a trainer with a Charmander by their side. Show them that you’ve caught 50 Pokémon already, and they’ll give you their Charmander to celebrate your achievement.Charmander can also sometimes be seen in the Rock Tunnel on the way to Lavender Town, making for a fantastic surprise.Squirtle requires the most Pokémon in your collection to receive. Unlike the previous two, you’ll have to leave Cerulean and go to Vermillion City, the next location on your journey, to find Squirtle. Officer Jenny has taken one into her custody for being a not-good boy. (Classic Squirtle!) But if you show Jenny that you’ve caught 60 Pokémon, she’ll let you have the Squirtle for yourself.Squirtle also sometimes roams around routes 24 and 25. \n    Related\n  The best part of all of this is to qualify for the Pokémon giveaways, you only need to have caught the necessary number of monsters overall — you don’t need 60 unique Pokémon for Squirtle, for instance. Combined with transferring Pokémon from Pokémon Go to Let’s Go!, you can easily build an army of Charmander or whichever starter you like. We love Pikachu and Eevee, too, but something feels off about exploring Kanto without one of our trusty original starters with us. "}