{"id": "The comics world mourns Stan Lee ", "paragraph": "“Let’s lay it right on the line. Bigotry and racism are among the deadliest social ills plaguing the world today,” Stan Lee wrote in 1968, a tumultuous and violent year in American history. It’s a sentence that many folks are choosing to eulogize the co-creator of much of the Marvel universe, as the comics world — where Lee’s influence looms the largest — reacts to his death. “They can’t be halted with a punch in the snoot, or a zap from a ray gun,” Lee continued, in his monthly Stan’s Soapbox column that ran in the backmatter of Marvel Comics issues. “They only way to destroy them is to expose them — to reveal them for the insidious evils they really are.” But, of course, when paying tribute to Lee’s legacy, there are a lot of words to choose from. Pax et Justitia. pic.twitter.com/okLwjomcem(Andrew Wheeler, comics editor and journalist.)A tremendous moral legacy in six words.(Greg Pak, writer, Planet Hulk, Storm and Doctor Strange.)pic.twitter.com/OFXXk64Lz8(Mitch Gerads, artist, Mister Miracle, Batman.)For some, the best way to pay tribute to Lee was through art — this is comics, after all. Rest In Peace @TheRealStanLee #legend #StanLee #StanLeeRIP pic.twitter.com/acQpyBxCqk(Alex Ross, artist, Marvels, Kingdom Come.)The legendary Stan Lee — Rest In Peace (95th birthday portrait) #RipStanLee #StanLeeRIP #StanLee pic.twitter.com/Xqxm6zFm1y(Bill Sienkiewicz, artist The New Mutants, Elektra.)And for still others, the best way to honor Lee was to honor the moments they shared with the gregarious man himself — when he’d shaped their career not with his creations but with his presence. Stan Lee was the first comic creator I ever saw speaking about their work (thanks Pizza Hut X-Men Animated Series tapes).My first few SDCCs, Stan was EVERYWHERE. Scheduled to 15 min increments his 80s. Saw him on numerous panels. Walking the halls. Even won a signing ticket. pic.twitter.com/H3Ftl2jmMV(Jody Houser, writer, Faith, Star Wars, Mother Panic.)This is bitter news. We were lucky to have him. Untold millions of lives made better by stories. Endless people who learned responsibility from Spider-man, acceptance from the X-men, self-forgiveness from the Hulk.Stan Lee put better heroes in our vision.Forever the Man.(Gail Simone, writer, Deadpool, Birds of Prey, Plastic Man.)Deeply saddened to hear about Stan Lee's passing. Out with the kids and can't do this one justice today. Was lucky enough to meet Stan early in my career -I was introduced to him as a newbie- & he said: don't look so nervous kid, all the good stuff is just ahead... #excelsior(Scott Snyder, writer, Batman, Dark Nights: Metal, Justice League.)RIP @TheRealStanLee He made everyone feel like a kid in his presence no matter what your age. pic.twitter.com/JYeWXq8iKb(Jim Lee, artist, co-publisher of DC Comics.)He was the most influential writer, editor, and publicist in the history of comics. The nerdy voice of so many generations. He wanted to write the great American novel. He did.(And once I got him to laugh at a dick joke while we were taking a pic. These are framed on my desk.) pic.twitter.com/oO4T6sb8ra(Tom King, writer, Batman, The Vision, Mister Miracle.)#Excelsior pic.twitter.com/oO8eJ9TBIi(Kevin McShane, cartoonist, impersonator.)No writer or their work has ever had as profound an effect on my life as that of Stan \"The Man\" Lee. In the history of the written word, no one even comes close. His stories will live on for every generation. Never \"The End\". Always \"To Be Continued...\"Excelsior! pic.twitter.com/KVXfHDvolZ(Dan Slott, writer, Spider-Man, Iron Man, The Fantastic Four.) R.I.P. Stan Lee. We have lost a Titan of Creativity and Industry. These are my last photos with Stan, taken in August at his home by Jon Bollerjack. I was summoned by “The Man”, he wanted a friendly face, a change of pace. I was up the next day. He was peaceful and comfortable and in great spirits. He sat in his favorite chair overlooking his pool and the beautiful canyons. I thanked him for being a visionary, not just creatively, but being a visionary in bringing Marvel to Hollywood, knowing how well they would be served by tv and film. Kids of the 1970’s, kids my age grew up with The Hulk tv show, live action Spider Man TV movies, Dr. Strange film on CBS. It was an exciting time and it was a result of Stan’s decision to travel west and present the Marvel characters to Hollywood. He started the Marvel Age Of Comics as well as the Marvel Age Of Film that we enjoy today. I have many stories from my history and travels with Stan. We never had a better Ambassador. And we won’t ever see another like him. All I know is the Good Lord has pulled up a chair and Stan is currently bending all the ears in the heaven’s with his amazing tales and lore. They are hanging on his every word and sentence. #stanlee #marvel #hulk #fantasticfour #xmen #spiderman #thor #excelsiorA post shared by  RobertLiefeld (@robliefeld) on Nov 12, 2018 at 11:24am PST(Rob Liefeld, artist, Deadpool, X-Force, The New Mutants.)A few more thoughts about Stan.\n\nHe was a controversial figure, yes. I credit him with more of the creation of Marvel...(Mark Waid, writer, Daredevil, Captain America, Archie.)I was first interviewed for Stan Lee's obituary about 20 years ago. I was happy he defied the reaper and carried on. With Stan gone, an era really does come to an end. He was the happy huckster that comics needed. And he really did alliterate like that when you talked to him.(Neil Gaiman, writer, Marvel: 1602, Miracleman, The Sandman.)Lee’s impish public persona touched many — and those who were around when he dropped it have been quick to emphasize that it was an exaggeration, not an act. Lee loved stories and people who loved stories. He had no reluctance about becoming a story himself. My favorite Stan Lee moment has to be the time he watched Todd McFarlane and Rob Liefeld design a character while dunking on them the whole time https://t.co/pHXug65P44 pic.twitter.com/NQqOzeFlWG"}