{"id": "Why Shovel Knight was the right game at the right time", "paragraph": "The following excerpt comes from the book Shovel Knight, available now from publisher Boss Fight Books. Based around interviews with development studio Yacht Club Games, the book looks at the making of the team’s debut game — Shovel Knight — and how the studio turned its Kickstarter success into one of the most critically acclaimed indie games to date.Shovel Knight served as a vessel for the spirit of 8-bit gaming from the halcyon days when the NES reigned supreme in millions of living rooms. That spirit moved Dan Adelman. A graduate of Columbia University, Adelman spent four years at Microsoft helping to lay groundwork for the business side of the Windows publisher’s original Xbox console before joining Nintendo of America as head of digital content and development in November 2005. “When I joined Nintendo, there were already some plans for digitally distributing the classic NES, SNES and N64 titles via Virtual Console, but there was no strategy for how to expand digital distribution to include new games,” he said.Adelman saw potential in courting smaller teams. At the time he joined Nintendo, however, he was something of an iconoclast. Rising costs made established studios such as Nintendo hesitant to branch out and experiment with bold, new designs. Adelman was keen to experiment. He connected with studios interested in publishing small-scale games on a small-scale budget. “WiiWare was the first digital distribution service I kicked off and ran at Nintendo,” he said. “Later iterations and improvements on the digital distribution service were DSiWare for the Nintendo DSi, and the 3DS and Wii U eShops.”WiiWare, the flip side to Virtual Console’s golden oldies, was made up of brand-new games created by teams large and small. Published in 2008, World of Goo is a 2D puzzle game where players build contraptions by sticking pieces and parts together using wads of goop. Adelman saw the game’s potential and brought the four-person team into the Nintendo fold to release World of Goo on Wii. That same year, Capcom announced Mega Man 9, which satisfied Nintendo’s goal of working with safe, known quantities.Adelman persuaded the powers that be at Nintendo that they needed to approach independent developers differently than big-budget studios like Capcom. Many individuals inside Nintendo’s ranks saw little difference between Capcom and, later on, Yacht Club Games. They believed that all publishers should be held to the same standards, rates, and sales expectations. Adelman disagreed. To him, while all titles should hit certain quality markers, a four- or five-person team developing a game for a $15 to $20 price point shouldn’t be expected to hit the lofty sales goals — usually one million units sold or more — of big publishing houses that put out games with $50 or $60 price tags to justify development expenses in the tens or hundreds of millions. To Adelman, indies represented a sort of proving ground. Smaller teams could build games that cost exponentially less to fund, and that would catch the eye of players in the market for games at lower prices. Nintendo became more willing to work with indie developers as support from monolithic third-party publishers such as Electronic Arts and Activision turned their noses up at the Wii U’s underpowered hardware and stagnant sales. “A lot of third-party publisher support had dried up,” Adelman recalled of the Wii U’s lifespan between 2012 and 2017, “so the indie developers were keeping that system going for a while. I think many at Nintendo were grateful for that support.”Adelman had met Yacht Club’s co-founders when he had entered into a publishing relationship to license WayForward’s games for distribution on WiiWare. “They were working on a very creative title called LIT, which was a survival horror puzzle game that used the Wii Remote as a flashlight,” Adelman said. “They were often a go-to partner, since they always delivered innovative and well-designed games.”Shortly before kicking off their Kickstarter in early 2013, Yacht Club’s Sean Velasco phoned Adelman and brought him up to speed on their plans. “We were announcing this at the beginning of 2013,” Yacht Club’s David D’Angelo said. “PS4 and Xbox One hadn’t been announced yet, and we didn’t know if people would still be buying games for PS3 and Xbox 360. 3DS was at its height at the time, and we’d all got WiiUs and were excited about that.”Adelman set up a meeting to see Shovel Knight. Although the game was still embryonic, he saw its potential right away. “I respond well to tight, precise controls, so I think that was the first thing I noticed,” he said. “It’s one of those things that’s underappreciated and so hard to get right, yet it makes all the difference. I also loved how authentically retro they were able to make the game, from the fonts they used to the color palette.”Adelman demonstrated his support by clearing one major hurdle from Yacht Club’s road to publication. “We got our hands on Wii U and 3DS kits as loaners for a year or two, then we’d have to give them back,” Velasco said. “But during that time they were free. That was enormous for us because we had no money.”“Since I was familiar with Sean from his WayForward days and knew he was a great game developer, I was able to expedite their approval process,” Adelman said. “But beyond that, there wasn’t much development support they needed from me. They knew what they were doing.”Yacht Club’s Kickstarter went live on March 13, 2013, with a target of $75,000. With nine days to go before PAX, nervousness crept in. Their demo, a full stage from the game, remained unfinished. They had divided their time between generating content for the demo and putting together their crowdfunding campaign. “It was crazy, man,” Velasco said. “It was a lot of work. I remember thinking, even a week before PAX, Well, maybe we won’t be able to get the demo done and we’ll just have our banner there, and some beanbags, and Super Mario 64, and we’ll just play it and tell people about the game even though there’s no game to play. Just shoot the shit. Fortunately we were able to get it all done.”Setting up their booth at PAX East, the guys watched as Shannon Hatakeda, a friend from WayForward who later joined Yacht Club Games as project manager, picked up a controller and began to play. The demo, finished in the nick of time, took place in King Knight’s stage, a gilded castle bedecked in lavish corridors, bottomless pits, and — in another nod to Mega Man — platforms that disappeared and reappeared at set intervals. Velasco chewed his lip, watching to see where Hatakeda got stuck. At the end, she put down the controller and announced that Shovel Knight was fun. Really fun. The team let out a breath. The group’s confidence increased once the show got underway. Visitors streamed into their booth and raved about the game. Articles on websites such as Destructoid and Kotaku extolled its tight controls and throwback visuals.“A big part of it was that we came out right around the time when Capcom was ignoring Mega Man,” D’Angelo said.Three years had passed since Mega Man 10’s release on Xbox 360, PlayStation 3, and Nintendo Wii. Long-time series producer and artist Keiji Inafune had been leading the design of Mega Man Universe, a sidescrolling game where players would be able to build levels and modify characters, before he left Capcom in October 2010. The company quietly cancelled the game early in 2011 for “various reasons.” Mega Man Legends 3, the next installment in the 3D branch of the Blue Bomber’s family tree, had been announced in the fall of 2010, only to be shelved the next year, ostensibly due to low fan interest.“Everyone was saying, ‘There will never be a Mega Man game again. I’m so sad,’” D’Angelo said. “And then here we come storming in with this game that feels much like a Mega Man experience.”Yacht Club’s campaign oozed 8-bit charm and rekindled veteran players’ nostalgia. Rather than reveal all their information on day one, the team unwrapped their Kickstarter over the month-long period. Every week brought exciting reveals such as silhouettes of the Order of No Quarter, the bosses players would face in the game.“What’s the coolest part of [a new] Mega Man [game]? The eight new Robot Masters,” Velasco said. He, like many players from the NES era, had fond childhood memories of daydreaming about the next game’s bosses. “What will they look like? What are their levels going to be like? We decided to do reveals of all of our knights throughout the Kickstarter campaign [because] that would be exciting.”Nearly as much work goes into crafting a character’s silhouette as goes into creating the character. “When people talked about them, they could point to them and say, ‘That’s obviously an anchor sticking out of his arm. I wonder what he is,’” said Yacht Club artist Nick Wozniak, “or, ‘That tall, weird one that has a scythe — I’m sure he’s a reaper.’ Designing a knight is as much about their personality as how they fit with everybody else.”Yacht Club gained support by targeting retro games from a specific time and platform. By the time Shovel Knight broke ground on Kickstarter, indie games boasting old-school trappings like pixel art, chiptune soundtracks and 2D platforming were sprouting like weeds. Shovel Knight stood apart from the pack. “First of all, it feels like an NES game,” Velasco said of why fans embraced Shovel Knight so quickly. “Games like Fez and Rogue Legacy look [and feel] like indie games. That’s a whole other thing.” Fez and Rogue Legacy in particular look like they could have been published on other consoles, like Sony’s inaugural PlayStation. Their art style, while charming, casts a wide net, appealing to a general sort of nostalgia. Shovel Knight’s art style evokes Nintendo’s 8-bit console in myriad ways. The trailer opens with Yacht Club Games spelled out in a pixelated font based on lettering that Japanese publisher Taito had used in dozens of classic coin-op and NES titles. Reading character dialogue in the Shovel Knight trailer transported players back to the days when blocky letters had unspooled across their equally blocky television sets.“Nostalgia works well on Kickstarter because it’s something you can immediately understand,” said D’Angelo. “They still make Mario and Rayman [games], but there’s nothing new there. The idea of seeing a new IP where the character is the name of the game was a cool thing to see. Being able to draw on the feelings people had when they were eight years old worked for the Kickstarter [backers].”Furthermore, Shovel Knight’s Kickstarter served as an extension of the personalities of its creators. Yacht Club’s quintet were fun-loving and irreverent. They enjoyed satire, puns, alliterations and poking fun at the industry they loved. Along with premium goods such as a soundtrack and an art book for backers who pledged at or above a certain level, they offered an even more decadent prize: a bag of dirt. “We sold it for a hundred bucks,” said Woz, laughing. “We tried to figure out what this dirt would be because we were afraid of shipping bioorganic material across the world, so we didn’t want to use potting soil. We eventually got some generic, neutral sand, but we added stuff into it.”Each bag’s “stuff” was unique to a particular knight from the Order of No Quarter. “We added tiny little bones for Specter Knight’s dirt,” Woz said. “He’s in a damned village, so we put in little bones and these skull things. We put that in a nice envelope, plus a little note from us describing the village, so you got a little taste of the world in real life. It sold out. We had to make more so people could keep buying it.”Shovel Knight’s campaign ended on April 13. Velasco and the others stared at their monitors through bleary eyes. Between Kickstarter pledges and PayPal donations, they had raised $328,682. They stared at one another. Shovel Knight was happening, and they had over 15,000 people to thank for it. “To know that people were ready to get on board from the beginning was exciting,” D’Angelo said. “Normally when you make a game, it’s a secret for around 12 months, and it’s lonely and sad. To know that people are with you every step of the way was really fun.”Once the Kickstarter funds came through, the team put their previously agreed-upon plans into motion. Each developer received their stipend. The rest was earmarked for future expenses. “We took a block of it and put it away so we couldn’t touch it because it was for Kickstarter rewards, or game codes [for press to review] t-shirts, and things like that,” Yacht Club’s Ian Flood said.In May, Yacht Club traded Velasco’s cramped apartment for a proper work setting. “Once that money came in, we said, ‘OK, we want to lead real lives now. Let’s get a tiny, crappy office,’” said D’Angelo.Bare, windowless walls bordered three rooms covered in green carpet. The main room — the largest, yet still cramped — became a bullpen for desks and equipment. A testing station took up an adjoining room. The third room was designated as a storage closet and, later, a repository for swag like posters and action figures. The walls didn’t stay bare for long. A Mega Man 9 poster went up on one. On another, a framed portrait of Star Wars creator George Lucas garbed in full military regalia watched over the team in the bullpen. Lucas’s portrait doubled as a shrine: Any time a business deal had to be conducted, they looked to Lucas, whom they dubbed the patron saint of shilling for his notorious ability to milk his intellectual properties dry.The team gave little thought to décor. They had a game to make.“We got emails as soon as we launched the Kickstarter that were like, ‘Why is this going to take so long? It looks like it’s already done,’” Velasco said. “The fact of the matter was that what you saw in the Kickstarter video and what you saw at PAX was all we had. That was everything we had.” "}