{"id": "Diablo 3 on Switch is a great way to grind on the go", "paragraph": "Diablo 3 is grinding at its best. I’ve spent more time than I can count joyfully taking out demons and collecting piles of loot while also listening to music or talking with friends. But after putting roughly a thousand hours into the PC version over the past six years — spread across dozens of characters — I was still excited to sit down with the Switch version and start all over again. The great news about Diablo 3 on Switch is that it’s Diablo 3 on Switch; it’s as good as you might hope. Blizzard stuffed a whole lot of Diablo into the diminuitive Switch. The bad news is that, due to the handheld, on-the-go nature of the Switch, sometimes you won’t have access to the internet, walling you off from one of the game’s most enjoyable modes. The Switch’s unique hardware creates a different kind of experience. Playing Diablo with a controller has always been a bit strange, but surprisingly playable, and the Switch offers a variety of controller and play styles. With the Switch Pro Controller, the game plays beautifully. Sure, you lack the precision of a mouse, but the demon-slaying, loot-grabbing chaos that you want from Diablo is still butter-smooth. The controls for Diablo 3 get a bit wonky once you throw another player into the mix. Just using what comes with the Switch out of the box, both you and your couch buddy can slay demons with a single Joy-Con each. Playing this way is surprisingly functional, but not necessarily comfortable.The smaller number of buttons on each Joy-Con creates some interesting workarounds, like having to click in the control stick and then hit the top controller button in order to access the brilliant, console-only quick menu. This is the case with a few different shortcuts, like opening your map or for returning to town. The whole thing involves pressing in the analog stick and holding it — which deactivates your abilities on the face buttons — and then using the face buttons to input commands such as up or A for the quick menu, and right or B for return to town. That control scheme is both complex and impressive, considering how few buttons the Joy-Cons have on them and how functional it all is. Playing with a single Joy-Con may cramp your hands after a few hours — and someone in your party will definitely forget the button shortcuts once or twice — but co-op on the Joy-Cons is still better than playing alone. However, if you have a regular demon-slaying pal to play with, you should probably invest in two Pro Controllers. While it runs great on a TV, Diablo 3 really sings during single-player in handheld mode. With the Adventure Mode and Nephalim Rifts added in the Reaper of Souls expansion — included here, along with the Necromancer — Diablo 3 is the perfect forever game, made even better now that it’s portable.Being able to run through rifts at your desk, sitting on the couch while watching a movie or while traveling is great. Unless you’re really trying to push the limits of your current character, Diablo 3 is about as chill as it gets, and having it detached from big screen and ready to play whenever you are is reason enough to pick up the Switch port.Unfortunately, like a lot of Switch games, playing multiplayer on the go isn’t great. While you can pair whichever controllers you like in tabletop mode, the screen is just too small for a game like Diablo. For better local co-op play, the other option is to bring along a second console. The Switch version of Diablo 3 has a wireless local multiplayer option, meaning that four players within close proximity of each other can link up to run rifts together — no internet connection required.The only real problem this port runs into is one of internet connection. Seasons in Diablo 3 — months-long in-game events, in which all players start with fresh characters and try clearing the highest rift possible — offer an expiration date to your loot runs. This is my favorite way to play Diablo 3, but it is slightly less perfect on Switch. There are some caveats to seasons and offline play. Namely, you need to create your seasonal character while connected to the internet, and you must have a constant connection to be eligible for leaderboards. Assuming that isn’t something you care about -- which is likely the case for all but the most hardcore players -- you can still do seasonal play while offline and on the go.Thankfully, the rest of Diablo 3 can be played offline. And online or not, Diablo 3 is one of the best games to be released this decade. There’s a reason it’s still getting ported to new systems more than six years after its debut. The pairing of Blizzard’s design and Nintendo’s hardware, both companies working at their finest, is undeniable. As someone who has been a fan of Diablo 3 since it first launched, airplane rides will never be the same again. Update 11/2: After additional testing, we discovered that you can play seasonal offline, although it makes you ineligible for certain seasonal leaderboards. Unless you intend on grinding into the upper echelon of Greater Rifts, those leaderboards probably won’t mean much to you.With this update, our biggest issue with the port has seemingly been solved. So while Diablo 3 on Switch isn’t the most comfortable way to play the game, it certainly is the most convenient. If you have any interest in demon slaying on the go, take a long, hard look at this port.For a full list of what you can and can’t do online, check out our post on offline versus online Diablo 3 for Switch. "}