{"id": "Return of the Obra Dinn is a superb murder mystery game", "paragraph": "Just like an old-fashioned murder story, Return of the Obra Dinn poses a complex mystery, layered with personalities, motives, secrets and lies. But it supercharges whodunit conventions by infusing misdirection into every nook and cranny of its intricate, gorgeous murder scenes. The story is set aboard an early 19th century merchant ship that shows up in port five years after it was reported missing, presumed lost at sea. The ship is bereft of human life. As an insurance agent, my job is to board the ship and figure out what happened. I’m soon confronted with evidence of a voyage gone awry. Skeletons, exploded cannon and destroyed rigging all add up to … what?Polygon Recommends is our way of endorsing our favorite games. When we award a game the Polygon Recommends badge, it’s because we believe the title is uniquely thought-provoking, entertaining, inventive or fun — and worth fitting into your schedule. If you want to see the very best of the best for your platform(s) of choice, check out Polygon Essentials.Two items help my quest. When I find a body, a magical timepiece allows me to witness the last few seconds of that person’s life. I also keep a book, which includes a ship’s manifest. I endeavor to match the bodies with the manifest. I fill out the book, so that it tells a coherent story. Early in the game, the clues are pretty helpful. A dying woman mentions her brother, also aboard, and so I’m able to check the names on the manifest and (reasonably confidently), make a match. Each time I correctly match three people, the book updates itself, piecing together wretched tale of the Obra Dinn’s disastrous voyage. But it gets more complicated. Soon enough, mysteries twist and curl into one another, leading me into error and confusion. I proceed through careful observation and a process of elimination, constantly backing up and rechecking my findings. It’s like a cross between an Agatha Christie novel and a Sudoku puzzle. Things only begin to make sense when all possible alternatives are rejected. Developer Lucas Pope made his name with Papers, Please, which investigated the nature of tyranny by focusing on the moral dilemmas of a state-employed border officer. Using an elementary graphical style, it managed to make a powerful point. Likewise, Return of the Obra Dinn is rendered in retro style — this time, beautiful black and white line drawings associated with early Macintosh graphical adventures. This style also chimes with drawings of the early 19th century, rendering faces that have personality, but aren’t clearly identifiable. The vagueness of the imagery adds to the mystery. I freeze scenes, allowing me to investigate in three dimensions. I find that creeping around a stilled moment of high intensity, peering into the faces of terrified sailors, is as affecting as any big-budget action sequence. This isn’t an L.A. Noire kind of game, in which I’m forever skirting a scene, looking for a notable thing. Mostly, the evidence is right there in front of me. I just have to figure out what’s important and how it connects to everything else. As in Her Story (Polygon’s game of the year 2015) I find myself reaching for a notebook and pen, making notes and trying to form connections. I’ll often have a pretty good idea who a person is, but I’m always looking for that extra piece of information to firm up my guess. The story is a torrid adventure that is told not chronologically, but according to its own twisted logic. Time is its own puzzle. I begin to place the movements of individuals, loitering on the margins of scenes, whose deaths (or murderings) are yet to occur. It all adds up to a shifting, constantly surprising narrative of a few dozen people caught up in a series of terrifying events. Each responds in their own way. Pope’s ability to map out the lives and deaths of so many individuals, and to parse them out in the fashion of a mystery, is an extraordinary feat. It adds up to a fascinating story that compels me to keep investigating, even when I feel overwhelmed by interlinking events and personalities. Return of the Obra Dinn takes the whodunit’s conventions and twists them into kaleidoscopic narratives that are perplexing and delightful. This isn’t merely a great game, it’s the work of an intense and creative intelligence. It’s out now on Mac and Windows PC. "}