{"id": "Every live-action Pokémon in the Detective Pikachu trailer ", "paragraph": "Detective Pikachu is bringing Pokémon to the real world for the very first time. While we can all enjoy the AR camera in Pokémon Go and the 2016 Pokémon Super Bowl commercial, this is the first-ever feature-length, live-action Pokémon movie. And it’s not just Pikachu getting the live-action treatment — Pokémon from all generations appear in this trailer.Here’s what we spotted: The opening scene gives us fast glances at a bunch of Pokemon in the area. Right away, we know we’re in the Pokemon world, and it is chockfull of Pokémon. We see a Comfey floating among some of the Flabébé in the very beginning of this scene, as well as Fearow in the air and Braviary on the ground. Walking along the street, we spy a Dodrio and a wee little Charmander in the bottom-left corner. There’s also a Bouffalant lurking in the crowd.Read nextThe first Pokémon in focus is this Psyduck plodding alongside the lead female character Lucy (Kathryn Newton), a junior reporter following her first big story. There’s no actual Gengar senn in the trailer, but a parade balloon in the shape of one can be seen in a background shot. There’s also a Jigglypuff balloon, fitting for the “Balloon Pokémon.” Is there a celebratory Poké-parade in this world? Does it have to do with Thanksgiving at all? Here’s another, closer picture of the Psyduck later on in the trailer — check out those eyes! That bill! Ah yes, there he is. The Pokémon of the hour: Detective Pikachu in all his furry glory. Voiced by Ryan Reynolds, this Pikachu’s more about crime-solving than battling, relying on his wits and deductive reasoning to get the job done. A group of Emolga can be seen clustered on top of the food stalls towards the left in this crowded market. You can also see an Audino towards the right. (And in the middle of the crowd, three distinct Dodrio heads peep out towards the back again.)A collection of posters shows a missing Squritle and Pancham. What happened to them?!This lovely pastoral scene shows our heroes Tim and Detective Pikachu following a herd of Bulbasaur crossing a river, as some Morelull drift around them. How picturesque! An angry Jigglypuff stands on top of a table in what looks like a dingy little diner, and it’s definitely ready to throw down after being interrupted from its singing. We’ve learned from the anime: Don’t you dare interrupt Jigglypuff once it starts to sing. Blink and you’ll miss it. In the background of the Jigglypuff scene, we can see a poster on the left advertising some sort of showdown between these two fighting types. It’s big! It’s scaly! It’s Charizard fighting in some sort of battle arena! While the quick glimpses we got of Charmander didn’t really show off its scales, we can definitely see the reptilian features in the Charizard. The close-up especially shows off the scales on this big fella. A group of Greninja attacks, slashing their slimy fingers across the camera. Catch a look at their long tongue scarves! Greninja, it appears, travel in packs and ambush unsuspecting passerby. This crowd — presumably watching a Pokeémon match — has a Rufflet toward the left and a Squirtle standing on something toward the right. Mr. Mime is already one of the more ... peculiar of the Pokémon designs. Seeing it rendered in live-action is a particularly peculiar experience. We never realized its shoulder-ball-things were so textured. Its eyes! The wrinkles around its eyes! There’s a lot of Mr. Mime happening. See any Pokémon in the trailer that we missed? Point ’em out in the comments for some good ol’ Poké-spotting! Detective Pikachu comes out on May 11, 2019."}