{"id": "What makes Haruki Murakami’s books so alluring, yet near-impossible to adapt", "paragraph": "With his new film Burning, writer-director Lee Chang-dong embarks on one of modern cinema’s greatest challenges: adapting Japanese author Haruki Murakami. The critically renowned author is known for books like Norwegian Wood, adapted into a passing 2012 film, and The Wind-Up Bird Chronicle, which no one in the film world seems daring enough to attempt, both of which have earned him crossover acclaim in America. But unlike such populist, literary titans like Stephen King, filmmakers haven’t reaped his bibliography for big-screen ventures. While “Barn Burning,” the short on which Burning is based, isn’t the first of shorts to make it to screen, the film is the first major adaptation of Murakami’s work to have picked up awards (at the Cannes Film Festival, nonetheless) and receive unanimously positive reviews.   There’s a reason: in Murakami’s work, emphasis is placed on the mundane aspects of everyday life as opposed to focusing on what may seem to be ostensibly more “interesting.” While Murakami’s mundane doesn’t always offer a quick fix in terms of gratification, it is by no means ordinary; his prose can enchant even the most stagnant, passing thoughts. Take this quote from “Barn Burning,” written from the perspective of the story’s protagonist:You burn barns. I don’t burn barns. There’s this glaring difference, and to me, rather than say which of us is strange, first of all I’d like to clear up just what that difference is.Murakami’s short collection The Elephant Vanishes, in which “Barn Burning” is included, subverts the idiomatic “elephant in the room” by having characters speak their thoughts, as opposed to merely thinking them. The main character, who admits to burning barns, is completely open about his obsession. The man who he is speaking to has no fear when he asks as to the nature of the eponymous barn burning, either. All thoughts are spoken, which makes the atmosphere more familiar than it should be. The weird and arbitrary nature of the act of barn burning is normalized as the people in the story address it in a way that makes it so.This atmosphere alone proves difficult to adapt. Although the characters are just speaking, it’s the transition back and forth from dialogue to narration that rips the story out of the ground. It’s the certainty of the written word that makes sure abstract concepts can be embedded in the mundane. The screen needs to communicate the atmosphere through kinetic action such as dialogue and visuals. It is far harder to create a setting in which nothing is strange when the viewer can see everything that is happening, like in the abstract setting of “Barn Burning’’ that hosts the calm discussion over a couple of shared joints.This principle is addressed in several of Murakami’s works. In The Wind-Up Bird Chronicle, the protagonist Toru Okada sees his wife and cat leave him suddenly and separately for equally mysterious reasons. It takes Okada confining himself to the pitch darkness at the bottom of a well to be able to see things from a more detached perspective. In Norwegian Wood, Murakami writes, “if you’re in pitch blackness, all you can do is sit tight until your eyes get used to the dark.” The common denominator here is the fact that you need to patiently look at the nothingness contained in mundane corners of the world in order to see them as something extraordinary. It’s easier to do this when these things are metaphysical, contained within words alone; when they become visual, they become more familiar, more real, and far more difficult to deal with in this way.Murakami’s oeuvre as a whole tends to focus on the mundane aspects of everyday life. For example, in The Wind-Up Bird Chronicle, Okada takes great pains to illustrate in detail the 13 steps that are necessary to perfectly iron a dress shirt. He spends many of his unemployed days people-watching with a coffee and a donut, and the book takes no pains to get from A to B in a hasty manner. Readers sit with Okada for several pages at a time, watching him watch the world, drinking in the mundane aspects of the strange thing we know as existence. Murakami regularly inserts these ostensibly dull kinds of stories into his fiction, and for good reason.For Murakami, mundanity holds a charge. This charge can be electrified in order to elevate the ordinary to the extraordinary at a moment’s notice. However, the sparks are few and far between, Murakami instead threading his observations through the space between electrified moments. In his 2014 novel Colorless Tsukuru Tazaki and his Years of Pilgrimage, Murakami places particular emphasis on the names of the protagonist and his friends. Kuro, Shiro, Aka, and Ao, or black, white, red, and blue; the colored names of Tazaki’s friends are what ultimately make him feel eponymously colorless. In a world of obfuscation and color, Tazaki observes the happenings around him, without ever touching brush to palette himself, an unfortunate man who had been born with a name meaning “to build.” Although the charge imbued in the novel’s naming practices remains dormant for quite some time, the names of the protagonist’s friends are eventually revealed as the catalyst that set his Kafkaesque ostracization in motion.In fact, it is his friend Haida, “gray,” who voices the novel’s self-conscious proclamation that “you discover a depth to it you don’t notice at first. Most of the time it’s hidden behind all these embellishments.” Whereas cinema so often focuses on action such as visuals, gestures, light, and sound, Murakami’s fiction is based on the subtleties buried beneath the embellishments of the ostensible written word.  In “Super-Frog Saves Tokyo,” a short story from his compilation After the Quake, Murakami offers a dramatic contrast with the hustle and bustle of everyday life in Tokyo a few days after the 1995 Kobe earthquake. As ordinary cityfolk go about their daily routines, Katagiri plans to venture beneath the city with a six-foot-tall frog in order to fend off the Worm that threatens to destroy Tokyo with another devastating earthquake. Despite its fantastical nature, this story is consistent with the other stories in the collection, even before it uses the “it was all a dream” defense, because Murakami’s writing allows a reader to suspend their disbelief in a way that’s more difficult for a film that will inevitably deal in the literal. While a film must offer a visual version of Super-Frog, Murakami can persuade you of Frog’s existence by making his presence consistent with the proposed logic of the text, and the collection as a whole. At times, the reader forgets that the person in the narrator’s kitchen is actually a giant amphibian who is proposing a surprise attack on a Worm beneath the Tokyo Security Trust Bank. In the same way that Toru’s mundane instructions for ironing a shirt are electrified, Super-Frog’s supernatural nature is subverted by the fact that stylistically it is deemed to be ordinary. This is why the adaptation of “Barn Burning” has the potential to truly excel; in order to communicate the space necessary in a Murakami story, a film must tackle a much more contained story, where the narrative is at its most potent in the sparse moments dotted throughout a mundane atmosphere. American scholars have deemed the cinematic approach to this kind of text as “slow cinema.”In a standard edition of The Elephant Vanishes, “Barn Burning” is about 20 pages long. Although all 20 pages are well-written, the main moments in the story are when the narrator smokes a joint with a man who confesses to be a barn burner, and the subsequent scene of the two discussing whether or not the man burned the barn he had been intending to burn. Burning is a 148-minute film, a running time fit for Murakami’s pace. Consider Norwegian Wood, a novel in which Murakami’s tragic hero falls deeply in love with his dead best friend’s girlfriend. There are a handful of pages in this novel devoted entirely to inner monologues and symbolism. This kind of thing can be transposed into cinema, but delicately. By taking a short story as its subject, Burning might capture the essence of Murakami’s style as well as the content without eliminating any of the key moments. People all over the world were disheartened when they learned that The Hobbit was being converted into a trilogy, despite only having around 300 pages of content, depending on the edition. However, the opposite holds to be true with Murakami — while The Hobbit suffered from not having enough pages, Murakami’s “Barn Burning” works for precisely that reason. The Hobbit was supplemented with apocryphal content from the back catalogue of Tolkien’s notes; Burning may indulge a few of the director’s preferential choices, but it has room to do so without compromising its status as a Murakami story.Murakami does the same in his stories, enchanting the mundane, electrifying the ordinary so that it becomes extraordinary. As the inimitable Percy Bysshe Shelley once wrote, “Poetry lifts the veil from the hidden beauty of the world, and makes familiar objects be as if they were not familiar.” In the Japanese writer’s case, it’s about breathing room, a lesson Burning seems to employ by adapting the short story into a two-and-a-half-hour-long film. As reviews reflect, “Barn Burning,” and its adaptation is not about who burned the barn, why he did, or how he did, but about the difference between he who burns barns and he who doesn’t.The best way to analogize this is to take a scene from Norwegian Wood, during which the main character, Watanabe, and his friend, Midori, sit on the balcony above the Kobayashi Bookshop, listening to music. Across the way a building is on fire (Murakami loves his flames). They sit there, not talking, drinking in the scene. There is no chaos, no fear, no danger. Midori strums her guitar while they sit there and watch the building burn. There is no pressure to recognize the strangeness of the fire, as it is just another aspect of the backdrop to life that is mundanity. It spikes electric now and then, but ultimately, the most normal thing about life is that none of it is normal. As Watanabe and Midori watch the flames swallow the building, the reader sits beside them in the calm within the storm."}