{"id": "Diablo: Immortal will have boss-specific loot drops, as well as a traditional Diablo loot system", "paragraph": "Diablo: Immortal — the new mobile Diablo game announced at BlizzCon 2018 — has earned the ire of many diehard Blizzard fans since its reveal. Though Blizzard developers have spent the entirety of BlizzCon 2018 assuring players that more Diablo is coming, fans are still pretty frustrated with the game that was announced. In this confusion, not much is really known about how the game’s systems will work once Immortal is released to the public. At BlizzCon 2018, we sat down with executive producer and Blizzard co-founder Allen Adham to talk about the only thing Diablo players really care about: loot. In the demo we played at BlizzCon, the final boss drops a legendary weapon each time he’s killed — the same legendary weapon every time. In an effort to understand how loot will be different in Immortal, we asked Adham if the completely random system that players are used to in Diablo will be back, or if players can expect quest or boss specific loot.“We imagine that, very much like [Diablo 2 and Diablo 3, Immortal will] take the best elements of [all three Diablo games], hopefully even improve them, and Diablo: Immortal will carry those across,” said Adham. “So that’ll mean you can expect the [loot] fountain that you’ve become used to. It’ll be a combination of some incentive to run specific dungeons and fight specific bosses. Not everything will just be kind of random world drop, but a lot of it will be random world drop and then the best game has elements of both.”Adham states here that players will be able to target specific pieces of loot from specific places in the game — by endlessly killing the same boss over and over again. This is fairly uncommon in the series’ last entry, Diablo 3, and really only comes into play with items like Leoric’s Crown, a guaranteed legendary from the game’s first boss. There are also items like the Hellfire Amulet that are purely quest based, and involve collecting a group of materials from bosses around the world to acquire.\n    Related\n  Unlike Leoric’s Crown, most items in Diablo are earned from loot fountains — a term that Adham and the Diablo community use to describe the explosion of loot after an enemy has been killed. These fountains can contain any random item in the game, usually usable by your selected class. While Diablo is filled with so many items that this system should seem untenable, the idea is that you should see enough loot fountains in a single play session that you’ll eventually earn every item at least once. This new philosophy that Blizzard seems to be introducing in Immortal — the idea that certain loot pieces will be farmable by repeating the same content — is something that we see in other games like World of Warcraft of Destiny 2. But while these other games are all about small, meaningful loot drops, Diablo has always centered around overwhelming amounts of treasure for players to gather. This new system seems to go directly against what Diablo has been in the past — going anywhere and killing anything to get what you want. While Diablo 2 had ways to trick the system, it was all about efficiently farming large groups of enemies rather than that one special boss — even Leoric’s Crown from Diablo 3 is also a world drop.However, Adham was very clear that Diablo: Immortal is still early in development, and that the BlizzCon demo is scripted very specifically for the show — the same boss likely won’t drop the same sword each time he’s killed when the game is officially out. But for now, it seems as though Immortal will be moving away from some traditional gameplay ideas as well as onto a new platform. "}