{"id": "While you play Red Dead Redemption 2, make time to read this book", "paragraph": "Paulette Jiles’ novel News of the World doesn’t fit comfortably in the great Western canon. Its hero is neither sheriff nor cowboy — though he’s plenty heroic — and in a hair more than 200 pages, Jiles captures the soul of Texas, but does so in a distinctly un-Texas fashion, with concision and humility. The 2016 National Book Award Finalist gives overdue dimensionality to the folks other Westerns would lend no more than a descriptive line, a naughty joke or a spit of tobacco — a flourish that gives a dusty ranch some character as the real stars trot in the foreground on their ride toward a spectacular and gory showdown. Ahead of Red Dead Redemption 2, a 60-plus-hour epic Western brimming with gunplay and set-pieces, I recommend this beautiful, quiet little book as a palate-cleansing aperitif.News of the World tracks the evening years of Captain Kyle Kidd, a codger who’s seen action and felt loss, served in three wars and buried his wife. But he’s no grizzled cowboy. We find Kidd sojourning northern Texas, reading newspapers to local crowds, scraping together enough coin to meet life’s necessities. It’s 1897 and, as a newsreader, Kidd has the challenge of explaining the ratification of the 15th Amendment — giving every man, no matter their race, religion or previous condition of servitude, an equal vote — to a state none too keen on law, let alone equality, and a people who hear about governance more often than they experience it.Kidd takes pleasure in the work and the travel that it demands, at least until that lifestyle is disrupted by a $50 assignment to escort a 10-year-old girl to her extended family in San Antonio. She was captured (her parents, killed) by the Kiowa Indians, then “rescued” after four years of living and learning with the tribe. She speaks little English and refuses to respond to her Anglo-name, Johanna, and she’s mean as all hell, a spitfire who takes poorly to baths and proper clothes, showing little care for the safety of townsfolk and less for their farm animals. In any other Western, her traits would be assigned to the curmudgeonly elder or the town drunk, not a child. Driven by an opaque inner goodness (and an acute understanding that no other sucker would endure escorting this ill-tempered human cargo), Kidd takes the payday and the trip south. He and Johanna bond along the way, encountering the book’s equivalent of explosive action, but their journey is nether as sentimental as the premise sounds nor as blood-soaked as its genre demands. While the Western, from its origins, has been a lens to interrogate the frictions of the American West — lawlessness, encroachment of government, colonialism — Jiles veers toward adjacent but different national traumas: the fertile soil for vacuous machismo, the wrongful assumption of cultural supremacy, the illusion of individual freedoms for those who aren’t white and male.Under these themes, Kidd could be a leaden cipher, but Jiles imbues him with generous optimism, his career a potential guard against the cynicism that rumbles through the West like a persistent dust storm. The book radiates with an uncommon love for and faith in the news — not just the power of disseminating information, but the pleasure of its recounting. Kidd savors the performance, carefully picking from his collection of papers the stories that will surprise, engage and better his crowds. He does not inflate, hyperbolize or wholly fabricate. He peddles facts through a lawless land, and though its people often disagree with the information, they recognize facts for what they are: truth, or its closest representation.Jiles sets a lumbering idea or mechanism — like the necessity of a trusted press — upon a pedestal, then elegantly cleaves off the fat that has made the concept in its present state so heavy and dense. Big, impenetrable, knotty ideas like choice, freedom and change feel approachable, knowable and present. In its best moments, News of the World pins modern anxieties to its page with just a few dozen words. In the thick muck of the journey, Kidd reflects on what led him to this predicament. “Maybe we have just one message, and it is delivered to us when we are born and we are never sure what it says; it may have nothing to do with us personally but it must be carried by hand through a life, all the way, and at the end handed over, sealed.” Jiles gives readers the precious gift of momentary existential solace.Every few years, critics rally around a new Western that’s dustier or uglier than its predecessors, more keyed in to the complexities of life on the range or more in touch with its manure-dank simplicity. The Proposition. True Grit. Bone Tomahawk. These films get labeled the truest or most unflinching depictions of the West, and in the process, ascend to become something more than a movie, a 120-minute-or-so critique of the genre, America or “our moment.” I’d wager a gold nugget that Red Dead Redemption 2 will be be placed on this mantle. (Spencer Hall argues that its predecessor deserves the title.) Its developer, Rockstar Games, has inched recent productions away from cinematic pastiche toward genre deconstruction, and few genres equally devour and reimagine themselves like the Western. So I hope some corners of the game will have more in common with News of the World than the past century of gunslingers. Rockstar spends many years developing its games; much of its script for Red Dead Redemption 2 was likely locked before News of the World was published, meaning the writers couldn’t benefit from its influence. Not that it would necessarily matter. Studio co-founder and Red Dead Redemption 2 writer Dan Houser recently claimed that he devoured “hundreds” of books and films, none of them contemporary — a strange comment, considering how the conversation around depictions of the American West has shifted so dramatically and vitally in the past decade.But there are still reasons to be optimistic that the game will aim beyond genre trappings. While demos have promised all the familiar Western tropes — train robbing, bank heisting, gun twirling and dawn dueling — early gameplay has equally underscored the tension of banality and brutality that keeps the genre afloat. Hunting is a slow and dirty process. Horses, like facial hair, must be respected and cared for. Time is most often spent gabbing at a campfire or doing busy work; violence and crime are punctuation, a puff of smoke and a splash of blood that break up the greater material of a life.The trouble with big generational Westerns is they don’t actually break the mold; rather, they’re poured laboriously and respectfully within it. That is to say, so many of these “once-in-a-decade Westerns” revise rather than reconstruct. They tell stories about the people you expect to find waiting in a collection of Larry McMurtry books. They mix and match Frank Gruber’s seven plots for Westerns: the encroachment of modernity, the battle to save a ranch, the rise of an empire, the quest for revenge, the “taming” of the wilderness, the survival of an outlaw gang, the challenge of a lawman in a lawless land.Maybe this time the dusty town is in Australia. Or maybe the no-shit-giving male sheriff is a no-shit-giving female sheriff. Or maybe this is a Western in space. They might elevate the genre, remixing the familiar tropes or casting them in a fresh light, but they ultimately stick to the same expectations — the pleasure coming from how they obey, bend and break the rules, but always playing the same game. This is a pleasure of genre at large, and the Western in particular. But it also can be conscriptive, pulling the genre deeper and deeper into itself, less a critique of the world than its own tropes.Whatever story Red Dead Redemption 2 tells, I believe News of the World will make the experience richer. The book’s short and sweet, a testament to the genre’s evolving richness. It could be the Western of this generation, if it had any interest in being a Western at all. And it will give not just voice, but blood and depth, to those strangers you pass as you gallop toward the sunset. "}