{"id": "This week’s sexiest comic features Superman and Lois Lane renegotiating their marriage", "paragraph": "One of the first things writer Brian Michael Bendis did when he kicked off his run on the Superman titles, Superman and Action Comics, was to whisk Superman’s wife and son off into space with no means of phoning home. Effectively, the Man of Steel was alone. But in the pages of Action Comics, Bendis has seeded hints that some of the superfamily were really not so far away after all. And this week, Bendis and artist Ryan Sook delivered the kind of scene that you wouldn’t necessarily think would belong in a book with “action” in the title: Two adults sitting down to have an honest talk about the state of their marriage. And it includes one of the sexiest panels of Superman I’ve ever read. The conversation begins when Superman finds Lois in the mundane earth city of Chicago, not in deep space, where he expected her to be. And, after reassuring her husband of the most pressing question between them — their son is fine, and still in space — they do what any loving couple would if they hadn’t seen each other in a while. Lois went to space to chaperone the adventures of their half-Kryptonian son Jon with his grandfather — Clark’s biological dad, Jor-El, who was recently revealed to have narrowly survived the destruction of Krypton. At the time, they weren’t really sure if Jor-El was trustworthy. But once she got out there, Lois realized her presence as a baseline human was putting Jon and Jor-El in some danger in the inhospitable reaches of space. And for another thing: Jon is doing fine. Flourishing even. “It was the best thing that ever happened to him,” she tells Clark. “Your creepy father was right. Jon needed to get out there and Jon did not need me.” Why is Lois back? She feels like her family has hit a turning point, where they can stop pretending they’re a normal family — something the Kents did for most of Jon’s childhood. And for the first time in a long time, Lois Lane, Pulitzer Prize winning investigative journalist, can focus completely on her work. Clark has one response to that. Then they have sex again. It’s canon: Superman is turned on by his wife doing Journalism. Still, Clark, a man raised on a farm by two loving and well-adjusted parents, protests the idea that he and Lois and Jon can’t find a similar normalcy. And then he pauses, says, “Hold on...” and superspeeds away to throw his costume on, stop a superhuman prison breakout, and superspeed back to being naked in their bed. It doesn’t take much more pushing from Lois to get him to see her point of view. Jon’s safe in space and coming into his own as a teen. Lois is going to research and write her book. Clark is going to “save everything you can get your hands on.” They can wholly devote themselves to the stuff that makes them them, and still be a family. And just in case anyone might still have some worries: Bendis and Sook’s take on two partners — who just happen to be a superhero and his superhero-adjacent wife — renegotiating their family is exactly the kind of close character work that a reader will remember about a superhero story, even years later. Clark eagerly asks Lois when he’ll get to read her new book, and Lois needles him for never learning to ride a bicycle (for obvious reasons). It’s a serious scene that manages to be romantic, funny, heroic and sexy all at the same time — and it’s a good reminder of why Lois Lane and Clark Kent aren’t just the oldest romance in superhero comics. They’re one of the best."}