{"id": "Five Nights at Freddy’s movie delayed, new ‘AAA’ game in the works", "paragraph": "Scott Cawthon’s Five Nights at Freddy’s series shows no signs of slowing down, with a feature film, a new sequel, updated console ports and a new “big-budget game” in development. Cawthon outlined the future for Five Nights at Freddy’s on Steam earlier today, starting with the bad news: The movie based on the horror games has been delayed (even though it didn’t have an announced release date).Earlier this year, Blumhouse Productions announced that it was developing a live-action Five Nights at Freddy’s movie with director Chris Columbus (Mrs. Doubtfire, Harry Potter and the Sorcerer’s Stone) at the helm. But Cawthon said that this movie will take a little longer to complete, as he’s thrown out his original script.“I had a script written,” Cawthon said. “Jason [Blum] liked it, and Chris Columbus liked it too, but I tossed it. I had a different idea for it, one that I liked better. I take responsibility for this delay; it’s my fault.”Cawthon said he’s “determined to find the right story,” which has been a challenge. He’s focusing on the story told during the first three Five Nights at Freddy’s games for his movie script.“I’m sticking to what I’ve always said, either the right movie gets made or no movie gets made,” Cawthon explained. “I hate delaying a project that’s already seen so many delays, but I have to go with my instincts on what I think will be exciting and interesting, and what I think the fanbase will really want to see. If that means that I have to start over ten more times, then that’s what I’m going to do. The good thing is that each attempt gets better and better, in my opinion. So, despite the delays, it’s going in the right direction.”On the gaming side of things, Cawthon said that there are virtual reality and augmented reality games based on Five Nights at Freddy’s in development, as well as “new, improved, HD ports of all of the original games” for Android, iOS, Nintendo Switch, PlayStation 4 and Xbox One.There’s also a “AAA” game based on the series, although it’s said to be very early in development.“There is a BIG deal in the works to create an incredible big-budget game!” Cawthon said. “I can’t reveal any details yet as this project is still in its planning stages, but I’m working closely with the studio involved to ensure that it delivers what (I think) FNAF fans will want to see!”The most recent game in the Five Nights at Freddy’s series, Ultimate Custom Night, was released in June. Cawthon describes the game as “the ultimate FNAF mashup,” with more than 50 selectable characters and custom difficulties."}