{"id": "How is Starlink: Battle for Atlas as a Star Fox game? ", "paragraph": "Starlink: Battle for Atlas on the Nintendo Switch includes Star Fox’s Fox McCloud as a playable pilot, and the character’s inclusion goes far deeper than just a cameo. This is partly due to the fact that Starlink looks and plays like a traditional Star Fox game, no matter which console you play it on. I skimmed over the surface of planets while battling all sorts of enemies or helping the locals, and the fight extends into space and through asteroid fields. The ability to move on a limited vertical plane while on the ground and, yes, execute a barrel roll made me feel right at home as a fan of Star Fox. There may seem to be some deja vu here: Some parts feel like Star Fox, while other aspects of Starlink reminding me more of No Man’s Sky. But what of it? Starlink isn’t shy about showing off its influences, which makes me think it’s confident, not larcenous. And having the Star Fox characters themselves involved in the game’s story is as good as Nintendo giving its official blessing. Fox and his crew are introduced at the very beginning of the game, and they’re woven into the story in a way that feels relatively organic. They’re out in space looking for Star Wolf, and the human crew of the Equinox, the ship that acts as your home base, may just be able to help. One group needs a few extra pilots; the other group could use some intel and help with its ships. An alliance makes sense. While the Star Fox-specific missions can be finished in a few hours, they operate as an enjoyable distraction from Starlink’s main story, and the game’s design makes it easy to dip in whenever you’d like. The upper right-hand corner of the screen will always let you know if you’re playing a main story mission, a side-mission or some of the Star Fox content, and you can request to move into any branch of the story whenever you’d like. The game already sets up the idea that you’ll only survive with the help of other alien races, and by helping them in return. Working with Fox makes sense in that context, especially since the relationship benefits both teams. Having a short Star Fox-themed campaign in there is nice and all, but the real fun comes from the fact Fox and his Arwing are also placed into your collection of pilots and ships. This means that you can add the Arwing’s ... wings to any other ship you may own, or have Fox pilot whatever monstrosity you create with your pile of ship parts and weapons. Fox has his own skill tree and special abilities, and you’ll be able to upgrade the Arwing as you go, but just as important is the fact that Fox, Slippy Toad, Peppy Hare and Falco Lombardi are included, fully voice-acted and well-written. They talk and bicker with each other as well as the crew of the Equinox, making it seems as if they actually belong in this world instead of being included on the side as little more than a publicity stunt. Watching one of the cutscenes where Fox is on the bridge of the Equinox, just kind of hanging out, is a neat little thrill. All this content is missing from the Xbox and PlayStation 4 versions of the game, and you can’t unlock it by using the Arwing or Star Fox toy on those consoles. That means that other consoles are missing an entire ship and character that can help you through the entire experience, as well as the Star Fox-specific storyline. That’s a huge selling point for the Switch version of the game, and it’s great that Ubisoft was able to include such an iconic character in a way that enhances the entire experience. This may not be enough to satiate everyone who is still hungry for a standalone Star Fox game, but it’s a much more robust use of the world and character than I was expecting. And if nothing else, we have something good to wash away the memories of that last Star Fox game, once and for all."}