{"id": "Meltan is now catchable in Pokémon Go via special research", "paragraph": "To commemorate the release of Pokémon: Let’s Go, Pikachu! and Pokémon: Let’s Go, Eevee!, the mythical Pokémon Meltan is available to catch now in Pokémon Go.You will have to complete a series of special research to get a chance to catch the little gooey nut thing, similarly to how you have to for Celebi, Mew and Spiritomb. It looks like there are nine different steps to catching Meltan, which is the most we’ve seen so far.One of the field research quests rewards an encounter with a Pidgey that turns out to be a Ditto, if you make an excellent throw. This is perfect for any trainers on the hunt for a Ditto for the Mew special research. If you complete the mission, you might want to hold off on turning it in, as the third special research step for Meltan also requires a Ditto.Meltan originally showed up in the game for a few minutes after a community day event, though any caught Meltans turned into Dittos. It should be noted that Meltan and its 400-candy-needing evolution, Melmetal, can be used as a gym defender as of right now. This is the first mythical Pokémon to be able to do this, which has some trainers worried about the new paywall introduced to the game. If Pokémon Go players can only catch one Meltan without the Switch games, then are they expected to walk the Meltan to get the 400 candies needed to get this great gym defender? While Rare Candy can be used to evolve the Pokémon, using that many while walking it will be a difficult task for most.The mobile game has also released some new special content along with Meltan. It will be running more field research missions that feature Pokémon that are from Kanto, but aren’t available in the new Switch games until Nov. 27. Pokémon like Kabuto and Omanyte will also be appearing in the wild at a higher rate! For three days from Nov. 23 until Nov. 26, Vaporeon, Jolteon, Flareon, Espeon, Umbreon, Raichu and Alolan Raichu will also be appearing in more raids. Shiny Magnemite has also been added to the game, according to a find on the Silph Road subreddit."}