{"id": "The best horror series in comics is back just for Halloween", "paragraph": "On a year when Halloween falls on a Wednesday, there are a lot of spooky comics coming out, including Wytches: Bad Egg, an 80-page one-shot story from the master storytelling duo of Scott Snyder and the artist known as Jock. Fans have been waiting a long time for Bad Egg. Snyder and Jock finished their first Wytches story in 2015, promised a sequel, and, since then, have been frightfully busy doing everything but. Bad Egg is their first Wytches story in three years, and it’s the best new horror comic you could read on this most spooky of new comics days. Wytches takes place in a world where for generations, a cult-like organization of human beings have secretly formed a dark symbiotic relationship with a species of intelligent, hungry monsters known as Wytches. The setting has everything you could want from a horror story: Broken family dynamics, spooky forests, body horror, grisly murders, a full tank of gaslighting and horrifying monsters at the end of it. But underneath the monsters — and the people who sacrifice their loved ones to them for material gain — Wytches is about the terrible things parents do to keep their children from feeling fear, and the terrible things parents do to their children because they are afraid. Bad Egg is about Sebastian Clay, a kid descended from the Irons, a cult-like organization dedicated to hunting the Wytches and their allies, and his first real test as a member. As Seb himself explains it, he’s probably going to have to kill his best friend’s family, but there are plenty of stomach-dropping twists along the way to Bad Egg’s conclusion. Really, it’s a story about childhood friendship, and about being old enough to be afraid of the wider world but young enough to believe it when your mom promises “everything’s going to be OK.” Scott Snyder’s talent for putting his own fears on the page is in full force in Bad Egg, and Jock’s artfully messy coloring work shrouds the books’ monsters in a sense of decay and unformed misshapenness even when you’re looking right at them. Wytches: Bad Egg was initially serialized in 12 issues of Image Comics’ Image+ magazine, but its release this week concludes the story with its thirteenth (of course) chapter for the first time. You can grab it at your local comic shop or on Comixology. "}