{"id": "Here’s how Anthem’s four character classes work ", "paragraph": "Over the past few weeks, EA and BioWare have been releasing information about Anthem’s different player classes. These four classes — which are actually just the mechs, called Javelins, that players will pilot in the game — have unique attributes to them, as well as their own skills. However, just because Anthem is all about futuristic mech-suits doesn’t mean that classic RPG archetypes are left unrepresented. The Ranger is the all-around class; Colossus is the warrior-type defender class; Storm is the magic-user class; and Interceptor is the agility/speed class. Let’s take a look at how each one differs, based on BioWare’s profiles. The Ranger looks to be Anthem’s jack of all trades, master of none class. This is the first class that players will get access to.Even though you can grow into other Javelins as the game progresses doesn’t mean you have to. The Ranger still has a completely unique move set, and is the most well-rounded Javelin in the game. BioWare suggests that, despite being the starter class, Rangers will still have a place in end-game activities. Rangers can wield any kind of weapon in the game except for heavy weapons, which are exclusive to the Colossus. The Ranger’s melee ability is called Shock Mace, which is exactly what it sounds like. Essentially, the Ranger is able to engage in close-range combat with the use of this giant, electrified stick. When it hits enemies, it’ll electrocute them.The Ranger’s first Javelin gear slot is Grenade Gear, which is pretty straight-forward. Depending on the type of grenade the Ranger equips, they’ll be able to inflict all kinds of pain on their enemies by simply tossing grenades. Frag Grenade: Deals impressive damage in a large area of effect.Inferno Grenade: Ignites an area, dealing damage and setting enemies ablaze.Frost Grenade: Damages and freezes enemies in place.Seeker Grenades: Splits into smaller sub-munitions which seek out the nearest enemy.Sticky Bomb: Attaches to a single target for a contained, high-damage blast.The second Ranger ability is Assault Gear. This wrist-mounted launcher can harness all kinds of different abilities to take enemies down. Homing Missile: Fires a projectile that seeks out a target for a small area-of-effect explosion.Energy Pulse: Unleashes a blast of pure energy, hitting a single target with incredible force.Spark Beam: Fires a sustained beam of energy for continuous damage.Venom Darts: Launches a volley of darts that seek out a target for acid damage.Blast Missile: Fires a missile that explodes for area-of-effect damage.Like all Javelins, the Ranger has two different support options. Bulwark Point: Deploys a spherical field which deflects incoming enemy projectiles.Muster Point: Creates a field which increases weapon damage for teammates who enter its radius. Finally, the Ranger’s ultimate ability is multi-target missile battery. When activated, the Ranger will lock onto enemies in the area and fire guided missiles to find and destroy them.The Colossus looks to be your typical, beefy mech, capable of stomping all over the small flora and fauna of Anthem’s world. This mech is centered around defense, explosive melee combat and long-range artillery fire. BioWare’s description for Colossus is a bit goofy, but it paints the Javelin as perfect fit for aggressive players. If you find yourself always going for heavy armor variants in RPG games or “fat-rolling” your way through Dark Souls, the Colossus is probably for you. Colossus Javelins are the only mechs capable of carrying around heavy weapons in their arsenal. However, they can’t use pistols or submachine guns as a trade off. The Colossus’ melee ability is called Heavy Smash. Colossus Javelins can smash into the ground from the air or just beat things with a big melee strike. These melee attacks appear to have a wider area-of-effect than most other melees in the game, and can apparently crowd control enemies who aren’t instantly killed, making them more susceptible to attack.  The first gear slot for Colossus Javelins is the Ordnance Launcher gear. These weapons are shoulder mounted and can deal some serious damage to enemies. Depending on the weapon you choose, you can take out enemies at close or far range. High Explosive Mortar: Launches an explosive projectile that deals heavy area-of-effect damage.Burst Mortar: Fires a volley of smaller mortars that spread out to pummel a wider area of effect.Firewall Mortar: Fires a specialized mortar round that ignites a wall of flame, heavily damaging enemies that try to move through it.Lightning Coil: Strikes a single random target with an arc of electricity in front of the Colossus, prioritising targets with status effects.Shock Coil: Emits waves of electricity out from the Colossus, damaging all nearby enemies.The Colossus’ second gear slot is for their Heavy Assault Launcher. Like the Ranger, this is a wrist mounted weapon that deals damage to targets. It comes with a host of familiar weapon types, like flame throwers and rocket launchers. Heavy Cannon: Fires a large rocket in a targeted direction.Flame Thrower: Unleashes a continuous stream of fire to ignite enemies.Flak Cannon: Barrages nearby enemies with a short-range arc of projectiles.Railgun: Devastates a single-target with a forceful and precise kinetic round.Acid Spitter: Expels an acid projectile to damage enemies.The Colossus has two options when it comes to support, and both are centered around keeping their allies healthy. Taunt: Forces all enemies within a certain radius to divert their attacks to the Colossus.Deflector Pulse: Gives all nearby allies a damage-resistance buff.Finally, the Colossus’ ultimate ability is called the Siege Cannon. Unlike the rest of the Colossus’ kit, this ability seems to be more about precision. BioWare describes it as a cannon that you can simply point and shoot to deal high damage. It’s apparently powerful against bosses or locking groups of enemies down in a small area.The Storm javelin is all about using magic-like attacks to blow your enemies away. The wizard of the Anthem world, the Storm Javelin has low defense but very high offense. One of the unique Storm abilities we know about is called hover, and appears to actually just be a default state for the Javelin. Storm mechs are capable of floating over the world at all times, constantly hovering in mid-air. This is partially to keep them away from danger, but seems to also offer a intel advantage for players who’re able to survey the battlefield. In the gameplay stream with the Storm, we saw it have access to a powerful overshield whole flying.The Storm Javelin is able to use any kind of weapon except for heavy weapons, which only the Colossus can wield. The Storm’s melee ability is called Fiery Strike. This ability is specifically used to help the Storm get away, as it propels struck enemies backward.The Storm has two different seal abilities, both of which seem to be equipped to the Javelin’s weird, mechanical arm. The first is Blast Seals.Lightning Strike: A targeted strike that deals lightning damage in an area.Ice Storm: Creates a field of ice that deals damage, rapidly building to a final explosion of frost.Flame Burst: A quick explosion that deals fire damage at a target location.Rime Blast: Fires out a flurry of ice projectiles that deal damage and freeze close-range targets.Living Flame: A burst of flame energy that seeks out and ignites targets.While the second is Focus Seals.Hoarfrost Shards: Rapid-fire shards of ice that slowly freeze a target in place.Fireball: A versatile fire ability that can be fired quickly in small shots or charged for a larger projectile that explodes.Ball Lightning: A discharge of electric energy that can be bounced off of walls to reach targets behind cover.Glacial Beam: Fires a beam of powerful ice energy in a targeted direction.Arc Burst: Unleashes a blast of lightning that will leap to nearby targets for heavy damage.Like all Javelins, the Storm also has access to two support abilities — called Support Seals in this case. Wind Wall: Generates a defensive wall of wind that deflects incoming enemy projectiles.Nexus: Creates a field which provides gear cooldown reduction to teammates who enter its radius.The Storm’s ultimate ability is called Elemental Storm. Once the Storm activates their ability, they’ll start firing off blasts of elements in specific order, starting with frost, moving to electricity and finishing with fire. Finally, the area around them erupts in meteors. The Interceptor is all about fast movement and weaving in and out of fights. The playstyle seems to be that of a traditional RPG rogue, as players can move quickly and attack with blades.Like most of the other Javelins, the Interceptor can use all weapons except for heavy weapons. The Interceptor’s melee ability is Double-Bladed Daggers. Unlike most Javelins, the melee ability here is a large part of the Interceptors playstyle, and they allow the mech to strike fast and hard at close range.The Interceptors first ability slot is for their Assault Systems.Seeker Glaive: Throws out a razor-sharp projectile that seeks out the nearest target.Acid Bomb: Tosses a grenade which explodes, splashing all nearby enemies with acid.Cryo Glaive: Launches out a projectile that locks on to a nearby target and freezes it on impact.Cluster Mine: Throws out a group of mines onto a targeted area which explode on contact with an enemy.Spark Dash: Dashes forward, leaving behind a trail of electricity that damages enemies.The second is for their Strike Systems.Star Strike: Charges an enemy with energy which explodes after a delay. The explosion deals increased damage if the target is destroyed before the full delay.Plasma Star: Tosses a plasma-empowered shuriken at a single target, effective at long range.Nova Strike: Sends out a projection of the Interceptor which will attack enemies it comes in contact with.Tempest Strike: A devastating single-target attack that can stun smaller enemies.Corrosive Spray: Sprays out a jet of corrosive acid that damages all enemies hit.The Interceptors support abilities allow them to cure allies or debuff enemies. Target Beacon: Marks a target for increased damage which will switch to another enemy if the marked target is destroyed.Rally Cry: Removes status effects from all nearby allies.The Interceptor’s ultimate ability is called Assassin’s Blades, and is essentially just an augment of their normal melee abilities. When activated, the mech pulls out two blades, gains some resilience and is able to quickly slice up everything around it. Anthem will launch on Feb. 22, 2019, for PlayStation 4, Windows PC and Xbox One.Update 11/12: Bioware’s profiles now list each class’ unique abilities. We have altered the article to reflect all the recent updates to classes and will continue to update as new info is added. "}