{"id": "Destiny 2: Forsaken random roll guideHow do random rolls work, and why do they matter?What about weapon stats? Should I care?What about barrel and magazine perks? How much should I care?", "paragraph": "Random rolls were a hotly requested feature for Destiny 2: Forsaken. Bungie delivered with the recent expansion, turning each weapon drop into a potentially exciting piece of loot. But if you just want to jump in and play some Destiny 2 without crunching the numbers, random rolls can be scary and complicated. That’s where we come in. In this guide, we’re going to take a basic look — along with the help of Destiny YouTuber Fallout Plays — at what random rolls are, how they work and how you can learn to value your guns for yourself. And hey, if you just want a list of good perks and stats for your weapons, we’ve got that too. Random rolls matter because they allow you to find something that really works for you and fits your play style. Just because a gun is a god roll for one person doesn’t mean it’s a “god roll” for you. You may want to use the same gun in both PvE and PvP, but use different perks for each. Random rolls allow you to do that, and finding weapons that work for you should be a priority with Forsaken. There are three kinds of drops in Destiny 2: Forsaken: static, curated and random. A static roll will always drop with the same perks every time — just like they did in Year 1. A good example of this is the Vestian Dynasty sidearm, which you can get from Petra during the Forsaken campaign. Vestian Dynasty will always have a choice between Extended Barrel and Chambered Compensator, Alloy Magazine and Armor-Piercing Rounds, Kill Clip and Dragonfly. There aren’t many static rolls in the game with Forsaken, so you’ll rarely encounter these.Random rolls are going to be a part of almost every gun you come across in Forsaken. These sound complicated but are actually simple. Each gun has a list of perks that can roll in each slot: a barrel perk, a magazine perk and two weapon perks. Any weapons you come across will only be able to roll certain perks — a list of which you can look up on Light.gg.Curated rolls are just fully Masterworked versions of randomly rolled weapons with specific perks. They are Bungie-determined “god rolls” — meaning their perks should always work well together, and the weapon will have a good masterwork stat guaranteed. For example, the curated roll of the raid auto rifle Age-Old Bond has Extended Barrel, Light Mag, Fourth Time’s The Charm and Rampage. It also comes with a full Masterwork for range. These drops are rare, and not every random roll weapon has a curated version.Each weapon in Destiny 2 has its own set of stats. These vary from weapon type to weapon type, but most guns use the same seven stats:Some weapon types have unique stats:Weapons also have hidden stats as well: As if this didn’t seem complicated enough, some stats even have major differences and uses on console versus PC. We’re going to go through the stats that matter with Fallout Plays to figure out what they do and how they impact your guns.Impact is a confusing name for a basic stat. In Destiny 2, impact is the damage that the weapon does. The higher the impact, the higher the damage per shot. For example, impact is really important when looking for a PvP shotgun. The more impact the shotgun has, the fewer pellets you’ll actually need to hit your target with before they’re killed. Range is kind of the opposite of impact, in that it sounds more straightforward than it is. For most guns, range is actually the most important stat to roll. Range is also tied to accuracy in Destiny 2, meaning that you’ll hit more shots on more difficult targets the higher your range stat. Weapons have damage drop-off, which means that you’ll deal less damage at farther ranges if you have a bad range stat. Range is always beneficial, no matter what activity you’re doing. When in doubt about what stat you want to boost, pick range. Stability goes hand-in-hand with one of the secret stats, recoil direction. Recoil direction determines how a gun kicks when fired, what angles it bounces toward and how close it is to straight vertical — the most desirable kind of recoil. Stability dictates how intense that kick is from the gun’s recoil direction. PC vs. console on stability is where things get a little weird. Recoil isn’t really a thing on PC. This means all stat bonuses or mods that affect stability are basically dead on PC and should be ignored. Weapons with high recoil on console — like submachine guns and pulse rifles — are much better on PC because of this. Handling is a really great, often undervalued stat in Destiny 2 — specifically in PvP. Handling affects how quickly you switch to and ready your guns. That isn’t really a big deal in PvE activities — you’re usually not that pressed for time in each engagement — but it can mean life or death in PvP. Reload speed, magazine size and rate of fire are all self-explanatory. Before we go onto the hidden stats, let’s take a second to address swords, since they have some weird stats. Efficiency is the amount of ammo that drains while you block and when you get shot while blocking. Defense is purely about how much damage slips through to you while you’re blocking. Aim assistance is the first hidden stat, and it works in some weird ways. On console, this is the magnetism of your gun toward another player when you aim. But on both console and PC, there is also a kind of bullet magnetism that goes along with it. With a high aim assist stat, you may actually see an increase to the enemy hitbox — meaning their body is a bigger target than it appears to be. Suddenly, bullets that would whiz by normally will be magnetized to the target instead. Weapon size is a little misleading. While it sounds like the amount of screen space your weapon takes up, it’s actually how big the inventory is for the weapon — meaning how much ammo you can hold in reserves. Zoom is how far it magnifies your vision when you aim down sights. Like anything in a game like Destiny 2, there are some amazing perks, some situational or fine perks, and others that are arguably complete garbage. Let’s go over some of the most common god roll perks and others that you should avoid entirely.When we spoke to Fallout Plays, he reminded us that there aren’t necessarily any bad perks, just those that are a bit too niche to be useful frequently. Chances are, you’ll probably find some use for every perk in Destiny 2. Below, you’ll see us talk about three perks pretty frequently: Outlaw, Kill Clip and Rampage. These are three of the best perks in Destiny 2: Forsaken, and they’re almost always great on any gun. Outlaw increases your reload speed — useful on most guns — while Kill Clip and Rampage both augment your damage in interesting ways. Perks like Rangefinder are also great to have on almost any gun. While the perk isn’t very sexy — it simply increases your range stat while aiming down sights — it’ll almost always benefit you, since range is the best stat in the game. Perks like Explosive Payload and Dragonfly won’t be frequent perks in our recommended section, but both of them are great bonuses on top of already functional weapons in PvE. Genesis is a great PvE perk that instantly reloads your weapons when you pop a shield. However, it should probably only be taken on energy weapons, as the second part of the perk instantly regenerates ammo when you match the shield type.As far as bad perks, there are quit a few. Field Prep and Firmly Planted both require you to be crouched — an annoying side effect that will only occasionally benefit you. Headseeker is also not a great perk from a sheer numbers perspective and barely increases the damage done.   However, there are some perks that are great on some types of guns and not on others. For example, shotguns gain a rate of fire increase from the Full Auto Trigger System perk, while other guns are just a bit easier to fire. Shotguns gain value, while it’s pretty wasteful on other weapons.  The toughest thing about understanding random rolls in Destiny 2: Forsaken is looking into the purely stat-focused perks like barrel and magazine. It’s easy to look at a gun that has Outlaw and Rampage on it and get excited — but a god roll isn’t a true god roll until you have all of the perks you want. Fallout Plays was passionate about this when we spoke. “They’re usually not make or break type situations,” he said. “They can take a great roll and make them that much better if you have the right barrel/mag perks.”These perks look scary, because they are supposedly changing something fundamental about your gun, altering stats that you may not totally understand. But each weapon has a preferred stat — which we’ll go through below — and increasing it should always be your focus with these kinds of perks. For example, Ricochet Rounds are almost always the best magazine perk to use, since it increases range. Figure out the best stat and try to maximize it by hovering over the perk. The only exception here is if you’re only gaining a minor boost to your main stat while losing a big chunk to your secondary. For example, if you’re selecting the perks on a hand cannon, it’s not worth a slight increase in range if you really hurt your reload speed.   We spoke with Fallout Plays and talked about what stats and perks are best on each weapon type. Here’s what we came up with. Stats: rangeWith scout rifles, you want to increase your damage a couple of different ways. You’ll see us suggest this a lot, but the god roll for a scout here is Outlaw (increases reload speed after a headshot kill) and Kill Clip (bonus damage for a brief time after getting a kill and reloading) in most scenarios. In PvE, you can get away with Dragonfly (headshot kills explode with the elemental type of the gun being used) as well, which is a really fun perk. Stats: range, stability for controllerPulse rifles have big clips, and therefore can benefit from Rampage (increased damage — stacks up to three times — for a brief period of time after getting a kill) and Kill Clip (bonus damage for a brief time after getting a kill and reloading) pretty easily. Pair one of those with Outlaw (increases reload speed after a headshot kill) and you have a really great pulse rifle. In Year 2, you should be striving to get as close as you can to Inaugural Address (Kill Clip, Outlaw), the raid pulse rifle from Year 1. Stats: range, stability for controllerOutlaw (increases reload speed after a headshot kill) and Kill Clip (bonus damage for a brief time after getting a kill and reloading) are both awesome for auto rifles, as many of them have slow reload speeds, and getting a kill with that big of a clip is easy enough. But even above Kill Clip, Rampage (increased damage — stacks up to three times — for a brief period of time after getting a kill) is fantastic for auto rifles, as chewing through multiple enemies without reloading should be your main goal. High-Impact Reserves can also be pretty good in some non-PvP scenarios. Stats: range, stability for controller is equal to range The same perks that work on auto rifles work for submachine guns, although we’d trade out  Rampage (increased damage — stacks up to three times — for a brief period of time after getting a kill) for Kill Clip (bonus damage for a brief time after getting a kill and reloading) thanks to the smaller clip. If you wanted to replace Outlaw, you could go with something like Zen Moment (damaging enemies increases the gun’s stability) on console, Genesis (refills the magazine when breaking an enemy shield, instantly refills the magazine for every shot fired into a matching elemental shield) if you’re a PvE player and Moving Target (move faster and acquire targets easier while aiming down sights) if you’re a PvP player.Stats: range, reload speedHand cannons need reload speed desperately, so we would suggest Outlaw (increases reload speed after a headshot kill) in almost every case here — although Drop Mag (increases reload speed, but removes all ammo left in the magazine from your inventory) can replace it pretty well. Kill Clip (bonus damage for a brief time after getting a kill and reloading) pairs pretty well here, as does Rampage (increased damage — stacks up to three times — for a brief period of time after getting a kill) if the impact is high enough to get one shot kills. Stats: range, handlingRangefinder (aiming down sights increases range) is a great perk for sidearms, since range can really kill them in most situations. Moving Target (move faster and acquire targets easier while aiming down sights) and Kill Clip (bonus damage for a brief time after getting a kill and reloading) are great for the secondary slot, with one providing an increase in damage and the other making you and the gun faster.Stats: Accuracy, draw timeArcher’s Tempo will help get your draw time down as long as you’re hitting headshots, which you probably should be. Rampage (increased damage — stacks up to three times — for a brief period of time after getting a kill) can then pair with that to help you get more and more kills as you speed up your draw time.Stats: Range, stability for controller Rangefinder is a great perk for fusions. Since you’re probably trying to use one of these to combat players in medium range, Rangefinder will help you increase your natural advantage over shotguns. Backup Plan (reduced charge time and handling when switching to this weapon from your primary or heavy) is a perfect pairing for fusions as well in PvP, while Rampage (increased damage — stacks up to three times — for a brief period of time after getting a kill) is nice to have in PvE. Stats: Impact, narrow spread, rangeShotguns can have lots of great perks attached to them. For PvE, you probably want Rampage (increased damage — stacks up to three times — for a brief period of time after getting a kill) and something like Full Auto (holding down the trigger will continue to fire the weapon, increases fire speed for shotguns), or Moving Target (move faster and acquire targets easier while aiming down sights). But in PvP, you can go with perks like Quickdraw (lets you draw the weapon much faster than usual) and Slideshot (sliding reloads part of the magazine and increases range and stability) as well. Stats: Range, handling, low magnificationThis is the only time we’re going to recommend a scope. In most situations, you want pretty low magnification, otherwise you risk losing your enemy in the distance. For perks, Snapshot Sights (aiming down sight is very fast) are always great, as is Outlaw (increases reload speed after a headshot kill) and even Kill Clip (bonus damage for a brief time after getting a kill and reloading). Single fire stats: blast radius, reload speedBarrel stats: blast radius, velocityGrenade launchers can be unwieldy, so grabbing Quickdraw (lets you draw the weapon much faster than usual) can be helpful. Outside of that, you’re looking at Rampage (increased damage — stacks up to three times — for a brief period of time after getting a kill) in PvE and Proximity Grenades (grenades have increases detonation range from proximity) in almost all situations. Anything you can do to increase your blast radius is great, too. Stats: Impact PvE, range PvPThanks to the current meta, neither we or Fallout have much to say about swords. Relentless Strikes (refunds ammo after three quick hits) and Whirlwind Blade (increases damage after a few quick hits) — the It Stared Back roll — is very good for swords. Look for perks like those, and you should do fine. Stats: blast radius, velocity, reloadWith rockets, you want to increase your blast radius as much as possible. Cluster Bombs (additional explosives are released with the rocket and explode) are perfect for increasing your kill likelihood or your damage. If you’re in PvE, Tracking Module (rockets lock onto targets and fly toward them) is fantastic for consistency. Quickdraw (lets you draw the weapon much faster than usual) is useful in PvP. Stats: range, charge timeLinear fusion rifles can be a little weird, but you’re probably looking for the same type of perks that you’d want on a sniper rifle. Quickdraw (lets you draw the weapon much faster than usual) is useful, as is Snapshot Sights (aiming down sight is very fast).This may seem like a lot — and it is — but we’ve barely scratched the surface of weapon customization in Destiny 2. If you’re interested in learning more about this, we recommend checking out the guy who helped teach us quite a bit when writing this guide — Fallout Plays. Check out his channel for all kinds of tips on god roll weapons, or if you just want to learn how shotguns work. "}