{"id": "These scary games are super cheap in time for Halloween", "paragraph": "Scary games are fun to play throughout the year, but they are especially effective on the holiday that celebrates all things spooky: Halloween. As the day of trick-or-treating have arrived, several retailers have discounted what we think are the very best games to play on and around Halloween.Not a huge surprise: most of these are first-person experiences, which really amp up the dread by limiting your perspective. You literally have to face your fear.This cerebral shooter packs in plenty of scares, both in terms of jump frights and its generally spooky ambiance. Once you become steeped in the nightmare that is life on the Talos 1 space station, its addictive leveling system will keep you hooked until the wild ending.The latest entry in the Resident Evil franchise is both a return to form and the charting of brand-new territory. Despite its name, this game’s setting and premise feel anything but iterative, pitting the player against some truly disturbed beings.From the creators of Layers of Fear (another quality spook-fest to check out), Observer puts you in the year 2084 as a detective tasked with hacking the minds of criminals and their victims. One look at the game’s art direction will tell you that you’re going to have to endure a bit of dread to see it through to the end.There are few first-person shooters more influential than BioShock, and this collection includes all three titles for $15 for a limited time. In addition to their otherworldly settings, each boasts a fun blend of gunplay and strange superpowers that make these a bit more of an action romp than the others listed here.Imagine being alone on a derelict space station. Scary, right? Now imagine that the only other being you share it with is a Xenomorph. For those uninitiated to horror games, Alien: Isolation is torturous. You rarely have a leg up on the beast chasing after you, so every encounter is radically tense. This game has aged remarkably well since it launched in late 2014, which is to say that it’s still really frightening.Supermassive Games’ choose-your-own-adventure story puts you in control of a group of teens on a remote mountain who are trying to outsmart a mysterious killer. Each decision has a butterfly effect on the final outcome, and it’s likely that you’ll probably lose at least half of the characters — though it’s actually possible to get everyone out alive. At $5.99, you absolutely owe it to yourself to play this wickedly inventive and well-executed horror game."}