{"id": "Marvel Comics legend Stan Lee dies at 95", "paragraph": "Stan Lee, who wrote and published a comic book legacy that spans from the Depression Era to the present day, who created Spider-Man, Iron Man, the Incredible Hulk and Thor, died Monday at the age of 95. Under his longtime leadership, the publisher known today as Marvel Comics now oversees a portfolio of heroes and villains beloved by millions of fans and reaping billions more at the box office. News of Lee’s death was first reported by TMZ. Joan Celia Lee, Stan’s daughter, confirmed the news to TMZ. The Hollywood Reporter is also confirming the news.\n    Related\n  Lee’s wife, Joan Lee, died in July 2017, following complications resulting from a stroke. The two married in 1947, and their daughter Joan Celia Lee was born in 1950. His later days, since Joan’s death, have been characterized by a snarl of elder abuse accusations between his daughter and several family friends, culminating in a restraining order and criminal charges being levied against his former manager, Keya Morgan. Lee was born Stanley Martin Lieber in New York City in 1922, the son of Romanian Jewish immigrants, and at the age of 17, he began work as an assistant at Timely Comics, the company that would become Marvel Comics. Filling inkwells and fetching lunch, Lee’s career began just in time for Superman’s 1938 debut in Action Comics #1, kicking off the history of superhero comics. His first published story was entitled “Captain America Foils the Traitor's Reve” — published under the nom de plume “Stan Lee,” which he would later make his legal name — and it was the first story in which the hero ever threw his shield as a ricocheting weapon. When Captain America creators Joe Simon and Jack Kirby left Timely after disagreements with the company, decimating the business’ editorial staff, Timely publisher Martin Goodman appointed Lee, then just 19 years old, as interim editor. From the temporary post, Lee would rise to editor-in-chief and remain there for more than 30 years, until he rose even further to the non-editorial post of publisher of Marvel Comics. The only interruption of his tenure was the wartime years of 1942 to 1945, when Lee served in the United States Army in various roles during World War II, including writing manuals and training films. Under his editorial guidance and prolific pen, Timely completed its metamorphosis into Marvel Comics, fundamentally changing what audiences expected from superheroes and the folks who created them. Beginning with The Fantastic Four #1 in 1961, Lee spearheaded Marvel’s rocketlike rise to success and popularity — cementing the company in a never-ending battle with its chief competitor, DC Comics. After stepping back from writing monthly comics in 1972, Lee went west in the early ’80s to focus on Marvel films and television projects, eventually leaving Marvel Comics altogether. His later career was characterized by a wide variety of projects and newly founded companies producing wild — if perhaps not as titanically successful — creative endeavors. Collaborative methods of comics writing were already widely used when the Marvel revolution began. The writer would provide a brief plot synopsis, the artist would plot and draw up the story, and then the writer would return to the finished pencil art to write dialogue and captions. Both creatives held significant influence on plot and character design. But Lee used this system so successfully to churn out stories that it has simply come to be known as the Marvel Method. Lee’s greatest editorial achievement, perhaps, might be defying the Comics Code Authority in order to publish an explicit anti-drug message in Amazing Spider-Man #96-98, a move that eventually created enough buzz to convince the CCA to liberalize its rules, weakening a set of strict, self-censoring content guidelines the industry had adopted more than 15 years before. But the revolution that Lee is most credited for is introducing flawed characters to the genre of superheroes — and making them incredibly popular. The tale goes that when given the assignment of creating a superhero team to rival the recently recreated Justice League, he was encouraged by his wife, Joan, to write whatever sort of story he wanted to, rather than what he thought his editor might be interested in. At the time, Lee had been planning a change in careers, and if the book had flopped there wasn’t much to lose. That book, co-created with Jack Kirby using the Marvel Method, was The Fantastic Four #1. It was the introduction of a team now known as Marvel’s First Family, not least because it set the foundation for the rest of the Marvel Comics universe. Collaborating with artists through the Marvel Method, Lee shares co-creator credit on virtually every pillar of Marvel’s universe. With Gene Colan, he created the Falcon, the first African-American superhero. With Bill Everett, he introduced Daredevil. With Steve Ditko, he developed Doctor Strange and Marvel’s challenger in sales to DC’s Superman: Spider-Man. And with Jack Kirby — one of the few comics creators who has cast as large a shadow on the industry as Lee — he created and popularized not only the Fantastic Four, but also the Hulk, Thor, Iron Man, Black Panther, the Avengers, the X-Men and the Inhumans. Lee also revived older Golden Age characters like Captain America and Namor the Sub-Mariner, after they had spent decades out of the publishing eye. And while he crafted complex, flawed and conflicted heroes — characters who might fall out and reunite with their closest allies as often as they battled evil — he also championed an editorial style that made creators more visible to the reader. Granted, Marvel Comics was no exception to the American comics industry’s historical failings in the realm of respecting creators’ rights and compensation. Lee’s ceaseless hucksterism sometimes left frustrated collaborators in its wake, most notably Jack Kirby himself. But “Smiling Stan” Lee’s eccentric editorial voice created a familiar and relatable notion of Marvel creators in the minds of fans, appealing to a younger, more politically active generation of readers at a tumultuous time in American history. Monthly issues featured Lee’s creator profiles of the members of the “Marvel Bullpen” and his cheerful editorials in “Stan’s Soapbox.” A “No-Prize” was offered to any reader who wrote in with a solution to a plot hole. And fans of Marvel Comics even had their own name to distinguish themselves from the rubes reading the “Distinguished Competition” (or “Brand Echh”). They were “True Believers.” Lee’s impish editorial self followed through to his public persona (at the age of 61, he posed in his underwear with a giant-sized issue of The Incredible Hulk covering his pelvis to create the illusion of a naked centerfold spread for a Marvel magazine). If modern fans don’t know Stan Lee from his comics, they’ll know him from his comedic cameos in nearly every Marvel Comics-inspired movie under the sun — and as a tireless advocate for the wonder of storytelling in all forms. In one of his final interviews, Lee told the Daily Beast that he hopes “I leave everyone happy when I leave.”“You won’t leave anyone happy,” his daughter interjected.“Well, I don’t mean happy that I left,” Lee explained, “Happy that I took the right path.”Comics writer Gail Simone has described the first time she met Stan Lee numerous times: a chance encounter at a con when he was unexpectedly brought on to a panel alongside her. “Keep in mind, Stan was being STAN LEE during the panel, the whole EXCELSIOR! thing, you know. Great fun to watch, but it’s definitely part of his mystique,” she wrote on her Tumblr. “So he came up to me, and was smiling, being STAN LEE, and asked, ‘So, what do you do?’”I blushed and stammered a bit and said, “Oh, I’m just a writer.”  For the life of me, I couldn’t even remember to tell him I had written for Marvel for a bit.And this odd thing happened. The STAN LEE character dropped away and he looked me dead in the eyes, VERY SERIOUSLY, and said, “Don’t EVER say you’re ‘just’ a writer.”... after a minute, it hit me, he wasn’t scolding me, he was giving me quite possibly the best advice I had ever gotten, in the simplest, most direct way. He was saying, don’t minimize what you do, don’t apologize for choosing this career. I believe he was saying stand up straight and say it with pride ... That changed everything for me. Until that point, I had really struggled with telling people what I did for a living. I would say, “Oh, it’s just comics,” or would avoid the subject entirely. Brian Bendis and Jeff Loeb and others had sat me down and tried to tell me that it was not endearing, it was a bit insulting to the readers, but I didn’t get it. I didn’t understand that it was borderline rude, until Stan Lee told me in one sentence with the full weight of his personality and absolutely zero nonsense.It’s no surprise that Lee crafted so many characters that have endured into a time where they’ve overwhelmed an institution as dominant as the modern Hollywood blockbuster. Publicly, Lee was as much a character as any of his fiction, delivering iconic catchphrases like “’Nuff said!” and, of course, “Excelsior!” Excelsior is the state motto of his native New York — Latin for “ever upward” or “still higher.” And it was Lee’s habitual sign off and rallying cry, a fitting exclamation for a man who revolutionized a genre obsessed with the power of flight. Lee will be both missed and honored by the legions of people whose lives were lifted still higher by the stories he spun, and the legends he left behind. "}