{"id": "The best comedies of 2018, so far", "paragraph": "Laughter: not actually the best medicine for serious ailments, but still pretty great! (We suggest a doctor for those serious ailments.)Somehow forecasting just how gloomy and caustic 2018 would turn out to be, the movie industry stepped up its game over the last 10 months and delivered genuinely funny comedies —versus, say, American Pie 8: Butts in Cake or whatever — that kept slapstick and satire and joyous stupidity soldiering on. These movies won’t probably win Oscars, but they will win you over when you watch them over and over on HBO. Simply put: they’re funny.Our rolling list of the best comedies of the year ranges from laugh-out-loud to devilishly sharp to cheeky in that British way. And before you laugh us off: yes, we’ll update again before the end of the year with a few more picks, just in case any more films squeeze a chortle out of us before year’s end. If you’re looking for more recommendations, check out our more general list of the best movies of 2018.Polygon Essentials is a collection of persistently updated lists of the best of the best games for each platform — from the hardware’s launch to its end of production — as well as the best entertainment across virtually every medium. For folks new to a platform, think of this as a starter kit. For long-term fans, consider it a list of what to play or watch next. We’ll be updating these lists often, with entries listed in reverse chronological order. To see a collection of other titles we recommend that might not have made the Essentials lists, check out Polygon Recommends.Vox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. For more information, see our ethics policy.Very few films give you a two-for-one deal, but Blockers does it with aplomb. Half the tale focuses on three young women who make a pact to lose their virginity on prom night, the other half on the attempts of their parents to stop them from making good on that promise. The film is startlingly sensitive and level-headed when it comes to how it deals with its subject matter — and it’s also wickedly funny.Female sexuality has long been so codified that it’s refreshing to see the characters in Blockers either begin at, or come around to, a place of respect when it comes to women’s rights to make decisions about their own bodies. That’s not to say the film sacrifices laughs for the sake of commentary; the cast, which includes Leslie Mann, John Cena and Ike Barinholtz as the hapless parents, is uniformly great, with the expected body-related humor cranking all the way up to 10.—Karen HanRent it on Amazon | iTunes | Vudu | Google Play | YouTubeThere was a post-Judd Apatow era (that we still may be in?) in which every comedy cranked out by the studios felt like an improv-a-thon conducted in point-and-shoot style, as if they were TV shows fitted for the big screen. The joy of Game Night — besides stars Jason Bateman and Rachel McAdams in prime fish-out-of-water mode — is a return to the ’70s and ’80s logic that a comedy should look and feel like a drama, but with jokes. Writer-directors John Francis Daley and Jonathan Goldstein (Vacation) use shadowy interiors, classic camera moves and a thriller toolkit to treat this wacky comedy about a role-playing murder mystery party gone off the rails with the vibe of After Hours. The key is that Game Night still has the sensibility of a 7-year-old with a bucket of magic markers. Bateman, McAdams and the rest of the cast are in full Clue mode as they scramble in the suburbs trying to figure out why Bateman’s brother was just beaten to a pulp and dragged out of his McMansion. Jesse Plemons co-stars as a cop with a ridiculous desire to make friends. He has a snow-white puppy whose fur does not react well to bloodstains. Game Night is pure chaos — the snazzy kind.—Matt PatchesStream it on HBORent it on Amazon | iTunes | Vudu | Google Play | YouTubeIn his debut film, Boots Riley has crafted a vision of contemporary America that will absolutely knock your block off. Sorry to Bother You is incredibly dense — there are a million things happening in each scene — yet clear in vision. The less you know about it going in, the better.For now, let this suffice: Lakeith Stanfield stars as Cassius “Cash” Green, whose job at a telemarketing company takes a turn when a co-worker recommends that he use a “white voice” on his calls. However, as he starts to do so — and sees the according uptick in sales — the company is rocked by a strike by workers demanding fair pay, which means that, as things progress, Cash is forced to take stock of where he stands and pick a side.—Karen HanRent it on Amazon | iTunes | Vudu | Google Play | YouTubeThe Marvel movies that have been the most cursorily related to the broader cinematic universe are almost uniformly the best, and Ant-Man and the Wasp is no exception to the rule. It’s an easy-breezy ride through the quantum realm, and surprisingly morally nuanced. When it seems that Janet van Dyne (Michelle Pfeiffer), who disappeared into the quantum realm, might actually still be alive, Ant-Man (Paul Rudd) and the Wasp (Evangeline Lilly) team up to try to get her back — and contend with the mysterious Ghost (Hannah John-Kamen) along the way. The cast (including Michael Peña, who almost ran away with the first film) is so charming that the usual superhero antics feel fresh — not that Ant-Man wasn’t novel to begin with. He shrinks! He grows! It’s a weird superpower to have (or have via supersuit), and the film knows exactly how to have fun with it.—Karen HanRent it on Amazon | iTunes | Vudu | Google Play | YouTubeNetflix has been upping its game when it comes to original films, throwing its weight behind potential Oscar contenders like Alfonso Cuarón’s Roma. But it has also invested in crowd-pleasers like To All the Boys I’ve Loved Before, Ibiza and Set It Up, hoping to become synonymous with a renaissance in comedy. Among the best of this year’s offerings is Like Father, a startlingly poignant comedy starring Kristen Bell and Kelsey Grammer, and written and directed by Lauren Miller Rogen. After being left at the altar, Rachel (Bell) finds herself on a cruise — which she had originally booked for her honeymoon — with her long-estranged father (Grammer). The film is just as likely to make you laugh as it is to make you cry, and provides the opportunity for both in spades.—Karen HanStream it on NetflixIf you’ve been wondering what happened to the high-society comedy, look no further than Crazy Rich Asians, which revives the genre with a splash. Rachel Chu (Constance Wu), an economics professor at NYU, is thrust into a world that’s almost completely foreign to her when she agrees to meet her boyfriend Nick’s (Henry Golding) family in Singapore. They’re not just any old potential in-laws — they’re crazy, they’re rich and they don’t take kindly to Rachel’s arrival on the scene. As she’s put through the wringer, navigating both Nick’s family and the Singaporean elite, the film shines, literally and figuratively.—Karen HanAvailable to rent starting Nov. 20Armando Iannucci has long been known for his acerbic wit — any Veep fans that haven’t seen The Thick of It are missing out — and it’s in full force in the startlingly dark The Death of Stalin. The film, which is a take on the events following, yes, the death of Joseph Stalin, has its share of laughs, but it’s a little grimmer than, say, In the Loop. The jockeying of Stalin’s Central Committee — featuring Steve Buscemi as Nikita Khrushchev and Simon Russell Beale as Lavrentiy Beria — is outrageous, and Iannucci digs his heels in not only with regard to the lengths these figures went to in order to stay in power, but with regard to the death toll that resulted. Bodies fall left and right, and after a while, whatever comedy there was in the preceding wheeling and dealing becomes pitch-black.—Karen HanRent it on Amazon | iTunes | Vudu | Google Play | YouTubeThere’s reason to be skeptical of a movie that stars Boston Celtics point guard Kyrie Irving as an old man and is based on a series of Pepsi Max ads. But Uncle Drew, which uses the Blues Brothers blueprint to get Irving’s Drew back together with his old team (Shaq, Chris Webber, Reggie Miller and Nate Robinson, also in old-age makeup), is proof that there’s still room in this cynical world for a quality-yet-artless crowd-pleaser built off the charisma of high-profile athletes. Why are basketball stars so capable of carrying their own comedies à la Space Jam? Just look at the Harlem Globetrotters, and understand why court skills and hijinks go hand in hand. Add in Lil Rel Howery, the breakout from Get Out, and you have a comedy that hits nothing but net.—Matt PatchesRent it on Amazon | iTunes | Vudu | Google Play | YouTubeTen years after the film adaptation of the ABBA musical Mamma Mia hit theaters, we’ve been gifted with the follow-up, Mamma Mia! Here We Go Again. Like the original film, Here We Go Again is an unmitigated delight — and a little more unhinged, as it throws all laws of time and logic to the wind in favor of beach scenes and ABBA covers. Though the film is ostensibly about Sophie’s (Amanda Seyfried) attempt to open a bed-and-breakfast in memory of her mother (Meryl Streep, and Lily James in flashbacks), the plot doesn’t really matter. Here We Go Again is the filmic equivalent of canceling all your plans and taking some “you” time — plus, Cher arrives at a party on a helicopter and immediately starts singing “Fernando.” What more do you want?—Karen HanRent it on Amazon | iTunes | Vudu | Google Play | YouTubeWith works like Wallace & Gromit and Chicken Run, the stop-motion titans at Aardman Animations have proved themselves masters of balancing humor and empathy. Their latest film, Early Man, fits right in. There’s a glee present throughout Nick Park’s tale of a group of cavemen fighting to win back their land from a collection of Bronze Age foes (including Tom Hiddleston as the pompous Lord Nooth). Then again, perhaps “fight” isn’t the right word — their chosen method of settling who gets the valley is a soccer match. Early Man is a riot, and in case you need more fancy duck content, it features a duck in one of the funniest sight gags ever committed to film.—Karen HanStream it on HBORent it on Amazon | iTunes | Vudu | Google Play | YouTubeThere’s a lot of nonsense in The Spy Who Dumped Me, but there’s also a genuine core to the film when it comes to portraying relationships between women in a thoughtful and honest way. The spy in question is Audrey’s (Mila Kunis) boyfriend, whose top secret she takes on with her best friend Morgan (Kate McKinnon) after he’s killed in action. Directed and co-written by Susanna Fogel, The Spy Who Dumped Me is full of beats — in between all the requisite spy thriller action — that should feel familiar to anyone watching, including a scene in which Morgan forces Audrey to appreciate her accomplishments thus far. Similarly, the film itself seems to ask the audience — its female audience, in particular — to stop apologizing and embrace being themselves.—Karen HanRent it on Amazon | iTunes | Vudu | Google Play | YouTubeThough Paddington 2 was released in 2017 in the U.K., it hit U.S. cinemas in 2018, qualifying it for this list and our love. As improbable as it might seem that a movie ostensibly targeted at kids — and a sequel, no less — would make any year-end list, Paddington 2 is a must-see. Its message of kindness and empathy feels particularly essential this year, and in the hands of director Paul King (The Mighty Boosh), the film never panders to its audience. The cutest, most colorful sequences are earned.When Paddington Bear (sweetly voiced by Ben Whishaw) winds up in jail for a crime he didn’t commit, his cellmates and his adoptive family come together in order to get him out and prove his innocence. Though the performances — including Brendan Gleeson as the gruff Knuckles McGinty — are uniformly great, Hugh Grant is the standout member of the cast. His turn as aging actor Phoenix Buchanan earned him a BAFTA nomination, and in a just world, would get him an Oscar nomination, too. —Karen HanStream it on HBORent it on Amazon | iTunes | Vudu | Google Play | YouTube"}