{"id": "ESPN Plus streaming service now available via PS4, Xbox One", "paragraph": "ESPN Plus, the subscription-based streaming service from the sports programming giant, is now available to PlayStation 4 and Xbox One owners, ESPN announced Tuesday.ESPN launched ESPN Plus in April, and since then, the company has integrated the service into the existing ESPN app on platforms such as Amazon Fire, Android, Chromecast, iOS and Roku. However, although ESPN has been available on gaming consoles for years — via the ESPN app on Xbox One and the WatchESPN app on PS4 — ESPN Plus has not been accessible through those apps until now.Both the PS4 and Xbox One apps received updates on Tuesday with a revised interface that now includes ESPN Plus. In addition, the PS4 app is no longer called WatchESPN; it’s now named simply ESPN, bringing it in line with the app’s branding on other platforms. You can see a screenshot of what the console app looks like below.ESPN Plus costs $4.99 per month or $49.99 a year, and it’s a stand-alone subscription; it isn’t included for customers who already pay for ESPN through a pay-TV provider. In other words, ESPN Plus should not be confused with something like HBO Now, which offers the same content in a streaming service that is available to people who subscribe to HBO through, say, a cable TV package. Nothing that airs live on one of ESPN’s eight cable networks, such as SportsCenter or Monday Night Football, is available in ESPN Plus.With ESPN Plus, Disney is attempting to attract particularly passionate sports fans (and fans of sports that are more niche). The service does offer broadcasts of “hundreds” of live MLB, NHL and MLS games, but all of them are still subject to blackout restrictions, so you can’t watch games for your favorite team if you happen to live in its media market. College sports are available, including football, but only from schools outside the Power Five conferences. There’s some interest for followers of international soccer, though, with games from leagues and competitions such as Serie A and the FA Cup. Plus, there are live broadcasts of sports such as boxing, tennis, rugby, cricket and — starting in 2019 — UFC.The bigger draw might be ESPN Plus’ library of original content and its back catalog. Subscribers get on-demand access to everything from ESPN Films, including the acclaimed 30 for 30 documentary series. And ESPN is producing original programming exclusively for the streaming service, such as Detail from Kobe Bryant and Peyton Manning. ESPN announced in September, five months after ESPN Plus’ debut, that the service had pulled in more than 1 million subscribers."}