{"id": "Reforged is Warcraft 3 at its best, even though so much has been changed", "paragraph": "Warcraft 3: Reforged isn’t a perfect recreating of the original game; it’s better. Reforged is Blizzard’s attempt to go through a game that’s fondly remembered by so many, and modernize it with gameplay advances as well as better graphics. At BlizzCon 2018, we sat down with the demo and played through the game’s most famous mission: The Culling. The Culling is the sixth chapter of Warcraft 3, and showcases Prince Arthas’ turn to the dark side. Players control the young Paladin as well as a small company of soldiers and are tasked with killing 100 infected, innocent civilians before the dreadlord Mal’Ganis does. It’s a race against the computer that most players remember. But Reforged changes the map, turning it into the Stratholme that players are familiar with now — thanks to the dungeon designed from this mission in World of Warcraft. The original map had players swing in from the upper right and invade a city filled with rivers and disjointed districts. But Reforged has players enter from the bottom of the map and move through open areas. It’s a more comfortable feeling map, and one that players who haven’t played the game this decade likely won’t notice.But like with Stratholme, Reforged feels like the Warcraft 3 you remember, not the one sitting in the forgotten memory banks of your old computer. The game runs well, even in its pre-development state and it simply looks gorgeous. The hotkeying is snappy and lets you jump between groups and buildings with ease. It’s fast, while still feeling authentic and without looking muddy. It mixes the chunkiness of a game that’s 15 years old with modern beauty. The soldiers look gorgeous, but they still sound just as dopey as they did in 2003. Each swing of the unit’s swords against the old Stratholme buildings is a reminder of the charm that Warcraft has always had. But the higher fidelity in the cutscenes and the game itself manage to bring more powerful emotions. While the old voice acting remains intact, the faces of Uther, Jaina and Arthas are all able to project so much more emotion. Even better, looking at a clear image of the crimes Arthas commits in the mission does a lot to help you feel the horror that Blizzard intended years ago. Warcraft 3: Reforged is ultimately that realization of what was impossible 16 years ago, combined with the current knowledge and love of the Warcraft universe. When Warcraft 3 came out, we had never toppled Arthas atop Icecrown Citadel — World of Warcraft wasn’t even out yet, let alone the Wrath of the Lich King expansion. But going back, we know how these stories play out, and seeing it in HD from the perspective of an origin to something that’s already beloved is a really special feeling.Reforged is going to be the best way to play Warcraft 3 once it’s in the wild, not only because it’ll actually run well on modern computers, but because it’s been improved from what the game was. Warcraft 3 is one of the best and most important games of this century, but that doesn’t mean that it’s aged like wine. Old games can be great, and sometimes it’s worth restoring them, warts and all, like with World of Warcraft: Classic. But even in the small amount we’ve played of Warcraft 3: Reforged, it looks like Blizzard is making the old feel new again. "}