{"id": "5 things to know about Black Ops 4’s Oct. 30 multiplayer patch", "paragraph": "Call of Duty: Black Ops 4 has been out for a few weeks now, and Treyarch has just released the game’s biggest patch yet. While the company has been consistently updating the game and fixing minor issues, this patch, out today, Oct. 30, aims to fix some of the larger balancing issues in the game, such as weapons that are too strong or operators that are getting played a little too often. Most importantly, this patch looks to fix some of the spawn issues that players have been running into since the game’s launch. This patch also addresses the game’s Blackout and Zombies modes, but the main focus of the changes is on the multiplayer-side of things. It’s also worth noting that this patch only applies to the console versions of the game for now. A specific PC patch will be released shortly after with specific changes for that platform.For a full look at all the changes coming to Black Ops 4, you can check out Treyarch’s official patch notes.One of the most popular modes in the Black Ops series — and online shooters in general — Gun Game has made it’s way to Black Ops 4. The mode gives every player a specific set of weapons, and every time you get a kill, your weapon changes. In most modes, the player to work through all the weapons first wins. But in the upcoming Chaos Domination version of the mode, players will still be tasked with earning 150 points by capturing zones, all while their weapons swap. This should make for not only an unpredictable mode, but also a great addition to Black Ops 4’s set of multiplayer modes, at least until it goes away on Nov. 6.One of the most frequent complaints about Black Ops 4’s multiplayer online is about the spawn system. Players are tired of situations where they spawn in directly in front of enemies, or even occasionally in the same spot as an enemy. Thankfully, Treyarch has heard fans’ frustrations and is working on a solution. With this patch, the developers are taking a look at spawns across all maps and specifically changes the way players spawn on Slums, Summit, Firing Range, Frequency, Arsenal and Icebreaker — some of the biggest offenders. While this should help things out, Treyarch is careful to mention that this is an ongoing solution and that this isn’t the only fix we’ll see in the near future.Just about every gun in every category is getting a change or two in this patch, but let’s try to sum things up. Assault Rifles, overall, are getting a little less powerful when used for running and gunning, a role that Treyarch wants SMGs to be the clear favorite for. Speaking of which, SMGs are getting some tweaks to make sure that no one gun in the category presents itself as the obvious favorite over the others. Sniper Rifles got some damage buffs to help them better compete with the Paladin, the weapon class’ best gun. Tactical Rifles got buffs to help make them usable, while LMGs got a couple of nerfs because they were a little too usable. Finally, Shotguns were changed the least, but you should get one-shot killed by the MOG 12 slightly less often, as it had its range shortened. There are a lot of changes here, in fact, with seven operators in total getting tweaked. Ultimately, these are almost all nerfs. Rather than trying to buff every operator to help out some of the least-played characters, Treyarch has opted to simply nerf the top performers. That means things like Recon getting a Sensor Dart that doesn’t last as long and 10 percent less damage for Nomad’s dog.In a change that’s likely to affect almost everyone, Stim shot, the piece of gear that allows you to shoot from the hip while healing yourself, is going to take a little longer to actually do the healing. This will make players a little more exposed and help some of the other gear options become a little more viable. "}