{"id": "NASA may try to kill SLS around 2022 after another $16 billion is spent\nNextBigFuture.com\n", "paragraph": "Stephen Jurczyk, NASA’s associate administrator, told Business Insider at The Economist Space Summit that NASA will think about retiring Space Launch System (SLS) if SpaceX BFR or Blue Origin New Glenn are online.This will mean another $16 billion will spent until 2022. There has been about $30 billion spent on SLS and Orion up until the end of 2018. A test launch of obsolete hardware will be the purpose of the additional spending. The EM-1 mission will finally test the SLS and the Orion capsule together. It will also launch some cubesats. It will be the first test and it will cost at least another $12 billion to get to that test.The follow-up EM-2 mission would occur sometime in 2023 or 2024. The EM-2 mission will possibly have the first crewed mission of NASA’s Orion spacecraft. It will be a lunar free return mission.Previous Deputy NASA administrator have called for the cancellation of the SLS. In 2014, Lori Garver called for the cancellation of the SLS.The SpaceX crew Dragon should be certified to launch human crews in 2019. SpaceX should have regular launches of the Falcon Heavy starting in 2019. SpaceX will be launching the Falcon Heavy two to four times per year from 2020 onwards.In 2020 or 2021, a fully integrated version of BFR could be launched into orbit around Earth. Around 2021, Blue Origin is planning to use New Glenn plans to deliver a lander to the surface of the moon to scout for water ice.Space Launch System (SLS)has spent $14 billion from 2011 to 2018. It will spend another $6.8 billion from 2019 to 2021. There is about $2.3 billion per year being spent on SLS.$15 billion has been spent on the Orion crew spacecraft. There is $1.3 billion per year being spent on Orion. There was one pad abort test in 2010 and one orbital test on a Delta IV rocket in 2014. There will be one more unmanned test currently scheduled for December 2019.SLS and Orion might be launched in 2021 with the EM-1 mission.SLS EM-1 was scheduled for December 2017. Auditors do not believe the SLS Block 1 will not launch by June 2020. Even if teams could technically meet that deadline, NASA would need to put in another $1.2 billion. $800 million to secure first stage delivery by December 2019 and an another $400 million to make sure EM-1 launches by June 2020.This does not include $4.8 billion spent on Ares 1 – Constellation program.\nExclude costs to assemble, integrate, prepare and launch the SLS and its payloads such as Orion (funded under the NASA Ground Operations Project, currently about $400 million per year.\nExclude costs of the Upper Stage for the SLS, the EUS.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tSpaceX going all in to launch unmanned BFR to Mars by 2022 »\r\n\t\t\t\t\t\t\t\t\t\t« 10-qubit quantum integrated circuit prototype in silicon by 2022 "}