{"id": "Puranik CEO of Atlantic.Net validates space based cloud operations\nNextBigFuture.com\n", "paragraph": "Space could represent a new frontier for cloud infrastructure. Amazon, Microsoft, Google, IBM and Oracle battle for business from companies that are offloading their data center computing and storage needs.Marty Puranik, CEO and Founder of Atlantic.Net, a leading cloud hosting solutions provider interviewed with NextBigFuture.Marty indicated that Amazon’s venture to expand cloud operations into space is valid.Iridium Communications announced Sept 27, 2018, it joined the Amazon Web Services (AWS) Partner Network (APN) and has been collaborating with AWS on the development of Iridium CloudConnect, the first and only satellite cloud-based solution that offers truly global coverage for Internet of Things (IoT) applications. Enabled by the Iridium® network, and planned for launch in 2019, this new Iridium service will make Iridium IoT services available with AWS IoT, extending the reach of AWS’s powerful suite of services to the more than 80 percent of the Earth that lacks cellular coverage. Iridium customers will be able to take advantage of AWS IoT, while existing AWS customers will have a cost-effective way to expand their geographic IoT footprint to anywhere on the globe.A first for the satellite industry, AWS IoT will create a simplified process for companies to integrate Iridium’s satellite reach with AWS, increasing speed to market. Through this arrangement, customers will be able to reduce engineering efforts, lower fixed operating costs, and reduce time to develop new products and services, through the power and capabilities of AWS IoT.SpaceX is launching the $3 billion satellite network for Iridium, with the eighth and final launch happening later this year.Blue Origin is Jeff Bezos rocket company and it should be launching rockets into space in the next few years.Marty indicated that companies could want to have cloud operations and data that are free from jurisdictional regulations and concerns. This could be especially applicable for certain blockchain and cryptocurrency situations.There are also situations where companies want to leverage the global reach and communication from satellite-based data.Established in 1994, Atlantic.Net is a market-leading hosting provider, with state-of-the-art data centers in New York, London, Toronto, San Francisco, Dallas, Ashburn, and Orlando. \r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tTerrestrial Energy Molten Salt nuclear plant regulator review progress »\r\n\t\t\t\t\t\t\t\t\t\t« SpaceX reusable rockets are better than hypersonic missiles and planes "}