{"id": "Discussion of 80 Gigapascal super material potential for energy and space\nNextBigFuture.com\n", "paragraph": "Icarus Interstellar Spaceship designer Adam Crowl has provided more analysis of the potential of the 80 Gigapascal carbon nanotube bundle material.Nextbigfuture wrote this material which has been made in a chinese lab.  The material is 20 times stronger than Kevlar.The material would enable flywheel energy storage with jet engine or rocket like energy density.For carbon nanotube material, with a density of about 1,800 kg/m3, and an operating maximum stress of 54 GPa, that means a specific energy density of 7.5 MJ/kg. For comparison a kilogram of natural gas represents about 50 MJ of chemical energy, if fully burned. However that comparison neglects the efficiency that the chemical energy can be turned into useful work. Flywheels convert their stored energy into electricity at very high efficiency – 95% or so. Running a gas powered generator turns maybe 20% of the gas’s chemical energy into electrical energy. The rest is lost as heat, via both friction and the Carnot Limit. That’s still 10 MJ/kg, so why use a flywheel? The other assumption is that one can neglect the mass of the oxygen in the air that burns the fuel. If the application we’re using the flywheel for is in space, then the oxygen has to be added in.Every molecule of methane masses 16 atomic mass units (16 amu), while every molecule of oxygen (O2) masses 32 amu. For every kilogram of methane burned, one needs 4 kilograms of oxygen to burn it with. Thus the useful energy content is 20% of the 10 MJ/kg we calculated above. In that case flywheel storage is better than chemical energy.Anyway, I learned that a material with a ρ (density) of 1.5 kg/L (i.e. about that of composite CWNT) if in ‘rod’ form, has a performance of about 8,100 MPa/kWh. Makes no difference the diameter, or the length of a particular fiber, when a balanced fiber is spun around its midpoint, the “performance” of the material is about 8,100 megapascals per kilowatt hour of kinetic rotational energy. So, if the maximum working tensile strength of something like Kevlar is about 2,000 MPa, then one quite easily can reverse that and say: 2,000 ÷ 8,100 → 0.25 kWh per kilogram of Kevlar. Now this article is claiming that the long-nanotube bulk Chinese material is “20× stronger” than Kevlar, or a working strength of 40,000 MPa. Easy enough, it ought to then store 20× the kinetic energy per kilogram as a performance metric. 40,000 ÷ 8,100 → 5 kWh/kg. While that’s not exactly 10.6 kWh/kg (per some of the summary calculations of the referenced article), that’s OK. Its within shooting distance. Maybe “breaking strength” versus “working strength?” Sure. More importantly, are the Glib Gotchas. The first Glib Gotcha is that, well, a real, working kinetic energy flywheel would have to have… an enclosure, bearings, magnetic hoo-ha to invest and return energy to the flywheel. It’d need a safety shroud, gimbals (think of the inertial moment! of gyroscope effect) and metrology to figure out how it is working. More mass, that. Then there is “when it accidentally blows apart like a BOMB”, the maker has to balance the mass (and contained energy) of the flywheel with the enclosure’s ability to handle that energy, all turned … inevitably… into shock forces and HEAT. For instance, if 100 kg of CWNT stuff is the storage medium, at 5 kWh/kg, it’d hold about 500 kWh of kinetic energy. Blowing itself to bits because of some structural problem results in 500 kWh × 3.6×10⁶ J/kWh → 1.8×10⁹ joules of thermal energy being released in a few milliseconds. Putting THAT into perspective, 1.8×10⁹ J ÷ 4,186 J/g (TNT) → 430 kg of TNT.\nIts also rotating over 250,000 RPM. Tell me, what kind of container is going to be needed to contain a HALF TON of TNT going off all at once? REALLY good electrical-to-thermal conversion of a liquid to a high temperature expanding gas, using liquid argon for its cheapness, compactness and so on, wanting say an ISP of 500 ( × 9.81 = 4,900 m/s out-the-exhaust speed), each kg of exhaust has ½mv² → ½(1 × 4900²) → 12 MJ of kinetic energy. It also has a specific heat of 0.5 kJ/kg-K, and our plasma needs to be over 4,000° K heated. So I’ve heard. So, that becomes 2 MJ/kg for plasma heating. 14 MJ/kg. Our thruster’s flywheels deliver 14.4 MJ/kg. So… that means that each kg of argon requires a kilogram of flywheel more or less. The thrust of each kilogram is 4900 newton-seconds. So, the thrust of (1 ⊕ 1 = 2) kg of argon and flywheel becomes 4900 ÷ 2 → 2450 newton-seconds per overall kilogram. You really would want to eject the dead flywheel cores, continuously. Its a terrible ratio. Supposing that you have a pretty sizeable (as in the size of the illustration) electric-gas powered 3rd stage (are we agreed?) that weighs in at oh, 25,000 kg, and is 70% reaction-mass-plus-flywheels (≡ 17,500 kg at a ratio of 0.97 flywheel-to-reaction mass), well let’s see. Using Tsiolkovsky’s Rocket Equation, and NOT ejecting the flywheels (i.e. using them in parallel for maximum thrust), our rocket weighs 25,000 kg to start, and 16,136 at end. It has used up 8,864 kg of reaction mass, and accelerated it at 100% efficiency to 4900 m/s (ISP = 500). The ΔV is 2,150 m/s. Using the SAME mass — 17,500 kg or 70% of 25,000, but as one of 3 binary fuel options (CH₄ + O₂, H₂ + O₂, Kerolox + O₂), with their posted ISP’s of 350, 450 and 320 respectively, And using them up, the ΔV at end-of-burn is respectively 4,130, 5,300 and 3,850 m/s. See what I mean? The flywheel-in-parallel thing while it does well for concentrating thrust and power, it leaves so much dead weight around that it isn’t competitive. Even at 6 kWh/kg of the flywheel nanotube stuff. \r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tMore tariffs and more tax cuts for China »\r\n\t\t\t\t\t\t\t\t\t\t« Chinese tech firm bids to purchase dutch chip-maker Nexperia "}