{"id": "Beyond Free IVF is a brave new world with an army of surrogates\nNextBigFuture.com\n", "paragraph": "Nextbigfuture has reported on Denmark providing free In Vitro Fertilization (IVF) and having 10% of all babies from IVF. 20% of the couples in many countries have trouble having babies. This is increasing as mother delay having children until they are 40. Older infertility can mostly be solved by freezing eggs at peak fertility in early 20s. It is clear that many Asian countries like Japan, Singapore, China, South Korea will tell or coerce young women to freeze their eggs. Most women 38 years of age and under can expect to harvest 10-20 eggs per cycle. It is best to harvest before 36 and ideally before 25.Demographers have projections where China’s population declines from 1.4 billion to 1.1 billion in 2100. The 1.1 billion would also have 33-40% of the people over the age of 65.I have noted the rapidly increasing use of IVF in China. China now has about 200,000 babies per year from IVF. Over the next ten years, China will push towards using free egg freezing and free IVF and baby bonus payments to drive up fertility rates. It makes no sense to allow couples to drift into infertility when there is a national baby bust.In China, maximizing egg freezing and IVF would add 40 million babies per decade from 2030 onwards and 10 million in the 2020s. This would nearly balance out the 2100 population to 1.39 billion.Free IVF and free egg freezing could still fall short of maintaining desired population levels.The Chinese government of government-controlled hospitals and clinics would then have billions of frozen eggs. 40% of frozen eggs go unused. The Chinese government could choose to recruit domestic or immigrant women to act as surrogates. Those willing women could rent their womb to bring to term selected frozen eggs.If the Asian and some European countries hold the line and prevent population decline, then the world population in 2100 would be higher. There would be 500 million to 1 billion more people in 2100.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tProgress on nanobots that kill cancer cells »\r\n\t\t\t\t\t\t\t\t\t\t« Blockchain company ConsenSys buys Planetary Resources "}