{"id": "Photonic signaling for multi-chip modules\nNextBigFuture.com\n", "paragraph": "DARPA Photonics in the Package for Extreme Scalability (PIPES) program, seeks faster computers by developing high-bandwidth optical signaling technologies for digital microelectronics. PIPES aims\n1. to develop and embed integrated optical transceiver capabilities into cutting-edge MCMs\n2. create advanced optical packaging and\n3. switching technologies to address the data movement demands of highly parallel systems. The efficient, high-bandwidth, package-level photonic signaling developed through PIPES will be important to a number of emerging applications for both the commercial and defense sectors.The first technical area of the PIPES program is focused on the development of high-performance optical input/output (I/O) technologies packaged with advanced integrated circuits (ICs), including field programmable gate arrays (FPGAs), graphics processing units (GPUs), and application-specific integrated circuits (ASICs). Beyond technology development, the program seeks to facilitate a domestic ecosystem to support wider deployment of resulting technologies and broaden their impact.Projections of historic scaling trends predict the need for enormous improvements in bandwidth density and energy consumption to accommodate future microelectronics I/O. To help address this challenge, the second technical area will investigate novel component technologies and advanced link concepts for disruptive approaches to highly scalable, in-package optical I/O for unprecedented throughput.The successful development of package-level photonic I/O from PIPES’ first two technical areas will create new challenges for systems architects. The development of massively interconnected networks with distributed parallelism will create hundreds to thousands of nodes that will be exceedingly difficult to manage. To help address this complexity, the third technical area of the PIPES program will focus on the creation of low-loss optical packaging approaches to enable high channel density and port counts, as well as reconfigurable, low-power optical switching technologies.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tOpFires Hypersonic Boost Glide program will have test launches from 2020-2022 »\r\n\t\t\t\t\t\t\t\t\t\t« Sustaining 3% GDP Growth instead of 2% for ten years for the USA "}