{"id": "A Wheeled Robot Driven by a Liquid‐Metal Droplet\nNextBigFuture.com\n", "paragraph": "A palm-sized robot has been made with a drop of liquid metal in a plastic wheel. The robot’s wheel rolls when the liquid metal changes the center of gravity, which is controlled by altering the voltage through the embedded battery.The researchers expect to further develop soft robots using liquid metal. They could be used in special missions such as searching for and rescuing earthquake victims, since they can change shape to slide under doors or make it through spaces humans can’t get into.The controlled actuation of gallium liquid‐metal (LM) alloys has presented new and exciting opportunities for constructing mobile robots with structural flexibility. However, the locomotion of current LM‐based actuators often relies on inducing a gradient of interfacial tension on the LM surface within electrolytes, which limits their application outside a liquid environment. In this work, a wheeled robot using a LM droplet as the core of the driving system is developed that enables it to move outside liquid environment. The LM droplet inside the robot is actuated using a voltage to alter the robot’s center of gravity, which in turn generates a rolling torque and induces continuous locomotion at a steady speed. A series of experiments is carried out to examine the robot’s performance and then to develop a dynamic model using the Lagrange method to understand the locomotion. An untethered and self‐powered wheeled robot that utilizes mini‐lithium‐batteries is also demonstrated. This study is envisaged to have the potential to expand current research on LM‐based actuators to realize future complex robotic systems.Advanced Materials – A Wheeled Robot Driven by a Liquid‐Metal Droplet\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tGrumman develops more lethal explosives for hypersonic and other missiles »\r\n\t\t\t\t\t\t\t\t\t\t« 2009 Honduran constitutional crisis and today "}