{"id": "Will NASA funding help struggling lunar lander companies get to the moon?\nNextBigFuture.com\n", "paragraph": "NASA is asking for Lunar Surface Instrument and Technology Payloads to be placed onto commercial lunar landers. NASA is also supporting commercially developed small lunar landers.NASA will pick 8 to 12 experiments in 2019 for launch no earlier than 2020, with an overall budget of between $24 and 36 million in the first year of the program. The payload mass must be less than 15 kilograms and use have continuous power needs of 8 watts or less.There are several lunar landers in development. Lunar lander companies and teams were previously incentivized by the Google Lunar XPrize. No company sent a mission to the moon in time to win the Lunar XPrize. Five private companies have solidified launch contracts and are hoping to land on the surface of the Moon within the next two years. In October, 2018, Moon Express announced they had raised a $2.5 million bridge round led by Miami-based Minerva Capital Group. They also raised $10 million of a planned $20 million Series B round, led by an undisclosed lead investor.Moon Express Chief Executive Bob Richards said that the funding will support redevelopment of Launch Complex (LC) 17 at Cape Canaveral Air Force Station in Florida, a former Delta 2 launch site.Moon Express is targeting July 2020 for a first mission. They booked several launches on Rocket Lab’s Electron.Here is a video inside the Rocket Lab factory.\nMoon Express partnered with NASA under its Lunar CATALYST Program and in 2016 became the first commercial space company to receive U.S. federal government authorization for a private lunar mission. Moon Express has developed a family of innovative robotic exploration spacecraft designed to collapse the cost of access to the Moon and other deep space destinations, with regular flights to the Moon planned to begin in 2020.Moon Express has legal problems with a  former partner, Intuitive Machines. There was a $4.1 million verdict against Moon Express early in 2018. There is a pending motion for a mistrial.Astrobotic is a startup that is selling space on its lunar lander for $1.2 million per kilogram. 11 groups from six different nations have agreed to fly instruments on the Peregrine’s first flight. They are targeting mid-2020. Astrobotic is still looking for more funding.In 2014, Astrobotic became the first commercial company to use visual terrain-relative navigation (TRN) and LIDAR hazard detection to guide a rocket-propelled suborbital reusable launch vehicle, Masten’s Xombie, to a safe landing site in flight.The Astrobotic Virtual Orbital Imager (AVOI) is a physically accurate planetary renderer to assist in precision landing and path planning missions. This provides highly detailed simulations of landing and exploration.Astrobotic has developed custom designs, sensing, and rovers for planetary surface activities such as exploration, site preparation, and resource extraction. Astrobotic developed Polaris as an excavation vehicle that could serve as a robotic precursor to future human planetary colonization efforts by preparing terrain and mining ice and other volatiles.Three international companies will not get NASA support.Israel-based SpaceIL has spent about $95 million and plans to fly to the moon in 2019 on a SpaceX Falcon 9 mission.The Japanese team Hakuto had already built its lunar rover, Sorato. They raised more than $90 million in funding. They were looking to launch with an Indian company TeamIndus. TeamIndus lost support from the Indian Space Agency.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tNASA picks SSL to develop key fuel depot technology »\r\n\t\t\t\t\t\t\t\t\t\t« BYD confident all new cars in China will be electric by 2030 "}