{"id": "Bitcoin by itself can generate 2 degree warming by 2033\nNextBigFuture.com\n", "paragraph": "If Bitcoin is implemented at similar rates at which other technologies have been incorporated, then Bitcoin alone could produce enough emissions to raise global temperatures by 2°C as soon as 2033.Peer-reviewed journal Nature Climate Change – Bitcoin emissions alone could push global warming above 2°Celsius.A team of UH Mānoa researchers analyzed information such as the power efficiency of computers used by Bitcoin mining, the geographic location of the miners who likely computed the Bitcoin and the CO2 emissions of producing electricity in those countries. Based on the data, the researchers estimated that the use of bitcoins in the year 2017 emitted 69 million metric tons of CO2.Researchers also studied how other technologies have been adopted by society, and created scenarios to estimate the cumulative emissions of Bitcoin should it grow at the rate that other technologies have been incorporated.The team found that if Bitcoin is incorporated, even at the slowest rate at which other technologies have been incorporated, its cumulative emissions will be enough to warm the planet above 2oC in just 22 years. If incorporated at the average rate of other technologies, it is closer to 16 years.“Currently, the emissions from transportation, housing and food are considered the main contributors to ongoing climate change. This research illustrates that Bitcoin should be added to this list,” said Katie Taladay, a UH Mānoa PhD student and coauthor of the paper.“We cannot predict the future of Bitcoin, but if implemented at a rate even close to the slowest pace at which other technologies have been incorporated, it will spell very bad news for climate change and the people and species impacted by it,” said Camilo Mora, associate professor of geography in the College of Social Sciences at UH Mānoa and lead author of the study.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tAnimal populations have dropped by 60% according to Wildlife report »\r\n\t\t\t\t\t\t\t\t\t\t« High-performance solar cells with lower cost "}