{"id": "Boring Machine reaches other side of LA tunnel\nNextBigFuture.com\n", "paragraph": "Elon Musk announced that the Boring Company completed the LA/Hawthorne tunnel. The tunneling machine broke through to the other side.pic.twitter.com/TQhb9hQRxQ— Elon Musk (@elonmusk) November 17, 2018Congratulations @BoringCompany on completing the LA/Hawthorne tunnel! Cutting edge technology! pic.twitter.com/80WbSQekCQ— Elon Musk (@elonmusk) November 17, 2018Boring Company will show a two-mile tunnel in LA in December and has started work on an 18-mile tunnel in Chicago from downtown to the airport. Successfully completing the airport tunnel will make the tunneling company worth as much as $16 billion. This valuation will be before any full speed hyperloop implementation.In June 2018, Boring Company was selected as the contractor for a high-speed downtown-O’Hare transport line. A Berenberg analyst has stated that the Boring Co. could be worth as much as $16 billion if it completes the project.The $16 billion estimate for the Boring Company’s potential valuation was taken from the figures of the Channel Tunnel project, which connects England and France. This will add to the total valuation of Tesla. The electric car and energy company will be a key supplier for the high-speed transport line.Tesla would be designing and manufacturing the Boring Company’s pods for the downtown Chicago-O’Hare transport line.Musk said 18-mile high-speed tunnel would cost ~$1 billion to build. The Boring Co.’s pods are designed to carry 16 passengers at a time. They will make the 18-mile trip in 12 minutes at half the price of Uber or a cab.O’Leary Station taking shape pic.twitter.com/O25AhFBnxA— The Boring Company (@boringcompany) October 19, 2018Boring Company has completed a two-mile tunnel in LA and they are working on a huge garage elevator. Car elevators are usually 20 feet long, but the elevator for the LA tunnel will be larger. The elevator will be used for trucks and SUVs and construction equipment.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tNanotube film enabling ten times higher energy lithium metal batteries »\r\n\t\t\t\t\t\t\t\t\t\t« SpaceX going all in to launch unmanned BFR to Mars by 2022 "}