{"id": "Oumuamua mission value versus New Horizon Pluto and Europa Clipper\nNextBigFuture.com\n", "paragraph": "A space mission to chase down the Oumuamua object would be worth the $2 to 4 billion or so cost.Oumuamua is worth looking at for scientific value even it is only an anomalous interstellar object.Harvard researchers have calculated that unusual speedup and movement of Oumuamua indicate that it could be solar sail. It might weigh only 100 to 300 kilograms instead of a solid comet-like material. If it was comet material it would weigh one million to ten million tons. If it is a solar sail it would be evidence of a civilization of technologically capable aliens that sent out a solar sail probe millions of years ago. We have only just had a few smaller solar sail probes.In 2010, the Japan Space agency launched IKAROS. It has a diagonal spinning square sail 14×14 meters and made of a 7.5-micrometre (0.0075 mm) thick sheet of polyimide. The polyimide sheet had a mass of about 10 grams per square meter.In late 2020, NASA launched NanoSail-D. NanoSail-D structure was made of aluminium and plastic, with the spacecraft massing less than 10 pounds (4.5 kg). The sail has about 100 square feet (9.3 m2) of light-catching surface.There are other possibilities for Oumuamua.* Oumuamua as a Messenger from the Local Association\n* Oumuamua as a Tidal Disruption Fragment from a Binary Star SystemAny two super-heavy lift rockets would work for the mission. We launch two big rockets. One rocket adds fuel to the other rocket. We then can launch at higher speed with multiple stages toward Jupiter. The mission slingshots around Jupiter and then does close flyby slingshot around the sun.Reusability would not be needed for the rockets.There needs to be a transfer of fuel between one rocket and the other.Two SpaceX Falcon Super-heavy might also work. This would involve having four boosters on the Falcon Heavy instead of only two. Two SpaceX Falcon Super-heavy might be flown by 2020.Two SpaceX Falcon Super-heavies might only cost a total of $500 million. The probe itself would need to be similar to the Parker Solar Probe. This would cost about $1.5 billion.If we could launch two SpaceX Falcon Super-heavies by 2021 then we might intercept when the object is only at 50 AU. About 1.5 times farther than Pluto. This would be a mission cost of possibly only $2 billion.Researchers made some assumptions and estimated that it will an average ten-year wait between detectable interstellar objects.Are the measurements of the departure trajectory accurate enough for intercept. The best we can do is intercept at 50 to 90 AU. If our measurements of the trajectory are bad then we could be very far away when we pass Oumuamua.We would need to be able to scan within the volume of the margin of error to look for Oumuamua.We have to catch up to it and reacquire the object.The mission has to be able transmit the pictures and readings from two to four times the distance from Pluto.The Parker Solar Probe mission cost $1.5 billion. The probe to chase down the interstellar object will need to do a close gravitational slingshot to the sun. It will need to be built like the Parker Solar Probe.$700 million was spent on the New Horizon Mission to Pluto. Part of the justification for the timing of  that mission was the atmosphere of Pluto was going to freeze for decades.$2 billion will be spent for the Europa Clipper mission to investigate Europa and its ocean.Nextbigfuture believes the unique scientific value of closer examination of the Oumuamua is worth a technically challenging mission.An assessment needs to be made. How accurate are the trajectory calculations? Could we find it again and then get useful data.If there could be high confidence that any probe could find Oumuamua, if we get near where the object should be, then the mission would be worthwhile.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tAMD makes first 7 nanometer CPU and GPU and performance competitive with Nvidia »\r\n\t\t\t\t\t\t\t\t\t\t« Wind tunnel and lasers for US hypersonic development "}