{"id": "USA, China and Russia Military Jet Production and estimates for 2030\nNextBigFuture.com\n", "paragraph": "The US got about fifty F-35s in 2017 and 26 F-18 Superhornets. In 2018 there will be seventy F-35s for the USA and about fourteen F-18s. The US is getting about 75 to 85 fighter jets every year. In 2017 and 2018, the USA got other military aircraft\n15 KC-46A refueling tankers\nfive E-2D Advanced Hawkeye is an airborne early warning\n17 P8A anti-sub in 2017 and 7 in 2018\n19 C-130J cargo aircraft in 2017 and 9 in 2018In total, the US is getting about 130 military planes each year. This does not count helicopters.Lockheed has delivered 310 F-35s by mid-2018 and expects to deliver another 91 in 2018 after meeting last year’s target of boosting deliveries to 66. Almost one-third of the F-35s go to allies of the United States.In 2017, Russia received about 43 fighter jets.16 Su-34s, an all-weather supersonic fighter-bomber;\n10 Su-35s, a new version of the super-maneuverable Su-27 fighters;\n17 Su-30SMs, a variant of the Su-30MKI produced by Irkut Corp with upgrades in radar, communications, friend-or-foe identification, ejection seats, etc.Russia had about 14 other military aircraft delivered in 2017.Russian builders Mikoyan, Sukhoi and other contractors only manufactured some 80 warplanes – but they have the capacity to build about 130 planes a year. Russia exports military jets to other countries.China-based military website Northern Defence said China may have received around 100 aircraft in 2017. About two-thirds were combat jets.China is building more production lines and factories to build new J-31 and J-20 stealth fighters.China will likely increase fighter jet production roughly matching its 5-10% military budget increases. China’s military budget will be about double in 2030. China would match US fighter jet production quantities around 2025. China might shift to mostly stealth jet production sometime around 2030. China’s stealth jet production is highly uncertain as production is just starting. China does not announce production plans or force levels.The US has more jet fighter deliveries than China and Russia combined and the US has far more fifth-generation stealth fighters.China has about 700 4th generation fighters today and about 25 fifth generation fighters.\nChina could have 1100 4th generation fighters and about 60-120 fifth generation fighters in 2025.\nChina could have 1200-1600 4th generation fighters and 200-500 5th generation fighters in 2030.The US has about 450 fifth generation fighters today (F-22 and F-35s).\nThe US air force has about 1500 F-16s and F15s. The Navy has about 800 F-18s and the Marines have about 260 F-18s.\nThe US will have about 1000 fifth generation fighters in 2025 and about 1500 by 2030.Russia will probably have about 1000-1200 4th generation fighters in 2030.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tTesla Model 3 is crushing BMW, Audi and Mercedes sales »\r\n\t\t\t\t\t\t\t\t\t\t« NASA funds improvement of Miralon to double CNT composite strength "}