{"id": "Russia claiming reusable nuclear rocket progress\nNextBigFuture.com\n", "paragraph": "Russia is claiming progress on a megawatt nuclear space propulsion engine. They had previously stated the system would be ready by 2017.Ruscosmos is about a reusable gas-cooled fission reactor that powers a generator. This would power a plasma thruster. They have made some physical models and some video simulations. They claim to have made components and a drip heat radiator.In 2016, Skolkovo Foundation’s Nuclear Cluster head Denis Kovalevich said Russia’s Megawatt-class nuclear propulsion system for long-range manned spacecraft must be ready by 2017.“At present we are testing several types of fuel and later we will start drafting the design,” Kovalevich said. “The first parts [of the nuclear engine] should be built in 2013, and the engine is expected to be ready by 2017.” The engine is being developed for interplanetary manned spacecraft to ensure that Russia maintains a competitive edge in the space race, including the exploration of the Moon and Mars. The Russian government allocated 500 million rubles ($16.7 million) in 2010 to start a project to build a spacecraft with a nuclear engine. The overall investment in the project is estimated at 17 billion rubles (over $580 million) until 2019. According to Russia’s nuclear power agency Rosatom, the development and construction of a nuclear propulsion system for spacecraft will cost over 7.2 billion rubles ($247 mln). Nextbigfuture covered Russia’s plans for a megawatt nuclear space propulsion system back in 2011.It would have an ISP of 3000-6000. A 6000 ISP megawatt system might be able to send a compact unmanned probe to Mars in 6 weeks. The adjustable VASIMR system had planned for a manned 200 MW system with variable ISP which could get to Mars in 39 days. The role of space power in solving prospective problems in the interests of global safety, science and social economic sphere by А.S. Koroteev President of Russian Academy of Cosmonautics 2010 (19 pages)A presentation discussed nuclear power sources for space up to 1 megawatt for flying to Mars, moon base power and for orbital tugs.A qualitatively new stage in the development and practical application of atomic energy in space is linked with the use of multipurpose high-capacity propulsion-power modules. Their design based on a nuclear powered propulsion facility in the megawatt range has been approved and accepted for implementation. In this article, the facility is described, the principles of operation of the facility as a whole and its individual subsystems are examined, and the proposed characteristics and mass of the structural elements are presented. The advantages of using atomic energy in the power-plant–motor variant, including for manned flight to Mars, are shown. Russia is looking closely at plasma thrusters as wellA forum on space suggested that Koroteev discussed a plasma rocket development timeline (but the original link is broken)* hybrid two-contour scheme, a plasma generator driven by reactor-produced electricity yields specific impulse 20 times higher than chemical propulsion\n* inner contour of the reactor with circulating working agent at 1500 C\n* development started in 2010\n* plans to complete initial design by 2012\n* prototype working by 2015\n* cargo module ready for flight in 2018The new plan would be 4 years late on the design work and then 2 years late on the working prototype.Bigger Russian nuclear space designsIn 2008, Open-cycle multi-megawatt MHD space nuclear power facility The results of calculations of the characteristics and development of a scheme and technical make-up of an open-cycle space power facility based on a high-temperature nuclear reactor for a nuclear rocket motor and a 20 MW Faraday MHD generator are presented. A heterogeneous channel-vessel IVG-1 reactor, which heated hydrogen to 3100 K, with the pressure at the exit from the reactor core up to 5 MPa, burn rate 5 kg/sec, and thermal power up to 220 MW is examined. The main parameters of the MHD generator are determined: Cs seed fraction 20%, stopping pressure at the entrance 2 MPa, electric conductivity ≈ 30 S/m, Mach number ≈ 0.7, magnetic induction 6 T, electric power 20 MW, specific energy extraction ∼4 MJ/kg. The construction of the scheme of a MHD facility with zero-moment exhaust of the working body and its main characteristics are presented. \r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tDARPA Laser radar can see wind 8.6 miles away and enables permanent balloons »\r\n\t\t\t\t\t\t\t\t\t\t« Blockchain based Social Networks: State of the field and how to profit from them "}