{"id": "Most powerful supercomputer in Texas by 2019 with new cooling technology\nNextBigFuture.com\n", "paragraph": "A 250 petaflop supercomputer immersed in liquid coolant is being built in Texas. In 2019, it could be the world’s most powerful supercomputer. 40,000 server immersed in coolant are going into a data center in Houston. It is being built by DownUnder GeoSolutions (DUG).It will perform cutting-edge computer modeling for energy companies and bring new levels of precision to oil and gas exploration. It will be housed in the Skybox Datacenters facility in Houston’s Energy Corridor, where DUG has leased 15 megawatts of capacity. The deal, represented by Bennett Data Center Solutions, is the largest colocation transaction in Houston’s history.It will use more than 720 enclosures using the DUG Cool liquid cooling system, which fully submerges servers in tanks filled with dielectric fluid. This will reduce the huge system’s energy usage by about 45 percent compared to traditional air cooling.DUG and Skybox expect the data center to be extraordinarily efficient, operating at a Power Usage Effectiveness (PUE) of 1.05, lower than even the most advanced hyperscale cloud providers.The system is expected to be operational by February 2019.The initial DUG McCloud data hall will have a 250 petaflop (single-precision) machine once fully installed.The data center is currently being upgraded to accommodate a 120+ petaflop machine by 2018.The cooling system fully submerges standard high-performance computing (HPC) servers into specially-designed tanks that are filled with polyalphaolefin dielectric fluid. The fluid is non-toxic, non-flammable, biodegradable, non-polar, has low viscosity, and most importantly, doesn’t conduct electricity. The unique part of this design is that the heat exchangers are very simple and submerged with the computer equipment, meaning that no dielectric fluid ever leaves the tank. A water loop runs through the rooms and to each heat exchanger.The dielectric fluid is cooled and circulated around the extremely hot components in the compute servers. This innovative oil-cooling solution has high thermal capabilities and a large operating temperature range.Traditionally, companies like DUG spend half of their revenue on compute centres. Energy use can be a significant and crippling expense in a conventional data centre. With DUG Cool, the thermal qualities of the fluid mean that condensed-water chillers can be used rather than refrigeration, saving 25-30% of total power usage. Removing all server fans, which aren’t needed in a fluid-immersion system, reduces power consumption by a further 20%. That’s a total power saving of at least 45%.The over 1000x thermal capacity of the fluid vs. air means that components never get hot, reducing their mean time to failure. Fluid-immersed computers fail at a much lower rate, considerably reducing maintenance costs and expensive down-time.DownUnder GeoSolutions (DUG) is an Australian-owned high-tech geosciences company.DUG has invested in one of the largest supercomputer networks in the world, with data centres in Perth, Houston, London and Kuala Lumpur. The Perth cluster, affectionately known as “Bruce”, is the largest supercomputer in the southern hemisphere at 22 petaflops (PF). All four data centres have been recently upgraded and DUG’s global compute power now exceeds 50 PF.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tDC movie universe reboot »\r\n\t\t\t\t\t\t\t\t\t\t« Carnival of Space 583- Quantum Assisted Scope for 10,000 kilometer optical scope "}