{"id": "Marlin could scale public blockchains by 500 times\nNextBigFuture.com\n", "paragraph": "Marlin, the startup behind a blockchain-oriented protocol for scaling distributed ledgers while preserving user privacy, is pleased to pre-announce the launch of its product at the Genesis C.A.T. Meetup, held in Moscow, Russia, on November 6, 2018. After a series of successful simulations and benchmarking in the testnet stage, Marlin is about to announce the protocol and roadmap in Moscow, with the whitepaper being made public on November 5. Marlin’s solution can be easily integrated with existing blockchain networks, dApps, and protocols to provide faster peer-to-peer (P2P) communication, reduce latency to 100ms, and boost the throughput of public blockchains by 500 times over and above existing scaling solutions.The Marlin Protocol includes several features, such as scalable low-latency multicast, network-layer anonymity, and high resiliency with reduced bandwidth consumption to support an efficient network layer aimed at the decentralized ecosystem. The product can transform distributed ledgers and dApps by making them faster and more reliable while ensuring a higher degree of privacy, especially thanks to several key protocol components, like probabilistic forwarding or dandelion routing. While the protocol has no limits in the use cases, streaming and gaming dApps will be among the top gainers, as the Marlin solution offers dynamic traffic steering, forward error correction (FEC), and path conditioning functionalities. These features, along with Proof-of-Availability and Proof-of-Bandwidth check make sure that the network is reliable and secure for data operations.Developers might achieve the mentioned benefits with any blockchain or dApp by integrating the Marlin Protocol, which doesn’t constitute a complex procedure.The Marlin ecosystem will be fueled by its blockchain-based, token, with the ticker LIN. The token will be used to pay for Marlin’s network services, participate in governance, and make security deposits to deter malice.Marlin hasn’t announced any public token sale yet but has pledged to keep the community informed about any relevant updates.Despite having a 10-member team, Marlin can be already referred to as an international project, given that its members spread across Singapore, San Francisco, and Shanghai. The startup has several strategic partners and investors.The project evolved from a CDN product developed at a competition organized at the Stanford University, which Pratyaksh Sharma, currently Marlin’s Chief Technology Officer (CTO), and his team won by developing a blockchain solution from scratch. Soon, the developers realized that the protocol could be further deployed for more general and widescale usage. Now the Marlin team, led by former Zilliqa Core Developer Siddhartha Dutta, is guided by a team of advisors comprised of world-class experts in P2P networks, including Ethan Fast – co-founder of NEX and City of Zion, MIT Professor Hari Balakrishnan, and venture capitalist Prabhakar Reddy.Marlin CMO Dean Pappas commented:\n“Decentralized applications need a different network layer. A lot of these different blockchains – when they talk about how they’re going to get faster transactions, almost all of them are talking about having a better consensus algorithm or some off-chain mechanism. But most of them are not addressing the [main] problem, which is the fragmented network layer that underlies all P2P systems. So, this is the rockstar team in the space of networking, and they have identified that there is a whole suite of technologies that are not being applied uniformly as a protocol.”“The idea now with Marlin, which started with the CDN, is to go one layer deeper and use the underlying techniques to speed up all kinds of P2P systems including blockchains themselves to have multiplicative effects over other existing scaling solutions,” he added.Marlin is the startup behind a blockchain-based networking protocol that addresses several problems in the decentralized web, including scalability and privacy. The team comprises of world-class experts who have previously worked with large-scale distributed systems at Zilliqa, Microsoft, Adobe, Facebook, Pinterest, MIT, and ETH Zurich.For more information about the Marlin protocol, visit the official website – https://www.marlin.pro/, and the whitepaper – https://www.docdroid.net/JQ6N8iu/marlin-whitepaper.pdf \r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tChina Large Stealth Drone better than US RQ-170 drone »\r\n\t\t\t\t\t\t\t\t\t\t« Near-term possibility of Artificial General Intelligence "}