{"id": "World environment and China’s energy from now to 2050\nNextBigFuture.com\n", "paragraph": "China is building most of the new energy generation in the world. How this power is generated will shape global climate.Nuclear power capacity needs to reach 554 GW by 2050 for a 1.5 degree warming scenario. This would be 28% of the projected energy mix in 2050.By 2050, China’s power generation will go from 6700 Terawatt hours this year to 14,000 Terawatt hours. This would be 10,320 kilowatt hours per capita.This will require a $1 to 1.3 trillion investment by 2050.  This will be about $2.2 trillion after accounting for inflation.China spends almost $200 billion per year on fossil fuel energy. This would mean over $6 trillion on energy for the next three decades.China has not approved new nuclear reactors for three years. In June, 2018, China signed a $2.9 billion (20 billion yuan) deal for four Russian nuclear reactors.  All four units will be Russia’s latest Gen3+ VVER-1200 reactors. The reactors and all other necessary equipment will be developed and supplied by Russia. Two reactors will be built at Xudabao and another two at Tianwan nuclear plants. In March, 2018, they announced the freeze on new reactor construction will end by December 2018.Electricity demand is still growing at 2.5% each year.China has a target of 88GW of nuclear capacity built or under construction by 2020. This means China will need to authorize about 30 gigawatts of new nuclear plants over the next two years.China’s sustainable development scenario plans for 24 percent more nuclear investment for the next 12 years. This could double China’s nuclear power from 58 GW in 2020 to about 110-120 GW by 2030.Currently there are 46 completed nuclear reactors and 11 under construction.China has 957 gigawatts (GW) of coal-fired power operating. This is more than four times India’s 219 GW. China currently has 126 GW of coal-fired power in construction and 76 GW either announced, in pre-permit phase or with permits already in place. India has 39 GW being built and 63 GW in the approval process.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tInterest paid on US debt will pass Medicaid in 2019 and Defense in 2023 »\r\n\t\t\t\t\t\t\t\t\t\t« China Air Pollution fight is the current biggest global environmental effort "}