{"id": "Tesla air filters beat california wildfire air pollution\nNextBigFuture.com\n", "paragraph": "Tesla cars have air filtration systems similar to systems used in hospitals, clean rooms, and the space industry. They developed a HEPA filtration system capable of stripping the outside air of pollen, bacteria, and pollution before they enter the cabin and systematically scrubbing the air inside the cabin to eliminate any trace of these particles. The end result is a filtration system hundreds of times more efficient than standard automotive filters, capable of providing the driver and her passengers with the best possible cabin air quality no matter what is happening in the environment around them.Tesla installs filters that are in the H13 to H14 filter category.High-efficiency particulate air (HEPA) filters must satisfy certain standards of efficiency such as those set by the United States Department of Energy (DOE).To qualify as HEPA by industry standards, an air filter must remove (from the air that passes through) 99.97% of particles that have a size greater-than-or-equal-to 0.3 microns. In Tesla tests, a Model X was placed in a large bubble contaminated with extreme levels of pollution (1,000 µg/m3 of PM2.5 vs. the EPA’s “good” air quality index limit of 12 µg/m3). They then closed the doors and activated Bioweapon Defense Mode.Not only did the vehicle system completely scrub the cabin air, but in the ensuing minutes, it began to vacuum the air outside the car as well, reducing PM2.5 levels by 40%. In other words, Bioweapon Defense Mode is not a marketing statement, it is real. You can literally survive a military grade bio-attack by sitting in your car.This has now been demonstrated in real life. Tesla cars have been getting compliments by keeping the smoke and particles from California wildfires out of the air inside cars.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tWorld economic change to 2040 is Asia from South America to Southern Europe level »\r\n\t\t\t\t\t\t\t\t\t\t« China Airshow shows J-20 with missile bay open and new missiles "}