{"id": "Does the ever-growing artificial intelligence sector need the services of blockchain technology?\nNextBigFuture.com\n", "paragraph": "The phenomenon of artificial intelligence (AI) is growing at an exponential pace. Although the\nunderlying technology first caught the attention of masses in 1997, whereby an IBM built machine known as “Deep Blue” outwitted the then World Chess Champion Garry Kasparov, it is only now that researchers are appreciating the practically endless capabilities of what AI can offer.In fact, according to a recent study, it is estimated than the entire AI sector will be worth close to $1.2 trillion by the end of 2018, up 70% from the previous year. Furthermore, the same study concluded that this figure will grow to just under $4 trillion at the close of 2022. However, whilst demand for AI-driven technology continues to prosper across a magnitude of sectors – whether that’s FinTech, Medicine, Marketing or Defence, there remains a somewhat significant challenge that must be resolved: Computing Processing Unit (CPU) data centers do not have the required computational power and/or hardware capacity to facilitate global requirements of the future.The current state of play in the AI sector places a strong empathis on data centers, which subsequently provide the necessary capacity to facilitate the technology. On top of the aforementioned concerns regarding computational power, these data centers are ultra-energy intensive, with the Office of Energy Efficiency and Renewable Energy estimating that data centers are responsible for close to 2% of all U.S. electricity consumption. As one would expect, this is far from a sustainable model for a technology that many believe will soon play a major role at every corner of the globe. However, there might just be a solution.Instead of amplifying the problem by placing a heavy reliance on CPU’s, the answer is potentially staring straight at us. With an estimated 2 billion consumer computers now in circulation, the required capacity levels can instead be shared across multiple graphic processing unit (GPU) devices.Not only do GPU units have the ability to perform faster calculations and facilitate higher levels of memory bandwidth, but they are also 10 times more efficient than their CPU counterparts. As one would imagine, the contribution of surplus computational power does come at a cost, however a new and exciting start-up called Tatau believe they have the solution – blockchain technology.In a nutshell, Tatau have created a decentralized platform that will allow those in need of computational power and storage to purchase it, and those that have surplus quantities, to sell it. In order to create an autonomous and seamless marketplace, the platform utilizes a tokenization eco-system that is built on top of the blockchain protocol. Not only does this ensure transactional activity remains cheap, fast and secure, but the entire platform is transparently accessible via the blockchain ledger.To illustrate the demand for such a solution from within the AI industry, the Tatau team recently entered into a partnership with FaceMe – an innovative New Zealand based organization that specialize in bridging the emotional gap between digital and human interaction. The concept – which is suitably named an Intelligent Digital Human Platform, allows humans to interact with an AI-based machine as a means of receiving customer support. Whether it’s in the banking, retail, educational or government sectors, a digital interaction through the FaceMe technology gives customers that personal touch.The partnership will see the FaceMe platform facilitate its AI-driven computational power through the Tatau hub, which in turn, is fully supported by those that contribute their surplus GPU capabilities. Ultimately, it is a solution that stands to benefit all involved. Whilst the likes of FaceMe are able to offset their demand for power, GPU owners are able to monetize through a tokenization model that is based on cryptocurrency and blockchain technology.This great solution also led to Tatau’s back-to-back wins on both the Regional Startup World Cup in Dubai, and the World Blockchain Summit’s “Grand Slam” pitch award. Overall, Tatau beat a field of 33 tech companies in both competitions and were picked winners.Tatau’s team with the judges and organizers. Image: TatauThe FaceMe-Tatau partnership is certainly a step in the right direction for an industry solution that has the potential to go global, and could be the first of many. In fact, when one considers the current size of the AI sector, alongside its estimated growth over the course of the next few years, we could see a sea-change in the way organizations facilitate their AI computational demands.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tFree medical fertility and bribes could boost Japan’s population in 2100 by 50% »\r\n\t\t\t\t\t\t\t\t\t\t« Tesla Autopilot used to remotely switch parking spots "}