{"id": "Harvard Professor who published speculation of Oumuamua as alien solar sail\nNextBigFuture.com\n", "paragraph": "The first interstellar object, named ‘Oumuamua, was discovered in October 2017 by the Pan-STARRS 1 telescope in Hawaii. A recent paper by Dr. Avi Loeb of Harvard University and Harvard Smithsonian Center for Astrophysics, it may possibly be an artificial alien light sail. The Youtube Channel Event Horizon spoke to Dr. Loeb about that paper.Oumuamua appears to be weird. Like nothing we have seen before. It has an extreme shape based on the variation in reflected light from the Sun. NOTE- At the bottom there is video where Neil DeGrasse Tyson gives his take on the shape. He thinks Oumuamua is a clump of loosely collected rocks.Loeb- Oumuamua appears to be at the so-called local standard of rest which is the average of all the stars in the vicinity of the Sun only one in 500 stars is so much at rest in that frame. If aliens did not want anyone to know where your origins are they would move at the rest frame.  There is no star that belongs that is exactly at rest in that frame. This object seems to be there. The Spitzer satellite observations of it did not detect thermal emission. It seems to be a very good reflector and absorbs very little of the sunlight but most intriguingly it moves on a trajectory that indicates an extra push in addition to the gravitational force from the Sun. This was reported in nature back in June. One would think oh maybe that push is just due to a cometary outgassing where water ice evaporates and gives through the rocket effect some push to the object that’s the situation in comets. Unfortunately it cannot be the case in this case in this object because there is no any cometary tail seen around it and moreover the amount of mass that it needs to lose is quite a significant fraction of its mass in order to give it the extra kick.If it is regular comet density then it would weight 1 million to 10 million tons.Comets produce the outgassing in directions that are not necessarily towards the Sun. They change their spin period and there is no change in a spin period of this object. It cannot be outgassing like we see in comets and then the question arises what gives the extra push.\nOur paper tries to explain that and we basically suggest that sunlight is pushing on this object and that can be effective only if it’s very thin.  Less than a millimeter in thickness roughly the size of 20 meters or more.It is sort of like a sail just like a sail in a sailboat is being pushed by the wind here the solar radiation the sunlight is pushing on it and then one asks okay if that’s the case then what’s the origin of such an object. It could well be artificial light sail we are currently developing this technology here on earth there are projects and I actually lead one of them called starshot. It’s possible that another civilization mastered this technology already and you know it’s sort of like going to the beach and looking at sea shells that are swept ashore. You look at different seashells and you see they come from different origins but every now and then you see a plastic bottle that seems to be artificially made. We should examine all the debris that comes our way through the solar system from outer space. This is the very first unbound object that we have seen coming close to the Sun we should just check all these objects and even if most of them appear to be rock every now and then we might see some space junk or it maybe it’s from other it might be equipment that is not operational anymore from another civilization. It might be actually be a reconnaissance mission going our way for it and just simply someone’s trash. We produced the Voyager 1 and 2 that are leaving the solar system. The problem if you assume that this object is out 1 out of random population of objects then you need each star to eject of the order of 10 to the power 15 such objects over its lifetime that’s much more than we would have expected for the Sun big because I actually wrote a paper a decade ago forecasting how many asteroids should the solar system lose during its lifetime. It’s much less than that by a factor of a hundred to a hundred million so so the fact that we detected muah-muah in the first place is surprising because we would have expected a much lower abundance and the current service should not have seen anything and I’m very intrigued by the unusual properties of this object.I think we should keep so the way to resolve this puzzle is to keep looking.Within a few years there will be the large synoptic survey telescope LSST. Surely we will see another member of this population if it’s a random population and then we will be alert. We can use the best telescopes on earth for a follow-up and try to get as much information as possible on every interstellar object that passes by. Like the analogy with the seashells. It is hard now to study Oumuamua.It is moving away from us is there any chance of learning more well the problem is it moves at a speed that is twice to three times the speed of chemical rockets. We use chemical rockets for most of our space missions in the past and so we cannot use chemical propulsionThe standard chemical rockets to chase it down unless we have some very innovative scheme of using gravity assist from planets and perhaps you know stretching the limits of chemical propulsion.There are people suggesting that maybe we should chase down more and that would be a mission that will cost more than a billion dollars. NOTE: Nextbigfuture described how we could chase it down using to Falcon Super-heavies.Neil DeGrasse Tyson believes Oumuamua is a clump of rocks. Thus the elongated shape is from gravity pulling the rocks into a chain. However, this does not explain the acceleration.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tChina Airshow shows J-20 with missile bay open and new missiles »\r\n\t\t\t\t\t\t\t\t\t\t« Orbital Kinetic Bombardment gets close to nuclear on damage and cost "}