{"id": "Tesla has Chinese land for 500,000 car per year Gigafactory 3\nNextBigFuture.com\n", "paragraph": "Tesla has 1300 acres plot of land at the Shanghai Lingang Equipment Industrial Zone for building a 500,000 car per year Gigafactory 3.  Tesla will be able to build a Chinese Gigafactory as large as the Gigafactory 1 in Nevada. The Chinese reports indicate 1300 acres but other sources talk about 210 acres.China plans to have a car manufacturing zone in the Lingang area. They already 20 car and car parts companies in the area.The land is 47 miles southeast of Shanghai’s center. It is accessible by multiple road systems, allowing companies with facilities operating in the area to have no logistical issues. Several automakers are present in the Lingang Industrial Zone as well, with some companies reportedly testing vehicles in the area.It is estimated that Tesla paid about $140 million for the land in China.Tesla has about 5 square miles (131 million square feet) for Gigafactory 1 in Nevada.In 22 February 2017, Tesla began to refer to the SolarCity Gigafactory in Buffalo, New York as Gigafactory 2.A European Gigafactory will likely be Gigafactry 4 or 5.New energy vehicles sales in China were up 54.8 percent in September and climbed 81.1 percent in the first nine months of this year to 721,000 vehicles.Elon Musks company will raise about $2 billion from Asian debt markets to fund the construction of the Gigafactory.China is leading the world in electric car sales. Total cumulative passenger EV sales worldwide hit 4 million at the end of August, 2018. China will have about 40-50% of global electric car sales in 2019. China had 37% of electric car sales so far.In 2017, Tesla delivered 14,833 vehicles in China. The 2018 deliveries are running in the 800 to 1000 unit per month range. Having a factory in China will enable Elon to avoid all or most tariffs which will enable a lower and more competitive price.Written by Brian Wang, Nextbigfuture.com\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tChina adds nuclear energy and US courts allow state subsidy laws »\r\n\t\t\t\t\t\t\t\t\t\t« Ovzon fourth client SpaceX Falcon Heavy launches "}