{"id": "Progress on nanobots that kill cancer cells\nNextBigFuture.com\n", "paragraph": "Motorized molecules driven by light have been used to drill holes in the membranes of individual cells and show promise for either bringing therapeutic agents into the cells or directly inducing the cells to die. Above-Motorized molecules that target diseased cells may deliver drugs or kill the cells by drilling into the cell membranes. The illustration shows a motorized molecule sitting atop a cell membrane (left) and molecules activated by ultraviolet light drilling into the bilayer membrane (right).Researchers at Rice, Durham and North Carolina State universities demonstrated in lab tests how rotors in single-molecule nanomachines can be activated by ultraviolet light to spin at 2 to 3 million rotations per second and open membranes in cells.The researchers used motors based on work by Nobel laureate Bernard Feringa, who won the prize for chemistry in 2016. The motor itself is a paddle-like chain of atoms that can be prompted to move in a single direction when supplied with energy. Properly mounted as part of the cell-targeting molecule, the motor can be made to spin when activated by a light source.They are experimenting on micro-organisms and small fish before moving on to rodents. Clinical trials in humans are expected to follow and it is hoped that the results may have the potential to save millions of lives.Nature – Molecular machines open cell membranesBeyond the more common chemical delivery strategies, several physical techniques are used to open the lipid bilayers of cellular membranes. These include using electric and magnetic fields, temperature, ultrasound or light to introduce compounds into cells, to release molecular species from cells or to selectively induce programmed cell death (apoptosis) or uncontrolled cell death (necrosis). More recently, molecular motors and switches that can change their conformation in a controlled manner in response to external stimuli have been used to produce mechanical actions on tissue for biomedical applications. Here we show that molecular machines can drill through cellular bilayers using their molecular-scale actuation, specifically nanomechanical action. Upon physical adsorption of the molecular motors onto lipid bilayers and subsequent activation of the motors using ultraviolet light, holes are drilled in the cell membranes. We designed molecular motors and complementary experimental protocols that use nanomechanical action to induce the diffusion of chemical species out of synthetic vesicles, to enhance the diffusion of traceable molecular machines into and within live cells, to induce necrosis and to introduce chemical species into live cells. We also show that, by using molecular machines that bear short peptide addends, nanomechanical action can selectively target specific cell-surface recognition sites. Beyond the in vitro applications demonstrated here, we expect that molecular machines could also be used in vivo, especially as their design progresses to allow two-photon, near-infrared and radio-frequency activation\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tUS Iran oil sanctions officially hit on Monday and Venezuela oil production drops again »\r\n\t\t\t\t\t\t\t\t\t\t« Beyond Free IVF is a brave new world with an army of surrogates "}