{"id": "AMD makes first 7 nanometer CPU and GPU and performance competitive with Nvidia\nNextBigFuture.com\n", "paragraph": "Advanced Micro Devices launched its first 7-nm CPU and GPU at the lucrative target of the data center. The working chips deliver comparable performance to Intel’s 14-nm Xeon and Nvidia’s 12-nm Volta.AMD is back from the near dead. AMD is competitive with Nvidia and Intel will get a significant market share.A single 7-nm Epyc x86 processor narrowly beats a system with two Intel Skylake Xeons in a rendering job. AMD benchmarks have the 7-nm Vega GPU on par with a Nvidia V100 in inference tasks.The existing 14-nm Epyc, launched in May 2017, boosted AMD’s negligible 0.5% share of x86 servers to 1.5%. With its customer relationships now back on track, the 7-nm version could push AMD up to “high single digits” in x86 server market share by mid-2019.The Zen-based x86 chips have boosted AMD’s share of overall microprocessor units to 9.23% in the second quarter of this year.AMD continued its proactive use of creative packaging to deliver a lower-cost Epyc. A single module includes up to eight 7-nm processor die linked with AMD’s Infinity fabric to a single 14-nm I/O chip with memory controller. The approach is an extension of the 14-nm Epyc that uses four die on a single package.AMD is providing a head-to-head alternative to Nvidia’s Volta for machine learning and commercial graphics.The 7-nm AMD Vega has 13.2 billion transistors. AMD said Vega delivers 25% more performance than the previous 14-nm chip. The high-end MI60 version of it for GPU computing have 64 compute units, 4,096 streaming processors, and up to 32 GBytes HBM2 memory as well as support for PCIe Gen 4.The AMD chip delivers within 7% of a Nvidia Volta’s performance with less than half the die area.Vega will deliver 29.5 Tera FP16 operations/second for AI training. In inference jobs, it can hit 59 TOPS for 8-bit integer and 118 TOPS for 4-bit integer tasks.AMD claims that its 7-nm x86 chips will beat Intel’s 10-nm versions — now expected late next year.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tChina’s giant ultra-high voltage grid is ambitious as its high speed rail »\r\n\t\t\t\t\t\t\t\t\t\t« Oumuamua mission value versus New Horizon Pluto and Europa Clipper "}