{"id": "China could solve population problem with millions of IVF babies\nNextBigFuture.com\n", "paragraph": "Globally about 2 million cycles of IVF are performed each year. IVF is growing at ~7% per year. IVF is growing at 20-30% in China. China will be the major driver of IVF demand growth. This will increase global IVF growth towards 20-30% per year.China had 17-18 million births per year and about 100K-200K were IVF births in 2017. By 2025, China should have about 1 million IVF births per year.Denmark leads the world in IVF rates. 10% of all Denmark births are via IVF. Denmark has socialized medicine and a desperate need for a higher birthrate.If China matches Denmark’s levels of IVF by 2030, then China would have about 2 million IVF births per year. China had more than 40 million patients with fertility problems in 2016, according to statistics from China’s National Health and Family Planning Commission. China will probably surpass Denmark IVF percentages and reach 20% IVF babies.China will lift all birth restrictions and provide government support for IVF. This could boost China’s birthrate by 10-40 million each decade starting in 2030. There will likely be a 4-7 million population boost through the 2020s in China from IVF.The number of working age people in China is set to fall to 700 million by 2050 – a decline of nearly a quarter, according to a government spokesman. The working-age population has been in decline since 2012, with the number of people aged 16-59 predicted to be 830 million in 2030. Maintaining China’s workforce in 2050 would require adding 150 million more than the expected 50 million from the two-child policy. A massive IVF boost could offset the workforce decline by 10-20 million in 2050s and then help a workforce recovery from 2060 onwards.The IVF industry is growing. Costs are dropping and costs in other countries are far lower.Egg banking is now aggressively marketed to younger women as an insurance policy against age-related infertility. In 2011, egg banking did not even exist as a category in the CDC’s annual report on IVF. In 2016, storing eggs or embryos was the purpose of 25% of all IVF cycles. Facebook and other companies are offer egg freezing as a benefit. IVF remains a luxury.In the past ten years, China’s government has increased funding and efforts to bring high-quality health care to its people. The current 5-year plan has made reproductive medicine, including PGD (preimplantation genetic diagnosis), a priority.China’s use of genetic screening technique already is more than the United States. Genetic screening is growing up to five times faster in China. One clinic in China performs more procedures with PGD each year than all of the United Kingdom. China has over 40 IVF clinics.According to the Society for Assisted Reproductive Technology, the number of US IVF attempts with single-gene testing rose from 1,941 in 2014 to 3,271 in 2016, an increase of almost 70%. Assuming this trend continued, there were about 5,000 IVF attempts with single-gene testing in 2018.The US average IVF cost is over $20,000 for each try and testing can add $10,000 or more. This  requires an unpleasant two-week process of ovarian stimulation and egg harvesting. The Centers for Disease Control and Prevention (CDC) estimates that 1.7% of babies born in the US today are conceived using IVF. A 2009 study found that 76% of the medical need for assisted reproduction in the US is unmet.China already uses more genetic screening against genetic diseases and will use genetic screening for intelligence.Qiao’s centre carried out 18,000 IVF procedures in 2016. In 2016, the biggest clinic, the Reproductive and Genetic Hospital CITIC-Xiangya in Changsha, recorded 41,000 IVF procedures.The market inside China for fertility services will reach $1.5 billion in 2022, more than double the $670 million it generated in 2016.Chinese patients spent 7.4 billion yuan ($1.1 billion) on fertility treatments outside the country in 2016. Qianzhan Industry Research Institute estimated that reproduction tourism from China was US$1.4 billion in 2017. This was about 70,000 couples in 2017. Reproduction tourism from China is growing at 20-30% per year.Chengdu-based Jinxin is planning an initial public offering in Hong Kong to raise as much as $500 million, with the proceeds possibly helping the company expand its operations in China and make acquisitions in the U.S.Along with Warburg Pincus, the company recently completed the acquisition of HRC Fertility, which operates clinics in Southern California.Chinese patients seeking better technology and services will travel to the U.S.We Doctor Holdings Ltd., a health-care service provider backed by Tencent Holdings Ltd., was part of a group that on Aug. 31 announced the purchase of a 90 percent stake in Genea Ltd., a Sydney-based provider of fertility services that wants to build its business in China.China has an algorithm-powered app called “Crazy for making babies” (aka Fengkuangzaoren). There are over 8 million users and 70,000 families successfully used it to help conceive over the past four years.China’s IVF and genetic screen cost about one-third of the costs in the United States. \r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tLong Wave infrared + sensor fusion = weapon tracking anti-stealth »\r\n\t\t\t\t\t\t\t\t\t\t« Apple CEO Tim Cook calls for strong privacy protection "}