{"id": "Blockchain based Social Networks: State of the field and how to profit from them\nNextBigFuture.com\n", "paragraph": "One of the main promises of blockchain technology is a vastly improved social media experience. The benefits many entrepreneurs envision include, among other things, greater data sovereignty, the ability of users to profit from ads, censorship resistance, robust online identity and verification of claims, etc. This article is an attempt to analyze the best attempts by different companies to build social networks that allow us to gleam some of the benefits of blockchain technology. It ’s worth reflecting on how much of an improvement blockchain technologies can actually bring to social media. Incremental improvements typically do not justify new companies. In the context of social media, only vastly superior experiences will justify switching or even adopting new social media platforms. This is doubly true as the current social media platforms are able to psychologically manipulate populations due to the amount of information they have on various parties. So how much does data sovereignty actually improve the quality of daily social media use. Parties are being paid for watching advertisements, are the amounts they’re being paid worth the hassle of switching? Does the absence of fake news on a platform incentivize meaningful adoption or simply create niche social media platforms? And is the creation of niche social media sites create more opportunities for integration via blockchain that could fundamentally change the way of using social media?While this trichotomy is not all-encompassing, for the purpose of this article, types of social networks will be categorized as pure content social media (i.e. Facebook), professional content social media (i.e. LinkedIn) and hybrid versions of these 2.  Steemit is the most popular blockchain based social media platform. For a detailed analysis of how the platform functions, I recommend checking out this blog. The short version is that Steemit rewards content creators and curators with reputation tokens. How much content creators are rewarded are based on a variety of factors. These include how fast someone comments on new content, how their comments are received by other parties in the comment section etc. The economics of the system is designed such that there are 3 stores of value. The Steem dollar is supposed to be the price stable currency used to purchase things on the platform, the steem power is a reputation token, and the Steem token is meant for speculation as most will have to buy that token to access the services on the platform (increasing demand should hypothetically increase the value of the Steem token). The main point of Steemit is allowing content creators to monetize their content through an inflationary currency. There is no explicitly political bent or an attempt to fundamentally change the advertising model. Simply allowing people whose content is liked to have greater influence, get paid more for their content and be able to sell their influence. The platform can be thought of as a hybrid between Reddit and Medium. Unlike Steemit, Sapiens goals are more diverse. They are more like Facebook while Steemit is a Reddit-medium hybrid.  The core values of the platform are customizability, privacy, free speech and democracy. Customizability meaning the user has a high degree  of autonomy surrounding how he experiences the platform, privacy meaning users decide whether advertisers get their data and even have the option of being paid for sharing this data; free speech meaning that users cannot be censored as Facebook has begun doing, and democracy meaning governance of the system is done by community members instead of a centralized body. The platform also has a proof of value mechanism that reduces trolling by analyzing a user’s reputation as well as a proof of stance mechanism that depends on machine learning to interpret the titles of articles and detect bots from real parties.  This attempt to eliminate bad actors will also include ID verification mechanisms not currently used by social media platforms. Sapiens’ token economics are different than many other blockchain based social media platforms. There is only one token. And users get these tokens for participating on the platform as well as from ad revenues. III. Indorse\nIndorse is going after the professional markets (like LinkedIn). They are trying to make sure that claims about certifications and competencies on professional websites are more verifiable. This means two potentially very significant developments. The first is creating an API that allows institutions to put certificates on the blockchain. The second is a mechanism to ensure that claims about competencies are confirmed by networks of people instead of by a select few that could be manipulating the system.\nThe model for accomplishing the latter entails endorsements of skills anonymously done by random people in network instead of given by specific people. Skills that cannot be verified in this fashion are still allowed to be posted, however, they are classified as unverified skills. The platform has 2 types of token: Reputation tokens and tokens used by advertisers to pay for services on the platform. Reputation tokens are earned by validating claims made by other parties as well as having claims you make validated by other parties on the platform. IV. Humans.net\nHumans.net is an attempt beyond mere social networking. It is an interesting hybrid project that promises much of what many blockchain based social networks promise (data sovereignty, censorship resistance, peer to peer services that doesn’t allow for exorbitant fees by centralized parties (i.e. Uber)) while also making some profound promises about new technologies being used alongside the blockchain.First, they promise to index and catalog people around the world in a similar way that Google did page rank. The implications of this is that people will be able to effectively search for other people within the parameters of their business interests much more effectively than previously. In a gig economy, this could be a very valuable tool. Second, the team intends to build an AI-based verification system that is more useful than mere ratings or reviews. The idea behind this verification system is that it takes into account the user’s preferences and needs when ranking the utility of different services they seek. The rating system will be built on a multi-vector assessment of the interests of those who assessed, and the interests of the one who is currently watching the assessment. Users will be able to choose an entity (person, object, company, etc.) according to the characteristics they need at the moment. The team already has a working solution for this feature and has a thriving community (215,553 users) as well as a significant network of global partnerships (notable partners include 02 Consulting and Coffemania/L’adresse). If these features scale, they would significantly differentiate the platform from its competitors.  Ong is another hybrid project that is actually not trying to be anything like any existing social network. Instead, they are meant to be a platform that connects all of the social media accounts of a user. So a consolidation of centralized and decentralized social media networks. This model also includes the reputation token and payment token model. Value propositions include getting rid of fake news and encouraging users to interact with other users outside of their ideological filters. The value of these networks in the immediate future are hard to predict as prices in the crypto market are still not tethered to actual use and will likely not be significantly so in the near future. As a speculator, the assumption that a blockchain based social media network will likely gain prominence is very reasonable. In that context, investing some amount in all the previously mentioned networks is likely worth it (investment doesn’t have to be capital.  Can also be time spent using the platform as users get rewarded in tokens). The main question is how to weight investments in the blockchain social network space. The platforms that enable professional economic activities have the easiest road to adoption as value propositions do not rely on things like political preferences and a burning desire to be paid for watching ads (hard to price value of ads). In this context, humans.net and Indorse are the networks worth weighting most heavily in a social media crypto portfolio.Indorse: The huge demand for the utility of the Indorse platform is self-evident. It’s simply a more trustworthy version of LinkedIn. Unlike platforms like Sapiens that have a political agenda among other things, Indorse is simply pursuing a clear market need. This is not to say that there is no demand for a censorship resistant and fake news resistant social network. However, such demand is likely niche and not as useful to advertisers as a system that allows them to be very certain about the professional claims people are making. Humans.net: The implications of the humans.net platform are significant. . Peer to peer and AI based ranking algorithms that optimize search for humans with different skills while decreasing costs are particularly intriguing. Consider websites for skills like tutoring. The best sites currently charge a 40% overhead. Significantly decreasing these costs would create a lot of value for the increasing number of people working in the gig economy. Being able to cut out the middleman for services like ridesharing, and accurately assess the ability of professionals should create a lot of value for both workers and customers. New social networks, whether they be as ubiquitous as facebook or serve more niche demands, are inevitable. These experiments adding new capacities via the blockchain are particularly intriguing as no one knows what the differentiating factors will be. As always, teams determine the success of projects as many pivots are inevitable. In addition to the novelty of their ideas, many on the teams at indorse and humans.net have demonstrated competence over their careers. For these reasons, these projects warrant further examination by all interested parties. \r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tRussia claiming reusable nuclear rocket progress »\r\n\t\t\t\t\t\t\t\t\t\t« Brexit getting closer "}