{"id": "Lighting up a megacity at night will lead to night solar farm lighting\nNextBigFuture.com\n", "paragraph": "Chengdu plans to launch in 2020 a mirror satellite to create dusk lighting at night. The satellite will appear to be 8 times a full moon. They believe this will remove the need for most street lighting which will save power and reduce air pollution. They dusk level of lighting may not disturb animals or plants.I believe lighting up a megacity at night is only step one. China has the most solar farms in the world. Large 5-gigawatt solar farms have the area of a megacity. China is preparing to triple the capital value of its solar farms. A constellation of $37 billion of solar mirror satellites will boost several large solar farms and would twice the power and efficiency of the Three Gorges Dam.This would clear a path to China having 70-80% baseload energy from solar. This would mean significant chunks of China perhaps a few hundred massive solar farms would have constant light. People could then wring their hands about the nocturnal animals. But full realization of this plan would enable China to phase out coal power with zero emission power.So will environmentalists get behind this plan? Has the panic over the IPCC climate report been real or not? Do they really want to have massive reduction of fossil fuel or not? The affordable and scalable paths to massive fossil fuel reduction involve converting solar to constant power production with huge mirror satellite constellations and factory mass produced nuclear power.Do people think this is not where China is going with this? Although lighting up a megacity at night is a big and bold move. It does not move the big energy or environment needle for China (or the world). I think it is pretty clear the end game is lighting up the big solar farms. China has the most and biggest solar farms and the most solar power in the world. China has to get rid of the coal.Upward of 70 percent of China’s utility-scale wind and solar farms have been built in the country’s sparsely populated northern provinces.By 2020, China is planning to build 16 new ultra-high-voltage DC lines, on top of eight already in operation, connecting these provinces to coastal load centers, according to BNEF analysts. Less than half of these lines are designated to transmit renewable electricity. Lighting solar power at night would require more ultra-high-voltage DC lines, but China does not have any issues with more large construction.The Chengdu night light mirror satellite will be able to illuminate an area with a diameter between 10 and 80 km, while the precise lighting beam can be controlled in a few tens of meters.Satellite tests started years ago and now the technology is ready to be put into practice.Kang Weimin – director of the Institute of Optics, School of Aerospace, Harbin Institute of Technology – tries to calm the concerned animalists and explained that the satellite light will be like a twilight glow; therefore it should not affect the routine of the animals.Chengdu is the capital of southwestern China’s Sichuan province and it has about 14-15 million people. China’s solar deployment is concentrated overwhelmingly in a handful of provinces, many of them in rural areas located far from population centers that need electricity and in areas where transmission development has not kept pace with renewables deployment and there is little storage capacity. Some of those provinces, solar-curtailment rates have approached 30%.Solar curtailment is the rejection by China’s grid operators of a portion of the electricity that China’s solar projects generate. The grid operators cannot take the extra power from spikes in the solar power generation. Mirror satellites can smooth out the power and make it more predictable.Solar power remains a negligible energy source globally, contributing only about 1-2% to worldwide electricity production.It is no forgone conclusion that solar will become cost-competitive at a scale necessary to meaningfully curb carbon emissions. The Three Gorges Dam’s output amounted to one-third of the 253 million megawatt-hours of electricity produced in 2015 by all of the solar installations on the planet combined.In 2016, China produced 71% of the world’s solar modules, IHS Markit estimates. China installs the majority of them within its borders—mainly in large solar farms in a handful of Chinese provinces.Mirror satellites can be used to provide constant light for large solar farms. This could remove the need for battery storage.This city scale lighting looks step two on a roadmap to lighting of 5 Gigawatt solar farms at night.Lightweight mirrors in a Dawn-Dusk Orbit beam sunlight to earth PV stations providing solar electricity in evening winter for 14 hours per day increasing solar power station capacity factor to 60% and reducing solar electricity cost to under 6 cents / kWh.JX Crystals proposed satellite mirrors to boost solar power on earth.Assumptions – 2025 – Revenue\n1.) 18 satellites in dawn/dusk orbit 1000 km above earth.\n2.) The sun’s disc diameter viewed from earth is 10 mrad. This implies solar spot size on earth from a mirror up 1000 km equal 1000 tan(10 mrad) = 10 km.\n3.) Assume each mirror satellite array has diameter of 10 km.\n4.) Now assume that in the year 2022 there are 40 ground stations distributed around\nthe world that the 18 satellite constellation will serve and that the constellation gives 1 hr x 0.7 kW/m2 of sunlight to each station in both the morning and in the evening for a total of 2 hr x 0.7 kW/m2 of sunlight per day per station.\n5.) Combined, the 40 earth stations will produce 5.5 x 40 = 220 GW. Assume that the\nprice for electricity is $0.1 / kWh, annual revenue = $3×10^10 / yr = $16 billion per yr.Mirror Satellite Constellation Cost\nIt all depends on launch cost for LEO orbit.\nThe ISC SPS study (4) assume $400 per kg. SpaceX Falcon Heavy (7) = $1,100 per kg.\nMiraSolar sat (4) cost $0.6 B; constellation (4) $11 B.\nMiraSolar sat (7) cost $1.8 B; constellation (7) $32 B.Payback time range:\nAssuming 40 ground stations and $400 per kg launch cost: 0.7 years.\nAssuming 40 ground stations and $1100 per kg launch cost: 2 years.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tFuture of Quantum Computing from Giant and Pioneer in the field »\r\n\t\t\t\t\t\t\t\t\t\t« Technological and Societal Innovation is key to beating poverty "}