{"id": "China adds nuclear energy and US courts allow state subsidy laws\nNextBigFuture.com\n", "paragraph": "The Haiyang 2 AP1000 in China is the fourth AP1000 nuclear energy reactor to be connected to the electricity grid. Sanmen 1 became the first AP1000 to begin commercial operation in September, 2018.China has 1750 Gigawatts of power generation. Nuclear power has a high utilization rate. It is about 4 times the utilization level of wind in China and double the level of hydroelectric dams.40 gigawatts of nuclear power is equal to 160 gigawatts of wind or 80 gigawatts of hydroelectric. Wind power is at about 175 gigawatts in China. The overall electrical power generation of nuclear power in China is within about 10% of the power generation of wind. Nuclear power also generates heat which can be used for industrial processes.Sanmen 2, Haiyang 1 and Haiyang 2 are connected to the grid. They will all be started later in 2018 or in 2019.In Georgia, the Vogtle AP1000 reactors will continue construction.Vogtle 3 is currently scheduled to enter service by November 2021 and unit 4 by November 2022.Two US federal courts of appeals last month upheld very similar state laws in Illinois and New York aimed at subsidizing those states’ under-performing and at-risk nuclear power plants.Two of Exelon Corporations’ nuclear generation facilities were close to being closed because the zero-emission value of nuclear generation was not being recognized, the Illinois legislature passed the Future Energy Jobs Act.The Illinois Power Agency subsidy program requires generators that use coal or natural gas to buy zero-emissions credits (ZECs) from nuclear power plants. The price of each credit was set at $16.50 per megawatt-hour.  The price of ZECs under the program goes down if average annual energy prices on the market exceed a set cap.Exelon Nuclear, a division of Exelon Generation, operates the largest fleet of nuclear plants in America. They have 22 reactors which are clean, zero-carbon and always-on: an ideal foundation for a clean energy future. Nuclear energy emits no greenhouse gases (GHG), making it a clean power source. Right now, nuclear plants are helping address climate change, providing 20 percent of the nation’s electricity and 60 percent of its clean, zero-carbon energy.Nuclear power dominates in clean energy and also reliability. It meets the demand for an uninterrupted flow of electricity for extended periods, in even extreme weather conditions. This steady, around-the-clock performance means more reliable service for customers and communities.Exelon’s nuclear reactors have 94.1 percent capacity factor.If America is to achieve its 80 percent reduction goal in greenhouse gas emissions by 2050, nuclear energy needs to be part of the solution.Zero-emission credits are payments to compensate nuclear power for not emitting greenhouse gases in the production of electricity. ZECs are modeled after credit programs in many states that support renewable energy production. Like renewable energy credits (RECs) that are generated by wind and solar generators and sold to utilities. ZECs are credits generated with each megawatt-hour (MWh) of electricity produced by the plants. Just as wind, solar and other non-emitting generators have been compensated through REC programs, ZECs have been established for nuclear energy production, specifically for those plants facing imminent closure. The Clinton Power Station in central Illinois and the Quad Cities Generating Station on the Mississippi River were saved. These plants support around 4,200 direct jobs and $1.2 billion in economic activity in the state.The nuclear plants in New York were also saved.This is the model for saving reactors in Pennsylvania and other areas.By Brian Wang of Nextbigfuture.com\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tTechnological and Societal Innovation is key to beating poverty »\r\n\t\t\t\t\t\t\t\t\t\t« Tesla has Chinese land for 500,000 car per year Gigafactory 3 "}