{"id": "25% of world murders are in Brazil, Venezuela, Mexico and Columbia\nNextBigFuture.com\n", "paragraph": "With just 8% of the world’s population, Latin America accounts for roughly a third of global murders. It is also the only region where lethal violence has grown steadily since 2000, according to United Nations figures.Above – Mexican soldiers and police guard a severed head which was left as a message between rival drug cartels.Nearly one in every four murders around the world takes place in just four countries: Brazil, Venezuela, Mexico and Colombia. Last year, a record 63,808 people were murdered in Brazil. Mexico also set a record at 31,174, with murders so far this year up another 20%.* Large drug and organized crime problem. Latin America supplies a lot of the US illegal drug demand\n* Latin America has more young people than most other regions\n* high youth unemployment\n* weak educational systems. Only 27% of Brazilians aged 25 or older have completed high schoolIn the 1950s, Singapore and Caracas had very similar murder rates, between 6 to 10 per 100,000 residents, according to Manuel Eisner, who studies historical levels of violence at the Violence Research Centre in Cambridge, U.K.Singapore suffered from gangs, prostitution, drug trafficking and corruption. But after independence in 1962, authoritarian Lee Kwan Yew enforced rule of law, boosted education, and created a culture of working hard and achievement, and ensured social integration. Singapore’s murder rate is 0.4 per 100,000 residents. The nongovernmental Venezuelan Violence Observatory estimates the country’s murder rate is roughly 110 per 100,000—about 34,000 a year.Not all of Latin America has this problem. Chile’s murder rate of 3.6 per 100,000 is less the U.S. rate of about 5 per 100,000.  In 2016, the estimated number of murders in the USA was 17,250.  Chicago had a murder rate of 23 per 100,000 in 2016.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tTesla registers 61,800 Model 3s in October »\r\n\t\t\t\t\t\t\t\t\t\t« Animal populations have dropped by 60% according to Wildlife report "}