{"id": "Ovzon fourth client SpaceX Falcon Heavy launches\nNextBigFuture.com\n", "paragraph": "Swedish company, Ovzon, has entered into an agreement with SpaceX for launch of Ovzon’s first GEO satellite. The launch is expected to take place no earlier than Q4 2020. The next step for the company is to finalize the procurement of the satellites.Per Wahlberg, CEO Ovzon said:Contracting the launch supplier of the first Ovzon satellite is an important and exciting step for our company. SpaceX offered a very competitive solution with the Falcon Heavy launch vehicle which will gain us access to space in a timely and reliable manner. The satellite is expected to be launched no earlier than Q4 2020. The procurement of the satellites is now also in the final stage. Earlier this month we ordered and started the manufacturing of the first Ovzon On-Board-Processor (OBP), one of the most advanced of its type. They continue to work towards the goal of revolutionizing mobile broadband via satellite by offering the highest data-rates through the smallest terminals.Ovzon’s commitment is the fourth commercial contract secured by Falcon Heavy in 2019 and 2020.Ovzon signs agreement with SpaceX for first satellite launch – read the full release here: https://t.co/M9YWRCyp5LIn an important step towards growing our satellite service offering, Ovzon has entered into an agreement with SpaceX for launch of Ovzon’s first GEO satellite. pic.twitter.com/HfMfl9jnNV— Ovzon AB (@OvzonAB) October 16, 2018“We are honored that Ovzon has chosen SpaceX to launch the first of its satellites,” said SpaceX’s President and COO, Gwynne Shotwell. “We look forward to working closely on the execution of this important direct-to-GEO mission.” The Ovzon solution offers speeds up to 80 times faster than competing offerings.The next generation Ovzon service is based on complete end-to-end proprietary components and patented technology. Ovzon-3 will significantly increase service performance.The company has offices in Stockholm, Sweden and Bethesda, Maryland and Tampa, Florida in the United States.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tTesla has Chinese land for 500,000 car per year Gigafactory 3 »\r\n\t\t\t\t\t\t\t\t\t\t« US Army will test 50 kw lasers on Strykers and 100 kw lasers in 2021 "}