{"id": "MaZee and Crypto PR Lab Join to Provide Bundled Blockchain Marketing Services\nNextBigFuture.com\n", "paragraph": "Today, MaZee and Crypto PR Lab announced their partnership, offering capital-seeking blockchain startups, a bundled marketing service focused around community management, digital marketing, and public relations. Excitingly enough, both firms join forces to work with an upcoming Security Token Offering (STO), to revolutionize Cross-Border Payments and Global Remittances, a market driven by over 250 million immigrants sending around $600 billion to support friends and families back home. Currently, blockchain projects seeking to run their own initial coin offering (ICO) are facing a shift in the market, as the scale shifts from public sales to private investors. Since its birth in early 2016, ICOs’ public sale became a trending topic across the world, as well as a lucrative space to invest. Why? Swift and enormous returns. However, the “game” has changed as a result of:Major “pump and dumps”,\nScams, and\nFailed/futile projects.“Due to this [market] shift, it becomes increasingly difficult for ICOs to run a successful public sale, as they are now competing in this bearish market. Consequently, we have looked to other services to help increase our clients’ exposure and position in the market,” stated Marco Calicchia, CEO and Co-Founder of MaZee.MaZee was co-founded late 2017, by Mr. Calicchia, Alkiviadis Zaganiaris (COO) and Marcus Linden (CFO), after recognizing the potential of helping blockchain startups raise capital via community management. By leveraging communities on channels such as Telegram, BitcoinTalk and Reddit, MaZee has helped over 25 ICOs successfully raise a total of around $500 million. Some of their notable successes include Remme, RightMesh and Open Platform. “We’ve decided to partner with Crypto PR Lab due to their strong ties with leading media channels. They maintain a consistent presence at numerous blockchain events, and it’s time that we embrace ambitious and powerful women in crypto,” Calicchia emphasized. In what appears to be a male-driven blockchain industry, this partnership seeks to change the nature of the beast. Launched early 2018 in San Francisco, Alexandra Karpova and Maria Prusakova have “taken over” the world with Crypto PR Lab with their presence in the blockchain industry. Consistently attending conferences to meet with leaders, has allowed them to secure speaking opportunities, while introducing their partners and clients to their network of investors. You can contact MaZee by email at: or by email at: marco@mazeecommunity.com and alki@mazeecommunity.com.You can contact Crypto PR Lab by email at alexandra@cryptoprlab.com and masha@cryptoprlab.com \r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tNASA funds improvement of Miralon to double CNT composite strength »\r\n\t\t\t\t\t\t\t\t\t\t« Super low cost conversion of spent nuclear fuel "}