{"id": "Wind tunnel and lasers for US hypersonic development\nNextBigFuture.com\n", "paragraph": "Sandia National Laboratories has a hypersonic wind tunnel and advanced laser diagnostic technology to help develop hypersonic technology. Sandia has an annual budget of over $3 billion.U.S. development of autonomous hypersonic missiles and drones are a top defense priority. Russia and China have reported successes and are fielding hypersonic missiles. Russa is deploying the mach 20 Avangard hypersonic missile. There are other hypersonic weapons being deployed by Russia and China.Before, the attitude was that hypersonic flight was 30 years away and always will be. The US had spent a few lazy decades working on hypersonic technology. Now the US wants to make hypersonic missiles work yesterday.Air blows down the hypersonic wind tunnel at speeds of Mach 5, 8 or 14, depending on pressure settings. The Mach 5 nozzle uses high-pressure air (nitrogen plus oxygen). Nitrogen alone is used at the higher speeds and can be pressurized to 8,600 pounds per square inch. The recommended pressure for a car tire is usually between 30 and 35 psi. There is so much potential energy, nitrogen must be stored in a bunker behind 1-foot-thick walls.The hypersonic wind tunnel has an 18-inch diameter test section. Models can only be 4 to 5 inches in diameter. There are sensors and devices in the wind tunnel and on the models.Inside the test section, electric resistance heaters unique to each Mach number heat the gases and prevent condensation of the gas. Without heat, the air or nitrogen turns to ice in the wind tunnel. The heaters are like 3-megawatt hair dryers. They raise the air temperature above 2,000 degrees Fahrenheit at the beginning of the tunnel. By the time air or gases get to the test chamber, the temperature can fall as low as minus 400 degrees Fahrenheit.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tOumuamua mission value versus New Horizon Pluto and Europa Clipper »\r\n\t\t\t\t\t\t\t\t\t\t« SpaceX BFR reusability simulation video "}