{"id": "Nanotech platform Carries mRNA Directly to Target Cells\nNextBigFuture.com\n", "paragraph": "A new study explores a biological approach to directing nanocarriers loaded with protein “game changers” to specific cells. The groundbreaking method may prove useful in treating myriad malignancies, inflammatory diseases and rare genetic disorders.Lipid nanoparticles (LNP) were used to deliver modified messenger RNA to treat inflammatory bowel diseases and other diseases.Prof. Dan Peer, Molecular Cell Biology at TAU’s Faculty of Life Sciences, led the research for the new study.Nature Communications – Cell-specific delivery of modified mRNA expressing therapeutic proteins to leukocytesOver the past few years, lipid carriers encapsulating messenger RNAs (mRNAs) have been shown to be extremely useful in altering the protein expressions for a host of diseases. But directing this information to specific cells has remained a major challenge.“In our new research, we utilized mRNA-loaded carriers — nanovehicles carrying a set of genetic instructions via a biological platform called ASSET — to target the genetic instructions of an anti-inflammatory protein in immune cells,” says Prof. Peer. “We were able to demonstrate that selective anti-inflammatory protein in the target cells resulted in reduced symptoms and disease severity in colitis.“This research is revolutionary. It paves the way for the introduction of an mRNA that could encode any protein lacking in cells, with direct applications for genetic, inflammatory and autoimmune diseases — not to mention cancer, in which certain genes overexpress themselves.”ASSET (Anchored Secondary scFv Enabling Targeting) uses a biological approach to direct nanocarriers into specific cells to promote gene manipulation.“This study opens new avenues in cell-specific delivery of mRNA molecules and ultimately might introduce the specific anti-inflammatory (interleukin 10) mRNA as a novel therapeutic modality for inflammatory bowel diseases,” says Ms. Veiga.“Targeted mRNA-based protein production has both therapeutic and research applications,” she concludes. “Going forward, we intend to utilize targeted mRNA delivery for the investigation of novel therapeutics treating inflammation disorders, cancer and rare genetic diseases.”Therapeutic alteration of gene expression in vivo can be achieved by delivering nucleic acids (e.g., mRNA, siRNA) using nanoparticles. Recent progress in modified messenger RNA (mmRNA) synthesis facilitated the development of lipid nanoparticles (LNPs) loaded with mmRNA as a promising tool for in vivo protein expression. Although progress have been made with mmRNA-LNPs based protein expression in hepatocytes, cell specificity is still a major challenge. Moreover, selective protein expression is essential for an improved therapeutic effect, due to the heterogeneous nature of diseases. Here, we present a precision protein expression strategy in Ly6c+ inflammatory leukocytes in inflammatory bowel disease (IBD) induced mice. We demonstrate a therapeutic effect in an IBD model by targeted expression of the interleukin 10 in Ly6c+ inflammatory leukocytes. A selective mmRNA expression strategy has tremendous therapeutic potential in IBD and can ultimately become a novel therapeutic modality in many other diseases.To overcome the hurdles of selective, targeted delivery of lipid-based technologies, we recently developed a modular targeting platform named ASSET (Anchored Secondary scFv Enabling Targeting). ASSET coats the LNPs with monoclonal antibodies (mAbs) and enables a flexible switching between different targeting mAbs. ASSET utilizes a biological approach and facilitates the construction of a theoretically unlimited repertoire of targeted carriers, which deliver RNA molecules efficiently to various leukocytes subsets in vivo.Inflammatory bowel disease (IBD) is characterized by a complex and dysregulated immune response. The onset of IBD is considered as a combination of genetic alterations and environmental factors. Consequently, an effective treatment for IBD requires a temporal and spatial immunosuppressive effect that will tune down the autoimmune response without effecting normal immune activity\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tChinese tech firm bids to purchase dutch chip-maker Nexperia »\r\n\t\t\t\t\t\t\t\t\t\t« Hyperpolarized quantum MRI increases sensitivity 100,000 times "}