{"id": "High-performance solar cells with lower cost\nNextBigFuture.com\n", "paragraph": "Chinese researchers have developed solar cells which are high efficiency and lower cost.Nano Energy Journal – Modulation-doped ZnO as high performance electron-selective layer for efficient silicon heterojunction solar cells•    The Li-doped ZnO (Li-ZnO) layer was fabricated by a simple, mild and efficient solution process, and the work function was tuned precisely in a relative large range (from 4.15 to 3.85 eV).\n•    The contact resistivity (ρc) was dramatically decreased from 100 mΩ cm2 to 18 mΩ·cm2 for n-Si/Li-ZnO/Al structure with optimized Li concentration.\n•    Remarkable efficiency of 15.1% and open-circuit voltage of 643 mV, for the solution-proceeded PEDOT: PSS/Si heterojunction solar cell, was achieved.It has been a long-time dream for photovoltaic (PV) researchers to achieve high-performance silicon (Si) heterojunction solar cells (SCs) relying only on low-temperature and solution-based processes. A newly emerging PV technique of carrier-selective contacts, which comprise high-performance hole- and electron-selective layers (HSL and ESL) for both polarities on Si substrate, is highly expected to meet this dream. Here, we report a precise control of the doping level in solution-processed ZnO thin films and their successful application as ESLs for organic/Si heterojunction SCs. We show that addition of Li in ZnO (Li-ZnO) allows for the accurate tuning of its work function from 4.15 to 3.85 eV. In case of Si/ZnO/Al heterocontact, presence of the Li-ZnO layer with optimized Li concentration results in a remarkable enhancement in extraction of electrons, showing by a big reduction of contact resistivity (ρc) from 100 to 18 mΩ cm2. When used in combination with an interfacial passivation layer of intrinsic amorphous silicon (a-Si:H), the bilayer ESL of a-Si:H/Li-ZnO helps to yield an open-circuit voltage (Voc) of 643 mV and an efficiency up to 15.1%, both remarkable for an organic/Si SC fabricated using solution-based processes. Progress in tuning the Li-ZnO properties to yield improved interfaces between Si and rear-sided electrode may open up a new direction of exploring more functional materials for high performance ESLs via effectively solution-based method.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tBitcoin by itself can generate 2 degree warming by 2033 »\r\n\t\t\t\t\t\t\t\t\t\t« Grumman develops more lethal explosives for hypersonic and other missiles "}