{"id": "Controlling genome editing with nanomagnets\nNextBigFuture.com\n", "paragraph": "A moth-infecting virus and nanomagnets could be used to edit defective genes that cause diseases like sickle cell, muscular dystrophy and cystic fibrosis.Above -Rice University bioengineers use a magnetic field to activate nanoparticle-attached baculoviruses in a tissue. The viruses, which normally infect alfalfa looper moths, are modified to deliver gene-editing DNA code only to cells that are targeted with magnetic field-induced local transduction. Courtesy of the Laboratory of Biomolecular Engineering and NanomedicineRice University bioengineer Gang Bao has combined magnetic nanoparticles with a viral container drawn from a particular species of moth to deliver CRISPR/Cas9 payloads that modify genes in a specific tissue or organ with spatial control.They will use easily manipulated magnetic fields to control the expression of viral payloads in target tissues by activating the virus that is otherwise inactivated in blood.The cylindrical baculovirus vector (BV), the payload-carrying part of the virus, is considered large at up to 60 nanometers in diameter and 200-300 nanometers in length. That’s big enough to transport more than 38,000 base pairs of DNA, which is enough to supply multiple gene-editing units to a target cellNature Biomedical Engineering – Spatial control of in vivo CRISPR–Cas9 genome editing via nanomagnetsThe potential of clustered regularly interspaced short palindromic repeats (CRISPR)–CRISPR associated protein 9 (Cas9)-based therapeutic genome editing is hampered by difficulties in the control of the in vivo activity of CRISPR–Cas9. To minimize any genotoxicity, precise activation of CRISPR–Cas9 in the target tissue is desirable. Here, we show that, by complexing magnetic nanoparticles with recombinant baculoviral vectors (MNP-BVs), CRISPR–Cas9-mediated genome editing can be activated locally in vivo via a magnetic field. The baculoviral vector was chosen for in vivo gene delivery because of its large loading capacity and ability to locally overcome systemic inactivation by the complement system. We demonstrate that a locally applied magnetic field can enhance the cellular entry of MNP-BVs, thereby avoiding baculoviral vector inactivation and causing a transient transgene expression in the target tissue. Because baculoviral vectors are inactivated elsewhere, gene delivery and in vivo genome editing via MNP-BVs are tissue specific.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\t10-qubit quantum integrated circuit prototype in silicon by 2022 »\r\n\t\t\t\t\t\t\t\t\t\t« OpFires Hypersonic Boost Glide program will have test launches from 2020-2022 "}