{"id": "SpaceX Falcon 9 block 5 certified for most important NASA missions\nNextBigFuture.com\n", "paragraph": "SpaceX’s Falcon 9 rocket is qualified to launch NASA’s most expensive and highest-priority science missions.NASA’s Launch Services Program (LSP) has certified the two-stage Falcon 9 as a Category 3 rocket.Falcon 9 Block 5, the rocket’s newest iteration that first took flight from KSC in May, recently earned LSP’s Category 3 certification, which enables the company to launch the agency’s highest-priority payloads.Category 3 rockets are expected to have a demonstrated reliability of 90 to 95 percent.\nCategory 2 rockets are expected to have a demonstrated reliability of 80 to 90 percent.Several different criteria have to be met to secure Category 3 status, though there are three “alternative” paths to earn it. Category 3 requires as few as three successful flights and as many as 14 depending on the level of access given to NASA officials. The more access NASA has, the more likely officials are to certify a rocket with fewer successful launches under its belt.The Falcon 9 Block 5 has flown six successful missions – four from the Space Coast and two from Vandenberg Air Force Base in California. Including previous versions of Falcon 9, however, boosts that number to 60 missions with only one post-launch failure.“LSP Category 3 certification is a major achievement for the Falcon 9 team and represents another key milestone in our close partnership with NASA,” SpaceX President and Chief Operating Officer Gwynne Shotwell said Thursday in a company-released statement. “We are honored to have the opportunity to provide cost-effective and reliable launch services to the country’s most critical scientific payloads.”Falcon 9 has already boosted high-priority science payloads, such as this year’s launch of NASA’s Transiting Exoplanet Survey Satellite, or TESS, and the internationally developed JASON-3 satellite. Both were managed by LSP and were Category 2 missions.Moving forward, the certification will likely mean NASA and other agencies consider Falcon 9 for more complex and costly science missions.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tOrbital Kinetic Bombardment gets close to nuclear on damage and cost »\r\n\t\t\t\t\t\t\t\t\t\t« Asia will be over half of the world economy in 2028 "}