{"id": "USA number one in economic competitiveness for the first time in ten years\nNextBigFuture.com\n", "paragraph": "The United States is the top ranking country in the World Economic Forum 2018 competitiveness rankings. The USA has not been number one in competitiveness since 2008.At the heart of the competitiveness agenda is the recognition that economic growth is a core driver of human development. There is overwhelming evidence that growth has been the most effective way to lift people out of poverty and improve their quality of life. The importance and policy relevance of growth has been re-affirmed through the United Nations’ Sustainable Development Goals (SDGs). Goal 8 calls for “sustained, inclusive and sustainable economic growth” and sets an ambitious target of 7% growth for least-developed countries.After a lost decade, economic recovery is well underway, with the global economy projected to grow almost 4% in 2018 and 2019.The Fourth Industrial Revolution (4IR) is disrupting economies and societies by redefining the way we work, live and interact with each other. The 4IR offers the potential to leapfrog stages of development—but it also makes the pathway to development less certain, notably for emerging economies betting on industrialization and the demographic dividend.Major economic challenges need long-term solutions, but short-termism prevails in governments, administrations and corporations around the world. The new GCI 4.0 provides a much-needed compass for policy-makers and other stakeholders to bridge this chasm. It offers guidance on what matters for long-term growth. It can inform policy debates and help shape economic strategies and monitor progress.The results demonstrate a strong correlation between competitiveness and income level. High-income economies make up the entire top 20. Conversely, only three non-high-income economies feature in the top 40: Malaysia (25th), China (28th), and Thailand (38th). While the GCI 4.0 is not a proxy for current income, the index assesses the ability of economies to sustain growth over time. It therefore holds some predictive power. In Figure 1, economies that land relatively far above the trend line may have difficulty sustaining their current level of income without improving their competitiveness. Most of these outlying countries are mineral resource-rich. Qatar, Brunei Darussalam, Kuwait, Trinidad and Tobago, and Venezuela are the most striking examples. For example, despite having a similar level of income as Chile, Venezuela’s GCI score is almost 30 points lower. Similarly, the lowest-ranked high-income country, Argentina, lags almost 20 points behind Malaysia and China.Malaysia (74.4, 25th) and China (72.6, 28th) are less than 30 points to the competitiveness frontier (the highest score on the GCI) and on par with many advanced economies. The largest ASEAN economies—Indonesia, the Philippines, Viet Nam and Thailand—as well as Brunei Darussalam are 40 points or less to the frontier. Finally, Mongolia (52.7, 99th), Cambodia (50.2, 110th) and Lao PDR (49.3, 112th) are only halfway to the frontier, reflecting major weaknesses that threaten sustained growth.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tUS Army will test 50 kw lasers on Strykers and 100 kw lasers in 2021 »\r\n\t\t\t\t\t\t\t\t\t\t« Where is the climate fall of France to trigger WW2 scale climate mobilization ? "}