{"id": "Tesla Autopilot used to remotely switch parking spots\nNextBigFuture.com\n", "paragraph": "A Tesla owner used the current autonomous driving and parking capabilities to remotely change parking spots.With Smart Summon, the Tesla car can navigate more complex environments and parking spaces, maneuvering around objects as necessary to come find you.The summon feature is engaged through the Tesla mobile app or through the Model S and X key fob. It activates the vehicle and moves at a maximum of 39 feet in a straight line.Advanced summon should be rolled out in 6 weeks. This will enable moving around some obstacles and making some turns.In 2019, Summon should allow vehicles to drive around a parking lot, locate an empty spot, recognize and read signs to confirm that a parking spot is valid, and initiate a parking sequence.You will be able to control a Tesla car similar to control of current remote control toy cars.Updated Summon versions will use Autopilot cameras. Summon have only been using the vehicles’ ultrasonic sensors to maneuver in and out of parking spaces. Car will drive to your phone location & follow you like a pet if you hold down summon button on Tesla app— Elon Musk (@elonmusk) November 1, 2018All Tesla vehicles produced in our factory, including Model 3, have the hardware needed for full self-driving capability at a safety level substantially greater than that of a human driver.I was not sure when I would use this feature… till today.   @elonmusk @tesla pic.twitter.com/bC6rFt2SuW— D Shawn Kennedy (@rarelyserious) October 31, 2018Tesla advanced Summon ready in ~6 weeks! Just an over-the-air software upgrade, so will work on all cars made in past 2 years (Autopilot hardware V2+).— Elon Musk (@elonmusk) November 1, 2018\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tDoes the ever-growing artificial intelligence sector need the services of blockchain technology? »\r\n\t\t\t\t\t\t\t\t\t\t« US Air Force SpaceX Falcon Heavy launch delayed til early 2019 "}