{"id": "Blockchain company ConsenSys buys Planetary Resources\nNextBigFuture.com\n", "paragraph": "Blockchain venture production studio ConsenSys has bought space asteroid mining company. Planetary Resources. The acquisition was by an asset-purchase transaction. Planetary Resources’ President and CEO Chris Lewicki and General Counsel Brian Israel have joined ConsenSys in connection with the acquisition.Brian Israel served in the U.S. State Department’s Office of the Legal Adviser, where he was responsible for the international legal dimensions of outer space, oceans and international environmental governance matters, and served as U.S. Representative to the United Nations space law body. Brian Israel said “Ethereum smart contract functionality is a natural solution for private-ordering and commerce in space—the only domain of human activity not ordered around territorial sovereignty—in which a diverse range of actors from a growing number of countries must coordinate and transact.” Ethereum Co-founder and ConsenSys Founder Joe Lubin said, “I admire Planetary Resources for its world class talent, its record of innovation, and for inspiring people across our planet in support of its bold vision for the future. Bringing deep space capabilities into the ConsenSys ecosystem reflects our belief in the potential for Ethereum to help humanity craft new societal rule systems through automated trust and guaranteed execution. And it reflects our belief in democratizing and decentralizing space endeavors to unite our species and unlock untapped human potential. We look forward to sharing our plans and how to join us on this journey in the months ahead.”ConsenSys is a global organism building the infrastructure, applications, and practices that enable a decentralized world. ConsenSys Labs incubates the best teams of Web3 across the globe, providing them capital, mentorship, and access to ConsenSys’s network of top-tier projects and talent.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tBeyond Free IVF is a brave new world with an army of surrogates »\r\n\t\t\t\t\t\t\t\t\t\t« Interest paid on US debt will pass Medicaid in 2019 and Defense in 2023 "}