{"id": "Carnival of Space 583- Quantum Assisted Scope for 10,000 kilometer optical scope\nNextBigFuture.com\n", "paragraph": "The Carnival of Space 583 is up at Universe Today.Universe Today – Next Generation Telescopes Could Use “Teleportation” to Take Better ImagesThe standard technique of locally recording the light at each telescope results in too much noise to work for weak light sources. As a result, all current optical telescope arrays work by combining the light from different telescopes directly at a single measurement station. The price to pay is attenuation of the light in transmission to the measurement station. This loss is a severe limitation for constructing very large telescope arrays in the optical regime (current optical arrays have sizes of max. ~300 meters) and will ultimately limit the resolution once effective stabilization techniques are in place.”A Harvard team – led by Emil Khabiboulline, a graduate student at Harvard’s Department of Physics – suggests relying on quantum teleportation. In quantum physics, teleportation describes the process where properties of particles are transported from one location to another via quantum entanglement. This would allow for images to be created without the losses encountered with normal interferometers.Entanglement, a property of quantum mechanics, allows us to send a quantum state from one location to another without physically transmitting it, in a process called quantum teleportation. Here, the light from the telescopes can be “teleported” to the measurement station, thereby circumventing all transmission loss. This technique would in principle allow for arbitrary sized arrays assuming other challenges such as stabilization are dealt with.Light could be compressed into small quantum memories that preserve the quantum information. Such quantum memories could consist of atoms that interact with the light. Compression into memory would use up significantly fewer entangled pairs compared to memoryless schemes such as the one by Gottesman et al. For example, for a star of magnitude 10 and measurement bandwidth of 10 GHz, our scheme requires ~200 kHz of entanglement rate using a 20-qubit memory instead of the 10 GHz before. Such specifications are feasible with current technology.This method could lead to some entirely new opportunities when it comes to astronomical imaging. For one, it will dramatically increase the resolution of images, and perhaps make it possible for arrays to achieve resolutions that are equivalent to that of a 30 km mirror. In addition, it could allow astronomers to detect and study exoplanets using the direct imaging technique with resolutions down to the micro-arsecond level.A space-based optical telescope on the scale of 10,000 kilometers could be enabled.Arxiv – Quantum-Assisted Telescope ArraysUniverse Today – Even Ganymede is Showing Tectonic Activity. We’re Going to Need Another Icy Moon OrbiterUniverse Today – The Milky Way Could Be Spreading Life From Star to StarChandra X-Ray Space Telescope blog – Milky Way’s Youngest Pulsar Exposes Secrets of Star’s Demise\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tMost powerful supercomputer in Texas by 2019 with new cooling technology »\r\n\t\t\t\t\t\t\t\t\t\t« Anime themed mobile games are huge in China "}