{"id": "Terrestrial Energy Molten Salt nuclear plant regulator review progress\nNextBigFuture.com\n", "paragraph": "Terrestrial Energy’s Integral Molten Salt Reactor (IMSR) has entered the second phase of a vendor design review by the Canadian Nuclear Safety Commission (CNSC). The design was the first advanced reactor to complete the first phase of the CNSC’s regulatory pre-licensing review.Terrestrial Energy aims to commercialize its walkaway safe molten salt modular reactor design in the late 2020s.The use of a molten salt is at the heart of many virtues of the IMSR® and directly leads to IMSR®’s key commercial advantages – a cost-competitive and “walk-away” safe nuclear power plant.The IMSR® uses a fundamentally different reactor technology — a liquid fuel, a molten salt, rather than the solid fuel used exclusively in conventional reactors. This provides a fluid medium to carry a nuclear fuel, a uranium fluoride salt. Molten salts are thermally stable and are excellent heat-transfer fluids, ideal for capturing and dissipating heat from the fission process.An IMSR® power plant generates 400 megawatts of thermal energy (190 MW electric) with a thermal-spectrum, graphite-moderated, molten-fluoride-salt reactor system. It uses standard-assay low-enriched uranium (less than 5 percent 235U) fuel. It incorporates many aspects of Molten Salt Reactor operation researched, demonstrated and proven by test reactors at the Oak Ridge National Laboratory.The IMSR® improves upon earlier Molten Salt Reactor designs by incorporating key innovations that create an industrial reactor ready for commercial deployment.The key challenge to MSR commercialization was graphite’s limited lifetime in a reactor core. Commercial power reactors require high energy densities in the reactor core to be economical, but such high-power densities significantly reduce the graphite moderator’s lifespan. Replacing the graphite moderator is difficult to do safely and economically.The distinct IMSR® innovation is an elegant solution to this problem — integrating the primary reactor components, including the graphite moderator, into a sealed and replaceable reactor core. The IMSR® Core-unit, which has an operating lifetime of seven years, is simple and safe to replace. It supports high capacity factors of IMSR® power plants and hence high capital efficiency. It also ensures that the materials’ lifetime requirements of other reactor core components are met, a challenge often cited as an impediment to immediate commercialization of MSRs.The result is a small modular reactor that delivers a combination of high energy output, simplicity of operation and cost-competitiveness necessary to drive broad commercial deployment.The three-phase pre-licensing process will verify the acceptability of a design with respect to Canadian nuclear regulatory requirements and expectations.Phase 1. a pre-licensing assessment of compliance with regulatory requirementsThis was completed November 2017. CNSC said the company had demonstrated an understanding of the regulator’s requirements applicable to the design and safety analysis of the 400 MWt IMSR, known as IMSR400.Phase 2. an assessment of any potential fundamental barriers to licensingThis is happening now. This involves a detailed follow-up of phase 1 activities, and an assessment of the IMSR design’s ability to meet all 19 focus areas of power plant licensing. It is expected to complete late in 2019.Phase 3. a follow-up phase allowing the vendor to respond to findings from the second phase. In June 2017, Terrestrial Energy began a feasibility study for the siting of the first commercial IMSR at Canadian Nuclear Laboratories’ Chalk River site. In March 2018, Terrestrial and US utility Energy Northwest agreed a memorandum of understanding on the terms of the possible siting, construction and operation of an IMSR at a site at the Idaho National Laboratory in southeastern Idaho.In September 2018, Terrestrial Energy USA partnered with the big utility Southern Company ($46 billion market value) and several US DOE national laboratories to investigate the production of hydrogen using its IMSR. The two-year research and development project will examine the efficiency, design and economics of using the IMSR to produce carbon-free, industrial-scale hydrogen using the hybrid sulfur process.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tOrbits and lighting levels for artificial moon satellite over China »\r\n\t\t\t\t\t\t\t\t\t\t« Puranik CEO of Atlantic.Net validates space based cloud operations "}