{"id": "Orbital Kinetic Bombardment gets close to nuclear on damage and cost\nNextBigFuture.com\n", "paragraph": "As of 2017, the US has an estimated 4,018 nuclear weapons in either deployment or storage. The US plans to spend $1.2 trillion to modernize the nuclear arsenal over the next 30 years. Two-thirds of the nuclear weapons budget will be spent on the operation and maintenance of existing weaponry, while the remaining third will go toward modernizing the technology. $445 billion will be spent on factories, labs, and other infrastructure, while $25 billion will go toward delivery systems that facilitate short-range strikes.The US will spend about $300 million per nuclear weapon on the modernization and maintenance.The first SpaceX BFR could be flying into space in 2023. The SpaceX BFR will be fully reusable and will massively lower the cost of taking cargo to space. SpaceX has already lowered the cost of cargo to space into the $500 to $1000 per pound range using the Falcon Heavy and Falcon 9. Other rockets cost $5000 to 20,000 per pound for payloads to low earth orbit. Each SpaceX BFR could be flying 10-50 times per year. If there the market for launches can be grown with $40-200 per pound launch costs.SpaceX can build about 400 to 500 raptor engines every year. By 2028, there could be a fleet of 50 to 65 BFR. The USA could boost production and buy a separate fleet of 200 SpaceX BFR. If each cost $350 million, then it would cost $70 billion.The US Air Force and Navy looked closely at tungsten rod kinetic energy weapons on several occasions.A 47 page Congressional Research Bureau report Conventional Prompt Global Strike and Long-Range Ballistic Missiles: Background and Issues was written by Amy F. Woolf, Specialist in Nuclear Weapons Policy.If it cost $100 per pound to launch a 12-ton rod then each rod would cost $2.4 million. Tungsten costs about $20 per pound and there are reserves of about 3.5 million tons. There are 90 million tons of lead reserves. Tungsten shells could cover the lead. Lead costs 20 to 70 cents per pound. A fully deployed tungsten rod would be about $3 million each.The Navy considered two types of warheads in the near term for kinetic weapons. One warhead would be designed to destroy or disable area targets like airfields or buildings, using a reentry vehicle loaded with tungsten rods—known as flechettes—that would rain down on the target and destroy everything within an area of up to 3,000 square feet. It seems the 3000 square foot area destruction estimate seems low. If a tungsten cylinder contained 1 pound bullet sized pieces of shrapnel, then there would be about 20,000 fragments inside. Each would be hitting with hypersonic speed. If there was even distribution then they would be hitting 144 X 144 across some area.Each one would hit like a few sticks of dynamite. Each would take out about 30 square feet.So one rod with 144 by 144 pieces would take out about 800 feet by 800 feet.The other might be able to destroy hardened targets, like underground bunkers or reinforced structures, if it were accurate enough to strike very close to the target. Each would be deployed within the reentry body developed and tested under the E2 program. The Navy also explored, for possible future deployment, technologies that might be able to penetrate to destroy hardened, buried targetsThe two primary advantages of a kinetic energy rod warhead is that 1) it does not rely on precise navigation as is the case with “hit-to-kill” vehicles and\n2) it provides better penetration then blast fragmentation type warheads.A 6.1 meter × 0.3 meter tungsten cylinder impacting at Mach 10 has a kinetic energy equivalent to approximately 11.5 tons of TNT (or 7.2 tons of dynamite). Some other sources suggest a speed of 36,000 ft/s (11,000 m/s), which for the aforementioned rod would amount to a kinetic energy equivalent to 120 tons of TNT or 0.12 kt. With 6–8 satellites on a given orbit, a target could be hit within 12–15 minutes from any given time, less than half the time taken by an ICBM and without the warning. Such a system could also be equipped with sensors to detect incoming anti-ballistic missile-type threats and relatively light protective measures to use against them (e.g. Hit-To-Kill Missiles or megawatt-class chemical laser).The higher damage likely involves taking the rods to a far higher orbit. It would likely double fuel cost to get to the higher orbit but the damage would increase ten times.Instead of buying or upgrading a $300 million nuclear weapon, the military could go with one hundred rods at $3 million each.One hundred rods would have a total of 1150 to 14,000 tons of TNT destructive power. One hundred flechette or shrapnel rods would level a two to three square mile area.Orbital pure kinetic energy weapons get around the Hiroshima level of overall devastation. Kinetic weapons are more flexible than nuclear and can have very precise levels of damage.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tHarvard Professor who published speculation of Oumuamua as alien solar sail »\r\n\t\t\t\t\t\t\t\t\t\t« SpaceX Falcon 9 block 5 certified for most important NASA missions "}