{"id": "Asia will be over half of the world economy in 2028\nNextBigFuture.com\n", "paragraph": "Asia is about 60% of the world’s population. There are about 7.7 billion people in the world and 4.6 billion are in Asia.In 2030, the world will have about 8.56 billion and Asia will have nearly 5 billion people.Asian countries are still maintaining GDP growth of 4-8% depending upon the country. This is 1 to 5% faster annual growth than the rest of the world.On a purchasing power parity (PPP) basis, Asia will have 42% of the world economy next year. This is two thirds of the level if the people in Asia had the average world income level. On an exchange rated basis, Asia will have 33% of the world economy next year. This is a little over half of the level if Asia had the average world income level.There has been huge progress from prior years and decades.Based upon the IMF projections for 2023, Asia will move up to 45% of the world economy based on PPP and to 35% of the world on an exchange rated basis. Asia will be picking up nearly a percentage point of world economic share for PPP. Asia will surpass 50% of the world economy in PPP around 2028.On an exchange rated basis, Asia will not get to 50% of the world economy until about 2040.Asia’s share of world population will drop to about 55% around 2040.In the 2050s, Asia will pass the overall average world income level.Africa will be adding 300 to 400 million people every decade. Most of the people in Africa will still be very poor.The IMF has projections of GDP (gross domestic product) both in nominal exchange rated terms and in purchasing power parity terms.China and India dominate with around 60-66% of the population and 60-70% of purchasing power parity GDP.China and India dominate with around 56-65% of nominal GDP.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tSpaceX Falcon 9 block 5 certified for most important NASA missions »\r\n\t\t\t\t\t\t\t\t\t\t« California’s big fires and 129 million dead trees "}