{"id": "Quantum mechanics time travel indicates no grandfather paradox\nNextBigFuture.com\n", "paragraph": "Dr. Seth Lloyd, an MIT professor and self-described “quantum mechanic,” describes the quantum mechanics behind time travel during a guest lecture at the Institute for Quantum Computing, University of Waterloo. Recorded on Nov. 4, 2010, this is the entire lecture entitled “Sending a Photon Backwards in Time.”Wheeler has the physics theory that positrons are electrons going backwards in time.The early part of the talk is a lot about the many time travel stories.Lloyd indicates that all the stories fall into either the many worlds version or the consistent history version. The consistent history version is that you cannot alter the past in ways that you know are not true.Here is where he starts talking about his theory and the theoretical basis in more detail.Quantum teleportation experiments had 80% fidelity but this was post selected for success. Overall fidelity was 11%.Here is where he talks about their particle quantum experiments.In a post selected sense this is time travel.\nThey create a singlet and then make measurements.\nThe photon never manages to kill itself in the past.y Seth Lloyd approach to time travel is based upon post-selection and path integrals. In particular, the path integral is over single-valued fields, leading to self-consistent histories. He assumed it is ill-defined to speak of the actual density state of the CTC itself, and we should only focus upon the density state outside the CTC.No solution exists due to destructive interference in the path integral. For instance, the grandfather paradox has no solution, and leads to an inconsistent state. If a solution exists, it is clearly unique. Now, quantum computers using time machines can only solve PP-complete problems.Arxiv – The quantum mechanics of time travel through post-selected teleportation (2010)The paper discusses the quantum mechanics of closed timelike curves (CTCs) and of other potential methods for time travel. We analyze a specific proposal for such quantum time travel, the quantum description of CTCs based on post-selected teleportation (P-CTCs). We compare the theory of P-CTCs to previously proposed quantum theories of time travel: the theory is physically inequivalent to Deutsch’s theory of CTCs, but it is consistent with path-integral approaches (which are the best suited for analyzing quantum field theory in curved spacetime). We derive the dynamical equations that a chronology-respecting system interacting with a CTC will experience. We discuss the possibility of time travel in the absence of general relativistic closed timelike curves, and investigate the implications of P-CTCs for enhancing the power of computation.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tSpaceX reusable rockets are better than hypersonic missiles and planes »\r\n\t\t\t\t\t\t\t\t\t\t« Ocean Solutions are key to solving Climate Change "}