{"id": "Pets vs Pet bots vs Smart Speakers\nNextBigFuture.com\n", "paragraph": "Sony has tried to merge pet dogs with smart speakers in the $2899 new version of the Aibo robot dog. Here we will compare pet dogs and cats vs pet bots vs smart speakers.Smart speakers have reached sales of 9 million devices per quarter. Home speakers sell for about $30-200 each. Google has surpassed the Amazon Echo in sales.It seems that people want the utility of being able speak, get answers and control lights and other appliances more than just an AI simulation of a pet.Sony has updated its Aibo robot dog with new artificial intelligence and it costs about $2899. Sony sold a total of 150,000 of the previous models and has sold about 11,000 in the first three months of its new release.The new Sony Aibo odes have smart home device features and can like a four-legged Amazon Echo, or Google Home with a wagging tail.Dogs and cats tend to cost $1000 in the first year and $500 per year thereafter. Live pets are also more likely to damage your home.In the USA there are 85 to 95 million pet cats versus nearly 80 to 90 million pet dogs. In the world, there are about 400-600 million pet cats and 300 to 500 million pet dogs. The numbers of pet dogs and cats are rapidly increasing in Asia.There were many novelty stuff toys with electronics in the $10-40 price range. Although some sell as collectibles for $100-500. There are about 15 million small animal pets in the USA which include a variety of animals like hamsters, mice and turtles.More than 76 million Tamagotchi were reportedly sold after it was launched in Japan in November 1996. The Furby was bought by more than 40 million people from 1998-2001. Robotic hamsters from ZhuZhu Pets surpassed sales of more than 70 million from 2008-2012.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tRussian catamaran aircraft carrier would have good air power for size »\r\n\t\t\t\t\t\t\t\t\t\t« Whats next for megaregion integration after Hong Kong Superbridge? "}