{"id": "Future of Quantum Computing from Giant and Pioneer in the field\nNextBigFuture.com\n", "paragraph": "Seth Lloyd contributed a lot of the basic science and theory of a lot of Quantum computing. Seth developed the design of adiabatic computing in 2002 which was implemented by D-Wave Systems in 2006 and continues to be a growing commercial business. David Deutsch is called the Father of Quantum Computing but Seth Lloyd has done a lot. Deutsch invented the idea of the quantum computer in the 1970s and mid-1980s as a way to experimentally test the “Many Universes Theory” of quantum physics – the idea that when a particle changes, it changes into all possible forms, across multiple universes. David Deutsch is now working on quantum constructor theory. He is trying to derive the very nature of reality from quantum computing.Seth Lloyd had a more detailed proposed for building quantum computers in 1993. He wrote some of the first quantum algorithms.\nSeth Lloyd and Jeff Kimball worked on the first DARPA grant on quantum project in 1994.\nPeter Shor developed his number factoring and crypto algorithm in 1994. This unleashed a larger first wave of funding and effort from DARPA and the NSA.Quantum pattern recognition can improve machine learning pattern recognition. Quantum Machine learning is a rapidly growing field. Currently Google, Facebook and the NSA use pattern recognition to spy on us.DARPA and Seth Lloyd looked at quantum effects for photosynthesis and energy transport. They now have energy transport that is far more efficient than anything in nature.He is researching Quantum Gravity and trying to understand the quantum nature of the Universe.IBM, Google, NEC on Japan, Intel are all investing heavily in quantum computing. Rigetti is a startup that is dedicated to quantum computing. D-Wave Systems has developed and is selling quantum annealing systems.China, Canada, Singapore, and Europe (Delft, University of Vienna, Oxford, Cambridge and other locations) are doing very interesting work. Canada’s Waterloo institute is doing a lot of great quantum computing research work.Seth sees the current stage of Quantum as being in the punched card stage of the 1950s for digital computers.Seth sees quantum computers being highly useful at 500 qubits. Some improvement in reducing the error rate of qubits from 1 in 100 for the Google 72 qubit Bristlecone to 1 in 500 for a future system. Seth Lloyd does believe there will eventually be quantum microchips in future smartphones. This could be worth it for secure encryption. This will take a long time because of the need to cool the quantum chips.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tIBM proves a quantum computing advantage over classical »\r\n\t\t\t\t\t\t\t\t\t\t« Lighting up a megacity at night will lead to night solar farm lighting "}