{"id": "SpaceX reusable rockets are better than hypersonic missiles and planes\nNextBigFuture.com\n", "paragraph": "All major militaries and nations are scrambling to develop hypersonic missiles, drones and aircraft. The US, Russia, China are spending billions to develop and deploy hypersonic missiles. Japan, India, Australia and Europe also are working on such systems.Putin has again stated that Russia will have more new hypersonic missiles deployed.Why do hypersonic missiles matter? They are mach 5+ but they are slower than ICBMs. ICBM (Intercontinental Ballistic Missiles) have been going at Mach 25-30 since the late 1950s.Hypersonic missiles can fly in different flight profiles. They do not go in a big predictable arcs but can fly low and flat and move around. The world does not have good and proven ICBM defenses. The hypersonic missiles will be tougher to stop.China and Russia are deploying a few hypersonic missiles now. They sit on regular rockets and then get up to mach 5+ with a regular rocket and then detach and change their flight. An all-in-one single non-rocket hypersonic system would need three engines. They need a turbine engine to get up to about mach 3 and then a ramjet to get from mach 3-5 and then a scramjet to go mach 5+.Japan has targeted development by 2026 and 2028 for new hypersonic missiles.The US Air Force previously had the following timetable for hypersonic weapons. They wanted hypersonic planes in 2040+.SpaceX reusable rockets are superior to most of the hypersonic planes that are targeted for 2040-2050.SpaceX already has reused first stages. SpaceX rockets go up to mach 30.Reusable rockets are much, much faster. SpaceX hypersonic reusable rocket capabilities will give the US hypersonic plane capabilities 20 years earlier with faster speeds. Blue Origin in the USA, China, Japan and Europe are working on reusable rockets.Blue Origin and China have sub-orbital versions of reusable rockets. Those suborbital systems would repeatedly fly to around mach 10 to 15. Even suborbital systems are faster than most of the hypersonic planes targeted for 2040 and are faster than the current missiles deployed from military jets in Russia.The hypersonic missiles that currently exist have ranges of 1000 miles or less and even after adding the range of military jet, the range is only 4000 miles or less.Reusable rockets can go orbital and go anywhere on Earth.SpaceX is working on a system to recover the faring (nose cones) and for the current second stage. SpaceX is developing a fully reusable SpaceX BFR and BFS system for first test flights in 2019 and orbital flights around 2021 and commercial completion around 2023.SpaceX has titanium hypersonic grid fins. They alter the flight of the rocket. Other control surfaces are possible for adjusting rocket flight.SpaceX has retrorockets for landing reusable rockets. Again the flight paths can be massively changed. SpaceX has shown that they can relight their rockets for multiple burns that are more dependent upon the amount of fuel.The massive payload capacity means that additional weight could be used to shield a military version of a reusable rocket.SpaceX has talked about flying anywhere on Earth like New York to Singapore for hypersonic passenger flights. They have talked about flying, landing and reflying ten times per day with a SpaceX BFR before 2030. They have talked about reflying a Falcon 9 within 48 hours in 2019. They have talked about getting this down to 24 hours by just moving and refueling a landed Falcon 9. In theory, a more capable droneship (motorized barge) could meet up with a tanker drone ship for refueling and a Falcon 9 could relaunch at sea by transferring to and at sea launch platform. There was a Sea Launch company.Hypersonic deployment of many hypersonic missile tips would be like the multiple independently targetable reentry vehicle (MIRV) used in ballistic missiles since the 1960s.Reusable rockets can do or easily enable everything desired of hypersonic drones and hypersonic planes. Fly at hypersonic speed and return for reuse. By having the drone get to hypersonic speed it would not need turbine or ramjet engines. A simpler hypersonic only engine and a controlled landing and recovery method would be required.Hypersonic planes could be deployed by taking the boost and glide systems under development now where hypersonic wing surfaces enable the flatter flight profile.Reusable rocket engines could be throttled for different speeds. More fuel could be used for suborbital movement and flight changes instead of going to orbit. Not having maximum payload would save fuel for dodging movement or less predictable paths.Reusable rockets would be the flexible deployment platform for simpler hypersonic drones and missiles.  The USA has been gifted with complete space dominance via Spacex fully reusable rockets. The US already has superior space capabilities versus other countries. The developer of the likely second place solution is Blue Origin.In Elon Musk’s video announcement of the Spacex BFR he indicated that it would be lower cost to launch than the Spacex Falcon 1. A graphic showed the Spacex BFR at lower cost than the Falcon 1.In 2005 Falcon 1 was advertised as costing $5.9 million ($7.3 million when adjusted for inflation in 2015). In 2006 until 2007 the quoted price of the rocket when operational was $6.7 million. In late 2009 SpaceX announced new prices for the Falcon 1 and 1e at $7 million and $8.5 million respectively, with small discounts available for multi-launch contracts.This would mean at $7 million the Spacex BFR launch 100 tons would have less than a $100 per pound launch cost.By 2025, there could be a fleet of 100 BFR. Each could be flying 10-50 times per year if there the market for launches can be grown with $60-300 per pound launch costs.The USA could triple that production and buy a separate fleet of 200 Spacex BFR. If each cost $200 million, then it would cost $40 billion. This would be less than the planned spend for the Space Launch System which would have one or two flights per year. The USA could fly each 50 times and get 10,000 launches per year. For $7 million each flight that would be $70 billion per year to operate at maximum capacity.The US already spends $40 billion on spy satellites and military space program. Fully leveraging Spacex BFR fleet would mean the trivial deployment of Project Thor plus the ability to have a space corp of a hundred thousand or more people permanently station in various orbits, the moon, cislunar and other locations.Undersecretary Griffin said the only real way to reliably track hypersonic weapons is from space, beyond the horizon limits of terrestrial radars. Hypersonics are about a factor of 10 dimmer than strategic ballistic missiles so they cannot be monitored from a high orbit.Experimental aircraft with the prototype low Earth orbit (LEO) Space Tracking and Surveillance System (STSS) satellites show hypersonic tracking is possible and is not a technology challenge. There is a policy-decision-making challenge to decide about a LEO space layer sensor layer.The US Missile Defense Agency and Defense Department have started designing space-based missile interceptors and space sensor that will be used for missile defenses and hypersonic defense.The US military (Undersecretary Michael Griffin) has talked about spending $20 billion for a network of a thousand hypersonic missile interceptors. $20 billion is just the low ball bait. Even if an initial system went up for that price or less, they will rapidly increase the scope and scale.DARPA is developing the basic technology for a lot more small space satellites.Mr. Paul “Rusty” Thomas, Program Manager, DARPA Tactical Technology Office presented at the Future In-Space Operations (FISO) Working Group Telecon. He described the “DARPA Blackjack Demo Program – Pivot to LEO & Tactical Space Architecture”. This would be 90+ low-earth orbit spy satellites. DARPA plans a 20 satellite demo and then full deployment could start in 2022.Many low-earth orbit spy satellites would be tougher for Russia and China to take out. A constellation of low-earth orbit spy satellites could be less expensive and more powerful than a single larger geosynchronous satellite.Kinetic orbital strike (rods from god) is the hypothetical act of attacking a planetary surface with an inert projectile, where the destructive force comes from the kinetic energy of the projectile impacting at very high velocities.Project Thor is an idea for a weapons system that launches telephone pole-sized kinetic projectiles made from tungsten from Earth’s orbit to damage targets on the ground. Jerry Pournelle originated the concept while working in operations research at Boeing in the 1950s before becoming a science-fiction writer.The system most often described is “an orbiting tungsten telephone pole with small fins and a computer in the back for guidance”. The system described in the 2003 United States Air Force report was that of 20-foot-long (6.1 m), 1-foot-diameter (0.30 m) tungsten rods, that are satellite-controlled, and have global strike capability, with impact speeds of Mach 10.The time between deorbit and impact would only be a few minutes, and depending on the orbits and positions in the orbits, the system would have a worldwide range. There would be no need to deploy missiles, aircraft or other vehicles. Although the SALT II (1979) prohibited the deployment of orbital weapons of mass destruction, it did not prohibit the deployment of conventional weapons. The system is not prohibited by either the Outer Space Treaty or the Anti-Ballistic Missile Treaty.The idea is that the weapon would naturally contain a large kinetic energy, because it moves at orbital velocities, at least 8 kilometers per second. As the rod would approach Earth it would necessarily lose most of the velocity, but the remaining energy would cause considerable damage. Some systems are quoted as having the yield of a small tactical nuclear bomb. These designs are envisioned as a bunker buster. As the name suggests, the ‘bunker buster’ is powerful enough to destroy a nuclear bunker. With 6–8 satellites on a given orbit, a target could be hit within 12–15 minutes from any given time, less than half the time taken by an ICBM and without the launch warning. Such a system could also be equipped with sensors to detect incoming anti-ballistic missile-type threats and relatively light protective measures to use against them.In the case of the system mentioned in the 2003 Air Force report above, a 6.1 m × 0.3 m tungsten cylinder impacting at Mach 10 has a kinetic energy equivalent to approximately 11.5 tons of TNT (or 7.2 tons of dynamite). The US Space fleet could clean up the 500,000 pieces of space debris (20,000 pieces larger than a softball) and could hold the space debris in a space station warehouse. The junk would then also be able to formed into junk rods. A  thousand smaller rods could be produced without having to fly specifically dedicated tungsten rods. This would be a very credible anti-missile system and a deterrent to any trivial nuclear missile capability from Iran and North Korea. It would also mean that Russia and China’s nuclear ICBMs would be less valuable militarily. Russia and China would have to depend upon nuclear armed submarines and submarine drones. Plus they would have to develop comparable reusable rocket capability.Russia would still be able to use underwater nuclear weapons to create tsunami attacks. Also, near shore submarine launched attacks would be pretty quick and tough to defend even for Project Thor.The only reasons not to upgrade to this kind of space capability are1. Corruption where they choose to have a weaker capability so they can continue to pay Lockheed and established contractors\n2. Utter incompetence and inability to break out of old thinking\n3. Wanting to not go to the next levels and stick with existing “unsolvable problems”\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tPuranik CEO of Atlantic.Net validates space based cloud operations »\r\n\t\t\t\t\t\t\t\t\t\t« Quantum mechanics time travel indicates no grandfather paradox "}