{"id": "SpaceX Falcon Heavy and NASA crewed launches will fund BFR development\nNextBigFuture.com\n", "paragraph": "If SpaceX gets lucky the BFR development costs could come in at the $2 billion low-end estimate. Elon Musk had estimated that it would cost $2 billion to 10 billion to develop. A few more critical successes over the next year will enable SpaceX to solidify the finances and funding for the BFR. The needed critical successes are the NASA crewed launch certification in mid-2019 and successful Falcon Heavy launches in 2019.SpaceX has pre-sold a moon orbit tourist flight to a Japanese billionaire. This was likely for $500 to $800 million. The SpaceX Falcon Heavy already has up to seven launches lined up. Commercial and government launch buyers are seeing the value in using the larger rocket to directly place satellites in geosynchronous orbit. Continued launch success in 2019 could bring the Falcon Heavy to five or six launches per year.SpaceX should become certified for NASA crewed launches in mid-2019. SpaceX will make about $300 million for each of those launches.The $2 billion lowball estimate for the BFR development must include\n* completing the raptor engine\n* building one full BFR rocket\n* preparing the test launch site\n* all sub-orbital testing\n* preparing the launch site and landing sites\n* a successful 18-24 month orbital testing programIf the SpaceX BFR succeeds on its first orbital like the SpaceX Falcon Heavy, then the cost of BFR development will be in the $2 billion to $2.5 billion range.Costs would go up if there were challenges completing the final design and construction of the BFR or in the testing phases.SpaceX is arranging a $500 million loan via Goldman Sachs. SpaceX could afford another $2 billion in loans with firm Falcon Heavy revenue and the NASA crewed launch revenue.SpaceX Project Making Progress at Boca Chica Beach Site https://t.co/LP5JJU3TNI— Michael Scott Iliopoulos (@krgv_mike) October 26, 2018\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tHyperpolarized quantum MRI increases sensitivity 100,000 times »\r\n\t\t\t\t\t\t\t\t\t\t« IBM buys Red Hat for hybrid cloud dominance "}