{"id": "The World and the rest of your life if you are an adult now\nNextBigFuture.com\n", "paragraph": "How will the world change for the rest of your life if you are an adult now?Here we consider super-technology, debt, growth, jobs and living the next 45 years.We will likely remain in a ramping up phase for the next 15 years. The exact timing will vary by country, industry and major breakthroughs or breakdowns.If you are around 50 then the challenges of reaching a financial position for a good retirement will remain the same. Every 6 to 11 years there has been a recession in the USA. There will be one to three recessions before retirement.The global unemployment rate has been stabilizing after a rise in 2016. It is about 5.6% in 2017. The total number of unemployed exceeding 192 million persons.Certain African and middle eastern countries have unemployment in the 15-25% range and few have 26-50% unemployment.Europe has Greece and some other countries have 12% to 20% unemployment. Overall the EU has 6.8% unemployment.Interest rates in the US are returning to 4% levels. After the Great Recession, interest rates were at about zero for many years.US interest payments on over $20 trillion in debt will reach $1 trillion per year. This will be out of a total of about $5 trillion in federal revenue.Increasing debt will make it difficult to provide more money for medical and social benefit programs.Establishing social security and corporate pensions took decades.Four important demographic changes started in America from the mid-1880s through the 1930s that made the traditional systems of economic security increasingly unworkable:– The Industrial Revolution\n– The urbanization of America\n– The disappearance of the “extended” family\n– A marked increase in life expectancyAlthough Social Security was passed in 1935. It took a long time to scale up.The number of Social Security beneficiaries grew from about 222,000 at the end of 1940 to over 3 million in 1949. Average monthly benefits grew only slightly from $22.60 for a retired worker in 1940 to $26 at the end of the decade. This was less than the rate of inflation. By 1960, the old-age, survivors, and disability insurance (OASDI) programs were essentially in place as we know them today. Coverage under the program had been made nearly universal. Virtually all people reaching retirement age in the decades to come would be able to establish benefit eligibility. Even if universal basic income came into existence it would be minimal. Debt foregiveness might happen. It would be foolish to count on some form of government rescue for your personal situation.The smarter move is to limit the amount of debt. Limit or avoid student loans for yourself or your children. Avoid other forms of debt. Get income generating assets. Global sales of industrial robots reached the new record of 387,000 units in 2017. That is an increase of 31 percent compared to the previous year (2016: 294,300 units). China saw the largest growth in demand for industrial robots, up 58%. There will be about 630,000 industrial robots installed by 2021. The number of installed robots will nearly double from 2 million in 2017 to 4 million by 2021. South Korea has over 6 robots per 100 workers. China robot density rate rose from 25 units in 2013 to 68 units in 2016. China targets 1.5 robots per 100 workers in 2020.  By 2020, China is expected to produce 150,000 industrial robot units and have 950,300 industrial robots in operation. China has about 60 million manufacturing workers. China is installing double the number of robots it produces. China is buying foreign robots. Nearly 300,000 robots will be added in China by 2020. Over a million robots could be added by 2025. China could have 5 million robots by 2025. This would be near the current South Korean level of Robots. South Korea will reach 10 robots per 100 workers by 2025.AI and robotics and factory breakthroughs could increase the robots per workers to 15 to 30 per 100 in the 2030-2035 timeframe. The number of human workers will decline as automation displaces them. The 2040-2050 timeframe could see 40-100 robots per human worker. Beyond 2050, the predominant situation would be more robots than human workers. 2 robots per human and even 20 robots per human.Significant life extension and medical advancement seems likely. Genetic engineering of adults will be as simple as injecting gene altering materials.Plan on remaining involved in whatever the transformed production and value adding efforts are.Acquire and maintain expertise in a useful area.Gain a good reputation with others. Ideally with those with wealth, power and influence.Gain greater power and influence for yourself.Gain wealth and income that is diversified. Future diversification means major shift with AI or technology or jobs or companies or industries will not take out all of your wealth and income.Another strategy would be to become debt free while owning an acceptable house and income generating asset as soon as possible. This would where you could transition to a jobless mode without major difficulty.There are effective debt reduction methods  and overall plans to get rid of all debts.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tSpaceX is having another successful launch »\r\n\t\t\t\t\t\t\t\t\t\t« DARPA Laser radar can see wind 8.6 miles away and enables permanent balloons "}