{"id": "10-qubit quantum integrated circuit prototype in silicon by 2022\nNextBigFuture.com\n", "paragraph": "The Silicon Quantum Electronics Workshop will have 200 researchers sharing insights and technology advancements about building the world’s first silicon quantum computer.Silicon Quantum Computing Pty. Ltd. (SQC) is working to create and commercialize a quantum computer based on world-leading intellectual property acquired from the Australian Centre of Excellence for Quantum Computation and Communication Technology (CQC2T).\nWe have set ourselves a bold ambition: to develop a 10-qubit quantum integrated circuit prototype in silicon by 2022.SQC currently has parallel platforms for creating a silicon-based quantum computer using atomically engineered phosphorus donors, quantum dots using CMOS technology and hybrids.There are currently five major approaches to quantum computing. Silicon spins, trapped ions, and superconducting transmons represent three of the leading approaches for quantum computing.There are quantum computing models, distinguished by the basic elements in which the computation is decomposed. The four main models of practical importance are:* Quantum gate array (computation decomposed into a sequence of few-qubit quantum gates)\n* One-way quantum computer (computation decomposed into a sequence of one-qubit measurements applied to a highly entangled initial state or cluster state)\n* Adiabatic quantum computer, based on quantum annealing (computation decomposed into a slow continuous transformation of an initial Hamiltonian into a final Hamiltonian, whose ground states contain the solution)\n* Topological quantum computer (computation decomposed into the braiding of anyons in a 2D lattice)The quantum Turing machine is theoretically important but the direct implementation of this model is not pursued. All four models of computation have been shown to be equivalent; each can simulate the other with no more than polynomial overhead.Adiabatic superconducting quantum computing – D-Wave SystemsFor physically implementing a quantum computer, many different candidates are being pursued, among them (distinguished by the physical system used to realize the qubits):Superconducting quantum computing (qubit implemented by the state of small superconducting circuits (Josephson junctions))\nTrapped ion quantum computer (qubit implemented by the internal state of trapped ions)\nOptical lattices (qubit implemented by internal states of neutral atoms trapped in an optical lattice)\nQuantum dot computer, spin-based (e.g. the Loss-DiVincenzo quantum computer) (qubit given by the spin states of trapped electrons)\nQuantum dot computer, spatial-based (qubit given by electron position in double quantum dot\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tNASA may try to kill SLS around 2022 after another $16 billion is spent »\r\n\t\t\t\t\t\t\t\t\t\t« Controlling genome editing with nanomagnets "}