{"id": "China’s giant ultra-high voltage grid is ambitious as its high speed rail\nNextBigFuture.com\n", "paragraph": "Ultra-high voltage energy grids are needed for efficient power transmission across large distances.A 100 mile (160 km) power line at 765 kilovolt carrying 1000 MW of power can have losses of 1.1% to 0.5%. A 345-kilovolt line carrying the same load across the same distance has losses of 4.2%. China’s 1.1 megavolt line can have power losses that 10 to 20 times less than 345 kilovolt lines.ABB helped create the 1.1 megavolt transformers and key equipment for world’s first 1,100 kilovolt (kV) project in China. When fully operational the UHVDC link will be capable of transporting 12,000 megawatts of electricity over a distance of 3,000 km from the Xinjiang region in the Northwest, to Anhui province in eastern China. This vast amount of electricity is equivalent to twice the average annual power consumption of Switzerland.China’s State Grid company switched on its first million-volt alternating current line in 2009 and the world’s inaugural 800,000-volt direct current line in 2010. State Grid is now by far the world’s biggest builder of these lines. By the end of 2017, 21 ultra-high-voltage lines had been completed in the country, with four more under construction.If the world wants to move energy around on a continental scale then ultra-high voltage grids are needed.China’s high voltage grid will be nearly 23,000 miles long. It will be able to deliver about 150 gigawatts of electricity. This is roughly the output of 150 nuclear reactors. At the end of 2017, China had invested least 400 billion yuan ($57 billion) into the projects. In September, China said it will sign off on 12 new ultra-high-voltage projects by the end of 2019.In a study published in Nature in 2016, Clack found that using high-voltage direct-current lines to integrate the US grid could cut electricity emissions to 80% below 1990 levels within 15 years. Chairman Zhenya served as Chairman and CEO of China State Grid (the world’s largest electric utility) from 2004 to 2016 and currently serves as Chairman of Global Energy Interconnection Development and Cooperation Organization (GEIDCO) and Chairman of the China Electricity Council (CEC). Zhenya has described how China plans to connect China and Asia with a massive ultra-high voltage energy grid. State Grid has signed a deal with Korea Electric Power, Japan’s Softbank, and Russian power company Rosseti to collaborate on the development of a Northeast Asian supergrid connecting those nations and Mongolia.Feasibility studies show that grid connections between Mongolia, China, Korea, and Japan, as well as a route between Russia and Japan, are both technically and economically feasible.China could place coal or nuclear power generation in the Gobi desert and then transmit the power to Korea, Japan and the coastal areas of China. Natural gas power could be generated by Russia in Siberia and transmitted to other countries in Asia. Massive solar and wind farms could also be built in Mongolia and Siberia.Less than half of the ultra-high-voltage lines built or planned to date in China are intended to transmit electricity from renewable sources, according to a late-2017.State Grid’s main target markets are in poor countries where fossil-fuel plants dominate and Chinese companies are busy building hundreds of new coal plants. So there’s little reason to expect that any ultra-high-voltage lines built there would primarily carry energy from renewable sources anytime soon.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tTerrestrial Energy is a leader in commercializing next gen nuclear technology »\r\n\t\t\t\t\t\t\t\t\t\t« AMD makes first 7 nanometer CPU and GPU and performance competitive with Nvidia "}