{"id": "Nanomembrane based tech can replace Haber-bosch process that feeds world\nNextBigFuture.com\n", "paragraph": "Fixation of Nitrogen (N2) to Ammonia (NH3) is an essential process for maintaining life on earth. Currently, Ammonia (NH3) production is dominated by the Haber–Bosch process. It operates under conditions of high temperature 400–500 °C and pressure 200–250 bar, and its production has a huge carbon footprint. The H2 precursor, usually obtained by steam reforming of methane, also has a very large carbon footprint. Notably, the entire energy required to prepare the reagents and to operate the Haber-Bosch process amounts to 1–3% of the global energy supply. In stark contrast, in the natural world, plants and bacteria have been producing NH3 from N2 and solvated protons under ambient conditions, enabled by the FeMo cofactor of the metalloenzyme nitrogenase (N2 + 6H+ 6e-→2NH3). Inspired by this biological nitrogen fixation process, intensive efforts have been devoted to finding ways to mimic the process under similarly mild conditions.The Haber-Bosch process uses a catalyst or container made of iron or ruthenium with an inside temperature of over 800̊F (426̊C) and a pressure of around 200 atmospheres to force nitrogen and hydrogen together. The elements then move out of the catalyst and into industrial reactors where the elements are eventually converted into fluid ammonia (Rae-Dupree, 2011). The fluid ammonia is then used to create fertilizers.80 percent of the global increase in consumption of nitrogen fertilizers between 2000 and 2009 came from India and China.Bread from the Air Haber-Bosch Process allowed for population growthToday chemical fertilizers contribute to about half of the nitrogen put into global agriculture and this number is higher in developed countries.To this end, the electrocatalytic N2 reduction reaction (NRR) conducted in an aqueous media has recently been receiving increasing attention. This approach offers multiple merits:\n(i) use of water as the hydrogen source,\n(ii) operation under ambient conditions, and\n(iii) utilization of renewable electricity to drive the processFor the first time that hierarchically structured nitrogen-doped nanoporous carbon membranes (NCMs) can electrochemically convert N2 into NH3 at room temperature and atmospheric pressure in an acidic aqueous solution. The Faradaic efficiency and rate of NH3 production using the metal-free NCM electrode in 0.1 M HCl solution are as high as 5.2% and 0.08 g m2 h-1, respectively. Upon functionalization of the NCM electrode with Au nanoparticles (Au NPs), the efficiency and rate are boosted to a remarkable 22% and 0.36 g m-2 h-1, respectively. These performance metrics are unprecedented for the electrocatalytic production of NH3 from N2 under ambient conditions. Arxiv – Efficient Electrocatalytic Reduction of CO2 by Nitrogen-Doped Nanoporous Carbon/Carbon Nanotube Membranes: A Step Towards the Electrochemical CO2 RefineryAmmonia, key precursor for fertilizer production, convenient hydrogen carrier and emerging clean fuel, plays a pivotal role in sustaining life on earth. Currently, the main route for NH3 synthesis is via the heterogeneous catalytic Haber-Bosch process (N2+3H2 – 2NH3), which proceeds under extreme conditions of temperature and pressure with a very large carbon footprint. Herein we report that a pristine nitrogen-doped nanoporous graphitic carbon membrane (NCM) can electrochemically convert N2 into NH3 in an aqueous acidic solution under ambient conditions. The Faradaic efficiency and rate of production of NH3 on the NCM electrode reach 5.2% and 0.08 g m-2 h-1, respectively. After functionalization of the NCM with Au nanoparticles (Au NPs) these performance metrics are dramatically enhanced to 22% and 0.36 g m-2 h-1, respectively. These efficiencies and rates for the production of NH3 at room temperature and atmospheric pressure are unprecedented. As this system offers the potential to be scaled to industrial proportions there is a high likelihood it might displace the century-old Haber-Bosch process.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tThe World in one hour – 3000 SpaceX BFRs by 2045 »\r\n\t\t\t\t\t\t\t\t\t\t« Austria will let electric cars drive faster, use bus lanes and get free parking "}