{"id": "Whats next for megaregion integration after Hong Kong Superbridge?\nNextBigFuture.com\n", "paragraph": "China wants every part of the Pearl River Delta region commutable within about one hour. They have just opened the longest sea-crossing bridge in the world to connect Hong Kong, Macau and Zhuhai as part of this plan. China will triple the subway track in the area by 2030. The Shenzhen–Zhongshan Bridge is a bridge under construction. It will connect two major cities on the Pearl River Delta (PRD) in China: the city of Shenzhen on the eastern side of the PRD, and the city of Zhongshan on the western side. It will consist of a series of bridges and tunnels, starting from Bao’an International Airport on the Shenzhen side. The proposed 51 km eight-lane link is scheduled to be completed in 2024 and is expected to cost around US$4.83 billion. It will be located about 27 km downriver from the Humen Bridge, the only current bridge crossing of the delta, and some 32 km north of the new Hong Kong–Zhuhai–Macau Bridge. Shenzhen had lobbied hard in the early 2000s to be included in the Hong Kong–Zhuhai–Macau Bridge project by choosing a double-Y-shaped design with one of the extensions connecting Shenzhen to the structure.The Shenzhen–Zhongshan Bridge project will consist of a 6.7 km tunnel starting on the Shenzhen side, and 19 bridges totaling 43 km. Construction started in late 2016 and scheduled to open in 2024. There will be four lanes in each direction, with a maximum speed of 100 km/h. The bridge will join the Guangshen Coastal Expressway to the south of Shenzhen’s airport and the Jihe Expressway to the east of the airport on the Eastern side of the delta with the Zhongjiang Expressway on the Western side. It will cut travel time from Shenzhen to Zhongshan to less than 30 minutes.By 2030, the PRD region will have more subway track than the Greater Tokyo area and over ten times the New York transit system.There are 11 major cities in an area over three times the size of the Greater Tokyo metro area. The Pearl River Delta (PRD) currently has a population of 67 million and a GDP of over $1.2 trillion. By 2030, the PRD is expected to reach 80 million with a GDP of $2 trillion by 2030. By 2030 the GDP purchasing power parity of the PRD megaregion will be $4.6 trillion, making it larger than the economies of rival bay areas in Tokyo, New York, and San Francisco.Currently Hong Kong to Guangzhou high-speed rail currently takes 50 minutes.Hong Kong is only the fifth largest city in the PRD by population. Guangzhou has twice the population and Shenzhen also has nearly twice the population. Guangzhou, Shenzhen and Zhouhai have about half the per capita income of Hong Kong.The PRD megaregion has more buildings over 150 meters (492 ft) than any country in the world except China and the USA. There is already 356 kilometers of high-speed rail track in the area which makes it the 14th longest high-speed rail system in the world. The combined length of the subway metro systems in the PRD megalopolis exceeds every country in the world except the US, Japan, South Korea, and Russia.The Shenzhen Metro currently has eight lines, 166 stations, and 286 kilometers (178 miles) of total trackage in operation.Two new lines and extension of several existing lines are underway with a long-term goal of 1,124 kilometers (698 miles) of lines by 2030. This will allow for travel between the central and suburban districts to be shortened to 45 minutes and for public transit to make up more than 70% of all motorized trips in Shenzhen.The system underwent another major expansion with the opening of Line 11 in June 2016 and both Lines 7 and 9 in October 2016, briefly making the system the third longest in China before Guangzhou Metro regained the position in December 2016. In January 2018, construction work started on a further four new metro lines (Lines 12, 13, 14, and 16) and a branch of Line 6. The latter will connect with the neighboring Dongguan Metro. The additional lines have a projected cost of 160 billion Yuan with a planned completion date of 2022. With the initiation of construction of Phase IV lines total construction mileage for the Shenzhen Metro reaches 273 kilometers (170 miles).There will be connections made and created between the subways systems of the different cities.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tPets vs Pet bots vs Smart Speakers »\r\n\t\t\t\t\t\t\t\t\t\t« NASA picks SSL to develop key fuel depot technology "}