{"id": "2009 Honduran constitutional crisis and today\nNextBigFuture.com\n", "paragraph": "In political science, the term banana republic describes a politically unstable country with an economy dependent upon the exportation of a limited-resource product, such as bananas or minerals. Honduras is the poster-country that defines the term banana republic.There is some history and economics relevant to the Caravan of people from Honduras. Venezuela and Cuba have been deeply involved in Honduran politics.Honduras is the second poorest country in Central America. It has extremely unequal distribution of income and high underemployment. It has been dependent on the export of bananas and coffee, Honduras has diversified its export base to include apparel and automobile wire harnessing. Honduras’s economy depends heavily on US trade and remittances.Honduras has a population of 9.3 million. It has a per capita income of $2830 and 65% poverty rate.In 2009, the New York Times reported that much of Zelaya’s support was derived from labor unions and the nation’s poor, while the middle and upper class feared Zelaya was seeking to establish Hugo Chávez’s type of socialist populism with a powerful leader in the country.On 22 July 2008, Zelaya announced plans to incorporate the country into the Bolivarian Alliance for the People of Our America (ALBA), an organization founded by Hugo Chávez, and that the country had been an “observer member” for “four or more months”.The 2009 Honduran constitutional crisis was a political dispute over plans to rewrite the Constitution of Honduras.Honduran President Manuel Zelaya planned to hold a poll on a referendum on a constituent assembly to change the constitution. Because the president can amend 368 of the 375 articles in the Honduran constitution without calling a constituent assembly, some suspected that Zelaya’s true intention was to extend his rule. One-time Christian Democrat presidential candidate Juan Ramon Martinez argued that Zelaya was attempting to discredit parliamentary democracy.A majority of the government, including the Supreme Court and prominent members of Zelaya’s own party, saw these plans as unconstitutional as they could lead to presidential reelection, which is permanently outlawed by the Honduran constitution. The Honduran Supreme Court upheld a lower court injunction against a 28 June poll. The crisis culminated in the removal and exile of Honduran president Manuel Zelaya by the Honduran military in a coup d’état. On the morning of 28 June 2009, approximately 100 soldiers stormed the president’s residence in Tegucigalpa and put him on a plane to San José, Costa Rica. Zelaya immediately called this a “coup” upon his arrival. Later that day, the National Congress voted to remove Zelaya from office, having read without objection a purported letter of resignation.After Zelaya’s exile, Venezuelan leader Chavez alleged that the Venezuelan ambassador was assaulted by Honduran soldiers; Chavez said that if the ambassador were killed or the Venezuelan Embassy were violated, this would constitute an act of war requiring a military response. On 2 July, Honduran police arrested several Cubans and Nicaraguans present at demonstrations, and police sources claimed Venezuelans were active in the anti-coup movement. On 5 July, Venezuelan media showed Hugo Chávez watching Zelaya’s attempt to land. Accidentally visible in Chávez’s office was the text “051345JUL09 Swarm of Africanized bees, Presidential Podium, wounded by stings and desperation of the people”, the military-style code for 5, 13 July:45 coincided with a violent confrontation in Honduras.In May 2011 a court in Honduras dropped all corruption charges against Zelaya, allowing him to return to Honduras. He did so on 28 May 2011 to a massive reception at Toncontin International Airport. On 1 June the OAS voted to re-admit Honduras into the OAS (Organization of American States.)Zelaya has been blamed for organizing the caravan with Venezuelan funding.Pew research examined the Honduras illegals to the US in 2014.In 2014, the number of unaccompanied minors from Honduras apprehended at the U.S.-Mexico border shot up from less than 7,000 in fiscal year 2013 to more than 17,500 through July, 2014.  Honduras was the country of origin for the highest number of those minors.In 2014, over half of Honduran immigrants currently living in the U.S. arrived in 2000 or later, and about a quarter since 2006, according to a Pew Research analysis of 2012 census data.In 2014, more than 60% of the 573,000 Honduran immigrants in the U.S. are unauthorized, a higher share than those from Guatemala, El Salvador and Mexico, where most other apprehended minors are from, according to an analysis by Pew Research’s senior demographer Jeffrey Passel.Honduras has led the world with the highest homicide rate: In 2012, some 90 people were murdered for every 100,000 inhabitants. That was more than twice the rate in El Salvador and Guatemala, and more than four times the rate in Mexico. Honduras’ murder rate fell by more than a quarter in 2017 to 42.8 killings per 100,000 people, the security ministry. Honduras is second or thord in murder rate after El Salvador and Venezuela. With just 8% of the world’s population, Latin America accounts for roughly a third of global murders. It is also the only region where lethal violence has grown steadily since 2000, according to United Nations figures.Nearly one in every four murders around the world takes place in just four countries: Brazil, Venezuela, Mexico and Colombia. Last year, a record 63,808 people were murdered in Brazil. Mexico also set a record at 31,174, with murders so far this year up another 20%.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tA Wheeled Robot Driven by a Liquid‐Metal Droplet »\r\n\t\t\t\t\t\t\t\t\t\t« Southeast Asian Companies success model is copying from China "}