{"id": "Orbits and lighting levels for artificial moon satellite over China\nNextBigFuture.com\n", "paragraph": "China Daily provided more details about the artificial full moon mirror satellite over Chengdu.This article is referring to Chinese statements about their mirror moonlight system and referencing a presentation “Mirrors in Dawn Dusk Orbit for Low-Cost Terrestrial Solar Electric Power in the Evening” at the AIAA tech conference on 2013. The work in China has to obey the physics and orbital mechanics of such light reflecting systems. Lewis M. Fraas JX Crystals and\n Billy Derbes and Arthur Palisoc of L’Garde Tustin, CA wrote the AIAA paper.China plans to put an artificial moon in orbit above Chengdu, capital of Sichuan province, from the Xichang Satellite Launch Center in Sichuan by 2020. If the launch proves successful, three more such objects will be launched in 2022, Wu Chunfeng, head of Tian Fu New Area Science Society in Chengdu.Astronomers complain that the artificial moon mirrors would make light pollution 50 times worse.The brightest possible Full Moon under ideal conditions has an illuminance of about 0.3 lux, but it’s often just 0.15-0.2 lux. The mirror moons would have 1.6 lux.The sky brightness over central Chengdu due to skyglow in is predicted to be 5.43 mcd/m2, or about 18.25 magnitudes per square arcsecond, using satellite data obtained in 2015.The city currently has 0.034 lux. The new mirror satellites will increase it by 47 times.Full daylight is 10752 lux. 1 lux equals 1 Lumen per square meter. One candle is 12.57 lumens. A street light has 10 lux.The Harbin Institute of Technology and China Aerospace Science and Industry Corp are also involved in developing Chengdu’s illumination satellites.The man-made moon is essentially an illumination satellite designed to complement the moon at night, though it is predicted to be eight times brighter, the scientist added.This is due to the object’s planned orbit about 500km above Earth－much closer than the 380,000km distance to the moon, Mr Wu said.Nextbigfuture notes that a 500-kilometer orbit would not be that good for lighting a city. This is likely only the orbit for the test satellite.I do not think the 2020 test system will reach the 1.6 lux lighting level. I think the 2020 system will be smaller. The three satellite system for 2022 will bigger in order to reach the desired lighting levels. If the systems are at 500-kilometer orbits then they will not be lighting the city throughout much of the night.A Dawn-Dusk Orbit at 1000 kilometers would be better. Dawn-Dusk orbits were proposed by JX Crystals. JX is a US company.18 mirror satellites in a sun-synchronous orbit at an altitude of approximately 1000 km. The Chengdu plan is to have 3 mirror satellites follow up in 2022.In 1979, Dr. Krafft Ehricke proposed the Power Soletta constellation of satellites in an orbit 4200 km in altitude to a 1200 sq km site in Western Europe. The mirrors in orbit at an altitude of 4200 km gives a sunspot diameter on earth of 42 km with a corresponding area of 1385 sq km. This explains the 1200 sq km solar field size for the Power Soletta concept. This also means that in order to produce an intensity of sunlight on earth equivalent to the normal daylight sun intensity, the area of the 3 mirrors shown beaming power down would have to be 1385 sq km and the area of the 10 mirror satellites in the constellation would have to be 4617 sq km. The Power Soletta mirror satellites were also in the Van Allen radiation belt.The Chengdu nighttime lighting is 6000 times less than normal daylight. 4200-kilometer altitude would still require about 600-800 meter diameter mirrors.The 1000 kilometer mirror would only need about 150 to 200-meter diameter mirrors. It would likely need to be some kind of boom deployment of thin film with reflective material.The physics determine it needs to be big.\nOrbital mechanics indicate that you would have to place them at certain altitudes depending upon the times you want coverage.Solar energy available to these ground sites can be increased from an average of 7 kWh per sq meters per day without the space mirrors to 12 kWh per sq meters per day with the space mirrors. The additional 5 kWh per square meters per day will be provided in the early morning and evening hours.The illuminated sunlight spot size on the earth from a 1000 kilometer altitude mirror satellite is about 10 km in diameter instead of the 42 km spot size associated with the Power Soletta configuration. The 10-kilometer diameter was mentioned in the press releases.Scaling up 6000 times from the megacity moonlighting to nighttime lighting level of large ground solar power plants. Either the mirrors get bigger or you get a lot more of them or both.“But this is not enough to light up the entire night sky,” he said. “Its expected brightness, in the eyes of humans, is around one-fifth of normal street lights.”The location and brightness of the light beam can be changed, and its coverage accuracy can fall within a few dozen meters, he said.The artificial moon might replace some street lights in the urban area, thus conserving energy.Mr Wu estimated Chengdu could save around 1.2 billion yuan (US$170 million) in electricity annually if the artificial moon illuminated 50 sq km of the city.The extra light can shine into disaster zones during blackouts, thus aiding relief and rescue efforts.The mirrors can be adjusted for luminosity, and can be completely turned off when needed. However, less light from the satellite will reach the ground if the sky is overcast.“The first moon will be mostly experimental, but the three moons in 2022 will be the real deal with great civic and commercial potential,” Mr Wu said.The three new man-made moons can take turns reflecting sunlight, as they will not always be in the best position relative to the sun, and together they can illuminate an area of around 3,600 to 6,400 sq km on Earth for 24 hours if desired.This statement suggests that the full-time systems would be at higher altitude orbits. The higher the altitude then the larger the systems have to be.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tTesla Model 3 costs $45K but is $35K after tax incentives »\r\n\t\t\t\t\t\t\t\t\t\t« Terrestrial Energy Molten Salt nuclear plant regulator review progress "}