{"id": "Russian catamaran aircraft carrier would have good air power for size\nNextBigFuture.com\n", "paragraph": "Russia showed off a ship model and design for a small catamaran aircraft carrier. It would have less than half the weight than a US super-carrier but would have almost half the planes and close to the same flight deck.The standard displacement is 37000 tons and full displacement is 44000 tons. The length is 304 meters (260 by construction waterline), the width is 78 meters and the draft is 8.5 meters. Full speed is 28 knots. Cruising range at 16 knots is 8000 miles, expandable endurance is 60 days. Aircraft engagement seaworthiness is force seven. The main power plant is a two-shaft gas turbine with a partial electric propulsion and a capacity of 81000 KW or 110000 HP. The electric system comprises three generators with a total capacity of 32MW (6.3 KV/50Hz).A catamaran is a multi-hulled watercraft featuring two parallel hulls of equal size. It is a geometry-stabilized craft, deriving its stability from its wide beam, rather than from a ballasted keel as with a monohull sailboat. The Russian navy catamaran would have 46 flying craft, including 12-14 Su-33, 12-14 MiG-39K/KUB, four airborne early warning aircraft, 12-14 Ka-27 helicopters. This would be about half as many planes as a US super-carrier.It would be longer than a US small aircraft carrier – amphibious assault ship. The length and width of the flattop would be nearly to the size of a US Nimitz aircraft carrier. However, the displacement would be close to the small marine landing aircraft carrier.The US Navy built the Spearhead Expeditionary Fast Transport (EPF) program is a cooperative effort for a high-speed, shallow draft vessel intended for rapid intratheater transport of medium-sized cargo payloads. The EPF will reach speeds of 35–45 knots (65–83 km/h; 40–52 mph) and will allow for the rapid transit and deployment of conventional or special forces as well as equipment and supplies.The Spearhead is 103 meters long and 23 meters wide.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tAnime themed mobile games are huge in China »\r\n\t\t\t\t\t\t\t\t\t\t« Pets vs Pet bots vs Smart Speakers "}