{"id": "Google and NASA run classical supercomputer versus quantum chip races\nNextBigFuture.com\n", "paragraph": "Google and NASA have an agreement to compare Google 72-qubit quantum Bristlecone chip and possibly near-term follow-up quantum chips against regular supercomputers.Alibaba had a recent paper which indicates quantum simulations on classical computers can be more competitive against quantum chips. The largest quantum system that could be classically simulated one decade ago was a 42-qubit one on the Jülich supercomputer by the Massively Parallel Quantum Computer Simulator.Early in 2018, Alibaba believes they simulated 81 qubits on a classical cloud system. There is ongoing massive improvement in the classical algorithms for simulating quantum system on regular computers.Arxiv – Classical Simulation of Intermediate-Size Quantum Circuits Bristlecone requires superconducting circuits maintained at a temperature close to absolute zero, it cannot be moved from Google’s labs. Instead, researchers from the Quantum Artificial Intelligence Laboratory (QuAIL) at NASA’s  Ames Research Center in Silicon Valley will connect to Bristlecone online, via Google’s Cloud API service. Google will also share current software that allows classical computers to simulate quantum circuits, so that NASA can develop and improve upon it.NASA and Google will work out how to map “a diverse array of optimization and sampling problems” to Bristlecone’s gate-model quantum computing system. Early in 2019, they will agree on problems and initial targets for simulation. NASA will code the software necessary to run those simulations on its petaflop-scale Pleiades supercomputer. Pleiades is NASA’s most powerful supercomputer, currently ranked in the top 25 worldwide.Around July 2019, 12 months from the contract’s signing, NASA will compare results from classical simulation of quantum circuits to results from Google hardware.Google’s agreement has a five-year term. NASA will provide further mappings, improved circuit simulation techniques, more efficient compilations and results from circuit simulations. Google will give QuAIL access to its quantum processor and software until at least 2023.Google should go through several doublings of qubits over the next five years. Nextbigfuture believes Google has built and is currently testing a 144 qubit system. Usually quantum computers are developed in the lab and worked on for 1 year or more before they are officially announced. It has previously been stated by IBM and Google that the doubling time for qubits for current noisy superconducting chips is every 7 to 9 months. The limiting factor is not designing and creating superconducting chips. The limiting resource the team needed to test and validate a larger chip design and the resulting chips with more qubits.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tCalifornia’s big fires and 129 million dead trees »\r\n\t\t\t\t\t\t\t\t\t\t« Terrestrial Energy is a leader in commercializing next gen nuclear technology "}