{"id": "NASA picks SSL to develop key fuel depot technology\nNextBigFuture.com\n", "paragraph": " SSL, a Maxar Technologies company (formerly MacDonald, Dettwiler and Associates Ltd.) a leading provider of innovative satellites and spacecraft systems, was selected by NASA for two separate public-private partnerships to develop two vital “Tipping Point” spacecraft technologies.Maxar has over $2 billion in revenue and 6500 employees. SSL builds advanced robotic and servicing systems for nuclear, military, agriculture and infrastructure application. SSL robotics technologies are proven on the Space Shuttle, the International Space Station and the Mars lander and rovers.SSL works with NASA and DARPA with robotic assembly in space and robotic servicing of satellites.NASA’s Tipping Point awards are designed to foster the development of commercial space capabilities and benefit future NASA missions. A technology is considered by NASA to be at a tipping point if an investment in a demonstration is likely to result in a high likelihood of infusion into a commercial space application, and significant improvement in the ability to successfully bring the technology to market.  The company will develop two technologies aim to expand the capabilities and resiliency of spacecraft through in-orbit refueling for electric propulsion and enabling space transportation with highly efficient, high-power solar electric propulsion. These innovations demonstrate SSL’s ongoing commitment to, and expanding role in, the development of next-generation space infrastructure.* In-Space Xenon Transfer for Satellite, Servicing and Exploration Vehicle Replenishment and Life Extension will unlock new possibilities for on-orbit servicing and refueling by demonstrating that fuel transfer can be performed reliably in space. * High Efficiency 6kW Dual Mode Electric Propulsion Engine for Broad Mission Applications technology will leverage SSL’s long history of innovation in electric propulsion to develop a highly flexible, dual-mode power processing unit capable of providing variable voltage, increasing overall mission efficiency and providing greater power, flexibility, and velocity for future missions.“SSL is a leader in electric propulsion and robotics for space missions and is uniquely positioned to help U.S. government agencies achieve their goals with confidence,” said Richard White, president of SSL Government Systems. “Powerful and cost-effective propulsion systems and reuse of assets already on-orbit will ultimately help build a better world and propel humanity’s exploration of space.”\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tWhats next for megaregion integration after Hong Kong Superbridge? »\r\n\t\t\t\t\t\t\t\t\t\t« Will NASA funding help struggling lunar lander companies get to the moon? "}