{"id": "Ocean Solutions are key to solving Climate Change\nNextBigFuture.com\n", "paragraph": "There is a comprehensive and systematic assessment of 13 global- and local-scale, ocean-based measures was performed to help steer the development and implementation of technologies and actions toward a sustainable outcome. Iron Fertilization and growth of large kelp farms are the two favorite programs that Nextbigfuture believes can both reduce CO2 but also massively increase fish.Scientists have reported a 6–12% decline in global plankton production since 1980. A full-scale plankton restoration program using iron fertilization could regenerate approximately 3–5 billion tons of sequestration capacity. This could be done for less than $5 per ton of CO2 which is one of the lowest cost large scale methods.A handful of people could go onto a small boat and put 10-100 tons of soluble iron into the ocean and generate algae bloom visible from space. The blooms can hundreds of thousands to millions of tons in mass. A hundred tons of iron were put in 2012 in the coastal waters of Canada and generated tens of millions more fish. Different breeds of fish mature and are caught at different ages. In 2013, there were a lot more one-year-old fish varieties. In 2014, there were a lot more two-year-old fish on the western part of Canada and the USA. On 2015 there was a lot more three-year-old fish and in 2016, there were a lot more four-year-old fish. The one iron fertilization project sequestered more CO2 to the bottom of the ocean than a greater than one billion dollar carbon capture project.The ocean provides most of the life-supporting environment on the planet. It hosts a large portion of biodiversity, plays a major role in climate regulation, sustains a vibrant economy and contributes to food security worldwide. Severe impacts on key marine ecosystems and ecosystem services are projected in response to the future increase in global mean temperature and concurrent ocean acidification, deoxygenation, and sea-level rise.Ocean Solutions to Address Climate Change and Its Effects on Marine EcosystemsThey look at reducing adverse impacts on selected, important and sensitive marine ecosystems and ecosystem services. The three drivers considered are ocean warming, ocean acidification and sea-level rise, although others such as hypoxia, extreme events, and changes in storminess and precipitation can also be important. They focus on four ecosystems and habitats (warm-water coral reefs, mangroves and salt-marshes, seagrass beds, and Arctic biota) and four ecosystem services (finfish fisheries, fish aquaculture, coastal protection, and bivalve fisheries and aquaculture), which are particularly vulnerable to climate impacts and are critical for livelihoods and food security. The potential of each ocean-based measure is assessed in terms of the following eight environmental, technological, social, and economic criteria:\n(1) potential effectiveness to increase net carbon uptake and moderate ocean warming, ocean acidification, and sea level rise;\n(2) technological readiness;\n(3) lead time until full potential effectiveness;\n(4) duration of benefits;\n(5) co-benefits;\n(6) disbenefits;\n(7) cost-effectiveness; and\n(8) governability from an international perspective.(1) Ocean-based renewable energy (hereafter renewable energy) comprises the production of energy using offshore wind turbines and harvesting of energy from tides, waves, ocean currents, and thermal stratification (2) The restoration and conservation of coastal vegetation (hereafter vegetation), primarily saltmarshes, mangroves and seagrasses (also referred to as “blue carbon ecosystems”), seeks to enhance their carbon sink capacity and avoid emissions from their existing large carbon stocks if degraded or destroyed.(3) Fertilization involves the artificial increase in the ocean’s primary production and, hence, carbon uptake by phytoplankton in the open ocean, to be achieved primarily by adding soluble iron to surface waters where it is currently lacking, mostly in mid-ocean gyres and the Southern Ocean.(4) Alkalinization describes the addition of a variety of alkaline substances that consume CO2 and/or neutralize acidity primarily achieved by raising the concentration of carbonate or hydroxide ions in surface waters, and thereby shifting the associated chemical equilibria in seawater to increase the oceanic uptake of atmospheric CO2. The feasibility and effectiveness of adding alkalinity are considered at both global and local scales. In either case the alkalinity would be derived from land-based mineral or synthetic chemical sources or from locally available marine material (e.g., waste shells). The alkalinity would then require transport to and distribution within the marine environment.5) Land-ocean hybrid methods include the use of the ocean and its sediments to store biomass, CO2 or alkalinity derived from terrestrial sources. Examples are crop residue storage on the seafloor marine storage of CO2 from land-based bio-energy or from direct air capture of CO2  and conversion of such CO2 to alkaline forms for ocean storage. Hybrid methods also include techniques involving marine-to-land transfers, such as using marine biomass to fuel biomass energy with carbon capture and storage (BECCS) on land or using such biomass to form biochar as a soil amendment.Another area of action to counter global and ocean warming (but which does not directly address the greenhouse gas cause) is solar radiation management (SRM, also known as sunlight reflection methods). Several schemes were described, including stratospheric aerosol injection. Two ocean-based schemes are considered here. (6) Marine cloud brightening (hereafter cloud brightening) involves the large-scale aerial spraying of seawater or other substances into the lower atmosphere to increase the amount of sunlight clouds reflect back into space. Sub-global implementation could also be considered.(7) Increased surface ocean albedo (hereafter albedo enhancement) is here considered to be achieved by long-lived ocean micro-bubbles or foams, produced either by commercial shipping or by vessels dedicated to that task.(8) Reducing pollution refers to decreasing release of anthropogenic, harmful substances. Pollution can exacerbate hypoxia and ocean acidification especially in coastal waters while increasing the sensitivity of marine organisms and ecosystems to climate-related drivers). (9) Restoring hydrological regimes (restoring hydrology) relates to the maintenance and restoration of marine hydrological conditions, primarily in coastal waters, including both the tidal and riverine delivery of water and sediments, to alleviate local changes in climate-related drivers (10) Eliminating overexploitation includes ensuring the harvest and extraction of living resources are within biologically safe limits for sustainable use by humans and to maintain ecosystem function and, in the case of non-living resources (e.g., sand and minerals), in levels that avoid irreversible ecological impacts. For example, in over-exploited ecosystems, pelagic species that are smaller and faster turnover generally increase in dominance.(11) The protection of habitats and ecosystems (protection) refers to the conservation of habitats and ecosystems, primarily through marine protected areas (MPAs). For example, increased abundance of marine species is expected to enhance productivity of the surrounding areas which can help buffer against climate impacts and increase resilience(12) Assisted evolution involves large-scale genetic modification, captive breeding and release of organisms with enhanced stress tolerance.(13) Relocation and reef restoration involves not only the restoration of degraded coral and oyster reefs, but also their enhancement and active relocation, with the potential creation of new habitats and use of more resilient species or strains. Note that restoration and protection of vegetated coastal habitats (seagrasses, mangroves, and saltmarshes) is considered in the vegetation measure. \r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tQuantum mechanics time travel indicates no grandfather paradox »\r\n\t\t\t\t\t\t\t\t\t\t« IBM proves a quantum computing advantage over classical "}