{"id": "Momentus plasma water propulsion will two to three times better than chemical rockets\nNextBigFuture.com\n", "paragraph": "Momentus will provide in-space transportation services to various orbits all the way out to deep space. They will receive $8.3 million in funding today. The funds will go towards in-orbit technology demonstration of the company’s in-space rocket scheduled to launch in the 1st quarter of 2019.Prime Movers Lab led the round for Momentus, a 2018 graduate of the Y Combinator program, with\nparticipation from Liquid 2 Ventures, One Way Ventures, Mountain Nazca, Y Combinator and numerous other\nVCs.Dakin Sloss, Founder and General Partner at Prime Movers Lab (which invests in physics-powered startups) said:\n“Momentus has not only developed groundbreaking and efficient water-powered, in-space rockets, but also\nvalidated the massive market demand for their services with hundreds of millions of dollars in LOIs. We are\nthrilled to back this extraordinary team of seasoned entrepreneurs and space industry veterans in their\nimpressive pace of introducing novel technology to space — which we expect will continue with the upcoming in-space demonstration in the first half of 2019.Momentus Founder, President, and veteran space entrepreneur Mikhail Kokorich said: “We are building in-\nspace rockets that, once in space, move spacecraft from one orbit to another. Our goal is to make in-space rides affordable and fast. Democratization of in-space transportation will enable a lot of new business models beyond low earth orbit.”According to a recent report by the Satellite Industry Association, prepared by Bryce Space and Technology, the space economy hit almost $270 Billion in 2017. The first market Momentus will address is low-earth orbit (LEO) transportation, mostly through orbital altitude adjustments for satellites. The trans-GEO market will be driven by applications like satellites tugging from LEO to higher orbits such as mid-earth orbit or geostationary orbit, in-space services and satellite de-orbiting. Currently this market is served either by chemical booster stages, or by ion propulsion onboard, which is overkill for the requirements and not as efficient as water for the fuel to mass ratio.Vigoride, Momentus’ smallest ESPA class in-space rocket service will be providing rides from LEO with wet mass less than 250 kg, which will be ready and space qualified in 2019.Back on Earth, Momentus is focused on the following milestones:\n● 2019: Flight demonstration of our technology in space\n● 2020: Start providing Vigoride service using our first in-space rocket;\n● 2020: Test next-gen Ardoride engines for our in-space rockets in Simulated Space Environments.Momentus will use microwaves to heat water to super-high temperatures.They are using proven components in an innovative way.Future systems will be able to gather water from asteroids and planets for easy refueling. Missions will be able to travel anywhere in the solar system and get fuel. Power can be from solar or other power sources.VIGORIDE™ is the name of the first Momentus commercial service in 2020.Main propulsion for small spacecrafts\nOrbit raising from LEO, orbit inclination change\nSatellite deorbiting missions\nMain thruster for deep space spacecrafts\nIn-space boosters for micro-launchersSPECS\nStarting mass: 180kg (ESPA) or 300kg (ESPA GRANDE)\n∆V: up to 6km/sec\nPropulsion: water plasma-powered Vigor™\nSpecific Impulse: up to 700 seconds\n Double the performance of chemical rockets\nSolar power: 500W ARDORIDE™ for service start in 2021In-orbit servicing\nSpace debris removal\nPlatform for small telecom satellites\nIn-space boosters for small-lift launch vehicles\nDeep space exploration\nNear-Earth asteroid scoutingSPECS\nPayload from LEO: up to 180kg to Lunar orbit\nPayload from GTO: up to 250kg to Mars orbit\n∆V: up to 6km/sec\nPropulsion: water plasma-powered Ardor™\nSpecific impulse: 700 sec\nSolar power: 2-3kWFERVORIDE™ sometime after 2021 a reusable systemBoosting of large satellites from LEO to GEO\nMoon exploration resupply\nDeep space missions\nAsteroid mining infrastructureSPECS\nPayload:  over 10,000kg to GEO\n∆V: up to 8km/sec\nReusable\nPropulsion: water plasma-powered Fervor™\nSpecific impulse: 900 sec\nSolar power: over 10kWVALORIDE™ is the goal of a large 100 ton systemWater delivery from asteroids to cis-lunar space\nWater bunkering\nDeployment of asteroid mining infrastructure\nMoon and Mars exploitation resupply\nSPECS\nPayload: over 100tn\nReusable\nPropulsion: water plasma-powered Valor™\nSpecific impulse: 1100 sec\nSolar power: over 100kW\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tBrexit getting closer »\r\n\t\t\t\t\t\t\t\t\t\t« One Mile Barriers to Forest Fires – Controlled Burns and Fuel Breaks 1957-1977 "}