{"id": "California’s big fires and 129 million dead trees\nNextBigFuture.com\n", "paragraph": "From January to November 9, 2018, a total of 7,579 fires had burned an area of 1,564,609 acres (6,332 square kilometers), according to the California Department of Forestry and Fire Protection and the National Interagency Fire Center. The fires caused over $3 billion (2018 USD) in damages, including $1.37 billion in fire suppression costs so far. Major fires are burning and barely contained. Homes in Malibu and Chico are being destroyed.There are 129 million dead trees in California’s forests. In 2016, the estimate was 100 million dead trees.The Butte county Fire (Campfire) has burned 100,000 acres and threatens 15,000 buildings. It is 20% contained.The Woosley fire has burned 70,000 acres and threatens 3500 buildings.Through the end of August 2018, Cal Fire alone spent $432 million on operations. The Mendocino Complex Fire burned more than 459,000 acres (1,860 square kilometers), becoming the largest complex fire in the state’s history, with the complex’s Ranch Fire surpassing the Thomas Fire and the Santiago Canyon Fire of 1889 to become California’s single-largest recorded wildfire.There were also large fires in 2017 in California. At least 245,000 acres (99,148 ha) were burned and $14.5 billion in damage was caused. 8900 buildings and 44 people were killed.In August, US Interior Secretary Ryan Zinke, surveying fire damage near Redding recently, called for culling more trees from national forests and slammed environmental groups for blocking timber harvesting. Republican Rep. Tom McClintock, whose district stretches from Lake Tahoe to Kings Canyon and Yosemite National Park, is repeating his longstanding arguments that forests are too thick with trees and that conservation rules are too strict.McClintock, whose district stretches from Lake Tahoe to Kings Canyon National Park, spoke to The Sacramento Bee after meeting with officials battling the Donnell Fire in Stanislaus National Forest on Thursday. “It’s the same old story. I asked them what the tree density was in the forests where the fire is,” McClintock said. “It’s about 300 trees per acre.”“A healthy density in the Sierra is about 80 to 100 trees,” McClintock continued.In September, California passed a $1 billion fire risk reduction package. It give grants over five years to communities to cut fuel breaks, thin flammable brush, and educate firefighters. The bill also relaxes rules on logging to make it easier to get to some of the most flammable trees.The bill also allows Pacific Gas and Electric to pass off some its liabilities to customers. The utility is facing billions of dollars in damage payouts after its power lines were blamed for starting some of the fires in California last year. the Emmerson family is the third largest landowner in California. They have a net worth of $4 billion. They own Sierra Pacific. Sierra Pacific has operating profits of approximately $375 million annually on sales of $1.5 billion. They perform most of the logging in California.A 1990 law prohibits bidding from any lumber companies that export logs. Rivals like publicly traded Weyerhaeuser and Rayonier as well as big Canadian firms are not allowed into California.There needs to be a large and aggressive program of controlled burning. More logging should be permitted while getting the lumber companies to help with clearing the dead trees. Forest managers need to create new zoning plans for national forests, the way Parks Canada does. Forests near populated areas would be managed through a mix of mechanical thinning and fire suppression.Remote forest areas could be thinned via prescribed fires or by letting smaller natural fires burn themselves out, so long as weather conditions are right.Dedicated crews that work on reducing fuel build-up in forests — crews that don’t get diverted into suppression during wildfire season, as currently happens.There need to be large anti-fire areas around cities, towns and communities. There needs to far larger fire-barrier zones around communities. Housing needs to have more treatments to make them less ignitable and easier to defend.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tAsia will be over half of the world economy in 2028 »\r\n\t\t\t\t\t\t\t\t\t\t« Google and NASA run classical supercomputer versus quantum chip races "}