{"id": "3D printed knitted frameworks enable breakthrough complex architecture\nNextBigFuture.com\n", "paragraph": "3D printing of knitted textiles has been used as a structure for complex architecture. This cuts down on material, labor and waste, and simplifies the construction process for complex shapes.A double-curved concrete shelled pavilion was made with 3D-knitted formwork. It was developed by Zaha Hadid Architects and ETH Zurich. The pavilion named KnitCandela is on display in Mexico. They built using KnitCrete. This is a new 3D-knitted textile technology for creating curving concrete structures. There is no need for expensive and time-consuming moulds.The knitted fabric weighs just 25 kilograms and the cable net 30 kilograms. The concrete shell weighs 5 tonnes. There is 100 times more concrete than fabric and cable.Making simpler and faster methods for curved buildings will be used by these leading architects.This breakthrough means more curved buildings. Curved buildings and curved sections of architecture should become less rare.Curved architecture had breakthroughs over one hundred years ago with Antoni Gaudi in Barcelona. However, the difficulty and cost in making such buildings has kept them in a small niche.Casa Batlló is generally considered to have one of the most creative and brilliant urban façades in the world. The building is a considered a masterpiece of Art Nouveau architectureAn industrial knitting machine made the shuttering of the formwork for the shell structure. In 36 hours, it knitted a fully shaped, double-layered 3D textile consisting of four long strips. The lower layer forms the visible ceiling. It a designed surface with a colorful pattern. The upper layer contains sleeves for the cables of the formwork system and pockets for simple balloons, which, after the entire structure is coated in concrete, become hollow spaces that help save on materials and on weight. Manufacturing a formwork for such a geometrically complex structure using conventional methods would  cost a lot more.Knitcandela is what they call the thin concrete shell that is built on the textile framework.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tBad drivers and very low accident costs will help China win with self-driving cars »\r\n\t\t\t\t\t\t\t\t\t\t« Race for Antimatter gravitational experiment this month "}