{"id": "Where is the climate fall of France to trigger WW2 scale climate mobilization ?\nNextBigFuture.com\n", "paragraph": "The Paris Agreement was empty goals with empty and insufficient promises followed by less action and even less results. The IPCC 2018 is calling for a larger than WW2 economic mobilization and transformation without the equivalent of a climate fall of France or Europe. IPCC 2018 is talking about loss of coral and summer ice in the Arctic.Arctic Ice has been stable from 2007 to 2018. There was a decrease in ice from 1979 to 2007. The sea level rise has been minimal. All of the Arctic Ice and all of the Greenland glacier is not projected to completely melt by 2100. Sea level rise depends more upon overall water swelling from higher temperatures.What IPCC is calling for is a larger than WW2 scale economic mobilization. But with a predicted somewhere around 2080 to 2200 not even really scary story.Here I will describe that the motivating climate event will have to truly large and repeated and directly and obviously connection to climate change.Also, the re-action will not be spending $3 trillion per year on a multi-decade plan to change energy and transportation. By the IPCC projection such actions would only bend temperature curves 40+ years out. Would the world wait 40 years to start turning back the Nazis. The generals with those plans would be fired. The response would be geoengineering.The Fall of France involved allied losses of 360,000 and 1.9 million captured. 66,000 were killed and 134,000 were wounded in the invasion of Poland. The invasion did not trigger the full-scale mobilization. It kicked off a 4 year ramp up. The Soviets lost over 4 million in the first 6 months of 1941.The main combatants in WW2 (Germany, Soviets, Japan, UK, USA and others) mobilized about 50-70% of their economies for 3-4 years with about 3-4 years of ramping up.IPCC is calling for over 20 years of buildup and effort across the entire world economy and that maintenance at near that level for over 60 years. The IPCC is calling for transition from fossil fuels which provide 81% of the power for the world economy to almost none by 2050.This is for a predicted fall of France or Fall of Europe style climate events somewhere in 2080-2200. Damage to coral has already happened. Australia is willing to spend about $400 million per year to save or preserve the Great Barrier reef with research and on the water surface sun-screen for coral. This will try to preserve a $6-7 billion tourism and fishing business.The IPCC telling a story that there is a gun to the head of world coral is meaningless. Most people did not and did not care about bleaching events over the last few years to half of the world coral. The IPCC has a statistical story about the danger to world coral by 2040-2100. How strongly did and have IPCC scientists come out to try to save nuclear reactors in Japan, Germany or the USA? The nuclear reactors were mostly replaced by coal in Japan and Germany. The IPCC scientist recommendations and actions are not consistent and not focused on the fastest and lowest cost and major impact actions for the next twenty years. China is spending about $100 billion per year to combat air pollution because is costs China about $1 trillion in economic damage (agricultural, medical, business and 1.6 million shortened lives). What triggered the prior anti-pollution action in the UK, Europe, US and Canada?12,000 people dying in the London Fog air pollution event of 1952, started the talk of more serious pollution controls despite having visible air and air pollution for many years. There were many other mass dyings caused by air pollution.China had to get to about the same levels of air pollution and people coughing up black all the time for many years.It seems to get $2-5 trillion per year in action will require $5 to 20 trillion per year in past and sustainable damage. However, it also requires in your face clear and obvious mass deaths. And few thousand will not be enough and the connection to climate change must be very obvious and urgent. Mass deaths from an event in Africa or on some islands will not cut it either.The 2003 heat wave in Europe caused about 70,000 deaths. France had 14,800 heat wave deaths.The US has had heat waves but not so many deaths because of widespread air conditioning. There was some increase in air conditioning demand in France and Europe but not a mass adoption. The heat wave is not something which can be pinned directly on climate change.There has been no need to create dams and levies around US and Europe or Asian coastal cities.Air pollution indoor and outdoor causes 7 million deaths per year. China has responded with a large program but India, the rest of Asia and Africa have far less response. India’s air is as bad if not worse than China’s.The US does not respond to a calculated trillion dollar per year loss from urban sprawl. So it is not just theoretical money.The Paris climate agreement set a goal of no more than 2°C global warming above pre-industrial temperatures, but a stretch goal of no more than 1.5°C. Each country that signed onto the Paris Agreement wrote the promises they were going to try to keep by 2030.The Paris Agreement climate promises if fully kept would have the world emitting a cumulative 745 billion tons of CO2 between the beginning of 2017 and the end of 2030 instead of 770 billions tons of CO2. This is the max if commitments were met. Currently we would be very lucky to get to 5 billion tons of total lower emissions because most countries are falling well short of slowing the increased CO2 emissions.The total emissions since the last 2014 IPCC report and the 2018 IPCC report have increased.Paris group of overweight people and two still growing whales (China and India). There is another whale (the USA) who did not sign up for the diet promise and challenge.Collectively everyone is over 20% heavier in 2018 than in 2010 and collectively everyone is still gaining weight.The empty Paris goals of 2 degrees of 1.5 degrees are dependent upon the next generation post-2030 making vastly serious deep cuts in emissions. The new IPCC is saying the world has to go to one-third of the emissions that the world was tracking to in 2030. Half of the 2010 level. Ten times more than the mostly unkept promises of the Paris Agreement by 2030. This would be fifty times more than what might actually be on track to being done in the Paris Agreement. This is uncertain because of the actions that are being taken have more results closer to 2030 in the Paris promises.This would followed by getting to 0 emissions by about 2040 and then negative thereafter. The IPCC recommended plans are vastly more expensive and slower than alternatives.– Geoengineering is 1000 times cheaper and faster and at least 1% of the requested funds should be spent on these options\n– There needs to be more research and scaled action on Black carbon (aka soot and particulates)\n– There needs to be accelerated research on factory mass produced nuclear power. Molten salt nuclear seems like the best option here.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tUSA number one in economic competitiveness for the first time in ten years »\r\n\t\t\t\t\t\t\t\t\t\t« SpaceX starts BFS and BFR rocket test site for 2019 tests "}