{"id": "Terrestrial Energy is a leader in commercializing next gen nuclear technology\nNextBigFuture.com\n", "paragraph": "Terrestrial Energy is leading the way to getting regulatory approvals for its molten salt\nfission reactor design and has built up an industrial board representing 10 of the largest Nuclear\nReactor companies for advice it on its path to market.Terrestrial Energy aims to build and commission with a power utility the first its walkaway safe molten salt modular reactor design in the late 2020s.An IMSR® power plant generates 400 megawatts of thermal energy (190 MW electric) with a thermal-spectrum, graphite-moderated, molten-fluoride-salt reactor system. It uses standard nuclear fuel – standard-assay low-enriched uranium (less than 5 percent 235U) fuel. It incorporates many aspects of Molten Salt Reactor operation researched, demonstrated and proven by test reactors at the Oak Ridge National Laboratory.Terrestrial Energy’s Integral Molten Salt Reactor (IMSR) has entered the second phase of a vendor design review by the Canadian Nuclear Safety Commission (CNSC). The design was the first advanced reactor to complete the first phase of the CNSC’s regulatory pre-licensing review.Once they have completed the pre-licensing review, they will have a “licensable” molten salt reactor design and a commercial greenlight to move to construction and licensing for the first plant.The ten current members of the Terrestrial Energy Industrial board operate a combined 68 nuclear reactors in Canada, USA and Europe.The Industrial Board are potential operators for Terrestrial Energy’s power plant.They represent about 45% of the nuclear power in Canada and the USA.Bruce Power provides over 30% of Ontario’s electricity. Bruce Power invested more than $7 billion in its Bruce A and B facilities to restart and optimize the performance of its nuclear fleet over the last decade and has successfully carried out massive refurbishment and plant life extension projects on all of its operational units. There are eight nuclear reactors at Bruce A and B. They produce 49 TWh of energy per year. At nine cents per kilowatt-hour that would be $4.5 billion in annual revenue.Duke Energy owns and operates six nuclear power stations in North Carolina and South Carolina, U.S.A. Duke Energy has about $23 billion per year in revenue.Energy Northwest operates the Columbia Generating Station, located in Washington State, U.S.A. Energy Northwest (formerly Washington Public Power Supply System) is a public power joint operating agency in the northwest United States, Energy Northwest owns and operates Columbia Generating Station, a boiling-water reactor nuclear energy facility in Richland, Wash.ENGIE is a multinational electric utility operating in generation and distribution, natural gas, nuclear and renewable energy. It owns and operates seven reactors in Belgium and owns stakes in two nuclear plants in France.NB Power operates the Point Lepreau Nuclear Generating Station in New Brunswick, Canada.NextEra Energy owns and operates eight reactors at five U.S. sites: St. Lucie Nuclear Power Plant, Florida; Turkey Point Nuclear Generating Station, Florida; Duane Arnold Energy Center, Iowa; Point Beach, Wisconsin, and; Seabrook Station, New Hampshire.Ontario Power Generation owns and operates the Pickering (6 operational nuclear reactors) and Darlington Nuclear Power Stations (4 nuclear reactors) in Ontario, Canada.PSEG Nuclear operates the Salem (2 reactors) and Hope Creek Nuclear (1 reactor) Generating Stations in New Jersey and is a part owner of the Peach Bottom Nuclear (2 reactors) generation station in Pennsylvania, U.S.A.Southern Nuclear operates the Alvin W. Vogtle Electric Generating Plant and the Edwin I. Hatch Nuclear Plant in Georgia, and the Joseph M. Farley Nuclear Plant in Alabama, U.S.A. The company operates a total of six units for Alabama Power and Georgia Power at the Joseph M. Farley Nuclear Plant near Dothan, Ala.; the Edwin I. Hatch Nuclear Plant near Baxley, Ga., and the Alvin W. Vogtle Electric Generating Plant near Waynesboro, Ga. Southern Nuclear is the licensee of two new nuclear units currently under construction at Plant Vogtle, which are among the first nuclear units being constructed in the United States in more than 30 years.For more than 40 years, Southern Nuclear has operated its three nuclear energy facilities at the highest levels of reliability, with a current average three-year fleet capacity factor of 93.7 percent, exceeding the U.S. average of 92 percent for the years 2014-2016.TVA (Tennessee Valley Authority) is the largest public power utility in the United States. It owns and operates nuclear power plants in Alabama and Tennessee, with seven reactors at three sites: Browns Ferry, Sequoyah, and Watts Bar\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tGoogle and NASA run classical supercomputer versus quantum chip races »\r\n\t\t\t\t\t\t\t\t\t\t« China’s giant ultra-high voltage grid is ambitious as its high speed rail "}