{"id": "The World in one hour – 3000 SpaceX BFRs by 2045\nNextBigFuture.com\n", "paragraph": "Increasing from a 285 ship navy to a 355 ship Navy will cost the US about $900 billion over 30 years.Instead the US could buy a fleet of 3000 SpaceX BFRs. Spacex BFRs will be completely reusable rockets. They have the potential of flying hypersonically anywhere in the world ten times per day. What would a nation rather have? 355 ship navy or 285 ship navy and 3000 SpaceX BFR.3000 SpaceX BFR would not only convey more military capability it would transform the world with hypersonic flight. Moving people and cargo anywhere in the world in less than one hour.Each BFR has 38 Raptor engines. Raptor engines are the same size and will be similar in price to Merlin engines. Merlin engines are about $6 million each. Ballpark pricing for a BFR should be about $250 million each. 3000 SpaceX BFR would cost about $750 billion. Volume production would bring the price down to about $200-400 billion. SpaceX rocket engine factory can make about 400 engines per year or enough for about 10 BFR per year. There would need to be about ten to twenty times the current SpaceX engine factory.In 2017, the US had about 7300 commercial passenger jets.Chinese airlines are likely to buy more than 7,000 planes worth $1.1 trillion over the next 20 years.Having passenger jet like flight with fully reusable rockets should be fully exploited.If the BFR rockets are refueling and flying again the same day, then there should be thousands of floating landing and launch pads.There would need to be pipelines and supplies for the natural gas based fuel engines to the launchpads. Natural gas consists of over 90% methane.3000 rockets making three or four orbital flights and returns per day could put 1 million tons into orbit per day.400 hundred people could be carried on every flight. 4 million people could fly to and from orbit every day. At $3000 per ticket for flights this would be $12 billion per day for tickets to go anywhere in the world or in orbit.Commercial airlines carried just over 60 million metric tons of freight in 2017.The US Air Force has talked to SpaceX about taking cargo at hypersonic speeds anywhere in the world.One full flight of 3000 BFR would move 1 million men and material to the other side of the world in one hour.There were 90 orbital rocket launches in 2017.\nIt will be a huge leap from what we can do now to a fleet of 3000 SpaceX BFR by 2045.100 million tons of liquified natural gas would be enough for over 400,000 launches. Each launch using about 240 tons of methane.The US can embrace the power and transformation of a totally SpaceX BFR world.Instead the US is clinging to the garbage Space Launch System. $3 billion per year and the first launch in 2021. Constellation and SLS programs for about 15 years without a test launch. This is trying to reuse 1980s Space Shuttle booster technology.Space Launch System is $1-2 billion per flight once per year.\nSpaceX BFR can be ten thousand flights per day with flights at about $5 million each.Think of the SpaceX BFR as a hypersonic 747.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tChina Air Pollution fight is the current biggest global environmental effort »\r\n\t\t\t\t\t\t\t\t\t\t« Nanomembrane based tech can replace Haber-bosch process that feeds world "}