{"id": "China Air Pollution fight is the current biggest global environmental effort\nNextBigFuture.com\n", "paragraph": "China has a war on air pollution and they are spending tens of billions each year since 2013 to fight it.These air pollution problems are taking a relatively wealthy China 20 years to solve. China will reap ten to twenty dollars back from investments in fixing air pollution. Less money and effort are going to solve indoor and outdoor air pollution in India, Pakistan, other Southeast Asian countries, Iran and African countries. Those other countries would also benefit from fixing air pollution. The poorer countries of Asia, Africa and the middle east cannot afford as much investment.China is changing residential and commercial heating, 6 million trucks, industry and cities over the next 20+ years to fix air pollution.China’s coal production rose 5.1 percent in the first three-quarters of this year to 2.59 billion tonnes. There was falling coal demand after 2013 with a slower economy. Coal-fired power has remained the cheapest and most readily available option for many local governments, with many already struggling to find enough natural gas to supply local houses with heat. China’s mainly coal-fired thermal power capacity rose 58 gigawatts (GW) from the end of 2016 to the end of August this year, more than half of all new domestic capacity over the period and almost enough to power Australia.China has been hurt by a slowdown in the construction of nuclear reactors. Nuclear can provide reliable baseload generation instead of traditional coal-fired plants.“With renewables ramping up so quickly, it has given the illusion of decarbonization, but China is falling into the same trap that Germany has fallen into – deploying lots of renewables that have to be backed up with lots of coal-fired power plants,” said Li Ning, nuclear scientist and dean of the College of Energy at Xiamen University. “If nuclear can’t keep up, then it is coal,” he said. Fixing air pollution globally would save millions of lives per year and $5 trillion per year in cost. $300 billion per year over 20 years could get rid of 95% of the problem.0.6 degrees celsius of warming would also be avoided. Soot causes cancer, lung and heart disease when you breathe it in but is also covers buildings, roads, ice and snow with black soot. Blacker and darker absorbs heat. Whiter and lighter reflects more light and heat.Fixing 90% of global air pollution will likely happen by 2050. If there was a larger global support it could happen by 2030. China is taking until 2030-2035 to get to a 90% solution.The IPCC and environmentalists shouting for a 50% shift from fossil fuels by 2030 and 100% shift by 2040 are delusional.What is within the realm of the remotely possible would be for China to announce a shift to factory mass produced nuclear fission (pressure water, pebble bed, molten salt, critical water) reactors. This would be to get to France levels (75%-80%) nuclear for electricity by 2050. Even more nuclear to create hydrogen to mix into more advanced renewable fuel. This would be to reach the geopolitical goal of replacing any oil for industry or aviation or transportation. Currently China imports 75% of its oil. India has the same oil dependence and high fossil fuel usage. India could follow China’s move to nuclear with a 10-25 year lag.Realistically, China could boost nuclear and other clean energy targets by 2030 and molten salt nuclear in China and the USA could get proven by 2030. A rapid nuclear scale up could occur from 2030-2060.The Global Burden of Disease 2015 study revealed that approximately 1.1 million people died prematurely and 21.8 million disability-adjusted life-years (DALYs) were lost because of ambient air pollution in China in 2015. Over the next five-years China is implementing emission controls of diesel trucks that are cleaner than the level 6 European standard. There will be European level 6 standard by 2020 for China’s trucks.China is replacing a million heavy duty diesel trucks, almost 20 percent of the national fleet, with ones that burn cleaner fuel by 2020.This will cost China $2.8 billion annually by 2030 but it will return $57 billion in health and other benefits.Each $1 it costs China, it returns $21 and tens of thousands of lives are saved every year and people are healthier and more productive.All benefits and positive economic return. China has a larger goal of getting the top 338 cities to reach a temporary national air pollution standard of 35 micrograms of 2.5 micron particulates per cubic meter. The world health standard is 10 micrograms per cubic meter. China aims to reach the interim national standard of 35 micrograms by around 2035. Nextbigfuture believes the 35 microgram target could be reached by 2025-2030.China’s 2020 standard is for an 18% improvement over a 2015 baseline for the 338 cities. 231 cities are above the 35 microgram target.Average PM2.5 stood at 43 micrograms in China in 2017 but rose to 65 micrograms in the heavy industrial region of Beijing-Tianjin-Hebei.600,000 lives per year are still shortened in China from indoor air pollution in rural areas. This is from using soot producing cookers. It would cost $300 to $600 for each of the cookers to be replaced with soot-free cookers. China has the resources to solve the rural cooking problem by 2022. China could use a more costly electrification or natural gas upgrade to entire villages.China’s government agencies, the National Development and Reform Commission (NDRC) and the National Energy Administration have announced a five year plan to convert 70% of northern cities to mostly natural gas heating instead of coal.The government has made “concrete arrangements” regarding geothermal heating, biomass heating, solar heating, gas heating, electric heating, industrial waste heating, and clean coal-fired central heating.Half of northern China should be converted to clean heating by 2019, reducing bulk coal burning by 74 million tonnes, the reports said. That reduction should reach 150 million tonnes by 2021.China consumed more than 200 billion cubic meters of natural gas annually and nearly 40 per cent of that came from imports. China would continue to rely on imports for a “very considerable period”, according to the magazine.China has had problems shifting from coal for heating. China had banned coal for heating in small towns and villages but did not have proper replacement systems in some cases.According to recent media reports, pupils at schools in some rural areas whose coal-fired heaters had been dismantled were forced to study outside – as it was warmer than inside – or run around to generate body heat.In a “double urgent” letter two weeks ago, the Chinese Ministry of Environmental Protection told authorities in 28 cities to relax the coal ban at places where the conversion process had not been completed.Super low cost nuclear heating option could be possible in a few yearsOn November 28, 2017, China National Nuclear Corporation officially launched a project to create a 400 Megawwatt Yanlong deep pool-type low-temperature heating reactor. A 400 megawatt Yanlong low-temperature heating reactor could heat as much as 20 million square meters, the equivalent of 200,000 three-bedroom homes.A demonstration reactor was already used to (49-2 heap) to heat 10,000 square meters of buildings (about 50 three bedroom homes) in the institute for 168 hours. This proved the feasibility of the pool-type low-temperature heating reactor and marked important progress for the China National Nuclear Corporation in the field of nuclear heating technology. It provided strong technical support for the follow-up of pool type low temperature heating reactor model development. China National Nuclear Corporation also established a research center for nuclear energy heating technology.The models of the pool type low-temperature heating reactor as “Yanlong” and “DHR-400” respectively. The heating reactor was developed in Yan, so its name included a “Yan.” The Dragon Series of reactors was researched and developed by China National Nuclear Corporation. Since the Chinese word for dragon is “long,” the reactor was named Yanlong. DHR-400 means district heating reactors, and “400” refers to the thermal power of the reactor, which is 400 megawatts.Pool type research reactors have been tested and safely operated for more than 50 years.Hundreds will be made to provide heat in Northern Chinese cities in the winter. This will prevent the burning of 500 million tons of coal every winter. District heating is fairly common in Northern Europe and Russia.District heating systems can vary in size. Some systems cover entire cities such as Stockholm or Flensburg, using a network of large 1000 mm diameter primary pipes linked to secondary pipes – 200 mm diameter perhaps, which in turn link to tertiary pipes of perhaps 25 mm diameter which might connect to 10 to 50 houses.The first DH system in Sweden was in operation in 1948, but the more rapid build-up of these systems started in the 1960s. Now virtually all Swedish towns have a DH system. District heating accounted for 86% and 69%, respectively, of the energy use for heating of multi-dwelling buildings and non-residential premises, while the corresponding proportion was 10% in one- and two-dwelling buildings Total DH production in 2007 amounted to 56.3 TWh (47.5 TWh was delivered) and was dominated by biomass, which accounted for 44% of the productionTypical annual loss of thermal energy through distribution is around 10%, as seen in Norway’s district heating network.Waste heat from nuclear power plants is sometimes used for district heating. The principles for a conventional combination of cogeneration and district heating applies the same for nuclear as it does for a thermal power station. Russia has several cogeneration nuclear plants which together provided 11.4 PJ of district heat in 2005. Russian nuclear district heating was planned to triple by 2015. Other nuclear-powered heating from cogeneration plants are in Ukraine, the Czech Republic, Slovakia, Hungary, Bulgaria, and Switzerland, producing up to about 100 MW per power station.China’s deep pool system will generate no electricity, but is designed for ultra low cost heat production.Each of the proposed heating plants would cost about 1.3 billion to 1.4 billion yuan (US$197 million to US$212 million) to build, a fraction of the price of a commercial nuclear power plan. The feasibility studies of DPR in some cities in China show that heating cost using nuclear energy is only one third of that by coal and only one tenth of that by nature gas.China uses 4 billion tons of coal each year to produce 3900 TWh of electricity. China uses 1000 GW of coal plants. They are talking about getting rid of 12.5% of the coal with these systems. Displacing 125 GW of coal usage for heating would require about 300 of the 400 MW thermal plants. It would cost about $60 billion.Each steel-and-concrete reactor pool measures about 10 meters in diameter and 20 meters deep, and holds up to 1,800 tonnes of water. A nuclear core is submerged in the water and can create up to 400 megawatts of heat to water to about 90 degrees Celsius for distribution through the city’s public heating network.\r\n\t\t\t\t\t\t\t\t\t\tRead next:\r\n\t\t\t\t\t\t\t\t\t\tWorld environment and China’s energy from now to 2050 »\r\n\t\t\t\t\t\t\t\t\t\t« The World in one hour – 3000 SpaceX BFRs by 2045 "}