{"id": "Oprah Winfrey, Reese Witherspoon, more to moderate Michelle Obama book tour", "paragraph": "Michelle Obama’s blockbuster book launch has officially added some serious star power.The former FLOTUS will be embarking on a nationwide tour this November to promote the publication of her memoir, Becoming, one of the year’s most anticipated titles. But she’s putting on the kinds of events more typical of A-list comedians and iconic musicians, taking over venues which hold tens of thousands of people, including the Barclays Center in Brooklyn, the final stop. Safe to say, the level of interest isn’t enough for your local Barnes & Noble to accommodate.Tickets had already been selling out fast. And there’s no reason that trend won’t accelerate with the latest news. Live Nation, the company producing the tour on behalf of publisher Crown, announced Tuesday the list of moderators for the book tour’s events. The shortlist: Reese Witherspoon, Sarah Jessica Parker, Valerie Jarrett, poet Elizabeth Alexander, Phoebe Robinson, journalist Michele Norris, and Tracee Ellis Ross. Oh, and to kick things off at the United Center in Obama’s hometown of Chicago, none other than Oprah Winfrey will be seated across from the author.While tickets are running north of $1,000, given the level of anticipation, “It is important to Mrs. Obama that her Becoming tour events are accessible to as many people as possible,” per Live Nation. Last week, it was announced that a selection of the local and community organizations would receive free admission to stops on the tour. In addition, 10 percent of ticket sales has been set aside for various organizations including, but not limited to, charities, schools, and community groups in each city the tour visits. And thousands of tickets will be given away.See below for the full schedule of events — and which stars will be moderating them.Becoming publishes Nov. 13, and tickets for the tour are available for purchase.Related content:"}