{"id": "Outlander: What to expect from season 4", "paragraph": "After three seasons, a hit show like Outlander is bound to unleash a prima donna. But of all the big personalities on the Starz drama, nobody expected it to be him.While shooting the first episode of the new season, Sam Heughan (Jamie Fraser) is doing multiple takes where he sings a Gaelic dirge in a dark and sweltering pub. But it’s not the star’s more-than-adequate crooning that is prompting the starts and stops. It’s the presence of a Northern Inuit puppy that plays Rollo, a half-wolf companion of Jamie’s nephew Ian (John Bell) that’s supposed to play a big role in the coming season (premiering Nov. 4 at 8 p.m.). Just when Heughan strikes a perfect tone with his lament, the dog ambles off camera.“He was a bit of a diva,” admits Bell after shooting the scene last October. “He ended up getting cut out of a lot of scenes. The bloopers are quite funny. It’s me constantly going, ‘Rollo, Rollo,’ and he’s just completely walking in the wrong direction.”Well, they are supposed to be in the land of the free, right? After a storm swept their ship from the Caribbean coast to a Georgia beach in the season 3 finale, Scottish Highlander Jamie and his time-traveling surgeon wife, Claire (Caitriona Balfe), shake off their sandy clothes and, along with Ian and their brood, make their way to Wilmington, N.C. Say goodbye to the kilts and castles, lassies. They’re in America now! “There’s an opportunity for a new beginning, a fresh start,” explains Balfe, 39. “Of course there are trials and tribulations. But overall I would say it’s much more hopeful this season.”Last winter, an amusing behind-the-scenes photo of Heughan on location in Scotland went viral because the photogenic star was bundled up in a heavy coat with his face barely visible. For someone who’s appearing in an adaptation of Drums of Autumn—the fourth book in Diana Gabaldon’s best-selling series on which the upcoming season is based—nothing about the picture screams scarecrows and pumpkin spice. It was a fair jeelit ootside, Sassenachs! (That’s hometown yammer for cold as hell.) But at least the snow provided “good texture,” reasons Heughan, since the woodland glens of Scotland needed to double for the equally wintry Blue Ridge Mountains this season. “It was all about establishing ourselves in this untouched wilderness,” adds the actor. “It was kind of fun to be a part of that and to see their settlement slowly grow from being the clearing in the forest to having an actual building.”  He’s talking about Fraser’s Ridge, the couple’s rustic homestead that sets the stage for the rest of the series. And yes, the studio that helps produce the series for Starz has every intention of adapting Gabaldon’s entire series of Outlander books for the premium-cable outlet. Though the drama has been renewed only through season 6—a feat in itself because networks typically like to order shows on a year-by-year basis—Sony, at least, has no expiration date for Claire and Jamie. “Every discussion I have with Starz is about completion of this book series,” says Chris Parnell, co-president of Sony Pictures Television Studios.First things first: letting the Frasers experience the American dream. The couple—together with their adopted son, Fergus (César Domboy), and his new wife, Marsali (the delightful Lauren Lyle)—have barely arrived in Wilmington when they encounter their first obstacle, an acquaintance who ends up assaulting Jamie while robbing Claire of a cherished memento. If you liked how the producers used a cover of Bob Dylan’s “A Hard Rain’s A-Gonna Fall” to dramatize the Jamie/Willie plotline last season, you’ll love how executive producers Matthew B. Roberts and Toni Graphia score the attack at the end of the premiere. “The title of the episode is ‘America the Beautiful,’ ” hints Roberts. “You can only imagine seeing this new world, then what happens to them once they get here. It’s actually horrific.”Now penniless, Jamie, Claire, and Ian travel by raft to the home of Aunt Jocasta Cameron (Maria Doyle Kennedy), a wealthy Southern widow with a butler named Ulysses (Colin McFarlane) and a plantation full of slaves to farm her crops. “Claire’s wary of her,” explains Balfe. “They never really get to get past that rift because of the slaves.” That drives the couple and Ian out into the wilderness, where they encounter a ghost, a racist German, and a very peculiar bear. There’s also a population of Mohawks and Cherokee—a significant subplot in Drums of Autumn that certainly ratchet up the action this season (along with the overall budget). Their costumes alone were a huge challenge for designer Terry Dresbach, who’s just as recognizable to fans as Heughan and Balfe themselves. (She’s also married to executive producer Ronald D. Moore, who helped launch the series on Starz.) “It was like dressing the Scottish Highlanders,” recalls Dresbach, who loves to engage fans on Twitter about the history of her costumes. (She also has a lively personal account that likes to riff on Donald Trump, but we digress.) “You’re talking about two groups of people whose culture was wiped out. At a certain point, you have to take all the research that’s available to you and jump.” To depict the Native Americans whom Claire, Jamie, and Ian encounter and ultimately befriend, production cast, flew in,  and housed roughly 200 indigenous extras from Canada to portray the inhabitants of a Mohawk village, which was constructed in a public park in Scotland. “It’s funny,” recalls Roberts. “Scotland has a right to roam, so we couldn’t actually close the park. You can only ask people to wait while we film. It’s an authentic Mohawk village that’s populated with people in costume. I remember a few dog walkers coming around the bend on a trail. They looked around like, ‘Wait a minute, what just happened?’ It’s almost like they touched the stones and went through time.”That is the point of Outlander, after all. One of the biggest questions in the coming season is whether the Boston-based Brianna Randall (Sophie Skelton)—the headstrong daughter of Jamie and Claire who was raised in the 20th century by her mom and her mom’s first husband, Frank—will travel back in time to meet the dad she never knew. A season 4 trailer seems to suggest the inevitable; there’s a quick flash of Brianna at the Craigh na Dun stones wearing period clothes and a determined expression. But the writers don’t want to ruin the surprise for their growing number of non-book-reading viewers, assuming she even makes the trip anyway. “Maybe she’s just looking at the stones,” teases Richard Rankin, who plays Roger Wakefield, a Scottish historian who falls hard for Brianna. “She might just be hanging out!”  Or maybe she’s paying close attention to the research Roger did on her parents’ whereabouts. His digging made it possible for Claire to return to Jamie last season, but it also has an adverse effect on Roger’s budding romance with Brianna. It certainly does nothing for their sex life. “As much as it’s pulled them together, it’s one of the things that’s pushed them apart,” explains Skelton. “Brianna just needs to separate herself and stand on her own two feet.”“I’ve been trying to beef up.” That’s Heughan speaking recently about his already rigorous workout regimen from the South Africa set of Bloodshot, his latest movie, in which he stars opposite Vin Diesel. (When asked if he could take the Fast & Furious actor, Heughan quips, “Absolutely.”) So much has happened to the Outlander family this year that has nothing to do with the actual plot: Heughan became an action star by appearing in The Spy Who Dumped Me; Balfe booked a big role in Ford v. Ferrari with Christian Bale and got engaged; Moore launched the sci-fi anthology Philip K. Dick’s Electric Dreams on Amazon; and Dresbach announced she was leaving the series. But the fans never stop talking about their favorite show (which typically airs only 13 weeks a year), posting memes year-round on social media and tagging the cast, who are intensely aware of their audience’s undying devotion.“There’s no escaping Outlander, as hard as you might try,” marvels Rankin, who went off to appear on the British series Midsomer Murders after he wrapped the Starz show. “I’m going to feel like this has taken over my life, but it kind of already happened.” Adds Heughan: “It’s so crazy to think that we’ve been doing this for so long now. When you get the opportunities to go do other stuff, it’s nice. But it also makes you realize what you have and how lucky you are. We were overjoyed they gave us two more seasons, and it feels like there’s a new life this season. It’s going to be refreshing and good for us all.” Welcome to the New World.The season 4 premiere of Outlander airs at 9 p.m. ET Sunday, Nov. 4, on Starz. And we’ve only just begun to focus on the Frasers! Join us for another season of Outlander Live! on EW Radio, Sirius XM 105, this Monday at 1 p.m. ET.Related: "}