{"id": "YOU boss explains the season 1 finale's big death and even bigger cliffhanger", "paragraph": "Spoiler alert: This post contains plot details from the season 1 finale of YOU.Joe and Beck’s love story has come to an end — a violent end.After Beck discovered Joe’s box of “treasures” in the penultimate episode of season 1 of Lifetime’s YOU, he locked her inside the cage at Mooney’s in the hopes that he could explain his actions and that ultimately, the two of them could be together. But when Beck couldn’t forgive Joe and instead tried to run, Joe killed his final victim of the season: Beck.The death mirrors what happens in Caroline Kepnes’ book of the same name — though the show chose not to show Beck taking her final breaths — but much about the episode surprised even book readers. Most notably, the surprise return of Candace was a twist no one saw coming.EW spoke with YOU showrunner Sera Gamble about the finale and what Candace’s return will mean for season 2.ENTERTAINMENT WEEKLY: Obviously Beck dies in the book, but did you all at any point consider not killing her and drastically changing the ending in that way?\nSERA GAMBLE: Everything is on the table. If there is a better way to get there, we would do it. We wanted to make sure that we went on the whole journey, because there are all of these little openings and possibilities for other endings. We really wanted to enjoy it and play it out. In my opinion, once you get into the cage stuff in episode 10, it feels completely inevitable, like how could it have ever been any other way? From the moment we met Joe in the pilot and saw that cage, it’s like that’s really the only place this woman could’ve ended.We have to talk about the moment in the finale with Paco and Beck. Why was it important to have that moment, and what did it say for Paco?\n                It’s just great drama. We wanted to make sure that we told a story where Joe was genuinely helpful to this boy and probably saved this boy from some of Joe’s own fate, but at the same time, everything that Joe imparts to Paco is a double-edged sword. And so while Paco really does need to be saved from his mom’s boyfriend, the stuff that Joe puts in his head to make it livable and okay for Paco to go through is exactly what dooms Beck. Once the code that Joe carries has been imprinted on Paco, that has violent consequences, in this case, for Beck. There’s no bad people in that scene — Paco is trying desperately to do the right thing, but how could he not feel an intense loyalty and belief in Joe after everything? Joe has really done everything for him.What was behind the decision not to show Beck’s death on screen?\n                Every time we had a moment of violence, we discussed how much of it we wanted to show on screen. There can almost be a pornography to showing a lot of violence against women on TV. If you’re going to show a man killing a woman, you have to really think about why you’re showing every single frame of it. In this case, part of it too is we wanted to capture Beck’s point of view in episode 10, and we wanted to be in her experience of this guy who turns out to be unhinged and trying to thread the needle so that she can get free. But ultimately, by the time you cut back and we’re in the bookstore and her book is being sold, we are in the point of view of Joe and we are in the romance in his head. To him, this is a romantic tragedy, a relationship that they couldn’t quite save, although he did everything he could for her, and so at a certain point it just felt like, okay, we’re with Joe and does Joe think about that moment? Absolutely not. He has probably blocked it out. It’s sort of like when he hits Peach with a rock and within the space of a minute and a half, the way that he talks to himself has managed to justify and erase a lot of the violence he just did against this woman.That’s an interesting point, that Joe does not see himself as that violent of a person and therefore would not want to remember the details of said violence.\n                Right. We’re in the [writers’] room now for season 2 and we talk a lot about that. It’s a crucial component of the character that he’s wiling to cross these lines in these very special, rarified situations, but he never really goes into these situations fully admitting to himself that murder is on the table. For that reason, these things are not as premeditated and clean as they could be. A lot of the dangling threads that we leave at the end of season 1 that might come back to haunt him in season 2 are about the fact that if he admitted to himself who he really was and what he was capable of, he could do a better job. But he doesn’t. He cannot admit to himself fully what his intentions are, and for that reason there’s a lot of seat-of-his-pants sloppiness on the day.That’s one of the things that makes Joe different from other portrayals of serial killers. It’s why I found myself feeling bad for him for even a brief moment when Beck locked him in that cage.\n                Yeah, that’s why he’s interesting to me as a character. The writers talk about this for hours and hours sometimes; we all had that experience at some point in our lives as viewers where we got to be in the mind of a ruthless serial killer and that was interesting and novel, but it’s been done so well by other people already, I don’t think that the show has too much to add to that. I think it’s much more interesting to watch somebody who has a complicated code and a complicated system of denial around the level of violence that he’s willing to do. I actually, in a sick way, I find it kind of relatable. I mean I’ve never killed anybody, but there’s a lot of stuff that I find myself doing that in retrospect I’m like, “I should’ve admitted to myself what my true intentions were. This would’ve gone a lot better.” It’s a fun thing to try to capture.How long was the Candace twist in the works?\n                Not from the very beginning, but certainly by the middle of the season, and I have to credit [executive producer] Greg Berlanti for that: He’s the one who pinpointed what the most amazing cliffhanger would be that also would allow us to streamline some of the storytelling about the “other women” in Joe’s story. So by the time we were in episode 6, when we were starting to flashback and really get to know Candace, we were aware that there was a bit of a misdirect happening where the more you believed that she was dead, the better. Toward the end of the book, a new woman walks into the bookstore, she goes by Amy Adam, and she sort of transitions him into his next story, and we just really liked the idea of combining some of those elements into Candace.You all have a season 2, and you have a second book, Hidden Bodies. But now you also have the Candace twist, which was not part of the books — how does her return affect season 2?\n                The only experience I know of adapting books is that as time goes on, you feel more and more like you are on parallel paths, that the book and the show might be going toward many of the same destinations, but the roads that they’re taking become increasingly different. Candace is just one example of things that we altered in the first season that will have repercussions through the second. Season 2 does take place in Los Angeles, and there will be a lot of characters and situations from book 2, but also we’re telling the continuing story of the TV show, so I think it’s going to be a nice combo platter for people who have read both books and really love them.Related content:"}