{"id": "Fantastic Beasts: The Crimes of Grindelwald charms box office with $26 million opening", "paragraph": "Controversies and poor critical reviews don’t seem to have an impact on Harry Potter fans because Fantastic Beasts: The Crimes of Grindelwald already made $100 million worldwide.The latest cinematic installment to J.K. Rowling’s wizarding world earned $25.7 million in ticket sales since opening in the U.S. with late Thursday night screenings. This puts it on track to reach upwards of $65 million domestically by weekend’s end, and the opening night tally adds to $74.3 million the film racked up internationally.The Crimes of Grindelwald, based on a screenplay by Rowling and helmed by longtime Harry Potter film director David Yates, earned an A CinemaScore from audiences. The response from reviewers wasn’t nearly as positive.The story continues the adventures of magizoologist Newt Scamander (Eddie Redmayne) after Fantastic Beasts and Where to Find Them. With dark wizard Gellert Grindelwald (the newly Relevio-ed Johnny Depp) amassing followers across Europe, Albus Dumbledore (Jude Law), Newt’s old Hogwarts professor who knew Grindelwald in his youth, tasks his former pupil to thwart these efforts.Katherine Waterson, Dan Fogler, Alison Sudol, and Ezra Miller also return for The Crimes of Grindelwald, which introduces Zoe Kravitz as Leta Lestrange, Callum Turner as Newt’s brother Theseus, and Claudia Kim as Nagini.“It is, well… a lot,” EW’s Leah Greenblatt writes. “And as Rowling piles on the mythology and backstories and subplots, the movie begins to feel a little bit like walking into a wind tunnel and being asked, in 134 minutes, to put the swirling pages of her wildly dense script back together.” Paired with far more merciless reviews, The Crimes of Grindelwald sits at an abysmal 39 percent “rotten” on Rotten Tomatoes.Drama surrounding one of the film’s stars also threatened to derail the debut. Rowling and Yates stood by Depp when the actor was accused of emotion and physical abuse by ex-wife Amber Heard two years prior. Depp denied the claims at the time and the two reached a settlement in 2016. In supporting Depp, Warner Bros. quoted a portion of the joint statement the actor released with Heard in the aftermath of the settlement, but Heard responded by sharing the remarks in full, adding, “To pick and choose certain lines and quote them out of context, is just not right.”“The fact remains I was falsely accused, which is why I’m suing the Sun newspaper for defamation for repeating false accusations,” Depp told EW. “J.K. has seen the evidence and therefore knows I was falsely accused, and that’s why she has publicly supported me. She doesn’t take things lightly. She would not stand up if she didn’t know the truth. So that’s really it.”Additional controversies swirled around the characters of Dumbledore and Nagini. Rowling confirmed her beloved Hogwarts headmaster to be gay, but Yates said the film wouldn’t “explicitly” feature that portrayal. Others took issue with the fact that Kim plays a character which sees a Korean woman eventually transforming into the pet of a powerful white man (Lord Voldemort).According to research from Fandom, however, these stories don’t seem to have an effect on Potterheads — and the box office numbers appear to support that.“What these fans are focused on is the deep, deep world of lore,” Angelina Fadool, Fandom’s director of content operations, told Variety. “Press and other external factors — good, bad, or indifferent — it doesn’t effect the world of the film for them.”Related content: "}