{"id": "Creator of Netflix's Bodyguard on drama's U.K. success and whether it'll get a season 2", "paragraph": "Beginning today, Netflix subscribers can see what the Brits have been so crazy about since August: the limited series Bodyguard, which stars Richard Madden as a troubled Afghanistan war veteran who has been assigned to protect Home Secretary Julia Montague (Keeley Hawes). We asked creator Jed Mercurio — a former doctor turned TV writer — to reveal the origin of the show and why there won’t be a season 2 (at least for now).ENTERTAINMENT WEEKLY: How did you get the idea for this?\n                JED MERCURIO: Well, I love writing thrillers. Here in the U.K., we haven’t had a thriller set in the political world for a long, long time. That was something the BBC got excited about when I first pitched it to them. It was really a case of trying to figure out the best way into the story. That led to the idea of the [Royalty and] Specialist Protection unit, an elite unit that looks after high-ranking politicians, royals, and diplomats, and protects them from external threats.Did you know early on that you wanted your protagonist to have PTSD?\n                It was actually part of a development process of the character. I looked to find ways that he would be developed away from being a kind of one-dimensional protector who was just heroic in every respect. What we wanted to do was create a character who could plausibly be part of the threat toward the politician. And one of the ways we looked at that was psychological trauma, psychological instability, and a very specific backstory relating to U.K. military operations in the Middle East.When you pitched the show, did you only want to do six episodes?\n                Yeah. It felt like that was the best way to find the focus of the story and to keep it very dynamic and fast-moving, and to be able to move through the twists and turns. There’s a lot of story to get through, but I like things to move fast, and that’s what we wanted to give to the audience. I think the result is a very dynamic piece of storytelling.Was it your idea to cast Richard Madden?\n                I actually worked with Richard before [on Lady Chatterley’s Lover in 2015], so he was a name that I threw in very early on. People got very excited about meeting him. He really wanted to do it, and because I’d worked with him before, I knew the qualities he’d bring, and that he would be a really great leading man. He would be meticulously well-prepared and work very hard on the show.You feature so many women in high-power roles.\n                I come from gender-balanced workplaces. I started off working in medicine, and when I went through med school, it’s 50/50 men and women. And when I started working as a doctor, it’s 50/50 men and women. So I’ve always been very accustomed to women occupying pivotal roles in the professional environment. What I’m doing is trying to show what’s going on in the real world. In terms of high-powered roles in the U.K., the head of the Metropolitan Police is female. The head of the National Crime Agency is female. We all know the prime minister is female. For most of the time when I was writing the script, the home secretary was female. There are great female role models out there, and I just feel very proud to be able to represent them in my work.How did the Brits react when the show debuted on the BBC?\n                We were overwhelmed with the reaction to the show. I mean, as a content creator all you can do is do your best work, and then hope that it resonates somehow with an audience. But we kind of really hit the ground running with this. The first episode was the biggest launch of a new drama in the U.K. for over a decade. And then as the series went on, it just started breaking record after record, and then by the end of the run with the last episode, it’s the most-watched drama episode since modern U.K. records began.When you met with the network, did they want you to make it longer? Are they already asking you to make more?\n                Not at all. One of the benefits of working for the BBC is that they’re very open to different formats. So with a drama season, we can do anything from four episodes to eight, as a standard first run. And six is kind of that sweet spot they like.How has this changed your life?\n                I’m still driving the same car. To be honest, I’m in the very fortunate position that I’ve got another show that is a returning and is actually shooting. Was shooting. It’s great that there’s been a fantastic reaction to Bodyguard, but my first order of business is to get this other show going. It’s Line of Duty, on Hulu in the U.S. It’s on Netflix in the rest of the world, and on the BBC. We’re doing season 5.Bodyguard is currently streaming on Netflix.Related content:"}