{"id": "Fantastic Beasts: The Crimes of Grindelwald is a fantastical film with too much story to tell: EW review", "paragraph": "There might not be a more gorgeous-looking movie this year than Fantastic Beasts: The Crimes of Grindelwald. Nearly every moment is visually ravishing — from the weird, wondrous creatures and sumptuous costumes to the fog-banked spires and cobblestones of 1920s London and Paris, all strewn with the dazzling fairy dust of J.K. Rowling’s singular imagination.If only she could point her wand at a fantastic plot and where to find it. Beasts plunges into its second installment with almost no preamble, presuming a deep familiarity and level of knowledge that millions of dedicated fans will no doubt rise to meet more than halfway, but that leaves uninitiated Muggles almost entirely in the dark.The film essentially begins with a prison break: Wizarding-world dissident Gellert Grindelwald (a crepuscular, chalk-haired Johnny Depp, looking like the jack-booted ghost of David Byrne and Julian Assange) has been held captive for months by the American Ministry of Magic. Their efforts to contain him in a planned transfer are clearly doomed; within moments he’s free, and off to chase his dastardly aims. (Though his titular crimes, as it were, remain largely unspecified — other than an obvious and possibly mass-homicidal disdain for the non-magique.)Smash cut to London and Eddie Redmayne’s Newt Scamander in his signature rumpled tweeds and side-swept tumbleweed of hair: a soul so recessively gentle that it feels almost cruel to drag him away from the delightfully mundane tasks of supernatural zookeeping and into the dirty, nasty business of saving the world.But save it he must, per the amiable but insistent request of his onetime teacher and mentor Albus Dumbledore (Jude Law, who brings a lovely, twinkling kindness to the role). The goal is to locate Credence Barebone (Ezra Miller), a crucial American Obscurial searching desperately for his birth mother in Paris. Though Newt is not-so-secretly hoping to run into his Dark-Arts–fighting friend Tina (Katherine Waterston) there too, with the help of her telepathic sister Queenie’s fiancé, the affably rotund No-Maj Jacob (Dan Fogler).There’s also Newt’s onetime school crush Leta Lestrange (a soulful, troubled Zoë Kravitz), now engaged to his brother Theseus (Callum Turner); French-African wizard Yusuf Kama (William Nadylam), on his own simultaneous hunt for Credence; a blood-cursed Maledictus named Nagini (Claudia Kim, bringing as much humanity as she can to the role of a woman constantly forced to morph into a python); and Nicolas Flamel (Brontis Jodorowsky), an immortal alchemist who gives Grindelwald a run for his galleons in the pale-wraith department.It is, well… a lot. And as Rowling piles on the mythology and backstories and subplots, the movie begins to feel a little bit like walking into a wind tunnel and being asked, in 134 minutes, to put the swirling pages of her wildly dense script back together.Director David Yates, a veteran of the Potter-verse who helmed the final four Harry films and the first Beasts in 2016, hurtles as well as he can through the entwined storylines, base-jumping gamely from scene to scene. Though it’s the Oscar-winning team of production designer Stuart Craig and costumer Colleen Atwood whose spectacular work makes the specifics of Rowling’s vision truly come alive onscreen, filling every frame with their own lush, mood-building brand of enchantment.Now two movies in, Beasts’ creators have pledged to complete it with a series with five features altogether. That’s three more chances to elucidate and explore the limits of her Fantastic universe — and to manifest not just the impressive sleights of hand seen so far but perhaps some real, sensical magic too. B-Related content:"}