{"id": "Gerard Butler reveals home was partially destroyed burned in California wildfires", "paragraph": "Gerard Butler has detailed the destruction to his home due to the California wildfires in a series of photos and videos.The actor shared his horrifying ordeal with his millions of followers on his Instagram story account Sunday after the deadly blaze known as the Woolsey fire burned his Malibu mansion.“Welcome to my home in Malibu,” the star said in the footage, in which he surveys the charred remains of his property. In another post, he thanked the members of the Los Angeles fire department and rallied for their support.“Returned to my house in Malibu after evacuating,” he captioned an image of himself at the rubble. “Heartbreaking time across California. Inspired as ever by the courage, spirit and sacrifice of firefighters. Thank you @LosAngelesFireDepartment. If you can, support these brave men and women at SupportLAFD.org. Link in bio.”In another post, Butler added that he was “one of the lucky ones” and his home was only “partially” destroyed. “My heart aches for all those who lost their homes and their lives in California. … A lot of people lost everything and will have to rebuild from scratch,” he wrote. “I am ok and so grateful for all of the well wishes. Please turn your support to those who need it most here, and throughout California.”Since the fire began to spread Thursday, a number of stars have lost their homes — Miley Cyrus, The Real Housewives of Beverly Hills star Camille Grammer, and singer Robin Thicke among them.“Sadly my house couldn’t be saved,” Grammer wrote alongside a horrifying image of her home burning. “The courageous firefighters were able to save my cars and personal items recovered from my home. I thanked the fire captain and his team of firemen for all of their hard work.”Thicke’s pregnant girlfriend, April Love Geary, shared the painful news in a post featuring an image of the gate to what was once their home.“Our house is gone,” she captioned the haunting image.It is estimated that more than 180 homes have perished in the disaster, which threatens Calabasas, Malibu, Agoura, Topanga, Hidden Hills, and West Hills.Amid the Woolsey fire and the nearby Hill fire, more than 250,000 people have been forced to flee their homes and move out of harm’s way — including several celebrities. Lady Gaga, Kim and Kourtney Kardashian, and Will Smith have all shared their brushes with the fires on social media.“Sending my prayers to everyone today,” Lady Gaga wrote. “I am thinking so deeply for everyone who is suffering today from these abominable fires & grieving for the loss of their homes or loved ones. I’m sitting here with many of you wondering if my home will burst into flames.”This post has been updated with more information.Related Content:"}