{"id": "Hot Stuff: October romance novels grapple with gender roles in provocative new ways", "paragraph": "Amidst the often steamy love stories and the guaranteed happily-ever-afters, romance is also a potent battleground to engage with gender roles. In historical titles, one can dig into the limitations of past times as a metaphor for our own world, while contemporary novels allow authors to teach readers what non-toxic masculinity looks like and how adhering to what is prescribed as the way a man or woman should behave is often a path to a stifling, unhealthy way of life.October romance titles delve into these issues in spades, whether it’s examining the lives of working-class women in the Gilded Age, introducing a softer masculinity in a modern male nanny, upending the traditional princess narrative, toying with old-fashioned Regency tropes, or putting a new spin on the cowboy genre.Here are 5 romance novels that made us swoon and think this month.Duchess by Design\nBy Maya Rodale\nReview: People love to designate romance novels as escapist. Especially historical romances that allow readers to escape into a world of glittering wealth and high society parties — and that is certainly true of many. But the true gems of the genre are both an escape and a palpable grappling with the lives and opportunities of women — Maya Rodale’s Gilded Age romance Duchess by Design is one of these gems. Miss Adeline Black dreams of becoming a fashionable dressmaker, upending the sartorial world with her daring addition of pockets to women’s clothing (something women are still begging designers for!). She craves independence more than romance and marriage and refuses to let even an accidental run-in with the gorgeous, yet financially insolvent Duke of Kingston, Brandon Fiennes, deter her from her dreams. But, of course, once the two begin spending more time together in a bid to display her gowns for New York’s Four Hundred Club as he hunts for an heiress bride, they find each other irresistible. Rodale previously told EW she wanted to flip the narrative here, making the heroine a woman entirely comfortable in her own skin, someone who knows her own value — while the hero has to work to prove himself worthy. She does this and then some. Adeline is the heroine we need in a time where it feels like the world is determined to silence, punish, and ignore women. She loves Kingston, yes, but her deepest, most subversive love is for that of her fellow woman. She leads with sisterhood first, protecting the Ladies of Liberty association advocating for suffrage and greater opportunities for women; employing women who’ve fallen on hard times; and most of all, championing the rational dress movement, which stressed pockets and more practical clothing for women (shorter skirts, no corset) to allow a freedom of movement necessary to work and get ahead in the world. Rodale’s writing is crisp and no-nonsense, underlined by a fierce inner passion when it comes to laying out the realities of these women’s lives. It can be heartbreaking to see how limited women, especially working-class women, were only a little over 100 years ago. How much our lives were (and sometimes still are) determined by reputation and absurd double standards. Adeline is the perfect mouthpiece for these concerns — her conversations with Kingston about why women might need pockets in their gowns is an electrifying piece of activism. Kingston, meanwhile, is the rare hero who has to move past so much more than his own angst — he has to find a way to make true change. Adeline challenges him to “change the world,” and the conflicts he faces are truly monumental, seismic shifts in social and cultural thinking. There is so much to love in this novel — from Rodale’s swoon-worthy descriptions of Adeline’s incredible, confectionary gowns (jaw-dropping mountains of tulle and chiffon and beauty) to the sensation of deep yearning that pulses off every page. But Rodale’s true gifts lie in making this a story of fierce women and soul-searching men. It may be set in the Gilded Age, but so many conversations in these pages feel utterly of this moment, allowing us to reflect on how far we’ve come and still have yet to go. Duchess by Design is a heartbreaking, soul-renewing, subversive tale of the limitations of gender and societal expectation and a reassertion of the world-changing power of love.\nHeat Rating: 🔥🔥🔥🔥\nGrade: A  Rafe: A Buff Male Nanny\nBy Rebekah Weatherspoon\nReview: It may be an outdated gender adage, but “sugar, spice, and everything nice” is the perfect way to describe this tasty morsel from Rebekah Weatherspoon, a stand-alone title which she emphasizes is majorly “fluffy” in her author’s note. But, oh, does it feel good to roll around and luxuriate in that fluff. Dr. Sloan Copeland is an accomplished cardio surgeon with two twin daughters, Addison and Avery. She is left in the lurch when her nanny up and quits with no warning. Enter Rafe Whitcomb, a buff, bearded, hot nanny who has a knack for wrangling rambunctious six-year-olds. Naturally, Sloan and Rafe have an immediate attraction to each other, which they make good on relatively quickly (on the kitchen counter, in the pool house, and more). Weatherspoon makes it clear from the word go that the book is low angst, but she still ratchets up the tension in key moments with a large ensemble of characters, including Rafe’s admirably emotionally-open father and Sloan’s gaslighting scumbag ex. Rafe is a thirst trap extraordinaire — from his skills in the kitchen (you will be so hungry for bacon quiche after reading) to his skills in the bedroom and his gentle, loving hand with Sloan’s kids. Sloan questions falling for someone so quickly, but Weatherspoon makes it easy to see why he’s irresistible. Weatherspoon nails the balance between gooey, heartwarming moments with Sloan’s twins and jaw-droppingly sexy moments of connection between Rafe and Sloan. On top of that, Weatherspoon praises softness in masculinity, while allowing her heroine to shine as a professional, ambitious woman. Rafe is a hero for this moment — a ripped ginger teddy bear who values children, women, and his softer side, while Sloan is unabashed about her desire on every level — something the novel fabulously champions. There’s really no way to describe this novel but to say reading it is like alternating between enjoying bites of a warm chocolate chip cookie interspersed with tastes of a habanero pepper — fuzzy and delectably sweet interrupted by bursts of heat that will leave you flushed. Weatherspoon has offered up a delicious treat that also admirably serves as a much-needed antidote to toxic alpha-male masculinity — a sexy tale you’ll want to add to your TBR pile yesterday.\nHeat Rating: 🔥🔥🔥🔥🔥\nGrade: A-  Barbarous\nBy Minerva Spencer\nReview: Minerva Spencer continues her “Outcasts” series with Barbarous, the tale of Hugh Redvers, a.k.a. One-Eyed Standish, and Lady Daphne Davenport. When Hugh returns to his ancestral seat after many years presumed dead (and serving as his majesty’s most roguish privateer), he upends Daphne Davenport’s life. Not only is he infuriatingly handsome, but he’s also the man she secretly has cheated out of his inheritance. Spencer’s story begins as a promising swashbuckler, but remains more land-logged than one might hope. Daphne wrestles with revealing her secret to Hugh with heaps of hand-wringing that tends to feel overly protracted, rather than a genuine source of conflict. Though the book deals with a bevy of sensitive issues, including sexual assault and slavery, the way it tackles them feels shallow, failing to really engage with the true trauma or angst of such things, but instead using them as an emotional short-hand for the character’s wounds. The novel’s brightest moments are its most fever-pitched — the electric charge of its love scenes and the palpable adventure of its action scenes, which range from a dangerous ride on horseback to a thrilling sword fight. Spencer writes with palpable gusto when her characters face either untold pleasure and temptation or threats to their life, but the quieter moments in between can bog things down. Barbarous is a swashbuckling good time (if a little too surface level where it counts) that needs more wind in its sails.\nHeat Rating: 🔥🔥🔥🔥\nGrade: B-  The Royal Runaway\nBy Lindsay Emory\nReview: With The Royal Runaway, Lindsay Emory offers a new royal romp for readers to lose themselves in. Princess Theodora Isabella Victoria of Drieden is not super in love with being a princess, particularly because her royal consort-to-be jilted her on their wedding day, making her the laughing stock of the tabloids. When she sneaks out of the palace and meets the sexy Scottish Nick, she finds herself in for the adventure of her life, as she learns he’s a spy embroiled in international intrigue involving her missing fiancé and her royal family’s finances. Emory has crafted a brisk, laugh-out-loud thriller that, while placing her characters in very real danger, never loses its playful spirit and winkingly sardonic tone. Thea is a whip-smart princess for the modern era, not content to wave and smile at charity events while the real world happens around her. Real sparks fly between her and Nick, and their connection, intense yet unlikely, is palpable from the first pages they meet. The story’s greatest strength is its twisting spy tale, as it takes one unexpected turn after another. Nick and Thea’s romance is fueled by the danger (nothing like life-or-death stakes to make a kiss extra steamy), but it’s the mystery that they (and the reader) really want to get to the bottom of while the love story can occasionally take a backseat. Emory’s voice makes the story work — Thea feels like Meg Cabot’s Princess Mia flung into a John Le Carré novel as she deftly balances the humiliations a princess must endure with the far graver stakes of international spy-craft. The novel isn’t afraid to paint royalty and the privileges they enjoy with a gimlet eye, acknowledging that being a princess is more akin to being a prisoner in a gilded cage some days. Thea’s sharp wit shines from the first pages and her espionage escapades with Nick are often truly swoon-worthy, but it’s her determination to be a princess on her own terms that really makes her sing. Nick, in contrast, can feel slightly underdeveloped, though it’s hard to complain when it comes at the expense of such an exhilarating tale of female empowerment and happily-ever-afters. If you can’t get enough of the royals from the news, The Royal Runaway should whet that appetite while providing a tantalizing (and entertainingly sarcastic) glimpse behind the decorum of the public face of a monarchy.\nHeat Rating: 🔥🔥🔥\nGrade: B+  Big Bad Cowboy\nBy Carly Bloom\nReview: Look, I’ll be honest, despite reviewing several cowboy books in this column, I’m not the biggest fan of the sub-genre. It often feels trapped in outmoded gender roles and more than any other subgenre in romance falls subject to pitfalls surrounding consent, diversity, and more. Carly Bloom’s first “Once Upon a Time in Texas” novel is the rare cowboy book to steamroll through those tendencies while still offering up all the Stetsons and ranching any cowboy lover could want. Disguised as the Big Bad Wolf at a Halloween party, Travis Blake has a steamy hook-up with Maggie Mackey (Little Red Hiding Hood, natch) only to discover that his fiery fling hates him for threatening her local landscaping business. As Travis struggles to raise his nephew and find his footing in his Texas hometown, Maggie finds herself falling hard for him despite her initial annoyance — but she still doesn’t know he’s her mysterious Halloween hook-up. Relying on tropes like mistaken identity and enemies to lovers, Bloom offers up a fresh, fun entry that spears toxic masculinity as Travis wears his heart on his sleeve and encourages considerate behavior and tolerance in his nephew. Maggie and Travis have an electric connection, and Bloom deliciously pens witty banter that devolves into hot and heavy moments with flame-fanning aplomb. Travis wants to correct the sins of his gruff father and felon brother, volunteering his time and resources around the time in small ways that reflect his open-hearted, progressive nature. Bloom toys with the alpha male narrative of the cowboy romance by relying on Travis’ alter-ego as the Big Bad Wolf to be the commanding presence in the bedroom, all the while undercutting that with Travis’ emotional openness and desire to connect with Maggie and his neighbors in genuine ways. There are a few odd moments where Bloom discusses romance novels with the condescension typically reserved for those who’ve never read a romance — but this is more an extension of her characters, not reflective of her own views, and she sharply turns this criticism (and hypocritical naysayers who castigate it as literary porn) on its head. Big Bad Cowboy is all about the dance it does to both fulfill the expectations of its sub-genre, while constantly surprising readers at every turn. It’s a smart, sizzling read that engages believably with a Texas that, for once, feels utterly of our time. The book starts with a fairy-tale meet-cute of a Wolf and Red Riding Hood, but that disguise and Travis’ struggle to come clean about his identity are an apt metaphor for the novel as a whole as it operates on two levels. In addition to its incisive handling of gender roles and expectations, the novel even engages effectively with an LGBTQ subplot without veering into after-school special territory. Big Bad Cowboy is a progressive, witty, and surprising novel dressed up as a traditional, straightforward cowboy romance — a sensual wolf in its sub-genre’s sheep’s clothing. And that’s something that leaves us howling for more.\nHeat Rating: 🔥🔥🔥🔥🔥\nGrade: A-Related Links:"}