{"id": "Marvel's Daredevil boss on season 3's epic one-take fight scene", "paragraph": "Warning: This article contains spoilers from episodes 1-6 of Marvel’s Daredevil season 3. Read at your own risk! Marvel’s Daredevil has outdone itself with its latest hallway fight scene™.In “Blindsided,” season 3’s fourth episode, Matt Murdock (Charlie Cox) visits a prison to meet with the Albanian gang because he wants to know why Wilson Fisk (Vincent D’Onofrio) sold them out. Unfortunately, he ends up getting more than he bargained for because Fisk, who suspects he’s Daredevil, becomes aware of his presence there and essentially turns the entire prison against Matt. Cue: An extended, 11-and-a-half-minute long fight sequence that was actually shot in one-take (there aren’t any hidden cuts) and follows Cox’s Matt — who’s still recovering from, you know, having a building collapse on him — as he punches his way out of the prison, confirming Fisk’s suspicions in the process. Basically, the impressive set pieces look at season 1’s original hallway brawl, says “hold my purse,” and proceeds to blow it out of the water, which was exactly the goal when it was pitched to showrunner Erik Oleson (Arrow, Man in the High Castle).“The director of the episode, Alex Garcia Lopez, the writer of the episode, Lewaa Nasserdeen, and the stunts team came to me with the crazy idea of doing it as a oner as an homage, and then one-upping of the hallway fight scene in season 1,” Oleson tells EW.Turn around and walk the other way. pic.twitter.com/rdR8XFkGIj— Daredevil (@Daredevil) October 18, 2018Once Oleson signed off on it, he had the responsibility of then informing the studio that he was giving everyone a day to rehearse the entire sequence before shooting it the next day.“That was something no one had ever done before at Marvel. It was somewhat agita inducing, but when the crew finally pulled it off, it was something spectacular that injected adrenaline into the crew for the remainder of the season,” he says. “It really was a team sport. There were dozens of stuntmen involved. There were places where the crew had to quickly hide around a corner while the camera was shooting in a certain direction. Any one person could have messed up this epic oner, so it required every single member of the crew to work in perfect sync. The fact that they pulled it off is just mind-blowing.”They included some points in the sequence where they could hide a cut if they really had to, but thankfully they didn’t need to, and Oleson took steps to make that clear during the editing process. “What I ended up doing in post-production is actually [increasing] the lighting in certain hallway shots so that the audience could see that we never cut the camera, we never actually cheated and did this as a series of cuts made to look like a oner. It is a true oner.”For Oleson, the amazing stunt is more than just a cool scene; it’s actually an integral part of the story and emblematic of one of the rules he set for the show when he took over as showrunner.“What I wanted to do with season 3 of Daredevil is to make the action sequences matter in ways that reflected on characters, or had real stakes,” he says. “There’s something to be said for the fun spectacle of action sequences, but in a lot of cases, it’s the fun of watching great stunt-work. For me, the best writing is one where the action sequences are an inherent part of the story and you cannot predict that the action is going to turn out a certain way. When an audience knows going in that the hero is going to be fine and they’re just going to watch a cool action sequence like a musical number, to me, it’s fun but it stops the story.”In his mind, the episode 4 scene achieves that goal of reflecting character. “We saw Matt has to cast aside any hope of maintaining his secret identity. He didn’t have the luxury pulling on a cowl. Instead, he had to fight his way out of the prison to survive and knowing the whole time that Wilson Fisk was watching and that he was confirming to Fisk that he and Daredevil were the same person. That scene to me has real stakes just beyond the fight,” says Oleson, who also points to the newsroom brawl in episode 6 as another example of this goal because Matt actually loses. “There are real consequences to that action sequence. To me, those are the best kind of action sequences in movies and television.The complete third season of Marvel’s Daredevil is available to stream on Netflix now.Related content: "}