{"id": "Amy Schumer turning down Super Bowl ads to protest ‘endless racism people of color face’", "paragraph": "Amy Schumer is urging fans to take action against the NFL in an effort to highlight discrimination.In an Instagram post on Friday, the comedian called attention to the Football League’s handling of Colin Kaepernick’s National Anthem protest in 2016, implying that those who ignore racial tensions in the U.S. are complicit.“I wonder why more white players aren’t kneeling,” she wrote. “Once you witness the truly deep inequality and endless racism people of color face in our country, not to mention the police brutality and murders. Why not kneel next to your brothers? Otherwise how are you not complicit?”Schumer’s statement comes following news of Rihanna’s decision to turn down the Super Bowl Halftime Show, reportedly as an act of support for Kaepernick.The San Francisco 49ers quarterback is currently embroiled in a legal battle against the NFL, alleging that they have colluded to keep him off the field as a result of the protest, in which he knelt as a means of calling attention to police brutality against African American men.Schumer not only praises the singer for the move but encourages the members of Maroon 5, who are slated to take the stage during the game next year, to drop out.“I think it would be cool if @maroon5 backed out of super bowl like @badgalriri Did,” she added.She then revealed she wants no part of the annual sporting staple and intends to turn down any commercial appearances associated with it.“I personally told my reps I wouldn’t do a Super Bowl commercial this year,” she posted. “I know it must sound like a privilege ass sacrifice but it’s all i got,” she wrote. Schumer added.The 37-year-old previously appeared in a series of politically charged Bud Light commercials opposite Seth Rogen during the big game in 2016.Over the course of her career, Schumer has been vocal on a number of hot-button issues. She was arrested last month while protesting Brett Kavanaugh’s appointment to the Supreme Court and frequently speaks out on the subject of gun control – often referencing the three shooting deaths that occurred during a showing of her film Trainwreck in 2015 at a theater in Lafayette, Louisiana.Schumer called attention to the difficulty of her battle against the NRA in the post, before rallying her followers to take action even if it appears to be in vain.“I know opposing the nfl is like opposing the nra,” she shared. “Very tough, but don’t you want to be proud of how you’re living? Stand up for your brothers and sisters of color.”The 2019 Super Bowl will be held at Atlanta, Georgia’s Mercedes-Benz Stadium on February 3.Related content: "}