{"id": "See Superman and Lois Lane on the Kent Farm in new Arrowverse crossover photo", "paragraph": "Welcome home, Smallville!EW is debuting a new image from this year’s “Elseworlds” crossover that shows Superman/Clark Kent (Tyler Hoechlin) on the Kent Farm with Lois Lane (Elizabeth Tulloch), who makes her Arrowverse debut in the three-night event that includes The Flash, Arrow, and Supergirl. The photo, which you can see below, is an angle from Supergirl star Melissa Benoist’s first scene with the pair and was shot on the same farm that Smallville used during its 10 season run.“I felt like we should’ve been eating apple pie and waving American flags. It was such Americana, and there were pickup trucks and Lois Lane had a toolbox and was working on a car,” Benoist tells EW. “That iconic relationship of Lois and Clark, [Tyler and Elizabeth] have just totally embraced it.”Check out the photo below, and then read on to find out what you can expect from the Man of Steel and Lois Lane in the crossover.The fact that Superman and Lois Lane are even part of the story is pretty unreal because DC Comics tends to reserve those characters for the big screen (Hoechlin has appeared in four episodes of Supergirl). However, when the executive producers and the network had their first crossover meeting last March, Arrowverse mastermind Greg Berlanti had already received permission to use Superman. Lois entered the mix once they started breaking the story in what Arrow showrunner Beth Schwartz refers to as the Super Writers’ Room, which included Berlanti, EPs and writers, Geoff Johns, and Batwoman‘s Caroline Dries.“When we were talking about the story we wanted to send Clark on in the crossover, we were talking about different elements and that’s when we started talking about Lois,” says Supergirl co-showrunner Robert Rovner. “We’ve always wanted to bring Lois onto the show. She’s such a great character and we were just excited to be able to have her and she organically fits into the story we were telling in the crossover.”Benoist promises that fans won’t be disappointed by Tulloch’s portrayal of Lois. “She is such a force to be reckoned with, and Elizabeth is perfect for it,” says Benoist. “The way they’ve written her in this world, she’s a firebolt and really sassy and awesome. I think people will really respond to her.”Superman’s place in the story is directly related to where Supergirl‘s eighth episode of the season. “Kara is coming out of the midseason finale at a crossroads, and the journey that she’s on is kind of helped by Clark, who is returning from Argo kind of on his own journey,” says Rovner, adding that the Supergirl writers pitched using the Smallville farm because “it kind of seemed like the organic place for them to meet” given where the Kryptonians’ heads are at when the crossover begins.“Elseworlds” will also mark the first time that the Green Arrow (Stephen Amell) and the Flash (Grant Gustin) share the screen with Superman in the Arrowverse. If you think you’re excited about this, you aren’t alone. Gustin was also freaking out about it when he and Amell took a photo with Hoechlin.“That was just like genuine, ‘What are we supposed to do for this photo?’ I was so flustered when I saw him in that thing,” says Gustin, referencing Hoechlin’s black Superman costume. “I hadn’t worked with Tyler at all as Superman, so that was the trippiest thing I’ve experienced so far on the show.”🤯🤯🤯 pic.twitter.com/vkqQHTkSGq— Stephen Amell (@StephenAmell) October 15, 2018 “Elseworlds” begins Sunday, Dec. 9, with The Flash at 8 p.m. ET; continues Monday, Dec. 10, at 8 p.m. ET with Arrow; and concludes the following night at 8 p.m. ET with Supergirl.Related content: "}