{"id": "Why quirky aunts are the real winners of Halloween", "paragraph": "These days the Sanderson sisters get all the glory. They’re bold, they’re funny, they’re innovative — a vacuum cleaner as a broom! — and their hair is a marvelous feat of engineering (especially for the 1600s, when the field of engineering was all but undeveloped). Hocus Pocus is a fan favorite and, as such, so are Winifred, Mary, and Sarah. No one is trying to take that away from them, but it’s high time for some, er, fresh blood to get all the glory.After all, sister witches are all well and good (evil), but our personal favorite Halloween entertainment comes with a slightly different phenomenon: Aunts. Witchy aunts, to be specific.These two (played by the inimitable Cloris Leachman) aren’t just sisters, they’re…twins. The perfect embodiment of good and evil. If you couldn’t tell from the names: Sofia is the good witch, clad in angelic white lace and a Victorian-era…well, everything, and Agatha is the bad witch, decked out head-to-toe in fabric fit for a séance. Their long-standing sibling rivalry drove Agatha to conjure a truly wicked spell, banishing Sofia into the other side of a mirror for what could possibly be all eternity (no spoilers here!).The separation allowed each of them to really lean into the quirky aunt persona — Sofia because she was clearly bored to tears inside that mirror, and Agatha because, well, witch leaders are quirky! Who has time to stay on the right side of sanity when you’ve got those gatherings to plan?The creators of Double, Double Toil and Trouble — which also stars real twins, Mary-Kate and Ashley Olsen — clearly wanted the audience to empathize with Sofia, captive prisoner that she is, but Agatha has some qualities worth chuckling over. Mainly, she’s managed to use her magic powers to topple her own corner of the patriarchy.Practical Magic‘s pair of aunts — played by Stockard Channing and Dianne Wiest — is quite literally living the dream. They’re holed up in a beautiful historic home in the quaintest seaside town, they have two adorable nieces (Sandra Bullock and Nicole Kidman), and they eat chocolate cake for breakfast. What’s eccentric about that, you ask?Well, there’s the fact that they do happen to practice witchcraft and teach it — semi-subconsciously — to their young steeds. And then there’s the slight issue of the family curse that kills any man who happens to fall in love with one of the Owens women. Frances and Jet have become a wee bit obsessed. It’s understandable, seeing as the issue is pretty life-altering, but we fear it’s started to take over. Luckily for all involved, their eccentricity has contributed to a wicked taste in caftans.The show’s namesake high-schooler is the technical star of the Spellman family, but her magic-making aunts Hilda and Zelda (Caroline Rhea and Beth Broderick) are the queen of our hearts. They’re hilarious, sage, wise, just a dash of evil, and all-around the best guardians a teen witch could ask for. Zelda and Hilda may be, arguably, the least quirky of all the pop culture witch aunts — they’re actually pretty glamorous — but let’s not ignore some of their best eccentricities.First, they’re always brewing up potions and accidentally setting them astray. Magic hijinks! Second, they’ve owned both a clock shop (the ultimate locale for the idiosyncratically inclined) and a coffee shop called Bean There, Done That. Zelda is a scientist and a college professor, which couldn’t be a quirkier profession if she tried. Oh, and not to buy into the cat lady conspiracy (there is nothing eccentric about a single woman owning a cat!), but Salem, the one that lives at Chez Spellman, talks. That’s weird. Now, if you’ll excuse us, we’re off to shop for a few floor-length duster sweaters and a feather boa."}