{"id": "Rosamund Pike is a flawed but fascinating heroine in A Private War: EW review", "paragraph": "In the solid Jon Hamm terrorist drama Beirut, out earlier this year, Rosamund Pike’s turn as a CIA staffer–slash–obligatory love interest fell somewhere between moral support and set decoration; while men battled and bombs fell, she was consigned mostly to furrowing her brow and looking lovely in a flak jacket.A Private War offers a lot more red meat in the role of legendary real-life American correspondent Marie Colvin, a kind of combat-journalism rock star whose byline in London’s Sunday Times signaled the lead story at nearly every global hotspot of the past three decades.Colvin, who lost an eye covering the Tamil Tigers in Sri Lanka and insisted on wearing La Perla lingerie beneath her khakis even (or especially) in the bloodiest combat zones, is exactly the kind of swaggering, larger-than-life figure biopic dreams are made of. And Pike is more than game to try, though she can’t quite shake her English-rose delicacy — even with the cover of a frizzy fawn-colored perm and cigarette-battered Long Island accent.A woman whose approach to nearly everything seemed to be to charge directly toward it, Colvin drank hard, chased the most dangerous stories, and lived with a sort of scorched-earth intensity that often left her best friend (Nikki Amuka-Bird), her boss (Tom Hollander), and her lovers (Greg Wise, Stanley Tucci) struggling to keep up. Even the ex-soldier–turned–photographer she chose to accompany her on some of her riskiest expeditions (a neck-bearded, nicely understated Jamie Dornan) comes off less like a colleague than an anxious, trailing sidekick.But few writers could find the story on the ground like she could, infusing hard reporting with sharp humanity and heartrending detail. And director Matthew Heineman, who made his name with award-winning documentaries Cartel Land and City of Ghosts, clearly knows the territory better than most. Though he struggles to bring some of the more conventional narrative bits and exposition alive, the movie finds its rhythm as it goes, toggling between the sheer terror and adrenaline of embedding in the world’s ugliest conflicts, and the murkier traumas of bringing that knowledge back home.By the time the narrative comes to Colvin’s greatest get — she was essentially the first Western journalist to get inside Homs and refute Syrian President Bashar al-Assad’s bold-faced lie that he wasn’t bombing his own people into oblivion — the price of that sacrifice, and the power of her story, feels finally, fully real. Whatever her private battles, War works hard to be the public reckoning her work deserves. B+"}