{"id": "Bill Maher trashes comic book culture after Stan Lee’s death, sparks outrage", "paragraph": "Bill Maher kicked the Marvel Wasp nest with a baffling post published to his blog this week.The HBO late-night host wrote a response to the death of Stan Lee in which he criticized those mourning the comic book giant, trashed modern comic book culture, and suggested: “Donald Trump could only get elected in a country that thinks comic books are important.” Naturally, it was not received well by all.“The guy who created Spider-Man and the Hulk has died, and America is in mourning. Deep, deep mourning for a man who inspired millions to, I don’t know, watch a movie, I guess,” Maher began the post, which he titled “Adulting.” “Someone on Reddit posted, ‘I’m so incredibly grateful I lived in a world that included Stan Lee.’ Personally, I’m grateful I lived in a world that included oxygen and trees, but to each his own.”“Now, I have nothing against comic books — I read them now and then when I was a kid and I was all out of Hardy Boys,” he continued. “But the assumption everyone had back then, both the adults and the kids, was that comics were for kids, and when you grew up you moved on to big-boy books without the pictures.”Maher went on to write how, in the past 20 years, “adults decided they didn’t have to give up kid stuff” and “pretended comic books were actually sophisticated literature,” while “some dumb people got to be professors by writing theses with titles like Otherness and Heterodoxy in the Silver Surfer.”“And now,” he continued, “when adults are forced to do grown-up things like buy auto insurance, they call it ‘adulting,’ and act like it’s some giant struggle.”Maher concluded his blog post by claiming our culture hasn’t “necessarily gotten stupider,” we’re just “using our smarts on stupid stuff.” He added, “I don’t think it’s a huge stretch to suggest that Donald Trump could only get elected in a country that thinks comic books are important.”Reps for Maher did not respond to EW’s request for further comment. HBO declined to comment, emphasizing “these blogs are Bill’s voice.”Admirers of Lee, fans of comic books, and comic book creators seemed stunned and angered by these comments, especially as they were written in connection to Lee, who passed away at the age of 95 days earlier.“Bill Maher dismissed an entire storytelling medium? Wow. He’s so highbrow,” Tom Taylor, best-selling write behind DC’s Injustice: Gods Among Us, tweeted. “His brow is so high, there’s probably less room for a mind.”Folks like Spider-Gwen and Southern Bastards‘ co-creator Jason Latour were more brief. “Newsflash: Bill Maher is still a dips—,” he wrote.Maybe it’s because I’m English but seeing some stuff on line about a blog post from this Bill Maher bloke trashing comics and Stan Lee. So I’m just wondering, who the badgery-Christ is Bill Maher? Other than an arsehole, obviously.— BRYAN HITCH (@THEBRYANHITCH) November 16, 2018I also notice that people who shit on comics as irrelevant don't usually read them or haven't since they were kids many decades ago. Kind of like hating opera, even though you can't name a single one you've ever seen or listened to.— Darick Robertson (@DarickR) November 17, 2018One need only look at how comics are dominating every field of screen entertainment, and still growing, to prove that the ideas born of comics in the last 40 years, are shaping the modern Television and movie landscape.— Darick Robertson (@DarickR) November 17, 2018Lol. #billmaher Just upset because nobody will mourn him when he dies.— Scott Snyder (@Ssnyder1835) November 17, 2018Bill Maher dismissed an entire storytelling medium?Wow. He's so highbrow.His brow is so high, there's probably less room for a mind.— Tom Taylor (@TomTaylorMade) November 17, 2018Newsflash: Bill Maher is still a dipshit.— Jason Latour (@jasonlatour) November 17, 2018Correction: An earlier version of this article described Maher’s site as his “Real Time blog,” but a rep for HBO emphasizes “these blogs are Bill’s voice.”Related content:"}