{"id": "Norman Reedus shares secrets from Andrew Lincoln's last day on The Walking Dead", "paragraph": "We’ve already revealed some behind-the-scenes secrets about what went down on Andrew Lincoln’s last day on set of The Walking Dead, but we have another key witness with stories to share as well. Norman Reedus, who has been battling zombies alongside Lincoln for nine seasons — while also engaging in an epic prank war for almost as long — has some incredible memories from that final day of filming.From tickling Lincoln’s feet during his final scene to taking in an emotional goodbye speech, Reedus says it was a day to remember, and now the actor brings us up to speed on what actually went down. He also talks about adjusting to LAA (Life After Andy) and the bloody and bizarre souvenir he kept in his trailer to remind him of his missing partner in both crime and grime.ENTERTAINMENT WEEKLY: So I was lucky enough to be there for Andrew Lincoln’s last day. Tell me what that was like for you.\nNORMAN REEDUS: In true Andrew Lincoln form, he was spectacular. The very last scene that we shot, he’s supposed to smile. He was supposed to smile, and it was a close-up. So I kept sneaking in and tickling his feet and making him smile on this one line. And I thought it was funny. And he liked it. He kept asking me to keep doing it. So the last scene that he shot on this show, I’m below camera tickling his feet.And then he had some words for the cast and crew, didn’t he?\nYeah, he got up and he gave a little speech to the crew, and asked us to keep the fight going. And this show’s not over. To honor Andy, we still fight the good fight on this show, and try to tell the best stories we can, and give it 1,000 percent in his honor, as well as all the other people that have been on the show. But he asked us to do that. And he believes in us, and he believes in the show, and he believes in the stories. And he was like, “Don’t you dare f—ing slow down one second.”He got up, and before the speech a lot of people pulled out their cell phones and wanted to record it. And he held up a hand and he said, “Everyone, please put your phones away.” He’s like, “Just, can you put them down?” He goes, “This is for us. This is our time. This is our moment here. This isn’t a social media moment, this is for us. This is what we fight for every day, and this is our family.” And I thought that was such a cool thing to do.Everybody understood it, and everybody got it, and it felt so right. And that’s the kinda guy that guy is. He’s not in it for the likes, and he’s not in it for the followers, and he’s not in it for the look-at-me-whatever-I’m-doing. He’s in it for the real stuff, which is why he says he needs to quit the show and be with his kids, ’cause he’s been away for almost a decade, you gotta let him do it. That’s real life stuff. And that’s the kinda guy he is. And honestly, I’ll have that guy’s back forever.Was it weird at first after he left and you guys kept rolling? And has it been weird with him not being there?\nDude, it’s been weird as f—, I won’t lie. I still send him scripts. When no one’s looking, I email him scripts, and he gives me notes still to this day. It was weird, I have to tell you.The weirdest part for me was the day after he was gone, and I came to set to work, and it was kind of a quiet day on set. Not because everybody was in mourning, it was just because I wasn’t really working with many people. There wasn’t really many people there. And then we worked in the morning, and it’s all hard work, and then we go out to lunch. And I always take my lunch back to the trailer because it’s so hot outside that I have to have air conditioning or I’m gonna pass out. So I take my lunch back to the trailer, and I’m just kinda sitting there quietly for a good 45 minutes. ’Cause I’ve never not had lunch in my trailer with him in nine years. We always get my lunch and go back to my trailer, the two of us. So I just kinda sat there quietly, like, where the f— is Andy right now?That was the hardest part for me. It’s all healed itself, but I have to say eating lunch by myself in my trailer was really, really weird. It made me really depressed. In my trailer right now, one of the chairs in there is covered in blood and it’s from Andy Lincoln’s last day. He had somebody’s blood all over him, and he left my chair covered in blood. And I still won’t let the cleaning guys clean off that chair, because that bloody chair reminds me of Andy every day. The whole trailer’s really clean except for one chair that’s covered in blood.Make sure to read our account of Lincoln’s last day as well as written tributes from cast-members past and present. And for more Walking Dead intel, follow Dalton on Twitter @DaltonRoss."}