{"id": "This Is Us producer on Kate's pregnancy news, Toby's spiral, and Randall's run", "paragraph": "Of the multitude of subjects that Tuesday’s This Is Us covered, pain that is repressed, secreted away, or otherwise not processed played a significant role. The last scene of “Toby” brought a new clue about the traumas that Jack (Milo Ventimiglia) experienced while serving in the Vietnam War but never shared with his family. On the hunt for more information, Kevin (Justin Hartley) received from Robinson (Charles Robinson), who served with Jack, a handful of his letters. The big reveal? A photo of Jack and the Vietnamese mother (Porter Duong) whom we met in last week’s episode — and she was wearing the necklace that Jack had given Kevin.Of course, there was another revelation in “Toby”: Kate (Chrissy Metz) found out that the eight embryos that became three that became one had indeed resulted in a pregnancy. It was fantastic, against-almost-all-odds news, yes, but Toby (Chris Sullivan) had gone off his anti-depressants and was spiraling out of control, and this information collapsed him in tears, and seemingly not ones of joy. The episode — which also traced Toby’s challenging upbringing and the depression that he has battled throughout his life — caught us up to speed with a teased in the season 2 finale flash-forward: Toby, lying depressed in bed, with Kate gently informing him that the doctor wanted him to come in to adjust his medication. Elsewhere, Randall (Sterling K. Brown) realized that running for a City Council position in a city that you don’t live in can be rather challenging, and the freshly laid-off Beth (Susan Kelechi Watson) hid her less-than-boss interview for a new job from Randall, while back in the ’90s, Miguel (Jon Huertas) was working overtime to honor his ’80s promise to Jack to watch over his family should anything happen to the Pearson patriarch.This Is Us executive producer Elizabeth Berger talked to EW about the new mystery woman over here, and below, she delves deeper into the rest of the episode. So let’s grab a pack of Hi-Chews and try not to cross the streams as Berger answers questions about Toby’s depression, Kate’s news, Randall’s run, Beth’s pain, Zoe’s past, and, well, Miguel.ENTERTAINMENT WEEKLY: We know that Jack hid his Vietnam pain from Rebecca and the family, and in this episode, two people are hiding their pain from their spouses: Beth from Randall, and Toby from Kate. Toby falls apart at the end of the episode after he finally gets the news that Kate is pregnant. We saw him when he was younger turn to comedy impressions to cheer up his depressed mother (Wendie Malick) and have his own struggles with depression be rejected by his father (Dan Lauria). What story did you set out to tell about Toby? And is he someone who systematically tries to salve his own pain by helping others in pain, whether that’s his mother or Kate?\n                ELIZABETH BERGER: I think so. From a very young age, he learned to be strong for his mother, and he learned to use comedy to deflect from his own pain, and from other people’s pain. He’s grown up wanting to be — and being successfully, most of the time — this incredible caretaker and this incredibly nurturing person. And it’s really painful, and it’s really disappointing to not be able to be that person for his partner, just when he feels she needs him the very most.Toby has been there for Kate, and now it’s her turn to be his rock. How does she rise to that challenge — and could the timing be any worse now that she has beaten the odds and gotten pregnant?\nThe timing could not be worse, but I think we found that really interesting. You always think of people getting joyous news, and the reaction to it being simple, and that is true some of the time if both people happen to be in a really healthy space. But sometimes one person is really low when good news comes in, and it doesn’t mean that life doesn’t keep going and you don’t have to rise to the occasion and be there for that person. I think Kate knows how hard Toby has worked to be her rock many times, and she is really going to give it her all to be that for him right now.What can you say about her pregnancy journey ahead? She crossed another hurdle, but she’s by far not out of the woods, especially given that previous miscarriage.\nRight. It’s going to be an emotional journey, especially when you’ve suffered a miscarriage. Even when something traumatic isn’t happening in the moment, you know that it could happen. So that possibility is with you with every step that you take. Then there are going to be the real medical risks that she has to deal with, so it’s definitely going to be a very emotionally loaded time, as she moves her way through this pregnancy.How much of Randall’s campaign for City Council, though certainly well-intentioned, is rooted in his intense, almost-desperate need to make a connection to his heritage and belong?\nIt’s definitely a mix of things. Obviously for Randall, anything he embarks on is so deeply rooted. It’s his sense of identity, and his own quest for understanding himself better, and for shedding that feeling of being an outsider, which he’s carried with him through different phases throughout his life. But at the same time, he genuinely wants to help the people of this district, and he genuinely thinks that he can make a difference and do a great job. It’s all sort of swirling at once. There’s the intense personal thing, and then there’s the very practical, “I would be great at this. I want to be the person to serve this community.”Speeches are usually his forte, but a speech in this case didn’t save the day.\nNot at all. He really is an outsider stepping into other people’s space in this case. They’re going to feel that very strongly, and people pick up pretty quickly when they feel condescended to, or when they feel you don’t really know what they need. He is going to have to learn very quickly to approach every moment with the grace of someone that is learning, and visiting, and really getting to know these people on a deeper level.Any hints about how he will recalibrate?\nI think he probably learned his lesson about giving these speeches and telling people what they need before really getting to know the people inside and out, and learning from them, and sort of gaining their trust. Which is going to be a very gradual process, especially when most of these people have known his opponent for many, many years, and there’s that built-in trust already ingrained. Going forward, he’s definitely going to tread more lightly, and really feel things out and get to know the people on a deeper level.Beth has been hiding pain from being laid off from Randall in this episode, and she misrepresents how her interview went. To paraphrase William (Ron Cephas Jones), she doesn’t seem ready to play step up and play trumpet; she’s still just showing up to support him. What will this stuffing down of her feelings do to her in the short-term and to this couple?\nIt’s really hard for someone who has always been sort of, like Toby, such a rock in the relationship to admit that she’s in pain, and then to admit that she’s suffering. It’s definitely going to take a toll on her, and she’s going to have to find the strength to tell her husband what she’s going through, because it’s obviously incredibly draining to go through life, pressing down everything that you’re feeling. To a certain extent Beth has become a master at it, because Randall is always expressing what he’s feeling, so you find yourself falling into that role where you’re the quiet, strong one. She’s going to work up to finding the moment to be the one that expresses her needs, and what she needs going forward.Zoe (Melanie Liburd) makes the next step of commitment to Kevin, but when she’s talking to Robinson’s wife, she references her dubious past with men. We’ve heard Beth warn Kevin that Zoe will just chew him up and spit him out. Will we learn more about her checkered past before they get on that plane to Vietnam in episode 7?\nEpisode 7 is going to be a big episode for them. Obviously, they’re taking this big trip together, which is a giant step as a couple, and they’re going to be thrown into close quarters together going through this very emotional thing. That’s going to be an episode we do delve much more deeply into her past.We see Miguel keeping his word to Jack about looking after the family; he’s fixing the fridge, bringing over the piano, consoling Randall after an encounter with a racist parent, taking care of Kevin after his drunken prom night, and just being a super replacement after Jack’s death. The show has been building up Miguel as this great guy, but we know that there is this fracturing of the relationship sometime in the future. Are we building to answers about the cause of that split?\nYeah. We’re definitely going to be getting answers on that front. Obviously he’s in a very difficult position because he feels really compelled to step in, and to take care of Jack’s family, and that’s what Jack would’ve wanted. On the other hand, it’s very difficult to fill that role and not make Jack’s kids and his wife feel like he’s overstepping. We’re constantly watching him walk that line, and it’s going to be a really tricky one to navigate — and one that’s going to cause some tension.What can you tease about where we’ll pick up the action in episode 6?\nI love episode 6. It has a really great throwback feel to it, because we’re back with our 11-year-olds, and it’s really nice to do a past story with Jack, and to see the whole family together. Randall’s political story really heats up, and we’re going to get to see him go head-to-head with Councilman Brown in a new way that we haven’t seen yet, and see his campaign really begin to take shape.What’s the one word or phrase that you’d use to describe episode 6?\nThe next phase of these journeys are launched in a big way.Related content:"}