{"id": "SNL brings on wounded veteran politician to get revenge on Pete Davidson", "paragraph": "This week’s edition of Saturday Night Live‘s Weekend Update served as a sequel of sorts to last week’s episode. Pete Davidson followed up on his insult of newly-elected Congressman Dan Crenshaw by bringing the politician on to the show to get his revenge and share a serious message about respecting veterans. Crenshaw, a Republican politician and military veteran who lost his eye in Afghanistan in 2012, had been targeted by Davidson as part of SNL’s midterms preview. Davidson mocked the politician’s injury, saying he looked like a “hitman in a porno.” Davidson had quickly added, “I’m sorry, I know he lost his eye in war or whatever.” This week, in the wake of Crenshaw’s election to represent Texas’ 2nd Congressional District, Davidson was sincerely apologetic, saying, “In what I’m sure was a huge shock for people who know me, I made a poor choice last week.” Throughout the episode, SNL had been talking about the midterms in very apolitical terms, making jokes about trying to find common ground between Republican and Democratic supporters. Davidson continued that trajectory, describing the past week’s outrage about his Crenshaw joke by saying, “The left and right finally came together to agree on something: That I’m a dick.”“You think?” Crenshaw said as he suddenly entered the scene.Davidson’s “poor choice” line also appeared to be a reference to his recent breakup with singer Ariana Grande, and it wasn’t the last one. After Crenshaw accepted Davidson’s apology, he got a call on his cellphone — and the ringtone was none other than Grande’s song “Breathin.” Davidson, seemingly unprepared for the gag, laughed in response. The comedian then offered Crenshaw the chance to roast a picture of him to make up for his prior insult, and Crenshaw reluctantly accepted. “This is Pete Davidson,” Crenshaw said. “He looks like if the meth from Breaking Bad was a person.” And then, “he looks like a Troll doll with a tapeworm.”It wasn’t all fun and games, though. Since this week’s episode of SNL happened to fall on Veteran’s Day weekend, Crenshaw addressed viewers at home on the best way to respect the service of veterans like him. His main advice? If you see a veteran, tell them, “never forget.” “When you say ‘never forget,’ you are implying that as an American you are in it with them, not separated by a barrier between civilians and veterans,” Crenshaw said directly to the camera. “Never forget those we lost in war, and never forget those we lost on 9/11, like Pete’s father.” He and Davidson then each respectfully told each other, “Never forget.” Watch a clip of Crenshaw’s Davidson roast above.Related Links:"}