{"id": "Parks and Recreation's Li'l Sebastian crosses over to The Good Place", "paragraph": "Of course Li’l Sebastian is in the Good Place.The lil’ horse that was anything but lil’ on Parks and Recreation seems to have officially galloped over to The Good Place, marking the latest Easter egg crossover between the two NBC comedies.D’Arcy Carden posed next to the Pawnee celebrity and gave a classic Janet greeting, “hi.”And just to confirm that this really is the same mini horse with an honorary degree from Notre Dame, the official Parks and Recreation Instagram account shared Carden’s photo with the caption, “1 like = 1 candle in the wind.” That means (at the time this article went to press) there are 25,971 candles in the wind.This does bring up a lot of questions, like, if Li’l Sebastian is in the Good Place — which we know is really a cover for the Bad Place — does that mean Li’l Sebastian is in the Bad Place? Say it ain’t so!Reps for NBC did not immediately respond to EW’s request for more information.hi. pic.twitter.com/uX52o1vHuo— D'Arcy Carden (@DarcyCarden) November 9, 2018The Good Place featured a number of Parks and Recreation Easter eggs throughout all three seasons. It was easy for creator Mike Schur to do, as he spearheaded both shows.The name Bjoern Lerpiss, who appeared on multiple episodes of Parks and Rec, showed up on a leaderboard in season 1 of The Good Place. The heavenly series also featured the Swanson Safe Company, which created the safe in which Manny Jacinto’s Jason suffocated, and ads for Dennis Feinstein’s eau de toilette Glyde and a Jean-Ralphio champagne.Then, in the third episode of season 3, Eleanor and the gang went to the Cowboy Skyscraper Buffet, which featured a Paunch Burger on the menu.“It’s mostly for fun,” Schur previously told EW of all these references. “It’s fun to do — and because sometimes you need a magazine ad on the back of a magazine, and it’s easier to come up with a fake product and put it in there than it is to clear a real product. I don’t think we’re really trying to say that at some point anyone’s going to be walking down the street and run into Ron Swanson. But Parks and Rec had an intense fan base, and we always tried to lay in fun Easter eggs in Parks and Rec for various people, for people who were fans of sabermetric baseball statistics, so [this] is along the same lines. These are little things we like to lay in just for people to enjoy — and to find on a little Easter egg hunt. It’s 99 percent for that reason.”For the record, EW’s Dan Snierson definitely predicted “Li’l Sebastian could be galloping around the Good Place.” Just saying.Related content:"}