{"id": "William Goldman, beloved screenwriter of The Princess Bride and All the President's Men, dies at 87", "paragraph": "William Goldman, the Oscar-winning screenwriter behind such classic films as All the President’s Men and The Princess Bride, died at his Manhattan home on Friday, his daughter Jenny Goldman confirmed to the Washington Post. He was 87.Born in Chicago, Ill., in 1931, Goldman started out his writing career as a novelist, writing books like Temple of Gold and Boys and Girls Together in the ’50s and early ’60s. But like another iconic writer who died this week, Stan Lee, Goldman’s writing skills eventually found their best outlet in a slightly different format. In his case, it was film.One of his early novels, 1964’s No Way to Treat a Lady, caught the attention of actor Cliff Robertson, who mistook it for a film treatment and asked Goldman to adapt the sci-fi story “Flowers for Algernon” for the screen. That didn’t work out, but through Robertson Goldman did get his first screenwriting credit on the 1965 spy spoof Masquerade, credited alongside Michael Relph. Goldman followed that up with 1966’s Harper, which starred Paul Newman as a down-on-his-luck private investigator; the opening scene finds the detective waking up hungover in his office drinking day-old coffee, famously establishing his character without any dialogue. The film was a hit and established Goldman as a screenwriting talent at a time when the profession didn’t get much respect. That led right into his next Newman collaboration, Butch Cassidy and the Sundance Kid, which sent up the seriousness of Westerns, popularized the buddy movie genre, and earned Goldman a then-unheard-of $400,000 commission.On top of the payday, Butch Cassidy earned Goldman his first Oscar, and also launched the superstar career of Robert Redford, who had been cast as Newman’s sardonic sidekick. Years later, after the Watergate scandal had unfolded, Redford purchased the film rights to the Woodward and Bernstein story, and asked Goldman to adapt it. All the President’s Men won Goldman another Oscar, but disagreements about how to tackle the story (Redford saw the Watergate break-in as a serious subversion of democracy, while Goldman wanted to highlight the bumbling nature of the burglars, as well as Woodward and Bernstein’s own missteps) made for an unhappy production.Even as he became a famous and celebrated screenwriter, Goldman didn’t stop writing books. In the early ’70s, he asked his young daughters what his next story should be about. As he later recounted to EW, “One of them said ‘a princess’ and the other one said ‘a bride.'” He simply combined the two into The Princess Bride, and later wrote the screenplay for Rob Reiner’s 1987 film adaptation. Like Butch Cassidy and Goldman’s other films, The Princess Bride contained many amazing lines that would later entrench themselves in the pop culture lexicon, from “never turn your back on a Sicilian when DEATH is on the line” to “my name is Inigo Montoya. You killed my father. Prepare to die.”On top of his novels and screenplays, which also included an adaptation of Ira Levin’s novel The Stepford Wives and the 1990 Stephen King adaptation Misery starring Kathy Bates, Goldman also wrote reported books about sports (Wait Till Next Year) and theater (The Season: A Candid Look at Broadway). He even became a bit of a playwright himself when he adapted his own Misery screenplay into a 2015 Broadway production of the story about a novelist held hostage by a psychotic fan, starring Bruce Willis and Laurie Metcalf on the stage. Goldman also put his screenwriting expertise to use helping others over the years, working as an uncredited script doctor on films like Good Will Hunting.Of all his often-quoted lines and writings, though, no Goldman line may be more quoted in Hollywood than a truism included in his 1983 memoir, Adventures in the Screen Trade: “Nobody knows anything.”Related content:"}