{"id": "Doom Patrol: Everything we know about DC Universe's next live-action series", "paragraph": "The fourth episode of Titans, the first original series from new streaming platform DC Universe, is titled “Doom Patrol,” and introduces viewers to the superhero team of that name. Doom Patrol will, in fact, be the second live-action series from DC Universe, set to begin sometime next year.Doing Titans first makes a lot of sense, since there have already been two different Teen Titans cartoons for successive generations of superhero fans to grow up with. The Doom Patrol, though, is a little more obscure; they aren’t called the “World’s Strangest Heroes” for nothing, after all. So in case you’re unfamiliar, we at EW have put together a guide to this particular superhero team ahead of their TV spotlight next year. This is everything we know about Doom Patrol.While Titans is stacked with young, mostly unknown actors, Doom Patrol casting news has been populated with several big names. Timothy Dalton, for one, is playing team leader Niles Caulder, a.k.a. the Chief. Like Professor Charles Xavier of the X-Men, the Chief uses a wheelchair but more than makes up for his physical deficiencies with a wealth of knowledge and a willingness to innovate. Caulder is a leading doctor in medical science and has used his skills to save every other member of the Doom Patrol from certain death at the hands of freak accidents. This casting is actually a big change from the latest Titans episode, where the role was played by Bruno Bichir. Dalton will take over for the proper Doom Patrol series.While Dalton’s Caulder is the leader, Brendan Fraser is playing the team’s most iconic hero: Robotman, a.k.a. Cliff Steele (well, Riley Shanahan physically portrays him inside the robot suit, but Fraser provides the character’s voice and will also play Cliff’s human self in flashbacks). Cliff is a former race-car driver; after he was badly hurt in a crash, Caulder helped transfer his consciousness into a robot body. This is a mixed blessing for Cliff, who often mourns the loss of human faculties like taste and smell in his new form.Matt Bomer is Larry Trainor, a.k.a. Negative Man. A former ace pilot, Larry eventually ran into a force of “negative energy” and now wraps himself in bandages from head to toe (in a similar situation as Robotman, Matthew Zuk is doing the physical performance under the bandages, while Bomer provides the voice and Larry’s human body in flashbacks). Though we haven’t seen him in action on screen yet, Larry’s powers usually include being able to project a “negative spirit” out of his body that can fly and perform feats beyond the reach of normal humans. Rounding up the team’s classic lineup is April Bowlby as Rita Farr, a.k.a. Elasti-Woman, a former actress who was opposed to toxic gas, giving her the ability to change her size (the character was actually called Elasti-Girl when she was first created, but obviously The Incredibles owns that name now).Those are the characters who appeared in the “Doom Patrol” episode of Titans (plus Ryan Potter as Gar Logan, a.k.a. Beast Boy, who has now left them for another team). When the actual Doom Patrol series gets going, viewers will be introduced to several other characters as well. Joivan Wade will play Victor Stone, a.k.a. Cyborg, taking over the role from Ray Fisher who played him in the big-screen Justice League. In this show, Cyborg is the one who gives the Doom Patrol an important mission. Diane Guerrero will play Crazy Jane, a woman with 64 distinct personalities — each of whom has a different superpower! On the villainous side, Alan Tudyk will play Mr. Nobody, a living shadow who can drain the sanity of others.The Doom Patrol characters were co-created by Arnold Drake, Bob Haney, and Bruno Premiani. They first appeared in the comic My Greatest Adventure #80, which came out in June 1963 — just a few months before Marvel published the first issue of X-Men. That close timing, and the many similarities between concepts — misfit superheroes led by brilliant thinkers in wheelchairs, facing off against similarly-named supervillains (the Brotherhood of Evil vs. the Brotherhood of Evil Mutants) — led Drake to accuse Stan Lee of ripping off their ideas, though he softened his position a bit before his death in 2007.The Doom Patrol were weird from the get-go, but it took until the ’80s for them to reach their full potential as the World’s Strangest Heroes. That’s when writer Grant Morrison took over. Morrison’s seminal run on Doom Patrol helped make his name as one of the most innovative and eclectic creators in superhero comics. He shook up the team, introducing new characters like Crazy Jane and taking the whole idea of superheroes in an extremely surrealist direction. In fact, when Mr. Nobody first appeared he was leading a group called the Brotherhood of Dada, and their master plan involved imprisoning the city of Paris inside of a painting.As Morrison himself described the run in his 2011 memoir Supergods, “The Doom Patrol had always been misunderstood outsiders, so I gave them a new purpose as the only superheroes disturbed enough to deal with the kind of menaces to sanity and reality that not even Superman could hope to confront…Carefully composed pastiches of Thomas De Quincey, Sylvia Plath, Italo Calvino, and F.T. Marinetti jostled for attention alongside fight scenes, wild action, and quotes from avant-garde art or the wilder frontiers of philosophy and the occult.”Morrison’s run is definitely an influence on the Doom Patrol show. At New York Comic Con this year, Fraser previewed the show to the audience of DC’s Titans premiere by reading aloud from Morrison’s introduction to the first collected edition of his run on the comic. Titans executive producer Geoff Johns (who wrote the “Doom Patrol” episode) also told EW that Doom Patrol would be tapping into Morrison’s run to give it a weirder vibe than Titans: “When we have more space to do the actual Doom Patrol show, it taps into the even weirder and more bizarre Grant Morrison run. Tonally, it’s different. But even that episode of Titans is a little bit different from the other ones. With Doom Patrol, we’re really tapping into the fun and strange and bizarre of who those characters have always been from the inception. From what Arnold Drake did, to Grant Morrison’s redefining and amazing run, that’s really what that’s tapping into.”Not all of Morrison’s innovations stuck, but his Doom Patrol had a wide influence on superhero stories across the following decades. My Chemical Romance singer Gerard Way, for instance, claimed Morrison’s Doom Patrol as a huge influence on his own surreal superhero series The Umbrella Academy (soon to be its own live-action series, on Netflix). Eventually, Way closed the circle by writing Doom Patrol himself, starting in 2016. Along with artist Nick Derington, Way even brought back one of Morrison’s wilder characters (a living, moving city block called Danny the Street) and transformed him into Danny the Ambulance. As of now, the comic version of the team consists of The Chief, Robotman, Negative Man, Crazy Jane, Flex Mentallo, and Casey Brinke (herself a manifestation of Danny the Ambulance), though things like membership rosters never stay the same for long when it comes to the Doom Patrol…Doom Patrol is set to hit the DC Universe platform in 2019. As with Titans, Doom Patrol is expected to be released one episode at a time over a matter of weeks. Stay tuned for updates as more information becomes available.Related content: "}