{"id": "Whitey Bulger, Boston mob boss who inspired Black Mass and other characters, found dead in prison", "paragraph": "James “Whitey” Bulger, the notorious Boston gangster, has been found dead in a West Virginia penitentiary, according to the Associated Press. Bulger was found unresponsive Tuesday morning at the facility, where he had just been transferred, but authorities have not yet confirmed a cause of death. He was 89.After serving as an informant for the FBI, Bulger was a fugitive for 16 years, labeled one of America’s most wanted men, before being arrested in Santa Monica in 2011. He was sentenced in 2013 to two consecutive life sentences plus five years for a multitude of crimes that included 11 murders.Bulger’s infamy inspired several Hollywood films, TV shows, and characters across pop culture. Most recently, Johnny Depp portrayed Bulger in Scott Cooper’s 2015 drama Black Mass, which was based on a 2000 true crime book by Boston Globe reporters Dick Lehr and Gerard O’Neil. Other characters, including Jack Nicolson’s Frank Costello in Martin Scorsese’s 2007 Best Picture winner The Departed and James Woods’ Sully Sullivan in Ray Donovan, emulated Bulger’s penchant for intimidation and violence.Multiple crime drama series have also used Bulger as a blueprint for their main characters. Most notably, NBC’s The Blacklist partly based its lead, Red Reddington (James Spader), on the mobster’s history, specifically his experience as a criminal-turned-informant. The Showtime series Brotherhood also has a Bulger-inspired character in its primary cast: Jason Isaacs plays Michael Caffee, a brutal offender whose brother Tommy (Jason Clarke) is a state politician. The opposing siblings are based on Bulger and his younger brother Billy, 84, a lawyer and longtime leader of the Massachusetts Democratic party.Despite his murderous reputation, Bulger-like characters made it into comedic projects as well. In 2016, Bulger’s likeness made a cameo on an episode of The Simpsons in which Homer and Bart visit Boston and are introduced to its culture by the mob boss himself."}