{"id": "Fantastic Beasts sequel's shocking ending explained", "paragraph": "Fantastic Beasts: The Crimes of Grindelwald concluded with a rather huge surprise twist in its final moments which changes Harry Potter canon forever.[Spoilers follow] Throughout the film, orphaned Credence Barebone (Ezra Miller) was searching for his true identity in Paris. Fans — and even some other characters — had assumed he was the long-lost brother of Leta Lestrange (Zoe Kravitz). Except Leta had actually swapped her troublesome infant younger brother with another, quieter baby during a sea voyage, and her actual brother then tragically drowned after the ship was sunk during a storm (The Crimes of Grindelwald is not a film that’s exactly shy about killing off kids). In the movie’s final moments, Gellert Grindelwald (Johnny Depp) reveals Credence’s real name is Aurelius Dumbledore and says his “brother” (presumably Albus) is trying to kill him. A phoenix even appears, which we were reminded earlier in the film will always come to a Dumbledore in need (though it’s unclear why, after being in so much danger and drama, the magical creature would come to Credence now).According to the Harry Potter books, Albus only has one brother (Aberforth). He also had a troubled sister (Ariana), who seemingly was an Obscurial (just like Credence). She was accidentally killed during a duel between Albus and Grindelwald, an incident that has weighed on Albus ever since.Credence being a Dumbledore helps explain his tremendous magical ability, and gives him a personal connection to Grindelwald’s enemy moving forward. It also potentially gives Albus a second chance at salvation — he couldn’t save Ariana, but maybe he can save Aurelius?(Fun fact, possibly a coincidence: The name Aurelius has a connection to the first actor who played Dumbledore: Richard Harris also played the doomed Marcus Aurelius in Gladiator.)So that’s what we know. What we don’t know is pretty much everything else. The reveal raises a ton of questions and, taken at face value, doesn’t seem to make a whole lot of sense. But let’s look closer.First, let’s assume Grindelwald is telling the truth. He could be lying, sure, but that feels unlikely — Rowling’s big reveals at the end of her novels tend to be true because, otherwise, what’s the point? But it’s also hard to imagine why the brother of one of the most famous wizards of all time was never previously mentioned by anyone (how could Rita Skeeter miss this one?). The situation is not unlike a controversial move made by another prequel, Star Trek: Discovery, and it’s decision to give Spock an adopted sister.And as pointed out by The Rowling Library, the ages don’t add up. Albus’ father, Percival, was sent to Azkaban prison and eventually died there the year before Albus went to Hogwarts — so when the future professor and headmaster was about 10 — and Credence and Albus are definitely more than 10 years apart. (Then again, Crimes of Grindelwald also shows a young Minerva McGonagall working at Hogwarts, even though her character was apparently born several years after the film takes place).What’s also unclear is whether Albus knows Credence is his brother. One would assume so, as Albus seems to know more about Credence than what he’s saying aloud and, well, he usually the smartest character in the room. But if what Grindelwald is saying is true, and Albus knows it, it’s hard to imagine Dumbledore would advocate a plan of action in Crimes which could lead to his own brother’s death.There are theories out there. Perhaps Ariana’s Obscurus is possessing Credence and that’s the “brother” Grindelwald is referring to? Maybe Credence is actually Ariana’s secret son (but then who is the “brother”?). Could Albus’ father have conceived Aurelius at Azkaban? (Having sex with Dementors hovering around seems pretty tough to pull off.)One thing is for sure: Rowling wouldn’t make this move without a clear explanation. To know for sure, we’ll have to wait for the third film in the series, which is expected in 2020.Related content:"}