{"id": "Female filmmakers urge future talent at SCAD Savannah Film Festival to find ‘empowering’ collaborators", "paragraph": "Female filmmakers gathered Monday at the SCAD Savannah Film Festival to offer insight into their careers and discuss the future of the women in film.EW’s Ruth Kinane moderated two panels as part of the festival’s Wonder Women series — one with producers and one with below-the-line crew members, including editors, cinematographers, and visual effects producers.Elizabeth Chai Vasarhelyi (Free Solo), Kaila York, Paula DuPré Pesmen (Quincy), Amy Nauiokas (Can You Ever Forgive Me?), and Shannon Gibson and Lizzie Nastro (both of One Cambodian Family Please For My Pleasure, part of Refinery29’s female-helmed short film series, Shatterbox) assembled first for the producers’ panel to share how they broke into the industry and offer advice to the students in the audience about how to build their careers.“You’re not going to get through to people you’re working with if they’re not empowering you,” Pesmen told the audience. “So find people who trust you and empower you. Surround yourself with people who are collaborative and respectful.”“With every no, just remember that there’s an opportunity somewhere else,” Gibson added.Meanwhile, the below-the-line panel — which included cinematographer Polly Morgan, editor Nancy Richardson, visual effects producer Sara Tremblay, editor Joi McMillon, and editor Plummy Tucker — went deep on the ins and outs of their jobs and how they’ve learned to advocate for themselves.“If you’re afraid to tell [the director] ideas or how you could better service the story, you are not part of the filmmaking process,” McMillon said. “You’re just a person in a chair pushing buttons.”“When I meet the director, it’s really important to know that we’re on the same page and we’re going to have the same sensibilities on the project,” Morgan added. “It’s really important that you and the director are strong collaborators and are on the same page and have each other’s backs.”And, they added, it’s always easier to work with a director who can communicate their vision clearly. “[Sometimes] they just tell you, ‘Make it look crazy cool,'” Tremblay said with a laugh. “I get that note every episode. Crazy cool can be a lot of things!”The panelists also opened up about some of the sexism and prejudice they’ve experienced working in the industry, from being mistaken for assistants to having their credentials second-guessed.“In editing, action editing is somehow something they think only guys can do,” Richardson told the audience. “I sometimes meet these big action editors at social events, and they’re these little skinny guys! I’m like, can I challenge you to arm wrestle?”“It’s the same with action shooting,” Morgan added. “For some reason it’s hard to imagine a younger female shooting a huge stunt action sequence where things get blown up. I think that also I’m more petite, so sometimes people wonder whether I can hold a camera on my shoulders. Which I can!”But the panelists agreed that they ultimately felt optimistic about the future of women in the industry — especially after seeing female filmmakers advocate for each other and themselves.“It’s frustrating and we can probably all share frustrating stories,” Nauiokas said. “For me, it feels palpably different in the last year. It’s not that we’re done or we fixed it all, it’s all solved. But I think we’ve had very honest conversations and the ability to call b.s. on some stuff, and we can now empower more women to work together and to partner together. There’s safety and strength in numbers, and I think we have a lot of work to do, but it feels like we’re making a step in the right direction. I would encourage everyone who has a desire to be a part of film to know that it sometimes can feel like a fight, but it can be well worth it. And we’re making progress.”Related content: "}