{"id": "Can Jamie Lee Curtis — and the horror genre — get a foot in the door at the Oscars?", "paragraph": "With the record-breaking Halloween movie topping the box office for a second week and a performance that has earned her rave reviews, Hollywood’s OG scream queen Jamie Lee Curtis is sitting on top of the world right now. But if you’re hoping to see Curtis among the acting nominees at the Oscars come February, don’t hold your breath.Since her breakout as the lead in John Carpenter’s 1978 Halloween, Curtis has carved out a career in horror and comedy, with an array of roles in films such as The Fog, True Lies, My Girl, and Freaky Friday. However, it’s Halloween’s Laurie Strode who has not only brought her full circle in a franchise that she is undoubtedly woven into the fabric of but given her the opportunity to deliver the performance of her career.Critics praised Curtis’ return in this year’s Halloween. It was her fifth time playing Strode, but in this film, she really gets to hone in on the psychological impact being tormented by a deadly killer her entire life has had on her character. EW critic Leah Greenblatt wrote of the performance: “At 59, Curtis seems to have fully arrived in her role as a midnight-madness queen, and she has a great time in jeans and a gray fright wig, swinging her shotgun around and screaming at everyone to get in the safe room.”Still, the chances of a horror film slicing its way into the current awards race is as likely as Michael Myers staying dead. But that hasn’t always been the case.In 1962, the psychological horror What Ever Happened to Baby Jane? earned five nominations, including Best Supporting Actress for Bette Davis. (The behind-the-scenes drama between Davis and Joan Crawford was recently dramatized in Ryan Murphy’s FX miniseries, Feud: Bette and Joan.)In 1969, Rosemary’s Baby won Ruth Gordon a Best Supporting Actress Oscar, while Roman Polanski was nominated for Best Adapted Screenplay.In 1973, The Exorcist earned 10 Oscar nominations, including Best Picture and Best Actress for Ellen Burstyn, and walked away with wins for Adapted Screenplay and Sound.In 1992, Jodie Foster won Best Actress for her role as Clarice Starling in The Silence of the Lambs, which went on to win Best Picture — the only horror film to be bestowed with the prestigious accolade.And then Hollywood had a change of heart. Since 1993, a flurry of scary films — teen horror, slashers, ghostly thrillers, and gory torture-porn — have saturated the market but fallen off the awards radar. In 1999, M. Night Shyamalan’s The Sixth Sense earned more than $670 million at the worldwide box office (second only to Star Wars: Episode I – The Phantom Menace), strong praise from critics and audiences for its original story and performances, and garnered six Oscar nominations and walked away with …. nothing.Fast forward 15 years to 2010, when Darren Aronofsky’s psychological horror-thriller Black Swan earned Natalie Portman a Best Actress accolade and was nominated in five categories including Best Picture, making it only the fifth horror movie at the time to secure a Best Picture nod.And then 2017 saw Jordan Peele’s Get Out shift the perception around horror. A $5 million movie featuring rising star Daniel Kaluuya, Get Out was a searing analysis of societal oppression of black people and the inherent racism that runs through the veins of this country, and sparked conversations throughout the year (boosted by America’s own socio-political fractures). At this year’s Oscars, Get Out earned four Oscar nominations, all in key categories — Best Picture, Director, Actor (Kaluuya), and Original Screenplay — and scored one win, for Peele’s Original Screenplay. He became the first black filmmaker to win in that category.But it was the conversation sparked by Get Out that brought a spotlight back onto how horror films have traditionally not only explored timely social and political themes but often showcase killer (pun intended) performances. For those actors who have long been neglected by Hollywood — namely women, especially those over 40, and people of color — horror has often been a genre that supports them.In June, Toni Collette delivered a head-spinning performance as a woman struggling to comprehend her strained relationship with her late mother in Hereditary, which might get some love at the Independent Spirit Awards where Get Out won Best Feature earlier this year. In August, Demián Bichir and Taissa Farmiga navigated an emotional rollercoaster while being tortured by supernatural forces in The Nun, part of Warner Bros’ Conjuring franchise.More than just a granny with a gun, Halloween explores Curtis’ Laurie as a severely traumatized and unhinged woman suffering from intense PTSD after years of mental and physical abuse at the hands of the masked Michael Myers, and the impact it has left on her daughter and granddaughter as a result. Amid some cheesy horror movie tropes and jump scares is an emotional story of three lives severely marred by violence, and the film shows the resilience of women at a time where the conversation and stigma around abused women is very much in the spotlight.Curtis, who is also the daughter of screen icons Janet Leigh and Tony Curtis (both of whom landed Oscar nominations over the course of their careers), has never received an Oscar nod. Even with Halloween becoming the highest-grossing film with a female lead over the age of 55, and the second-biggest October opening at the U.S. box office ever, Curtis is unlikely to crack the Oscars race this year — unless Universal Pictures and Blumhouse decide to hit the campaign trail really hard with the delightfully charming and witty Curtis to win over voters.But Curtis has a longtime fan in the Hollywood Foreign Press Association. With seven Golden Globe nominations and two wins under her belt, Curtis’ ever-resilient Laurie Strode might find herself in the spotlight again at the Golden Globe Awards on Jan. 6.Related content: "}