{"id": "Pete Davidson says Ariana Grande breakup is 'nobody's business'", "paragraph": "Pete Davidson addresses Ariana Grande breakup: “The truth is it’s nobody’s business and sometimes things just don’t work out and that’s ok. She’s a wonderful, strong person and I genuinely wish her all the happiness in the world.” #SNL pic.twitter.com/U7fBclE3Zi— Jillian Sederholm (@JillianSed) November 4, 2018Pete Davidson closed out his Weekend Update segment on this week’s Saturday Night Live by addressing his breakup with Ariana Grande, sincerely and strongly.“I know some of you are curious about the breakup,” he began. “But the truth is, it’s nobody’s business and sometimes things just don’t work out. And that’s okay. She’s a wonderful, strong person and I genuinely wish her all the happiness in the world.”Davidson previously used his SNL platform to address the breakup more obliquely, mock-“proposing” to the episode’s musical guest, Maggie Rogers, in a promotion for the episode. Shortly after it went online Thursday, Grande seemingly tweeted out a response on Twitter: “For somebody who claims to hate relevancy u sure love clinging to it huh,” Grande tweeted. (The tweet has since been deleted.)On Oct. 14, news broke that Davidson and Grande’s whirlwind romance was coming to an end, and that the pair had called off their engagement.Earlier in his “Weekend Update” segment on Saturday, Davidson quipped, “After I had to move back in with my mom, I started paying attention [to politics].”Early reactions on social media praised Davidson for the sober, respectful tone he struck in his first official comments on the breakup.Whoa. Pete Davidson wishing Ariana the best just came out of nowhere. #snl pic.twitter.com/GWcAJwBkFR— EB83 (@EB2683) November 4, 2018Pete Davidson. Gentleman. Very cool. @nbcsnl #snl— EK Keratsis (@EKeratsis) November 4, 2018PETE DAVIDSON DELIVERS A PERFECT AND WONDERFUL MONOOGUE DURING UPDATE AND LEVERAGES HIS PLATFORM FOR GOOD DURING LIKELY THE HIGHEST VISIBILITY EPISODE HE’LL EVER HAVE GIVEN GRANDE’S SINGLE DROP AND THE MIDTERMS I LOVE HIM— Callie Freitag (@callie_freitag) November 4, 2018Pete Davidson proving that not all guys are the asshole.— Jackie Sanchez (@JackieSanchez) November 4, 2018Less than an hour before SNL began airing on Saturday, Grande dropped her anticipated single, “thank u, next.”Watch Davidson’s comments above.Related content:"}