{"id": "David Schwimmer responds to manhunt for lookalike robbery suspect: ‘It wasn’t me’", "paragraph": "David Schwimmer is making it clear he had nothing to do with a recent robbery committed by someone with an uncanny resemblance to him.“Officers, I swear it wasn’t me,” he wrote on Twitter, captioning a spoof video of him re-enacting surveillance footage of the alleged crime. “As you can see, I was in New York. To the hardworking Blackpool Police, good luck with the investigation. #itwasntme.”Officers, I swear it wasn't me.As you can see, I was in New York.To the hardworking Blackpool Police, good luck with the investigation.#itwasntme pic.twitter.com/EDFF9dZoYR— schwim (@DavidSchwimmer) October 24, 2018On Tuesday, police in Blackpool, England, shared a CCTV image of the suspect via Facebook asking for the public’s assistance in identifying him. Social media users were quick to point out the man in question looks strikingly similar to Ross Geller, the beloved character Schwimmer portrayed on Friends, and began flooding law enforcement officials with jokes on the criminal’s identity.“Apparently the police had him cornered then he performed a pivot manoeuvre and escaped,” read one tweet, referring to Ross’ famous “Pivot!” line.\"Apparently the police had him cornered then he performed a pivot manoeuvre and escaped\" 😂(Police have confirmed David Schwimmer was not in the UK at the time of the alleged offence) https://t.co/DqImUZzgQI— BBC Newsbeat (@BBCNewsbeat) October 24, 2018“There are rumors he had some accomplices. Miss Chenandler Bong, Regina Phalange, and Ken Adams were all seen in the area,” joked another commentor, poking fun at the pseudonyms used by Chandler, Phoebe, and Joey on the sitcom. Others suspected Ross’ aliases Russ, Vikram, or the Holiday Armadillo could be the real culprits.Bravo, Ross/Russ/Red Ross/The Rossatron/The holiday armadillo 👌 https://t.co/YGmnq0MHAB— SimoneC (@SimoneC) October 24, 2018The mounting responses led police to release a statement clearing the star’s name.“Thank you to everyone for your speedy responses,” the statement said. “We have investigated this matter thoroughly and have confirmed that David Schwimmer was in America on this date. We’re so sorry it has to be this way.”Related content:"}