{"id": "First Toy Story 4 teaser introduces a reluctant new toy", "paragraph": "The toys are back in town!Disney unveiled the first teaser trailer for Pixar’s Toy Story 4 on Monday morning, giving a look at beloved old friends like Woody, Buzz Lightyear, and Jessie – plus a new face who seems less than thrilled to be part of the gang.The teaser gives a look inside Bonnie’s room and introduces the newcomer, Forky (voiced by Tony Hale), who’s described as “an actual spork-turned-craft project who insists he isn’t a toy.” But every time he tries to get away, he gets pulled into an adventure he’d rather skip.“Like most people, I assumed that Toy Story 3 was the end of the story,” director Josh Cooley said in a statement. “And it was the end of Woody’s story with Andy. But just like in life, every ending is a new beginning. Woody now being in a new room, with new toys, and a new kid, was something we have never seen before. The questions of what that would be like became the beginning of an entertaining story worth exploring.”And when it comes to Forky, he added, “The world of Toy Story is built upon the idea that everything in the world has a purpose. A toy’s purpose is to be there for its child. But what about toys that are made out of other objects? Forky is a toy that Bonnie made out of a disposable spork, so he’s facing a crisis. He wants to fulfill his purpose as a spork, but now has a new toy purpose thrust upon him.”Here’s the official synopsis for the film: “Woody has always been confident about his place in the world and that his priority is taking care of his kid, whether that’s Andy or Bonnie. But when Bonnie adds a reluctant new toy called ‘Forky’ to her room, a road trip adventure alongside old and new friends will show Woody how big the world can be for a toy.”Watch the footage above to see how his spork-as-toy existential crisis disrupts an otherwise happy moment with the rest of the group, and check out Woody gracing a new poster below.Toy Story 4 opens in theaters on June 21, 2019.Related content:"}