{"id": "Josh McDermitt from The Walking Dead on facing the Whisperers", "paragraph": "SPOILER ALERT: Read on only if you have already watched Sunday’s “Who Are You Now” episode of The Walking Dead.\nWhat the #%&*?!? Did we just hear talking zombies? No doubt that was the reaction of many viewers as well as the reaction of Eugene and Rosita, who encountered walkers during Sunday’s episode of The Walking Dead that seemed to move faster than regular zombies and also appeared to have the —gulp! — power of speech.Fans of the comic book, of course, know this to be the introduction of the Whisperers — the next big threat to our not-so-merry band of survivors. We spoke to Eugene himself, Josh McDermitt, to get some behind-the-scenes intel on filing this pivotal scene as well as all the other big changes for his character after the time-jump. Like that hair! And that newfound zombie-slaying confidence! And that (unrequited?) love for Rosita! What does it all mean? Read on. (Also make sure to check out our interview with showrunner Angela Kang, who discusses the introduction of the Whisperers as well as Rick and Michonne’s baby!)ENTERTAINMENT WEEKLY: How did you first find out about Eugene’s introduction six years later after this time jump, with being him stepping up and slaying three walkers? Did you get a heads up about Eugene 2.0 from someone in advance or did you just see it in the script?\nJOSH McDERMITT: In terms of the walker kills specifically, I didn’t know about it until I read the scripts, and I was excited. We had been toying around with the future look of Eugene, trying to grow his pony tail so he’s got a longer braid. I wanted to lose weight, I lost a little bit of weight, but I’m not going to do an interview with Men’s Health and talk about my weight loss tips because there wasn’t that much weight but, you know, it’s hard to go from one week to the next and you go, “Well, it would be awesome if I was 30 pounds lighter and show that time has changed,” but that’s physically impossible.So there was like those sorts of changes that we had discussed beforehand with [showrunner Angela Kang] but the walker kills specifically didn’t hit me until I read the script, and I was like, “F— yeah!” I loved it. And I texted Angela and I was like, “I love this.” And she goes, “Oh, yeah, he’s very much a badass now with knives and stuff.” In fact, I think I’d just finished reading the script and I was getting a text from Monty, our stunt coordinator, and he was trying to set up some sort of a training with knives for me and so it was just like, “Oh, this is happening.” Like, this has been something that’s been discussed and it’s been in the works and I’m just the last person to find out about it, which I’m okay with.But I think initially in the script, we had it were Eugene was only killing like one walker or something. I was talking with Eddie Guzelian, who wrote the episode, and Larry Teng, who directed it, and I wanted to go from Eugene not just killing a walker but killing a few, and being able to handle the business on his own, to really show the growth that this guy’s had. And we took that to Angela and she’s like, “I love it, let’s do it,” which is awesome. There’s very much a collaborative sense on set this year an it was awesome to be able to just show that change within this character.What are your thoughts on the new hair?\nI like it, man. It’s allowed me to kind of have a normal haircut instead of just always having a mullet, and having to throw a hat on. I have the option of doing my hair so that I’m not at a restaurant and have people going like, “Does he know about his haircut or should we tell him?” Like I have normal hair now, which is great, it’s just kind of long and shaggy as it is. It’s great, man. Anytime we can kind of pull some things out of the comics and bring them into the show, I think it’s fun, and obviously, Eugene grows his hair out in the comics, and I was like, “Let’s go for it.” I really wanted to grow his hair out. I could easily just cut it and look like everyone else but this man, it’s his hair! I was like, “Let’s just lean into it.”So, what do you make of the whole Eugene, Rosita, Gabriel love triangle?\n                I’ve thought a lot about it. I wonder if Eugene would have professed his love to Rosita, had she not been with Gabriel? I do feel like he’s kind of using that. He’s a little jealous and he’s sad by that and if she wasn’t with him it would just be like the same old thing, but now…. And he even says like, “I get it that machete-wielding man of the cloth with zero depth perception aren’t exactly a dime a dozen.” He’s just trying to cut Gabriel so hard and just say, “Look, I’m the man you should be with.”But I do think he wouldn’t be doing that had they not gotten together in the first place. But he is at that point in his confidence and who he is as a survivor that he’s like, “Okay, they should be having a family and settling down a little bit because this is what our life is now.” And that’s something I never really thought we’d see with Eugene. I never thought we’d see him in that place.So has he been creepily watching them have sex?\nProbably. I mean, I don’t know. I don’t want to say they are or they aren’t because Gabriel is a pastor so I don’t know where he stands with that. I guess he said he was Episcopalian and kind of got a little freaky with Jadis, or Anne, so, we’ll leave that one alone. But given the opportunity, yes.This is a classic scene ripped straight from the comics where you and Christian got to go in that ditch hiding from the Whisperers. What was it like getting to throw mud all over yourself?\nWe had to cover ourselves in mud a couple of times for re-shoots and stuff. And showering that out is like the hardest thing in the world because it’s not just getting a little muddy — you’re drenching yourself in mud and it just doesn’t come out. Like, you’re finding it in your ear and in different parts of your head and your hair days later. I’m like, “I shampooed six times, how is this not coming out?” It was fun, man. I always love getting dirty and gross. I got the to cover myself in ash last season. I’ve gotten to do a lot of cool things and play with different looks, but certainly that moment is very iconic from the comics and it was cool to be a part of that.It was very fun to shoot it, obviously all the mud was clean, you know? It wasn’t just like mud from anywhere. I guess they treated the mud to make sure there weren’t parasites in it because we were rubbing it on our face. And it was movie magic, man. It was fun and scary. We did it in such a panic and it’s scary to have walkers that close to you, right on your tail. It certainly amps your energy and it’s exciting to just get filthy with Christian in the mud like that.So as they’re doing it and you guys are in the mud and the walkers are walking by, was the director or AD or someone whispering and talking? Did they have something for you to react to in terms of that?\nNo, I don’t think that those walkers were saying anything to us. Maybe Larry Teng was saying stuff to them, but we wouldn’t have been able to hear them. We were just covered in mud, it was in our ears and whatnot. I think in the script it said, “Eugene, we see one of his eyes open and that Rosita covers her mouth.” And so I think we just kind of took our own cues and reacted that way.We definitely couldn’t see them, but we could feel them moving above us so wherever they were going to put the whispering, they were going to put it, you know, so we didn’t want to react off of what someone else was maybe saying, we just kind of did it on our own.But it had in the script that you could hear the zombies talking, right? You knew that, you just didn’t hear it while filming the scene?\nYeah, absolutely and these guys have no idea what’s happening. I mean, we see Eugene in the beginning of the episode and he’s very confident with these walkers, because he knows what they are and he knows how to deal with them. And then all of a sudden, by the end of the episode, they’ve evolved enough in his mind that they’re talking and he’s like, “What the f—, man?” This is a man of science, but first, they have to survive. You know they can’t get away fast enough. These things are not that fast and yet they keep gaining on Rosita and Eugene.Granted, he’s injured and he’s kind of slowing them up a bit, but they should still be able to get away and they’re just not able to. Around every turn, every corner, they’re being cut off and this is freaking them out. It’s a type of threat that he’s never really experienced before. So, that’s kind of the scariest part of it, is not knowing what the heck is going on.What was it like filming this episode in general? Because you just had your big goodbye to Andrew Lincoln and Lauren Cohan, and then you get all these newcomers showing up. What was the mood on set like for 906?\nIt felt like the same old show that we’ve been doing forever. I mean, Andy wasn’t in every scene so it didn’t necessarily hit us that he was gone, yet. Obviously the night before, we had our goodbyes to him in episode 5 where he spoke to the crew and everything, but we still have more work to do and I think that’s a testament to Andy and Jon Bernthal, Sara Wayne Callies, and Melissa, and Steven, and Norman and all these people who built this show from episode 1.It’s like, Andy is gone but he wasn’t. His fingerprints are all over this thing. And that’s just how things are done around here. And so it’s just our job now to show the new people that this is how we do things around here and not let that slip away. And I don’t think it has. I think it’s still very much the same show it’s always been.What can you say about what’s coming up, because obviously we got our first glimpse at the Whisperers. What can you say about where it goes from here?\nIn terms of Eugene, he’s going to try to figure out exactly how to survive, how to get free from these walkers that are on his tail and hopefully, since he’s a man of science, figure out exactly how they are able to talk and how they’re able to move faster, and kind of figure out where they are and cut them off at every turn. I mean, it’s a very scary threat that I don’t think we’ve seen before on the show, at least from the character’s point of view. It’s an exciting place to be because there’s so much unknown.And then we have our communities that are also six years older and so it’s going to be fun to see what other changes have taken place throughout other communities. Obviously, what we see in episode 6 within Alexandria is that some things have happened within that six-year time jump and that it could lead us to believe that other things have happened in other communities. So it will be exciting to kind of unpack that and see how that impacts the story moving forward.Also make sure to check out our interview with showrunner Angela Kang, and for more Walking Dead intel, follow Dalton on Twitter @DaltonRoss.Related content:\n"}