{"id": "Pistol Annies on their new album Interstate Gospel and sticking together: 'We make each other stronger'", "paragraph": "With their fierce — and fiercely tender — third album, Interstate Gospel (out now), the force of nature known as country supergroup Pistol Annies has come roaring back to life.Separately, Miranda Lambert, Ashley Monroe, and Angaleena Presley are formidable characters. But when they band together as Pistol Annies, they become a dream country-music Transformer of scorched-earth pathos, wicked wit, and heavenly harmony. Although the women share similarities as songwriters, there is an alchemy at work when Monroe’s soulfulness, Lambert’s feistiness, and Presley’s plainspoken poetics coalesce.That much was clear when the women played the Ryman Auditorium recently to celebrate the album’s release. Their image as mischievous firebrands was on full display in the spirited performances of songs like the giddy, Andrews Sisters-evoking divorce track “Got My Name Changed Back.” But that is only half the group’s story, as they also plumbed emotional depths with the examination of thorny familial relationships in “Milkman.” As each woman took a lead vocal, the other two would often hold hands and sing along off to the side before contributing harmony vocals.In conversation they toggle between praising and ribbing one another, while finishing each other’s thoughts. The sisterhood is clearly strong among the women.“When we’re with each other, we make each other stronger and we’re more courageous, and it’s because we can be vulnerable,” says Monroe, who released her sensitive and sensual fourth album, Sparrow, in April. “We like to show both sides of that.” “Plus, we really want to impress each other,” continues Presley, who received critical acclaim for her 2017 sophomore LP, Wrangled. “The more honest and real we are, the more impressed the other two are. It’s like a contest of who can be the most nitty-gritty sometimes.”The winners, however, are the fans, who should find something to love with Interstate Gospel, on which the trio take turns singing lead on songs they wrote together. From the girls’-night-out sass of “Stop Drop and Roll One” to the Tom Petty-meets-the Bangles vibe of “The Best Years of My Life,” to the lacerating “When I Was His Wife,” the 14 tracks cover a wide swath of emotional — and musical — territory.The women never plan a precise time to convene for a Pistol Annies project. It just happens naturally when one of them writes a germ of a song that they know will be better for the group than one of their own solo projects. “We stay in touch, we’re obviously friends outside of work, but sometimes we know it’s time for business,” says Lambert. “When we know we all three have something really important to say, we have to go with it.”This time Lambert, who goes by the nickname Lone Star Annie in the group (Monroe goes by Hippie Annie and Presley as Holler Annie), got the ball rolling with “When I Was His Wife.” “I started a verse and chorus and sent it to Ang and Ash on a group text,” she says. “They both sent back a verse within five minutes and we had our first Annie song for this project.”“I just dropped everything I was doing and joined in,” says Monroe. “We both got inspired like, ‘Oh my gosh,'” Presley adds of their collaborative process.Because each artist is pursuing a solo career, they feel little pressure to adhere to industry norms when it comes to the album/tour cycle — the group’s last record, Annie Up, dropped in 2013, and since forming in 2010 they have had two weddings, a divorce, a baby, and a baby on the way — or the quest for hit singles.“We don’t ever think, ‘What do we need,’” says Presley with regards to a certain number of uptempo songs or ballads dictated by Nashville standards. “We don’t do that stuff,” says Monroe, “just which songs are the best and which songs belong on here and which make us feel something.”“That’s the beauty of Pistol Annies,” says Lambert, who is vying for her eighth Female Vocalist of the Year trophy at this month’s CMA Awards, thanks to her stellar 2016 double LP, The Weight of These Wings. The trio will perform on the ceremony Nov. 14 on ABC.  “We started the band out of absolute inspiration and passion, and we have not strayed from that. We’ve made it a mission to keep this organic and just go with our heart and gut on everything.”There are no current tour plans, given the approaching due date of Presley’s second child, but they’re not ruling out tearing it up live at some point. “We would love to have some dates,” says Lambert. “We’re all three doing shows, so we’re going to try as much as we can to perform with Annies. If nothing else, it’s just more fun.”Related Content: "}