{"id": "How Bohemian Rhapsody crafted the historic recording of the iconic title song", "paragraph": "Is this the real life? Is this just fantasy?In bringing to life the story of Queen and its lead singer Freddie Mercury, Bohemian Rhapsody, which hit theaters Friday, recreates numerous iconic moments in the band’s career from concerts to music videos and concludes with the band’s history-making performance at Live Aid.Many of the moments put to film delved into the history of the band fans have never seen before, including the recording session at Rockfield farm, which produced hit record A Night at the Opera and the title song, “Bohemian Rhapsody.” From its guitar riff to its operatic section to its six-minute running time, “Bohemian Rhapsody” was an eclectic mix of musical experiments.Bohemian Rhapsody the film takes us inside the recording process, turning a recording session that spanned multiple days into a musical montage that gives us a sense of the inventiveness and absurdity of creating one of Queen’s most beloved songs. EW called up stars Gwilym Lee (Brian May), Joe Mazzello (John Deacon), and Ben Hardy (Roger Taylor), as well as costume designer Julian Day and cinematographer Tom Sigel to get the details on how they turned this fantasy into a real-life experience for viewers around the world.As a song, “Bohemian Rhapsody” plays a role throughout the film, appearing in early scenes as a melody Freddie (Rami Malek) is tinkering with and making a reprise as part of the band’s triumphant performance at Live Aid. But nailing the story of how the song came to be, what it was like recording it, and then trying to sell it to record executives needed to be a central scene in the film.\nNewton Thomas Sigel (Cinematographer): “Bohemian Rhapsody” is the underlying metaphor and the thematic background of the movie in a lot of ways.\nGwilym Lee (Brian May): We started the whole shoot by doing the Live Aid sequence and the beginning of Live Aid is “Bohemian Rhapsody” so we’d done the entire journey of that song in the space of a few weeks. “Bohemian Rhapsody” as it was performed in Live Aid was one of their crowning moments and kicks off what has become one of the greatest live performances of all time. We found ourselves a few weeks later at this farm having to imagine this song didn’t exist and go through the process of creating it.\nSigel: It is meant to show the process of not only creating and recording a song in the way that the band worked together as a unit, but also to give some sense of how “Bohemian Rhapsody” was really unlike any rock song of its time. It utilized over-dubbing to a level that had hardly ever been done before. It introduced everything from hard rock guitar to virtually a cappella operatic vocals to esoteric lyrics to a ballad. We looked for that visual evolution in that sequence.\nBen Hardy (Roger Taylor): It was a privilege to be part of recreating that story of how it came to be. They called it “Fred’s Thing” for the majority of while they were recording it until they came up with the name. Queen was very experimental, always trying new things, and in this instance in particular, the band placed their faith in Freddie and ran with his ideas.\nSigel:  The sequence is like an overlay the way that the tracks were overlaid in the way that it’s constructed. You see Freddie trying to communicate to the rest of the band what he’s doing, the shots get a little quicker and more chaotic and more wacky as it concludes.Spanning multiple decades, the film marks the fashion trends of the 1970s and 80s, reveling in the unique rock star threads of Queen. Establishing the band’s psyche at Rockfield farm and the mindset it took to produce this song started with the clothes.\nJulian Day (costume designer): They went to record in Monmouth which is in the middle of Wales, which is in the complete opposite of London. It’s very rural; it’s a real farming community. I wanted to make them look like they felt really out-of-place. They’re wearing their high heels and fur coats and very London-oriented clothing. That’s where I started off from, and over the days that it happened, they slightly loosen up and become a little bit more rural, a bit more chilled out.\nHardy: [I’m in] a big fur coat, it’s so flamboyant and [I’m] out there in my heels as well, walking into this farm…It was surreal. I grew up in the countryside so I’m familiar with [it] but being there in flamboyant ‘70s costumes was something else entirely.\nDay:  I really love Freddie when he arrives, when he’s in the white t-shirt, the white shoes, the white satin trousers and the yellow and green striped jacket because it’s so incongruous to the surroundings. As the lead, [he’s] the sexy looking guy. Brian was very much the slightly tonier guy. Very stylish. Roger and Deaky were the more fun elements, what people think the essence of the ‘70s is. A bit more flamboyant in that ‘70s way. Deaky wears the pair of jeans that are made out of waistbands of jeans and a matching jacket. You see the chicken and [Roger is] almost like dressed as a chicken. Like a very preening cockerel.The production team set up shop at an actual farm, where they built a recreation of the Rockfield recording studios inside a barn, giving the actors the space to experiment much like the band once had.\nSigel: We built the engineering booth inside a barn and brought all the instruments and everything to create a fairly historically accurate version of the actual recording studio in Wales.\nHardy: They went to a little farmhouse, not very glitzy, not very glamorous. It was interesting recreating that — we were surrounded by farm animals for a couple of weeks while we were filming it. We got a sense of what it must have been like for them being in that recording studio.\nJoseph Mazzello (John Deacon): We got to ad-lib a lot on those days…We could just throw things in there and really feel like we were in the recording studio being inventive, being creative. Bouncing things off of each other as if we were really there in that moment getting the song together.\nLee: The things that were described on the page were probably an eighth of a page with a very simple description saying something along the lines of “Brian May records the famous guitar solo.” That would be the description of the scene, but we’d keep the cameras rolling for 20 minutes at times and be throwing things back and forth to each other.The song is Freddie’s invention, and he plays with the opening chords on a piano before taking the song to the band and overseeing its recording from inside the booth.\nLee: They were all just going along this journey not really knowing what it was going to be but having faith in Freddie’s vision and committing to it. There was an element of that in the way we portrayed it on set each day. The descriptions of the scenes were very, very basic but we tried to really explore what each individual moment would be.\nSigel: We wanted to show the passage of time. That they didn’t create this song overnight. It wasn’t like it all just popped out of Freddie’s head, and it was on tape the next day.\nLee: Freddie, apparently, when he was speaking from the booth into the studio, he always forgot to press the button. That wasn’t in the script, but Brian [May] said, “Oh, he always did that.” Rather than speaking into the microphone, Brian would speak into the pick-up of his guitar and that would get through to the booth. I didn’t know that was possible, but that was one of his details that I’m really fond of because it’s so authentic. It’s come straight from the horse’s mouth.As part of the montage, we see Brian May recording his iconic guitar riff that comes in the middle of the song with Freddie coaching him through finding the sound.\nSigel: Brian May, who is kind of the keeper of the flame, was very generous in giving us access to all kinds of images and footage of that period.\nLee: When it came to the sequence of me recording Brian May’s legendary guitar solo, the cameras were just about to turn over, and there was a hush around the studio as Brian May appeared at the back of the room.\nSigel: There’s nothing more intimidating. He’s about to do this world-famous guitar solo. To have its creator and greatest practitioner show up to cast his watchful eye on you — how Gwilym made it through that moment I have no idea.\nLee: He saw the first take, and he came straight up to me and just put his arm around me and said how pleased he was with it. That summed him up throughout the shoot really. He was so supportive and never looked at us with a critical eye. It was only ever trying to help us and giving us more information to make the scene better.\nSigel: Brian had a really huge contribution in terms of the guitar solo. As did Roger Taylor in terms of the “Galileos.” I wanted to celebrate both of their contributions to it and give them a distinct look between the two. Brian May’s guitar solo is photographed more in the iconic guitar god [way] – [it’s] backlit [with] smoke [and a] slightly mysterious tonality.\nLee: On the monitor, Brian saw, at one point, the camera tilted up from my hands on to my face at a point in the solo where there’s a big bend in the note. He said, “The camera’s on your face there and during that bend, you can really wear it on your face. Give it a bit of a grimace because it really is quite a push on that string.”The song was notable for its overdubbing, which pushed the capacity of the analog tape they were recording on to its limits.\nMazzello: I was on set with Ben who was doing all the “Galileos,” and it was me working off of him, egging him on to continually go higher and do more over-dubs. It was something we wanted to be accurate about because truly they wrecked the tapes.\nSigel: We were able to pull together all of these period mixing boards and tape. This was at a time when analog was still king. You wanted to place it in time, so we feasted on gorgeous close-ups of the tape recorder and the tape going through and the BU meters. [It was] all part of that feel for what it was like to record back in the ‘70s.\nMazzello: They used them all up. The tapes couldn’t take any more dubs. They were basically clear at that point. They just wanted to somehow get this sound that you hadn’t heard before…It was fun to recreate that little bit of history where to get the perfection of this insane operatic section within a rock song they had to almost destroy the very thing they were using to record them.Roger Taylor records the song’s memorable “Galileo’s” in his inimitable falsetto over and over until they get it right.\nSigel: Roger’s vocals are done in closer and closer shots with a very bright highlight of the sun coming through the window — echoing this push from Freddie to go higher and higher with his voice until it’s on the verge of cracking. It’s part of what gives “Bohemian Rhapsody” such a distinctive sound.\nHardy: I didn’t realize I was going to actually be singing it. We were all singing when we were doing the live performances, but we had a backing track going so you couldn’t hear us singing. You felt safe to be singing away. I was there on set in the recording studio and all the crew is down. All of a sudden I realize I have to sing “Galileos,” and it’s incredibly high and incredibly difficult to do. Everyone was going to hear it. I was quite intimidated. I was like well if we’re going to do it, I’m just going to give it my all.\nMazzello: They wanted Roger to go as high as humanly possible; they wanted him to stretch the boundaries of what he could do and just go for it. That was the whole process of “Bohemian Rhapsody” was if they had an idea, even if they felt like maybe it was out there or something crazy, that would just make them want to do it even more and give it a try.\nHardy: We did do it forever. When we shot that, it was mainly me and Joe. We were riffing back and forth doing the “Galileos,” so we did that endlessly to the point where my voice felt like it was going to break. We had a lot of fun with it. He kept saying higher. There’s a certain pitch that Roger does it at, so you couldn’t go any higher than that. But the more I did it, it felt like it was getting higher because my voice was getting tired.\nMazzello: It was funny to torment Ben. I would be like “one more, one more, two more, one more, one more twice, three more one mores,” just to keep him going.\nSigel: There’s a great shot we did of the rooster by himself on the wall crowing and our editor John Ottman, in his inimitable brilliance, put the initial “Galileo” right into the mouth of the rooster, which really caught the spirit of the song.The band comes together in the expanse of the barn to record the final harmonies of the song together as a quartet.\nSigel: We built the recording booth inside the barn and rather than take walls out and fly them in and out like you might do on a stage, I kept it contained to the confines of the actual recording booth. You feel that wizard-behind-the-curtain feel that was so much a part of recording in those days.\nLee: Brian and Roger [Taylor] brought a lot of their instruments onto set that were in the studio on that day in 1975. You look at photos of them when they were recording A Night at the Opera, and you can see these exact same instruments in the background of their photos, including Brian’s first ever guitar. He brought in his acoustic guitar that he was given when he was about 12. This is a piece of music history. It just gives you a real sense of being a part of that history, a real sense of connection to it.\nMazzello: The moment when we are all singing and fall down and everything collapses around us — that was planned, and then it might have been Rami who was just like, “Wait a minute we have all the original instruments here. We’re going to destroy them if we try to do this.” We would have been in so much trouble. We kindly removed them from set and then did the scene where we fall down and destroy everything.\nHardy: For all four of us to be there by the mic, that’s the only time we did that. It really gave you a sense of how fun it must’ve been for the band working together.After a fight with a record executive and a backroom dealing to get the song on the radio, the “Bohemian Rhapsody” portion of the film closes with a recreation of the 1975 music video that shot the band to unprecedented superstardom.\nMazzello: It was my favorite thing. When we saw the film for the first time and you just saw us in that diamond formation, I literally stood up in the theater and just went “Yeahhhhh!”\nSigel: [I studied] the music video. It was a relatively simple set-up, so it’s a question of positioning the guys right and having their heads at the right angle. Then giving it that one top light that gives them that shadowy, mysterious quality and reproducing the opening key where they come out of silhouette and into the light.\nDay: When you really look at it, it’s quite dark and you don’t actually get to see that much. There was a little bit of poetic license, but I wanted to obviously get it as accurate as possible.\nMazzello: What was awesome about it too was that was the last thing the four of us did together. Which was something that was really special.\nHardy: It was definitely daunting. I was very conscious of putting in time and practice into trying to emulate [it] as close as possible. Something like that is so iconic, you know there’s not too much room for artistic license. We actually shot it twice. Because we did it the first time, and I don’t think any of us were 100 percent happy with it. It was still good, but we wanted to shoot it again to try and get it exactly right.\nLee: That music video only goes on for the first minute and twenty seconds of the song, but when we were filming they actually kept playback going all the way through the song right until the “rock-out” section. We got to that moment in the song and we were like, “What do we do now?” There’s only one thing to do, so we did the full Wayne’s World head-banging thing in that diamond formation in all the costumes. That exists somewhere, and I hope the world gets to see it sometime."}