{"id": "Stephen Colbert addresses Pittsburgh synagogue shooting: 'Hate is not what America stands for'", "paragraph": "Stephen Colbert took a moment out of his Late Show monologue from Monday night to address the shooting at the Tree of Life Congregation in Pittsburgh, which claimed 11 lives and injured six others.“It’s tragic, it’s sickening, and our thoughts are with the victims, their families, and the larger Jewish community,” Colbert said. “But more than that, I want to say hate is not what America stands for. And tonight, all of us are with you.”For inspiration in this dark time, the host commended CelebrateMercy and MPower Change, two Muslim-American non-profit groups, for raising nearly $183,000 (at the time this article was published) through their “Muslims Unite for Pittsburgh Synagogue” fundraiser. Colbert also noted the 2,500 people who gathered for a memorial service at the University of Pittsburgh.“It is going to take much more than this to break the resolve of the Jewish people,” Colbert said. “They will continue to worship, to learn, and to sing.”Pivoting to President Trump, the host said “our first mistake” as a nation was looking to our commander in chief “for comfort and guidance” during this time. Colbert criticized Trump for his response to the shooting, specifically how he said the deaths could’ve been avoided if the synagogue had armed guards and for not canceling his political rally in the aftermath.Trump claimed he didn’t cancel his rally in Illinois because the New York Stock Exchange remained opened in the days following 9/11. “That is an inspiring story, if any of it was true,” Colbert said, “because the New York Stock Exchange was closed until Sep. 17. So Trump’s instinct when addressing a tragedy was to lie about another tragedy. I think lying about anything associated with 9/11 is a disqualifier for the presidency or, really, having any job.”Related content:"}