{"id": "This The Haunting of Hill House detail offers chilling alternate theory about that ending", "paragraph": "Spoiler warning for Netflix’s The Haunting of Hill House. There’s something about Hill House that still haunts actor Oliver Jackson-Cohen.The ending of Netflix’s The Haunting of Hill House seems to have finished on a happy note with the Crain kids rescuing younger brother Luke from the clutches of the Red Room… but did they? That’s the question Jackson-Cohen is now asking himself, thanks to this potentially ominous detail in the finale.“There’s this thing that happens when we’re all in the Red Room,” Jackson-Cohen told The Wrap in an interview. “Every, uh — again, I feel like I have to be careful if I’m saying this right. [Laughs] But whenever each child, each sibling, is in the Red Room, something in the fantasy is red. And it’ll be a very, very small thing. For Luke, when Luke gets taken to the hotel room, he’s worn Converse throughout the show, and all of a sudden his Converse are red. And it’s so slight you can barely even see it. And I think Steven is wearing a red jumper [in his fantasy.]”Yup, that checks out. Luke has been wearing black Cons all throughout the series, including his solo episode, “The Twin Thing.” In the finale, he’s spotted with red shoes in the spooky hotel room scene.We’re with you so far, Jackson-Cohen.“And so there’s something at the end — it was Kate [Siegel], who plays Theo, who kind of pointed it out to me — with Luke’s sobriety cake,” the actor continued. “Um, she went, ‘The cake is red.’ And on set I went, ‘Oh, my God!’ And she went, ‘I don’t know!’ And I asked Mike [Flanagan], and he went ‘I don’t know.’ And so I can’t tell whether or not I’m just crazy with this — or whether or not it’s something that could have legs.”There lies the question: Is the scene with the family reunited around Luke real or is it another chilling vision from the Red Room? Viewers have been fooled before.Flanagan previously told EW he and the writers “toyed with a cliffhanger ending” when thinking about the possibility of a second season. “Ultimately, in the writers’ room and with the cast and everything else, we really felt like the story demanded a certain kind of closure from us and we were happy to close the book on that family,” he said.As far as he’s concerned, “The story of the Crain family is told. It’s done.” Whether that story had a happy ending or the one Jackson-Cohen suggested seems up for debate.Related content:"}