{"id": "Queen biopic Bohemian Rhapsody rules the box office with $50 million debut", "paragraph": "Bohemian Rhapsody is proving to be box office dynamite (with a laser beam?).Twentieth Century Fox’s foot-stomping biopic about the influential British rock band Queen is on track to sell an estimated $50 million in tickets at 4,000 theaters in the U.S. and Canada this weekend, far exceeding expectations and easily dethroning Halloween as the No. 1 film in North America. Starring Rami Malek (Mr. Robot) as Queen’s charismatic frontman, Freddie Mercury, Bohemian Rhapsody will notch the second biggest opening for a music biopic ever, behind 2015’s Straight Outta Compton ($60.2 million).Heading into the weekend, the film had been projected to debut in the $35 million to $40 million range. It cost about $52 million to make. Overseas, it will add about $72.5 million in ticket sales this weekend.Tracing Queen’s rise to stardom, internal conflicts, and reconciliation ahead of a legendary Live Aid performance in 1985, Bohemian Rhapsody has had a long and winding path to the screen. For years, Sacha Baron Cohen had been attached to play Mercury, but he left the project in 2013 over creative differences. Later, director Bryan Singer was fired partway through filming after an extended absence that led to a production shutdown, and Dexter Fletcher was brought in to finish the movie. (Singer is the sole credited director.)Setbacks notwithstanding, Bohemian Rhapsody is off to a strong start, and moviegoers gave it an A CinemaScore. Film critics were less impressed, though many have praised Malek’s performance.Arriving with less fanfare this weekend are Disney’s live-action fantasy The Nutcracker and the Four Realms, in second place with about $20 million, and Paramount’s comedy Nobody’s Fool, in third place with about $14 million. Both films are coming in toward the low end of industry projections.Directed by Lasse Hallstrom and Joe Johnston, Nutcracker and the Four Realms is a big-budget retelling of the beloved story about a young girl (Mackenzie Foy) who receives a precious Christmas gift that leads her on a journey to a fantastical new world. Critics were unimpressed by the movie, while audiences gave it a B-plus CinemaScore.Nobody’s Fool, meanwhile, is the first R-rated comedy from Tyler Perry and stars Tiffany Haddish as an ex-con who helps her sister (Tika Sumpter) deal with a potential catfishing situation. Reviews were also poor, though the film received an A-minus CinemaScore.Rounding out the top five this weekend are Warner Bros’. music-driven romance A Star Is Born, with about $11.1 million, and Universal’s slasher reboot/sequel Halloween, with about $11 million.In limited release, Focus Features’ gay-conversion drama Boy Erased is debuting in five theaters with an estimated $220,000 (a strong per-screen average of $44,000), and Aviron’s A Private War, about slain war correspondent Marie Colvin, is opening in four theaters with an estimated $72,000 (a per-screen average of $18,000).Overall box office is up 10.7 percent year-to-date, according to Comscore. See the Nov. 2-4 figures below.1. Bohemian Rhapsody — $50 million\n                2. The Nutcracker and the Four Realms — $20 million\n                3. Nobody’s Fool — $14 million\n                4. A Star Is Born — $11.1 million\n                5. Halloween — $11 million\n                6. Venom — $7.9 million\n                7. Smallfoot — $3.8 million\n                8. Goosebumps 2: Haunted Halloween — $3.7 million\n                9. Hunter Killer — $3.5 million\n                10. The Hate U Give — $3.4 millionRelated content:"}