{"id": "The Bachelor mansion burned by California fires as celebrities flee area", "paragraph": "UPDATE: 11/12: The mansion lives!UPDATED, 11/10: The producers of The Bachelor released this statement: “The Bachelor Mansion is a private home in one of the current burn areas of Los Angeles. The area has been closed to traffic so we do not know the current status of the home. It is primarily a private residence, and our main concern is with the family who has been displaced, their neighbors, and all the communities impacted by this tragic fire. We thank the tireless efforts of the first responders here in Los Angeles County and across the State.”PREVIOUS: The mansion from ABC’s The Bachelor is among the thousands of homes threatened by the devastating California wildfires.The iconic Agoura Hills home used on The Bachelor and The Bachelorette was in path of the fast-moving Woolsey blaze. A source closed to the production confirmed to EW the property’s lower secondary house (which is used by the production camp) has been destroyed and the back patio of the main house was seen on fire before the area was fully evacuated. Since the house is now in a burn area it’s current status is unclear.ABC reality executive Robert Mills had earlier taken to Twitter to note the mansion was in “grave danger.”Thinking of the people of Malibu and yes #TheBachelor Mansion is in grave danger as well. https://t.co/HzTAWgqU6x— Robert Mills (@Millsy11374) November 9, 2018The fire also swept through the historic Western Town at Paramount Ranch, also in Agoura Hills. The Ranch was the location of many Hollywood productions over the years (such as M*A*S*H and Dr. Quinn, Medicine Woman) and contained some of the current sets for HBO’s Westworld.This is eerie. So sad for the history lost. Amazed the church is still standing. #surreal https://t.co/6Xa7cRIWYP— #EvanRachelWould (@evanrachelwood) November 9, 2018The Woolsey fire is quickly moving toward the cities of Calabasas and Malibu. Celebrities reportedly forced to evacuate have included Lady Gaga, Kim Kardashian West, Cher, Rainn Wilson, and Melissa Etheridge.In addition, TMZ reported that Caitlyn Jenner’s home — which was featured on her E! reality show — burned down.I heard the flames have hit our property at our home in Hidden Hills but now are more contained and have stopped at the moment. It doesn’t seems like it is getting worse right now, I just pray the winds are in our favor. God is good. I’m just praying everyone is safe 🙏🏼— Kim Kardashian West (@KimKardashian) November 9, 2018🔥is closer 🙏🏻— Cher (@cher) November 9, 2018Thanks for your concern everyone. Although the 🔥🔥 are dangerously close to our home-@MarilouHamill–@NathanHamill–@GriffinHamill–@chelseahamill-Millie-Mabel & I are all safe at the moment & rooting for our #FearlessFirefighters in their battle vs #MeanMotherNature. pic.twitter.com/nBC5HscBlK— Mark Hamill (@HamillHimself) November 9, 2018Well, well, as if life needed to get more interesting…we have a mandatory evacuation of our home due to the #Woolseyfire . We have gone to a hotel in Santa Monica where we will stay until we can return. Send love and strength to our amazing California firefighters. #safe— Melissa Etheridge (@metheridge) November 9, 2018I just had to evacuate my home from the fires. I took my kids, dogs, computer and my Doc Marten boots. (Husband is in NY. Horses are being evacuated by my trainer.)— Alyssa Milano (@Alyssa_Milano) November 9, 2018My House has been evacuated due to nearby fires in Thousand Oaks. (The pigs & dogs are fine, thank you) Please send your prayers to the people of Thousand Oaks and the victims of the shooting that are now having to evacuate their homes and neighborhoods. Then send them some cash.— RainnWilson (@rainnwilson) November 9, 2018According to ABC News, the Woolsey Fire has covered 14,000 acres and a total of 88,000 residents have been evacuated from their homes. Acting Gov. Gavin Newsom has declared a state of emergency in Los Angeles and Ventura counties."}