{"id": "Legacies star Matthew Davis on discovering a 'different side' of Alaric", "paragraph": "Alaric Saltzman has a long, complicated history with Mystic Falls. When he arrived in town in the first season of The Vampire Diaries, he was a vampire hunter of sorts who simply wanted answers about his wife’s death. And by the time the show had run through its eight seasons on air, Alaric had fallen in love — and lost those loved ones — multiple times. He’d become a surrogate parent to Elena and Jeremy and a drinking buddy to Damon. He’d died… multiple times. And then there was that time the Gilbert ring turned him into a murderer, which resulted in Esther turning him into an Original vampire.And yet, by the end of the series, Alaric had found his happy place by opening the Salvatore School for the Young and Gifted with Caroline so their daughters could grow up in an environment that helped them learn to control their powers. When Legacies kicks off, Alaric is 10 years into running the school, and now he’s got teenage daughters on his hands.EW spoke with star Matthew Davis about how Alaric has changed and what to expect from the latest show in the Vampire Diaries universe.ENTERTAINMENT WEEKLY: As someone who spent eight seasons on The Vampire Diaries, what’s it like to be back in Mystic Falls, playing the same character, but on a new show?\nMATTHEW DAVIS: It’s an odd sensation because you walk in and you’re like, “Oh, I’ve been here before,” but this is totally brand-new and redone in every way. It’s Mystic Falls, it’s Alaric, it’s the Salvatore School, but it’s completely new, and it’s completely fresh and you’ve got a brand-new cast. And we’ve got a whole new engine driving our narrative this show — it’s giving us an opportunity to create a circumstance where something is drawn to Mystic Falls, a series of these different creatures are coming out of the woodwork, and so we’re put on the defense as we figure out what’s going on. So while there’s a familiarity to everything, it’s totally fresh and very new, and everyone’s really excited about it.The monster-of-the-week format is kind of perfect for Alaric. This is a guy who loves researching creatures and knows how to get in on the action. Is he fully back in fighting mode?\n                I think it is tailor-made for him. You’re going to see a whole different side of him, which I’m so glad to have done this now, because I never really felt before that we really got into the nuts and bolts of Alaric and utilized all of his strength the way that we could’ve, and I really feel like that’s what this show is all about. It’s going to be a great look at him, a new perspective on him. It is tailor-made for all of his strengths.Does Alaric have a new drinking buddy?\n                I don’t think you’re going to see him drinking so much. When you’re the headmaster, you’ve got to keep your drinking on the D.L. So I don’t think he’s drinking as much these days. If he does, you might see him drinking with his pal Dorian, or maybe sharing a beer or two with Matt Donovan, hopefully, when they work all their stuff out.I’ll believe he’s not drinking when I smell his coffee.\n                [Laughs] I think you might be on to something. He’s got a little flask hidden away in his desk somewhere.He’s the headmaster of this school, he’s a father of two girls, and he’s a father figure to Hope. How is he juggling all this? Does he constantly have a teenage girl mad at him?\n                He’s definitely wondering where the heck Caroline is. Like, “I can use some help right now, Caroline.” [Laughs] You definitely see him balancing all those roles, all those relationships, and doing his best to service them all, but obviously you can’t please everyone all the time, so he’s going to come up short no matter how hard he tries. But he’s always trying.Hope is obviously hesitant to get close to anyone given her history with loss, but surely Alaric can relate to that. Does that help them bond?\n                Yeah, it would be easier to play him cynical at this point. I think he can certainly relate to the loss, but I also think he’s not about wallowing in it. He’s all about just focusing on the responsibilities, the task at hand, and being the best that he can be as a father, a teacher, and a mentor. That’s what keeps moving him forward.Legacies premieres Thursday, Oct. 25, at 9 p.m. ET on the CW.Related content: "}