{"id": "Saturday Night Live recap: Jonah Hill hosts an episode dominated by midterms mania", "paragraph": "This was one of those by-the-numbers political cold opens that Saturday Night Live has fallen way too in the habit of. Kate McKinnon tries her best playing Laura Ingraham, the right-wing Fox News host, but as she cycles through guests covering topics of the week it soon feels like it’s running on fumes. (Points to Cecily Strong, though, for committing to a sharp parody of snarly anger in her take on Judge Jeanine Pirro.) Fortunately, things got better from there.Jonah Hill is our host this week, and he’s joining the esteemed “Five Timers Club” — an occasion which has inspired many an Opening Monologue. This week was no different — if, perhaps, a bit more self-aware. Hill is first greeted by Tina Fey, SNL head writer-turned-host extraordinaire, who tries to quell his intense enthusiasm about becoming a Five Timer a bit: “Don’t say it, just be it,” she says.She takes him to the group’s exclusive lounge, where they walk in on none other than Drew Barrymore and Candice Bergen. One unique aspect of this sketch? There are no men present other than Hill — not even the usual suspects, like Steve Martin and Alec Baldwin. (Well, the latter was probably unavailable.) One reason why? They’re not allowed in now, because it turns out they’re a bunch of horny perverts,” Fey says. The female SNL hall-of-famers then race through increasingly absurd rumors about men in the club (personal favorite: “Justin Timberlake ripped a lady’s top off at the Super Bowl”) while Hill tries to get a jacket on his hands. When he finally does, it’s a sparkly women’s top. (“It’s 2018,” Fey quips, arguing clothing is now gender-neutral.)One last note on this opener: We get our first mention of Pete Davidson, obviously a major topic this week in the light of his highly-publicized breakup with Ariana Grande. Bergen orders a drink called the “Pete Davidson,” and describes it:  “All I know is, it’s got a lot going on, but it gets the job done.”You know SNL was going to hit midterm mania hard, and in their first sketch on Tuesday’s elections, they did not disappoint, putting out a digital short that hit just the right tone: weary optimism verging on nervous desperation. “There’s a Blue Wave on the horizon and I’ve never felt more… confident,” Heidi Gardner’s proud Democrat says in a tone that sounds anything but confident. Everything about this sketch works — it captures how most are feeling right now with eerie satirical precision — but highlights include Kate McKinnon’s paranoid florist (who pours herself a carafe of bourbon), Aidy Bryant’s mother smacking her son (Davidson) in the face for joking that everyone needs to vote on Thursday, and Beck Bennett crushing a hot coffee cop as he tries to contain his anxiety. The repeated line in the short is “We’re gonna win.” Heh.So continues a heavily political SNL: Colin Jost and Michael Che leaned right into ongoing conversations about voting, potentially flipping the House, and key races going on around the country. Some highlights:Then came the man of the hour, Pete Davidson, to weigh in on a few of the candidates. “After I had to move back in with my mom, I started paying attention,” he began, alluding to his recent breakup for the first time on the show. “I realized there are some really gross people running for office.” He goes after various (mostly Republican) politicians, and gets in some great jabs, including at congressional candidate Greg Pence (yes, that Pence): “This is a picture of him watching that episode of This Is Us where Jack dies.”The biggest takeaway from Weekend Update, however — really the whole episode of SNL is — is how Davidson closed things out. Many thought he’d address his split from Grande in a more joking manner, but he instead struck a serious, sincere tone. “I know some of you are curious about the breakup,” he began. “But the truth is, it’s nobody’s business and sometimes things just don’t work out. And that’s okay. She’s a wonderful, strong person and I genuinely wish her all the happiness in the world.”Later in the segment, Melissa Villaseñor effectively played a “teen Law and Order” suspect left to review YA books like The Hate U Give, and Kenan Thompson reprised his popular David Ortiz role as the Red Sox continue to celebrate their World Series win.Ever try HuckaPM? Aidy Bryant’s brash turn as Sarah Huckabee Sanders tends to be a bit hit-and-miss, depending on the quality of material she’s given, but she got a fun digital short to work in this week. Compared to the dry Cold Open and a relatively Trump-free Weekend Update, this is definitely where the show’s commentary on the presidency hit sharpest. The oft-asked question, “How does Sarah Huckabee Sanders” sleep at night?” gets answered here with a special medication, all for the country’s Press Secretary. It’s just a little stronger than what you might be used to.Kate McKinnon can pretty much do anything — even deliver nonsensical monologues as a driver’s ed teacher who’s just fallen to the floor, and is left to meditate on the meaning of the universe as she addresses her (totally confused) students from down below. The actress gets to show off her range and play brilliantly off her students’ deadpan — including Jonah Hill, who’s gone mostly unmentioned in this recap. Why? His work here is pretty unmemorable. But “Teacher Day” serves as a nice reminder that he’s often funniest when he underplays. This SNL was no exception.Related content:"}