{"id": "Game of Thrones prequel casts Naomi Watts to star", "paragraph": "The Game of Thrones prequel pilot has cast its first actor.Naomi Watts will star in the as-yet-untitled follow-up to the HBO fantasy sensation.The King Kong and Mulholland Drive actress will play a character described as “a charismatic socialite hiding a dark secret.”The GoT prequel is from writer Jane Goldman (Kingsman: The Secret Service, X-Men: First Class, Kick-Ass) and A Song of Ice and Fire author George R.R. Martin.The project is expected to begin filming in early 2019. While there’s no official title as of yet, Martin has suggested The Long Night.The series is actively casting for numerous roles and also seeking a director. Of course, since this is Westeros, you never know how long even a lead actor might stay on a show — Sean Bean famously led the cast of the original series until he checked out in the ninth episode.The network previously released an official description of the show’s storyline, and, like the original series, it’s a tale spread across multiple locations and clans: “Taking place thousands of years before the events of Game of Thrones, the series chronicles the world’s descent from the golden Age of Heroes into its darkest hour. And only one thing is for sure: From the horrifying secrets of Westeros’ history to the true origin of the white walkers, the mysteries of the East, to the Starks of legend… it’s not the story we think we know.”According to Martin’s books, the Age of Heroes began 10,000 years before the events in GoT. Some of the major names which could be characters in the new show include Bran the Builder (who founded House Stark and oversaw construction of The Wall and Winterfell) and Lann the Clever (who founded House Lannister). The era led into The Long Night — a winter that lasted a generation — and the greatest war against the white walkers. Then again, that’s what we think we know, and the logline for the new show says this is “not the story we think we know.”If the prequel is ordered to series, it will mark the first time in HBO’s history that the premium cable network has made a follow-up series to one of its shows. HBO has previously stated that no successor series will air until at least a year after GoT has its series finale, however. Since the eighth and final season of GoT is coming in the first half of next year, the earliest we can expect this prequel is 2020.Obviously, given the show’s timeline, the prequel is not expected to use any of the show’s current cast members (though the Night King making an appearance doesn’t seem out of the question). GoT showrunners David Benioff and Dan Weiss have elected not to be involved; after finishing the final season the duo will transition to penning a Star Wars film for Disney.Follow @jameshibberd for ongoing GoT scoop.Related content: "}