{"id": "Stars pay tribute to Stan Lee for leaving 'an indelible mark' on pop culture", "paragraph": "The comic book world lost one of its most monumental figures Monday when Stan Lee, the influential writer, editor, and longtime Marvel chief, died at age 95. With a career spanning decades, Lee helped bring comics from humble pulp origins to the fore of American pop culture. Along the way, he helped create scores of memorable heroes, including Spider-Man, the Incredible Hulk, the X-Men, and the Fantastic Four — heroes who had godlike powers but were still devastatingly human.As news of Lee’s passing spread, tributes began pouring in from fellow comics creators, big-screen superhero stars, and famous fans — including Robert Downey Jr., Chris Evans, Hugh Jackman, Winston Duke, and more.“How many millions of us are indebted to this guy, none more so than me,” Spider-Man’s Tom Holland wrote.Thanks for everything Stan Lee! What a life, so well lived. I consider myself extraordinarily lucky to have gotten to meet you and to have played in the world you created. 🙏♥️ pic.twitter.com/ryUjG7PL8D— chris pratt (@prattprattpratt) November 12, 2018There will never be another Stan Lee. For decades he provided both young and old with adventure, escape, comfort, confidence, inspiration, strength, friendship and joy. He exuded love and kindness and will leave an indelible mark on so, so, so many lives. Excelsior!!— Chris Evans (@ChrisEvans) November 12, 2018THANK YOU, @TheRealStanLee. You gave us characters that continue to stand the test of time and evolve with our consciousness. You taught us that there are no limits to our future as long as we have access to our imagination. Rest in power! #EXCELSIOR #StanLee #rip pic.twitter.com/hnSmnHIDln— Winston Duke (@Winston_Duke) November 12, 2018We’ve lost a creative genius. Stan Lee was a pioneering force in the superhero universe. I’m proud to have been a small part of his legacy and …. to have helped bring one of his characters to life. #StanLee #Wolverine pic.twitter.com/iOdefi7iYz— Hugh Jackman (@RealHughJackman) November 12, 2018Stan…more than a master of stories, you always seemed like a master of living.  I will look to you for inspiration for the rest of my life.  You live on. xoxo Your Wasp. #liveon #StanLee pic.twitter.com/JRA2aRM3bG— Evangeline Lilly (@EvangelineLilly) November 12, 2018Today we lost one of the greats. @TheRealStanLee, you were a inspiration and superhero to us all. Thank you for contributing so much- and giving us all something to aspire to! 💚 #ripstanlee pic.twitter.com/GzFhwgU0WA— Zoe Saldana (@zoesaldana) November 12, 2018Thank you @TheRealStanLee for the escape from this world & great joy inhabiting the ones you created!! You made so many believe in the good, the heroic, the villainous, the exciting, most of all, you were giving & gracious to us all. RIP— Samuel L. Jackson (@SamuelLJackson) November 12, 2018Sad, sad day. Rest In Power, Uncle Stan. You have made the world a better place through the power of modern mythology and your love of this messy business of being human… pic.twitter.com/x6yZ6ClNSX— Mark Ruffalo (@MarkRuffalo) November 12, 2018RIP my friend. Thank you for the incredible adventures your stories took all of us on. My love and support goes out to all your friends and family #stanlee #legend pic.twitter.com/pTGY8Ffieg— Chris Hemsworth (@chrishemsworth) November 13, 2018Many paid special tribute to Lee’s tradition of on-screen cameos, including Deadpool star Ryan Reynolds. Lee first popped up in the 1989 TV movie The Trial of the Incredible Hulk, and over the years, he appeared in more than 50 Marvel-based TV shows and movies.Damn… RIP Stan. Thanks for everything. pic.twitter.com/TMAaDJSOhh— Ryan Reynolds (@VancityReynolds) November 12, 2018Marvel Studios president Kevin Feige, who helped shape the Marvel Cinematic Universe and brought some of Lee’s most iconic creations to the big screen, thanked Lee for his “extraordinary legacy.”No one has had more of an impact on my career and everything we do at Marvel Studios than Stan Lee. Stan leaves an extraordinary legacy that will outlive us all. Our thoughts are with his daughter, his family, and his millions of fans.  #ThankYouStan #Excelsior!— Kevin Feige (@Kevfeige) November 12, 2018Marvel and Disney also released a lengthy statement honoring Lee’s influence both on screen and on the page, chronicling his rise from comic book assistant to publishing titan. “Every time you open a Marvel comic, Stan will be there,” the statement concludes.Stan Lee was as extraordinary as the characters he created. A super hero in his own right to Marvel fans around the world, Stan had the power to inspire, to entertain, and to connect. The scale of his imagination was only exceeded by the size of his heart. .@TheRealStanLee pic.twitter.com/u2Dux0oGLu— Robert Iger (@RobertIger) November 12, 2018And although Lee may be best known for his work with Marvel, he also collaborated with his company’s longtime rival DC Comics starting in the 2000s. DC also honored Lee by thanking him for his “infectious enthusiasm” and for changing “the way we look at heroes.”He changed the way we look at heroes, and modern comics will always bear his indelible mark. His infectious enthusiasm reminded us why we all fell in love with these stories in the first place. Excelsior, Stan.— DC (@DCComics) November 12, 2018See more reactions below.“You know, I guess one person can make a difference” pic.twitter.com/aaY6RALtNz— Topher Grace (@TopherGrace) November 12, 2018His contribution to Pop Culture was revolutionary & cannot be overstated. He was everything you hoped he would be & MORE. I loved this man & will never stop missing him. They say you should never meet a childhood idol. They are wrong. #RIPStanTheMan pic.twitter.com/6OKH07ahJg— Mark Hamill (@HamillHimself) November 12, 2018At age 7, I drew this weird portrait of Stan Lee and asked my Mom to send it to him. Thankfully she didn't because 30+ years later, I got to give it to the great one in person. Thanks for all the fun Stan #Excelsior pic.twitter.com/IpfYBSjWyf— Jimmy Kimmel (@jimmykimmel) November 12, 2018RIP to one of the greatest creative minds of our time. Thank you for such an incredible legacy and for giving us so many icons that will continue to live on long after you are gone. Goodbye #stanlee – we love you. pic.twitter.com/nxwI1YS3OT— Josh Gad (@joshgad) November 12, 2018He lives forever through his work. What a giant.With great power comes immortality. 💔💔💔 pic.twitter.com/t395qw9H0L— Lin-Manuel Miranda (@Lin_Manuel) November 12, 2018Thank you Stan Lee. For your service in protecting our freedom and for your creativity and imagination! You were and will always be a SUPER HERO! pic.twitter.com/d1qpuImyzQ— Jamie Lee Curtis (@jamieleecurtis) November 12, 2018We met Stan when were were scrubs who snuck in to a party at comicon.  He was as kind and encouraging then as he was when we met professionally years later.  Thank you Stan for making us True Believers as kids and over and over again as adults.— philip lord (@philiplord) November 12, 2018Stan Lee. A gentleman and a genius. It was an honor to be a small part of his universe. Rest In Peace. pic.twitter.com/iZNtQRRqKD— Kat Dennings (@OfficialKat) November 12, 2018What can I say about the loss of a visionary who created one of my favorite characters I've ever played? Stan Lee's fun-loving wit, charm, and poetic legacy will keep him alive for generations to come. My heart hurts, and he will be sorely missed.#StanLee #RIP @TheRealStanLee pic.twitter.com/EPST2GkNTu— Doug Jones (@actordougjones) November 12, 2018RIP Stan Lee. Maybe you have twitter in heaven. Thank you for making my childhood, teen years and adulthood so fun, especially during darker days.— josh groban (@joshgroban) November 12, 2018Rest in Peace Stan Lee 💙— Letitia Wright (@letitiawright) November 12, 2018I was first interviewed for Stan Lee's obituary about 20 years ago. I was happy he defied the reaper and carried on. With Stan gone, an era really does come to an end. He was the happy huckster that comics needed. And he really did alliterate like that when you talked to him.— Neil Gaiman (@neilhimself) November 12, 2018Devastated by my pal Stan's passing. He was a childhood inspiration, an instructor to me when I was just getting started and a genuinely sweet man. Will miss him terribly.— Frank Miller (@FrankMillerInk) November 12, 2018Thank you Stan Lee for making people who feel different realize they are special.— Seth Rogen (@Sethrogen) November 12, 2018Rest In Peace, Stan Lee :-( – such an inspiration to so many people. Changed the world as we know it.— Jessica Henwick 🐒 (@JHenwick) November 12, 2018Stan Lee, RIP. Thanks for inspiring so many of us to pick up a pen or pencil and put your dreams onto paper. Excelsior! pic.twitter.com/L33eTjUQdI— edgarwright (@edgarwright) November 12, 2018Permanent cameo in heaven. #RIPStanLee https://t.co/ZnIv2hXMVy— Patton Oswalt (@pattonoswalt) November 12, 2018RIP @TheRealStanLee He made everyone feel like a kid in his presence no matter what your age. pic.twitter.com/JYeWXq8iKb— Jim Lee (@JimLee) November 12, 2018To Stan Lee: Thank you for making my childhood so much more exciting with your astonishing superhero characters. Thank you for inspiring me to think and dream big. Thank you for the Hulk, Thor, Fantastic Four and many others. You will be sadly missed. RIP.— Gene Simmons (@genesimmons) November 12, 2018Rest In Peace, Mr. Lee. Thanks for everything 💚— 🧛🏻‍♀️Nicole Maines🧛🏻‍♀️ (@NicoleAMaines) November 12, 2018This is bitter news. We were lucky to have him. Untold millions of lives made better by stories. Endless people who learned responsibility from Spider-man, acceptance from the X-men, self-forgiveness from the Hulk.Stan Lee put better heroes in our vision.Forever the Man.— GAIL SIMONE (@GailSimone) November 12, 2018THREAD FOR STAN LEE. Stan Lee gave us more than co-creations X-Men, Iron Man, Hulk, Fantastic Four & Spider-Man. He gave us creeds to live by. Principles to emulate. Villains (and racism) to fight. He gave me vital cornerstones of my belief system. My sense of responsibility. pic.twitter.com/KxUpP7m23h— Brad Meltzer (@bradmeltzer) November 12, 2018Looked up from writing a Marvel script to see the news.Words can be complicated, even for writers. The Man changed the world. I'm thankful I get to write some of the same characters he once touched.— Tini Howard (@TiniHoward) November 12, 2018Excelsior, Stan.— Dave Gibbons (@davegibbons90) November 12, 2018My very first professional comics gig was a variant cover that Stan signed every copy of. Hell of a way to enter the industry. An industry that #StanLee shaped into what it is today. An industry I love. Thank you, Stan. You’ll never be forgotten. #RIPStanLee pic.twitter.com/n4fsC3YGMy— Mitch Gerads (@MitchGerads) November 12, 2018\"And now, until we meet again, may the blessings of Asgard be showered upon you!\" – Stan Lee, Balder the BraveThank you for sharing your genius and your heart with the world, Stan. pic.twitter.com/uMjipTmyY6— Geoff Johns (@geoffjohns) November 12, 2018We have lost Stan Lee, one of our great story-tellers. A writer and imaginer who created whole universes. RIP— R.L. Stine (@RL_Stine) November 12, 2018Farewell, my friend. You’re not only responsible for the boy I was, but also the man I am today. I will miss you all my days. Read it all here: https://t.co/3ni6SLKhWW pic.twitter.com/6naCfXP7HO— KevinSmith (@ThatKevinSmith) November 12, 2018Stan Lee created a universe where, if a character was beloved enough, they could never really die.Now THAT’S thinking ahead. Thanks for so much of my life. You’ll never not be in it.— Joss Whedon (@joss) November 12, 2018RIP Stan Lee ♥️ Thank you for everything. #excelsior pic.twitter.com/7EVB0sMz3Z— Jaimie Alexander (@JaimieAlexander) November 12, 2018You were a man before your time… now it feels like you are gone before your time. RIP Stan the Man… thanks for the laughs and words of support. It’s a honor to live in your universe! #MarvelKnight pic.twitter.com/1TXdPqUB3x— Anthony Mackie (@AnthonyMackie) November 12, 2018Taking a moment to thank the great @therealstanlee for his kindness and allowing me to play one of his favorite characters. The experience I had on #thefantasticfour playing #suestorm #invisiblewoman was so… https://t.co/gbApPlLOub— Jessica Alba (@jessicaalba) November 12, 2018Rest in peace, Soldier.  Comic book creator @TheRealStanLee has passed away at the age of 95. Lee served in the #USArmy Signal Corps during WWII from 1942-1945. We are deeply grateful for his service to our country and for his tremendous support to servicemembers. #Excelsior! pic.twitter.com/P9tdwoxxx2— U.S. Army (@USArmy) November 12, 2018Related content:"}