{"id": "Hee Haw host Roy Clark dies at 85", "paragraph": "Country music trailblazer and Hee Haw host Roy Clark has died at his home in Tulsa, Okla., his publicist confirmed to the Associated Press on Thursday. The cause of death was reportedly complications from pneumonia. He was 85.Clark was best known for his comedy and country music show Hee Haw, which he hosted for its entire 24-year run until the show ended in 1993. His most notable co-host was fellow country musician Buck Owens, but while Owens left the show in 1986, Clark stayed on until the end. In addition to corny jokes and recurring sketches, the show was also an important feature for country music performers. Clark also frequently guest-hosted The Tonight Show for Jonny Carson in the ’70s, a rare opportunity for a country performer.In addition to being an affable TV host, Clark was also a skilled country musician himself. He started playing guitar at age 14, and a year later was performing in his father’s square dance band. He became skilled in all manner of stringed instruments, including the banjo, fiddle, and mandolin. Clark was a trailblazer, becoming one of the first country performers to open a theater in Branson, Missouri. Many others would follow the example of Roy Clark Celebrity Theatre. Clark even headlined a tour in the Soviet Union in 1976, when that was still a rare opportunity for American performers.His biggest hit was 1969’s “Yesterday When I Was Young.” New York Yankees icon Mickey Mantle loved the song so much he implored Clark to play it as his funeral, a request which the musician honored when the time came in 1995.After news of Clark’s death broke, several musicians and celebrities offered up tributes to his influence on them.Roy Clark shaped my path. My Papaw introduced me to his music as a toddler. Every Saturday we’d watch Hee Haw. My first guitar book was a Roy Clark guitar method. I practiced his style, then practiced making his facial expressions. He was a hero. And so many have the same story.— Brad Paisley (@BradPaisley) November 15, 2018My first CMA memory is sitting on my living room floor watching Roy Clark tear it up. Sending my love and respect to him and his family for all he did. – KU— Keith Urban (@KeithUrban) November 15, 2018R.I.P. Roy Clark. Oh man so many memories growing up with him on hee haw. Another part of my childhood that made growing up the way I did awesome. Hee Haw, Johnny Carson, Paul Harvey among others are everywhere in my memory bank. He lived a long great life and I thank him. SALUTE pic.twitter.com/yKBuXLAzOq— Larry The Cable Guy (@GitRDoneLarry) November 15, 2018\"The next chance you get, do somethin' nice for somebody – say 'good day,' hold a door open – and don't wait around for a thank you… you don't need it.\" — Roy Clark  Roy, thank you for always spreading laughter, kindness, and positivity. We'll keep it goin' for ya! ❤️ pic.twitter.com/Gs3AdJSKQd— Grand Ole Opry (@opry) November 15, 2018The guitar I’ve been playing onstage for the last two years is signed by the legend himself. It’s now retired. God bless my friend Roy Clark. Rest In Peace, my brother. pic.twitter.com/KtzXf1NlD5— Chad Prather (@WatchChad) November 15, 2018Just got word that Roy Clark has passed.I’ve known him for 60 years and he was a fine musician and entertainer Rest In Peace Buddy, you will be remembered— Charlie Daniels (@CharlieDaniels) November 15, 2018Just heard that the amazing Roy Clark has passed away. I was dazzled by his playing when I was growing up. A total beast AND great entertainer. RIP pic.twitter.com/MUw81ebaBo— Greg Capullo (@GregCapullo) November 15, 2018"}