{"id": "Exclusive: Listen to John Williams' new score for Disney's Star Wars theme parks", "paragraph": "While exploring the furthest reaches of the galaxy, you’re going to need some traveling music.Legendary composer John Williams will provide an original score that visitors will hear within the attractions of the Star Wars-themed land of Galaxy’s Edge, opening at Disney’s theme parks next year.Entertainment Weekly has an exclusive preview of Williams’ score in the video above, along with a new aerial view of the alien world of Batuu, currently under construction at both Disneyland in Anaheim, California, and Disney’s Hollywood Studios in Orlando, Florida.The village, known as Black Spire, is a remote trading outpost tucked amid the rocky spikes of an ancient petrified forest. The town serves as a Casablanca-like nexus between the forces of good, evil, and in between as they clash over control of the galaxy.Below, we also feature exclusive new previews of the two main rides: the Millennium Falcon: Smugglers Run experience and a space battle called Rise of the Resistance, which takes place aboard a First Order starship.Disney tells EW there will be even more music for the 14-acre park expansions from Williams, who is also working on director J.J. Abrams’ Episode IX for next December.The video above is a sample of the Oscar winner’s overarching theme for Galaxy’s Edge, an alternately playful and majestic introduction that was recently recorded by the London Symphony Orchestra at Abbey Road Studios, conducted by Williams’ longtime associate William Ross.News that Williams is contributing music will be formally unveiled today at the fan gathering Destination D in Orlando, along with video previews of the Star Wars attractions from Bob Chapek, chairman of Disney Parks, Experiences, and Consumer Products.For those not at the Orlando event, EW has an exclusive look at what he’ll be showing off. First, a video that shows visitors firing up the engines of the ride known as Millennium Falcon: Smugglers Run (no apostrophe), which will put them inside the cockpit of Han Solo’s “fastest ship in the galaxy” for a daring escape from Batuu. Guests can take on one of three different duties to make sure the mission is a success.In the Rise of the Resistance attraction, guests will experience what it’s like to be caught in the crossfire of a deep-space battle between the First Order and the X-Wing dogfighters of the Resistance.This video was actually shot inside the finished interior of the ride, which allows visitors to explore the hangar bay and control deck of a First Order destroyer.At one point in the adventure, sources tell EW, visitors will come face to face in battle against Kylo Ren.Finally, we have a new look at the Star Wars hotel planned for the Walt Disney World Resort.It’s an innovative concept that turns the accommodations into their own ride with a multiday experience that immerses visitors amid characters inhabiting an orbiting luxury starship.The journey begins with guests boarding a shuttle pod that transports them from Earth to their hotel in space. Here we see concept art of how the pod “docks” with the larger starship. (That astromech droid looks a lot like R2-D2, which would add bellhop to his many duties.)And here is an interior look, with a family riding the pod to begin their vacation in the galaxy.The Galaxy’s Edge experience at Disneyland will open in the summer, while the one at Disney’s Hollywood Studios will debut next fall.Related content:"}