{"id": "Supergirl casts Two and a Half Men's Jon Cryer as Lex Luthor", "paragraph": "Jon Cryer is rejoining the Luthor family.On Friday, the CW announced that the Emmy-winning actor will recur as Lex Luthor on Supergirl. The Two and a Half Men star will make his debut as the iconic Superman villain in the 15th episode of season 4.Cryer’s casting is pretty funny given his history with the Luthor bloodline: The actor played Lenny Luthor, Lex’s nephew, in Superman IV: The Quest for Peace. In fact, that’s at least one of the reasons he was cast in the new role.“We are enormous fans of Jon Cryer, and he was instantly our dream actor to play the iconic role of Lex Luthor,” said Supergirl showrunners/executive producers Jessica Queller and Robert Rovner in a statement. “Jon is a super-talent, and the fact that he played Lenny Luthor in Superman IV brings an added layer of legacy to his casting.  We’re beyond thrilled to welcome Jon to the Supergirl family.”Though Lex hasn’t appeared on Supergirl yet, his presence has loomed over the series since season 2, which introduced both his sister, Lena (Katie McGrath), who runs his company while he’s serving multiple life sentences, and his villainous mother, Lillian (Brenda Strong), who is presently behind bars as well. It’s currently unclear how Lex will figure into the narrative, but odds are he’ll play a part in this season’s exploration of xenophobia.The list of actors who have previously played the criminal genius and billionaire includes Michael Rosenbaum (Smallville), Jesse Eisenberg (Batman v. Superman: Dawn of Justice), Kevin Spacey (Superman Returns), and Gene Hackman (the Christopher Reeve Superman movies). Clancy Brown delivered an equally memorable turn as the voice of Lex on the DC Animated Universe shows Superman: The Animated Series and Justice League.In addition to Superman IV and Two and a Half Men, Cryer’s screen credits include the John Hughes cult classic Pretty in Pink and a recent guest appearance on Will & Grace. He just wrapped production on Big Time Adolescence, a coming-of-age drama starring Saturday Night Live’s Pete Davidson.Supergirl airs Sundays at 8 p.m. on the CW.Related content:"}