{"id": "At NewFest, an LGBTQ film festival becomes a form of resistance", "paragraph": "For the 30th anniversary of NewFest, New York’s LGBTQ film festival, executive director Robert Kushner began his opening night remarks with a nod back to 1988, when the organization was founded. “During the height of the AIDS crisis, a festival like NewFest was critical,” he told the SVA Theatre audience in Chelsea. “Our community was being torn apart both by illness and in the media. We were craving safe spaces and true representations of who we were. It’s at this time when our lives were being defined by a plague and our humanity was being overshadowed.”In 2018, the culture has changed, but the value remains. “It’s almost like running this [festival] is a form of resistance in its own way,” Yen Tan, director of the opening night film 1985, tells EW. “There’s a political charge to it with how people are talking about gay festivals and the importance of gay films and representation and all these things.”It’s a resistance that feels like a response to a government that doesn’t support queer people and an industry that doesn’t always support queer stories.The theater erupted in boos when Kushner referenced the New York Times report about President Trump’s intention to legally write the transgender community out of existence. Dennis Williams, HBO’s SVP of Corporate Social Responsibility & Corporate Affairs, then followed with a story of how his colleagues evacuated the Time Warner building in Manhattan over a suspicious package related to a string of pipe bomb threats mailed by a now-arrested pro-Trump zealot.For a community under attack, visibility is often the best defense against discrimination and misinformation, but this visibility can be an uphill battle. In Hollywood, LGBTQ representation is still excluded from most major studio releases. In the indie landscape, queer voices are fighting to be heard by financiers and distributors. NewFest, though it lacks the funding of a Sundance or Cannes, gives this visibility to a community still craving it.1985 (out now) hits select theaters in New York and Los Angeles, but at NewFest, it held the prime opening night spot. Rafiki, a film from director Wanuri Kahiu, was banned in Kenya over its openly LGBTQ content, but it screened in late October as the International Centerpiece. Trans stories like Coby (a documentary about the day-to-day of the titular trans paramedic), Bixa Travesty (the story of black Brazilian trans singer Linn da Quebrada), and Man Made (about trans bodybuilders) also shared the programming spotlight.It’s a platform and a community that Desiree Akhavan, the director behind Chloë Grace Moretz starrer The Miseducation of Cameron Post, calls crucial for filmmakers trying to plant their footing in the industry. “I think it helps a lot in the early days of your career when no one really wants to take a risk,” she says of LGBTQ film festivals. “Queer festivals, queer programmers, queer critics champion the work they see in a way that others don’t have the same interest in.”As a first-time feature filmmaker with 2015’s Appropriate Behavior, Akhavan started developing the concept for her new television series called The Bisexual — a stereotype-knocking story of a New Yorker navigating her newfound bisexuality with help from a wingman. She initially pitched it to American-based networks after the press tour for Appropriate Behavior but found she couldn’t get work.“It was funny,” she says, “I went to a lot of different networks and the vibe was always, ‘I’m so sorry, we already have a female-driven show’ or ‘I’m so sorry, we already have a queer show and we don’t want to cannibalize the business with a show that will be in that direct marketplace.'”Akhavan had more luck selling The Bisexual in the U.K., mainly because the industry there was financially different. Akhavan, who now lives in London, made her way overseas with the intent of temporarily working with a writing partner on new material. She found the budgets were typically less than U.S. productions, so the risk of a flop was less. “When I got to London, suddenly every conversation I had was different,” she recalls. “It was like, ‘What chances do you want to take?’ ‘What are your ideas?’ ‘Where do you want to go with this?’ ‘How do you want to make this unlike anything else I’ve seen?’ And it was very easy to sell [The Bisexual].”In October, NewFest welcomed the gestating series for its U.S. premiere. Debuting the first two episodes at the festival before heading to its new home on Hulu, Akhavan now sees NewFest as a means of returning home to her LGBTQ family, especially in an industry landscape that didn’t initially accept the concept. “I know I’m sharing the content with the people who I specifically made it for, with the people who are like me,” she says. “It’s more emotional.”With LGBTQ festivals also comes a systemic dilemma that Tan, personally, has difficulty reconciling. When a film premieres at a Sundance or Cannes, it brings a “legitimacy” to the work. Films that primarily go to LGBTQ festivals are labeled as niche and the industry often treats them as such in terms of financing and distribution. Tan doesn’t believe it’s a “black-and-white sort of thing,” but one with “a lot of nuances to the way people make decisions.” Trying to reconcile it all, however, “is just a road to more frustration.”“I believe they call it ghettoization of the queer film marketplace,” Akhavan remarks. “You’re definitely aware of the fact that you’re a second-class citizen in a lot of film buyers’ eyes. I would like to reinvent what a queer film means. I think that can be something mainstream. I think it’s about having the courage to make your content and let someone label it however they want and then to re-appropriate that label.”The development of Boy Erased, an adaptation of Garrard Conley’s memoir on conversion therapy, was already a different experience for Joel Edgerton, who came with connections in the industry as an actor and previous experience as a director on The Gift. But he, too, was aware of the challenges of fighting that niche label.“‘LGBTQ stories’ is not a genre,” he says. “It just happens to be a character or a backdrop or a certain part of the environment to a story, but how could people call it a genre?”His response was to get as many “big-hitting actors” attached to Boy Erased as possible before approaching potential buyers, “then finance would be unquestionable,” he notes. So he brought Lucas Hedges, Nicole Kidman, and Russell Crowe to the table, which sparked a competition amongst distributors. “They would otherwise be like, ‘Eh, we don’t know about this,'” Edgerton predicts.The film has now become more mainstream as it gets a nationwide release, starting with New York and Los Angeles this weekend. At the same time, Tan recognizes the competition that occurs between LGBTQ films in the eyes of distributors — similar to Akhavan’s feedback on The Bisexual from American networks. “There’s always this weird idea of, there’s not enough space for all of us,” he says.Other filmmakers, especially those who identify as LGBTQ, don’t always have the same resources as Edgerton, which makes film festivals like NewFest crucial. It gave Lisa Cholodenko the support she needed as a budding filmmaker to launch her career. More than two decades later, after directing The Kids Are All Right and episodes of NBC’s The Slap and HBO’s Here and Now, she came back to NewFest to commemorate the 20th anniversary of High Art with actress Patricia Clarkson — a film lifted up by NewFest in 1998.“I think we have this fantasy that we’ve [LGBTQ people] assimilated and we’ve folded into the larger culture and I think that’s not true,” Cholodenko says. “I think that’s always been born out in different ways, unfortunately. So I think having a traditional place at home for these films is great, and I think we’ve gone through many cycles: the AIDS crisis to what came next to marriage equality to Trump to this to that. There’s always a need to come home and have your people.”Related content:"}