{"id": "Marvel Comics legend Stan Lee dies at 95", "paragraph": "Were it not for Stan Lee, superheroes would be fewer in number, financially poorer, but better-adjusted people. The torch-bearing writer, editor, and longtime Marvel Comics head honcho has died, his representatives confirmed Monday. He was 95.Lee’s innovations pushed comic books from the edge of obscurity to the cultural forefront as a legitimate American art form. And he helped usher in an era when superhero movies, including such global blockbusters as Marvel Studios’ Iron Man and Avengers franchises, rank as Hollywood’s most reliably bankable entertainment properties.The son of working-class Jewish immigrants from Romania, Lee was born Stanley Martin Lieber in New York in 1922. He adopted his famous pseudonym while employed as a proofreader and text filler at Timely Comics, the pulp publisher that later became Marvel. “I felt someday I’d be writing the Great American Novel and I didn’t want to use my real name on these silly little comics,” said Lee, who later legally adopted his pen name.In the early ’60s, when superheroes battled villainy as blandly indestructible paragons of virtue, the comics upstart grew disenchanted with such strait-laced characters as Superman, Batman, and the Flash, who were then flourishing at rival DC Comics. As a result, Lee strayed from accepted tropes to create an interlocking network of heroes with a kind of flawed humanity — a breakthrough dubbed the “Marvel revolution” that would ripple across popular culture for decades.pic.twitter.com/dTdDjRvXbs— stan lee (@TheRealStanLee) November 12, 2018Unlike so many other caped crusaders of the time, Lee’s heroes tended to be misfits and wisecrackers, teenagers or regular Joes given to fits of pique, self-pity, rage, insecurity, and churlishness. Spider-Man’s Peter Parker, for example, was an orphaned nerd who — when not saving New York City from impending disaster — wrestled with unrequited love, schoolyard bullying, and negative cash flow. The X-Men, meanwhile, captured the zeitgeist as bona fide members of the counterculture. They were superpowered mutants intent on doing good but forced to maintain an uneasy peace with human beings who reviled the “uncanny” crime-fighters as a dangerous subspecies.Another classic Lee antihero, Fantastic Four strongman the Thing, vanquished foes with superhuman strength and an impenetrable, rock-like hide but became beloved for the sum of his quirks: the character’s lingering unease with his monstrous condition and a gravelly New York brio Lee swiped from Jimmy Durante.At the height of the civil rights movement, Lee helped introduce a wave of black characters including Luke Cage (a.k.a. Power Man), Falcon, and Black Panther, thereby smashing an unofficial color barrier for major superheroes held in place since the dawn of comics. “Not to have diversity of different races and nationalities is ridiculous,” Lee told EW in June 2015. “Because the world is diverse. The more we can include everybody, the better it is.”By the late ’60s, Marvel was selling 50 million comic books a year. In 1972, Lee became the company’s president and publisher. In conjunction with a number of illustrators — most notably freelance artists Jack Kirby and Steve Ditko — he perfected an assembly-line model of comic book production that came to be known as the Marvel Method. Lee would pump out characters and rough plotlines, then hand his unfinished ideas over to artists who fleshed out the action before handing the work back to Lee for his signature punchy dialogue. Comic book artist Gil Kane noted that Lee “wrote one book a night for 10 years. Not only was it easy for him, but it was the best thing that happened to comics.”Although the Marvel Method evolved into the industry standard, it resulted in no small amount of bitterness. Kirby, whose pen strokes birthed such iconic heroes as Spider-Man, the Silver Surfer, and the X-Men, became estranged from Lee over money issues and creative credit, a controversy that has outlived both men and continues to rage in fanboy forums to this day. “I came up with the Fantastic Four. I came up with Thor,” Kirby said in a 1991 interview with The Comics Journal. “Whatever it took to sell a [comic] book, I came up with. Stan Lee has never been editorial-minded. It wasn’t possible for a man like Stan Lee to come up with new things.”In his later career, Lee became known for his P.T. Barnum-like hucksterism and tireless self-promotion, turning up across the media landscape to conjecture (often erroneously) about Marvel movie projects. He even launched a signature cologne in 2013. But despite his inextricable link to Marvel for over half a century, Lee never maintained ownership rights to the characters. So when Marvel Entertainment was sold to Disney for $4.2 billion in 2009, the man once known as “Mr. Marvel” didn’t see a penny of profit. “I was always a Marvel employee, a writer for hire, and, later, part of the management,” he told Playboy in 2014. “Marvel always owned the rights to these characters. If I owned them, I probably wouldn’t be talking to you right now.”Lee received the National Medal of Arts and the National Humanities Medal from President George W. Bush in 2008 and was inducted into the comics industry’s Jack Kirby Hall of Fame and Will Eisner Award Hall of Fame.In recent years, Lee maintained his cultural presence operating Pow! Entertainment, a multimedia company that develops and licenses film, television, animation, and video game properties, and serving as one of the partners of Los Angeles Comic Con. (Lee sold Pow to Hong Kong-based Camsing International in 2017 and ended his relationship with L.A. Comic Con in 2018.) He also made regular cameo appearances in Marvel-produced films.For seven decades, Lee was married to Joan Boocock Lee, an English native and onetime hat model. “She was the girl I had been drawing all my life,” Lee would say of his wife. The Lees had two children: Joan Celia, also known as “J.C.”, who was born in 1950, and Jan, who died days after her birth in 1953. Joan Boocock Lee preceded her husband in death in 2017.Stan Lee was not untouched by turmoil or controversy in later life. In January, he was reportedly accused of sexual harassment by employees of a nursing company. A lawyer representing Lee “categorically” denied the allegations, calling them “false and despicable.”In March, TMZ reported that Lee contacted police after he noticed $1.4 million missing from his bank account. Around the same time, he revealed in a video addressed to fans that he had been battling pneumonia, which caused him to cancel several public appearances.A month later, a report in The Hollywood Reporter detailed strained relationships and infighting between Lee, daughter J.C., and other members of his inner circle. Lee also sued his former manager for allegedly duping him out of millions of dollars.In a video to fans in March, Lee appeared sanguine. “I want you all to know I’m thinking of you,” he said. “I want you to know that I still love you all. And I think that Marvel and Spidey and I had the best group of fans that any group in the world ever had, and I sure appreciate it.”Related content:"}