{"id": "How Brad Paisley and Carrie Underwood plan to celebrate their 11th time hosting the CMA Awards", "paragraph": "The traditional eleventh-anniversary gift is steel. So, when EW asks Brad Paisley and Carrie Underwood what they might be getting each other to commemorate their eleventh time hosting the CMA Awards, next Wednesday, Nov. 14 at 8 p.m. ET on ABC, Underwood jokingly exclaims, “Swords!”Clearly a Game of Thrones fan, Paisley adds, “Yes, we got each other Valyrian steel swords.” (Valyrian steel is the preferred sword material for those in the know in Westeros.) “I’m getting Widow’s Wail.”Underwood interjects that she is more of a Walking Dead gal and would prefer something more in the key of Michonne’s katana. Perhaps she could use it to keep Paisley in line during the telecast? “I think that’s an excellent idea,” she says.Read on to see who the always jovial Underwood — who is nominated for Female Vocalist of the Year and Music Video of the Year for the title track to her album Cry Pretty — and Paisley are rooting for this year, how they’re crafting their monologue, and who they’re excited to see perform on country music’s biggest night.Paisley and Underwood goofed around with Tim McGraw and Faith Hill dolls during the 2014 CMA Awards.ENTERTAINMENT WEEKLY: You’re probably not allowed to openly root for anyone given that you’re the hosts but…are their artists you’re hoping to see win?Underwood: I would say I hope I win! I’m okay with that.Paisley: I hope Carrie doesn’t win.Underwood: Everybody hopes that they’ll win. Anybody who tells you that it’s just an honor to be nominated — it is, but they want to win.Are there performances you all are looking forward to?Paisley: Yeah, Ricky Skaggs is going in the [Country Music] Hall of Fame and I’m excited about being a part of a tribute to him, which will be fun. What a legend. There’s gonna be some really great playing on that. Maybe not from me, but somebody will play really well on that.Underwood: I’m always looking forward to seeing just what people show up and put on. I know everybody wants their performances to be unique and special. It’s always been interesting to see who comes up with what, so I don’t know if there’s anyone that I’m looking specifically forward to, but it’s bound to be a good night and full of lots of people just giving it their all.Carrie, you normally do a number of costume changes. I’m assuming that at this stage of your pregnancy, that might make things a little trickier this year. Are you still planning multiple outfits?Underwood: I’m gonna give it my all. We had a fitting recently and I thought I would cry but I didn’t so that was off to a good start. [Laughs] We came up with some things and I think we’re gonna have another [fitting] within the next couple of days. We’ll see what else they come up with and I’ll do my best.In terms of the monologue, how close to actual show time are you still polishing it and working on the jokes?Paisley: Hopefully, we’re done on Monday and then we’re just working out the kinks. Quite often we’re trying to figure something out on Wednesday that isn’t working.Underwood: Yeah, we’re tweaking ’til the end.Can we expect some humorous songs during the monologue?Paisley: Well, there’ll be songs. Whether they’re humorous or not will all depend on how well we do this weekend with the writing.Carrie: We hope people laugh!Given the current headlines, from the recent shootings to the political climate, how do you all approach balancing reverence for the moment with keeping things entertaining to give people a few laughs to escape?Paisley: I don’t know. I think you just know when you’re in the moment when it’s time to sort of add levity. We’re trying to balance a little bit of that but at the same time, I think everybody’s gonna be tuning in next week largely for more of the levity. Largely for the chance to get away and we’re gonna try our best — especially with our monologue, which exists to be funny — to give them that.Carrie, we know that you will be heading out on tour in 2019. Brad what do you have on tap next musically?Paisley: I’m releasing a song next week. I’ll announce some tour stuff coming up soon as well.So we have that to look forward to in 2019?Paisley: Look forward to or dread, whatever your perspective may be. [Laughs]The 52nd CMA Awards air Wednesday, Nov. 14 on ABC at 8 p.m. ET.Related content:"}