{"id": "Megyn Kelly apologizes on air for blackface defense: 'I was wrong and I am sorry'", "paragraph": "After apologizing to her NBC colleagues for a segment that aired Tuesday on Megyn Kelly TODAY, the show’s namesake host tried again to make amends for defending the use of blackface in Halloween costumes.“I want to begin with two words, I’m sorry,” Kelly began in an apology that aired on her show Wednesday morning.She pointed out how she “defended the idea” of blackface, “saying as long as it was respectful and part of a Halloween costume, it seemed okay. Well, I was wrong and I am sorry. One of the great parts of sitting in this chair each day is getting to discuss different points of view. Sometimes I talk and sometimes I listen and yesterday I learnt. I learned that given the history of blackface being used in awful ways by racists in this country it is not okay for that to be part of any costume, Halloween or otherwise.”\"I want to begin with two words, I'm sorry..The country feels so divided and I have no wish to add to that pain and offense. I believe this is a time for more understanding, more love, more sensitivity and honor..Thank you for listening and for helping me listen too.\" Megyn Kelly pic.twitter.com/6hHrvZLNvK— Megyn Kelly TODAY (@MegynTODAY) October 24, 2018The segment in question saw Kelly defending Real Housewives of New York star Luann de Lessep’s Diana Ross Halloween costume, saying, “Who doesn’t love Diana Ross? She wants to look like Diana Ross for one day, and I don’t know how that got racist on Halloween.”Kelly also stated, “What is racist? Because truly you do get in trouble if you are a white person who puts on blackface at Halloween or a black person who puts on whiteface for Halloween. Back when I was a kid, that was okay as long as you were dressing up as like a character.”These statements earned the ire of many on social media, including Top Chef‘s Padma Lakshmi, The Daily Show‘s Roy Wood Jr., Patton Oswalt, and Kelly’s NBC colleague Seth Meyers.During a segment, Meyers brought out his Late Night correspondent Amber Ruffin to address the situation. “It’s not racist on Halloween. It’s racist every day,” Ruffin said. “There’s no magical day where you can wear blackface with no repercussions — unless all of your friends are white, and I’m guessing all of Megyn Kelly’s friends are white.”“I have never been a PC kind of person, but I do understand the value of being sensitive to our history, particularly on race and ethnicity,” Kelly concluded on air Wednesday. “This past year as been so painful for many people of color. The country feels so divided and I have no wish to add to that pain and offense. I believe this is a time for more understanding, more love, more sensitivity, and honor. And I want to be part of that. Thank you for listening and for helping me listen too.”Kelly’s words echoed her previous apology that was sent to coworkers in an internal email memo. She wrote, in part, “Today is one of those days where listening carefully to other points of view, including from friends and colleagues, is leading me to rethink my own views.”Related content:"}