{"id": "Karyn Kusama, Heather Graham, Polly Draper among female directors talking broken Hollywood culture at SCAD Savannah Film Festival", "paragraph": "On Monday at SCAD Savannah Film Festival, a panel of Wonder Women directors joined EW’s Devan Coggan to discuss their careers to date and share insight into the movie-making industry.The impressive lineup included Heather Graham (who made her directorial debut with Half Magic earlier this year), Christina Choe (Nancy), Polly Draper (Stella’s Last Weekend), Debra Granik (Leave No Trace), Karyn Kusama, (Destroyer), Hannah Marks (After Everything) and A.M. Lukas (One Cambodian Family Please for My Pleasure).All of the filmmakers wasted no time getting into a discussion on everything from how they got started (Draper made a home movie called Murder on Draper Lane and cast everyone in her neighborhood in it), their most difficult days on set (Choe recalled discovering an area they wanted to shoot in was rife was Confederate flags so production had to be moved), and the female experience in the largely male-dominated world of filmmaking.Draper shared a story of creating a television series for Nickelodeon and then having to suffer through a call from the Directors Guild making sure she understood that there’s a difference between acting and directing, adding that she questioned the man making the call if he’d ask the same question of a male actor. “That may be a thing of the past,” she said. “It might be that there are enough actresses that are getting into the business or men are too scared now with #MeToo to ever say something like that now, but that was my experience with joining the Directors Guild. That prejudice is out there.”When asked if things have shifted in the last year for women in the industry, Kusama replied: “Things can’t shift in a year. I wish they could, but, personally the Kavanaugh hearings proved to be that almost nothing has changed and if anything the backlash is so much stronger right now that what we as the women sitting up here, and the women and men in this audience right now all have to do is look at this and say, ‘this is a problem that will threaten our very survival as a species.’ I’ve been asked this question for 20 years and I don’t know what to say other than maybe the moment we’re in is charged enough that you can’t just say completely stupid, completely ignorant things and get away with it anymore.”While all the panelists agreed that there was a long way to go in the business — and in general — before women were going to find themselves probably represented and given the opportunities they deserve, they also felt optimistic when reflecting on how the last couple of years have united women and seen them come together in united goals.“I do find myself talking about it so much with women and finding these new friends who are making their lives about it, who are starting organizations and having events and it’s just like this love fest,” said Lukas. “The one thing that maybe has shifted is that we’re all confronting reality now. We are having this powerful relationship with the reality of things rather than thinking, ‘Okay, I know I’m a woman but I’m going to join that boys’ club, I’m going to be good enough to get in…that’s how it used to be…now I think there’s more of a camaraderie and an understanding that this is something that we should all make sure everybody’s aware of and bring each other up and go for it.”When asked what men could do to help there be better representation, Choe replied simply: “Hire us.” While Kusama questioned how we can change the culture. “I feel like there’s a larger question which is how do we get to a place where men say ‘I really wanna…work with any of the women up here, not because of some cultural mandate, but because they simply respect the work and think they have something to learn from us which they do. There’s a part of me that wants to say if we simply burrow in and say this is our tribe and only support each other, I wonder if down the line we create some divisions that ultimately we’re trying to get passed. I don’t know the answer to the question but my hope is that some day, we just get to a different level of the conversation.”First-time director Graham felt it’s a general respect towards femininity that was needed. “I think masculinity is held up on this pedestal and … instead of saying our femininity is a beautiful thing we think of it as a bad thing,” she said. “Now we’re in a time where we can be women, and be powerful, and be feminine, and be sexual and enjoy our femininity…Our culture as a whole needs a mass healing to respect femininity in general.”Related content:"}