{"id": "Mary Queen of Scots reviews stoke Oscar fire for 'savagely strong' Saoirse Ronan", "paragraph": "Playing feuding monarchs has proven to be a royal success for Mary Queen of Scots‘ leading pair of Oscar hopefuls.Saoirse Ronan and Margot Robbie — who play the titular Scottish sovereign and her cousin, Queen Elizabeth I, respectively, in Josie Rourke’s period drama — have joined the awards conversation as critical reviews trickle in out of the film’s world premiere screening Thursday at the close of AFI Fest.The Hollywood Reporter‘s Todd McCarthy notes both actresses “shine” in experienced stage director Rourke’s first full-length feature, which frames the historical tale as a “of-the-political-moment telling” of gender in society and politics that dovetails with the #MeToo and #TimesUp movements: “Ronan carries the film with fiercely individualistic spirit [while] Robbie is tough and imperious as required but allows a human side into her performance that gives the limited role as much dimension as time allows,” he writes.Writing for The Guardian, Benjamin Lee calls Ronan “the film’s most thrilling pleasure” thanks to her “show-stopping lead performance” that registers as “vulnerable, terrifying, strong, sexy, and effortlessly dominant when taking charge of the men who are trying to outsmart her.”The Wrap‘s Yolanda Machado agrees: “Bow down to Ronan and Robbie for taking two legendarily complex characters, who have been reborn countless times in film and television, and completely owning both roles,” she writes. “Ronan’s fiery Mary and Robbie’s emotionally complex Elizabeth truly reign divine on screen.”Both actresses face stiff competition ahead if they are to break into the crowded Oscar race. In the best actress category, Ronan is fighting for a spot next to several well-received performances from Glenn Close (The Wife), Lady Gaga (A Star is Born), Melissa McCarthy (Can You Ever Forgive Me?), Yalitza Aparicio (Roma), Olivia Colman (The Favourite), Emily Blunt (Mary Poppins Returns), and Viola Davis (Widows), while supporting actress Robbie will duke it out with the likes of Emma Stone (The Favourite), Rachel Weisz (The Favourite), Claire Foy (First Man), Regina King (If Beale Street Could Talk), Nicole Kidman (Boy Erased), and Amy Adams (Vice) in the season ahead.Mary Queen of Scots opens Dec. 7 in theaters. Read on for more reviews from the film out of its world premiere screening at AFI Fest.Peter Debruge (Variety)\n                “Pushing back against her theatrical roots, Rourke — who, as artistic director of London’s Donmar Warehouse, has experimented with a handful of live cinema broadcasts of high-profile plays — reaches for all manner of creative cinematic solutions, some more successful than others. Rather than wasting time watching characters recite colorful dialogue on well-dressed stages, she pares back the chitchat and goes looking for opportunities to take her cameras outside. Just as regal in either context, Ronan comes across poised and assertive before her skeptical subjects — like a 21st-century CEO forced to prove herself to a chauvinist staff, or a woman director surrounded by a crew of macho guys.”Todd McCarthy (The Hollywood Reporter)\n                “Saoirse Ronan and Margot Robbie shine in this exceedingly of-the-political-moment telling of a compelling story, which will compete with the more outrageous and unruly The Favourite for the favors of year-end viewers hot for unbound ruling class yarns…. Ronan carries the film with fiercely individualistic spirit…. Robbie is tough and imperious as required but allows a human side into her performance that gives the limited role as much dimension as time allows. By design, none of the men can truly compete with the two boss women, except when they conspire against a woman who they finally decide stands in the way of their desired ends.”Benjamin Lee (The Guardian)\n                “The film’s most thrilling pleasure is a show-stopping lead performance from Ronan, who at 24 is quickly becoming one of the industry’s most consistently impressive young actors. After her sparky Oscar-nominated turn as a Greta Gerwig conduit in Lady Bird, she’s note-perfect as Mary: vulnerable, terrifying, strong, sexy and effortlessly dominant when taking charge of the men who are trying to outsmart her. It is an astonishingly confident and committed turn and, in a just year, she’d be showered with more awards attention. There is also a rare reminder of just how young Mary was, along with so many other monarchs of the past, and there’s a clandestine silliness to some of the scenes of her with her handmaidens, cannily conveying a side often underexplored.”David Ehrlich (IndieWire)\n                “As fun as it can be to watch her come of age in the Scottish court, Mary’s inner strength and progressive ideals offset by her teenage naiveté — this is basically the story of a girl who gives up her country to the first guy who goes down on her — there’s only so much she can do with a character who can’t enjoy the same freedoms she wants to bestow upon her people. To everyone’s credit, casting the Irish Ronan as the estranged Scottish queen actually strengthens that idea; her accent is strong, but still tinted with an appropriate sense of foreignness. Ronan also makes for a ferocious and believable leader, commanding the film’s two battle sequences with a uniquely adolescent fearlessness, but strength alone isn’t enough to save Mary, and it isn’t enough to sustain this movie about her.”Yolanda Machado (The Wrap)\n“Mary Queen of Scots acknowledges both the struggles of women and the fact that people of color have always been part of society, even during the Renaissance and Age of Discovery. The film also provides an intense, gorgeous and fully fleshed-out story of two queens, each born to rule yet still controlled and manipulated by the very men in whom they invest their trust and lives…. bow down to Ronan and Robbie for taking two legendarily complex characters, who have been reborn countless times in film and television, and completely owning both roles. Ronan’s fiery Mary and Robbie’s emotionally complex Elizabeth truly reign divine on screen. History has not been kind even to powerful women, and Mary Queen of Scots strikes a complicated balance of making sure both characters are seen not only as icons but also as imperfect, vulnerable and subjected to so much of what women in the workplace have had to endure ever since women were allowed in the workplace.”Kimber Myers (The Playlist)\n“Rourke refuses to stick to the boundaries of her background in theater. Instead, she never hesitates to show her actors and their performances in unsparing close-ups, and she has a particular flair for the scale of various settings, both inside and outside. There are some minor pacing and structural issues, particularly in penultimate scenes that skip ahead to the end like Harry Burns with a novel, but this biography builds to a finale that is entirely compelling, despite our knowledge of where it goes. Mary Queen of Scots couldn’t be more my jam if it were topping fresh-baked bread with cultured butter.”Robbie Collin (The Telegraph)\n                “The film is led by a performance of thrilling regality and nuance from Saoirse Ronan…. the notable [scene] is the two queens’ apocryphal meeting in a washhouse, which not only gives Ronan and Robbie a welcome chance to butt heads dramatically, but also shows off the sheer range of the frocks by Alexandra Byrne, who also costumed Shekhar Kapur’s pair of Elizabeth films with Cate Blanchett. Here she uses denim to give Mary and her handmaidens a pragmatic, no-nonsense air, while kitting out Elizabeth in some outfits of almost Tim Burton-like queasy excess.”Kevin Maher (The Times)\n                “A potentially glum historical narrative about the repeated betrayals of Mary Queen of Scots is brought thrillingly to life in this rousing political melodrama about the contrasting fates of two very different queens. Saoirse Ronan is on savagely strong form as Mary Stuart, the eponymous heroine who, as the film begins (in 1561) has returned from Europe with flawless French, some progressive ideas (she believes in freedom of religious expression and in fluid sexual identities) and a claim to the thrones of both Scotland and England. Ronan is an actress who is sometimes too precise, too machine-tooled (see On Chesil Beach), but here she dominates the screen from the start, eyes ablaze with fervour, face luminescent with self-belief.” Related content:"}