{"id": "New Aquaman photos get up close with armored sea beasts", "paragraph": "Meet the true stars of Aquaman, Willem Dafoe’s giant armored hammerhead shark and Patrick Wilson’s tylosaur.Jason Momoa may be making waves as Arthur Curry in the upcoming DC movie, but director James Wan revealed new hi-res images of Dafoe’s Vulko and Wilson’s King Orm riding their steeds through treacherous waters.DC Comics fans saw these mounts in EW’s exclusive concept art from the ancient meeting site called The Council of the Kings, just on the outskirts of Atlantis. These stills, however, are our best looks yet at both the sea beasts and Dafoe’s character.Vulko and King Orm on their steeds. #hammerhead #tylosaur #sealife #underwaterkingdom #Aquaman #highres pic.twitter.com/EjPvuM5gHX— James Wan (@creepypuppet) October 20, 2018Vulko is Arthur’s advisor, while Orm is our hero’s half-brother looking to unite the Seven Kingdoms and lead them in a war against the surface world for polluting the oceans.Based on an interaction between Wan and Wilson on Twitter, it would seem the actor had to ride a mechanical bull of sorts on the film’s set to shoot these scenes before the VFX department worked their magic. As we’ve seen in the trailers, their army of creatures can cause some major destruction.The blue, mechanical bull you sat on?? 😂 https://t.co/rCTwoeMfso— James Wan (@creepypuppet) October 20, 2018Of course I remember. But partly because someone just tweeted it. 😄 https://t.co/dD8VkE4X7v— James Wan (@creepypuppet) October 20, 2018Aquaman is both an origin story for the sea-dwelling member of the Justice League, as well as an opportunity to make the character more badass after years of jokes at his expense.Arthur, a half-human, half-Atlantian exile, is called back to Atlantis to prevent war. Aided by Mera (Amber Heard), a warrior princess with a telekinetic dominion over water, he travels the earth in search of the ultimate weapon, the Trident of Neptune. With it, Arthur will be able to rule the seven seas.The film doesn’t hit theaters until Dec. 14, but Momoa already has ideas for a sequel.“Even when we were shooting Aquaman, I have the opening of Aquaman 2 ready,” the actor told Syfy Wire. “I went in and pitched it to [producer Peter] Safran, and I pitched it to [Warner Bros. chairman] Toby Emmerich. They loved it. It’s awesome… But yeah, I have plans for Aquaman 2.”So far Wonder Woman has been the only one to get an officially green-lit sequel off the ground in the DC Extended Universe. We’ll have to see if Aquaman will be another win.Related content:"}