{"id": "Corey Stoll reflects on the beginning of House of Cards — and Peter Russo's 'beautiful' ending", "paragraph": "Over its deadly run, House of Cards has become synonymous with the abrupt killing off of major characters. But, like with everything, there has to be a first, and for Netflix’s original flagship series, it was Peter Russo, memorably played by Corey Stoll.From the beginning, Kevin Spacey and Robin Wright were the clear leads of creator Beau Willimon’s series, but Russo and Kate Mara’s Zoe Barnes quickly emerged as two of the most interesting House of Cards characters. But Stoll’s memorable run didn’t even last a full season, considering his character learned the hard way to never get involved with the Underwoods. In the midst of a drunken spiral, Russo decides he needed to come clean, which was bad news for Frank (Spacey), so after driving a passed out Russo home, the ruthless politician left the car running and closed the garage behind him, leaving Russo to die in what would be deemed a suicide.Now, with House of Cards set to return for one last season (without Spacey, who was fired due to multiple sexual misconduct accusations), EW talked with Stoll about why he initially was resistant to the Russo role, the character’s shocking death, and his skepticism about later returning for a cameo.ENTERTAINMENT WEEKLY: What appealed to you about Peter Russo and House of Cards when you were first introduced to the project?\nCOREY STOLL: It’s funny, I didn’t really get it at first. When I first auditioned for it, I thought it was sort of a fun, goofy guy, another stereotypical, arrogant grownup frat boy in a suit. But I auditioned and then didn’t hear anything about it for a few months and I just kept on going back to that role, I just kept on thinking about him. I couldn’t quite put my finger on it, but there was something about him that I really just felt like I had to play. And I almost never feel this, this sort of sense that I was the only person who could play this role, and I sort of hounded my agents to make sure I got back in the room with David Fincher. There was just something about the character’s combination of strength and weakness. It’s so rare to be able to play all of those colors, certainly in a supporting role.Why do you think that Peter has stuck with so many fans? He lasted just 11 episodes, which basically equates to only one-sixth of the entire series. Do you think it’s for a lot of the same reasons that he stuck with you?\n                He’s somebody who has a really compelling arc. He starts off as shallow and entitled as you can get and is almost instantly brought down, and then builds himself back up. And I think his is death really, truly surprising. It comes at a point in the storytelling where you feel like he’s just sort of coming into his own. I’m only guessing what an audience feels, but the audience first feels like they sold him too short, because I think as soon as you see him, you go, “Oh, this guy’s a liar and shallow,” and then you see the spark of someone with some real integrity and hope, and you go on that journey and it’s cut short.You lead me perfectly into the shocking end of Peter. How did you find out that his story was going to conclude like that? Having it take place in the first season, did you know going in that this would be one and done for you?\n                Yeah, I knew it was a one season deal. I can’t remember if I knew exactly how he died from the beginning, but I definitely knew that that was the plan.So what were your thoughts when you found out how it was going to be executed?\n                I thought it was beautiful. I was definitely attached to Peter by the time that we had to film those scenes. But I also knew how lucky I was to have this self-contained story. Whether it’s conscious or not, I think when you’re doing a TV show, there is something that you hold back because you feel like, “I’ve got to keep the story of this character going for maybe years and years.” Knowing that the end was coming and coming soon, I really felt released from any sort of restraint in every scene, I’d say all the way from the beginning.What was it like when it came to filming Peter’s death? Pretty emotional?\n                It was. I put a lot into the character and the episode or two that leads up to his death, where he really falls off the wagon and is suicidal, were very intense things to shoot. The actual shooting of the death was very technical, a lot of it was just figuring out how to work the electronics on the Chrysler 300 that I was sitting in and questioning if I’m found in the passenger seat won’t that make it obvious that it wasn’t suicide, and then someone did some quick Googling and we found out that it actually does happen. So it was technical, and also Peter was just so drunk and high at that point that the pain had gone and he was sort of in a haze. Definitely the most painful scene to shoot was when he calls his children.Peter became the first big casualty on a show that would become synonymous with killing off characters. Do you take a little pride in being the one who started it all?\n                Sure [laughs]. I don’t know; I mean, it’s always good to be the first. And I do think the impact of mine and Kate Mara’s character’s deaths were so strong because we were set up as the two other lead protagonists. We were set up to be long-term characters… and not so much.Speaking of Kate, you came back and did a cameo from beyond the grave in season 4, so what was it like to pick Peter back up after having felt like you put him to bed so beautifully?\n                I was very skeptical about it, because I had felt that the story was so well-told and completely told, and, exactly, I had put him to bed. I’ll be honest, I did it because [creator] Beau Willimon asked me to and I felt that I owed it to him because he had written such a beautiful role for me that had frankly done so much for my career. I felt if this is how he wants the character to come back then I’m willing to oblige. But I was definitely nervous about doing anything to lessen the impact of what was already filmed. And I’m happy with the way it went because it’s so abstractive and so unexpected that I felt like it succeeded in continuing the spirit in which we had filmed the first season.Any final thoughts on Peter and the series as a whole?\n                Peter was an unique experience for me on film. I had been able to find characters onstage that served as sort of vessels for my psyche in the way that Peter was, but never on film and television. There’s something unique about him where I felt I was able to share my weakness and my strength. There was a completeness about that character that was very satisfying and cathartic to play. I think every actor is searching for roles that allow them to show a secret side of themselves — not that I share those particular addictions that Peter had, I don’t. He was a vessel that fit perfectly for me and so the fact that other people could react to that and react positively to that means a lot to me.The final season of House of Cards begins streaming on Friday.Related content:"}