{"id": "Ariana Grande thanks her exes — by name — in new single: Listen here", "paragraph": "Ariana Grande has known heartbreak, but she must have at least a few more tears left to cry, because she’s ready for the next chapter.Hot on the heels of August’s Sweetener, Grande dropped a new single, “thank u, next,” which thanks her various former loves — including Mac Miller, who died tragically in September, and Pete Davidson, whose engagement to Grande was called off last month — and welcomes the next. The “God Is a Woman” singer released the track Saturday night, right before Saturday Night Live aired.During Saturday Night Live — as the song shot up the iTunes charts and effectively blew up Twitter — Davidson addressed the breakup in an appearance on the Weekend Update. “The truth is, it’s nobody’s business, and sometimes things just don’t work out and that’s okay,” the comedian said. “She’s a wonderful, strong person and I genuinely wish her all the happiness in the world.”Grande had teased the new song in the days leading up to its release, first tweeting “thank u, next” on Thursday after her ex-fiancé Pete Davidson alluded to their breakup in a promo for this week’s SNL. “For somebody who claims to hate relevancy u sure love clinging to it huh,” she said in a (since-deleted) tweet, then tweeted the phrase that would become the song’s title.Over the course of Thursday and Friday she continued to tweet “thank u, next,” as well as rhymes which appeared to be (and in fact are) lyrics. She also shared images of the words and a screenshot of a song with that title playing on her phone. In responses to her fans on Twitter, Grande revealed that “thank u, next” would be both the title of a song and the album it would appear on, and the song would come first. She also confirmed that the new song will be the last on the album.“no drags…. no shade….. jus love, gratitude, acceptance, honesty, forgiveness … and growth,” Grande shared in her frenzy of Twitter teases, and she wasn’t kidding. Rather than being the sassy high-ponytailed kiss-off the title might suggest, “thank u, next” has a sincere message of gratitude. The song opens with the shoutouts: “Thought I’d end up with Sean / But he wasn’t a match / Wrote some songs about Ricky / Now I listen and laugh / Even almost got married / And for Pete,  I’m so thankful / Wish I could say ‘thank you’ to Malcolm / ‘Cause he was an angel” — referring to her ex-boyfriends Big Sean, Ricky Alvarez, Davidson, and Miller, respectively.“One taught me love / One taught me patience / And one taught me pain / Now I’m so amazing / I’ve loved and I’ve lost / But that’s not what I see / So look what I got / Look what you taught me,” she croons on the track. “Thank you, next / Thank you, next / Thank you, next / I’m so f—in’ grateful for my ex.”This isn’t the first time Grande’s love life has explicitly inspired her music — Sweetener includes an interlude entitled “pete davidson.”  Listen to “thank u, next” above, and check out some of the reactions from Twitter below.Don’t talk to me about anything but Ariana for the next 72 hours pls.— h (@halsey) November 4, 2018what a gorgeous, strong, beautiful song about growing from love lost… thank you @ArianaGrande for this INCREDIBLE anthem!! I am SO PROUD!!!! #thankunext https://t.co/3iRHr7oiC8— Frankie James Grande (@FrankieJGrande) November 4, 2018Ariana – “I’m so fucken grateful for my ex”Me *never been in a long term relationship* OMG SAME!!!— Manny MUA (@MannyMua733) November 4, 2018the SNL crew trying to write a whole new episode rn #ThankUNext pic.twitter.com/bxAIsf6MEY— denise (@deniseingui) November 4, 2018I think it's time we promote her to ariana venti— Dana Schwartz (@DanaSchwartzzz) November 4, 2018Ariana Grande: “Wish i could say thank you to Malcolm   ‘Cause he was an angel”me: pic.twitter.com/AsFuO9djBT— nicole🌻 (@cityofnicole) November 4, 2018So happy @ArianaGrande is strong and not internalizing all she’s dealt with. Her transparency and ability to own her shit is where all the power lies! Go head on girl! #ThankUNext— Kaylen Zahara (@amazedbykay) November 4, 2018me singing ariana’s #thankunext even though i’ve never had and never will have a boyfriend or an ex pic.twitter.com/uCjzMaVb9Q— Kiaree (@kixree) November 4, 2018Related content: "}