{"id": "Incredibles 2, Spider-Man: Into the Spider-Verse among 25 films vying for animated feature Oscar", "paragraph": "Jack-Jack, talking dogs, yetis, and Spider-Man will square off in this year’s animated film Oscar race.The Academy announced Wednesday a list of 25 films submitted for Oscar consideration in the animated feature category, including prominent Disney titles, blockbuster sequels, and alternative gems spanning creative styles from Japanese animation to stop-motion.Among the top contenders are Disney-Pixar’s Incredibles 2, which currently sits atop the list of highest-grossing animated films of all time with a colossal $607 million box-office haul, as well as the studio’s forthcoming sequel Ralph Breaks the Internet. Joining them are the Japan-produced features Mirai and Fireworks, while Wes Anderson’s dystopian canine dramedy Isle of Dogs will also vie for voter attention next to a pair of superhero titles — Spider-Man: Into the Spider-Verse and Teen Titans Go! To the Movies — in the weeks ahead.Each of the submitted features must fulfill the Academy’s theatrical release requirements before advancing to the next stage, which includes completing a qualifying run in the Los Angeles area. A maximum of five films can be nominated in this category, with the final list of nominees scheduled to be announced on Jan. 22.ABC will broadcast the 91st Oscars ceremony live on Feb. 24 from the Dolby Theatre in Hollywood. Check out the full list of animated features submitted for Oscar consideration below.Ana y Bruno\nDr. Seuss’ The Grinch\nEarly Man\nFireworks\nHave a Nice Day\nHotel Transylvania 3: Summer Vacation\nIncredibles 2\nIsle of Dogs\nThe Laws of the Universe – Part I\nLiz and the Blue Bird\nLu over the Wall\nMFKZ\nMaquia: When the Promised Flower Blooms\nMirai\nThe Night Is Short, Walk on Girl\nOn Happiness Road\nRalph Breaks the Internet\nRuben Brandt, Collector\nSgt. Stubby: An American Hero\nSherlock Gnomes\nSmallfoot\nSpider-Man: Into the Spider-Verse\nTall Tales\nTeen Titans Go! To the Movies\nTito and the BirdsRelated content:"}