{"id": "Arrowverse stars reveal details about the Trinity-centric 'Elseworlds' crossover", "paragraph": "Yes, this year’s Arrowverse crossover, “Elseworlds,” will introduce Batwoman (played by Ruby Rose). Yes, it will also include other iconic DC Comics characters like Superman (Tyler Hoechlin) and Lois Lane (Elizabeth Tulloch), and John Wesley Shipp in a Flash costume. But at the end of the day, the crossover is primarily a topsy-turvy ode to the universe’s main trio: Supergirl (Melissa Benoist), the Flash (Grant Gustin), and Green Arrow (Stephen Amell).And now we can finally reveal what the hell brings the Trinity together!The three-night event begins with Arkham Asylum doc John Deegan (Lost’s Jeremy Davies) rewriting reality, which results in Oliver (Amell) and Barry (Gustin) swapping lives. In this new reality, Oliver Queen looks like Gustin and Barry Allen looks like Amell, and the two heroes are the only ones who know they’re in the wrong lives and have each other’s powers. This not only explains what’s going on in the recent promos, but also why the actors have swapped costumes.“You’re not going to see me playing Oliver Queen’s mannerisms, or Stephen playing Barry’s mannerisms. It’s more being aware that for some reason we’ve switched lives and destinies. It’s more the fun of the situational comedy that we keep finding ourselves in, and less us having a complete role reversal,” Gustin tells EW. “We get to see Stephen do some of the more goofy speed stuff I have to do on a regular basis, and I get some actual combat as Green Arrow. So, we just see different colors for each of us.”“Having superpowers is crazy! Wearing the Flash suit is crazy!” says Amell, who, like everyone else involved, sounds genuinely thrilled about the crossover’s story. “The idea is that in order to be the best version of Barry Allen, which I have to be because we face a threat, there are elements of his personality I have to embrace, and there are elements of my personality that he has to embrace.”The swap is also one of the reasons reason “Elseworlds” is funnier than previous crossovers.“My initial reaction in reading the scripts this year was that it would be a hoot to film. The comedy just lives in this. Even just seeing them in each other’s suits is funny; they’re literally putting themselves in each other’s shoes!” says Benoist, whose character, Kara/ Supergirl, gets pulled in because she’s the only one who can see Barry and Oliver for who they really are (the perks of being from another Earth?). “She inevitably becomes kind of a middleman because ultimately there’s conflict between the two and they start butting heads.”Adds Supergirl co-showrunner Robert Rovner, “She’s trying to help them navigate what they’re going through and support them and kind of battle their way back to being who they’re supposed to be.” That dynamic is on full display in a banter-filled scene EW observed in October, in which the three heroes find themselves locked up in Gotham City (as superheroes are wont to do), and it falls on Kara to referee an argument between the two men. Watching the three leads bounce of each other is a thrill, mostly because we rarely get low-stakes scenes like this that are just about Kara, Oliver, and Barry’s dynamic. (We’ve definitely gotten some Oliver-Barry moments like this.)“The most fun aspect about really focusing on the leads is we really had a chance to tell a story about the troika that we’ve never really been able to do before,” says Arrow consulting producer Marc Guggenheim, who oversaw the crossover. “When you have Legends of Tomorrow part of it, and all of the other secondary and supporting characters, the amount of time we had Grant and Stephen and Melissa on screen together was actually pretty minimal in other crossovers compared to this year.”The Arrowverse bosses decided not to include Legends of Tomorrow in “Elseworlds” because last year’s Nazi-filled four-part extravaganza, “Crisis on Earth-X,” was ambitious but also extremely difficult, as they had to juggle, well, everyone. “It’s very hard on the crew, it’s very hard on the cast, and we wanted this year to just be a little easier. That’s why we focused on crossing over mainly the leads of the shows and not including a fourth hour,” says Guggenheim. “The hard thing about crossing over with Legends is, because that’s an ensemble show, you’re crossing over with the entire cast. That said, there is a Legends cameo in hour 3.”Furthermore, whereas “Crisis” felt like a four-hour movie, “Elseworlds” returns to the episodic format of the earlier crossovers. “I think this year, it feels a lot more like individual [episodes],” says The Flash showrunner Todd Helbing. “Flash kind of feels like a Flash episode, Arrow feels like an Arrow episode, Supergirl feels like a Supergirl episode.”Adds Rovner, “It’s like a three chapters of one story, but they’re all kind of unique to their own show.”Even though it’s relatively smaller, the writers and cast promise it’ll be just as satisfying. Says Gustin, “It feels like it’s going to be our strongest crossover, our funniest crossover. I don’t know what fans are excited for, but I’m excited just to see Superman, Flash, Supergirl, Green Arrow, and Batwoman all on screen togehter. It’s pretty amazing.”“Elseworlds” begins Sunday, Dec. 9, with The Flash at 8 p.m. ET; continues Monday, Dec. 10, at 8 p.m. ET with Arrow; and concludes the following night at 8 p.m. ET with Supergirl.Related content: "}