{"id": "How to Get Away With Murder finale recap: Why do you look like someone died?", "paragraph": "Here we go, it’s time for the winter finale of How to Get Away with Murder in an episode that will see both the long-awaited Coliver wedding and a bloody, bruising conclusion. Season 5 has been the show’s strongest season since its very first — a speeding train of revelations and an examination of the corrupt prison system all chugging towards tonight’s explosive finale.We open back where we began with a figure bleeding in the snow. The dripping blood quickly shifts to Gabriel cutting himself while shaving — Laurel, Bonnie, and Frank look on from their surveillance camera. Laurel wants to tell Michaela the truth about him, but Bonnie says that could put everyone in danger. Frank needs to find out what Gabriel wants and everyone else needs to stay in the dark to keep them safe. Including the audience, apparently.Oliver and Connor are feeling the love the night before their wedding. Oliver’s mom gives a heartfelt speech about how Oliver gives his whole heart to those he loves and how Connor does that in return. Connor’s dad, who came through and paid for the wedding, is there too – but he can’t make a speech without taking a dig at Connor’s bruised face. A moment only made worse when Connor’s mom pointedly pushes her ex-husband aside to say, “Here’s hoping you have a much happier marriage than we did.” See what you have to look forward to still single children of divorced parents?Laurel returns late and gives Michaela crap for taking Gabriel as her plus-one. Meanwhile, we see the seeds of Asher’s parking lot rendezvous with Connor’s mom planted as he brings her champagne, and she bemoans the end of her hopes that Connor would retire with her to Boca. Oliver continues to avoid Connor’s dad, and Jefferson wants them all to talk it out — but Connor insists his dad not make Oliver’s special day all about him.Back at Annalise’s new digs, she and Nate are digging through paperwork to take down the governor for Nate Senior’s murder. Nate wants Bonnie to get the name of Miller’s contact who ordered his dad’s transfer. She wants him to ask himself, but he resigned from his job at the DA’s office. Annalise wants them to keep fighting, but not before Bonnie lets it drop that the case and his father’s death has driven Annalise to drink again.Michaela also won’t let this case rest, interrupting Oliver and Connor’s pre-wedding day bliss to make Oliver hack the warden’s phone records. He obliges and she goes to Nate with them. The warden got a call from an unlisted number and then called his chief correctional officer. Nate is infuriated by her interference, but he takes the phone records to a private investigator in a parking garage and asks her to look into them.Annalise is refusing to come to the wedding, so Connor shows up on her doorstep to insist she attend. She complains she’s no good at weddings, even her wedding to Sam was a rush job at the courthouse. She was the other woman and Sam had already had his white wedding. But Connor won’t take no for an answer because if it weren’t for Annalise insisting Connor seduce Oliver and get him to hack records for her, they never would’ve met and fallen in love.Bonnie is getting dressed for the wedding and Frank is going to use the time to search Gabriel’s apartment again. Miller arrives to leave with Bonnie, and she’s surprised he didn’t tell her Nate quit. The two get into an argument and Miller says he feels like he’s in a love triangle with Annalise — nailed it, bro. He wants to marry Bonnie, but not if she always puts Annalise ahead of him. He insists Annalise takes advantage of her and her “issues.” Which was not, in any way, the right thing to say.Back at the church, Connor and Oliver are getting ready to walk down the aisle. Connor is sweating and freaking out but Michaela reassures him, telling him this marriage will make him a better person. Michaela and Asher share a moment when he fixes her zipper and calls her out on kissing Gabriel, saying he feels like he’s never good enough.But there’s no time to dig into that statement because the music is playing and everyone is walking down the aisle. We see the walk from Connor’s point-of-view as ominous music plays. He is struggling as he takes in all the happy faces greeting him, including Annalise! He makes it to the altar and tells Oliver it’s going to be fun. Bonnie runs in late without Miller and tells Annalise he got called into work.Connor and Oliver exchange vows. And they are perhaps the purest, most good-hearted, beautiful thing this show has ever done. Oliver waxes about his life-long dreams of a white wedding. “My dream wasn’t the wedding or the tux or Brian Adams, my dream was you,” he tells Connor. And in turn, Connor replies with a speech about Oliver making him want normalcy. “I want to love you until the day I die,” he pledges. Which, on this show, might not actually be all that long. Annalise can’t take all the happiness and love and escapes to the bathroom to drink from a flask, while Connor and Oliver exchange rings.At the reception, Annalise is visibly drunk in her responses to Connor’s parents (though Mr. Walsh totally deserves her attitude). Laurel wants Frank to take out Gabriel tonight so they can use the wedding as an alibi, which sends Bonnie spiraling. Annalise isn’t doing so hot either, sitting alone in the church drinking. Gabriel walks in on her and won’t let her pass. He calls her out on her drinking and makes her drop her purse, revealing her flask. He seems sincere when he tells her his mom waited too long to get help and he doesn’t want Annalise to end up like her. But he’s not being honest, right? At least not based on what Frank finds in his apartment — a wad of cash, a hidden key, and a case that the key belongs to which contains Gabriel’s birth certificate.Annalise and Nate dance, which tips him off to her drinking. Can’t a lady just have a good time at a wedding?! Michaela wants to know if he found out who called the warden, which comes as news to Bonnie. Nate tells them to keep their mouths shut while he takes a call from his PI who has tracked the unlisted call to the warden to a payphone. She’s sent him an email with more information.Mr. Walsh interrupts Oliver’s lovely dance with his mom to half-apologize, while also insisting he now has to protect Connor from his own worst instincts. And the prize for worst dad of the year goes to….Oliver ends up stepping out because his dad is video calling him. Meanwhile, Laurel leaves Christopher with Oliver’s mom, and Bonnie continues to freak out.Finally, we have caught up to the real time of the flash-forwards we’ve witnessed all season. Frank is there, showing Annalise the birth certificate and getting slapped. She storms out into the snow. We’re back outside where Christopher is crying and Bonnie is suffocating the unknown victim — who turns out to be DA Miller, a.k.a. the love of Bonnie’s life. OH. MY. GOD.We flashback to the rest of their conversation in her apartment. Miller continued to rail on Annalise, insisting she is not a good person. Bonnie can’t help but replay conversations with Annalise where her mentor insisted Miller was playing Bonnie. He wants to protect her from Annalise, but Bonnie is putting pieces together remembering he had a friend at the governor’s office. She says he attacked the one person who matters most to her (sigh, Bonnie, you maybe have to let Annalise go at some point) and she doesn’t want him to go to the wedding with her.Back to the wedding, Miller disobeyed Bonnie’s wishes and after looking longingly at an engagement ring in his car, he gets out to confront her. He pledges his love, but she turns on him, insisting he had Nate’s dad killed — that’s what all the pieces point to. He denies it, but she tells him to never touch her again. He returns to his car but decides to go after Bonnie again and that’s his fatal error — because there in the parking lot is Nate with the evidence from the PI, a photograph showing that Miller is the one who made the payphone call to the warden that day.Nate and Miller argue, with Nate insisting the inquest was just to cover his tracks and Miller denying all of it. Incensed by his father’s death, Nate flies off the handles and punches Miller in the face, going into an uncontrollable rage and a desire to make Miller feel the pain his father felt. It’s a heart-rending moment, watching Nate unleash on Miller in the exact same fashion that earned his father the prison sentence at the heart of all of this. He beats Miller until he’s a bloody, barely-conscious pulp, and Nate sobs as he realizes what he’s done.Bonnie sees a trail of blood in the snow and just keeps whispering “Oh God, no” over and over. She finds Miller’s body and Nate calls out to her from the trees. He tells her Miller called the warden and shows her the photo. Nate is still hysterical, rambling about Miller murdering his dad. It’s too much for Bonnie to bear, but she does what she feels she has to and smothers Miller to death.Everything else is a red herring. Christopher was in the snow because Bonnie got saddled with him when they played Mrs. Hampton’s song; Oliver was missing because he was on the phone with his dad — though the search for him did lead to Connor discovering his mother in flagrante delicto with Asher. Oliver has been found, and Connor goes in to discover Oliver preparing to make a grand gesture, singing John Legend’s “All of Me” to Connor in place of a first dance.Conrad Ricamora is an exceedingly talented Broadway performer, and it’s so fantastic to see the show give him this stand-out moment to sing. He has a stellar voice and lends the song a vulnerability and depth that makes the last moments of the finale utterly heartbreaking. Connor looks on, his eyes full of love for his husband, the wedding guests all oblivious to the horrors happening around them.The song and its message of undying love hauntingly plays over Bonnie sobbing through delivering her death blow to Miller. Nate then tries to cover the blood in the snow and stashes Miller’s body in the trunk of his car — and discovers the engagement ring that was in Miller’s pocket. Bonnie returns inside to find Asher starring wistfully at Michaela during the love song. Bonnie insists nothing is wrong. Laurel is concerned about Gabriel’s whereabouts.Annalise has left the wedding early, having to use a hide-a-key to get into her apartment because she can’t find her own. She’s on the floor of her apartment, crying and drunk, when she hears the floor creak. She couldn’t find her key because Gabriel took it when she dropped her purse. He stands menacingly in her hallway, trying to play it off, but she tells him the jig is up — she knows who he is. And finally, his identity is revealed. Flashing back to the wedding, Frank tells her Gabriel is Sam’s son. We see the birth certificate and Sam Keating is listed as the father, while Vivian Maddox, Sam’s first wife as it turns out, is the mother. She stares at Gabriel and his enigmatic face shifts to an unsettling close-up on a smiling Sam.And there we have it, Miller is dead and Gabriel is Sam’s child possibly out for revenge against the “other woman” who broke up his family. What do you think? Is Miller truly a bad guy? Or did Nate and Bonnie take down the wrong person? Will Nate tell Bonnie about the engagement ring? What does Gabriel actually want? And is he at all tied to the mysterious adoption that is the governor’s leverage against Annalise? Sound off in the comments or hit me up @themaureenlee.Related content:"}