{"id": "Supergirl: J'onn meets the ruthless Manchester Black in exclusive clip", "paragraph": "Meet Manchester Black, the ruthless DC Comics anti-hero coming to Supergirl this Sunday.David Ajala (Nightflyers)makes his debut as the cheeky vigilante from across the pond in this exclusive clip from this week’s episode, which shows his first tense encounter with J’onn J’onzz (David Harewood) and establishes the story they’ll share together this season.“[Manchester Black] comes to this country to kind of avenge a wrong done to somebody he loved, and as he’s struggling with that, J’onn is trying to help him,” co-showrunner/executive producer Robert Rovner tells EW.As we learn in the sneak peek above, that somebody is Fiona (Tiya Sircar), J’onn’s alien friend who was murdered by Agent Liberty (Sam Witwer) in the season 4 premiere. J’onn has been searching for her since she disappeared, and now her fiancé has arrived to do the same. Our favorite Martian gives Black a lead on a cop that Fiona was investigating and cautions him to be careful because the officer has some tricks, but Black confidently replies that he’s got tricks, too. However, those tricks may be what differentiates him from J’onn and Supergirl (Melissa Benoist).“It seems for a while that he is on the same side as Supergirl,” says co-showrunner/EP Jessica Queller. “They have some things in common, but their methods are very different.”Honestly, that sounds very much in line with Manchester’s comic book origins. In the comics, Black is an antihero who takes a hard line on criminals and believes the best course of action is to just kill them, which is what puts him at odds with Superman, who refuses to take lethal action. This has been a major point of disagreement between the Black and Superman since the former debuted in 2001, and was recently revived in Patrick Gleason and Peter J. Tomasi’s Superman: Black Dawn. If the show keeps Black’s willingness to kill in its interpretation of the character, then we can expect something similar between him and Team Supergirl.Watch the clip above.Supergirl airs Sundays at 8 p.m. on The CW.Related content: "}