{"id": "The Walking Dead showrunner on that huge Rick and Michonne child reveal", "paragraph": "SPOILER ALERT: Read on only if you have already watched Sunday’s episode of The Walking Dead, “Who Are You Now.”We said goodbye to Rick last week on The Walking Dead, as the character is moving off the program and over for a series of TWD movies. But with every goodbye on this show, there is a hello, and this week we were introduced to the next best thing: Rick Jr.Yes, it appears Rick and Michonne’s talk about planning for the future was not just talk, and the end result was a baby boy named after his father who goes by R.J. That wasn’t the only shocker: Take what long-haired Carol did in burning some Saviors alive. Or the X scar on Michonne’s back. Or, I don’t know, TALKING ZOMBIES!!!We spoke to showrunner Angela Kang about all that and more, and she dropped some juicy behind-the-scenes tidbits along the way. Read through both pages of the interview for all the scoop, and also make sure to check out our episode Q&A with Josh McDermitt about facing the Whisperers.ENTERTAINMENT WEEKLY: This episode marks the show’s most abrupt change yet in a lot of respects. What was it like embarking on this new chapter with new stories, new characters, and new looks?\nANGELA KANG: It was a lot of fun, but also it’s just very daunting. Rick’s departure was so huge. Then episode 6 was almost like piloting a whole new show while still trying to keep the DNA of the show that we’ve been watching for so many years. I know all the actors had such a great time just collaborating on the looks, and the hair. We had a conversations about like, “Well, let’s talk about what this character looks like six years in the future?”Danai [Gurira] and Melissa [McBride] had these great ideas on what to do with their hair that we were able to design. We worked on costumes, using the comic book as references for stuff like Jesus’ look, which we’ll see in these episodes going forward, then also just stuff like was just fresh for the show. That part of the process was definitely a lot of fun. The production design team did such an amazing job bringing to life some of the looks from the comic, while still using some of the stuff that’s specific to the show. We’ve got this windmill that’s a big deal from the comic book that our production designer had the great idea to build it on top of one of the bombed-out houses. That was kind of specific to the show’s mythology.Angela, did you just tease the Jesus man bun? Is that what I heard out of you?\nThere may be some man bun action coming.I was wondering how you decided which characters had drastic new looks and which were pretty similar, and it’s also interesting to hear you say that Danai and Melissa helped with the ideas for their hair.\nIt’s funny. With deciding who was going to have really dramatic new looks versus stay the same, it really depended a lot on the character, because there are some characters that are just people who stay stable and steady. For example, Daryl — there’s definitely things that have happened with his look because things have happened to him, but Daryl’s not a guy who goes and gets crazy hairstyles, or whatever. Whereas, Michonne, she’s someone who always has had an edge. I think that was one of things we were like, “Well, you know, maybe after everything that happened with Rick, maybe her hair, she gets a gray streak or something.”Dania was like, “Well, you know, we don’t want the character to look like she’s just old and uninteresting. She’s gotta have her edge. Michonne has an edge.” We were like, “That’s true.” I think she found some different pictures of things. We were like, “Wow, that would be so cool to have that shaved head on the side.” We had to test that to make sure the wig was going to work where she could still do her swordplay and stuff because it’s kind of a challenging thing to have it so short on one side. Fortunately, the hair department and the wig maker were able to fashion something that worked really well.And what about with Melissa, and Carol’s new hair?\nMelissa, at first we were going to keep her hair short, but she was like, “You know, it’d be really interesting to have her grow her hair long.” There’s a whole story behind why Carol has short hair, and we actually have a scene that speaks to that at some point in the season. It’s part of the backstory of Carol and why she has short hair, why she had short hair in her marriage and everything. It really shows where that character is at with her state of happiness. She’s at a place where she feels safe and at peace, and that’s reflected in the hair. That really was very driven by Melissa’s feelings about where the character was at. That was the process. It came out of these conversations about these characters, and where they felt they were at, and what is important to maintain about that character’s personality, et cetera.Speaking of new characters, we’ve talked a few times about Magna’s group. Now that we’ve gotten a pretty good introduction to them, how are they different as a group from the characters we already know?\nThey’re very similar to our characters in that they were able to survive a long time on the road. They’re very tight-knit. They are a group that considers themselves a family. In that way, there’s more a parallel to our characters than totally different. But at the same time, because they are their own unique individuals, and they’ve done things their own, and they’ve been out there a lot longer, there are some differences. They’re incredibly capable, like our people are, but there’s a scrappiness to them that they’ve maintained over years because they haven’t found that kind of place to call home for a long time.Plus, Connie is deaf. We’ve made part of the mythology of this group that they’ve been together and they’ve all learned sign language in order to communicate better with her, but it’s something that is a survival skill for them as well. We’ll seen in an episode that they can use that to be silent, basically, when they’re in the presence of zombies. It gives them a special shorthand and special kind of skill of communication that other groups we haven’t seen have that.And with Dan Fogler, who plays Luke, he’s just hysterical and really charming. A lot of times, this show can be very serious, but this year we wanted to play a little bit more with people who are using humor as a survival tactic or to deal with serious situations. It’s something that he uses to disarm people, and to make friends quickly, and to make allies, because that’s one of the things we’re dealing with. When a group comes in from the outside, how do they become trusted? How do they become a friend? We’re just openly using humor as a tactic with that character, which has been a lot of fun.Let’s talk about Carl’s story from the comics because I see other characters here assuming parts of that. We have Henry going to apprentice for Earl the blacksmith at the Hilltop, and we have Judith talking through the bars of the cell to Negan. What was the process like of deciding where to put those aspects of Carl’s story?\nThe show has often diverged from storylines in the comic. It’s always a process remixing things for us. There’s nobody that’s going to exactly replace Carl. Carl is his own character, but there are definitely plotlines from the comic that we didn’t want to completely lose. Henry just organically would be with this time jump about the age of Carl in the comics. There were certain aspects that we felt play well with Henry, especially because Carol is now that parent.Obviously, all of that plays differently because Henry is a different kind of kid in the show than Carl was in the comic at this point. He’s had a different upbringing. He’s had a bit of a sheltered life. He’s also faced different kinds of things. We just wanted to make sure that anything that we take from the comic that maybe once was part of Carl’s storyline, it’s a little different when you have Henry playing it. We don’t intend for it to be exactly the same.And Matt Lintz, who plays Henry, is the third Lintz child to come on our show. Sophia was played by Madison. His younger brother Macsen played the young Henry. That’s been really fun to have that family with us for another chapter of the show.What about with Judith?\nWith Judith, she bears certain similarities to Carl. She’s also very much her own character as well. She’s really spunky. She’s funny. She is an apocalypse native. That makes things a little different than a kid who remembers life before the apocalypse. What’s exciting about it is we get to have that feel of the Grimes kid who’s 10 years old, like we have in the comics, but we’ve really been enjoying finding Judith’s unique version of what that story is because she, again, has a very different background than Carl.For us on the creative side, we really enjoyed getting to look back at some of those plotlines that we loved so much from the comics, while also creating something that is unique to the show, because it’s our characters and their experiences are different. We’re just really thrilled to have Cailey Fleming playing Judith because she’s such a ray of sunshine for the cast and the crew. They just absolutely love her. People teared up when they saw her step on the set. She looked so much like Sarah Wayne Callies. There’s a resemblance to Chandler, who played Carl. That’s really been a bright spot for us in making this season.\n                  \n                    "}