{"id": "Chloë Grace Moretz shares how Trump's election galvanized the making of The Miseducation of Cameron Post", "paragraph": "At SCAD Savannah Film Festival, star of The Miseducation of Cameron Post, Chloë Grace Moretz shared why the project was so close to her heart.After a screening of her new movie, Moretz sat down with EW’s Devan Coggan to explain why this role in particular meant so much to her. After 15 years of working in the industry, the actress shared that she had begun to feel disconnected to what she was doing and what was important. “I took a year and a half off and through that year and a half I read a lot and really leaned in to my activism,” said the actress, adding that she realized that she needed to pursue art mixed with activism.In order to prep for the role (Moretz plays Cameron, a lesbian teenager who is sent away to a treatment center in a remote area called God’s Promise for conversion therapy), the actress spent time talking to young survivors in New York City who had actually undergone treatment like her character does, including some 24 and 25 years olds who had only recently returned from these centers, having been there since they were 15 years old. “I wasn’t aware it was that currently prevalent in America,” said Moretz. “It lit a new fire under me to dive into it.”Despite being set in 1993, Moretz felt the story was just as relevant and important today. “You look at our administration…” she began. “When we started making this movie, we were still in Obama era…half way through filming this movie Donald Turmp was elected president. Specifically, with conversion therapy, [vice president] Mike Pence has been an avid, outspoken believer in it and has helped funnel money into it, so there’s a massive shift halfway through production and this became, for us, one of the most important things we could be doing.”Moretz went on to share how special her experience was working with a female director and all-female crew on this project. “All of our heads of departments were all women,” she said. “Everyone was female. It was really cool. The easiest way to boil it down to a very simple way of describing this is to talk about the sex scenes…For the first time in my career — I’ve been doing sex scenes since I was about 16 — we didn’t sit down at a table with all the heads and everyone and all the people who make decisions and deliberate over what faces, sounds, shots, what moments we had to get. [Director Desiree Akhavan] looked at me, looked at the other actress and looked at the D.P. and said, ‘I’m pretty sure you know what you’re doing,’ and other than that she made everyone disappear.” The actress went on to describe how Akhavan made everyone else on set disappear apart from the D.P. and the two actresses to make it a safe space. ” And that goes for how she conducted herself on the entire set,” added Moretz. “It was this really special experience of trust and respect…and I have to say it’s because of the all-female crew because I’ve never had that before.”The Miseducation of Cameron Post is out now.Related content:"}