{"id": "Halloween star Jamie Lee Curtis reveals her biggest regret about the horror franchise", "paragraph": "Filmmaker David Gordon Green’s just-released horror sequel Halloween is not the first time Jamie Lee Curtis has returned to the franchise to reprise her iconic role as the Michael Myers-battling Laurie Strode after a long time away. In 1998, Curtis played the part in Halloween H20: 20 Years Later, having previously not portrayed Strode since 1981’s Halloween II. Directed by Steve Miner, and co-starring Adam Arkin, Michelle Williams, and Josh Hartnett, H20 was a box office hit and is remembered fondly by many fans of the slasher series. But Curtis still regrets that the two other creative principals responsible for the original 1978 film, director John Carpenter and the late producer Debra Hill, did not oversee the project, as she had originally hoped.“When Halloween was, like, 19 years old, I remember calling John and Debra and we had lunch,” says Curtis. “I said to them, ‘Guys, the movie’s going to be 20 years old next year, and we’re all still doing the job 20 years later.’ I said to them, ‘Why don’t we revisit it?’ And there was a conversation, but then everybody was busy, and it turned out not to be what I wanted it to be. Initially, I wanted it to be with John directing, Debra producing. And that didn’t happen, for myriad reasons. And John didn’t write it, so then we had to hire a writer, and then Debra had something else. By the end of it, I was the only one involved with it.“Now, to this day, I regret that I didn’t say to everyone, If Debra Hill’s not the one producing this movie, I’m not doing it. But what ended up happening was, she wasn’t part of it, John wasn’t part of it, and I was still part of it, and it was a machine going down the road. I was excited about it, and, honestly, I was going to be paid well. I hadn’t made any money on the Halloween franchise at all. I mean, really, in all of those years I hadn’t really made any money. It just gave me a lot of fame. And now I was going to get a paycheck.“And I was excited about it, because I liked where we were going with [the film]. It was, in a weird way, a movie about post-traumatic stress then. The difference [from the new Halloween] was, it was someone who had run. So, she had fled from Haddonfield, she had changed her name, she had run as fast as she could in the other direction, and Michael Myers caught up with her. But, you see, she told no one, no one knew who she was, she was a new person in a new town. She had a child and her life was proceeding. And I liked that. By the way, I insisted she be an alcoholic, I insisted that she not be traumatized. And then, of course, there’s a moment when she turns back. Because really the intent of that movie was to say, You really aren’t alive if you’re running for your life all the time. If you’re running for your life your whole life, you’re not alive. So, you’re really dead. So, if you’re dead, why not try to face the fear, and in the facing of the fear maybe you’ll die, but if you don’t die, maybe you’ll finally live. And that was really the emotional intent of that movie.“If you see that movie, it’s not a great movie, it’s a good movie, and that emotional intent is in the movie. But it was never what I hoped it would be for all these reasons that ended up being things that were out of my control.”Watch the trailer for Halloween: H20 above.Related content:"}