{"id": "High School Musical 3 turns 10: An appreciation", "paragraph": "Ah, the days of optimism! Tell me, oh muse, of that lost golden era, of new hope looking forward to the future that would never end. Oct. 24, 2008, autumn leaves falling, recession blooming, election looming, phones growing smarter, media going social, and here came High School Musical 3: Senior Year.It was the TV franchise’s first theatrically released film. Pause to explain words like “theatrical” and “release” and “film” to the new youth snorting infinite content through cloud-connected Mother Boxes, but one thing I’ll always love is just how stoked High School Musical 3 is to be a movie. The opening title flares on screen, five words nestled into a giant 3. That number’s lit up with 18 light bulbs, and then every light bulb explodes one after another, and then the whole title explodes into a glitter storm, which dissolves into the face of Troy Bolton (Zac Efron) whipping his sweaty proto-Bieberian moptop back and forth.He’s playing basketball, but the extreme close-up and the slow motion give this opening shot an intimacy the MPAA might churchily describe as “some sensuality.” And for a millisecond the dissolve suggests sparkledrops of perspiration light-speeding outwards, every Efronian follicle exploding into radiant dew.We’re starting in medias res, midway through a championship game. The first non-grunted line of dialogue spoken on screen is an inspiring halftime speech delivered by Coach/dad-of-Troy Jack (Bart Johnson). Then Troy gives another inspiring halftime speech with co-captain/BFF Chad Danforth (Corbin Bleu). Then the second half plays out to “Now or Never,” a jock jam with a whisper-rap group chorus, and an impossibly romantic interlude where Gabriella Montez (Vanessa Hudgens) scream-sings her boyfriend’s name “TROOOOOOOOOOOYYYY!!!!” so loud that the whole world goes dark.The first High School Musical emerged as a phenomenon in 2006. This was the decade when Disney invented and/or perfected every notion of tween fandom, factory-cranking smiley-happy ingenues into the cultural machinery. I guess you could pinpoint High School Musical as a logical extension of the ethos behind Lizzie McGuire, Hannah Montana, the rise of the Jonas Brothers, and the briefly potent notion of Lindsay Lohan as a multihyphenate pop star.But the initial success of the HSM telefilm felt like a happy fluke: The director of Newsies taking a cast of unknowns to sing new music in Utah, with a budget big enough to pay for three minutes of a Pirates of the Caribbean. That director, Kenny Ortega, generated lots of playful choreography. Songwriter David Lawrence crafted pop tunes with an old-fashioned wink, piling trendy Auto-Tuney warbling atop occasional piano glissandi. And the story was a demographic dream. You had Sharpay Evans (Ashley Tisdale), drama-kid in extremis, a character who in HSM3 casually describes one dance number as “some kind of yoga Fosse thing.” But you entered her universe via Troy, a basketball-playing dudely dude, surely not the sort of person who can sing, sing, SSIIIIIIIIING!All the young stars were very energetic, and there was something pleasantly achievable about High School Musical’s cheapo look. You felt invited to join in like this production was only half-finished and could use some more extras. The results were big ratings and a hit soundtrack that human beings paid analog dollars to purchase.There followed High School Musical 2, a somewhat loathsome gloss on the material. Sharpay got villainized, and true fans know she’s the morally ambiguous antihero. Class warfare was a theme, really just not Disney’s bag; its ultimate socioeconomic lesson can only ever be “GLORY TO THEY WHO CONSUME.” HSM2 replaced basketball with baseball, which just plain did not work for a dance number. Baseball is a chill sport for dadbods, whereas every basketball game is already [pushes glasses up nose] a kind of dance.Perhaps this all seems helplessly specific in a prose poem dedicated to a G-rated threequel about happy cute teenagers singing through problems they barely have. But HSM2 lost the thread a bit, and HSM3 found the thread, and the thread was a fuse, and look at the fireworks, kaboom!Now they had a reported budget around $11 million, big enough to pay for seven minutes of a Chronicles of Narnia. The screenplay, by Peter Barsocchini, has one major plot point: The whole cast of characters is putting on a high school musical called Senior Year. It’s based on their lives and they’re playing themselves, very much like Synecdoche, New York. There is a loose sense of competition: Some grandees from Juilliard are coming round to the big show to lay some scholarships on two students, but which two students? There is one big problem: Troy and Gabriella love each other, but what future do they have together? They’re high school sweethearts heading in different directions post-graduation. Gabriella didn’t just get into Stanford — she got into Stanford’s freshman honors program, a why-not plot contrivance that forces her to start college while high school is still happening. (Cruel Stanford!) Troy wants Gabriella, and he wants to play basketball, and he wants to SSIIIIIIIIING! Which perfect opportunity will this perfect boy choose?Whatever: The story’s just stringing together one ecstatic pop number after another. Troy and Gabriella sing love the tune “Right Here, Right Now” on a gigantically unreal treehouse rotating in front of a glistening starry, starry night. And they waltz together through “Can I Have This Dance?” on the school rooftop, exterior suburban nowhere stretching to the snowcapped mountains on the horizon. It’s weird, there were much bigger movie musicals made since the High School Musical franchise was a thing: Sweeney Todd and Les Misérables, Into the Woods and The Greatest Showman, La La Land and just now A Star is Born. The usual instinct, Showman aside, is to aim for a sense of realism: unbroken close-ups on Hathawayvian nasal quivers, dance numbers through on-location Los Angeles monuments, musical numbers filmed like danceless shot-reverse-shot dialogue scenes, credibility-minting shaky camera.Whereas Ortega’s instincts in HSM3 are fully hyperbolic. At the end of “Can I Have This Dance?” the heavens open, and rain falls in the desert. The weather is emotionally reactive, see. When Troy dances alone through an empty school in “Scream,” the locker corridors spin like the spaceship centrifuge in 2001: A Space Odyssey and a storm outside crashes mad-science lightning.Late in the movie, Troy drives a thousand miles on prom night to be with Gabriella. They dance around a tree, and they’re suddenly with their friends at school, or maybe they’re on stage playacting “prom” for their high school musical. Spectacle carries them forward, and Ortega gives good spectacle. You realize how hamstrung certain screen musicals are today, cutting around movie stars who can’t quite sing or dance. Whereas HSM3 comes to life in the big group numbers. Like “A Night to Remember,” the best girl-squad vs. boy-squad song since Grease’s “Summer Nights,” plus bonus points for not featuring the lyric “Did she put up a fight?” Or the moment in “The Boys are Back” when an Efron-Bleu duet suddenly grows a crew of backup dancers dressed like Road Warrior cosplayers. Halfway through “Scream,” basketballs rain down on Troy, for you see he is haunted by basketball, people!The performances mostly run the gamut from “happy to be here” to “really happy to be here,” but the chemistry between Hudgens and Efron gives all their scenes a little glow. Their big kiss in the reprise of “Can I Have This Dance” is sexy, or anyhow the most sexy-ish moment to crash through the G-rating this century. They were dating then, and then eventually they weren’t. Things end, and for a hot second when Hudgens sings a song called “Walk Away,” High School Musical 3 is very nearly “about” endings.But the pinnacle — of film and franchise and whole Disney era — is “I Want it All,” a duet between Tisdale and Lucas Grabeel (who plays Sharpay’s twin, Ryan). It’s an all-time banger about ludicrous aspiration and is without question the most recognizable 2000s-ish aspect of HSM3. This whole franchise was set in a definably retro version of Americana: a diverse ensemble nevertheless dominated by beloved popular jock dude, the possibility of social disparity acknowledged but quickly overcome. Whereas “I Want it All” is a full-blown inhalation of the pre-crash gilded age, with Sharpay playacting a safe-for-kids variation of every starlet saga from the “Britney’s Clubbing With Paris” era. “I want it all!” she proclaims: the fame, the fortune, the glam, the press only giving you the best reviews!The school cafeteria transforms into a stage, Hollywood, Manhattan, a red carpet step-and-repeat colored neon magenta. The other characters become background extras in the Rise of Sharpay. Troy playacts the kind of rabid fandom Efron himself had researched up close. Credit Efron for uncanny physicality. This was perfect selfie form, children, before smartphones invented the frontal camera.HSM3 is mostly a chill hang (or “repetitively plotless” if you’re feeling icy) but close examination of Sharpay’s role hints toward hidden tragedy. She begins in a position of absolute power, the supernova of the drama department. She even gets a personal assistant, a freshman student named Tiara Gold (Jemma McKenzie Brown). But how all occasions do inform against Sharpay. Drama teacher Ms. Darbus (Alyson Reed) decides to cast the spring musical with everyone in the senior class, giving the prime roles of “Troy” and “Gabriella” to, well, Troy and Gabriella.And Tiara’s out to replace Sharpay, a full-blown All About Evening that brutally implies Sharpay’s already past her prime at 18. Tisdale circa 2008 was getting the full Disney star windup, so her comic desperation here looks downright noble: a teenybopper brazenly playing yesterday’s news, grasping for the spotlight one last time.The musical ends with all the stars announcing where they’re going to college, like precisely no one ever has in real life, and the lineup’s a parental dream. Chad got a a basketball scholarship to a Pac-10ish powerhouse, Gabriella’s already at Stanford, Troy’s across the Bay at Berkeley. Taylor (Monique Coleman) is going to Yale, to study political science. Choreographer Ryan got one Juilliard scholarship, songwriter Kelsi (Olesya Rulin) got the other. (There’s something delightfully wonky in HSM3‘s suggestion that Juilliard’s way more impressed with the people composing the musical than the stars performing it.) And Ms. Darbus announces that Sharpay is going to school nearby, close enough to “return to East High next fall to assist me in running the drama department.”I don’t want to say this is an “unhappy ending” for Sharpay. Indeed, the prospect of seeing her as a super-glam drama club T.A. is way more exciting than the actual Broadway-bound spin-off she received. But it’s a dose of reality amid HSM3’s fanfare. Like, nominal hero Troy gets everything he wants by attending Berkeley, herein representing a Gabriella-adjacent utopia where every basketball player can also find time to SSIIIIIIIIING! Meanwhile, Sharpay loses the chance at a drama school scholarship (to her twin brother!). Her new ambition is to work part-time at the school she once dominated. Her struggle, goofy as it is, looks real.“Real” not really being a word you could use very often describing HSM3. Mere months later, the Fox hit Glee added Idol-y karaoke and social consciousness to the high school musical format, ever so slightly snagging this hot idea someone had of a varsity athlete with a song in his heart. Viewed from 2018, HSM3 looks helplessly sanitized, a floating vision of teen life that never existed anywhere, an impossible place where everyone can agreeably sing how “We’re All in This Together.”And Disney is a world engine churning out intellectual property installments, aggressively rebooting old animated musicals with famous actors who can kiiinda sing, maybe. So there’s something retroactively specific about HSM3: Here, a cinematic universe built from drama club, basketball, college applications, righteously blond ambition, a half-remembered feeling that anything was possible. Ms. Arbus gives Troy worthwhile advice: “Better to consider opportunities now than in ten years when life may limit your choices.” Ten years later, life has limited so many choices. But back then, we wanted it all."}