{"id": "Superhero Insider: Breaking down the returns of Arrow and Supergirl", "paragraph": "Each week, we break down the biggest moments from Supergirl, The Flash, Black Lightning, and Arrow — both here on EW.com and on SiriusXM’s EW Live every Friday during Superhero Insider.This week, Arrow and Supergirl made their long-awaited returns with premieres that setup interesting stories after rocky seasons. Meanwhile, Barry and company faced a frightening new threat on The Flash, and Jefferson Pierce paid the price for his superheroism on Black Lightning. Here are the highlights:Supergirl has never been afraid to get political. In season 2, it explored the idea of aliens as minorities, and this season it’s digging even more into that with a story about how anti-alien fear is rising in National City, which is an obvious allegory for our real-world immigration and racial issues. However, the heavy-handedness isn’t a bad thing because the show, at least in its premiere, was pretty nuanced about it. Kara’s optimism and initial unwillingness to believe anything was wrong felt very real and was reminiscent of how many people still think things aren’t as bad in the real-world as they are, and I loved J’onn calling her out for her understandable naivety because she has the benefit of being able to pass as human.  —Chancellor AgardRelated: Read our preview of the entire season with showrunners Jessica Queller and Robert Rovner here, see Elizabeth Tulloch’s debut as Lois Lane in the crossover here, and learn more about Lex Luthor’s introduction here. Honestly, I can’t believe it took seven seasons for Arrow to give us a naked fight scene. Oliver’s highly anticipated prison shower brawl was hands down the highlight of the twist-filled season 7 premiere. Unlike the show’s usual fights, this one wasn’t just cool; it was brutal, and James Bamford’s direction made you feel every single hit. Plus, I loved how it was paired with Felicity’s own death-match against Diaz. There was something very satisfying about watching Felicity whack the Dragon with a fire poker over and over.   —C.A. Related: Read our recap here, showrunner Beth Schwartz on the big flash-forward twist here, and check out the poster for this year’s crossover “Elseworlds” here.In the lead-up to Tuesday’s episode, the cast and producers kept describing season 5 baddie Cicada (Chris Klein) as scary, and it turns out they weren’t lying. Team Flash’s first round with the hooded villain was scary because of how unexpected it was and because they were truly powerless thanks to his mysterious nice. There was a genuine sense of danger here that was missing last season with the Thinker. Plus, the fight led to another interesting mystery: Why did Cicada stop himself from killing Barry when Nora called out? Was it just because he felt bad killing her father in front of her, or was there something else going on there?   —C.A.Related: Read our recap here, and Candice Patton on the importance of Iris as a reporter here.The reason Jefferson Pierce retired as Black Lightning for so many years was that he felt he was doing a better job of serving Freeland residents as principal of Garfield High. That obviously changed last season, when new dangers necessitated a return to costume. Tobias and Khalil’s assault on Garfield High became one of the few times that Black Lightning was the person most fit to protect the school’s students — and this week, his secret identity paid the price. Since it appears that Jefferson Pierce was absent from Garfield High in its moment of greatest need (even though he was just wearing a mask), the board demanded his resignation as principal. In this week’s episode, he finally gave it. When Jefferson announced the news to students, they responded by reciting his own inspirational mantra back to them — proving that his teachings have had just as much of an effect on the community as his superhero exploits. Black Lightning focuses a lot on systemic oppression much like the kind experienced by minority communities in real life, which makes touching moments like this feel very powerful and earned.—Christian Holub \nRelated: Read our recap here.Click below to listen to this week’s Superhero Insider, which airs every Friday at 10 a.m. PT/1 p.m. ET on SiriusXM’s Ch. 105, hosted by Kyle Anderson, Chancellor Agard, and Shirley Li.Supergirl airs Sundays at 8 p.m. ET, Arrow airs Mondays at 8 p.m. ET, The Flash airs Tuesdays at 8 p.m. ET, followed by Black Lightning at 9 p.m. ET. and on The CW.Related content: "}