{"id": "Netflix Christmas programming includes Chilling Adventures of Sabrina holiday special", "paragraph": "It’s beginning to look a lot like Christmas. Sure, Thanksgiving is still around the corner, but in the meantime everyone’s getting prepared for the real action this holiday season. In a new video, Netflix officially announced its full slate of Christmas-themed movie and TV programming for this holiday season. In addition to licensing holiday classics for its library and producing original Christmas movies of its own, the streaming platform is also putting out special holiday episodes of some of its recent series — including Chilling Adventures of Sabrina.Just a few short weeks after viewers were introduced to the new incarnation of Sabrina Spellman (Kiernan Shipka), she and her devilish aunts will return in Chilling Adventures of Sabrina: A Midwinter’s Tale on Dec. 13. The week before will see the arrival of Neo Yokio: Pink Christmas, a follow-up to the first season of the Jaden Smith-starring, Ezra Koenig-produced anime that hit the streaming service last year. Season 4 of Fuller House is also being folded under the umbrella of Christmas content since the first episode will be holiday-themed and titled “Oh My Santa.”On top of that, Netflix is following up the success of last year’s original movie A Christmas Prince with several new Christmas originals. On top of a sequel to A Christmas Prince, Netflix will also release The Princess Switch (another holiday-themed royal rom-com) and The Christmas Chronicles (starring Kurt Russell as Santa) over the next few weeks so viewers are primed for December.Below, check out the full list of Netflix’s new Christmas content for this year, along with a list of which classics are already streaming. Watch the trailer above.New Netflix Christmas originals:\nThe Holiday Calendar — available now\nThe Princess Switch — available Nov. 16\nThe Christmas Chronicles — available Nov. 22\nA Christmas Prince: The Royal Wedding — available Nov. 30\nThe Great British Baking Show: Holidays — available Nov. 30\nNailed It! Holiday — available Dec. 7\nNeo Yokio: Pink Christmas — available Dec. 7\nSuper Monsters and the Wish Star — available Dec. 7\nFuller House season 4 — available Dec. 14\nChilling Adventures of Sabrina: A Midwinter’s Tale — available Dec. 13Now streaming — Netflix Originals\nA Christmas Prince\nA Very Murray Christmas\nBoJack Horseman: Christmas Special\nChristmas Inheritance\nGilmore Girls: A Year in the LifeNow streaming — Christmas ClassicsBad Santa\nBad Santa 2\n                Get Santa\n                How the Grinch Stole Christmas\n                Irving Berlin’s White Christmas\nLove Actually\nMariah Carey’s Merriest Christmas"}