{"id": "Miley Cyrus and Liam Hemsworth speak out after losing home in California wildfires", "paragraph": "UPDATE: On Tuesday, Hemsworth commented on the devastating wildfires, posting a photo on Twitter of what’s left of the Malibu home he once shared with his fiancée Cryus and their pets. “It’s been a heartbreaking few days,” he wrote in the caption of a photo that showed the charred remains of his house. “This is what’s left of my house. Love. Many people in Malibu and surrounding areas in California have lost their homes also and my heart goes out to everyone who was affected by these fires.” He too shared details of how people can donate to help with relief efforts.It’s been a heartbreaking few days. This is what’s left of my house. Love. Many people in Malibu and surrounding areas in California have lost their homes also and my heart goes out to everyone who was affected by these fires. To help: https://t.co/YQCE1cLaej & @happyhippiefdn pic.twitter.com/vtLFytFmNw— Liam Hemsworth (@LiamHemsworth) November 13, 2018Thankful for the all the great local guys that helped keep smaller fires out around my property. I love u guys. I love you Malibu. Thank you to all the hero firefighters around California. It’s going to be a journey to rebuild. Stay strong all.— Liam Hemsworth (@LiamHemsworth) November 13, 2018EARLIER: Miley Cyrus is among many who lost their homes during the devastating California wildfires.Over the weekend, the singer tweeted that the Malibu home she shares with fiancé, actor Liam Hemsworth, and her numerous pets “no longer stands,” but added that everyone “made it out safely” and “that’s all that matters right now.”Deadly fires tore through California beginning late last week, causing hundreds of thousands to evacuate their homes and widespread destruction that has left at least 31 people dead. Cyrus was among many celebrities — including Neil Young, Robin Thicke, Gerard Butler — who safely evacuated but unfortunately lost their homes.“Completely devastated by the fires affecting my community,” Cyrus wrote on Twitter. “I am one of the lucky ones. My animals and LOVE OF MY LIFE made it out safely & that’s all that matters right now. My house no longer stands but the memories shared with family & friends stand strong.” The “Malibu” singer went on to share her appreciation for the firefighters and Los Angeles County Sheriff’s department, as well as posting details on how to donate and help with relief efforts.Completely devestated by the fires affecting my community. I am one of the lucky ones. My animals and LOVE OF MY LIFE made it out safely & that’s all that matters right now. My house no longer stands but the memories shared with family & friends stand strong. I am grateful for— Miley Ray Cyrus (@MileyCyrus) November 12, 2018To donate: https://t.co/5b89O28mRghttps://t.co/Ec7ImhMOf3https://t.co/KXrqZt1MBghttps://t.co/AZ7zBnCWtkhttps://t.co/IAvkynLgX6https://t.co/bTYYVgw76Phttps://t.co/E0wvq7SKJJ— Miley Ray Cyrus (@MileyCyrus) November 12, 2018Related Content:"}