{"id": "Mike Judge gets funky in season 2 of Tales From the Tour Bus", "paragraph": "After tackling some of the most hair-raising tales in country music in season 1 of the animated Cinemax series Tales From the Tour Bus, creator Mike Judge gets funky in season 2, premiering Nov. 2, chronicling the exploits of George Clinton, James Brown, Rick James, and more.While there were definite similarities between the genres, the funk musicians, Judge says, “are slightly more law-abiding — there’s not as many fingers getting blown off. But, they’re equally hilarious and interesting. Just like in the country music category, almost all of them come from really humble beginnings.”Judge also feels like these tales were less well-known than some of their twangier counterparts.“I didn’t know a lot of these stories until we did this,” he says of vignettes like Clinton’s mother giving birth to him in an outhouse or the time he accidentally set some fancy hotel room curtains on fire. “So that’s something that was fun about this for me, just learning all these details.”Particularly illuminating for the creator of Beavis and Butt-Head, Silicon Valley, and writer-director of Office Space, was spending time with Clinton.“He’s a cartoon character in real life, and it was so fun to actually make him animated,” he says of the leader of Parliament-Funkadelic collective, who served as inspiration for several generations of artists like Prince and whose beats served as the springboard for hundreds of hip-hop songs.George Clinton in Tales from the Tour Bus“He’s amazing,” Judge says of the endlessly colorful, 77-year-old Rock and Roll Hall of Famer. “He’s got the best vibe of maybe anybody I’ve ever met. He’s just so positive and hilarious and he helped us out a lot with this, including with the music with [series composer] John Frizzell and him doing some of the score. Mentally, he’s in great shape, too. I mean, we were sitting in the kitchen at the recording studio and he was telling me about these characters [in his stories], and he just spontaneously went into a rap, basically, that rhymed all the way through that was like three minutes long and it was just brilliant.”Tales from the Tour Bus creator Mike JudgeAnother highlight for the diehard music fan was bringing in Rick James’ backing group the Stone City Band to actually record some music for the series.“Because a lot of these [clips] are scenes where they’re just playing on stage, we didn’t want to just get some horrible needle drop or studio musician music,” says Judge. “So we had those guys play. We did that with Waylon Jennings [last season], too. We had his band play, which was actually awesome. It gave me goosebumps, seeing Richie Albright just start kicking off those drumbeats and it sounds like what I grew up with. And same thing with the Stone City Band.”Apparently, they approved. “They saw a little bit of it when they were in the studio and they were all laughing,” says Judge. “They all seemed to like it.”If he were to get a third season, Judge says it will cover “either the beginning of hip-hop or blues. It’s hard to say, but it would probably be one of those two things.”For now, fans of the funk can catch season 2 of Tales from the Tour Bus on Cinemax on Fridays at 10 p.m. ET.Related Content:"}