{"id": "How Mélanie Laurent deliberately resisted True Detective's legacy in Galveston", "paragraph": "For her stateside directorial debut, French actress and filmmaker Mélanie Laurent (Inglourious Basterds, Now You See Me) felt she only had one chance to get it right for her first venture into the U.S. market. Thus, she took a creative gamble by adapting True Detective creator Nic Pizzolatto’s 2010 novel Galveston into a feature on her own terms, deliberately straying from the thematic and aesthetic expectations associated with his wildly popular HBO series. The result, she hoped, was to craft a distinctly foreign take on a quintessentially American crime story set along the coast of southeastern Texas.“This is the first shot I had in America, making an American movie about an American story as a director from France. [I was afraid of] not making something good enough to be able to make another movie here,” the 35-year-old tells EW. “The idea was to do something very different. Production-wise and acting-wise, we didn’t want to make anything that looked like a Nic movie.”A filmmaker who works in strokes of impression — often creating improvised scenes on the fly as dictated by the set’s “mood of the day” — Laurent strung together multiple creative threads to make Galveston, Pizzolatto’s original screenplay for which she tweaked and expanded during production. The completed work follows a hard-boiled hitman named Roy (Ben Foster) who, along with fellow target Raquel (Elle Fanning) survives a bloody double-crossing staged by his menacing employer (Beau Bridges). On the run, the pair goes into hiding in the film’s titular town, where Roy plots his revenge as his relationship with Raquel (who’s later revealed to be working as an escort) blossoms into an unlikely friendship instead of wilting under the clichéd pressures of would-be romantic entanglement.“For once it’s two people with a platonic love story, a fantastic, beautiful, strong friendship…. I wanted to make sure we wouldn’t go down any other path,” Laurent observes of the odd couple’s magnetic chemistry, a dynamic that ultimately tests (and perhaps softens) the edges of Roy’s violent instincts. “I told Ben and Elle, ‘You have to feel like you love each other; nothing’s going to happen sexually, but also that you would die for the other one.’”Laurent admits her process changed “the script and the [story] a little bit” from Pizzolatto’s final draft, though producer Tyler Davidson previously told EW her edits were “significant” — enough so that Pizzolatto requested his name be removed from the official credits in favor of the pseudonym “Jim Hammett.” (Pizzolatto did not reply to EW’s request for comment.)“If [producers] wanted to make an American movie in the spirit of True Detective, I think they’d have chosen someone else. They had a reason to find a female director from Europe,” Laurent explains, adding that her favorite extemporized moment sees Fanning crying in a bathtub after a particularly traumatic experience in a scene that doesn’t exist in Pizzolatto’s book, one that she feels effectively communicates her singular artistic spirit.“My way of working involves feeling my instincts. You shoot a scene, go home, and feel like, okay, I need to change things tomorrow! We need to add another scene [because the actors] did something strong, so we need to follow it,” says Laurent. “[That] added moments of life into the script.”While Pizzolatto laid the foundation, Laurent says she “never met the guy,” so she didn’t feel intimidated tackling his ambitious project. And for the most part, stateside critics have generally praised her domestic bow in the director’s chair. Having helmed several popular works in her native France, however, Laurent has built up a regional reputation of quality after releasing the fantastic 2014 psychological thriller Breathe and the 2017 drama Diving — the former of which received two nominations at the César Awards, the French equivalent of the Oscars. With all of its American trimmings, then, Galveston confused homeland viewers.“[French] journalists were like ‘Oh, wow! It’s an American movie. We can’t tell it’s you!’” she notes. “I don’t know if I made an American movie or if you’ll feel like it’s [from] a female director from Europe.”But Laurent says she’s happy with the movie she made; even if it’s a mystery to others on the surface, it runs thick with her creative DNA.“The story was really American, the lighting is different from what you’d see in Paris, and the actors work differently in France [but] the way I filmed is the way I film every story. I feel like it’s my movie…. I didn’t [approach it] like, I have to be an American director now,” she finishes. “I never asked myself if I had to watch more True Detective episodes to get in the spirit of it, nor did I have to watch more American movies to [connect with] American viewers. I just made a movie.”Galveston — also starring Adepero Oduye (12 Years a Slave, Pariah) and Lili Reinhart (Riverdale) — is now playing in limited theatrical release and is available on VOD and digital HD. Watch EW’s exclusive clip from the film above.Related content:"}