{"id": "Daredevil boss answers burning season 3 questions, talks potential season 4", "paragraph": "Warning: This articles contains spoilers from the entire third season of Marvel’s Daredevil. Read at your own risk! The Devil of Hell’s Kitchen dethroned a tyrant once again!Season 3 of Marvel’s Daredevil began with Matt Murdock (Charlie Cox) slowly but surely returning to the land of the living after the Midland Circle building collapsed on him in The Defenders finale. Alienating himself from Foggy (Elden Henson) and Karen (Deborah Ann Woll) and abandoning his civilian life, Matt focused on taking down Wilson Fisk (Vincent D’Onofrio), who masterminded an entire conspiracy that involved getting released from jail; essentially wresting control of the FBI; and destroying Matt’s professional and vigilante life. All of this involved corrupting two FBI agents in particular: the good-intentioned Ray Nadeem (Ray Ali), who was blackmailed into working for Fisk and was murdered toward the end of the season when he decided to testify against him; and Ben Poindexter (Wilson Bethel), an agent with deadly aim who committed several murders while dressed up as Daredevil (RIP Father Lantom) and is destined to become the iconic Daredevil villain Bullseye. (Read EW’s full recap of season 3.)The season-long war culminated in a bloody and back-breaking fight between Matt, who was prepared to kill, Fisk, and Dex, who turned on the Kingpin after realizing how much he’d been manipulated. Fisk breaks Dex’s back, leaving him paralyzed, and Matt comes close to killing a bloodied Kingpin; however, at the last moment, he decides to offer Fisk a deal: Matt promised to not turn over incriminating evidence against Fisk’s new wife Vanessa (Ayelet Zurer) if Fisk agreed to stay away from Foggy and Karen. Willing to do anything to protect Vanessa, Fisk agrees and is whisked off to prison because Ray recorded damning testimony against him before his untimely death.As Matt reunited with Foggy and Karen to form a new firm (Name TBD), doctors were busy trying to repair Dex’s spinal damage. In the final shot of the season, a bullseye appears in Dex’s eyes, hinting at his comic book-mandated destiny.In the wake of the finale, EW had several questions about what the ending means for Matt and company, the show’s future, and more. Thankfully, showrunner Erik Oleson was willing to answer most of them. Read our spoiler-filled chat below:ENTERTAINMENT WEEKLY: When you signed on to showrun season 3, what did you want to focus on? \nERIK OLESON: One of the goals I had for season 3 was I wanted the audience to experience, not watch the show. What I mean by that is I wanted to employ the techniques of deep point of view, where you are in the head of the characters and experiencing the events and the decisions the characters make as if you are the character. You’re not watching it from a distant crane shot that’s beautiful graphically but is all about the spectacle. I wanted that to be the approach for season 3, to really get into the characters’ heads.Instead of introducing Bullseye as an outright villain, you decided to tell his origin story. Why did you want to start there with the character? \n                The way we saw Agent Ben Poindexter was that he was a borderline personality. Dex is somebody who might have been able to function in society as a positive character, even a hero. He overcame his mental illness using medication, psychiatric help, and a rigid structure in his life with a job at the FBI where he was helping people. But the tragedy that befalls him is that he comes into the orbit of Wilson Fisk, who is a narcissistic personality, a tyrant, a would-be dictator who twists him into the evil version of himself on Fisk’s own path to power.One of the things that fascinated me was that otherwise good people who might have been positive members of society, who fall under the sway of somebody that preys on their fears and on their dark side and gets them to carry tiki torches through Charlottesville. That was very much on our minds as we were looking at Fisk and the way that he plays to people’s fears — fears of the other — and uses those to divide people against each other and against themselves.In shaping his backstory, did you look to anything in the comics or what backstory you gave him? \n                In the comics, for the most part, Bullseye is a full-blown psychopathic killer. In the version of the story that I wanted to tell, where every single character in our cast has psychological depth and there’s a reality to them, and I’m inviting the audience into their heads so that they can empathize with them, starting out with a psycho killer is not that interesting. I was much more interested in the fact that, because the comics were not specific about the backstory of Bullseye, I would have the freedom to create one. That helped me tell the story for season 3.When you add all of the characters together, what you come up with is the controlling idea that guided the design of season 3 — and we had this on the writers’ room wall — [which] was a quote that we all came up with and it went as follows: “You can only be free when you confront your fear because your fears are what enslave you.” In Dex’s case, he’s always feared being his true self. He’s kept himself in that cage because he knows that he is a borderline personality with psychopathic tendencies. We talked to psychiatrists; we just wanted to draw the character as a real person who will eventually become Bullseye because of all of the factors you saw in the season — Fisk intentionally destabilizing the parts of his life that allowed him to cope with his mental illness.The final shot is of a Bullseye materializing in Dex’s eye. In the event that there is a fourth season, do you plan on making Bullseye the season’s big bad? \n                I’m not allowed to answer that question, I’m afraid. Let’s just say we have now seen the origin of Bullseye, and there are many, many stories yet to tell with this cast of characters. Whether season 4 goes in that direction or another, Bullseye will be living and breathing in this world because we’ve now seen how he has been created.Have you heard anything about a potential season 4?\n                I can tell you that I’m very hopeful to go do a season 4. There has not yet been any kind of an official pick-up, but if there is, I’m very hopeful that I will be a part of it.You avoided putting Matt back in the costume for the entire season. What was the reasoning behind that apart from the fact that it was destroyed and Dex was impersonating him?  \n                The deeper symbolic reason is that Matt’s perspective on God and Daredevil as a symbol to scare criminals out of their criminality, all of that has changed. Matt does not feel the same way about the suit and the symbolism of Daredevil that he did prior to season 2 and Defenders. He’s in a different place emotionally, and he is also incapable of being the Daredevil that everybody knows. As you saw at the beginning of the season, he’s pretty smashed up and unsure that he’s ever going to be able to be Daredevil again.Again, one of the guiding principles for me was that I really wanted an emotionally honest season. There are times when shows like this can do something just because it’s cool, but it takes you out of a story because it’s imposed by writers from the outside as opposed to character driven and real, and something that might actually happen if this world were real and the characters were doing what they want to do and taking the action that were a natural progression of their wants and needs. I’m very strict about how we break stories, and that was one of my reasons for not putting him in the red suit at the beginning.In your mind, where is Matt’s mind at when the season ends? How does he feel about his relationship to Daredevil? \n                At the beginning of the season, he has this new perspective of God. It’s shifted from the kind, benevolent God of the New Testament and he sees him as more of a cruel and punishing God of the Old Testament. He feels like his efforts on behalf of God have not been rewarded. But by the end of the season, I think Matt has worked through those issues in a lot of ways. He has a very complex view of God and of his role in protecting Hell’s Kitchen and his relationship there. Matt, especially following the death of Father Lantom and the successful takedown of Fisk without Matt having to doom his eternal soul, has injected a new hope that he has found new purpose and drive. I think he’s in a much better place. He’s been vindicated spiritually, physically, and emotionally. I have to stop there because I don’t want to talk about where I want to take it next.Going back to that quote on the writers’ room wall about overcoming fears, did that inspire you to give us an extended Karen Page flashback in episode 10? \n                The whole idea of season 3 was that our fears enslave us, that all of us, the characters on the show and the viewers in real life, behave certain ways based on fears in our real lives. In Karen Page’s case, Karen fears she’s not a good person, that she’s unworthy of love, because she has committed this unforgivable act of causing her own brother’s death. What Karen has to confront, what Karen comes to realize, is kind of what Matt says to her at the end of the season in the finale, which is that in the grand scheme of things, we’re all trying to do the best we can and in the balance sheet of life, Karen has done more good than bad. He’s not giving her an easy answer to that. That’s like a core facet of her character, you know, this horrible scar tissue of being high and drunk in an automobile crash after her brother was just trying to save her from this abusive boyfriend. That informed for me a number of things.When I started the season, I wanted to understand characters more deeply, and I didn’t understand why in season 1 Karen was flirting with Matt but it never went anywhere, and flirting with Foggy for a couple episodes and it never went anywhere, and then had chemistry with Frank Castle but that also never really went anywhere. I wanted to kind of retcon, or at least explain in my own head and then on the screen, why. The fear that is driving her is she’s not worthy of love. So, yes, it not only informed that flashback episode but also why she behaved the way she behaved in prior seasons.Even Wilson Fisk is driven by fear this season. He fears he’s not worthy of the love of Vanessa. Ray Nadeem is afraid he’s not living up to his responsibilities of taking care of his family. His fear drives him to make some catastrophically bad decisions over the course of the season. Matt is driven by a fear of abandonment, and it has certainly prevented him from forming a meaningful relationship with Karen. Only when he realizes that it’s his fear of his abandonment that is enslaving him and forcing him to push his friends away is he able to become his best self, to overcome his fear, let his friends help him, and that was also part of the hidden architecture of the season.I very much wanted to tell a story that spoke to the times we’re living in, in which there are narcissistic tyrants who are playing to all of our fears, to turn us against one another and to turn us against ourselves and that is what Fisk represents. But I also wanted the show to inject hope and provide the prescription of how to defeat somebody like that. For me, the prescription is the power of a free press, which obviously Karen represents this season; the power of the law, which Foggy very much represents; and then the power of collective action, love, friendship, and faith, which is represented by Matt joining with his friends to overcome a tyrant.Apart from appearances by Luke Cage‘s Annabella Sciorra and Danny Johnson, there weren’t any major crossovers and the season felt closed off from the rest of the Marvel-Netflix universe. Did you avoid crossovers because you didn’t want to, as you just said, impose things from the outside? \n                I did not want to do crossovers that distracted us from the core story this season and the story that we wanted to tell. My personal style, just the writing that I want do and the writing that I like to do, is layered and focused on character-driven stories that have explosive moments of action, that are hopefully surprising and very much Marvel but are driven by the architecture that we’ve designed for the seasons. To me, when you have drop-bys from characters from other shows or the Marvel Universe, it would have to feel organic to the story you are telling or else it just becomes distracting. That’s my personal taste. Some people will miss it and disagree with me, and there’s no right or wrong. For me, each one of the Marvel Netflix shows has its own tone and I very much wanted to keep my eye on the ball this season and I wanted to fully flesh out the characters of Daredevil and not get distracted by setting up spin-offs or other elements.The season ends with Fisk going to jail, striking this deal with Matt. Do you feel you’re done with Fisk, or is there more you want to do with him? \n                All I will say is that there is a reason I ended the season the way I ended it. There are more stories to tell with all of these characters, but at the very end, I also didn’t want to forever damn Matt’s soul by making him a killer, even though he comes as close to that as he ever has. So, I think let’s see whether or not I get to do more of these seasons.The complete third season of Marvel’s Daredevil is available on Netflix.Related content: "}