{"id": "A Discovery of Witches renewed for seasons 2 and 3 ahead of U.S. premiere", "paragraph": "Antsy viewers in the U.S. still haven’t experienced the magic of A Discovery of Witches, Deborah Harkness‘ witch-meets-vampire fantasy novels come to life, but we’ll soon have so much to binge.Following the season 1 finale of the series in the U.K., the story of Diana Bishop and Matthew Clairmont received a double renewal for seasons 2 and 3 across Sky One, Sundance Now, NOW TV, and Shudder platforms.Fans have U.K. viewers to thank for this news. A Discovery of Witches premiered in the United Kingdom on Sky One on Sep. 14 and, according to Harkness, the “enormous” viewership “made it possible for future seasons to be greenlit and go into production.”“The writers are already hard at work to produce scripts so that we can cast and shoot season 2 next year. Elizabethan London, here we come!” the author wrote in a post on Facebook, referencing a plot lifted from her second book, Shadow of Night, for season 2. “Thank you to all our loyal viewers on the U.K. and territories covered by HBO Europe. Now we pass the baton to viewers in Spain, Portugal, New Zealand, Australia and the U.S. who will be seeing the show in the next few months.”MAGICAL NEWS: We're absolutely thrilled to announce @ADiscoveryOfWTV Series 2 AND 3 have both been confirmed!! So there'll be plenty more of THIS to look forward to. ❤️❤️ #ADiscoveryOfWitches @teresapalmer #MatthewGoode @DebHarkness pic.twitter.com/y4M0b9tDX8— Sky One (@SkyOne) November 2, 2018As EW previously reported, season 1 will hit the U.S. this Jan. 17 on Sundance Now and Shudder.A Discovery of Witches stars Teresa Palmer as Diana, a powerful witch and historian who suppressed her magic after the deaths of her parents. But when she becomes the only known being to stumble upon the highly coveted tome Ashmole 782, rumored to contain all sorts of secrets about witches, vampires, and daemons, she’s going to have to use her witchcraft or die at the hands of those looking for the book.One of these tome hunters is Matthew de Clarimont (Matthew Goode), a ferocious vampire who falls in love with Diana, setting them both on a dangerous path that could upset the order of all magical creatures. A Discovery of Witches is based on Harkness’ All Souls Trilogy.Related content:"}