{"id": "Sweet Christmas! Marvel's Luke Cage canceled at Netflix after two seasons", "paragraph": "The invincible man isn’t immune to cancellations. In a surprise move by Netflix, the streaming platform tossed the axe at Luke Cage following the show’s second season that premiered in June.“Unfortunately, Marvel’s Luke Cage will not return for a third season,” Marvel and Netflix said in a joint statement to EW. “Everyone at Marvel Television and Netflix is grateful to the dedicated showrunner, writers, cast and crew who brought Harlem’s Hero to life for the past two seasons, and to all the fans who have supported the series.”Series creator Cheo Hodari Coker commented on the news over social media. “A lot [of] memories,” he wrote. “A lot of individual thank you calls to make. Just want to say thank you to Marvel, Netflix, the best Writer’s room, cast, crew, the Midnight Hour, all those who graced the stage at Harlem’s Paradise and the most incredible fan base in the world. Forward always…”A lot memories. A lot of individual thank you calls to make. Just want to say thank you to Marvel, Netflix, the best Writer’s room, cast, crew, the Midnight Hour, all those who graced the stage at Harlem’s Paradise and the most incredible fan base in the world. Forward always…— Cheo Hodari Coker (@cheo_coker) October 20, 2018Mike Colter starred as the bullet-proof “Hero for Hire” with appearances in his own standalone series, season 1 of Jessica Jones, and the Avengers-like team-up of The Defenders. The decision to cancel arose out of creative differences and Netflix’s inability to to reach deal terms on how to move forward, EW has learned.According to Deadline, scripts for a third season had already been submitted and the trade reported tension between Netflix and Marvel about how to reduce the traditional 13-episode order to a slimmed-down 10.Luke Cage is now the second of Netflix’s live-action Marvel series to be canceled. Iron Fist, starring Finn Jones as Danny Rand, was the first to go — also having recently debuted its second season. EW confirmed, however, that the character of Danny would appear elsewhere in the Marvel universe. The future of Harlem’s hero is still to be determined.Related content:"}