{"id": "Why Killing Eve star Jodie Comer deserves a Golden Globe (in 5 GIFs)", "paragraph": "It would not be hyperbole to say that Jodie Comer gave one of the most (if not the most) breathtaking performances on TV this year. As Killing Eve‘s villainous and wickedly funny assassin Villanelle, Comer created a sociopath who oscillated between absurdly charming and childishly peevish — but never ceased to be entertaining. Like American Horror Story‘s Cody Fern (subject of my previous Golden Globes column), Comer was a relative newcomer to American audiences — and there’s nothing the Hollywood Foreign Press likes more than a rising star. And like The Americans‘ Keri Russell, who my colleague Darren Franich advocated for in his Golden Globes column, Comer was snubbed by the Emmys (though her costar Sandra Oh received a well-deserved nomination). Having already raved about Killing Eve and Comer in my initial review and tribute to the incredible finale, allow me to stop telling and simply show the Golden Globes voters why Comer’s performance was so worthy — via five key GIFs.1. A very sweet entrance (Episode 1, “Nice Face”)When we first meet Villanelle, she’s enjoying some dessert at an ice cream parlor. After giving a nearby little girl a kind smile, she exits the shop, and ruins that kid’s day in the nastiest way possible.2. Killer moves (Episode 1, “Nice Face”)Did any other actress this year scale a wall while wearing Daisy Dukes and a frilly blouse? I think not.3. The deadest of deadpans (Episode 3, “Don’t I Know You?”) One of the many thrilling things about Comer’s performance is how brilliantly she titrated Villanelle’s sarcasm, to the point that it was all but impossible to know whether the beautiful killer meant anything she said or was simply making fools of us all. Did Villanelle really think the Jewish Museum in Berlin was “massively poignant”? Only she (and her breakfast burrito) know for sure.4. A truly scary work ethic (Episode 6, “Take Me to the Hole!”)She may be a remorseless murderer, but she’s a remorseless murderer who simply loves her job — even when it means killing someone random simply so she can assassinate her real target.5. Buddy comedy (Episode 8, “God, I’m Tired”)Here’s hoping that in season 2, Villanelle is forced to spend more time with Konstantin’s daughter Irina (the delightful Yuli Lagodinski), whom she kidnapped in the season finale — only to discover that the little girl was a master at getting under her skin. Hell, I’d watch a whole Midnight Run-style spinoff with these two. Make it happen, BBC America!The Golden Globes will air Sunday, Jan. 9, 2019, on NBC. Killing Eve is available to stream on BBC America on demand.Related content:"}