{"id": "Arrowverse crossover reveals first official look at The Monitor", "paragraph": "The Monitor has come to Arrowverse!EW is revealing the first official look at LaMonica Garrett’s multiversal observer Mar-Novu, who will be introduced in this year’s crossover “Elseworlds.” Check out the fiery character image below (What is he holding?):The Designated Survivor alum’s character has been described as “an extraterrestrial being of infinite power,” and according to The Flash star Grant Gustin, he’s quite a rather imposing character.“LaMonica was ridiculous, like seeing him in his suit, he’s just a monster,” Gustin tells EW.  “He’s like an absolute unit. He doesn’t have to do a lot with his performance. He’s so intimidating with just these subtleties, so that’s dope.”In the comics, the Monitor has played a role in several of DC’s multiverse-remaking, continuity-changing events. Created by Marv Wolfman and George Pérez for Crisis on Infinite Earths, he’s charged with watching over the multiverse, which was then under threat from his dark counterpart, the Anti-Monitor. Later DC crossovers introduced an entire organization of Monitors. As of right now, it’s still unclear how Garrett’s Monitor figures into the crossover.RELATED VIDEO: Ruby Rose suits up as The CW’s Batwoman in first look imageOf course, the Monitor isn’t the only DC Comics character making their Arrowverse debut in “Elseworlds.” The three-night event — which includes Arrow, The Flash, and Supergirl, but not Legends of Tomorrow —  will also introduce Ruby Rose as Batwoman,  Elizabeth Tulloch as Lois Lane, and Cassandra Jean Amell as Nora Fries. Jeremy Davies will star as Arkham Asylum’s Dr. John Deegan, while Tyler Hoechlin will reprise the role of Superman and John Wesley Shipp will suit up as a speedster. too.“Elseworlds” begins Sunday, Dec. 9, with The Flash at 8 p.m.; continues Monday, Dec. 10, at 8 p.m. with Arrow; and concludes the following night at 8 p.m. with Supergirl.Related content: "}