{"id": "Kerry Washington on her intense, timely new Broadway role", "paragraph": "After finishing her incredible run as Olivia Pope, Kerry Washington was looking to take a break. But then American Son — the breathtaking Broadway drama in which she now stars as a distressed mother — changed those plans.“I wasn’t really looking to do theater,” she told EW recently. “I did a play on Broadway about nine years ago and one of our producers, Jeffrey Richards, he and I had remained friends through the years and when it was announced that it was going to be Scandal’s final season, he immediately called me and said, ‘I have three plays I’m gonna send you.’ At that point I had sold Little Fires Everywhere with Reese [Witherspoon] so I knew what I was going to be doing in the spring, and I thought, well maybe I’ll just take seven or eight months off and just relax and recoup from seven seasons of Scandal. And then I read American Son, and I was like, nope!” she adds with a laugh. “There will be no down time. I am going to do this amazing play because I’ve never read anything like it.”Washington, 41, plays Kendra, a psychology professor searching for answers about her missing teenage son. She’s joined by Steven Pasquale (Junk) as Kendra’s estranged husband, and Jeremy Jordan (Newsies, TV’s Supergirl) and Eugene Lee (Gem of the Ocean) as police officers whom the couple implore for information about 18-year-old Jamal. “I felt like I knew these characters, but I’d never seen them, particularly Kendra, before,” says Washington, who made her Broadway debut in 2009 in David Mamet’s memorable fiery drama Race. “I wanted to help bring her to life because I loved the idea of her being a part of our theatrical canon. I wanted her story to be told.”“Before Scandal,” she added, “I thought of myself and operated in the world as a character actor. I’ve always been drawn to very different kinds of characters. And that’s what my career was before Scandal — most people didn’t connect that the girl from Save the Last Dance was the same girl from Ray, was the same girl from Last King of Scotland. … And then Scandal obviously was a different kind of cultural moment and it’s been an honor to play that character for seven seasons, but I really love being able to also play a very different woman in a very different set of circumstances.”Written by Christopher Demos-Brown and directed by Tony winner Kenny Leon (A Raisin in the Sun), American Son takes place entirely inside a Miami police station in the early hours of the morning and delves into issues like race, identity, class, and police violence. “[The story] is timely, but also I think it’s been part of the historic DNA of what it is to be an African-American mother, just to worry for the safety of your child,” the actress explains. “Part of all mothering is the lack of control over this other human being who, once they’re outside your body, makes their own decisions and has their own dangers. But there’s the added layer of powerlessness as a black mother because of the institutionalized racism and the cultural practices that endanger black children.”As rehearsals began, Washington — who is also a producer on Son — says the cast was “pulling our own truths to the table to share with each other, our own beliefs.” (Other notable producers on the play include Washington’s Scandal creator Shonda Rhimes, Jada Pinkett Smith, and Gabrielle Union-Wade.) Audiences, she hopes, will be inspired to have conversations of their own, which is why the production has partnered with the Opportunity Agenda to create a discussion guide for theatergoers to use after the show. “The play forces you on an empathetic journey because you’re constantly shifting perspectives, rooting for different characters’ points of view at different times,” Washington says. “I want that empathy to continue in the discourse after the play, but I wanted to give people tools to do that.”American Son opens Sunday at New York’s Booth Theater and runs through Jan. 27, 2019. More information and details on tickets can be found at the play’s website.For more on this fall’s Broadway season, pick up the new issue of Entertainment Weekly on stands Friday, or buy it here now. Don’t forget to subscribe for more exclusive interviews and photos, only in EW. "}