{"id": "Spice Girls add more shows to U.K. reunion tour because 'girl power' is real", "paragraph": "Never underestimate “girl power.” The Spice Girls expanded their highly anticipated stadium tour next year as a result of the high demand for tickets.Tickets for the reunion jaunt across the U.K. went on sale Saturday. Fans eagerly snatched them up, while others lost out. So now, instead of six shows, there will be 11.The tour was originally announced to begin on June 1, 2019 at Etihad Stadium in Manchester. Now two shows were added at the same location, shifting the official kick off to May 29, 2019.Additional performances joined pitstops at the Ricoh Stadium in Coventry and the Wembley Stadium in London, according to Ticket Master and updates posted to the group’s Twitter feed.“I know you’ve been bombarded with promo stuff lately but I just wanted to say I’m completely overwhelmed with the response to our tour,” Mel C, a.k.a. “Sporty Spice,” wrote on Twitter. “Wow! I did not expect that. It’s going to be AMAZING!! Thank you so much!”I know you’ve been bombarded with promo stuff lately but I just wanted to say I’m completely overwhelmed with the response to our tour. Wow! I did not expect that. It’s going to be AMAZING!! Thank you so much! #SpiceUpYourLife 🤪🇬🇧✌🏼— Melanie C (@MelanieCmusic) November 10, 2018See the revised reunion tour schedule below. (New dates have been bolded.)Wednesday, May 29\nManchester – Etihad StadiumFriday, May 31\nManchester – Etihad StadiumSaturday, June 1\n                Manchester – Etihad StadiumMonday, June 3\n                Coventry – Ricoh StadiumTuesday, June 4\nCoventry – Ricoh StadiumThursday, June 6\n                Sunderland – Stadium Of LightSaturday, June 8\n                Edinburgh – BT Murrayfield StadiumMonday, June 10\n                Bristol – Ashton Gate StadiumThursday, June 13\nLondon – Wembley StadiumFriday, June 14\nLondon – Wembley StadiumSaturday, June 15\n                London – Wembley StadiumRelated content:"}