{"id": "Joe Perry recovering in hospital after collapsing following performance with Billy Joel", "paragraph": "Aerosmith guitarist Joe Perry is recovering after he collapsed backstage following a performance with Billy Joel at Madison Square Garden.Perry surprised the crowd when he joined Joel for a cover of “Walk This Way” during the Saturday evening show and later needed medical assistance in his dressing room. Paramedics worked on the 68-year-old at the venue, putting in a tracheal tube, before rushing him to the hospital.“Following a guest performance during Billy Joel’s show last night at Madison Square Garden, Joe Perry experienced shortness of breath and was treated backstage by paramedics who gave the guitarist oxygen and used a tracheal tube to clear his airway before taking him to a hospital,” representatives for Perry said in a statement to EW. “This morning Perry remains in the hospital where he is alert and responsive.”The incident has forced him to cancel a planned appearance today in Florida at Rock and Roll Fantasy Camp.Perry recently released his new single “Quake” and announced he is embarking on a solo tour alongside Aerosmith member Brad Whitford and Gary Cherone of Extreme. The musician is also slated to join his bandmates when they begin their Las Vegas residency in April 2019.According to his reps, the concert dates, which are set to kick off in Iowa on Nov. 30, will not be affected by Perry’s medical emergency as he is “expected to return to the road later this month.”#Repost @billyjoel ・・・Billy with tonight’s special guest Joe Perry!photo: @myrnasuarezphoto pic.twitter.com/rVMtRLXR7m— Joe Perry (@JoePerry) November 11, 2018On Sunday, radio host Eddie Trunk sent his well wishes to Perry in a Twitter post — noting he had learned the rocker is “doing well.”Sending my best to rock icon and friend ⁦@JoePerry⁩ . Joe was just with me on my last radio special from LA. I’m hearing he’s doing well today thankfully! Be well Joe!!  https://t.co/vBnSJk7Eqf— Eddie Trunk (@EddieTrunk) November 11, 2018Perry previously suffered a medical emergency while onstage at a New York Hollywood Vampires show in 2016 as a result of “dehydration and exhaustion.”Related content: "}