{"id": "The Simpsons: A somewhat complete history of 'Homer³' from 'Treehouse of Horror VI'", "paragraph": "Every year, come the tricked-out, treat-packed time of Halloween, The Simpsons lets its shriek flag fly with “Treehouse of Horror.” These typically terrific terror trilogies allow the animated family comedy to unshackle from canonical chains and go full-gore with its parodies and parables (R.I.P., every Simpson family member, many times). But on Oct. 29, 1995, following the “Attack of the Fifty Foot Eyesores” and “Nightmare on Evergreen Terrace” segments from “Treehouse of Horror VI,” things went from ghastly and harrowing to… well, extremely trippy and unsettling.The formidable undertaking titled “Homer³” (referred to as “Homer Cubed” or “Homer 3-D” or “3-D Homer”) sent the Simpson patriarch into new dimensions via CGI magic, which may look amusingly outmoded now but was rather stunning and visually innovative at the time. In this parody of The Twilight Zone episode “Little Girl Lost” that also riffed on the burgeoning state of computer animation, Homer discovers a “mystery wall” behind the bookcase and passes through the portal to enter a freaky new dimension that looks like what would happen if Tron and Battlezone had sex on Good Will Hunting’s chalkboard. Discombobulated yet intrigued by these environs — as well as his more fully formed body — Homer’s mouth leaks a beautiful drop of drool as he marvels at fish in a pool (“Mmmm, unprocessed fish sticks”). His new-world trance is broken when a cone (Shapes! They are the future!) pokes him in the derriere, prompting him to angrily fling it away, but the cone punctures the gridded ground, creating a black hole. When Bart tries to rescue him from this math-y techscape, Homer falls into the black hole — and into our real-world realm — bringing us the first live-action Simpsons moment: CG Homer pulls himself out of the trash and walks down an L.A. street in fear and disorientation. Suddenly, though, an erotic cake store captures his interest, and he wanders in as the credits roll, thus concluding an utterly bizarro adventure into the outer limits of 1995 technology. (And one whose triumph of tech was somewhat trumped a month later with Pixar’s release of the first CGI feature-length movie, Toy Story.)“I wouldn’t rank this as the funniest thing that I’ve written, because that wasn’t entirely the goal,” says David X. Cohen, a former Simpsons producer who penned the segment. “It was the most ambitious episode I’ve worked on, requiring the most people to suffer the most to get it on the air…. I believe at the time that we ourselves were so dazzled by the graphics that we just wanted to linger on them with a little bit of suspenseful music and just kind of show off. We slowed down a little bit just to say, ‘Hey, world, we’re doing this thing that no one else can do right now!’”Offers David Mirkin, longtime Simpsons producer who directed the live-action portion of Homer³: “People loved it back then because it was having fun with technology at the moment, and now it looks like a piece of history, of being amazed at technology that’s no longer amazing. So, it works funny in both ways.”  Adds Simpsons director and producer David Silverman: “It hadn’t really been done — certainly not for TV. It’s very hard to explain it to people. It’s like, ‘Well, you know, my friend, you kinda had to be there…’”On the eve of “Treehouse of Horror XXIX” (Sunday, 8 p.m., Fox), let’s take you back there as best we can, given that we don’t have the time-machine toaster from “Treehouse of Horror V”. Here, several key players in the creation of “Homer³” rifle through their dumpster of notes and unearth a few ideas that never made it to the screen — and share assorted tales with EW about the segment that stands as one of the most outlandish and colorful moments in the show’s 30-season run.The genesis of the idea traces back to Bill Oakley, who was serving as co-showrunner of The Simpsons with Josh Weinstein at the time. He remembers a lightbulb illuminating over his head while leafing through a Twilight Zone companion book that was lying around the office. “I found ‘Little Girl Lost,’ and I somehow made the connection: ‘Hey, what if we pretended that the Simpsons were in the second dimension and they went into the third dimension?’” he recalls. Initially, Oakley and his fellow writers were planning to have the characters embark on a journey through all sorts of animation formats, but that notion didn’t last long. “We were like, ‘What \u2028can we really do besides paper cutouts?’” he says. “We\u2028 could do claymation, but that was third dimension [too]. Also, it dilutes the conceptual purity of going from second \u2028to third dimension. In The Twilight Zone, a little girl goes into the fourth dimension. So we said, ‘Let’s dispose of all that other crud.’”Oakley tapped Cohen (who would go on to co-develop Futurama with Simpsons creator Matt Groening) to write this segment based on his impressive academic pedigree. (Cohen boasts a physics degree from Harvard and a computer science degree from UC Berkeley.) “Because they were setting it in 3-D, Bill thought it might be cool to put some mathematical jokes in the background,” says Cohen. “And that’s where I came in. Of the many nerds on the Simpsons staff, I was the one with the particular math and science bent to of my nerdiness. So it was up to me to write it.” (More on that nerdiness in a bit.)Pacific Data Images, a computer animation production company that had worked a bit on Batman Forever and Terminator 2 — and did the digital rendering of the Pillsbury Doughboy in commercials — was looking to extend its reach into Hollywood at the time. So when the Simpsons producers contacted the company about producing the segment, there was elation… followed by hesitation. “The opportunity to work with arguably one of the greatest television series of all time — one of the best-written, with the most characters — was what you were dreaming to do in those primitive days of computer animation,” recalls Tim Johnson, the head of PDI’s character animation group who directed and oversaw all the cutting-edge CG imagery in that segment. “We turned to [PDI founder] Carl Rosendahl and we said, ‘Here’s the good news: The Simpsons has this amazing script, and we can participate.’ Carl just got up out of his chair and paced the room — he was so excited. I said, ‘Well, here’s the bad news: They don’t have any money to pay for it.’ So Carl sat back down and ran the numbers. [The Simpsons] wrote us a check for something embarrassing — like $6,000 — and we got to work on it.”Longtime Simpsons director Bob Anderson, who helmed the segment and created the concept art as well as the storyboards while working at Film Roman (the Simpsons‘ production company at the time), recalls bringing a small poster card to an early meeting with PDI (as seen below). “On this small piece of illustration board, I adhered a sheet of black construction paper,” he says. “I ruled some perspective lines for a grid with a Wite-Out pen, which I later shaded with a green highlighter. After masking that off, a toothbrush and a little more Wite-Out helped to create a splattering of stars for the dark, black sky. Two color-penciled, textured shapes set up the neighborhood for the smallest of details — a tiny representation of Homer trapped in his 3-D environment.” The grid was even more detailed than can be seen in the photo here. “Within each square of the grid is another smaller grid. Within each square of that smaller grid would be another tiny grid, and so on,” he says, adding, “Everyone seemed to like that, so that’s the direction it took.”PDI was supplied with two layouts: one that indicated what each background shot should look like, and another that illustrated Homer’s acting. “I remember thinking I would break all the barriers that pretty much confined us to our traditional animation, being that we could rotate the camera around Homer as he’s walking because he’d be in 3-D,” he says. “There was an initial shot where we actually pull out away from him and spin all the way around him and see his entire environment…. Everything was pretty well figured out, and they rendered everything pretty much exactly as I had hoped it would come out.”Cohen recalls that, given the project’s ambition and tight deadlines, “There was a discussion of, ‘Can we use any pre-existing 3-D models that the company already had to save time and money?’” Indeed, Johnson took advantage of the models and simulations that PDI had been creating over the years. “I came at it with the improv comedian’s mantra of, ‘Yes, and,’” he sums up. “They would have these funny ideas, and I would say, ‘Yes, and… did you realize that a teapot — which is really easy to make, and we already have — is an icon of computer animation? Maybe we could steer away from that crazy, impossible thing, and also have our cake and eat it too, by being a little truer to that kind of in-joke and mocking the state of computer animation.’”Take, for example, Homer’s “Mmmm, unprocessed fish sticks” line. “They were saying, ‘Well, we know water’s expensive,’ but somebody on our team had just done a really interesting water simulation,” continues Johnson. “And I believe we were able to offer the shot of Homer’s glistening drool falling in the water, creating gorgeous sine-wave ripples. That was our big production-value-add to their fish sticks joke.” (Speaking of that water scene, “I got some good notes from Brad Bird [who] at the time was our storyboard consultant,” says Anderson of the future director of The Incredibles. “Looking up from inside the little pond with the goldfish and seeing Homer through the water — that was one of Brad’s shots.”)Like Anderson, Johnson recalls pouring long hours into the segment. “I was still animating a Pillsbury Doughboy commercial, and we were doing that in the day, but listen, there’s not a single bad memory involved with that,” he says. “Those nights and weekends spent on the show were done with absolute glee.” (The nearly gratis work — a value that Johnson conservatively estimates at many hundreds of thousands of dollars — proved to be a smart investment, as the segment served as a calling card for the company. Shortly thereafter, Dreamworks bought a significant share of PDI, and Johnson would proceed to co-direct Antz; PDI co-produced Antz as well as Shrek. )As mentioned, Cohen was asked by Oakley to geek out by slipping all sorts of numbers and formulas in the techno-scape, which also included a Myst temple reference. (You may have noticed that the number 734 spells out PDI on a phone keypad, while a different set of numbers and letters above Homer translate in ASCII code to “Frink rules,” a reference to Professor Frink.) Cohen’s original notes for the segment included this line: “In the background, several equations are floating around that will shock and amuse the scientific community.” To achieve that purpose, Cohen says he planted a physics equation which indicates that “the universe is going to one day collapse in on itself, and that was to represent the fact that the 3-D world collapses in on itself at the end.” (This question remained open to physicists at the time, although “astronomers now believe that our universe will not collapse back in on itself,” Cohen helpfully points out.) Another equation, P = NP, which centers on the most famous unsolved problem in computer science, was “a brazen statement in computer science that says, ‘Yes, these difficult problems actually have an easy solution — we just haven’t found it yet.’ That was supposed to represent the idea that we can do these fancy 3-D computer graphics that no one else could on TV at that time.”His pièce de résistance, however, involved Fermat’s Last Theorem. (Around the time that the episode was being written, Princeton mathematician Andrew Wilde claimed to have a proof, which turned out  to be flawed, but he ultimately corrected it just before the episode aired, thus ending a dilemma that had been confounding academics since the 17th century.) “What I set to do in the background was to disprove it, contradicting the centuries of work leading up to this monumental math proof equation,” says Cohen. “Whereas he was saying there were no numbers that make that equation true, I decided to write a program that would look for numbers that made the equation almost true, and were correct to [enough] decimal places that people who checked on an ordinary hand calculator would find that it seemed to be true. My goal was to outsmart people who had an eight-digit calculator, which was the standard at that time.… This was in the early years of the internet, so I was able to lurk afterward and see people posting, ‘What the hell is going on here? This thing seems to disprove Fermat’s Last Theorem!’ And that was really one of those career highlights where I was like, ‘Yes! I screwed with three nerds’ heads!’” (He’d screw with a few more when he reworked his disproof of the theorem in season 10’s “The Wizard of Evergreen Terrace” so it could fool the then-standard 10-digit calculators.)By the way, here’s how Johnson recalls that prank of the highest academic order: “David Cohen and one of our programmers got to laughing so hard that everybody began to back out of the room, because nobody understood the joke.”NEXT PAGE: Find out how the scene with Homer in the real world was pulled off \n\n"}