{"id": "Google Cloud Status DashboardGoogle Cloud Networking Incident #18018\n  \n  ", "paragraph": "\n        This page provides status information on the services that are part of Google Cloud Platform.\n        Check back here to view the current status of the services listed below. If you are experiencing an\n        issue not listed here, please contact Support.\n        Learn more about what's posted on the dashboard in \n        this FAQ. For additional information on these services, please visit\n        cloud.google.com.\n        Connectivity issues connecting to Google services including Google APIs, Load balancers, instances and other external IP addresses have been resolved.\n    \n    Incident began at 2018-11-12 13:12\n    \n\n    \n    and ended at 2018-11-12 14:35\n    \n\n    (all times are US/Pacific).\n    The issue with Google Cloud IP addresses being erroneously advertised by internet service providers other than Google has been resolved for all affected users as of 14:35 US/Pacific. Throughout the duration of this issue Google services were operating as expected and we believe the root cause of the issue was external to Google. We will conduct an internal investigation of this issue and make appropriate improvements to our systems to help prevent or minimize future recurrence.The issue with Google Cloud IP addresses being erroneously advertised by internet service providers other than Google has been resolved for all affected users as of 14:35 US/Pacific. Throughout the duration of this issue Google services were operating as expected and we believe the root cause of the issue was external to Google. We will conduct an internal investigation of this issue and make appropriate improvements to our systems to help prevent or minimize future recurrence.We've received a report of an issue with Google Cloud Networking as of Monday, 2018-11-12 14:16 US/Pacific. We have reports of Google Cloud IP addresses being erroneously advertised by internet service providers other than Google. We will provide more information by Monday, 2018-11-12 15:00 US/Pacific.We've received a report of an issue with Google Cloud Networking as of Monday, 2018-11-12 14:16 US/Pacific. We have reports of Google Cloud IP addresses being erroneously advertised by internet service providers other than Google. We will provide more information by Monday, 2018-11-12 15:00 US/Pacific.Connectivity issues connecting to Google services including Google APIs, Load balancers, instances and other external IP addresses.Connectivity issues connecting to Google services including Google APIs, Load balancers, instances and other external IP addresses."}