{"id": "\n\n\n\nCrunchyroll\n\n\n\n\nMy Girlfriend is a Mermaid!? Visual Novel Dated for Switch in Japan\nRelated Article", "paragraph": "Update: According to a post on the Steam page the English update should be completed by sometime in December for the PC version. Thanks to Crunchyroll user pokedude900 for pointing that out!   The My Girlfriend is a Mermaid!? is already available on Steam as She is Mermaid—albeit with just Japanese, Simplified Chinese, and Traditional Chinese subtitle support—and the visual novel's next stop in Japan is Switch. Publisher Cosen lined up a date for the romance game's release, setting up a February 28, 2019 launch on Nintendo's console.  Cosen revealed the Switch date during the Digital Games Expo 2018 event in Akihabara. As for the English version, Sekai Games previously announced plans to bring My Girlfriend is a Mermaid!? to PC and Switch in the west in February, as well, so stay tuned for a concrete date. Here's how Sekai Games describes it: ──That summer, I met the mermaid you…Our protagonist lives out in the city but one summer decides to return to his rural hometown and it is there he once again meets his childhood friend, Ion… who is now a mermaid!? Soon after he also meets Petakko, a mermaid who has lost her memory and Rin, a priestess who looks after mermaids but also has a split personality. It is these encounters that brings our protagonist in contact with the legend surrounding mermaid. Together with Ion, who is at the center of this mysterious legend, as well as Petakko and Rin, our protagonist’s strange summer vacation begins…My Girlfriend is a Mermaid!? features multiple choices and endings that add to the value of this heartwarming story and with the additional content and updates to the game such as the addition of Live2D animation will make this a wonderful addition to the Nintendo Switch library.In addition, there’s some amazing voice talent involved with the game. Fuchigami Mai, voice actress for Ion is best known for her role in Girls und Panzer as Nishizumi Miho which she won the Synergy Award for at the 8th Seiyuu Awards in 2014. In addition she also voiced Iona in Arpeggio of Blue Steel and Hojo Karen in The Idolmaster: Cinderella Girls. Suzaki Aya, voice actress for Petakko is best known for her role in Tamako Market as Kitashirakawa Tamako, Kayano Kaede in Assassination Classroom and Nitta Minami in The Idolmaster: Cinderella Girls. She also won the award for Best Female Newcomer at the 9th Seiyuu Awards in 2015. Kageyama Risa, voice actress for Rin, voices the character of Tsukiyo in the visual novel, Dead End 99% in which she also sings the ending song. Via Gematsu -------Joseph Luster is the Games and Web editor at Otaku USA Magazine. You can read his webcomic, BIG DUMB FIGHTING IDIOTS at subhumanzoids. Follow him on Twitter @Moldilox. \nRead More »\n"}