{"id": "\n\n                Everything We Know About the California Wildfires (And How to Help)\n              \n\n", "paragraph": "\n              Wherever you are, you can take action\n        \n          Currently in California, three wildfires threaten the lives of thousands who have had to flee their homes. The Camp Fire currently swarms across Butte County in Northern California has now burned through more than 109,000 acres and is 25% contained, according to Google Crisis Response. The Hill Fire in Ventura County at Santa Rosa Valley and has burned through more than 4,500 acres, with 70% of the fire contained. The Woolsey Fire in Ventura County has now affected more than 83,000 acres with 10% of the fire contained. There are currently more than 6,000 firefighters and first responders deployed to handle the emergency.As the state gets warmer each year, the threat of wildfires damaging property and taking lives grows more imminent. Whether you’re directly affected or would like to help those who are, we’ve pulled together a list of resources you can use to take action.If you or someone you know lives in or near the affected areas, please stay updated with the latest news and evacuation procedures. Fire.ca.gov’s Incident Information page provides everything you need to know about what’s happening on the ground in these areas, with full evacuation info, available evacuation centers and shelters (including ones specifically for animals) and key road closings. @CAL_FIRE on Twitter is the site’s verified account providing ongoing updates.If you live in Ventura Country, their emergency information site is providing up-to-the-minute details on the Hill Fire and Woolsey Fire. There are also sites providing local updates for Los Angeles County, as well as the City of Los Angeles. Information on Camp Fire affecting Butte County can be found on CA.gov. All of these sites provide maps and current evacuation plans as well as resources and numbers to call if you need assistance or to report an incident.Additionally, Ready for Wildfire is a prime resource for understanding how to plan and take action if a wildfire ever affects your area. What’s most important is safety.If you aren’t in the area but want to help, you can donate. Check out musicforrelief.org/fire to make a donation to the first responders and firefighters currently battling the wildfires. You can also donate to various fire departments directly, including the Los Angeles Fire Department, and the Red Cross is providing help to those in need.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}