{"id": "\n\n                Cardi B Unleashes On Nicki Minaj In Scathing Rant: 'You're Fucking Up Your Legacy'\n              \n\n", "paragraph": "\n              She went off on Nicki over 'Motorsport,' their NYFW fight, and so much more\n        \n          Cardi B is fed up with Nicki Minaj. About what, you may ask? Literally everything.On Monday (October 29), the rappers' beef came to a head (again) when Cardi took to Instagram to speak her piece in a series of candid videos. Her comments came after Nicki used the tenth episode of her Queen Radio show to offer $100,000 for footage of her and Cardi's NYFW altercation (the one where Cardi left with a noticeable welt on her head after getting into a scuffle with Nicki's crew). Hours after that episode aired, Cardi switched on selfie mode to go on a rant in which she accused Nicki of \"playing the victim,\" among other things. \"You need to pick a side, do you want to be the victim or do you want to be the gangster? You lie so much you can't even keep up with your fucking lies,\" Cardi said. Among Cardi's other grievances? For one, she didn't like Nicki's \"Motorsport\" lyric that implied Nicki was her \"coach.\" The Invasion of Privacy rapper also vehemently shot down Nicki's accusation that she used payola to rise to the top, saying, \"You don't understand why I am so fucking successful. ... Why is it that when people want to listen to me, you cannot believe it? That I got to be cheating for that?\"As for Nicki's claim that Cardi never showed her \"genuine love,\" the \"Money\" MC had this to say: \"That's crazy because when you pull up on my videos you see that I'm always showing you respect because you're somebody I listened to ever since I was in high school. … The difference between me and a lot of these bitches? I don't suck your dick. That's the difference. What you need to do is stop focusing on other people, focus on yourself, and focus on your craft because you're out here fucking up your legacy looking like a fucking hater.\"For what it's worth, Minaj said during Monday's Queen Radio episode that she wants to \"move past\" the Cardi drama, and ultimately, her rival claims to want the same thing. She finished her multi-video rant by saying, \"I'm tired of talking about it too. ... We could talk about it or we could fight it out. I'm with whatever. But I'm sick of that back and forth shit. I'm not doing it.\"Buckle in and see all of Cardi's videos below.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}