{"id": "\n\n                The Skater Kids of Mid90s Keep It Real In Jonah Hill's Directorial Debut\n              \n\n", "paragraph": "\n              Sunny Suljic, Na-Kel Smith, and Olan Prenatt are tired of fake skater movies\n        \n          There's a scene in Jonah Hill's Mid90s when young Stevie (Sunny Suljic) successfully lands his first ollie after weeks of repeatedly practicing, and falling, in the driveway. It's the middle of the night, but he doesn't care; he screams and jumps around in pure, raw elation, throwing his board with reckless abandon. It's a specific feeling, landing your first trick, one that only someone who's spent time on a board — and stuck inside their own head — can understand. (For Suljic, it was the first time he nailed a kickflip.) It's what makes Hill's surprisingly sincere directorial debut such an achievement. He made a film about his own experience growing up in Los Angeles in the '90s, when skateboarding was a grimy subculture for social outcasts, teenage misfits, and broken kids from broken homes. Thirteen-year-old Stevie is a lonely kid whose attempts at connecting with his violent older brother (Lucas Hedges) are often met with the elder's fists. But everything changes when he befriends a group of burnouts at the local skate shop, Motor Avenue, and picks up a board. That authenticity was key to Hill — and to the film's young cast, most of whom were scouted at local skate parks around the Los Angeles area with the help of co-producer and skate consultant Mikey Alfred.Alfred, the 23-year-old creator of skate brand Illegal Civilization, introduced Hill and Hedges to 11-year-old Suljic at Stoner Skate Plaza. Suljic was small for his age — perfect for scrappy young Stevie — and he could really skate, having picked up a skateboard at age four. \"The auditions were more of a rehearsal,\" Suljic, now 13, told MTV News at the A24 offices in New York City. Hill, he said, just wanted to get a sense of everyone's chemistry, and to prove his own skate cred to the cast, he landed a perfect kickflip the first day of shooting. In the film, it doesn't take long for Stevie to be accepted by the crew: charismatic Ray (Na-Kel Smith, a pro skater), who dreams of going pro; loudmouth Fuckshit (Olan Prenatt), who doesn't see the point in dreaming at all; quiet Fourth Grade (Ryder McLaughlin), who films the group's exploits; and try-hard Ruben (Gio Galicia), who brought Stevie into the group so the guys would have someone else to rag on. But in real life, they were already friends. \"We were just fucking around, trying stuff,\" Smith said of the audition process. For Prenatt, another local skater from Venice, it was a similar vibe. \"Mikey brought me into the audition,\" he recalled. \"I didn't know anything that was going on. I just sat down and talked with Jonah and told him a story about how I used my girlfriend's ID to get into somewhere, and we just started laughing. I guess he forgot to audition me.\" \"I went into it just wanting to do the best job possible to not embarrass myself or embarrass anybody who was part of the movie,\" Smith added. \"Then I got good feedback, and everybody was telling me, 'You did a good job.' And I was like, 'Bro, I honestly don't know what the fuck that means.'\" For Hill, the challenge wasn't teaching a group of skater kids to be actors; it was bringing everyone else in the cast to their raw, emotional level, stripping away years of polish. \"I had never acted before, so I never understood, like, this is a good performance,\" Smith said. Although they're not playing themselves — Suljic will be the first to tell you that he's nothing like meek Stevie — Hill found performers who could tap into something real and lived-in. \"After we finished it, I was like, 'Damn, acting is tight. I really acted in a movie,'\" Smith said. \"But after [the premiere], I was like, 'I got to do another one.' I want to continue to push this and see how far I can take it.\" \"Fuck yeah,\" Prenatt added.  As with most coming-of-age stories, especially ones about young people on the periphery, there's a thrill to finding this kind of human connection — even when things get awkward. When Stevie has his first sexual experience with an older teenage girl who knowingly tells him that he's \"at that age before guys become dicks,\" it's uncomfortable to watch. He's terrified. He doesn't actually enjoy the experience until he tells his friends about it, eliciting cheers, high fives, and crude jokes. \"Everyone has gone through those cringey moments,\" Suljic said. \"When you have your first kiss, it's always super awkward and not natural. It would be kind of weird if it wasn't.\" But Mid90s also doesn't shy away from the suffocating ennui that makes adolescence so unbearable; for Stevie, the scars and bruises remain long after the physical wounds heal. Suljic navigates Stevie's turbulent mental state with a sense of weariness that only a an actual teen could possess.  \"All of the those scenes have different feelings and different emotions attached to them, so it's all about digging deep,\" he said. \"It's hard acting everything.\" Although his biggest challenge wasn't Stevie's emotional turmoil or getting pummeled by Hedges; it was pretending to be a bad skateboarder, at least in the beginning. \"I've been skating for so long, so it's kinda weird for me to act bad,\" he said. That being said, Mid90s really isn't about the quality of the skating, but rather the feeling you get when it's just you, the board, and a couple of friends hitting the pavement. When Ray tells Stevie about his younger brother's death, he explains how he could barely get himself out of bed for weeks — until Fuckshit \"literally dragged me out of bed and made me go skate.\" It's the only thing that made him feel like himself again. So, when Stevie gets lost in his own dark thoughts, it's Ray who pulls him out and makes him skate. \"When I first started skateboarding, no one understood why I did it,\" Smith said. \"But now my mom can watch Mid90s and know what I was going through at that age. It's just really good to see it portrayed in a real way and not like, sick dude!\"© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}