{"id": "\n\n                Would Sabrina Spellman And Cheryl Blossom Be Friends? An Investigation\n              \n\n", "paragraph": "\n              What happens when the most powerful women of Riverdale and Greendale meet\n        \n          BEWARE: Minor plot spoilers for Chilling Adventures of Sabrina below.It’s no secret that Riverdale creator Roberto Aguirre-Sacasa has long hoped for a crossover  between the kitschy teen soap and his newest creation, Chilling Adventures of Sabrina. Even after The CW passed on Sabrina and it landed on Netflix, he’s still holding out hope for some kind of meeting between the neighboring towns and their curious teens. “I would hate if there was no way possible for there ever to be a crossover,” he told Entertainment Weekly ahead of Sabrina’s premiere.But what would happen if these two groups met? It seems safe to say that Sabrina Spellman would get along with the Core Four — Archie Andrews, Veronica Lodge, Betty Cooper, and Jughead Jones — because all five characters are generally agreeable and welcoming. But what about Sabrina’s potential relationship with Riverdale’s fieriest resident, Cheryl Blossom?Let’s examine, starting with a look at the two teens’ demeanors.Meet Sabrina, Meet CherylSabrina is a cheery 16-year-old firmly and comfortably on the outskirts of the typical high school social food chain. She’s not a popular kid, not a brainiac nor theater kid nor loner. She’s simply Sabrina.Her ability to sympathize is incredibly strong, making her kind and loving. That is, until someone crosses her. In that case, Sabrina is completely unafraid to stand up to her nemeses and is keen to use magic to do so. (A prime example of this behavior was when she doused Principal Hawthorne in spiders because he wouldn’t take action against the jocks who were terrorizing her mortal best friend, Susie.)Meanwhile, on the other side of Sweetwater River, Cheryl is sitting pretty as a Queen Bee of Riverdale High. Everyone knows her, and everyone knows to stay out of her way. It may take some finesse to get on her good side, but once you’re there, she will shoot her bow and arrow with Robin Hood-level accuracy to protect you from your enemies.The two share a to-the-death commitment to their friends, which is a promising sign for their own friendship — as long as Sabrina and Cheryl can reach that level of companionship. But friendship is a two-way street, so there are two questions we need to answer before coming to any kind of conclusion: Would Sabrina Like Cheryl?Sabrina would definitely admire that Cheryl is strong-willed and can take care of herself — qualities she values — but she might have a difficult time looking past Cheryl's tough exterior to actually like her upon first meeting.Over time, however, as Sabrina learns more about Cheryl’s past with her family and the forced suppression of her sexuality, her sympathetic nature would likely take the wheel. Sabrina loves an underdog overcoming the odds, after all. (See: her entire friend group, Susie, Ros, and Harvey, all of whom come to grips with their destiny during the course of the season.)On Sabrina's end, her potential for friendship with Cheryl could be comparable to her relationship with fellow witch Prudence, another strong-willed female. Things between Sabrina and Prudence started out tense, to put it mildly. Their journey was something like this: They both tried to kill each other, Sabrina figured out details of Prudence's past and saved her from cannibalization, Prudence helped Sabrina bring back the dead, and Sabrina joined Prudence's clique.There were some vicious ups and downs, but in the end, Sabrina proudly walked alongside her one-time bully, so it goes to reason that with patience and understanding, the teenage witch would like the River Vixen — particularly after Sabrina decides to embrace her own dark side and can fully empathize with Cheryl’s taste for darkness.Would Cheryl Like Sabrina?Whether Cheryl would like Sabrina is a little trickier because, well, does Cheryl truly like anyone not named Toni Topaz? There is one immediate pro for Sabrina: Cheryl would approve of the red in Sabrina’s wardrobe. Sharing a signature color shows that they have similar preferences and ensures that their outfits would never clash, and Cheryl does love a look. At the very least, it doesn't hurt.Superficial aspects aside, Cheryl might be put off by Sabrina’s tendencies to always do the “good” thing, since Cheryl is typically more interested in the good-for-Cheryl thing — like boosting her academic résumé by snagging Archie’s student council presidency while he’s in juvenile detention rather than letting Veronica keep his seat warm. Cheryl’s initially contentious relationship with good-girl-next-door Betty Cooper comes to mind as a comparison.But once she learns of Sabrina’s penchant for revenge and witchy powers, Cheryl would be on board — if only because Cheryl seems to have witchy powers of her own. (Let’s not forget the Kiss of Life she bestowed upon Fred Andrews after he became the Black Hood’s first target!) For Cheryl, having Sabrina's powers on her side could be, at the very least, an opportunity to boost her own — and like Sabrina, Cheryl craves power.So, Would Sabrina And Cheryl Be Friends?There may be some hesitation on both sides at first, but once they get to know each other a bit, Sabrina and Cheryl could have dynamic duo potential, amplified by their (probably) shared powers. One thing is for sure: If that crossover between Riverdale and Chilling Adventures of Sabrina does end up happening, let’s hope it's not at the stroke of midnight — the witching hour.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}