{"id": "\n\n                Nicki Minaj Literally Has Tyga In The Palm Of Her Hand In Stylish New Video\n              \n\n", "paragraph": "\n              The 'Dip' clip is a real trip\n        \n          Quick! How many guest verses has Nicki Minaj racked up in 2018? The answer, surprisingly, is not as many as last year — but still quite a few. And they run the gamut of vibes, too, from more traditional sexy pop with Little Mix (\"Woman Like Me\") and Ariana Grande (\"The Light Is Coming\") to harder hip-hop with Post Malone (\"Ball With Me\") and YG and others (\"Big Bank\"). She even did a song with BTS! Remember?Nicki's newest feature arrived on Monday (October 29) and comes courtesy of Tyga. \"Dip\" even finds the pair nodding to Michael and Janet Jackson's iconic \"Scream\" music video with harsh and surreal futurism, like an invisible ghost playing a violin and the general feeling of being in a haunted space station. Spooky stuff.Throughout the vid, Tyga appears as an anthropomorphic puppet being handled by Nicki herself. When he's not, he floating through the ether rapping couplets like \"Sip got me buzzin', I am not a husband / I can be your daddy, 'cause I am a motherfucker\" while Nicki conveys a lot with just a hard stare. When she steps up to the mic, though, she takes her turn to let it go: \"Harper's Bazaar, I'm covering the icon issue / I got issues, yeah bitch, I got issues / W, Vogue, Cosmo (I got issues).\"Tyga and I coordinated fucking well for this video, you would think we put the looks together,\" Nicki revealed on Queen Radio recently, via Rap-Up. \"All we did was put the colors together. The video is clean and fly as fuck. I've shot huge big-budget videos before that didn't look like that. He's extremely fucking talented.\"Watch the full thing above, and then go back and revisit the Mark Romanek classic \"Scream\" below.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}