{"id": "\n\n                9 Moments In Monsta X’s ‘Shoot Out’ Video I Can’t Stop Thinking About\n              \n\n", "paragraph": "\n              These men and their vibrating pecs are driving me crazy \n        \n          The seven members of K-pop group Monsta X don't simply ask for your attention; they demand it. Their latest single, \"Shoot Out,\" is no exception. It's loud and aggressive — reminiscent of the septet's earlier work on songs like \"Trespass\" — with a thundering beat, slick pop-rock chorus, and sensual visual. And it's been stuck in my head since it dropped last week. \"Walker walker walker growling\" is extremely catchy, OK? \"Shoot Out\" is the bombastic lead single off the group's sophomore album, Take.1 Are You There?, and its striking visual hints at themes of darkness and light. The sumptuous music video also highlights what makes Monsta X one of the more compelling acts in K-pop at the moment: their duality. They're equal parts dangerous and playful with an in-your-face energy that refuses to be ignored. They serve angst with chokers, harnesses, faux eyebrow rings, and smoldering stares, while wearing unbuttoned coveralls (sans undershirts, hallelujah) and magically shaking their exposed pecs in a way that I didn't think was humanly possible. Seriously. What sorcery is this, Shownu?  The group is composed of charismatic rappers Jooheon and I.M and vocalists Shownu, Wonho, Minhyuk, Hyungwon, and Kihyun (who completely owns the hook on \"Shoot Out\"). And here they are on the way to my funeral after completely wrecking me with Wonho's lip ring chain and that gyrating hip choreography: And because I love to suffer, here are just a few of the moments I can't stop thinking about from the \"Shoot Out\" music video: Gorgeously lit and artfully styled, Hyungwon's throne room is the video's most alluring set piece. It also helps that he looks like actual royalty. Here's hoping that berry lip tint is part of the official Tonymoly x Monsta X collab. I feel so personally attacked by this jewelry. First Baekhyun, now Wonho?! Rude. It's what he deserves after serving on that hook. Also, this BDSM-lite styling is something only Monsta X can convincingly pull off. These stylists deserve a raise. The entire concept of the music video plays with shadow and light; some scenes are overexposed, while others are bathed in darkness. Visually, it's not an easy aesthetic to pull off, but the director does a solid job of making it all cohesive. And it's fun to see the group's resident mood-maker, Minhyuk, get a little moody. Not that I condone censoring Jooheon's spitfire verses, but the man looks really good in a muzzle. Honestly, these men all need to be locked up after this video. Excuse me, sir. Who gave you permission to enter a room like this? Are Monsta X single-handedly saving the mesh fabric industry? The answer is yes. The rap line's growls and confident ad libs are great throughout the song, but youngest member I.M's swagger is so undeniably effortless. What else is there to say? Monsta X is out here in leather, mesh, and chains serving disco moves. Monbebes (their fans) are so lucky. © 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}