{"id": "\n\n Ex On The Beach Is Returning -- With Farrah Abraham On Board\n              \n\n", "paragraph": "\n              Find out who else will on the MTV dating show beginning December 20\n        \n          \"Oh f*ck\" is right. Ex On the Beach, featuring unassuming singles and their former flames showing up to shock them, is returning for Season 2 on December 20. Hosted by multi-platinum rapper and actor Romeo Miller, the infamous dating series follows reality stars -- from Are You The One?, The Bachelorette, Bad Girls Club, Big Brother, The Challenge, Survivor and Teen Mom (to name a few) -- as they search for new love while being blindsided by their past romances. The sexy/dramatic water entrances are back.And in the first look below, a familiar MTV face isn't too pleased about what's unfolding in hell paradise.\"Are you okay?\" Farrah Abraham angrily asks a mysterious man.But there's more -- and the cast isn't exactly getting along swimmingly. Check out the teaser, then keep up with MTV News as we approach the show's premiere on Thursday, December 20 at 8/7c. And check out the entire cast list below!The Singles:•\tFarrah Abraham — Teen Mom, Couples Therapy, Celebrity Big Brother, and Marriage Boot Camp•\tChad Johnson — The Bachelorette, Bachelor in Paradise, Famously Single, and Celebrity Big Brother•\tAngela Babicz — The Challenge, Bad Girls Club and Ex On The Beach•\tJozea Flores — Big Brother and The Challenge seasons Champs vs. Stars and Final Reckoning•\tMorgan Willett — Big Brother: Over the Top•\tCheyenne Parker — Fire Island•\tMaya Benberry — Catching Kelce•\tCorey Brooks – Big Brother•\tNicole Ramos — The Challenge seasons Battle of the Bloodlines, Rivals III, Dirty 30 and Vendettas•\tMalcolm Drummer — Are You The One?•\tJanelle Shanks — Bad Girls ClubThe Exes:•\tSimon Saran — Teen Mom•\tTor’i Brooks —  Ex On The Beach•\tNelson Thomas — The Challenge and Are You The One?•\tNurys Mateo — Are You The One?•\tDiandra Delgado — Are You The One?•\tMurray Swanby — What Happens at The Abbey•\tCory Zwierzynski — What Happens at The Abbey•\tJay Starrett — Survivor•\tMonte Massongill — Big Brother•\tJD Harmon •\tSha Carrell •\tDarian Vandermark •\tNate Sestok •\tMaddie Sullivan•\tKareem Peterson•\tPerez Corothers•\tRob Tini© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}