{"id": "\n\n                Anderson .Paak Expresses His Regrets Over Mac Miller's Death On 'Cheers'\n              \n\n", "paragraph": "\n              The jazzy song also features a Phife Dawg tribute from Q-Tip\n        \n          Since Mac Miller's death in September, Anderson .Paak has been one of the more vocal supporters of the late rapper, paying tribute to him onstage on more than one occasion. Now, .Paak has put his feelings about Mac's death on wax, mentioning his former collaborator in a song from his newly released third album, Oxnard.The track in question, \"Cheers,\" is a buoyant but mournful cut featuring Q-Tip and co-produced by Dr. Dre. In the first verse, .Paak ruminates, \"Shit, music business movin' too fast for me / Wishin' I still had Mac with me / How do you tell a n---a slow it down when you livin' just as fast as 'em?\" The production is jazzy and upbeat, but .Paak's words or anything but: \"Tears keep fallin' down my eyes / Damn it, I miss you, I should be with you.\"Q-Tip jumps in for the song's third verse, and he opens with a couple bars nodding to the late Phife Dawg, his bandmate and brother in A Tribe Called Quest. \"I don't know what to do but reminisce and face the pain / Back in the day before you were a dog and you were just pup,\" he raps, before echoing .Paak's thoughts about the lows that seem to follow the highs of fame. \"So sick of sendin' flowers to all my of brother's mommas / Don't know what's harder, fightin' trauma or keepin' a promise.\"Though .Paak and Miller only released one song together, 2016's \"Dang!,\" they managed to become close friends. .Paak made a few tributes to Miller leading up to Oxnard's release, including an Instagram post a few days after Miller's death on September 7. The Cali MC also honored Mac by performing \"Dang!\" at a tribute show on Halloween, and by saying onstage at the BET Hip Hip Awards, \"Legends never die. And Mac Miller not was, but is a whole legend.\"© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}