{"id": "\n\n                2018 MTV EMA Winners: See The Full List\n              \n\n", "paragraph": "\n              Camila Cabello heads into the show as most-nominated, with Ariana and Post Malone close behind\n        \n          Camila Cabello headed into the 2018 MTV EMA as the most nominated artist, with six noms, and she proved to be nearly unstoppable, walking away with four statettes. But the EMA are nothing if not unpredictable — host Hailee Steinfeld summed it up best when she said \"anything can happen\" — so those shiny trophies could have found a home with any of your fave artists: Ariana Grande and Post Malone had trailed close behind Camila in nominations with five apiece.The star-studded awards show featured explosive live performances from Nicki Minaj, Halsey, Little Mix, Panic! at the Disco, Alessia Cara, and more. Not to mention, Global Icon Award recipient Janet Jackson who hit the stage in Bilbao, Spain for a memorable performance.We've tracked all of the winners, including key categories like Best Song, Best Video, and the especially stacked Best Artist. Keep it locked here as the winners are announced Sunday night (November 4) — and catch the celebration at 7pm ET on MTV or stream on MTVEMA.com!BEST ARTISTAriana GrandeWINNER: Camila CabelloDrakeDua LipaPost MaloneBEST VIDEO  Ariana Grande — \"no tears left to cry\"  WINNER: Camila Cabello — \"Havana\" ft. Young ThugChildish Gambino - \"This Is America\"Lil Dicky — \"Freaky Friday\" ft. Chris Brown      The Carters — \"APES**T\"BEST SONG Ariana Grande — \"no tears left to cry\"Bebe Rexha — \"Meant To Be\" ft. Florida Georgia LineWINNER: Camila Cabello — \"Havana\" ft. Young ThugDrake — \"God's Plan\"Post Malone — \"rockstar\" ft. 21 SavageBEST POPAriana GrandeCamila CabelloWINNER: Dua LipaHailee SteinfeldShawn MendesBEST NEWAnne-MarieBazziWINNER: Cardi BHayley KiyokoJessie ReyezBEST GROUPWINNER: BTS 5 Seconds of SummerPRETTYMUCHBEST LOOKWINNER: Nicki MinajCardi BDua LipaMigosPost MaloneBEST HIP HOP  Drake   Eminem               MigosWINNER: Nicki Minaj Travis ScottBEST LIVE Ed Sheeran        Muse   P!nkWINNER: Shawn MendesThe CartersBEST ROCK WINNER: 5 Seconds Of SummerFoo FightersImagine DragonsMuseU2         BEST ALTERNATIVE  Fall Out BoyWINNER: Panic! At The Disco  The 1975Thirty Seconds To Marstwenty one pilots            BEST ELECTRONIC Calvin HarrisDavid GuettaWINNER: MarshmelloMartin GarrixThe Chainsmokers          BIGGEST FANSWINNER: BTSCamila CabelloSelena GomezShawn MendesTaylor SwiftBEST WORLD STAGE  Clean Bandit — MTV Crashes Plymouth, UK 2017Charli XCX — MTV Crashes Plymouth, UK 2017David Guetta — Trafalgar Square, UK 2017Jason Derulo — Isle of MTV Malta 2018Post Malone — Wireless Festival, UK 2018Migos — Wireless Festival, UK 2018J Cole — Wireless Festival, UK 2018Nick Jonas — MTV Spotlight @ Hyperplay, Singapore 2018WINNER: Alessia Cara — MTV Spotlight @ Hyperplay, Singapore 2018BEST PUSH PRETTYMUCH (October 2017)    Why Don't We (November 2017 )WINNER: Grace VanderWaal (December 2017)      Bishop Briggs (January 2018)      Superorganism (February 2018)Jessie Reyez (March 2018)           Hayley Kiyoko (April 2018)Lil Xan (May 2018)           Sigrid (June 2018)            Chloe x Halle (July 2018)               Bazzi (August 2018)        Jorja Smith (September 2018)    BEST U.S. ACT (BEST LOCAL ACT)Ariana GrandeWINNER: Camila CabelloCardi BImagine DragonsPost Malone© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}