{"id": "\n\n                Beyoncé Recreated A Timeless Album Cover For Her Latest, Greatest Halloween Costume\n              \n\n", "paragraph": "\n              World, meet 'Phoni Braxton'\n        \n          Halloween hasn't even happened yet, and Beyoncé's already won it.Sure, there were some commendable shots at the costume crown over the weekend — like Halsey's nearly naked Poison Ivy and Harry Styles's blinged-out Elton John — but none were quite so meticulous and unique as the one Bey just showed us.On Halloween Eve (October 30), Beyoncé unveiled her instantly iconic costume on Instagram, which finds her paying homage to R&B superstar Toni Braxton. The photo shoot comes with an amazing alias, \"Phoni Braxton,\" and finds Bey styled with the pixie cut and leather jacket found on the cover of Braxton's 1993 self-titled debut album, as well as the album's lead single, \"Another Sad Love Song.\"A post shared by Beyoncé (@beyonce) on Oct 30, 2018 at 12:52pm PDTA post shared by Beyoncé (@beyonce) on Oct 30, 2018 at 12:53pm PDTBeyoncé proclaimed her love for Braxton in a written tribute, captioning one of the posts, \"Sending love and adoration to one of our talented legends. Thank you for the countless bops. Your tone, your beauty, your range, and your God-given talent is treasured. Loving you always. Have a Happy Halloween my Kings and Queens.\" Sending love and adoration to one of our talented legends. Thank you for the countless bops. Your tone, your beauty, your range, and your God-given talent is treasured. Loving you always. Have a Happy Halloween my Kings and Queens.A post shared by  Beyoncé (@beyonce) on Oct 30, 2018 at 12:51pm PDTThis isn't the first time Beyoncé's honored her musical heroes for Halloween — she was Janet Jackson back in 2014, Salt-N-Pepa in 2016, and last year, she and Jay-Z dressed up as Lil' Kim and Biggie, respectively. No word yet on what Jay, Blue Ivy, Sir, or Rumi's costumes will be this year (maybe Jay will go as Braxton's fiancé, Birdman?!), but as always, Beyoncé's set the bar way, way high.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}