{"id": "\n\n                John Green's Looking For Alaska Series Has Found Its Alaska And Miles\n              \n\n", "paragraph": "\n              'It's all starting to feel very real!'\n        \n          Looking for Alaska has found their Miles and Alaska! Author John Green announced the long-awaited news on Tuesday (October 30).The main protagonist, Miles — a Florida teen who enrolls in an Alabama boarding school in search of his \"Great Perhaps\" — will be played by Charlie Plummer, while the titular Alaska — his unpredictable love interest with a complicated past — will be played by Kristine Froseth.\"I spoke to Kristine and Charlie on the phone yesterday and it was really special to have a conversation with the people who will become Miles and Alaska,\" Green wrote on Twitter. \"I'm so grateful to them and to everyone involved with the Looking for Alaska series. It's all starting to feel very real!\" Green also called Plummer and Froseth \"truly brilliant\" in the roles.Froseth and Plummer took to Instagram to share their own happy thoughts about the news. \"I can’t put into words how I am feeling right now. #LookingForAlaska is an important story that has been so close to my heart since I first read this beautiful book when I was 13,\" the actress wrote, while the actor sweetly reflected, \"Dreams coming true today:) I’ve loved this novel and these characters for years and I’m beyond excited and honored to be a small part of the team that’ll bring them to life.\"Both stars have gained recognition for recent roles, with Plummer portraying John Paul Getty III in Ridley Scott's All the Money in the World and Froseth bursting onto the scene as Veronica in Sierra Burgess Is a Loser.Alaska was Green's first novel and Hulu's upcoming limited series has been 13 years in the making. He has since published six more novels and turned two of them — The Fault In Our Stars and Paper Towns — into movies. His latest novel, Turtles All The Way Down, is also currently being adapted into a movie.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}