{"id": "\n\n                The Chainsmokers Get Wistful On 'Beach House,' A Song About Listening To Beach House\n              \n\n", "paragraph": "\n              One final neon sunset\n        \n          Beach House is a band from Baltimore that makes swirling, melty dream-pop perfect for a number of occasions including but certainly not limited to watching a sunset, contemplating the nature of existence, and lying on your floor. \"Myth\" is an all-timer. Kendrick Lamar sampled their drowsy, whimsical \"Silver Soul\" for \"Money Trees\" in 2012.The Chainsmokers likely know all this. Their new single, \"Beach House,\" begins with Drew Taggart singing, \"Woke up on the west side / Listening to Beach House, taking my time.\" When the song hit on Friday (November 16), the duo tweeted that they were \"listening to a lot of [B]each [H]ouse\" when they made it.These guys like Beach House, it would seem. \"Beach House,\" however, does not sound like Beach House. \"Beach House\" sounds like a prototypical Chainsmokers track, lyrically charged with sexual energy and complete with a big beat drop right after the hook. That same tweet revealed that Taggart and his partner, Alex Pall, \"tried to get back to our roots on this with that classic OG Chainsmoker feel.\"And it's true — \"Beach House\" is very festival-ready, like all the group's biggest hits. Its breakdown resembles \"Closer,\" their juggernaut EDM-lite pop smash with Halsey that topped the Hot 100 chart for 12 weeks a few years ago. Genetically, it's much airier than the chaotic \"Sick Boy,\" which is the right move for a song called \"Beach House\" that references the band Beach House.It should be noted for posterity that Beach House have no comment on the song, as their reps told Pitchfork earlier today. You can listen to \"Beach House\" above, and then listen to Beach House's cosmic latest album, 7, below.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}