{"id": "\n\n                Will The New Jersey Shore House Bring A Fresh Start...Or The Same Old Drama?\n              \n\n", "paragraph": "\n              All seems calm in the Garden State (for now)\n        \n          Could the Jersey Shore gang be embarking on calmer waters now that they've secured a bougie new set of digs in their home state?With the Miami heat, Vegas drama and Atlantic City beef a distant memory, all certainly seems chill as a pickle (Snooki reference) on the latest leg of the crew's family vacation -- starting with the gang's ultra-luxe residence, courtesy of Nicole.\"I just want our house to be amazing,\" she shared of her New Jersey Craigslist find. \"We gotta have fun. You live on the water, you have a boat, you have a jet ski. This house is dope.\"But there was just one problem.\"Where's the beach? We're not on the ocean,\" she noted. \"The backyard is beautiful. It goes for miles and miles, but there's no beach. No waves. No sand. No boats. F*ck me.\"No matter. There's a massive pool, perfect for backflips and belly flops (hey, Vinny). But does choppy water (aka the drama of yore) await?Ron said the bickering with Jen is \"better than it was,\" and the only official beef we've caught wind of is between Angelina and her fiancé... and maaaybe Snooki and those vodka sodas. As for Ang? \"Me and Chris have a lot of stuff to talk about because we are very bad right now,\" she admitted. \"But this is my vacation right now away from my other life. Let me give him some space, let me get some space and hopefully it will make all of this drama go away for a little bit.\"Call us crazy, but perhaps it's all that sexual tension (and never-ending innuendo) between her and Vinny. As for Dren Snooki, she's just sticking to the spiral squad's usual mission: \"We're here to get away from our problems, so let's enjoy ourselves and get drunk.\"So will the drama continue to lay low in Manalapan, or is it just ramping up? Sound off with your thoughts, and catch Jersey Shore: Family Vacation Part 2 every Jerzday Thursday at 8/7c.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}