{"id": "\n\n                All My Faves Really Be Out Here Like Stick Figures And Emojis\n              \n\n", "paragraph": "\n              Including Hayley Kiyoko, PRETTYMUCH and 5SOS\n        \n          A picture can say a thousand words but, as it turns out, emojis can say even more -- especially when they're combined with slashes and underscores to recreate your faves. After weeks of Twitter users turning themselves (and Australians) into stick figures, the trend has made its way to the stans.As the stans continues to make their faves with emojis and stick figures, here are some of the best recreations out there.5 Seconds of SummerThe 5SOS stick figures struck such a chord that Luke Hemmings, portrayed as the tallest stick figure imaginable, retweeted the recreation.Hayley KiyokoConsidering Hayley's been pushing her #20GAYTEEN agenda all year long -- including yelling her catchphrase after winning big on the VMAs red carpet -- it's no surprise her stick figure does the same.David DobrikWith hat, vlogging camera, laptop and a burrito in hand, there's no mistaking this YouTuber stick figure as anyone other than David.Jack & JackIn case you couldn't tell the difference between the Jacks, the Jack Gilinsky (left) and Jack J (right) stick figures might help.Mason RamseyFrom yodeling at Walmart to performing an original song on TRL, Mason has kept his country boy image the same, even in emoji form.Trixie MattelQueen of big hair and big floral, it's almost concerning how close-to-accurate this recreation of Trixie is.Brendon UrieIs that a pianist stick figure with two dogs or is that Panic! At The Disco frontman Brendon Urie in the flesh? I'm honestly not quite sure.PRETTYMUCHThe height discrepancy between Zion and Edwin has PRETTYMUCH fans screaming at their stick figure recreations.Tom HollandIf you know that Tom has a peace sign in his Instagram bio and is Marvel's current Spider-Man, then you'll know this stick figure is highly on brand.Frank OceanAll has been quiet in Frank's world, and with little presence on social media, he's nowhere to be seen in his recreation.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}