{"id": "\n\n                Ariana Grande Turns Into Elphaba, Kinda, To Sing A Wicked Favorite\n              \n\n", "paragraph": "\n              Plus, a truly heavenly rendition of 'God Is a Woman'\n        \n          A few weeks ago, after ending her engagement to Saturday Night Live star (and song namesake) Pete Davidson, Ariana Grande posted a notable message to Instagram. \"Can't believe I almost let my anxiety ruin this for me today!!!\" she wrote while posing in Elphaba-green makeup. \"Not today Satan. Not tomorrow or the next day either not no more u can suck my big green dick. Finna sing my heart out and be a big walking vessel of love bye.\"In addition to the words being a fierce declaration of self-care, Ari was referring to her appearance on NBC's A Very Wicked Halloween show that aired Monday night (October 29). On it, she belted \"The Wizard and I\" in a green dress to an audience of mini witches and Dorothys. It's a very cute clip, especially because the singer's smile reveals just how big of a deal it was for her to be there — and she offered further proof via a pic with the OG Elphaba herself, Idina Menzel.It's also just nice to see Ariana back onstage. After taking a brief break from the spotlight this fall (including a canceled appearance on SNL), she's fully back now, preparing for her upcoming ambitious Sweetener tour in 2019. And ahead of that, she's also sharing even more performance footage to get Arianators pumped.For example, a full orchestra-backed \"God Is a Woman\" rendition that makes Ari the center of a moody storm that keeps rising and rising. It's wonderful!This lush, densely orchestrated \"God Is a Woman\" version is from Ari's upcoming special Ariana Grande Live At the BBC, which she recorded in September and which is due to air next month. Rolling Stone reports Ari and the crew of musicians tackled ever Sweetener track at the show, as well as \"Dangerous Woman,\" \"Love Me Harder,\" and her excellent cover of Thundercat's \"Them Changes.\"If the Sweetener shows are anything like this, fans may have to make sure their feet are firmly planted on the ground so they don't literally float away. Check out both performances above, and make sure you prepare yourself for November 1, when Sweetener tour tickets go on sale.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}