{"id": "\n\n                Can Brianna And Her Young And Pregnant Family Survive In Oregon?\n              \n\n", "paragraph": "\n              Their new life on the West Coast isn’t going as planned -- to say the least\n        \n          When Brianna decided on Teen Mom: Young and Pregnant to move from Wisconsin to Oregon with her son and her boyfriend, it seemed like a good idea. The group (including Brianna's mother Jessica) would start over in a new city and have lots of help with Baby Braeson. But Brianna quickly realized that their new life wasn’t what she expected.On this week’s episode, the family settled into their destination after a very long road trip (and a sad goodbye to Bri’s sister Vanessa). However, they arrived with nowhere to live — they were staying at an Airbnb indefinitely — no jobs lined up, and no real solid plan of what would happen next.To add to the situation, Robert still needed to finish high school and Brianna wanted to start college, but the couple couldn’t even consider schooling until they got jobs and an apartment.After an unsuccessful employment search, Brianna and Robert talked with Jessica, who said “not finding jobs is not an option” and they all must do everything they can to get back on their feet. If it took longer than anticipated, she said, “We’re going to have to just sell the car just so we can buy food.”Brianna was frazzled by the whole situation, both for her sake and for Braeson’s.“This sh*t sucks,” she said. “I think we should’ve stayed in Milwaukee. Initially, when we said yes, I  thought we’d be coming here to an apartment. But now that we’re here, we’re in an Airbnb, no jobs. It’s a lot of stress.”Unfortunately, moving back to Milwaukee isn’t an option because the family spent all their money getting to Oregon, so what’s next for them? Will they make it work on the West Coast and, if not, where will they live? Tell us your predictions, then keep watching Young and Pregnant Mondays at 10/9c.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}