{"id": "\n\n                6ix9ine And Kanye Were On Video Set Reportedly Hit By Drive-By Shooting\n              \n\n", "paragraph": "\n              Nicki Minaj was also due be in the vid. No one was hurt.\n        \n          A music video film set with controversial young rapper 6ix9ine and Kanye West was interrupted by gunfire on Thursday night (November 8), TMZ reports. No one was harmed, though reportedly eight shots were fired at the rented $80 million Beverly Hills estate while the pair were inside.Nicki Minaj was due to arrive on set to be in the video as well — for a song featuring the three of them due to appear on 6ix9ine's upcoming album — though she was reportedly not there at the time of the shooting. Kanye apparently left immediately after. TMZ has reported it as a drive-by shooting.It's not the first time 6ix9ine has dealt with violence. The 22-year-old rapper, who previously pled guilty to using a child in a sexual performance but avoided any jail time, was arrested in July for allegedly assaulting a 16-year-old at a mall in Houston.Shortly after, 6ix9ine was reportedly kidnapped, beaten, and robbed of jewelry and money in New York City. His collaboration with Nicki, \"Fefe\" — which Minaj later performed at 2018 VMAs without 6ix9ine — had just come out days earlier.And in late October, one of 6ix9ine's bodyguards was reportedly shot in the stomach after an altercation at a dinner in Manhattan. (Vulture compiled a handy timeline of the rapper's controversies as they wind into his career — you can check that out here.)No one from 6ix9ine's or Nicki's camps have weighed in publicly, though 6ix9ine's lawyer told TMZ it likely won't affect the rapper's probation as he was a victim. But on Friday, Kanye took to Twitter to report his safety. \"Thank you for everyone's prayers. Our family is safe and close,\" he tweeted.This is a developing story and we'll update as more information comes in.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}