{"id": "\n\n                All You Need To Know About K-Pop Group NCT 127 (Except Their Blood Type)\n              \n\n", "paragraph": "\n              An exhaustive guide to the irregular K-pop act \n        \n          Thanks to K-pop's growing visibility in the U.S., the cultural barriers that once prevented Korean artists from making it big in the West are being smashed one milestone at a time. As a result, a new generation of K-pop acts are trying to leave their mark in the history books. NCT 127 is the latest group to bring K-pop stateside with the release of their confident English debut, \"Regular.\" The 10-member group just dropped their first full-length release, Regular-Irregular, a sleek concept album that weaves a dual narrative between two worlds: reality (Regular) and fantasy (Irregular). It debuted at No. 86 on the Billboard 200, making NCT 127 the second-highest charting K-pop boy band in chart history. So what should you know about this group of Korean artists who are currently making waves abroad? Here's a very handy guide to NCT 127: What does NCT 127 mean? NCT stands for Neo Culture Technology, which are not three random words thrown together but rather an ambitious concept from SM Entertainment, the biggest record label in South Korea. The project aims to localize K-pop across the globe with region-specific groups, and NCT 127 is the Seoul-based unit. (127 refers to the longitude of Seoul. #TheMoreYouKnow) \"Culture Technology\" is a strategy designed by SM founder Lee Sooman. It's essentially a way to bring Korean pop music to the world, and NCT is the modern extension of that with its ever-expanding roster of international performers.There are currently 18 artists under the NCT fold and three established units: NCT 127, NCT Dream (a more playful rotational unit for NCT's teenage performers), and NCT U (a rotational group where songs are assigned to members based on who best fits the track). In June 2018, a new unit made up of NCT's Chinese members was announced. NCT China (working title) is set to debut later this year. There are also plans to expand the NCT brand to more countries in Asia — with a particular interest in Vietnam and \"V-pop\" — and even Latin America. What are their fans called? Fans of NCT are known as NCTzens (pronounced N-citizens), and the members will often affectionately call them \"Seasonies\" (\"Seasony is us saying that our fans are precious to us like the four seasons,\" they explained.) And here's hoping you like the color green. So, who's in the group? There are currently 10 members in NCT 127. Newest member Jungwoo made his official debut with the recent release of Regular-Irregular, and here they are looking like a bunch of handsome goth time travelers for their latest comeback: Despite being based in Seoul, the group is culturally diverse with members from the U.S. (Johnny, born in Chicago), Japan (Yuta), China (Winwin), and Canada (Mark). So let's get to know each of them a little better. Real name:  Lee Taeyong (nicknames: TY Track; Taebreze; Grandpa; 2D Taeyong) Role: Leader, Main Rapper, Main Dancer, Vocalist, Visual, Center Taeyong is so handsome that every Korean broadcast makes at least one reference to his \"2D\" good looks. (Because he looks like a manga character come to life.) But that's the least impressive thing about this 23-year-old performer. Known for his onstage swagger and ferocious flow, TY is an integral, if not intimidating, member of NCT — he's often featured in NCT U — and he's a bit of a wunderkind when it comes to rapping, singing, dancing, writing, and pulling off bold looks. But offstage, Taeyong can be quite soft; he's a perfectionist who cares for his members. And he has an unhealthy obsession with cleaning and Febreze (hence the nickname Taebreze). What to watch: Taeyong's magnetic performance in NCT U's \"The 7th Sense\" is a great introduction to him as an artist; and \"Yestoday\" finds TY laying his past regrets bare over a chill trip-hop beat. Did I mention that he's also adorable? And very good-looking. Real name: Moon Taeil (nicknames: Taeyomi; Strony; Shin Taeil) Role: Main vocalist The oldest (and shortest) member of 127, Taeil says he doesn't open up easily to his members, but he'll be the first to get emotional when his dongsaengs (little brothers) get sappy on him. The 24-year-old vocalist chose to pursue a career as an idol over attending university in 2013, a decision he agonized over for months. He's one of the strongest vocalists in NCT, and honestly, the honey-voiced idol was destined to soundtrack K-Dramas. And he brushes his teeth six times a day, which says a lot about his work ethic. That, and his love for acrostic poems, despite being hilariously bad at them. What to watch: His live vocals are insane — and he can play guitar. Not to mention, that high note in NCT U's \"Without You\" is beautiful. Real name: John Suh / Korean name: Suh Youngho (nicknames: Johnny-cal; One and Only; Daddy) Role: Lead Rapper, Lead Dancer, VocalistBorn and raised in Chicago before moving to Seoul to pursue his dream, Johnny spent nine years as a trainee at SM before debuting with NCT 127 in 2017's \"Limitless.\" (At one point, he even trained alongside a pre-debut EXO.) It's this dedication and drive that makes him such a fan-favorite among NCTzens. He's also a natural showman — he hosts \"NCT Night Night\" radio along with Jaehyun — with a surprising gift for applying eyeliner under pressure. What to watch: That time he explained the concept of \"daddy\" to Super Junior's Leeteuk is iconic (\"oh, daddy\"). He's also a striking visual who can seriously get down.Real name: Nakamoto Yuta (nicknames: Takoyaki Prince; Osaka Prince) Role: Main Dancer, Rapper, Vocalist, Winwin's #1 FanBorn in Japan, Yuta spent the majority of his adolescence dreaming of a professional soccer career. But after watching K-pop idol group TVXQ! perform on television, he decided to pursue singing instead. So he moved to Seoul at 17 to train with SM in 2012 and debuted four years later with NCT 127 in 2016's \"Fire Truck.\" His athleticism makes him a natural dancer, and the 22-year-old performer finally got to flex his vocal talent on Regular-Irregular. But it's Yuta's savage humor and confidence that make him so alluring. After all, this is a man who says one of his hobbies is reading comments of how handsome he is. What to watch: Have you ever seen someone eat a lemon this way? Also, Yuta's verse in \"Fire Truck\" deserves more attention. Real name: Kim Dongyoung (nicknames: Bunny; Wang Zeung) Role: Main vocalist Doyoung joined SM's pre-debut training team SMRookies in 2015 and debuted a little more than a year later with NCT U. But the vocalist didn't officially join the NCT 127 lineup until 2017 with the release of \"Limitless.\" He looks and sounds like an angel, but Doyoung has a very short fuse — and the members love to push his buttons. However, at the end of the day, Doyoung is the mom of NCT; he may nag, but he also gives the best hugs. It also doesn't take much to make him an emotional mess. What to watch: Doyoung's hook on \"Yestoday\" is a mood. His version of \"Beauty and the Beast\" is an even bigger mood.Real name: Jung Jaehyun / Jung Yoonoh (nicknames: Memory Manipulator; Valentine Boy)  Role: Lead Vocalist, Lead Dancer, Occasional Rapper, Mark's Soulmate Jaehyun came to SM in 2013 after being scouted by the company in front of his school. He auditioned with EXO's \"MAMA\" — not having a mirror, he practiced the choreography in front of his living room window — and officially joined SMRookies. He debuted with NCT in 2016 with \"The 7th Sense.\" With his rich voice and Disney-Prince good looks, it's easy to see why everyone is enamored by him — from variety show hosts, to female fans, to other idols, and his fellow members (even 2D Taeyong). He's also one of the group's three English-speaking members, having spent four years living in Connecticut as a child. This is also why he has such a soft spot for the High School Musical franchise.What to watch: Time doesn't exist; there is only Before You've Heard Jaehyun's Cover of \"A Whole New World\" and After You've Heard Jaehyun's Cover of \"A Whole New World.\" Real name: Dong Sicheng (nickname: Win) Role: Lead Dancer, Vocalist There's only one thing you need to know about NCT 127: Everybody loves Winwin, and Winwin hates everybody. (Just kidding... maybe.) Unlike some of the other members, Winwin isn't big on skinship (platonic physical intimacy), but that doesn't stop them from trying to initiate contact with him anyway. He'd rather watch his K-Dramas in peace. Winwin is part of NCT's beloved China line with Chenle (NCT Dream), Kun (NCT U), Renjun (NCT Dream), and Lucas (NCT U), and he's especially close with Renjun. (If you want to cry, then watch young Renjun's message to his parents, in which he tells them not to worry because Winwin takes good care of him.) Ultimately, Winwin just shows his affection for his members in different ways. What to watch: What Winwin wants, Winwin gets — especially around Taeyong. And let's never forget Winwin's now-iconic verse in the English version of \"Regular.\" Real name: Kim Jungwoo (nickname: Jungwoo-s) Role: Lead Vocalist, Lead DancerSweet, soft Jungwoo is the newest member of NCT 127, but he debuted earlier this year with a standout moment in NCT U's \"Boss.\" Still, the 20-year-old singer gets adorably flustered whenever someone hands him a mic. But he's always quick with a pretty funny comeback. (\"Pretty funny?\") He also bears an uncanny resemblance to fellow SM idol, Taemin. TBH, it's a little unnerving. What to watch:  NCTzens are still recovering from this \"Boss\" choreography. Real name: Mark Lee / Korean name: Lee Minhyung (nicknames: Yakkan Boy; Baby Lion) Role: Main Rapper, Vocalist The hardest-working guy in NCT, Mark debuted at age 16 with NCT's \"The 7th Sense\" and has since taken part in more comebacks than any other NCT member because of his prominent roles in NCT 127, NCT U, and NCT Dream. He joined SM Entertainment as a trainee in 2012 after a global audition process and became a rapper with his easy-going flow and stage charisma. But the singer-songwriter's most endearing quality is his extreme awkwardness. How this 19-year-old Canadian manages to transform from total mess into a rap god on stage is one of life's greatest mysteries. And he writes all of his own verses — and others' too — even the PG-13 ones.What to watch: The duality of Mark Lee as revealed in these iconic verses: \"That's a long-ass ride\"; \"baby, is it me or are you doing something to me?\"; \"chewing gum / chewing gum.\" Real name: Lee Donghyuck (nicknames: Donkey; FullSun) Role: Lead Vocalist, Lead Dancer, Maknae (youngest member), Mark's Other Soulmate (depending on the day)  The youngest member of NCT 127 is a bit of a troublemaker — he thrives off chaos — but at the end of the day Haechan just wants to cuddle and make his hyungs (older brothers) laugh. The 18-year-old vocalist looks up to his idols Michael Jackson and SHINee's Taemin when it comes to performance, and his unique voice makes him a bit of a secret weapon in NCT's stacked vocal lineup, with key roles in both NCT Dream and NCT 127. And while his clingy personality and acute sense of humor may drive some of the other members crazy — and nearly caused Mark to leave SM altogether (don't worry, they've been best friends since their childhood Mickey Mouse Club days) — it's always with the best of intentions. And the fact that he has a personalized handshake with every member of NCT is the cutest thing ever. What to watch: Haechan may be known for his vocals (listen to this note in \"No Longer\"), but he's also a great dancer who has a real knack for picking up choreography. His performance in Weekly Idol's \"Dance Cover Battle\" is legendary, specifically his slinky version of Taemin's \"Move.\" Also, \"here is Korea, man\" is the sickest burn.  What NCT 127 songs should I listen to? You can start with their latest single, the Latin-trap \"Regular\" (recorded in both Korean and English). But NCT 127 debuted in 2016 with \"Fire Truck,\" a loud, punchy hip-hop track that more or less confused Korean listeners with its frenetic production and EDM hook. Love it or hate it, \"Fire Truck\" is the perfect distillation of NCT 127's vibe: bass-heavy beats, weird production, innate charisma, and energetic choreography (just skip to 2:06). \"Limitless\" is easily NCT 127's best song to date. Their styling is borderline tragic, but the production of the single is near-perfect. It's a powerful track that actually allows their vocalists to shine as it builds to a massive chorus (not unlike their labelmates EXO's \"Monster\"). And Taeil's background vocals are mesmerizing. The group went full pop with their slick single \"Touch.\" The playful song displays the group's versatility: They can go from studded chokers and charcoal eyeliner to colorful knits and fresh faces at the drop of a hat. And let's not forget about their vocal line, who take center stage with NCT U's \"Timeless,\" a simple ballad featuring Taeil, Doyoung, and Jaehyun that packs an emotional punch. Finally, NCT debuted in April 2016 with NCT U's \"The 7th Sense,\" a smooth hip-hop track largely influenced by Western trap music that prominently featured rappers Taeyong and Mark. It didn't resonate with Korean listeners, but among international fans it remains one of NCT's standout songs because of its hypnotic hook and vibey trap beat. And all of these members (with the exception of Ten) are now in NCT 127.What else can I watch? Well, if you've made it all the way to the end of this guide and still want more NCT content, then you need to watch the group's Korean variety show, NCT Life. There are eight seasons, so that should keep you occupied until their next release. © 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}