{"id": "\n\n                This 17 Year Old's Album-Inspired Makeup Looks Are Picture Perfect\n              \n\n", "paragraph": "\n              Shawn Mendes and Camila Cabello fans are gagging\n        \n          Don't mind me, I'm just feeling talentless as ever after seeing how much a Shawn Mendes super fan slays her makeup.Turning album and single cover art into color-popping makeup looks, 17-year-old Emma from Norway has pop music fans stanning her and her beauty skills. Emma's latest look, a floral recreation of this year's self-titled album from Shawn Mendes, is grabbing more attention than ever amongst fans.Absolutely nailing the flowers that emerge from out of Shawn's face, Emma masterfully contoured the left side of her face to lift it off the page, just like in the Shawn Mendes cover art.While the look has racked up more than 16,000 likes on Twitter, she's most looking forward to the day when Shawn likes the pictures himself.\"My favorite person on Earth I swear is Shawn Mendes,\" Emma tells TRL over direct messages. \"He is the sweetest guy ever and I’ve met him a couple time and he’s just lovely.\"Though plenty of her makeup looks are based off of Shawn's singles, albums and performances, Emma's covered a ton of different musicians with her beauty skills. As a long-time fan of glam and music, it only made sense for her to combine the two passions.\"I’ve always been creative since a little kid and I loved to draw and paint. I think that really helped me out when I turned to makeup later,\" Emma explains about her artistic ability.\"I’ve always loved music and it runs in my family. Both me and my dad are two people overly obsessed with music and going to concerts. So I found my way of putting makeup and music together.\"Emma's recreation of Camila Cabello's self-titled album art was so on point it even caught the attention of the pop star herself, who liked the pictures. In it, Camila sits on Emma's brow, perfectly matching her pose and dress on the album cover.After starting these music-inspired makeup looks two years ago, Emma admits she's gotten better, but still spends as long as it takes to make her final product perfect.\"I could sit five or six hours staring at this one picture trying to recreate it on my face,\" Emma says about her artistic process. \"I’m so specific, like if the color isn’t right, I’ll try anything to get it right. Or if the shape doesn’t turn out right, I’ll just try again and start from scratch.\"Like many great artists, Emma's most inspired overnight: \"I always get so creative at night. I could start a makeup look at 2:00am and finish it at 8:00am then post and go to bed. I know it’s not good and I shouldn’t do it, but apparently it’s when I’m the most creative.\"For those who catch wind of Emma and her art, she tells TRL, \"I hope they feel inspired and that makeup isn’t all to just look good, but you could also express your creative sides.\"Keep up with Emma's one-of-a-kind musical makeup looks on her Twitter and Instagram.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}