{"id": "\n\n                Normani And 6LACK's New Song 'Waves' Is A Hazy Storm Of Seductiveness\n              \n\n", "paragraph": "\n              She also spilled some deets about her upcoming solo album\n        \n          Just when you had finally memorized every addictive word and every stunning vocal run on Normani's recently released collabs with Calvin Harris, she's come through with yet another tune that might be her best yet.On Thursday (November 15), Normani blessed fans' ears with \"Waves,\" a seductive slow jam featuring Atlanta's 6LACK. Heavy with love-soaked lyrics of an all-consuming relationship, \"Waves\" doubles down on the cover art's '90s feel with a heavy R&B beat. \"First I blame you, then I want you / Fucking hate you, then I love you / I can't help myself, no,\" Normani sings, before 6LACK comes through with his own moody verse about \"making love on the full moon.\" It's a vibe.Speaking with Beats 1 host Zane Lowe after the song's premiere, Normani praised 6LACK as an \"important\" artist, saying, “He's an amazing lyricist, and I feel like he took the record to a whole other level. I already love the record as is, but he totally exceeded any expectation I even had, which was pretty high, because I admire him as an artist.\"The former Fifth Harmony singer also took the opportunity to spill a little tea about her upcoming debut solo album — kind of. She made sure not to divulge too much, but did reveal that the album will be released at the top of 2019, and that its title has a number in it (I'm guessing it's probably not a \"five\"). She also said Khalid would appear on the album, though their hit single \"Love Lies\" didn't make the cut because it \"was a moment of its own.\"Sounds like Normani will have a hefty arsenal of bops to dig into when she hits the road with Ariana Grande on the Sweetener World Tour next year. Until then, we'll be riding these \"waves\" into the winter.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}