{"id": "\n\n                Stan Lee, Marvel Comics Legend, Dead At 95\n              \n\n", "paragraph": "\n              With great power comes great responsibility, and nobody understood that better than Lee\n        \n          It’s hard to imagine someone who’s had a greater impact on pop culture than Stan Lee. The prolific comic book writer, editor, and publisher helped create some of the most iconic and beloved Marvel characters — from Black Panther and the X-Men to Iron Man and Earth’s Mightiest Heroes, The Avengers — and has influenced generations of creatives and kids, both young and old, after him. On Monday (November 12), Lee died at the age of 95 after being rushed to Cedars-Sinai Medical Center in Los Angeles. TMZ was the first to report the news, which was then confirmed by Lee’s daughter, J.C. Lee. Lee transformed Marvel Comics into a publishing powerhouse in the 1960s alongside artist Jack Kirby. In 1961, they introduced the first of their many iconic ink-and-paper creations: The Fantastic Four. And ultimately, Lee was instrumental in ushering in the Silver Age of comics, with complicated superheroes who routinely grappled with the very human effects of saving the world — and themselves. The Fantastic Four, like many of Lee's creations that followed them, weren’t perfect. They made mistakes and dealt with the aftermath. That’s what made them special in the eyes of young readers — and a stark contrast to the righteous roster over at DC Comics. When Lee created teenaged web-slinger Peter Parker with artist Steve Ditko, he gave kids a hero they could relate to; and when he envisioned a team of marginalized, super-powered mutants who face prejudice from an ignorant society, he did so with the real-world implications in mind. With great power comes great responsibility, and nobody understood that better than Lee. Although Lee stopped writing monthly issues in 1972 to assume the role of Marvel Comics publisher, his work has found new life on screen, where Marvel Studios reigns supreme at the box office and shows like The Gifted and Marvel's Cloak & Dagger entertain viewers on a weekly basis. (Black Panther is the highest-grossing domestic movie of 2018 with a $700 million haul, while Avengers: Infinity War made over $2 billion globally.) To date, these films have made over $21 billion worldwide and have revolutionized Hollywood, assuring that Lee's legacy will have a lasting impact on our culture for decades to come. Lee also made a cameo in every Marvel film to date, a long-standing tradition in the Marvel Cinematic Universe — one that the studio will hopefully carry on in his honor. He is survived by his daughter, J.C., who told TMZ, \"My father loved all of his fans. He was the greatest, most decent man.\"© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}