{"id": "\n\n                Justin Bieber Did Not Eat A Burrito Sideways, Actually\n              \n\n", "paragraph": "\n              But here's why you thought he did\n        \n          Justin Bieber, who may or may not be married to Hailey Baldwin, has not released an album since 2015's Purpose. He's guested on scores of singles since then, including many summer bangers (\"I'm the One,\" \"Cold Water,\" and more).But in the absence of a new musical project to do proper press behind, Bieber tends to get singled out for his extremely laidback fashion choices, for example, as well as his seeming inability to eat Mexican food the way most of us do.Last week, what looked to be a paparazzi or fan-captured photo of Biebs chowing down on a burrito while holding it sideways (like corn on the cob) hit the internet. People loved it. They were also confused.But in a very 21st-century twist with shades of Zardulu behind it, the photo is, in fact, fake. It's a real pic, but that's not Justin — it's a highly convincing impersonator hired by the folks behind the Yes Theory YouTube channel.They roped in Brad Sousa, who looks like he could be Biebs's long-lost brother, to stand in for him, fitted him with a wig, and cleverly hid most of his face behind the honking Chipotle creation. \"We wanted to prove a point: that staging a story, as goofy as it was, can be done much more easily than most people can imagine,\" their new revelation video explains.The whole behind-the-scenes look is worthwhile, showing just much brainstorming and backend work went into a simple photo that fooled the entire entertainment world. There's additional info about a supplementary video where fake Biebs assisted a grandma, played by an actor, across the street — and most of the work appears to be just sitting around waiting for the thing to go viral.No word yet from Justin himself about the pic or the story behind it. But last week, he did take to Twitter to remind young people in the U.S. to get out there and vote in the upcoming midterm elections, which is cool. Watch the full explanation video above.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}