{"id": "\n\n                Tiffany Young & Amandla Stenberg And Angie Thomas Made For A Star-Studded 'TRL' Morning\n              \n\n", "paragraph": "\n              Plus, a cut-for-time segment with Tiffany Young\n        \n          Tiffany Young joined The Hate U Give star Amandla Stenberg and writer Angie Thomas for a TRL episode that didn't even fit into 30 minutes this morning!Starting things off, Tiffany sat down with TRL host Sway Calloway for him to get to know the Girls Generation-turned solo artist. They went over the sentimental meanings behind her stage name and the decision Tiffany made to move back to the U.S. after ten years making music in South Korea.Sway asked Tiffany a series of five tough questions -- all of which had great answers -- that got her to name some of her favorite artists, including Shawn Mendes and Kim Petras! Tiffany even revealed for the first time on TRL that she's got an upcoming duet with Babyface called \"Runaway\" that the world truly isn't ready for.Cut for time but too iconic not to share, Tiffany reacted to her \"Teach You\" video in a digital exclusive. Now that there are people at home watching her on the small screen, Tiffany had a perfect message to share: \"“You can do anything you want. You can be anything you want.\"Taking over the studio next, actress Amandla Stenberg and author Angie Thomas talked about starring in the upcoming film The Hate U Give, which stems from Angie's novel. Amandla and Angie talked about how their own upbringings and families influenced how they approached this project, from code-switching in different communities to wanting to give voice to unspoken experiences of black youth across the country.Following The Hate U Give, Amandla is hopeful to represent even more communities, especially queer people of color like herself whose stories are rarely told. In fact, Amandla said that her character, Starr, taught her more about herself and her desire to not hide who she is in her films.Earlier this week on the show, Nessa asked the film's co-star Russell Hornsby asking about Tupac's influence in the film, so Sway was inspired to ask Angie the same question. Though she didn't always have the Tupac-inspired title for her film, Angie said that the rapper was at the core of story as she wrote it. Hear more about how Tupac shaped her childhood below. TRL airs on weekdays at 8:00am ET. © 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}