{"id": "\n\n                Little Mix Strip It Down For Two Fierce, Fearless New Videos\n              \n\n", "paragraph": "\n              'Strip' and 'More Than Words' get stunning visual treatments\n        \n          Seven years and five albums in, Little Mix are continuing to prove themselves models of empowerment and body positivity. Those themes run deep throughout the Brit girl group's new album, LM5, and to celebrate their big release day on Friday (November 16), they debuted not one, but two stunning videos.The first, \"Strip,\" was co-directed by photographer Rankin and features inspirational activists like Bryony Gordon and Nimco Ali, along with featured artist Sharaya J and the girls' own family members. Fittingly, Jesy, Jade, Perrie, and Leigh-Anne \"stripped\" down for the black and white affair, covering their skin with nothing but derogatory words like \"slutty,\" \"talentless,\" and \"ugly.\" It's a striking image, and their confident, liberating lyrics give it all the context you need: \"Take off all my makeup 'cause I love what’s under it / Rub off all your words, don't give a uh, I'm over it / Jiggle all this weight, yeah, you know I love all of this / Finally love me naked, sexiest when I’m confident.\"Upon releasing the video for \"Strip,\" Little Mix tweeted, \"This is so special to us, from the amazing women we worked with, to the message of the song. It’s EVERYTHING we wanted LM5 to represent!\"Along with \"Strip,\" the group also debuted an eye-catching video for \"More Than Words.\" In it, featured artist Kamille basically becomes an honorary fifth member of the tribe, joining the girls as they belt the thundering power ballad against hazy backdrops that compliment the song's glitchy vocal stylings. Don't miss the stormy climax, during which they weather a wild rainstorm while proclaiming their undying devotion.Little Mix's very empowering, very poptastic LM5 is out now.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}