{"id": "\n\n                Julia Michaels Finds Nirvana In A Video Game With Her Ralph Breaks The Internet Anthem\n              \n\n", "paragraph": "\n              A glitchy ode to 'Slaughter Race'\n        \n          It's official: Julia Michaels's signature electro-pop touch can make anything sound pristine. Take \"In This Place,\" the singer-songwriter's contribution to the Ralph Breaks the Internet soundtrack. It's essentially an ode to a fictional video game called \"Slaughter Race,\" which plays a big role in the upcoming animated sequel. And while that doesn't sound like particularly standard fodder for a pop song, Michaels makes it irresistible with especially intoxicating lyrics.\"Now I'm flying, my spirit's climbing / As I'm called through this far off maze,\" she sings on the glitchy chorus. \"My body, my spirit aligning / In this place called Slaughter Race.\" It's weird and wonderful in the most unexpected way.\"In This Place\" premiered on Thursday (November 15) on Zane Lowe's Beats 1 show. Michaels called in to tell Lowe that she was brought in to add a pop edge to the song, which was written by Disney film score legend Alan Menken, along with Phil Johnston and Tom MacDougall.\"I've been a huge Disney fan for as long as I can remember,\" Michaels said, explaining that MacDougall asked her to make a version of the song that felt \"more current.\" She added, \"I was like, 'I would love to try anything! Anything to be a part of a Disney movie! I'm in.' ... It was just such an amazing experience. I was so happy I got to be a part of it.\"As for her own music, Michaels revealed that she plans to put out some new songs in January before heading out on tour with Keith Urban and P!nk. She said, \"I've decided that I'm just not gonna wait anymore. I need to put it out and I want it to be out in the world and to be loved on.\" Amen to that!© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}