{"id": "\n\n Challenge Comebacks: Where Should Natalie And Paulie Cast Their Allegiance?\n              \n\n", "paragraph": "\n              After a rough road, the 'Big Brother' exports are suddenly in control of the game\n        \n          From zero to hero seems like a less triumphant tale than Natalie and Paulie’s return to the Final Reckoning house. So now that they’re back (and mission-winners!), the question remains: to whom should they cast their allegiance?On tonight’s Challenge episode, and in tandem with fellow Armageddon winners Cara Maria and Marie, the Big Brother duo returned to the game after being eliminated in the third episode and failing twice in Episodes 4 and 10 to return. But with a huge victory over Brad and Kyle in Armageddon, they were both hungry for some serious redemption.And they got it. In “Hit List,” Season 32’s trivia-game installment, teams were tasked with answering a series of game-related questions while avoiding the accumulation of three strikes. They’d earn a strike for either answering a question incorrectly, or after receiving a vote from a team that had answered a question correctly.To raise the stakes, three strikes also meant a giant battering ram would batter the losers into the waters far below.Five giant splashes later — and though they only boasted one previous Challenge showing among them — Natalie and Paulie were named the day’s winners, and took a moment to bask in their glory.“We went from the Redemption House Heroes to the Elimination Round King and Queen to getting back in that house and winning the first challenge back,” Paulie said. “Feels good.”And it seemed to feel even better for Johnny Bananas, whose fractured friendship with Natalie had been restored. Bananas seemed sure Paulie and Natalie would join his alliance and effectively even the game’s score: The Outliers would have three teams (Johnny/Tony, Cara Maria/Marie, Natalie/Paulie), and the Lavender Ladies (Sylvia/Joss, Ashley/Hunter, Shane/Nelson) would have three teams, too.Still, Ashley wasn’t so sure that Paulie and Natalie would so readily join Johnny’s side, and said they remained total enigmas.“I have no idea who Paulie and Natalie are gonna put their Power Vote on, because I’m not really sure where their alliances lay,” Ashley said. “I’m confused about this team, and I don’t trust them.”So, is Ashley right to have reservations? Or is there a chance Paulie and Natalie could spare her and Hunter from Armageddon?What do you think: Will Paulie and Natalie join on to the band of Final Reckoning defectors, or would it make their games easier to latch on to the Lavender Ladies? Share your thoughts and see how this shakes out when The Challenge returns Tuesday night!© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}