{"id": "\n\n                Here's How To Get Out the Vote the Last Weekend Before Midterms\n              \n\n", "paragraph": "\n              How to make a real impact on Tuesday\n        \n          By Lily HermanMillions of people across the country have been hard at work for the past several years hoping to change the political tide in this country. And now, hours of conversations, activism, and organizing all come down to the critical last few days on the campaign trail convincing voters to head to the polls.Not sure if there’s much you can do this late in the game to get out the vote? The last weekend before Election Day is crucial for ensuring democracy is alive and well on Tuesday. Here’s what you can do to make sure everyone is exercising their right to vote and picking the representatives they want.Talk to Your NetworkDo you know for sure if your family members are voting? What about your friends? How about any co-workers? Have they double-checked if they’re registered to vote? Do they know where their polling places are? Do they have transportation to and from wherever they’re casting their votes? Have they checked out a sample ballot for their district? Do they know all of the down-ballot candidates and ballot initiatives?Don’t trust that everyone has their Election Day plan figured out. Take initiative and talk to your friends, family, and co-workers. “Nothing beats the old fashioned face to face contact especially when people are hiding digital ads on FB and fast forwarding through TV ads,” says Atima Omara, Founder and President of Omara Strategy Group.If the people in your personal network don’t know who or what they’re voting for on Election Day, they can use great resources like BallotReady to see every race that will appear on their ballot, discover the candidates and their views on major issues, and learn about the other ballot measures that they’ll be voting on.Phone BankWhether you live in a swing district or an area without a competitive race, phone banking allows people in all parts of the country to connect with voters. It’s especially important to have a quick check-in with voters to make sure they’re heading to the polls come Tuesday.For those who live outside of key districts, many campaigns have remote phone banking operations to allow supporters to phone bank from anywhere in the country and reach out to get out the vote. If you have questions, campaigns often list their upcoming phone banking sessions on their websites (if not, you can usually email a campaign for more info). Moreover, many local political groups across the country organize their own phone banking sessions for competitive races and provide call sheets with names and phone numbers of voters and scripts for what to say, so you can join pre-existing efforts to get out the vote via phone and get all the instruction you need.Knock on DoorsArguably the most impactful actions people can take leading up to Tuesday’s election, however, is spending face-to-face time with voters directly canvassing neighborhoods and speaking on the candidates and issues you care about.“The power of showing up at someone's door, telling them about a candidate you believe in, and helping them make a plan to vote cannot be overstated,” says Marisa Kabas of Crush The Midterms, a digital tool that helps people make personalized plans for supporting competitive campaigns.For people who’ve never canvassed before, the process can seem overwhelming. However, campaign staffers have onboarded countless volunteers over the years to help get out the vote, so you’re in good hands. “[Canvassing] is incredibly easy and the campaign will give you a quick training before you head out, so you don't need any prior experience,” explains Monica Klein, Founding Partner of Seneca Strategies, a progressive political consulting firm. “There is nothing more meaningful or satisfying than convincing a voter [who] was on the fence to support your candidate. You don’t want to see the results roll in after the polls close and wish you had helped get out the vote.”Kabas says that it’s also critical to remember that while every interaction over the weekend may not be a positive one, your work is important. “Not everyone will be receptive. Not everyone will be nice. You might get a couple of slammed doors,” she notes. “But if you spend even two hours knocking doors in your community or a community nearby—this weekend, Monday, or even on Election Day—there's a high probability that you'll encourage a couple of people to turnout. That's everything.”© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}