{"id": "\n\n                How Larry And Jen Explained Ryan's Teen Mom OG Arrest To Bentley\n              \n\n", "paragraph": "\n              The two agreed that honesty is the best policy\n        \n          There’s been a lot going on with Ryan lately on Teen Mom OG, and perhaps the person most confused — and most affected — by it all is his and Maci's son Bentley. On tonight’s installment, we learned via Ryan’s parents Jen and Larry exactly what Benny was told of his father’s whereabouts and his recent legal woes and the how grandparents decided together that honesty was the best policy.When producer Kiki asked the Edwards to discuss Ryan’s recent arrest (he violated his parole by not doing his court-ordered community service), Jen expressed disappointment in her son.  “I wasn’t mad that he was [in jail]. I was like, 'You deserve it,'” she said. Larry had more to say, like how the two worry about how Ryan’s actions will affect his pregnant wife Mackenzie, along with Bentley.“We worry about Mack. She just doesn’t need this right now,” he said. “We worry about Ryan, but we worry about Bentley too.”From there, Larry revealed what they told their nine-year-old grandson (off-camera) about his father.“He asked me out there in the garage where Dad was. I knew he knew, but I knew he needed to hear it from us,” he said. “I told him the truth, and I told him, ‘The most important thing is your daddy is still clean.’ And he started crying. I said, ‘Buddy, he’s going to be okay.' He’s got us and we’re going to be fine.\"But despite his brave front with Bentley, Larry told Kiki he still has concerns.“[Ryan's] still a grown man,\" he said. \"He still makes his own decisions. With addiction, you just never know if today’s the day.”How do you think Jen and Larry handled sharing the news with their grandson? Tell us your thoughts, and keep tuning in to Teen Mom OG Mondays at 9/8c.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}