{"id": "\n\n                Ariana Grande Closes The Pete Davidson Chapter With 'Thank U, Next'\n              \n\n", "paragraph": "\n              Let all the self-love reign\n        \n          So much of the fascination with the whirlwind romance (and failed engagement) between Ariana Grande and Pete Davidson comes from our own appetites. We love a good celeb love story! And often, the breakups are even better. They fell in love, shacked up, brought a ring into it, then parted ways all in a five-month span — and we can't get enough.That's why fans mind so much when Pete seems to make light of the whole thing in a promo for Saturday Night Live, or when Ari seemingly disappears from social media to (wisely) take some time to herself, away from too many voices. That time away did her well, though, as we can all hear on \"Thank U, Next,\" the new song she dropped Saturday night (November 3) that seems to punctuate this saga of her life with an uplifting message of self-love.First, Ari sets the scene for us by mentioning her past loves by name, including Big Sean and Ricky Alvarez (who apparently heard the song before it came out), as well as Pete and the late Mac Miller, whom she calls \"an angel.\"This is all to show her own personal growth from each relationship she had, Ari instructs. \"Look what you taught me / And for that, I say / Thank u, next,\" she sings to lead into the chorus. \"I'm so fucking grateful for my ex.\"What some were perhaps eagerly awaiting as a final kiss-off to Davidson ended up being a sweet, thoughtful song about learning to love yourself above anyone else. All in all, it's a fantastic move by Ari. And it sounds great! Her voice is clear and bold, except for maybe the one line where she sings her own name (as people enjoyed on social media).Saturday night, too, Davidson addressed the end of their relationship on SNL seemingly to put a pin in it as well. His words were also gracious: \"The truth is, it's nobody's business, and sometimes things just don't work out, and that's OK. She's a wonderful, strong person, and I genuinely wish her all the happiness in the world.\"Whatever the circumstances that led her here, Ari is indeed here, with this song, and with clear eyes about her path forward. It's great! And it's a nice example to follow. Check out \"Thank U, Next\" above.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}