{"id": "\n\n                Mariah Carey Returned To 'TRL' For Her 'Caution' Album Release Party\n              \n\n", "paragraph": "\n              A must-see morning with Mariah\n        \n          In a moment the music world's been waiting for, Mariah Carey returned to TRL just a matter of hours after dropping her fifteenth studio album, Caution.But before she had a chance to address her latest album, Mariah had to give some love to the #JusticeForGlitter campaign, which brought her 2001 soundtrack to the top of the iTunes charts just a day before Caution's release. \"That was the last thing I expected coming back to TRL today,\" the queen told host Sway Calloway, in a truly full-circle moment.Seventeen years later, Mariah is still reinventing herself, but she's proud to point out that she's the same, hard-working woman she's always been at heart. That's the spirit of \"8th Grade,\" track eight on Caution, which Mariah says stems from the fact that the song's message reminds her of the poetry-writing girl she was in middle school.Mariah and Sway took a moment to look back at the singer's close friendship with Ol' Dirty Bastard and what it was like to lose him fourteen years ago this month. That's an experience, Mariah says, that she'll need to write about in the book she revealed she's working on now.Looking back over more of her legendary career, Mariah was beaming as she explained the drama over her VMA gag with Whitney Houston in 1998. Planning to appear together on stage in the same dress, Mariah recalled the circumstances that led to a police escort that night -- for the dress.Before the morning was over, the TRL studio audience was left gasping after two Mariah superfans got engaged, complete with a speech about how Mariah's music brought them together. Watch the heartwarming surprise from the TRL stage below -- and don't forget to listen to Mariah's new album, Caution, out now. TRL airs on weekdays at 8:00am ET.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}