{"id": "\n\n                Watch Joey Purp And RZA Absolutely Demolish 'Godbody Pt. 2' On The Tonight Show\n\n\n", "paragraph": "\n              The Chicago MC stand still but melts the room\n        \n          Joey Purp's QUARTERTHING is one of the strongest hip-hop albums of the year, led by the 24-year-old Chicago MC's penchant for hopping from style to style, never settling in for too long on one approach. This is clear right from the beginning, when Joey teams up with RZA to break down the house on the album's blistering second track, \"Godbody Pt. 2.\"On Monday night (October 22), the pair brought the pulse-pounding cut to The Tonight Show for a grand unveiling wrapped in big percussion and howling keyboards. \"I'm in the building, I'm on the building, I own the building,\" Joey raps near the end. And you believe him.The coolest part about this particular performance is its simplicity. No synchronized flames flash to the beat. Joey doesn't bound from one end of the stage to another. In fact, he stays stone still, reciting his rhymes like a bold sermon of self while a cloud of noise rises around him.It's the same dedication and determination that Joey held onto while making the album. \"I'm about to get in the studio at all times. Just working on everything from the studio like an office,\" he told Billboard about the recording of QUARTERTHING. \"So anytime someone sends me a fire beat I don’t have to book studio time. I'm just gonna be there already. That's how I'm gonna start approaching it: structuring my schedule more like work.\"One of his collaborators, Knox Fortune, told MTV News last month that Joey did exactly that. \"Joey will sit and play [NBA]2K and listen to shit I'm making or just playing in the room for three and a half of those hours, and then in 30 minutes write the best verse you've ever heard.\"Check out one of them in the \"Godbody Pt. 2\" performance above.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}