{"id": "\n\n Young And Pregnant Sabotage: Is Amber Trying To Stop Lexi From Leaving Home?\n              \n\n", "paragraph": "\n              Kyler's mom thinks it's a definite possibility\n        \n          Lexi has made it very clear on Teen Mom: Young and Pregnant that she is not yet ready to move with Kyler and their son to Arizona. Her mom, Amber, certainly doesn’t feel it’s time for the young family to be on their own either, and a new move on her part could be her way of keeping her daughter and grandson around for just a little bit longer.After Lexi’s car “crapped out” on this week's episode, Amber co-signed her daughter’s lease on a new vehicle — she got a $30K loan — that is more reliable and safer for Tobias. In return, Lexi decided to find a part-time job to pay for the car payments. But Kyler saw Amber’s financial assistance as a way to keep Lexi in Colorado.“So I’m assuming you don’t want to move as quick now that you have to pay off your car?” he asked. “You knew that [we were moving right away] -- you just wanted to be with your mom longer.”Kyler’s mom Kati, meanwhile, agreed that the new car situation will impede on their family’s plans.“Do you think that the reason why she’s helping with her new car is another way to make sure, financially, that she stays in the home?” Kati asked her son. “Or do you think it’s a trust thing that she doesn’t think that you can financially support Lexi the way that she is used to living?”Kyler's reply? He told his mother they’re moving whether Lexi (or Amber) like it or not. But who’s going to win this battle? And is Amber's help with the car a manipulative move to keep her daughter and grandson around, or is she just trying to lend a hand? Share your thoughts, then keep watching Young and Pregnant Mondays at 10/9c.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}