{"id": "\n\n                Turnout Is the Key to Any Electoral Victory. Will Young Voters Show Up?\n              \n\n", "paragraph": "\n              Early voting turnout is high, for both parties.\n        \n          By Ernest OwensAs the election approaches, some younger voters are grappling with whether or not they plan to show up to the polls. In Pennsylvania, a battleground state that turned red in support for President Donald Trump in 2016, some have found the current state of politics a turnoff to voting altogether. “I have highly lost any sort of faith or respect for government,” says Robyn Ryan, 29, from Philadelphia. “I am considering not to vote. I realize [it seems] anti-American to do so, but I feel I am a proud American and no one can tell me otherwise.” Ryan, who self-identifies as a “independent disguised as a Democrat,” believes that voting has “become less of by the people and for the people… I don't see the point anymore in voting until I see real viable change. It's not a matter of being unsure, it's more a matter that in the end do we Americans even have a say at all?”“I only vote because there are so many members of my community experiencing voter suppression who want to vote and who cannot vote for reasons beyond their control,” says Witt L., 30, who says they “do it for the folks in my family and community who can't because of systemic oppression.” “For me, it's less about ‘civic duty’ because I don't believe that I have a duty to a government of a country that lets people like me die on a regular basis from things that can be easily solved. Aside from that, I could care less.”According to the Pew Research Center, Millennials are projected to surpass Baby Boomers as the nation’s largest living adult generation in 2019, while also matching the latter in their share of the American electorate (31%). However, only 46% of millennials (ages 18–35 years old) voted in the last presidential election, leaving many to wonder if such low turnout will take place this November.At the other end of the political spectrum, some millennial Republicans are more enthusiastic. “This is an exciting election, but it is also visceral in nature,” says Amber Ashley Parker, one of the youngest elected Republican Ward Executive Committee people in her district at age 30. Parker, who has been volunteering for voter registration programs and hosting intimate conversations with friends and colleagues, believes current national issues, such as Brett Kavanaugh SCOTUS confirmation, might play a crucial role at the November polls. “The calamity witnessed at the Senate Judicial Hearings seem to have agitated and invigorated voters. Whether that's good or bad...well, I guess that depends on the election and if your candidate wins or not.”Political organizers working in other battleground states are also feeling the uncertainty in getting out the vote. Jia Ireland, Regional Field Director for One Campaign for Michigan, is beginning to feel the “burnout” of canvassing weeks away from November 6.“Well I’m tired and burnt out, to be honest...but I realize the work has to be done,” Ireland, 25, says. “One of the big challenges we are facing is getting volunteers in to help canvass neighborhoods and phone bank. We realize we need to build trust and relationships in our communities, yet there’s only so much field organizers can do without volunteers assistance.”A June 2018 poll from the Public Religion Research Institute and the Atlantic revealed that only 28% of millennials between the ages 18 to 29 say they are “absolutely certain” they will vote in November, compared to 74% of Baby Boomers. And while millennials overwhelmingly vote for Democrats (and still prefer them even if they are registered as an Independent), they are still considered unreliable voters. “I will be voting in this upcoming election...I plan to vote in every election until the day I die,” says Omar Sabir, a Philadelphia organizer who recently created a website called Vote Philly Vote to encourage more millennials to vote. In 2013, Sabir was elected as a Philadelphia Traffic Court Judge in 2013, only for the Pennsylvania General Assembly to abolish the position shortly later. “My faith was low in the political process,” Sabir says. “I considered not participating, but I dug down and continued to advocate for what I believe.”Sabir hopes that many millennials show up to the polls on November, despite their personal dissatisfaction. “Midterm elections are very crucial, they are just as important as presidential elections. Those before us have sacrificed so much for the right for us to participate in the electoral process, we can’t let them down.”Ernest Owens is an award-winning journalist and CEO of Ernest Media Empire, LLC. His work has been featured on CNN, BET, USA Today, NBC, NPR, and Philadelphia magazine.Ever wondered how many candidates under age 30 are running in your state? MTV News has got you covered. Click here for the map. © 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}