{"id": "\n\n                Chris Evans, Robert Downey Jr., And More Marvel Heroes Pay Tribute To Stan Lee\n              \n\n", "paragraph": "\n              'Excelsior!'\n        \n          Stan Lee revolutionized comic books by delicately balancing superhuman powers with humanizing choices and giving young people everywhere heroes they could relate to. Thanks to his illustrious stamp on the industry, his legacy will live on long after his passing. At the same time, it makes his death that much more devastating, particularly for those who were lucky enough to work closely with the Marvel legend.Soon after the sad news was announced, Chris Evans took to Twitter to celebrate Lee's contribution to pop culture. “For decades he provided both young and old with adventure, escape, comfort, confidence, inspiration, strength, friendship and joy. He exuded love and kindness and will leave an indelible mark on so, so, so many lives,\" he wrote, before signing off with Lee's signature, \"Excelsior!!”Giving credit where credit was due, Robert Downey Jr. — who helped turn Lee's comics into an epic film franchise starting with the MCU's first movie, Iron Man — simply stated, \"I owe it all to you,\" alongside a photo of them together, and Marvel Studios president Kevin Feige wrote, \"No one has had more of an impact on my career and everything we do at Marvel Studios than Stan Lee.\"Of course, it's not just the superhero staples who are mourning this loss. Black Panther stars Letitia Wright and Winston Duke paid tribute to the Marvel boss, as well as Tom Holland. \"How many millions of us are indebted to this guy, none more so than me. The father of Marvel has made so many people so incredibly happy. What a life and what a thing to have achieved,\" the Spider-Man star wrote on Instagram.Read more reactions from inside the Marvel community and beyond below.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}