{"id": "\n\n                Danai Gurira's Heartfelt People's Choice Speech Is A Celebration Of Women As Superheroes\n              \n\n", "paragraph": "\n              'Women and girls, when they're given a chance to hang with the boys, can hang with the best of them'\n        \n          The recurring theme at 2018's E! People's Choice Awards, echoed in many acceptance speeches throughout the show on Sunday night (November 11), was gratefulness. That's standard fare at awards shows, sure, but this year's show took place in Santa Monica, just miles from where cataclysmic blazes have killed 31 people and charred 200,000 acres of land. Most speeches thanked the firefighters and first responders. Some asked for continued prayers and good wishes.When Black Panther's Danai Gurira stepped up to accept Action Movie Star of 2018, she offered a version of those thoughts, too, expressing gratefulness in the native tongue of Wakanda before thanking director Ryan Coogler for \"entrusting women to be collaborators and to be front and center and to have space to tell a story with him.\"Gurira's win as Black Panther's fierce warrior-general Okoye was made even sweeter by the four nominees she bested in the category, all fellow superheroes. To win Action Movie Star of 2018, she beat out Chris Hemworth (in Thor: Ragnarok), Chris Pratt (in a non-superhero role in Jurassic World: Fallen Kingdom), Ryan Reynolds (in Deadpool 2), and the Black Panther himself, Chadwick Boseman. She still called each of them \"beautiful\" and said she loved them all.Finally, Gurira's closing sentiments brought her entire speech to another level. \"To the people, to the people, to the people!\" she said to rising applause. \"Thank you for affirming that women and girls, when they're given a chance to hang with the boys, can hang with the best of them.\"Gurira returned to the stage twice more for Avengers: Infinity War's big wins, alongside costars Scarlett Johansson and Pom Klementieff. Watch Gurira's inspiring solo speech above in full.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}