{"id": "\n\n                Pete Davidson Addresses His Ariana Grande Breakup With A Lot Of Jokes, Of Course\n              \n\n", "paragraph": "\n              'Does anybody have any open rooms?'\n        \n          Just two months ago, Ariana Grande stood onstage at the 2018 VMAs, accepting the award for Best Pop, and shouted out her fiancé. \"Pete Davidson, thanks for existing,\" she said. The zeitgeist of their relationship and subsequent engagement, which began in early June, had reached its peak. And then it was over.Since the news that the pair had ended things a little over a week ago, Ari's taken herself off of social media for the time being — though maybe she's back now? Pete, meanwhile, has been off social media for months. But as his trademark hilarious contributions to SNL's Weekend Update consistently remind us, the dude tends to keep it real. So that's what he did over the weekend.At a comedy show co-hosted with Judd Apatow, Pete addressed the elephant in the room with a joke, naturally. \"Well, as you could tell, I don't want to be here. There's a lot going on,\" he told the room, as E! reports. \"Does anybody have any open rooms? Looking for a roommate?\"Pete also apparently took time to address the, uh, \"permanent\" reminders of his and Ari's love that he got inked onto his body during their dizzying summer romance.\"So, obviously you know I, we broke up or whatever, but when me and her first got engaged, we got tattoos,\" he said. \"And it was like in a magazine like, 'Was Pete Davidson stupid?' And 93 percent of it said yes. ... So my boy, he was like, 'Don't listen to that shit, man. They're literally fucking haters.' And I'm like, yeah, fuck that. I'm not stupid. And the other day we were in my kitchen and he was like, 'Yo bro. Turns out you were stupid.'\"No word on the status of the Piggy Smallz tattoo, but believe that we're all holding our collective breath to find out. Relive the highs and lows of Pete and Ari's relationship in the MTV News video below.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}