{"id": "\n\n                Is Stephan And Kayla’s Co-Parenting Relationship Doomed On Young And Pregnant?\n              \n\n", "paragraph": "\n              A judge told the young dad to start paying up -- and he wasn't happy about it\n        \n          Considering Kayla and Stephan are no longer a couple on Teen Mom: Young and Pregnant, they’re doing pretty well in keeping things civil for the sake of their son Izaiah. But a new court-ordered arrangement, in which the state required Stephan to pay child support, could take these two a few steps backward in their co-parenting relationship.On tonight’s episode, Kayla told her friend and mom she felt “awkward’ and “nervous” to be going to court with her ex, especially because it was the state of Illinois (and not her) that mandated the hearing.And after three hours in court, things got more awkward — the judge ruled that Stephan must get a job and pay $128 a month toward his son’s expenses.“That’s like a pack of diapers,” Kayla told her best friend Annabelle. She added that “Stephan was cranky because...they ordered him to find a job. If he doesn’t, he could be in contempt of court... I know he’s pissed right now, but I feel like it’s good for him.”And Kayla was right. Stephan was angry with what went down but also felt as though Kayla had more to do with the child support request than she said.“I’m skeptical of Kayla,\" he told a pal. \"I feel like she knows more than what she be portraying...[but] my goal is to make sure that Izaiah is going to grow up right.”Do you think Kayla was secretly behind the court order? And will her new arrangement with Stephan mess up their co-parenting situation or help them move forward and be equal parenting partners for Izaiah? Tell us your thoughts, then keep watching Young and Pregnant Mondays at 10/9c.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}