{"id": "\n\n Jersey Shore Hookup: Is Ronnie About To Have Another 'French Fry Moment'?\n              \n\n", "paragraph": "\n              Jewish Barbie + a hot tub = trouble\n        \n          Single Ronnie may be making a comeback.Tonight's installment of Jersey Shore: Family Vacation Part 2 saw Ariana's dad text-fighting yet again with his on-again, off-again girlfriend and baby mama Jen.\"Here I am with my friends, and I'm just going through it right now fighting with Jen through text message. I think I've reached my breaking point,\" he shared, just before adding, \"You know what? F*ck this. I'm gonna have a good time.\"Truer words were never spoken, because when Angelina's friend Lindsay (aka Jewish Barbie) hit the scene at Headliner, Ronnie was all about a good time and invited her back to the shore house. (No matter that Pauly and Vinny were also flirting up a storm with the brunette beauty.) Cue the ever-present voice of reason in the form of JWOWW: \"Why is she coming back to the Jersey Shore house? To f*cking play checkers? Don't you have a girl at home? And a child?\"Upon playing a much tamer version of \"F*ck, Marry, Kill\" with Lindsay, the roommates knew it was game over when she said she would marry Pauly D... but f*ck Ron. \"Oh, my God -- it's happening,\" Snooki said. \"He might be cheating.\"Ronnie, on the other hand, was a bit more relaxed regarding his shapely visitor. \"Everyone thinks this is gonna be a French Fry moment. Listen, I'm not spiraling like that... yet,\" he said, vowing to \"not go down that road again.\"But alas, the hot tub and Jewish Barbie's sexy blue bikini were soon thrown into the mix -- and naturally, Ronnie had to go with her to \"check the water and make sure it's wet\" (Pauly's words).\"Women in hot tubs are Ronnie's kryptonite,\" Mike said. \"Ronnie is playing with fire right now ... and I don't think [Jen] is going to be happy about this.\"We're gonna go out on a limb and say probably not, especially since Jen started texting JWOWW during the two-person jacuzzi fest, inquiring into Ronnie's whereabouts.\"He is a good guy, but he is a bag of dicks in a relationship,\" said JWOWW. \"It's the same thing as Miami all over again.\"But what do you think? Will Ronnie really do a repeat of Miami, or has he learned his lesson? Tell us your opinion, then find out what happens on Jersey Shore: Family Vacation on Thursday, November 29 at 8/7c.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}