{"id": "\n\n                Supposed Cease Fire: Are Family Vacation's Ronnie And Jen Really Past Their Drama?\n              \n\n", "paragraph": "\n              Or is this part of, as JWOWW so eloquently put it, some 'next-level mind f*ckery'?\n        \n          It's about to get \"savage AF\" in Jersey... or maybe not?Following \"a bunch of unfortunate events\" relating to his on-again, off-again relationship with Jen, a freshly coifed Ron (sans arm sling) surprised the Jersey Shore: Family Vacation Part 2 gang at Deena's gender-reveal bash. When asked about his baby mama drama, he said the two were \"trying to work things out,\" going so far as to seek couples counseling. As for his roommates' take? Hella skepticism.\"I'm honestly scared,\" confessed Vinny. \"This is a serious thing. Jen literally dragged Ronnie with a car, and she went to jail. So that whole situation terrifies me.\"Just days later, the crew -- and a few of their significant others -- headed to Atlantic City to celebrate two very special birthdays and a certain DJ residency, though it was unclear whether Ron would be riding solo.Basically, everyone's fingers were crossed. \"If Ronnie brings Jen to Atlantic City, I think it's gonna be a disaster,\" Pauly said. \"In Vegas, it brought the mood down completely, and I do not want that to happen in Jersey.\"Despite arriving by his lonesome (YAS!), it wasn't long before Ron was exchanging a series of heated text messages with Jen, which Mike dubbed \"a buzzkill.\"\"It doesn't surprise me at all, because it happens everywhere we go,\" the Situation shared. \"I just hope that particular energy doesn't get seeped into our weekend.\"Mike spoke too soon, though, as it was then that Ron asked everyone if they \"mind if [Jen] comes to Pauly's gig tomorrow,\" adding that he \"would love for her\" to hang. SAY WHAT?Never one to hold back, Jenni echoed everyone's thoughts: \"WTF, Ron? You didn't go to Seaside because you were dragged by a car, and now you're like, 'Yeah, be cool with her.' Like, I don't know where to go with this. This is next-level mind f*ckery.\"When questioned, Ron said their fighting had \"ended\" and that they've \"actually been good recently.\" That sounds... familiar?\"Ron is telling us that the fighting with Jen has ended. That's like him saying that the fighting with Sam has ended,\" noted Vinny. \"[And] we all know, it's never ended.\"So is Ron just rolling down that same ol' river in Egypt (it's called \"denial\"), or could his relationship truly be on the upswing? Tell us your predictions, and watch the AC insanity go down next Thursday at 8/7c.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}