{"id": "\n\n                Starter Pack: 5 CupcakKe Songs To Know So You Can Start Stanning\n              \n\n", "paragraph": "\n              CupcakKe's must-hear discography\n        \n          Every week, TRL presents a starter pack of songs you need to know to begin stanning a new artist. This week's Starter Pack belongs to none other than Chicago rapper CupcakKe.Since skyrocketing to online fame with \"Deepthroat\" in 2015, CupcakKe hasn't stopped making music. Dropping Ephorize and Eden this year alone, CupcakKe's up to six albums as she continues to command attention from online niches and mainstream music publications alike.If you're just learning about CupcakKe, these five songs should do the trick.\"Money,\" CupcakKe (2012)As her debut video uploaded to YouTube, \"Money\" is a far cry from a lot of the NSFW CupcakKe bops fans first heard. Though this song might make it seem that she only cares about her bank balance, the 21-year-old rapper now uses her viral video cash for a good cause, regularly making headlines by helping out fans in tough financial situations.\"Deepthroat,\" CupcakKe (2015)Don't put this one on at work, but \"Deepthroat\" is the song that launched it all for CupcakKe. While her dirty lyrical work is a huge part of what makes her stand out, CupcakKe's equally-sexual visuals for those lyrics have helped push ten of her music videos past the one million views mark.\"Lgbt,\" CupcakKe (2016)Though she came to fame with what fans call her \"hoe songs,\" CupcakKe wouldn't be where she is today without the die-hard support of her core, LGBTQ fanbase. \"Lgbt\" is also proof that the rapper can do more than \"hoe songs\"—see the social justice-oriented \"Picking Cotton\" as a further example.\"Lipgloss,\" Charli XCX feat. CupcakKe (2017)For long-term fans of CupcakKe, \"Lipgloss\" was confirmation that she wasn't just a fad, getting support from a mainstream pop artist like Charli XCX. The two have even performed together several times, collaborating on \"I Got It\" with Brooke Candy and Pabllo Vittar later the same year.\"Blackjack,\" CupcakKe (2018)Production value has only gone up for both CupcakKe's audio and visuals, perfectly exemplified by the lead single \"Blackjack\" off her latest album, Eden. The song and its video sum up CupcakKe's current era: perfected enough to garner attention from mainstream artists and media, but unafraid to stick to her \"hoe song\" roots. © 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}