{"id": "\n\n                Will Antipathy or Change Determine Young Voter Turnout?\n              \n\n", "paragraph": "\n              \" I have faith in young voters to make the right decisions, make some noise so people wake the fuck up.”\n        \n          By Aisha K. StaggersIn early 2018, polls showed how enthusiastic millennials were about November’s midterms. By summer, though, confidence in voters under 30 was beginning to wane. In an article in The Washington Post, Emily Guskin writes that “low enthusiasm” coupled with a history of “anemic turnout in midterm elections” doesn’t hold the same expectations once held at the start of the year. In fact, registered voters ages 18–29 only increased by 0.6% on average in battleground states following the Parkland shooting in February. It seemed millennials had become apathetic.Young women register to vote at the South Bay Pledge to Vote Rally on September 22, 2018 in Torrance, Calif. Like Gen Xers before them, millennials grew up in a world different than that of their parents. Those under 30 have grown up in a world in which socio-political realities like mass shootings in schools, once unfathomable, are now commonplace. Millennials don’t seem to apathetic, but they so show antipathy towards authority and the values of generations past, generations that promised them a better world than the one they grew up in.On its own, antipathy can be a negative, however millennials have found a way to turn it to their advantage, launching the most effective and innovative social movements this country has seen since the 1960s. Armed with new ideas and strategies voters under 30, particularly women, are motivated in this midterm cycle.Kelsey Baum, a senior at College of Charleston in South Carolina is unwavering in her stance that millennials can and will change those outcomes if they show up at the polls in November.“I believe that fulfilling our civic duty of voting is more important now than ever before. I voted for the first time in 2016 and it was liberating to feel like I had a say in the leadership I wanted to see. Some people think their vote won't make a difference, but to even have our voices heard is a privilege that should not be taken for granted.”Minda Harts, author of the upcoming book, The Memo, is ideologically different from their parents and grandparents. “I am a registered Democrat, grew up in a Republican house. I broke tradition and voted for issues I felt were important to me.” Harts is “excited that women of color are voting in record numbers” and “believes in giving your time or money to the political process. So much is at stake right now that it will require all hands on deck to preserve our inalienable rights.”A student of College of Holy Cross in Massachusetts, who asked only to be identified as Carter M., is interning with Mass Victory, an organization that promotes Republican candidates in Massachusetts through grassroots efforts. Carter M. believes the critical issues of our time are often interconnected like the economy and the opioid crisis. These issues are salient enough to merit his advocacy and support. “The economy has been strong over the past few months, with the U.S. Labor Department reporting a 49-year low of 3.7% [in September]. If politicians continue to push for job growth and tax cuts, our economy will remain prosperous.” As for the opioid crisis, Carter M. believes it is too big an issue to be solved by a single party. It is one issue he feels has bipartisan support in Congress and that if such efforts are continued, we may see fewer opioid deaths.MoveOn.org is working to appeal to under 30 voters on the political left and is putting its support (and money) behind candidates including Chloe Maxmin, founder of First Here, Then Everywhere, and a Democratic candidate for Maine state House District 88 candidate. Identified by MoveOn as “a grassroots community organizer for the environment,” Maxmin, 26, won her primary with 80% of the vote.Camden Hunt is a freshman at College of the Atlantic in Bar Harbor, Maine, and is a first-time voter by absentee ballot in his home state of Virginia. Hunt was drawn to the same issue Maxmin is running on in Maine. “I voted mainly on an environmental stance, something I find to be very important, especially in this era of climate change and denial.” In a candidate Hunt looked for “integrity and trustworthiness, but most importantly the ability to be open minded and progressive.” Hunt is “more liberal” in his thinking than his parents and that is perhaps why he views this midterm as a change election for his generation. For the race to 2020, Hunt says, “I am looking for environmental and civil rights opinions in 2020, and I’m hoping to see Kamala Harris run!” De’Aria Anderson, a 24-year-old associate at Inkhouse in New York City, is ideologically similar to her parents in her views, but does feel she’s more left-leaning than they are, particularly on human rights. She wants more candidates to know their actions affect how she votes. “I'm not necessarily looking for particular candidates. I am hoping that there will be some unity on the left to support the best candidate.”Anderson also has a message for those who do not see this as a change election in an “ugly” political climate.“There is really no better word for it. Things are so bleak in the world of politics on both sides and it's scary to see some of the extremist coming out of the shadows. But midterm elections are always capable of change. I have faith in young voters to make the right decisions, make some noise so people wake the fuck up.”Perhaps that is the lesson to take away from millennials about the importance of the upcoming midterms and the importance of now—to “wake the fuck” up. If the generation who never heard the words “a black man will never be president in my lifetime,” doesn’t know a time women weren’t actively seeking the presidency or hoping to be seated as VP, was born post-9/11, with active shooter lockdown drills as the norm, never lived in a world where the queen bee was not King Bey or that a simple social media hashtag can not only drive the direction of our political discourse, but shape public policy can wake up, surely, then, can the rest of us.Aisha K. Staggers is a writer, lecturer, and co-host of \"Staggers State of Things\" on the Dr. Vibe Show and the upcoming \"Women of a Certain Age\" radio show and podcast. @AishaStaggers  Ever wondered how many candidates under age 30 are running in your state? MTV News has got you covered. Click here for the map. © 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}