{"id": "\n\n                This 20-Year-Old Artist Carves Pumpkins Of Your Faves Every Halloween\n              \n\n", "paragraph": "\n              Why Don't We and Camila Cabello and Shawn Mendes pumpkins, oh my!\n        \n          Super fans dress up as their faves for Halloween. Super duper fans carve deeply-intricate portraits of their faves and their album art into pumpkins for Halloween!That's the prerogative for Megan, a 20-year-old artist whose pumpkin carvings have caught the eyes of fellow stans. Megan's IRL-to-pumpkin comparison photos often rack up thousands of likes on her Twitter and Instagram pages.In 2017, Megan's intricate carvings of Camila Cabello, Shawn Mendes, Ed Sheeran and Taylor Swift caught the eyes of fans across the internet. It was Taylor Swift, in fact, who was at the core of how this all started a year earlier.\"The pumpkin carving actually started out as a bet with my sister in 2016,\" Megan told TRL over Twitter direct messages. \"She told me if I could carve the cover of 1989 on a pumpkin almost perfectly she would fly with me to Austin, Texas to see Taylor Swift’s Formula 1 concert.\"Taking the bet seriously, Megan carved a perfect set of Taylor pumpkins and discovered a new, spooky talent. And yes, she got to go to that concert in Texas.There weren't many tutorials for the detailed, shading-based type of pumpkin carving that Megan has perfected, but with a lifelong passion for art and design, the technique came naturally.\"It’s all about carving different depths to create shading,\" Megan told TRL about her method. \"The more you carve out the lighter the pumpkin is, and vice versa. I mostly use an x-acto knife to do that but I also use clay modeling tools and a pumpkin drill.\"Last year's carving of Shawn Mendes went particularly viral with more than 11,000 likes on Twitter. Not only has Megan mastered Shawn in pumpkin form, but as a fan she's met him a few times, too.\"Not only do I love his music, but also his character,\" Megan said. \"He’s so genuine and real with his fans. He treats us almost like his friends.\"This year, Megan has already begun her pumpkins for Halloween, including a carving of Why Don't We's album art for 8 Letters that's caught the attention of the boy band itself. Daniel responded \"no way\" to the pumpkin, Jonah followed her and the main band account retweeted the photos.\"I loved every song on the album,\" Megan said of her newfound love for Why Don't We. \"It’s inspiring to see such young artists do what they do and be so successful.\"With Halloween quickly approaching, Megan has more pumpkin plans for 2018. \"I’m planning on carving the cover of Shawn’s new album,\" Megan said, \"and another Taylor Swift one of her AMA performance. But I‘m also going to be carving some for a few local businesses, too.\"Watch out for Megan's pumpkin carving talent to continue to blow minds on her Twitter and Instagram, right in time for the peak of spooky season!© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}