{"id": "\n\n                Ashley Tisdale Is Back! Hear Her Vulnerable New Song 'Voices In My Head'\n              \n\n", "paragraph": "\n              Her first new song in nine years was inspired by her struggle with anxiety\n        \n          This year has already given us unexpected comebacks from Avril Lavigne and Ellie Goulding, and now another beloved pop star is making her grand musical return.On Thursday (November 8), former Disney starlet Ashley Tisdale unleashed her first new music since the release of her 2009 album Guilty Pleasure, which gave us such certified bops as \"It's Alright, It's OK.\" Tisdale has obviously grown up a lot since then — would you believe me if I told you she was 33?! — and that's reflected in \"Voices In My Head,\" which sees her bridging the gap between her pop roots and her more recent acoustic material.\"I got these feelings I try to bury down / But they keep screaming / And I'm just tryin' to filter out somehow / But they don't wanna leave,\" she sings on the intimate ballad, revealing her insecurities while also acknowledging her lover's unwavering support. \"They get in the way / And start a fire / But you never let us burn away / You've got me figured out.\"\"Voices In My Head\" is the first taste of Tisdale's upcoming third album, Symptoms. Per Teen Vogue, the singer recently revealed that the project is largely inspired by her struggles with anxiety. \"Kind of the inspiration behind [the album] was, I deal with anxiety, and I've dealt with it probably my whole life. But [I] became super aware of it over the last two years,\" she said, adding, \"If someone at home can turn it on and not feel so alone, that's all I can do.\"Following the song's release on Thursday, Tisdale admitted she was \"overwhelmed with emotion. ... I feel like for the first time I can finally breathe.\" Sounds like Symptoms will be quite the emotional journey — fingers crossed it's worth the nine-year wait!© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}