{"id": "\n\n                Snooki Has A New Cooking Show (Even Though She's Clueless In The Kitchen)\n              \n\n", "paragraph": "\n              'Cooking in the Crib with Snooki & Joey' is coming to the newly launched 'Jersey Shore' YouTube channel\n        \n          Nicole \"Snooki\" Polizzi loves her pickles and her wine -- and the Jersey Shore housemate is about to showcase her passion for food and beverages in a whole new type of arena.Viacom Digital Studios (VDS) just launched a dedicated Jersey Shore YouTube channel where fans of the iconic series will be treated to exclusive, original content starring their favorite housemates from one of television's biggest pop-culture hits (check out highlights in the video below). First up on the programming slate: Cooking in the Crib with Snooki & Joey. This nine-episode series features everyone’s favorite Jersey girl in the kitchen whipping up some delights. But unlike every other cooking show out there, Cooking in the Crib with Snooki & Joey has a host who chooses each week’s recipe and has none of the skills required to actually make said dish. Relying on the help of her BFF Joey Camasta -- and a rotating cast of guests to do the work behind the stove -- each installment features Snooki attempting to learn how to make a dish along with the audience. Bring on the hopefully tasty cuisine!But that's not all: Moms with Attitude features Snooki and her bestie Jenni \"JWOWW\" Farley as they share musings about motherhood, sex and drinking. Meanwhile, \"Sneak Peeks,\" debuting today, is a first-look preview at new linear episodes of Jersey Shore: Family Vacation. And Joey Reacts to the Jersey Shore, coming on October 29, stars Camasta as he reacts to all the past epic hookups, blowouts and WTF moments from the shore.Visit the Jersey Shore YouTube channel here -- and be sure to keep watching Jersey Shore: Family Vactation Part 2 every Thursday at 8/7c!© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}