{"id": "\n\n                I Can't Believe EXO Is Finally Back And Kai Is Wearing A Crop Top\n              \n\n", "paragraph": "\n              The K-pop stars switch up the 'Tempo' with their eclectic new single\n        \n          It's been a minute, but South Korean favorites EXO are finally back with their fifth studio album, Don't Mess Up My Tempo. And they're kicking off this new era with \"Tempo,\" a catchy melodic anomaly that, true to its name, seamlessly switches up the tempo from smooth R&B, to retro pop, to hip-hop, to acapella — all in under 4 minutes. If the rhythmic hook doesn't immediately grab your attention (\"don't mess up my tempo,\" they plea), then the unique vocal bridge — acapella kings! — should do the trick, featuring EXO's stacked vocal line and their dynamic harmonies. Or, perhaps main dancer Kai looking fierce in a crop top is more your speed. There's something for everyone! Speaking of the video, it's a real trip. Starring all nine members — \"Tempo\" marks Lay Zhang's long-awaited return to the group — the stylistic visual is both modern and nostalgic, putting a cool twist on label SM Entertainment's typical \"box\" format. The motorcycle-gang aesthetic from the teaser images was a bit of a red herring; instead, the slick video features the group moving through various sets — a bar, a bedroom (the creaking bed sample does not go unnoticed on the hook), an interrogation room, and, of course, a dance floor — with a mature color palette that may be more muted than \"Ko Ko Bop\" but packs just as much personality. While Lay doesn't have much to do in this video — he's primarily a cameo — he is heavily featured on the Chinese version of the single, which also dropped today (November 2). The album features 10 new tracks, including the Latin-pop \"Ooh La La La,\" which was co-written by American hitmaker Bazzi (who also worked on \"The Eve\" off the group's last album), and the smooth \"Bad Dream,\" an R&B track with a disco hook. Just like its lead single, Don't Mess Up My Tempo defies all genres — a distinct marker of an EXO production. © 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}