{"id": "\n\n                Halsey's Heartbreaking 'Without Me' Video Stars A True G-Eazy Lookalike\n              \n\n", "paragraph": "\n              Watch her persevere through a toxic relationship\n        \n          Halsey has said that her most recent single, the angst-ridden break-up ballad \"Without Me,\" is her most personal one yet — in fact, it's the first she's written under her real name, Ashley. As such, she's ditched her knack for high-concept, Shakespeare-inspired videos and given the new song an intimate vid that portrays destructive relationships she's witnessed.Released on Monday (October 29), the video stars a pink-haired Halsey and a guy who couldn't possibly look any more like G-Eazy without being the rapper himself (it is, in fact, an actor named Will Brandt). Director Colin Tilley captures the pair through cycles of drinking, partying, and fighting, as Halsey laments taking on her partner's demons and receiving nothing in return. In the end, the G-Eazy doppelgänger is taken away in a cop car (perhaps an allusion to a real-life event?) as Haley is left alone, seemingly stronger than ever.Taking to Twitter after the video's release, Halsey called it \"a really amazing and emotional process.\" She wrote, \"The story is a reflection of a combination of relationships I've been in, or watched the people I love go through. It's a reminder that you deserve more. And it's okay to not want to be taken advantage of. By your partners, your friends, your family. You deserve happiness. Don't be afraid of going and finding it.\"It's no secret that Halsey has had a tumultuous relationship with G-Eazy — they've been repeatedly on and off, and reportedly broke up again earlier this month. The singer admitted in a recent interview with Zach Sang that writing \"Without Me\" ultimately led to their breakup because it allowed her some perspective on how the relationship had affected her life.\"I listened to what I wrote and went, 'Oh my god, is that how I feel? If that's how I feel I need to put the pause on this thing right now,'\" she said. \"I'm obviously talking about my relationship. So the song happened first. And it was just like, this moment of sincerity.\"\"Without Me\" marks Halsey's first new solo track since 2017's Hopeless Fountain Kingdom, and could be a sign that the singer's next album is on the way. If the new song is any indication of what's in store for album number three, expect to see more sides of Ashley than ever before.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}