{"id": "\n\n                This Sabrina Carpenter Stan Transformed Into The 'Singular: Act 1' Tracklist\n              \n\n", "paragraph": "\n              \"Sue Me. I put Singular on my face.\"\n        \n          From streaming to buying to promoting, there's not just one way to support your fave on album release day. And if your fave is Sabrina Carpenter, you might just think to paint her Singular: Act 1 tracklist on your face.That's the story of Kristine, a high school student and dedicated Sabrina stan who pulled off an all-Singular makeup look by featuring the album's eight tracks on her face. Kristine tweeted the finished product in response to Sabrina the morning after the pop star's album dropped.A loyal Sabrina stan would recognize that this isn't just eight tracks painted over Kristine's face. The colorful backgrounds behind each song title correspond to Sabrina's own album aesthetic, matching the graphics of her tracklist announcement last month.A post shared by Sabrina Carpenter (@sabrinacarpenter) on Oct 22, 2018 at 1:40pm PDTA post shared by Sabrina Carpenter (@sabrinacarpenter) on Oct 22, 2018 at 1:40pm PDTA post shared by Sabrina Carpenter (@sabrinacarpenter) on Oct 22, 2018 at 1:40pm PDTAs extra as this makeup look might be, it's totally natural for Kristine, a long-time fan of Sabrina since discovering her in the \"best show ever\" Girl Meets World and her Eyes Wide Open album.\"Ever since then, I felt so connected to her music and always felt that it linked up with my life\" Kristine told TRL over direct messages. \"She's always been one of my biggest role models and her music means so much especially for young women navigating their lives and love.\"And for as much as she loves Sabrina, Kristine's got a passion for makeup, too. That's why she knew she'd nail a makeup look inspired by the Singular: Act 1  tracklist artwork.\"I absolutely love makeup and have been doing fun, experimental looks for a few years.\" In terms of her artistic vision, Kristine explained, \"Sabrina posted three Instagram photos of her tracklist and they are SO beautiful, I fell in love with it and it made me that much more excited for Singular: Act 1 to come out!\"As far as Singular: Act 1 goes, the brand new album definitely lives up to Kristine's expectations. While \"Sue Me\" and \"Paris\" might be her standout favorites right now, Kristine says that Sabrina's whole album is \"the only album I need to listen to now.\"Sabrina's new LP isn't the only thing Kristine had to be excited about this morning, though. Just hours after tweeting her fave the makeup look photos, Sabrina responded and gave her endorsement.Considering Kristine hasn't had the chance to see Sabrina live and meet her yet, this interaction is a dream come true.\"I was so excited when I saw her reply that I left my class to go to the bathroom stall!\" Kristine said. \"I was so excited I started shaking a little!!\"Though listening to Singular: Act 1 probably won't calm Kristine down, it's nevertheless what she and and the rest of Sabrina's fandom will be doing for the rest of the day.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}