{"id": "\n\n                Will Teen Mom OG's Cory Try To Make A Move On The Newly Single Cheyenne?\n              \n\n", "paragraph": "\n              When he heard that Zach is history, Ryder's dad made an interesting comment...\n        \n          Well, we guess Cheyenne and Zach didn’t improve their communication after their BBQ blow-up argument after all — on this week’s Teen Mom OG, Cheyenne ended her relationship with her boyfriend-turned-roommate after another fight. So what went down — and more importantly, could this change things on the romantic front for Chey and Cory?Chey told her friends that she and Zach got into a big disagreement. The reason: Zach felt like she purposely told him to go to a family function he'd planned to attend and not accompany her to the street fair she planned to attend -- one that she'd be going to with Cory. As she told it, Zac then came home drunk and yelled at her, seemingly bitter that he wasn't her escort for the day.  “He says, ‘You look like you about to go get f*cked,’” she said. “He kept going, said I’m weird, called me a bitch. And then I lost it. I packed his sh*t. I don’t know how we come back from this. At this point, we are broken up. He’s out.”She also expressed her worries to pals about ever finding a man due to her “baggage.”“That’s a lot to bring a person into. Who’s gonna wanna deal with me plus a baby -- plus I’m best friends with my baby daddy?” she cried. “My baggage is way too much. I seriously feel like I’m just gonna be a single mom forever.”Well, maybe not if Cory has something to do with it. When Chey later broke the news to Ryder’s dad that she kicked out her beau, he originally thought that they were just giving each other space. But when Chey said point blank that they’re over, Cory had an interesting reaction.“When can I move in?” he joked. “Get out,” Chey laughed in response.But do you think Cory was really joking, and will he really try to get with Cheyenne now that she's single? Even more important, should the two keep things platonic like they've always been or give romance a shot? Share your thoughts, then keep watching Teen Mom OG Mondays at 9/8c.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}