{"id": "\n\n                Family Dispute: Teen Mom OG's Maci Is Clashing With Ryan's Parents\n              \n\n", "paragraph": "\n              The source of their conflict? Bentley's education\n        \n          Maci was at odds with Ryan’s parents on this week’s Teen Mom OG -- all because they disagreed about where Bentley should attend middle school in two years. For their part, Jen and Larry were pushing for private school, but Maci felt there was no reason to remove him from his public school environment.The Edwards argued that since Ryan had the funds to send Bentley to private school, it was a no-brainer -- and that Ryan was “adamant” about his son getting a private school education. Plus, they reasoned, Bentley would be able to play baseball in private school, getting a leg up before high school.Maci, however, felt like public school was a better fit for him, especially given his unusual upbringing.“Part of me thinks that just from the fact that Bentley had grown up in an odd family situation and on TV, public school is better for him,” she told her husband. “He gets exposed to a lot of different walks of life. I don’t want Bentley to think he is on a pedestal -- or belongs on one -- being on TV.”Taylor, meanwhile, didn’t think Benny fully understood what private school meant beyond the materialistic aspect and didn’t want to give him special treatment. Plus, he wondered, if Bentley went to private school for $25,000 or more a year, would they have to send his siblings Jayde and Maverick there one day too?But more importantly, Maci was upset that Jen and Larry broached the subject with the fourth grader without even talking to her about it first -- and then made him believe he could go if he so desired.“He just expects that when he wants something at Jen and Larry’s, he gets it,” she said.The schooling decision is ultimately Maci’s to make since she has full custody, but will she change her mind? Or will this disagreement spark more issues between Maci and Jen and Larry -- and, ultimately, Ryan? Tell us your thoughts, then keep tuning in to Teen Mom OG Mondays at 9/8c.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}