{"id": "\n\n                6 Stages of Josh Peck And Miranda Cosgrove's Reunion On David Dobrik's Vlog\n              \n\n", "paragraph": "\n              \"You look good, boob!\"\n        \n          David Dobrik did it again. A year after reuniting Drake Bell and Josh Peck on his channel in 2017 -- eleven years after the end of Drake & Josh -- David worked his magic for a Josh Peck and Miranda Cosgrove reunion.It all went down on David's YouTube channel, on which Josh is a regular guest. \"I haven't seen Josh in four years, five years,\" Miranda told David, making the stakes that much higher for the surprise reunion for Josh. Here's how it all went down, stage by stage, on David's vlog.Stage 1: SuspicionIn a seemingly all-too-nice situation, David gave Josh a gift following his August baby news announcement. Almost right away, Josh thought there had to be something else going on.Stage 2: RealizationDavid admitted that, yes, something else was going on. The baby gift wasn't from him, but was rather from Josh's \"sister.\" That's when things clicked.Stage 3: AppreciationMiranda turned the corner and Josh and her immediately hugged, making up for lost hugs over the last four or five years.Stage 4: Familiarization\"You look good, boob,\" Miranda told Josh, bringing back a nickname that her character Megan regularly called her brothers on Drake & Josh. It immediately made things a little more familiar for Josh, Miranda and every fan of the show.Stage 5: DiffusionJosh addressed the elephant in the room: his June 2017 wedding, which included no invites for Miranda or Drake. But as is clear from Miranda's reaction, there aren't any hard feelings.Stage 6: RedemptionMaybe Miranda acted cool since she was planning her next move: a prank on Josh, something Drake & Josh fans got used to over the years. Even more importantly, fans just wanted to hear Josh scream, \"Megan!,\" bringing back another staple of the show.Obsess over every second of Josh and Miranda's reunion, and its behind-the-scenes planning, in David's new vlog below.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}