{"id": "\n\n                Here’s Why K-pop Fans Are Making Up Totally Fake Facts About Their Faves\n              \n\n", "paragraph": "\n              What's with all the low-quality, false graphics on Twitter and Instagram?\n        \n          Jungkook isn’t afraid of washing his hands. Olivia Hye isn't offended by people with peanut allergies. And BTS definitely won't be performing “Telephone” by Lady Gaga and Beyoncé anytime soon.But if you’re an unassuming K-pop fan who stumbled upon one of the many totally fake \"fact\" accounts on social media, you might wind up believing those lies are true. Over the past few months, accounts that produce hilariously absurd — and very untrue — graphics on Twitter and Instagram have gained popularity among K-pop fandoms. But why?The similarities are pretty rigid between the most prominent fact accounts, all of which thrive on the low-quality nature of their images. Most accounts source their facts from their followers, who submit them via direct messages or CuriousCat, a website that allows users to anonymously send comments and questions. With mismatched fonts, blurry photos, and misspelled words, there's a standard protocol in the fake-fact business.More than anything else, it's the out-there ideas for the facts themselves that are the key to a successful post, according to interviews with the creators behind these popular accounts.\"It feels like we know the girls and their personalities,\" Jac from Canada told MTV News about her account, @loonafacts12, which creates fake facts for the members of rookie K-pop girl group Loona. \"So when I write a fact that’s very blatantly untrue, I think that people find it funny because they know the girls would never do that, but it’s still funny to imagine.\"It's all about being in on the joke for die-hard fans who would never fall for the made-up facts that a less-connected fan might believe. These facts are finely tuned to be funny in relation to the pop star they're parodying.\"I just think they find the whole concept funny,\" said @legitbtsfacts owner Sofia from the U.S., \"because the things I say would definitely correlate with the member I chose for that 'fact' based on their personality.\"According to @SuperJuniorFact owner Erin from France, who runs the Super Junior account with her friend Karla from the U.S., this kind of weird, taboo humor can be considered \"cursed content.\"\"It’s content that makes you cringe the longer you see it and makes you just want to put your phone down for a second to reevaluate your life choices and how they led you there,\" Erin told MTV News. \"It’s not a set aesthetic or set in stone, it’s more of a feeling that we want the public to feel.\"But not all fans are in on the joke, which can make things awkward for these content creators. Some accept the graphics as fact or completely misunderstand that they're only intended as jokes in the first place.\"It’s very rare,\" Jac said, \"but occasionally people will tweet or comment on Instagram accusing us of posting these facts maliciously or saying they believed one of the facts until they read other ones.\"It's that backlash that can also help fake fact accounts grow, as is the case with @jungkookfacts97 — an account dedicated to BTS' youngest member and main vocalist, Jungkook.\"The account blew up late August,\" the owner said, \"after an account with 50,000 followers told everyone to report my facts, and that's when I got the most hate. I got around 900 comments over a few days and most of them were people getting very angry with me because of the facts.\"Despite the criticism, the owner admitted that she's not doing much to curb the drama on her account, instead presenting her facts as legitimate. \"We always state that the facts are 100% real and that we'd never post a fake fact.\"Beyond just misinformation, fake fact accounts also push the boundaries with posts about politics, violence, and NSFW topics not often broached in the world of K-pop. Some account owners, however, are willing to take things further than others.\"I like kind of pushing the boundaries of what's 'OK' to post,\" the @jungkookfacts97 owner said. \"But if something is a little more controversial I might send it to my friends who help me [run] the account to see if they think it's too much.\"Sofia adopts a similar strategy with her friends when it comes to posting controversial content. Meanwhile, Erin and Karla prioritize Super Junior's own reputation when making sure not to publish jokes that could reflect poorly on the group and its fandom.For the most part, the riskiest fake facts skew progressive and liberal, which Sofia attributed to the diverse makeup of the fanbase.\"Since majority of the fandom is a part of the LGBT community,\" she explained, \"I think they find the facts funny and relatable to their own personal circumstances since it deals with their faves.\"Jac agreed, saying, \"Facts that express political or social ideas that are mainly liberal receive a lot of attention ... This might be because they take stances that majority of the fandom, including me, has as well.\"For fans of K-pop idols — who aren't typically allowed to speak out about politics and controversial subjects like LGBTQ issues and mental health in Korea — these fake fact accounts give voice to the fanbases' progressive ideals. And by putting those views into the voice of their faves, fans create their own ideal reality, one where the groups that they stan can voice their opinions freely. Ultimately, that's why these fake fact accounts keep sprouting up across K-pop fandoms — and are beginning to spread to others. So while fake fact accounts push boundaries and potentially spread misinformation, they're really just serving as the internet voice of K-pop's creative, diverse fandom.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}