{"id": "\n\n                Drake's Producer 40 Gave Up The Info About His Son, Pusha T Says\n              \n\n", "paragraph": "\n              'It didn't come from Kanye at all,' Pusha revealed\n        \n          One of the biggest hip-hop stories of 2018 remains the revelation that Drake apparently had a son in secret. Pusha T first dug up the dirt and aired it out on his vicious dis track \"The Story of Adidon\" back in May, rapping, \"We talkin' character, let me keep with the facts / You are hiding a child, let that boy come home / Deadbeat mothafucka playin' border patrol, ooh / Adonis is your son and he deserves more than an Adidas press run, that's real.\"Drake seemed to confirm the allegations on his album Scorpion the following month, stating on the melancholy \"Emotionless\" that, \"I wasn't hidin' my kid from the world / I was hidin' the world from my kid.\" But one of the lingering questions from this entire saga remains where exactly Pusha got his intel from. Signs potentially pointed to Kanye, who produced Pusha's DAYTONA album earlier this year (and who's long been engaged in a cold war of sorts with Drake), but 'Ye denied it in a tweetstorm in September.Pusha himself appeared on Joe Budden's podcast on Wednesday (October 17) to lay the matter to rest, admitting that his information came from Noah \"40\" Shebib, Drake's trusted collaborator and co-founder of OVO Sound.\"The information came from 40. It didn't come from Kanye at all,\" Pusha said. \"40 is sleeping with a woman, he talks to her daily five or six hours a day, provides opportunity for... and ultimately speaks about how he's disgruntled about certain things. Notoriety and things involving Drake and his career, so on and so forth. With that also came the fact that Drake has a child. With that also came the trip that everybody took to go see the child and bring him gifts and all this information. She divulged this information. That's where it came from.\"Pusha's claim comes after Drake's recent admission that he'd recorded a dis track aimed at Pusha after \"The Story of Adidon\" but left it on the cutting-room floor. Of course, there's enough to delve into on \"Duppy Freestyle,\" the shot Drake fired after Pusha’s initial dis, \"Infrared,\" that ignited this entire beef.Interestingly, on \"Adidon,\" Pusha also directs some of his ire at 40 himself, who suffers from multiple sclerosis. \"OVO 40, hunched over like he 80, tick, tick, tick / How much time he got? That man is sick, sick, sick,\" he raps.You can hear the whole conversation in context, and much more, by listening to the entire episode below. And if you need a refresher, listen to \"The Story of Adidon\" above — then maybe go for a walk outside.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}