{"id": "\n\n                Pop Quiz: What's Your Go-To Karaoke Song?\n              \n\n", "paragraph": "\n              There's no karaoke without 'High School Musical'\n        \n          The TRL Pop Quiz works like this: our editors are posed a music-related question and have only 15 minutes and just 100 words to research, choose and explain their answers. This week's question: which song is your automatic choice for karaoke?At my last birthday party, my friends and I sang the one and only “Breaking Free” from High School Musical. Anything from HSM is a go for me because the songs are easy to sing and everyone around my age is somewhat nostalgic for them. Other good ones are “We’re All in This Together”, “Get’cha Head in The Game” and “Bop To The Top”. Plus, the fact that most people know the words without even looking at the screen makes it even more fun! –Landyn PanWhile many people get uncomfortable doing karaoke, it’s a place that feels very much like home for me. My friends and I have turned to karaoke to fill the void we have of missing singing and performing on a regular basis. I’m a huge fan of contemporary, belty ballads and I have two go-to songs: “Nobody’s Supposed To Be Here” by the remix queen Deborah Cox and the show-stopping number “And I Am Telling You I'm Not Going” from Dreamgirls. I always wonder if a ballad will bring down the mood, but they haven’t failed me yet! –Kristen Maldonado“Wagon Wheel” by Old Crow Medicine Show is my karaoke go-to. As a mediocre singer, I like a crowd pleaser that encourages other people to sing along and this fits the bill. There’s not a lot of note variation in this song and you can kind of talk-sing it -- both major pluses for me, not to mention I just love the song, generally. Most important of all, I already know all the words.  Pull this out at your next karaoke night, and I guarantee every midwesterner in the joint will scream with joy. –Leah WilliamsGive me a microphone, a partner and the instrumental to “If I Die Young” by The Band Perry and you’re in for a full-blown performance by yours truly. Unlike most who just want to have fun, I probably take karaoke a little too seriously. It’s my chance to pretend I’m on my world tour, captivating an audience of 60,000, and “If I Die Young” lets me give it my all and show off my vocal prowess (or lack thereof). Plus, the harmonies make it prime duet material, but rehearsals are encouraged to get it perfect. —Matt GehringThis isn’t what you would call a crowd-pleaser, but “Young Americans” is nevertheless an anthem for our disillusioned decade, telling the sad story of two people pining for more than what their broken hearts and dashed dreams can give. They’re desperate, angry and confused, feeling betrayed by a country that had promised them a brighter future as Watergate, unpaid bills, and the ghosts of America’s past all loom large. Still, David Bowie resolves to tear through the confusion; he helps these people frantically search for their souls. Is there a more appropriate song to be belting aloud in 2018? –Gus Turner© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}