{"id": "\n\n                Normani Drops Two New Songs With Supreme Bop Maestro Calvin Harris\n              \n\n", "paragraph": "\n              'Checklist' and 'Slow Down' are two very different takes\n        \n          Linking up with ultra major bop architect Calvin Harris is always a good idea; just ask Dua Lipa, Katy Perry, Rihanna, Sam Smith — the list goes on. Another name you can add to it now, and another authority on the matter of Harris's bop supremacy, is Normani.The two have connected for a new pair of dance floor-ready pop tunes including \"Checklist,\" also featuring WizKid, and the house-influenced \"Slow Down.\" The latter seems of a piece with Harris's previous 2018 house-pop hits, including \"One Kiss\" with Lipa and \"Promises\" with Smith. On both, though, Normani brings an urgent and dynamic energy that marks a high point here in the early part of the former Fifth Harmony singer's burgeoning solo career.These two cuts don't sound much alike, but both are showcases for Normani's vocals to take center stage. On \"Checklist,\" she adopts a delivery reminiscent of reggae to match the fluttering rhythms, while she ramps up the speed to increase the heat on the strobe light-primed \"Slow Down.\"On Instagram, she shouted out her collaborators for these two tracks. \"Throughout the process of working on my album I have gotten the opportunity to get in the room with some of the most talented human beings everrrrr like ever ever!!!!,\" Normani wrote, singling out Harris and WizKid, as well as Jessie Reyez and Starrah, who worked on the songs.In the wake of 5H's hiatus announcement in March, Normani has appeared on the sultry \"Love Lies\" with Khalid and the remix of Reyez's swaggering \"Body Count\" along with Kehlani. And earlier this month, she popped up with Davido on Quavo's solo effort, Quavo Huncho. She's keeping busy, and these two new tracks are nice additions to an already packed year for Normani.Listen to the two very different tracks above and try to choose a favorite between them, if you can.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}