{"id": "\n\n Family Vacation Boundaries: Did Angelina Cross Every Line Known To Mankind With Vinny?\n              \n\n", "paragraph": "\n              She grabbed his crotch, mocked his bromance with Pauly and much, much more\n        \n          Safe to say, these Staten Islanders probably won't be smushing anything out anytime soon -- or ever.The latest Jersey Shore: Family Vacation Part 2 saw Vinny and Angelina going at it like an old married couple (one that's about to get divorced, mind you). After the engaged brunette was caught bouncing on Vin's crotch at the club, Mike maintained his theory that Angelina and her fiancé are total cuckolds -- a term that gives a whole new meaning to the phrase, \"You cheated!\"Upon returning home, the roommates furthered encouraged Angelinny's apparent sexual tension: \"I would love for Vinny to hate-f*ck Angelina again,\" said JWOWW.That's when the hammered dirty little hamster pounced on her prey, going so far as to grab Vinny by the manhood, ignoring his pleas to just leave him alone. Oh, and there's also the fact that Angelina poked fun at Vinny's close relationship with Pauly -- a pretty off-limits topic.\"I'm trying to be cool to Angelina, but she's just annoying,\" Vinny said. \"She will not stop coming at me. She goes way too far, and now I'm pissed. I don't give a f*ck if you're drunk or whatever, don't come at me.\"When the taunting and sex jokes continued (please, make it stop!), the keto guido had a beachside heart-to-heart with JWOWW.\"I really don't want to talk to that psychopath the rest of the time I'm here,\" he confessed. \"She just went too far last night. I'm actually nice to her, and then she starts antagonizing me. I feel like I'm living with a troll.\"Angelina's take? (You know, other than the fact that she admitted she would totally bang him if she wasn't engaged.) \"I feel like Vinny's self-righteous attitude definitely sets me off, and he's not fun. I don't even know why the f*ck he's on this vacation.\"Their tension came to a head over family dinner when Angelina compared herself to Kim Kardashian Vinny's beloved mom. (Somebody say \"nuclear fusion,\" quick!)\"I've never been pushed to this limit with somebody,\" Vinny said. \"[Normally], I'd just eliminate them from my life. I can't eliminate Angelina. If [she's] going to be a part of this, I don't think I'm gonna survive.\"So did the Staten Island dump take things too far this time, or is she just having a little fun at the keto guido's expense? Sound off with your thoughts, then catch Jersey Shore: Family Vacation Part 2 Thursdays at 8/7c.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}