{"id": "\n\n Young And Pregnant Poll: Will Moving To Atlanta Give Ashley And Bar A Clean Slate?\n              \n\n", "paragraph": "\n              The two may say ‘goodbye’ to California and ‘hello’ to the Peach State\n        \n          Ashley and Bar of Teen Mom: Young and Pregnant have been through some hard times recently -- Bar got into a physical altercation with Ashley’s sister Chris, Ashley filed an order of protection against Bar’s mom Shen, and Bar’s brother was convicted of murder. But could a change of scenery be just what this family needs to start over?On tonight’s episode, Ashley learned her mom Tea was considering relocating from California to Atlanta. When Ashley asked Bar if he’d be interested in potentially moving with her, he seemed resistant.“This is my playing field. This is what I know; this is where I’m stationed,” he said of the Bay Area. “I think I’m scared of moving that far away from home.”But once they got down to Atlanta, Bar quickly changed his mind, realizing how inexpensive and calm the lifestyle was there compared to the craziness of California and what a good life they could give Holly.“I’m not going to lie, I’m pretty much damn near sold,” he told his lady after looking at the house Tea wanted to purchase.During the same conversation, the engaged couple agreed to wait at least a few months before making the jump.“I want to finish school, which automatically gives us four and a half months,” Ashley said. “And we’ll have whatever else time we need. I think right now, we should probably start [saving money].”Do you think Ashley and Bar will they make the move or end up staying in California? And if they do relocate, will the Peach State give them the fresh start they need? Vote below, and keep watching Young and Pregnant Mondays at 10/9c.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}