{"id": "\n\n                9 Key Races to Watch on Election Day\n              \n\n", "paragraph": "\n              History is in the making\n        \n          By Lily HermanThere’s no shortage of interesting races to watch during this midterm election season, especially when it comes to fair representation in our government. After all, there are more women, people of color, LGBTQ+ Americans, and young people running for office than ever before—and many have a great shot of winning.Which statewide and federal races in particular should you keep an eye on? Here are nine that could have ripple effects across the country and set up a new line of “firsts” for the nation.Ilhan Omar (D) and Jennifer Zielinski (R)Minnesota 5th Congressional DistrictIlhan Omar made headlines in 2016 after becoming the United States’ first Somali-American legislator, and she has a high chance of becoming the first Somali-American congressperson in Minnesota’s left-leaning 5th congressional district. “My election win offers a counter-narrative to the bigotry in the world,” she said after her victory for state office two years ago. “This is a land of immigrants, and most come here for opportunity, a second chance. It’s our time to fight for the America we know we can have.”Andrew Gillum (D) and Ron DeSantis (R)Florida GovernorFlorida could potentially elect its first Black governor this month. Progressive Tallahassee mayor Andrew Gillum is facing off against proud Trump supporter and U.S. Representative Ron DeSantis. Unsurprisingly, the race hasn’t been without its clashes. DeSantis kicked of day one of the general election campaign saying he didn’t want voters to “monkey this up,” leading Democrats in the state to say that DeSantis’ remark was racist. Gillum later addressed the issue at a debate, talking about DeSantis’ record of working neo-Nazis and white supremacists. “I’m not calling Mr. DeSantis a racist. I’m simply saying the racists believe he’s a racist,” he the crowd.Kyrsten Sinema (D) and Martha McSally (R)Arizona SenateIf elected, Kyrsten Sinema—who’s who’s consistently had a slight lead on Republican Martha McSally in polls—would become the first openly bisexual member of the Senate, and only the second openly LGBTQ+ member of the Senate ever. Currently as a U.S. Representative, she’s part of a tiny contingent of openly LGBTQ+ congressional members—which is only seven people strong out of 535 reps and senators.Abby Finkenauer (D) and Rod Blum (R)Iowa 1st Congressional DistrictThe race in Iowa’s 1st congressional district has been overlooked by many, but there’s a lot happening here: Democrat Abby Finkenauer is 29 and part of a small number of Millennials running for Congress. If she wins, she'll be one of the youngest representatives—and one of few under 40.Stacey Abrams (D) and Brian Kemp (R)Georgia GovernorThe Georgia gubernatorial race is virtually tied, and history’s on the line. If elected, Democrat Stacey Abrams would be the first Black woman governor ever. The race is particularly contentious given allegations that Brian Kemp, who’s currently Georgia’s Secretary of State, is actively suppressing voters likely to support Abrams. Some reports estimate that Kemp’s team has invalidated 1.4 million voter registrations over the past six years. More recently, the Associated Press reported that Kemp had blocked 53,000 voter registrations ahead of the election, 70% of which were from Black voters, who are more likely to support Abrams.Lauren Underwood (D) and Randy Hultgren (R)Illinois 14th Congressional DistrictLauren Underwood, a nurse and one of only a few Millennials—not to mention, young people of color—is still in the running for Congress after beating out six older white men for the Democratic nomination in the Chicago suburb; she received more votes in the primary than all of them combined. She has a tough race ahead of her against Republican incumbent Randy Hultgren, but pollsters say she’s cut into his lead in recent weeks.Beto O'Rourke (D) and Ted Cruz (R)Texas SenateDemocratic Representative Beto O’Rourke is giving Senator Ted Cruz—a Republican incumbent running for re-election in the red state of Texas—a run for his money. Not only has O’Rourke raised an earth-shattering $70.2 million for his campaign and had an appearance on Ellen Degeneres’ show following a viral video of him discussing players kneeling at NFL games, but plenty of demographics are also now swinging in his favor. Young voter turnout in the state, for example, has increased over 500% since 2014.Sharice Davids (D) and Kevin Yoder (R)Kansas 3rd Congressional DistrictHistory could be made in Kansas’ 3rd congressional district: Sharice Davids, along with Deb Haaland in New Mexico's 1st congressional district, could be one of the first Native American women ever sent to Congress. If elected, Davids, a Democrat, will represent a district that’s had Republican representatives for 45 of the past 57 years.Liuba Grechen Shirley (D) and Peter King (R)New York 2nd Congressional DistrictDemocrat Liuba Grechen Shirley made headlines this year after she became the first woman to successfully petition the FEC to let her use campaign funds for childcare. Her actions led to a number of other women challenging campaign finance rules in their states—with varying levels of success—to do the same.© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}