{"id": "\n\n                Cara Maria And Paulie Just Had A Relationship Breakthrough (Thanks To Some Tattoos)\n              \n\n", "paragraph": "\n              Find out how ink brought them closer on MTV's  'How Far Is Tattoo Far?'\n        \n          Cara Maria Sorbello and Paulie Calafiore just left How Far Is Tattoo Far? with some meaningful ink -- and a relationship first.\"I wanted to tell you that I loved you,\" the Big Brother alum told the reigning Challnege champ, after explaining the significance of his thoughtful tattoo.Before getting to Cara's reaction, what did he opt to permanently add on her body? And no, it wasn't his dick, like he joked about during the initial sit-down with  hosts Nicole \"Snooki\" Polizzi and Nico Tortorella.\"If you know your Game of Thrones, they're called crows,\" Paulie told her, as she examined her new ribs. \"I wanted to make sure it was flying, symbolic of how you like to be free and how I like to keep you free so that you never want to leave me.\" Then, referencing the location of Final Reckoning, he added, \"Which then comes in to a deeper meaning of the coordinates right here of where we met in South Africa.\" But there was one more significant detail: A little red heart in the middle of the crow.\"Even though we like to tiptoe around a lot of things, I wanted to tell you that I loved you,\" he told her as they hugged. He continued: \"Even though you tattooed a picture of yourself on me, you're going to have to do a little bit more than that to get rid of me.\"Speaking of her design: She opted to put her Dirty 30 cast photo on his thigh, which was inspired by him making a joke that he would get it tattooed on himself. Careful what you wish for -- because you're now \"100 percent branded.\" And it's right near his you know what.Moving the focus back to Paulie's \"love you\" statement. Cara and Paulie proceeded to smooch, while Nico and Snooki said \"awwwwww!\" in unison. \"That's it! I love you. You love my d*ck,\" he joked.\"I love all of you,\" she told him.What do you think of Paulie's confession to Cara Maria? And do you like their brand-new tattoos? Sound off, and be sure to keep watching the duo on The Challenge: Final Reckoning on Tuesday at 9/8c -- and How Far Is Tattoo Far? on Thursdays at 9/8c!© 2018 Viacom International Inc. All Rights Reserved. MTV and all related titles and logos are trademarks of Viacom International Inc."}