{"id": "The last Canadian soldier likely died two minutes before the end of the First World War ", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.The poppy was first worn in 1921 after being adopted as the official symbol of the Great War Veterans Association, the forerunner of the Royal Canadian Legion. In the early years, many disabled veterans created the lapel pins as a way to raise money for the needs of injured soldiers. This photo from the Archives of the City of Vancouver shows veterans making poppies.Vimy FoundationOn the morning of Nov. 11, 1918, a German sniper in Ville-sur-Haine, Belgium, shot George Lawrence Price of Falmouth, N.S., where Canadian troops were securing bridges on the Canal du Centre. He died at 10:58 a.m. Two minutes later, the Great War came to an end.It’s believed that Mr. Price was the last Canadian and British Empire soldier to perish in the conflict, joining tens of thousands of others who gave their lives in a war that began in July, 1914, and was expected to be finished by Christmas of that same year.A century after the armistice was signed, Canada still remembers Mr. Price and all those who served and died with a solemn service on Remembrance Day. It is an occasion that has changed dates and focus over the years, and, sadly, added more conflicts and more dead to the list of those remembered. But since 1919, Canadians have gathered and paused to pay tribute to those who served and especially those who fell.Story continues below advertisementArmistice Day, as it was first known, was started in 1919 by King George V with events held on the grounds of Buckingham Palace. In Canada, for the first few years, it was held jointly with Thanksgiving and observed primarily by veterans. It was more about celebrating the victory than remembering the sacrifice. But in 1931, the federal government moved it to Nov. 11 and gave it a new name – Remembrance Day. The emphasis was altered to remembering the dead and the human cost of the conflict, something necessary for a young nation still grieving its losses.“Very clearly there is a desire, maybe a need to mark the war, to mark the sacrifice,” said Tim Cook, the Great War historian at the Canadian War Museum and author of The Secret History of Soldiers: How Canadians Survived the Great War. “The First World War was the hardest thing that Canada had ever done up to that point in its history, ultimately 66,000 dead. It was a shock to the country.”Cities, towns and villages built cenotaphs and memorials, many of which still stand today across the country and many of which will be the centrepiece for this year’s Remembrance Day ceremonies.The poppy, the symbol of the day, was first worn in 1921 after being adopted as the official symbol of the Great War Veterans Association, the forerunner of the Royal Canadian Legion. In the early years, many disabled veterans created the lapel pins as a way to raise money for the needs of injured soldiers.Over the years, attendance has ebbed and flowed at Remembrance Day services. It grew in the 1930s but began to fall off following the end of the Second World War. In the 1960s and 1970s, the First World War veterans began to die off and, coupled with a large anti-war movement that swept the country, gatherings became so sparse that the Legion even pondered whether Remembrance Day had run its course.But, according to Mr. Cook, since the mid-1990s, the day has enjoyed a resurgence, and he attributes that to some Canadian vets being honoured abroad.“I pin it on 1994 and 1995,” he said, “when the thousands of veterans of the Second World War went back and were greeted as the liberators by the French and the Dutch. Those were incredible scenes of the aged soldiers and airmen and nurses coming back and being greeted.Story continues below advertisementStory continues below advertisement“Since then, we’ve seen more people come out to Remembrance Day in their communities and at the national level.”Once again, thousands are expected for the ceremony at the National War Memorial in Ottawa, including some of the dwindling number of Second World War veterans, now in their late 80s and 90s. The opportunity to thank them lessens every year with just 60,000 estimated to be still living.While Remembrance Day pays tribute to those who have served in all Canada’s military operations, including more recent ones such as in Afghanistan, some observers wonder if this year’s centennial of the end of the First World War could see that conflict, which started Remembrance Day, pass into a different category. The last soldier of that war died in 2010 and 100-year observances of the great battles have been held over the past four years, with 25,000 Canadians attending the Vimy Memorial ceremony last year.“I don’t think anything is going to change in terms of attendance,” said Jeremy Diamond, executive director of the Vimy Foundation, a charity that works to preserve the importance of Canada’s contributions in the First World War.“I think, if anything, what the centennial did is shine a light on the importance of remembrance during this period and I hope and expect that will maintain itself past November. The poppy is still recognizable, [the poem] In Flanders Fields is still recognizable and I think people have learned more about the First World War in the last four years and will continue to want to learn.”Back in Ville-sur-Haine, Belgium, they certainly remember. In 1991, a new pedestrian crossing was constructed over Canal du Centre and town officials gave it a name: The George Price Footbridge.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}