{"id": "How much Halloween candy should kids eat?", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.There are ways to limit your child's sugar intake without taking the trick or, more importantly the treat, out of Halloween.iStockphotoLeslie Beck, a Toronto-based private practice dietitian, is Director of Food and Nutrition at Medcan.Q: How much Halloween candy is okay for my 7-year-old son to eat each day? How much sugar is too much?Halloween is one day a year, but the seemingly endless supply of sugary treats can last for weeks. Considering that four miniature packages of M&M’s deliver eight teaspoons worth of added sugar – more than a child should consume in one day – Halloween candy can be scary for parents.Story continues below advertisementIf you’re worried that your child’s candy binge will drag on through November, there are ways to limit his sugar intake, without taking the trick or, importantly, the treat out of Halloween.While gorging on candy for one day isn’t going to cause harm, a steady surplus of added sugar is linked to health problems in kids, as well as adults.Added sugars, including table sugar, high fructose corn syrup, honey and maple syrup, are used by food manufacturers during processing, during food preparation at home or at the table.Refined sugar delivers calories without nutrients. Filling up on sugary foods and drinks can squeeze out nutritious foods that supply important nutrients that growing kids need.Excess sugar intake can also promote dental caries. When kids eat or drink sugar-containing foods, bacteria in the mouth mix with sugars to form an acid that attacks the enamel of the teeth, causing a cavity.The damage caused by sugar depends on how much sugar is consumed and how long it stays in the mouth. The worst Halloween treats for their cavity-promoting potential include sticky toffees, rolled-up fruit snacks and raisins. (Be sure your child brushes and flosses his teeth after eating candy.)Consumption of added sugars, especially from sugar-sweetened beverages, is also tied to excess weight gain and obesity in kids, risk factors for high blood pressure, elevated blood triglycerides (fats), fatty liver disease, insulin resistance and type 2 diabetes.Story continues below advertisementStory continues below advertisementGuidelines from the World Health Organization, released in 2015, recommend that kids (and adults) reduce their intake of free sugars to less than 10 per cent of daily calories, based on the relationship between sugar intake and body weight and dental caries.“Free” sugars include added sugars as well as naturally-occurring sugars in fruit juice and fruit juice concentrate.The organization recommends a further reduction to less than 5 per cent of daily calories, based on additional evidence linking sugar to cavities.For a 7-year-old moderately active boy who needs about 1500 calories per day, that means no more than 19 g (4.5 teaspoons) of free sugars per day.In 2016, the American Heart Association (AHA) released similar sugar guidelines for kids ages two to 18.Based on links to high blood pressure, obesity and diabetes, the AHA recommends that kids over age two consume no more than 25 g (6 teaspoons) of added sugars per day. Children under two should avoid consuming added sugars.Story continues below advertisementIt’s doesn’t take much Halloween candy to hit these sugar limits.A 15 g package of Skittles (11 g sugar), a 12 g Kit Kat bar (6 g sugar) and a 13 g Mars bar (8 g sugar) delivers 25 g of added sugars. So do four 10 g packs of Starburst candies or 3.5 mini Snickers bars (7 g sugar each).Decide in advance how much candy your child can eat on Halloween night as well as during the week or two afterwards and communicate your plan to your child before the big day.A maximum of two to four small treats a day, depending on their sugar content, is in line with current sugar intake recommendations for children. (But also consider other sources of added sugar in your child’s diet such as granola bars, sweetened yogurt, breakfast cereal and fruit juice.)If you decide to let your kids eat as much as they like when they arrive home from trick or treating, make it clear that the free-for-all lasts only one day.Discuss, too, a timeframe for how long after Halloween night treats can be eaten as part of a school lunch or as dessert after dinner.Story continues below advertisementTo reduce the stockpile of candy that lingers after Halloween, have your kids sort their goodies into three piles – their favourites treats, ones that are just okay and their least favourites.The unpopular treats can be pitched in the garbage and the others can be combined in smaller, snack-size bags so that they’re not eaten all at once.Unwanted and leftover Halloween candy can also be donated to people in need. Check social service agencies in your community.When post-Halloween treat time is up, the leftover candy can be donated or stored in the freezer (what’s out of sight is often forgotten).Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}