{"id": "New studies suggest female patients have poorer outcomes after experiencing a stroke ", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Debbie Jackman is pictured in Edmonton on Oct. 20, 2018.JASON FRANSON/The Globe and MailThe first and second time Debbie Jackman had a stroke, a week apart, doctors told her that her sudden loss of speech and vision were probably due to migraines.Had they identified the true cause of her symptoms, the Edmonton resident might have been able to prevent a third, more damaging stroke in 2010.“I wish they had figured it out earlier,” says Jackman, 56, who lives with the effects, including memory loss, difficulty gripping with her right hand, and trouble sequencing events and reading maps.Story continues below advertisementJackman, a patient adviser for the Alberta Health Services, says stroke care has improved over the years, but patients – women in particular – are sometimes overlooked. “I do think that people fall through the cracks.”Researchers and doctors are now trying to mend some of those cracks by examining the differences between how men and women experience and are treated for stroke.Several new studies on these differences were presented at the World Stroke Congress in Montreal last week (Oct. 17-20), where experts discussed the need for international efforts to address sex differences and improve stroke care for women. For years, health professionals have recognized there are sex differences when it comes to heart disease. But they’re only now beginning to learn that women also have poorer outcomes after stroke, which occurs when blood flow to the brain is interrupted. Women tend to experience strokes later in life than men, they aren’t treated as quickly and are more likely to die.“We always thought they present the same. It’s not like their symptoms are different,” says Patrice Lindsay, director of systems change and the stroke program at Heart & Stroke. But within the past year, she says, research has shown “there are some significant gender differences, which has surprised us, worried us and motivated us.”One of the studies presented in Montreal, co-authored by Lindsay, examined administrative data on more than 388,000 Canadian hospital admissions for stroke between 2003 and 2016. It found mortality is higher in women over the age of 45 than in men.Another study, conducted by researchers in Australia, found women died more often than men within the first year after a stroke.And yet another study, led by Thalia Field of the Vancouver Stroke Program, found Canadian women were less likely than men to receive the clot-busting drug alteplase for ischemic stroke. Those who did receive it waited an average of 14 minutes longer than men between the time they entered hospital and the time they were given the drug – a significant time gap since the treatment must be given quickly to curb brain-cell death.Story continues below advertisementStory continues below advertisementFor the study, Field and her colleagues examined data for nearly 260,000 Canadian stroke patients between 2009 and 2016. They found women were also more likely to die within seven days of their stroke.Field, a neurologist and assistant professor of medicine at the University of British Columbia, says more research is needed to understand the reasons for these discrepancies. Some of these differences are biological, she says. Since women tend to be older than men when they experience stroke, they may have more illnesses, and they may be more frail and less likely to recover. But there are also social and cultural factors. Women are more likely to outlive their husbands, and thus, may be living alone when they have a stroke, Field says. This could make them less likely to seek timely treatment or have anyone to support them in recovery.But even though researchers have yet to tease out the “whys,” scientists and clinicians should be considering these sex differences and thinking about the barriers female patients face, and how they can improve care, Field says.“I think it’s important to get people’s attention so that they’re aware of it,” she says. “That will affect both clinical care as well as research awareness into looking further into what the underlying reasons are and how we can correct them.”Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}