{"id": "She was eight months behind on her rent. Instead of kicking her out, the landlord issued a challenge ", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Kiana \"Rookz\" Eastmond poses for a photograph outside Sandbox Studios in Toronto on Wednesday, September 26, 2018. Christopher KatsarovBack in 2013, Kiana “Rookz” Eastmond, then 24, had perfected the art of “dodging” her landlord. “I’d see his car and I’d be, like, ‘Nobody move!’” recalls the owner of sound recording facility, Sandbox Studios.At the time, she was leasing a 400-square-foot sound studio in Toronto’s Cabbagetown and she owed her landlord money. He’d already shown his willingness to take chances on her, and she knew she was pushing the limits of his faith. Little did she know that the man she was avoiding might soon become not just a landlord, but a mentor.As she describes it, she and Paul Copeland couldn’t be more different. He was 72 at the time they met and a well-known lawyer and member of the Order of Canada.Story continues below advertisementMs. Eastmond was a high-school dropout who’s not exactly a buttoned-down business type – for a recent interview she was sporting a branded ball cap, dark hoodie and high-top sneakers. The way she presents herself and, she says, the fact that she’s black, limited her options when she was seeking spaces to lease. Before she found a home for her studio, she had gone to see about 15 or 20 spaces and always been rejected.“They assumed because I’m black I only work with rappers,“ she says. \"I would speak to people over the phone and they would be really excited. But when I showed up, they’d say, ‘We don’t want rappers here,’” she says.Mr. Copeland was different. The lawyer, who had taken on social-justice causes over the years, such as the fight against police carding, seemed friendly. He asked her about her life and her work, and then rented to her.But just a few months after Ms. Eastmond moved in, her life fell apart. She’d quit a good-paying job to become a music manager and then had a very public falling out with the soul singer who was her primary client. “I was blackballed from the urban music scene,” she says. The upshot: she had no job and no clients.When she couldn’t pay the rent on her apartment, she gave it up and slept in the studio. She was barely eating. “I was so depressed I was hospitalized for five weeks,” says Ms. Eastmond. When a city-wide flood damaged her sound equipment and caused a mould problem in her studio, she couldn’t afford to fix it. And for eight months, she couldn’t pay the studio’s rent.Kiana 'Rookz' Eastmond, left, and Paul Copeland outside Sandbox Studios in Toronto on Sept. 26, 2018. Christopher Katsarov/Globe and MailFalling $8,000 behind in rent, which seemed to her an insurmountable sum to pay back, she simply avoided him. When she finally ran into Mr. Copeland, who lived in the building, “I almost felt a sense of relief that he was finally going to evict me,” she says. “At least I wasn’t quitting. I’m not a quitter.”But Mr. Copeland didn’t react the way she expected. “What’s going on?” he asked. She opened up and told him the truth. “I cried,” she says. He didn’t offer advice or a shoulder to cry on. He tossed the ball back in her court. \"Figure it out,” he told her. “I want you to do what you told me you were going to do with this space.”Story continues below advertisementStory continues below advertisementWhen one of the biggest challenges small business owners face is the struggle to pay the rent, a landlord willing to show some leeway meant Ms. Eastmond’s business had the chance to survive, and grow.Listen: I’ll Go First: A podcast about the people behind Canadian startupsMr. Copeland is pragmatic about his response. “The place was a mess,” he recalls. “I couldn’t have rented it out to someone else in that state.” And, he admits, he sympathized with her predicament. “I didn’t want to be the guy who kicked her out. She had a fairly difficult upbringing and I wanted to be supportive of a young person trying to establish herself.”It was the impetus Ms. Eastmond needed. She changed strategies. Instead of trying to use her connections to help create the next major artist, she opted to fill an unmet need in the marketplace by offering individual services usually associated with a record label to independent musicians and sound engineers. They could use her studio space, and get help with marketing, public relations and production - all for a fee.She steadily built her clientele even as she juggled three jobs to pay the bills. “I really wanted to repay Paul’s faith in me,” she says. When she was accepted into the MaRS Studio Y fellowship for young entrepreneurs, she got a stipend of $2,500 a month. That cash went directly to current and unpaid rent. “I was living on tuna,” she says. But less than a year later, she owed just $1,000. And Mr. Copeland waived it.“Don’t worry about it,” he told her. Retelling the story several weeks ago with Mr. Copeland sitting across from her prompts Ms. Eastmond to tear up. “Who does that?” she asks. “Someone who doesn’t need the money,” Mr. Copeland responds wryly.Story continues below advertisementThe two ultimately became friends, hanging out and going to movies and concerts. He enjoyed her youth and energy. “I taught her about music,” he says. They both laugh. “No really,” she says. “He has this insane music collection, with slave hymns and gospel music.” He would drop by the studio and chat easily with whoever happened to be there.Certainly, Mr. Copeland became a bit of a business mentor for Ms. Eastmond. “He was polite but firm,” she says. If she was 50 cents short on the rent, he would point it out. “I think that’s a huge gap in the black community. We don’t learn about money or business. A lot of us are first generation [immigrants].\"After six years as Mr. Copeland’s tenant, in February, Ms. Eastmond moved to a larger facility on Carlaw Avenue. It has both a sound and video/photography studio that doubles as an event space. And it represents another big leap for her – the rent is higher, she has more studio time to fill and she doesn’t have Mr. Copeland in her corner. “It’s likely going to be another year or two before we’re thriving,” she says.Ms. Eastmond still faces some of the same challenges. “Even when I walked into this space today, people were filming in the front and they were like, ‘Are you lost?’” she says. “I own the business, but there’s an assumption made when you look at a young black person such as myself.”Those assumptions go both ways, Ms. Eastmond admits. “Toronto is diverse but we also stay in our own pockets,” she says. “This unlikely relationship I developed with this older gentleman, who is Jewish, well off, and a decorated lawyer changed the way I interact with other human beings. It taught me you can’t make assumptions. And it opened up my world and helped me feel more comfortable with people who don’t look like me.”Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}