{"id": "Canada may supply AI robotic arm for Lunar Gateway, proposed moon-orbiting space station", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.This image shows an artist rendition of the proposed Gateway. It shows a Canadarm on a proposed space station in orbit around the moon.MDA, Maxar TechnologiesThe stars are aligning for Canada to supply a robotic arm with AI capabilities on a space station destined to orbit the moon − but only if Ottawa moves quickly to join the U.S.-led venture before competitors elbow their way into an opportunity tailor-made for Canadian space technology.“If Canada decides not to participate, other nations would probably be approached,” said Mike Greeley, group president of MDA, the current version of the company that developed the Canadarm for the U.S. space-shuttle program and continues to support the Canadarm II aboard the International Space Station.MDA, which last year reinvented itself as a U.S.-headquartered company called Maxar Technologies, would be the likely contractor should Canada agree to send a Canadarm III to the proposed station, known as the Lunar Gateway. The company has been actively lobbying for the project and has launched a #Don’tLetGoCanada social-media campaign to raise public awareness.Story continues below advertisementBut the scope and design of the Lunar Gateway also opens the door to additional roles for Canadian hardware and astronauts both on the station and on the moon’s surface. In recent weeks, this potential has galvanized an industry sector that has for years been asking the federal government to produce a long-term vision for Canada’s role in space.An external robotic arm, with artificial-intelligence capabilities, is one of the pieces of the Lunar Gateway that the U.S. National Aeronautics and Space Administration (NASA) has identified as a contribution it would like to see come from an international partner. In recent statements, NASA’s newly appointed administrator, Jim Bridenstine, has made no secret of the agency’s desire for Canada to sign on to the project.“We need to take advantage of some of the great capabilities that Canada has developed,” Mr. Bridenstine said at a space-policy event in Washington last month.While the arm looks a lot like the Canadarm II in conceptual drawings, it would function quite differently, relying on AI rather than on human operators to guide its movements. This is because the Lunar Gateway is designed to be unoccupied much of the time and its orbit will regularly take it behind the moon where it will be out of contact with Earth. At other times, the 2.6-second delay in two-way radio communications between Earth and the moon would make operating the arm from the ground impractical.“Instead of saying, ‘Move right, move left,’ you’re at a higher level of abstraction where you just say, ‘Do the task,’ ” Mr. Greeley said.MDA has undertaken preliminary studies commissioned by the Canadian Space Agency to scope out how an autonomous robotic system might work and has started conversations with companies that specialize in artificial intelligence.NASA has also indicated that Canadian robotics could be used to help manage science experiments inside the station. The cost could range from hundreds of millions to more than a billion dollars over several years, depending on the extent of Ottawa’s commitment to the project.Story continues below advertisementStory continues below advertisementThe Aerospace Industries Association of Canada has previously argued that the federal government needs to invest about $200-million a year in both science and technology demonstration missions. Advocates argue that this level of public investment would allow Canada’s space sector to maintain global competitiveness and to support an ecosystem of companies that generate additional commercial activity.The call for Canada to decide whether to participate in the Lunar Gateway has grown more urgent in recent weeks as it has become clear that the robot arm will be needed at a relatively early stage in the operation of the orbiting platform, perhaps as early as 2024.The ambitious timeline suggests that Canada will need to at least indicate interest by early in the new year, followed by a concrete budget allocation next spring. Mr. Bridenstine will have at least one more opportunity to probe the Trudeau government’s enthusiasm for the project when he visit’s Ottawa next month to speak at an aerospace conference.A spokesman for Innovation, Science and Economic Development Canada, the federal department that oversees Canada’s space program said that the government is still evaluating options to participate in coming international missions, including the Lunar Gateway.In the United States, the project has gradually picked up momentum since last December when President Donald Trump reoriented NASA’s space-exploration priorities toward the moon. That may allow a path for Canada’s space program to crystallize − provided Ottawa gets on board.“The moon is rising. It’s become real in terms of the next step,” said Gilles Leclerc, director-general for space exploration at the Canadian Space Agency.Story continues below advertisementMr. Leclerc said that U.S. emphasis on commercial partnerships in space means that the Lunar Gateway is likely to see a more diverse array of collaborators than those who currently participate in the International Space Station, which, in addition to Canada and the United States, includes Russia, Japan and the European Space Agency.“The Gateway is going to be that place in space where, for the first time, we’re going to see a merging of efforts by institutional and private organizations,” he said.Among the companies vying to participate in activities related to the lunar push is Moon Express, a Florida-based firm started by Canadian space entrepreneur Bob Richards.Mr. Richards was in Montreal last week to discuss the potential for leveraging Canadian technology in its lunar operations, potentially as part of a mission to bring Canadian science experiments from the Lunar Gateway down to the moon’s surface.“We would very happy to wrap the Canadian flag around a lander,\" he said.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}