{"id": "A self-destructive madness grips the U.K. as a no-deal Brexit looms", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Personal fantasies, such as playing in the Stanley Cup final or singing a Mozart aria at the Metropolitan Opera, are enduring but generally harmless. National daydreams, such as the collective fantasy of Brexit that has gripped roughly half of the British nation for several years, can cause serious damage to millions of people.That was pretty much the message delivered by John Major, the former Tory British prime minister in a speech and newspaper article this week. He called Brexit “a colossal misjudgment” which would “damage personal and national wealth” and he attacked members of his own party and Brexiteers in Theresa May’s cabinet: “They persuaded a deceived population to vote to be weaker and poorer. That will never be forgotten – nor forgiven.”Mr. Major was never a big supporter of the EU, either in office or in retirement. He opposed the single currency and the EU’s free movement of people, but he was and remains a classic Tory pragmatist and his speech is replete with warnings about the madness that has engulfed British politics.Story continues below advertisementUnfortunately, his target audience, right-wing Tories and the vast hinterland of working-class Labour supporters who voted “leave” in the referendum are barely aware that Brexit could have negative consequences.On Wednesday, EU leaders and Ms. May failed to agree on a way forward at a crucial EU summit where the Brexit deal was meant to be sealed. Cynics talk of cans being kicked down the road but the reality is that the legislation that must be put in place for a Brexit deal will take months to get through a hopelessly divided U.K. Parliament and the EU. By December it will be too late even if both sides are in agreement and even if, miraculously, Ms. May persuades the Brexiteers in her cabinet to make more concessions.Britain will on March 29 fall out of the EU into a weird world of isolation, cut off from its main trading partner and with no agreed status in the World Trade Organization.Real stuff is now happening that might wake up the fantasists. While Ms. May and the EU leaders engaged in nervous chit-chat in Brussels, the French government published legislation to cope with a “no-deal” Brexit. The draft law, which would be rushed through the French legislature as a presidential edict, states that the British will be “third country citizens” who would require a visa to enter France and a residency permit to remain in France. The draft bill deals with controls on goods and people at the border as well as veterinary and phytosanitary controls for animals and plants.Plainly, France has kicked off disaster-planning scenarios. Also on Wednesday, Britain’s hapless head of Her Majesty’s Revenue and Customs told the U.K. Parliament that the French were refusing to help his staff plan for a no-deal Brexit. His department has been given powers to commandeer lanes on the main highway to the Channel for queues of trucks held up by French customs checks. The French border officials say there is nothing to discuss while the EU is still negotiating with the United Kingdom.Even now, after two years of Brexit talks, it is astonishing that a senior U.K. civil servant could imagine that he could make private arrangements with French officials about a border controlled by a supranational authority – the EU. It would be as if Mexico sought to do a private deal over migration with California without consulting Washington, but it tells you something about the British and why they remain oblivious to how the EU works and why Brexit is failing.In part, it is because England has always been utterly transactional in its dealings with foreigners and in its own legal and constitutional arrangements. It explains the astonishing blindness of the Brexiteers who never imagined that the border between Northern Ireland and the Republic could be a problem if the United Kingdom left the EU. That extraordinary arrogance lies at the core of the Brexit problem; Ms. May has promised to honour the Northern Ireland peace agreement, agreeing that there will be no border infrastructure, but she has been unable to think up a workable alternative to the EU’s suggestion that Northern Ireland remain, in all but name, part of the EU.Story continues below advertisementStory continues below advertisementMeanwhile, the news gets worse: U.K. GDP growth now significantly lags that of the EU, industrial production and investment has fallen sharply, the property market sags and flagship firms, such as Jaguar Land Rover, plan to shift production to Europe. With glorious cynicism, The Daily Telegraph, a strongly Brexit-supporting newspaper, suggests that private investors can profit from the sharp fall in sterling caused by a no-deal Brexit by investing in foreign, dollar-based funds.For the people who dreamed up Brexit, its patriotism was always a lie, an appeal to a national myth of struggle and victory – Churchill’s “sunlit uplands,” the defeat of the Spanish Armada, the Empire. What they wanted was a low-tax, offshore Singapore, conveniently ignoring the real British economy.What we are witnessing may be a nation, not just going into economic recession but a regression into political or cultural infantilism. The centre ground of politics has completely disappeared; the mad, the bad and the fools are now in charge.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}