{"id": "Why Hebron has a leg up on Alberta’s oil sands", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Shaun RobinsonIt’s been one year since ExxonMobil’s long-awaited Hebron platform off the southeast coast of Newfoundland started pumping crude from its first well. It took four years, $14 billion, 132,000 cubic metres of concrete and a few thousand workers to bring it online, and so far, it’s churning out about 40,000 barrels a day, with the crude bound for markets in the U.S. Gulf states, Europe and much of eastern North America. Eventually, Hebron will drill 20 to 30 wells, and is expected to produce around 150,000 barrels a day.That doesn’t sound like much when compared to production in Alberta’s oil sands, which sits at about 2.4 million barrels daily. But despite offshore drilling posing its own dangers, Hebron has a big advantage over Alberta: Tankers are able to easily access it. With pipelines in the West over capacity and potential new ones mired in a political no-man’s land, offshore projects like Hebron are seen as an exciting new play for foreign investors, who last year sold off almost $23 billion in assets in the oil sands. Indeed, Exxon invested in Hebron as a hedge against Alberta’s oil sands woes, and it seems to have paid off. With an expected reserve of 700 million barrels of recoverable crude, the Hebron project is expected to operate for 30 years. As Newfoundland’s fourth offshore platform, it will play a key role in the province’s plan to double overall production to more than 650,000 barrels a day by 2030.Total oil production in Newfoundlandand Labrador(Millions of Barrels)1209060300NORTHAMETHYSTCAMEONLINETERRANOVACAMEONLINEWHITEROSECAMEONLINEHIBERNIACAMEONLINESOURCE: CANADA-NEWFOUNDLAND AND LABRADOROFFSHORE PETROLEUM BOARD; DEPARTMENT OF FINANCETotal oil production in Newfoundland and Labrador(Millions of Barrels)1209060300HIBERNIACAMEONLINETERRA NOVACAMEONLINEWHITE ROSECAMEONLINENORTHAMETHYSTCAME ONLINESOURCE: CANADA-NEWFOUNDLAND AND LABRADOR OFFSHOREPETROLEUM BOARD; DEPARTMENT OF FINANCETotal oil production in Newfoundland and Labrador(Millions of Barrels)1209060300HIBERNIACAME ONLINETERRA NOVACAME ONLINEWHITE ROSECAME ONLINENORTH AMETHYSTCAME ONLINESOURCE: CANADA-NEWFOUNDLAND AND LABRADOR OFFSHORE PETROLEUM BOARD;DEPARTMENT OF FINANCEProduction by Province (2017)  80.7%ALBERTA 11.7%SASKATCHEWAN 5.3%NEWFOUNDLAND 1.4%BRITISH COLUMBIA 0.9%MANITOBA 0.1%OTHERSOURCE: GOVERNMENT OF CANADAProduction by Province (2017)  80.7%ALBERTA 11.7%SASKATCHEWAN 5.3%NEWFOUNDLAND 1.4%BRITISH COLUMBIA 0.9%MANITOBA 0.1%OTHERSOURCE: GOVERNMENT OF CANADAProduction by province (2017)  80.7%ALBERTA 11.7%SASKATCHEWAN 5.3%NEWFOUNDLAND 1.4%BRITISH COLUMBIA 0.9%MANITOBA 0.1%OTHERSOURCE: GOVERNMENT OF CANADAWelcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor. Latest News  Latest Videos © Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}