{"id": "Why the Canada Post strike is so futile", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Prime Minister Justin Trudeau hinted this week he might soon order an end to rotating strikes by 41,000 postal workers.But would anyone notice if he didn’t?That’s a question Canada Post Corp. and its striking workers might want to ponder.Story continues below advertisementThe post office is less essential than ever in the age of e-commerce, online banking and instant messaging. The Crown corporation’s ever-shrinking monopoly mail business means most of what it does is readily available from private-sector rivals, giving Canadians plenty of options for delivering parcels and distributing advertising flyers. And a dwindling number of us rely on letters.Just look at Canada Post’s most recent quarterly financial report. Nearly 60 per cent of the $1.6-billion in revenue the post office generated in the three months ended June 30 came from non-letter activities, including direct marketing and its fast-growing parcel business. Parcels generated $607-million in revenue, up 20 per cent from the same period last year, and will soon supplant letters as the post office’s main line of business.The dramatic shift away from traditional mail shows no signs of letting up. The volume of letters delivered by the post office peaked in 2006 and has declined more than 40 per cent in the years since. The trend continued in the second quarter with letter volume and revenue down 6 per cent from the same period in 2017.Unlike 20 or 30 years ago, businesses and individuals have plenty of options when Canada Post goes on strike. As The Globe and Mail reported recently, alternative shippers such as eShipper, Ship Time Inc. and Chit Chats have seen a sharp increase in business since the rotating strikes began nearly three weeks ago. Already, these companies are shifting packages over to private carriers, including FedEx, United Parcel Service, Canpar, DHL Express and Purolator (which is owned by Canada Post).In some cases, these services may be pricier than Canada Post. But at least Canadians have choices, including one provided by the postal service itself.For letters, Canadians have been shifting to alternatives, which explains the steady erosion of Canada Post’s traditional mail business.In this environment, you wouldn’t expect postal workers to have a whole lot of leverage. And yet the list of demands is pretty long from the Canadian Union of Postal Workers (CUPW), which represents more than 41,000 urban, suburban and rural postal workers. It includes a “significant” wage increase, a cost of living allowance, improved benefits, more sick days and a no-layoff commitment for all regular employees.Story continues below advertisementStory continues below advertisementCUPW is well aware of the shifting nature of Canada Post’s business and it clearly wants to make the post office more relevant by making it bigger. So it’s also asking for a vast expansion of postal operations, including extended hours, reinstatement of door-to-door delivery to those shifted to community mail boxes in recent years and diversification into the banking business.Canada Post is obviously looking at a very different sort of future. It is offering workers a 1.5-per-cent a year pay hike, improved dental benefits and an extension of job security to more workers. Many rural workers stand to win much larger pay increases as a result of a recent ruling in a pay-equity arbitration case.The upside is that the post office is not seeking any major concessions.Many of CUPW’s demands – most notably, the vast expansion of services – are likely to be non-starters. Earlier this year, the federal government released a distinctly unambitious “new vision” for Canada Post, which incorporated none of the union’s grandiose ideas. The government is looking at using the post office’s retail network to deliver some government services in rural areas, as well as expanding its money order and digital remittances activities. It has no plans to restore door-to-door mail service to households that lost it.The result is a pretty wide gap between what workers want and what Canada Post is offering. No wonder CUPW members voted overwhelmingly to strike.But workers should know one thing: Canada Post is not a growth company. Like so many other businesses, it’s struggling to stay relevant in the face of digital disruption. That is not an environment that lends itself to big wage hikes, no-layoff commitments and expansion into risky new lines of business.Story continues below advertisementPostal workers will be lucky if Canada Post is still in business a decade from now.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}