{"id": "After the Fire", "paragraph": "Murder, lies and a missing deer headChapter one: MorningOff Range Road 132 in central Alberta, a broad driveway leads past an edge of trees into a yard, where once there stood a modest white house and a tidy farm.On the morning of Sunday, Dec. 8, 2013, the house off the highway was quiet and dark. A light snow was falling and it was bitterly cold, sound waves bending and refracting in the air, seeming to amplify every noise.The crunch and pop of truck tires on a frozen road.A dog barking.A gunshot.You would have been able to see it well before dawn if you lived across those fields, or if you happened to be travelling one of those dark and deserted highways: a spot of fire burning bright on the horizon, hot orange flames licking upward to the sky, a house disintegrating into embers below.The first firefighters arrived around 7:30, when the family who lived in the house would usually have been up having breakfast, getting ready for work or chores.In the country, it is friends and relatives who are called to help. On that morning, 16 volunteer firefighters from town and the farms around – local people who knew, as soon as they heard the location, whose house was in flames, whose lives were disappearing into thick plumes of smoke in the winter sky.Jeff Ensign was the first to call Jason Klaus that morning. He knew Jason. He also knew Jason’s parents, Gordon and Sandi, and Jason’s sister, Monica. Jason was at home in his trailer across the property when the phone rang.“The house is burned to the ground,” Jeff said when Jason answered the phone. “Where are your mom and dad?”“They’re there. They’re in the house,” Jason told him. “They didn’t go nowhere. And Monica was there too.”Jason was 38, more than six feet tall and heavy-set, “a typical big-hearted farm boy” one person who knew him recalled. He’d lived his entire life on that land, just as his father had done. The farm was a short drive from Castor, a town of less than 1,000 people, a dot on the map an hour and a half east of Red Deer.Jason’s trailer was a three-minute drive from his parents’ house, the same land but accessible by its own long driveway. Though Jason was at his parents’ house every day and ate most of his meals there, the trailer afforded him space and privacy, distance for partying or bringing women home, the things his parents didn’t like in their house.Monica had her own trailer in a mobile-home park about 45 minutes away in Stettler. She worked at Vortex Production Services, managing human resources and payroll for about 100 employees. At 40, she’d been at the oil and gas company almost a decade. Her dog, Patches, went with her to work every day, curling into a circle of fur at her feet. Most weekends she went back to the farm, helping her mom with cooking and chores, pitching in with her dad and brother outside where she could.Like her brother, Monica had never married or had children, and though Jason often had girlfriends, they were never around for long.It was usually just Monica and Jason, Sandi and Gordon. They ate together, hunted together, worked the farm together.Monica often took Jason as her date to work functions and parties, and she’d planned to do the same that Christmas.Not that there weren’t challenges. It wasn’t easy to run the farm, even with four of them. Gordon had heart problems, and had had a stent put in in Calgary the previous week. He was still tired from the procedure and, at 61, was generally not as strong as he had been, meaning more of the work and responsibility fell to Sandi and Monica and, as the only son, to Jason. Even when Jason would have preferred to sleep in or spend the day snowmobiling, there was work to be done on the farm.Except for a period driving truck for an agricultural co-op, Jason had never held a job outside the farm. He didn’t get a salary, but his parents paid all his bills and took care of everything he needed – Sandi even did his laundry – and when Jason wanted money for drinks at the bar or to take a woman out, Gordon gave it to him if he asked.The house was engulfed in flames and mostly collapsed by the time the first firefighters arrived, and it was clear no one inside could have survived.Dumping water on the fire would only make investigation more difficult. In those temperatures, and at that time of the year, the wreckage could remain frozen for months, and it was decided the best thing was to let it burn.After getting the call from Jeff, Jason Klaus sped to his parents’ house. He jumped out of his truck, screaming and fighting to get down the driveway while neighbours blocked his way, holding him back in a way that was kind and sad and firm.The mood was dark and ominous. No one knew for sure that Gordon and Sandi and Monica were dead, but the house was destroyed, and there was no sign the family had gone anywhere in the middle of a frigid winter night.RCMP Constable Diana Stratton was the first police officer at the farm, and she walked around recording the scene as it was in that moment, the house reduced to a searing pit of ashes and embers, like a vision of hell in the falling snow.It would have been bad enough if it were an accident. But there were signs that whatever had happened at the farm involved something more sinister.The family’s chocolate Lab, Keela, lay dead outside, a halo of blood around her head. There were two bullet casings near her body and, a short distance away, another drop of blood in the snow.Near the burning house sat a red gas can, still two-thirds full and partly melted by the heat.Soon the farm was dotted with evidence markers and tarps, blue porta-potties for those working at the isolated property.It looked like it could have been a tragic accident, except for the dog, Keela, and it was not yet clear what had happened to her. It was possible a gun or ammunition had exploded in the fire, or that she’d been injured in some other manner.Sergeant Rob Kropp was the lead investigator on the file, and he called Jason Klaus in for an interview at the RCMP detachment in Coronation, about half an hour away. They met on Tuesday, Dec. 10. It was two days after the fire, darkness already falling on one of the shortest days of the year.“Is there anything that kind of right off the top of your head you were wondering about?” Kropp asked.“Well I’m just wondering, I don’t know if all the vehicles are in the yard,” Jason said. “Like, first of all I don’t know if there was any, I guess, the cause of death. I don’t know what that was. I don’t know if the fire was caused from a malfunction of the furnace, a coal furnace, or if it was foul play ... I don’t have answers how they died yet. And then, I’m just wondering it if was foul play, what goes from there? … My mom and dad and sister didn’t have an enemy in the world, and nor did I.”But while Jason said he had no idea what could have happened and hoped it was just an accident, he soon speculated about a motive for foul play.Gordon and Sandi’s house had several mounted deer heads, but the whitetail in the living room was special. Sandi had spotted the whitetail while the family hunted near Coronation in 2007, and Jason killed it. He liked to brag that he’d been offered $10,000 and a new truck for it once, and though the head grew bigger and more impressive with every telling, it was a magnificent animal. It had earned him $250 and the title of “White-tailed Deer Hunter of the Year” from Alberta Outdoorsmen magazine. A photo showed him holding it by the antlers, its eyes blank with death, the bottom of its face smeared red with blood.Odd Gundersen arrived at the fire scene with his eight-year-old black Lab, Jobi, three days after the fire. Jobi was a skilled sniffer dog for arson investigations, and though never trained for it, she had begun finding human remains after discovering a hand at another fire scene years earlier, so Mr. Gundersen used her for cadavers as well.Jobi alerted on 16 spots in the debris, and a second search confirmed the locations. There were human remains, and there was accelerant.And it was becoming increasingly clear that Gordon, Sandi and Monica Klaus hadn’t died by accident.It was hard to know what to make of Jason Klaus, and in the cold, early days of 2014, Sgt. Rob Kropp was working hard to figure him out. Sgt. Kropp had been an RCMP officer for 19 years by then, investigating homicides for 12 of those. He was 41, with an unassuming manner that belied his keen mind.As a constable, he’d worked one of Alberta’s most infamous murders, the 2005 slaying of a teenager on an Edmonton-area golf course, and moving on to the RCMP’s major-crimes unit out of Calgary meant he was often called to the province’s most serious cases. He’d had a lot of unsettled nights thinking about the Klaus case, and as time passed, his questions were only growing.Jason Klaus was sympathetic, likeable. He was the only remaining member of his family, the victim of an almost unimaginable loss. Or, Sgt. Kropp considered, a suspect in an almost unimaginable crime. Maybe both.In the days after the fire, Jason Klaus had been emotional and teary, the grief-stricken son and brother. He talked about how his parents and sister were his best friends, how they were the closest a family could ever be. He said he wasn’t sure he could survive without them.But though co-operative with police at first, Jason soon grew frustrated. Police eventually confirmed Gordon and Monica’s remains were found in the fire, but Jason didn’t believe them when they said they hadn’t located Sandi’s. He told people he thought the RCMP were playing mind games with him.It was true police hadn’t located Jason’s mother’s remains, and they never would, the working theory being that her body was incinerated entirely by the intense heat of the blaze. Yet Jason seemed so sure her body had to be there with the others, and police began watching his reactions closely.Many things that weren’t so noticeable in the early days of the investigation now caught Sgt. Kropp’s attention. Like how Jason had asked about shell casings even before police knew any shots had been fired, and how he repeatedly questioned whether any vehicles were missing from the farm.Gordon Klaus’s white GMC Sierra had, in fact, been found abandoned near the Battle River, but Jason was asking about vehicles in the very first hours after the fire, when it wasn’t yet clear his family was dead.He also returned repeatedly to his taxidermied deer head, appearing unshakably convinced its theft was the motive, even before investigators were sure there had been a crime.As the investigation progressed, the accounts Jason had given of his whereabouts the night of the fire were proving less than accurate, and there were gaps and inconsistencies at crucial points.At first, Jason said he’d gone to see a friend at a Hutterite colony and then home, neglecting to mention several hours spent at the Thirsty Beaver bar in Castor. In later interviews basic information – like what time he left the bar – shifted and changed. And despite his assertions that he led a squeaky-clean lifestyle, people in the community said he’d been a regular cocaine user and even a cocaine dealer.In his first interviews after the fire, Jason had talked about American hunters who’d been in the area that fall, and who, he hinted, may have returned to steal the deer head and murdered his family. Investigators flew to Utah to interview the hunters, but the men said they hadn’t seen or even heard of the deer head, and their passports confirmed they’d never returned to the country after the fall hunting trip.Police even found a man who’d been walking alone on the highway near Castor the night of the murders. It was suspicious, given the remote location and the deadly cold temperatures. But, as with the hunters, everything checked out. Every line of investigation led back to Jason.Most strangely, Jason had been telling people about a series of visitations from his sister’s ghost, who he said told him the family had been murdered, describing the scene in graphic detail and giving increasingly specific hints to the identity of the killer.At a family gathering on Christmas Day, Jason told one of his aunts that Monica’s spirit said the family was killed by a bearded man who started a fire in the basement, and who then left for Saskatchewan. When his aunt asked where the gun was, Jason said Monica’s ghost told him it was in the river.Jason gave a similar story to fire investigator Keith Janes, when Mr. Janes arrived to do some follow-up at the farm a few weeks after the fire. Leading Janes into the foundation of the house, Jason pointed to something he said he believed was a tooth, and a bullet that “looks like it hit a bone.”“I know what happened here,” Jason said.“You have a theory?” Mr. Janes asked.“No, I know.”After asking Mr. Janes if he believed in spirits, Jason said his parents and sister were shot with a 9mm handgun, and that the killer then set the house on fire with AV gas, the high-octane aviation fuel Jason used for his snowmobiles. As Jason described the scene, he moved through the basement gesturing as though he were spreading gas himself. He spoke without emotion until he talked about Monica sitting up in bed, her eyes moving back and forth in her head, unable to move but alive until the killer fired a second shot into her head.Mr. Janes let Jason talk. He’d become a fire investigator after retiring as an RCMP staff sergeant, and had done many interrogations and worked undercover and as a polygraph operator. The things Jason said were obviously disturbing. At that point, the deaths still hadn’t even been declared homicides.Mr. Janes left the property and drove out of view of the farm, where he pulled over and wrote down everything Jason had said, in as much detail as possible. Then he called the RCMP.It wasn’t the only such call Sgt. Kropp received.Brady Flett, Monica’s boss at Vortex, had been in regular contact with Jason after the fire, and felt a growing sense of unease about their conversations. Brady cared about Monica and had done everything he could to help Jason. He offered to pay Monica’s bills and checked her trailer in Stettler every day to make sure the pipes hadn’t frozen. When Jason asked if Brady could help him financially, he didn’t hesitate to cut Jason a cheque for $10,000 on the spot.At times, Jason seemed truly devastated. But in other moments, he struck Brady as chatty and casual, barely different from when they used to make small talk at the company Christmas party.When Jason called one night late in December and asked if they could meet, there was something in his voice that made Brady not want to go.It was at that meeting that Jason first told Brady a version of the spirit story, saying that Monica had been appearing in visions and also sending him text messages. He said Monica’s ghost identified the killer as Josh Frank, a friend of Jason’s from town.Brady pushed Jason to go to the RCMP, but he firmly refused. He said Josh was a bad guy, who’d get to him even if they passed along the information anonymously. “He’ll twist it all around like I was part of it and I’ll go to jail,” he said.Brady Flett was a trusting man, who would never normally imagine someone he knew could be capable of something so terrible. But there was so much alarming about Jason’s story, so much that didn’t make sense.This time, when Jason asked for money, Brady said he’d have to talk to his partners. Then he went back to the office, typed up everything Jason had told him, and called Sgt. Rob Kropp.The RCMP interviewed Jason several times in the weeks after the fire and, by early January, Sgt. Kropp had told him bluntly that he was a suspect. Josh Frank was also interviewed by RCMP, but denied any involvement, and that spring passed a polygraph that appeared to show he was telling the truth.After first saying he would take a polygraph, Jason refused, saying a lawyer advised him against it.In the community, stories circulated, rumours spread and grew. But for the people who loved Jason and knew him best, it wasn’t easy to consider he could have killed his family.And at first, there was no real reason to suspect him.Many in his family believed in spirits and ghosts – Sandi’s mother was said to have been a medium – so getting unknowable information from Monica’s spirit was not as outlandish as it might have seemed from the outside.There had never been anything of real concern in Jason’s behaviour or in his relationship with his parents or sister. That he could be so cruel, so devious, was almost impossible to imagine.Jason’s aunt, Marilyn Thomson, loved and trusted him, but eventually there were things she, too, could no longer ignore.Around the end of March, Jason gave her two cellphones that he said contained recordings of the killer confessing, but Marilyn didn’t believe the phones contained such recordings, and the whole situation felt scary and dangerous. She was worried about her own family’s safety and, after giving Jason a chance to get the phones, she threw them into the garbage at work.There were other things that bothered her, like how Jason took Monica’s F150 and customized it to make it his, and when that truck was repossessed, bought a big, head-turning Hummer, custom-painted in camouflage.When Jason told Marilyn he’d found three rings in the burned debris of the house, she recognized Sandi’s pinky ring, and a gold band and a zirconia of Monica’s. She knew Sandi and Monica wore those rings all the time. She also noticed how clean and shiny the rings were. Not like they had been in a fire at all.The RCMP has been running Mr. Big operations for about 20 years, elaborate stings where undercover officers pose as part of a criminal organization headed by “Mr. Big,” a powerful man who is able to make police investigations disappear, usually with the help of a dying uncle willing to confess to a serious crime before he dies. The uncle just needs very detailed information, and ideally some physical evidence, to make his deathbed confession believable. In return, Mr. Big demands only one thing: the truth.This Mr. Big operation began with Brady Flett, who reluctantly agreed to work as a police agent, wearing a wire while attempting to get Jason to say more about the information he had supposedly received from the spirit world.Speaking to Brady in recorded conversations, Jason purported to have gotten details about the murder variously from the ghosts of his sister, father and grandmother, a woman who practised witchcraft in Drayton Valley, and a psychic he described as a black woman in a turban who looked like Aunt Jemima, and who he said had been working with the fire inspector from Red Deer.He told Brady he now knew everything about how the murders went down, and that he’d seen the killer, and even spent time with him, but didn’t let on that anything was wrong because the spirits had instructed him not to take any action.When it became clear it was time to expand the operation, Brady facilitated introductions between Jason and the undercover officers, introducing them as people willing to pay to store items on Jason’s farm. On April 1, 2014, “Project Kontingent” began. Jason Klaus was Target 1. Josh Frank, Target 2.Some in Jason’s life were suspicious of his new friends. Amanda, a barmaid at the Thirsty Beaver who used to sleep with Josh and was now seeing Jason, warned that the men might be cops, as did an older woman Jason was seeing in Edmonton. Jason’s Aunt Marilyn thought they seemed like questionable people for Jason to be involved with, but Jason assured them all that everything was fine.The promise of a Mr. Big operation, for someone like Jason, is extremely seductive. He could be part of a powerful criminal organization, a close-knit group of guys, with a boss who could make the RCMP investigation around him disappear.Jason’s own concerns about the men dissipated as he got to know and trust them, and they quickly grew close. The men went golfing and to strip clubs, and to hospital to visit the dying uncle who would confess to anything. Soon Jason joined the men for other jobs – collecting on a loan, repossessing a vehicle – all carefully orchestrated scenes to show that Jason’s new friends could abide anything except lying. Though told he could do legitimate work for the organization, it was the other jobs that got Jason’s attention. When officers staged a scene to make it look like one of the men had seriously assaulted a woman, Jason asked why they didn’t kill her.Mr. Big operations typically run a year or longer, but things moved far more quickly – at times, officers thought, too quickly – propelled steadily forward by Jason himself. As Sgt. Kropp would later say, it seemed as if Jason wanted the truth to come out, like he was trying to tell everyone what happened, without quite saying the words.Jason’s first confession came on June 2. It occurred during Scenario 14, one of the quickest progressions RCMP had seen in a Mr. Big operation, some of which span more than 150 scenarios. A few hours later, Jason retracted what he’d said. Then, weeks later, he confessed again.But while Jason admitted plotting the murders of his parents and sister, he maintained that the gunman was his friend, Josh Frank. When he was told Mr. Big wanted to hear from Josh, Jason set up a meeting.Josh was 29 years old, a welder who now worked on the pipelines. He’d grown up in Castor and had known Jason since he was in his teens.Josh had been hanging around Castor on days off when Jason called, and they agreed to meet in a mall parking lot outside Calgary. It was July 19, a little more than seven months after the fire.Josh wore a bandana and sunglasses on his head, a Duck Dynasty T-shirt that read, “When someone is being redneck-ified, you start with the hunt.” Jason introduced Josh to Mr. Big, then left them alone together in the truck.The things that appealed to Jason about the operation proved enticing to Josh as well, and he immediately began to talk, telling Mr. Big, “If it helps Jay, it helps me.”He said Jason had been writing cheques on the farm account using his father’s signature, and was about to be discovered and cut out of everything to do with the farm.To work – and to later hold up in court – Mr. Big operations have to not only give a suspect a chance to confess but also to reveal incriminating information that would be unknown to anyone but the killer. Josh drew a map of the house, and gave Mr. Big the lighter he said he’d used to start the fire.After Josh went over what happened several times, he and Jason led the undercover officers to the ditch where they’d thrown the keys to Gordon’s truck, and the officers searched the grass with a metal detector until they found them.They also went to where Josh said he’d thrown the gun in the river.Police divers later found it in nearly that exact spot, black and rusted.Josh said they never settled on an exact payment, but that Jason said it could be up to $50,000. Josh had a torn tendon in his elbow at the time, which he thought would convince police he couldn’t have fired a gun.He told Mr. Big he’d fooled the lie-detector test by clenching his butt cheeks.Asked if he felt any remorse, he said, “A little bit.”And they both laughed.The trial began in Red Deer in the last days of fall, 2017, almost four years after the fire. Jason Klaus and Josh Frank sat together in the heavy wooden prisoners’ box, each charged with three counts of first-degree murder.Jason Klaus often said he was looking forward to the trial, that everything would finally be explained in court. He told those who would still speak to him that the evidence would point at Josh. He said, “They have nothing on me except his words.”But both Jason and Josh had made detailed and damning statements in the Mr. Big operations, and had confessed again to police after long interrogations. In their confessions, each ultimately admitted some role in the murders, though giving versions that more strongly implicated the other.Josh said he was scared of Jason, even alleging Jason had sexually assaulted him when he was a teenager, about 14 years earlier, in the cab of a pickup truck. He said he never reported the assault to police, but that Jason continued to control him, and that he feared for his life and had no choice but to carry out the murders.Jason said it was only supposed to be a robbery for the deer head, but that Josh turned it into murder. Then Jason admitted it had been a murder plot, something half-serious that got out of control and became real. He said he changed his mind at the last minute, but it was too late.Though the men purported to be terrified of each other, their interactions showed that hadn’t been the case. They talked and texted often after the fire, and the only real dispute between them appeared to be about their relationships with Amanda from the Thirsty Beaver.During the Mr. Big meeting in the parking lot, the two talked casually and amicably. Jason even promised to get Josh a job with his new crew, though he’d previously suggested to the Mr. Big officers it would be best to have Josh killed.In court, each testified against the other and tried to take back their earlier confessions, saying their Mr. Big statements were lies, their confessions were lies, their other statements to police were lies, and that at times they’d even lied about lying. But amid the tangle of stories, a dark truth began to emerge.Josh and Jason were found guilty of three counts of first-degree murder. Each was sentenced to life in prison with no chance of parole for 25 years.In phone calls from Edmonton’s federal maximum-security prison, Jason Klaus continues to weave a changing tale of what happened. He’s told many stories, too many to count. None answering the questions that still linger.He says he didn’t go into the house, that he never actually saw the things he described in such detail. He can’t explain why there was a drop of his blood outside, bright red and fresh in the newly fallen snow. He can’t say why what happened that night happened at all.Jason used to say the deer head burned in the fire. Now he says he heard it’s locked in the trunk of an abandoned car, somewhere in the fields outside Castor.The night was cold, but the little white farmhouse off Range Road 132 was warm and light. Gordon Klaus was still tired and weak from an operation, and he rested while his wife, Sandi, made supper. Monica and Jason put up the Christmas tree beside Jason’s prized deer head in the living room. They ate hamburger soup and fried potatoes for supper, Sandi’s lemon meringue pie for dessert. There was curling on TV.Later, Jason called Josh Frank and told him it was time.They stayed at the Thirsty Beaver until after 3, drinking and joking with Amanda and a couple of women from town. When the bar closed, they went their separate ways, Josh to his room in the Cosmopolitan Hotel, Jason toward home.But they met again across town half an hour later, Josh climbing into Jason’s black Suburban with the 9mm Ruger Jason had given him, the gun already wiped down, loaded and ready.It was not far to the farm. Then down the long driveway, to the house.Josh went to Gordon and Sandi’s room first, turning on the light and pulling the trigger. Then he walked to Monica’s room and fired again. Two shots for each person to make sure they were dead, fast so they wouldn’t know what hit them. I’m not an animal, he would say later. Well, I guess I kind of am, now.Jason was waiting in the truck.Or, maybe he was standing right there, alongside.After it was done, Josh got the gas can and poured some out, a flare of his butane lighter transforming liquid into flame, a house into fire.When Keela came snarling and growling, Josh shot her, too.They left Gordon’s truck by the Battle River, then Jason drove Josh back to Castor, leaving him in the dark just outside town.Then Jason went home to the farm, back to the trailer on land that had been his family’s for generations, waiting for the phone call, for the knock at the door he knew was coming.Waiting for the things he would say and do, for the act he would play. Waiting for others to finally see what had been growing there, something dangerous spreading between two men, undetected.Until one cold night, it sparked and caught fire.The first time I talked to Jason Klaus, his parents’ house was still burning.I was a crime reporter at the Edmonton Journal then, and I had begun covering the fire right after it happened. Though Gordon, Sandi and Monica Klaus were still only officially considered missing at that point, it seemed likely that they were dead. Police weren’t saying much and, I realize now, legitimately didn’t yet know what they were dealing with. But there were things about the fire that already seemed suspicious.I wrote the early stories from Edmonton and on the morning of Dec. 20, just less than two weeks after the fire, I headed to Castor.It was bitterly cold when a photographer and I pulled into Jason’s yard, and I walked alone up the driveway to his trailer. I remember the bright winter sky, the bags of garbage outside his door, the bite of the air.There were several jerry cans of gas around his trailer that caught my eye, but it seemed too obvious, too flagrant. And yet I seriously considered the question everyone touched by this case would grapple with in the years that followed: Could Jason Klaus have killed his family and burned their house down?When no one answered the door of the trailer, I left a note and my card, and Jason phoned me a few minutes later. He said he couldn’t meet, but we talked for a few minutes on the phone. He sounded devastated.“It’s the most horrifying thing ever,” he told me then.It seemed so sincere, so convincing. But I’d been covering court and crime for a long time by then, and had seen people tell some very convincing lies about very important things.Jason and I had pretty regular contact after that, as I continued to follow the story, reporting on the deaths and the ensuing investigation. Sometimes, I checked in with him. Other times, he phoned me. Sometimes he talked about how frustrated he was with the police or gossip in town, or with other media reporting about the case. At some point, he started to tell me stories about spirits and the deer head he believed may have inspired the murders.I was out for dinner one night when Jason called and told me he’d found what he believed was his mother’s tooth and part of her shoulder bone in the rubble. I told him he should turn those items over to the police. Another night, he said he knew what happened to his family because a psychic who looked like Aunt Jemima had told him everything.I never quite knew what to make of these calls, or of Jason. What he said was extremely suspicious, of course, and often quite disturbing. It was also notably different from interactions I had had with victims in other cases. While no two people or situation is the same, after years of reporting on death and tragedy, I had seen similarities and patterns emerge, and some of Jason’s reactions really stood out to me.“I’m nervous, excited, scared,” he told me once, when I asked how he was feeling about the RCMP investigation.Another time, when I asked what he would want the public to know about the situation he was in, he told me, “I would just want everybody to know what a frustrating adventure this has been.”I had never heard anyone use words like “excited” or “adventure” in the wake of something so tragic.But saying strange things doesn’t make someone a killer, just as being the likely suspect doesn’t make someone guilty of murder. In fact, these elements can make a case ripe for wrongful conviction. And I am, of course, a reporter, not a police officer, judge or jury. I took Jason’s calls, kept notes, and assumed our conversations were probably being monitored by police. I wondered often whether he had done it, and, if he had, what he got from our conversations.“My whole life was taken from me. My best friends. My family. My whole life,” he said once.Another time he told me, “My heart is gone. It’s just lost.” He told me many times that his mother was his angel, that his family was his entire world.Yet I wasn’t surprised when he was arrested and charged with three counts of first-degree murder.Our calls continued after Jason’s arrest, and he phoned me with some regularity while he was on remand awaiting trial. He told me he couldn’t discuss specific details of the case, knowing that the phone lines may be monitored, but he assured me I would find out the truth at trial, and promised that at some point he would tell me the whole story of what happened at the farm that night. He hinted at times that he had known about the RCMP’s Mr. Big operation, and had been working with the police to get his co-accused, Josh Frank, to confess. He also told me that the police didn’t really have anything on him, and he seemed confident he would walk away a free man.But then the trial began, and the evidence started to emerge.At some moments during the trial, the lies and stories told by Jason and his co-accused were so flagrant, so ridiculous, they were almost laughable. Almost – but for the reality of what was done to three people, in the safety of their home, by someone they loved and trusted.There were times the evidence made people physically ill. After the recording of Josh Frank’s matter-of-fact confession to Mr. Big, one relative left the courtroom in such visible distress there was concern he was having a heart attack. Others sobbed in the hallway, gasping for breath. More than one person described it to me as like seeing pure evil.And still, many questions remain unanswered.In one of my most recent conversations with Jason, and likely one of my last, I asked him if he had gone into the house with Josh during the murders. He has always maintained he didn’t, yet he has described what happened inside so vividly.I asked him how he got the rings his mother and sister always wore. I asked why a drop of his blood was found near the house, in the freshly fallen snow.I asked him if he was sorry.I’m not sure what I thought he might say, whether I expected him to finally take responsibility, to show real remorse for what he had done. Instead, he continued to give explanations that didn’t add up, that didn’t account for the evidence I had seen in court, that didn’t explain away his own confessions. A tangle of stories and lies.I’ve thought often about why Jason did what he did. Was it for money? The deer head? Control of the farm? I’ve never found an answer. Maybe there isn’t one. I’m not sure even Jason knows.He told me some people in prison think he’s a monster. I asked him if he saw himself that way.“I’m not near a monster at all. I’m not. I’m one of the nicest guys …,” he told me. “I love, especially my family. My family come first. And I just can’t handle going on in life without them.”Jason’s closest relatives declined to speak to me for this story. But in victim-impact statements presented in court, they described their profound grief and trauma, not only at losing three people in such an horrific way, but also suffering the betrayal of having someone so close be revealed as the perpetrator of such a heinous crime.“I would have done anything for you because I believed your heart was as broken as mine,” said Jason’s cousin, Nicole Thomson, reading her statement aloud in court. “Finding out who you really were made me question everything I believed to be true. I still can’t explain how I was so wrong about you.”“I used to love you and I will always treasure our time together,” she said. “But who I thought you were died on December 8th and I mourn your loss, too.”Reporting and writing by JANA G. PRUDEN; Illustrations by MATT ROTA; Design and development by DANIELLE WEBB and CHRISTOPHER MANZA; Editing by SHAWNA RICHER and VICTOR DWYER; Multimedia editing by LAURA BLENKINSOP; Illustration direction by MING WONG; Production support by PATRICK DELL and TIMOTHY MOOREInvestigation photos, video and audio sourced from court evidence."}