{"id": "Canadian study finds major traumatic injury increases risk of mental-health diagnoses, suicide", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Patients seriously injured in car accidents, violence and falls are at greater risk of developing a mental illness or dying by suicide, according to a new study that suggests those patients need better mental-health support.The study, published on Monday in the Canadian Medical Association Journal, found that patients were 40 per cent more likely to be hospitalized with a mental-health diagnosis, such as depression, anxiety or alcohol-abuse disorder, after a major trauma than they were before being injured.The rate of suicide among post-trauma patients was also significantly higher, at 70 suicides per 100,000 people per year, compared with 11.5 suicides per 100,000 among the general population.Story continues below advertisement“Anyone involved in the acute management of these patients needs to be thinking about mental health as importantly as we think about the physical injuries that someone has suffered,” says lead author Christopher Evans, director of trauma at the Kingston Health Sciences Centre.As an emergency physician, Dr. Evans says he has cared for trauma patients who have made remarkable physical recoveries, but struggled with depression, anxiety and self-harm in the months and years afterward. While hospitals and health-care providers generally do offer mental-health services to trauma patients, he says, they are not always provided in a co-ordinated, systematic way.“There’s a need for offering [mental-health] supports to every patient so that it becomes standard practice,” he says.He and his team analyzed Ontario administrative health data, held at the Institute for Clinical Evaluative Sciences, for more than 19,300 patients treated for major trauma in Ontario, between 2005 and 2010. The most common type of injury was blunt trauma, and the causes of injury varied, including traffic accidents, unintentional falls, assault and exposure to smoke or fire.The researchers examined how many of the patients were admitted to hospital for a mental-health diagnosis in the five years prior to their traumatic injury, compared with in the five years post-injury. They found hospital admissions, particularly for alcohol abuse, drug abuse and major depressive disorders, were higher during the post-injury period.The study did not examine the reasons for the increase. However, Dr. Evans suggests there may be multiple factors involved. It is possible some individuals with mental illnesses may not actually be diagnosed until they come into contact with health professionals when they experience major trauma, he says. But, he explains, people who have experienced major injuries often struggle with chronic pain and financial difficulties, and they may lose their ability to function independently, which can affect their mental health.The latest findings echo a 2014 study by researchers from the University of Manitoba that showed individuals across Canada who had experienced major traumatic injuries were at greater risk of suicide than a matched control group. The authors of that earlier study noted that advancements in medical and intensive care over the past 30 years have led to more people surviving physical injuries, and as a result, patients are also having to deal with the consequences of their injuries, including pain, disability and financial issues.Story continues below advertisementStory continues below advertisementSarvesh Logsetty, one of the authors of the 2014 study, says health professionals are now paying more attention to patients' needs beyond treating their physical injuries.“Now it’s not acceptable just to say, ‘Okay, great, we saved your life, see you later,’” says Dr. Logsetty, director of the Manitoba Firefighters Burn Unit at the Health Sciences Centre in Winnipeg and professor of surgery and psychiatry at the University of Manitoba. “We need to support individuals beyond that and try to facilitate their integration with the life they had before.”Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}