{"id": "Jean Machine to close all stores by the end of February", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.A Jean Machine storefront is shown in Toronto on July 26, 2017./The Canadian PressCanadian apparel retailer Jean Machine Clothing Inc. will close down all of its stores by the end of winter because of losses.Jean Machine president Lisa Hryciuk announced in a letter posted on the company’s social media channels that 20 of its locations will be shuttered by Jan. 31 and another four will be gone by Feb. 28.All of Jean Machine’s locations are in Ontario and it stocks apparel from Guess, Levi’s, Jack and Jones and Buffalo David Bitton.Story continues below advertisementMs. Hryciuk says Jean Machine’s e-commerce offerings will remain open, but there will be no exchanges permitted for purchases made since Nov. 1.Jean Machine filed for bankruptcy protection in January amid increased competition in the denim space from Uniqlo, H&M, Nordstrom and other newer retail chains.Jean Machine has been around for 42 years and is owned by Vancouver-based Stern Partners Inc. through Comark Service Inc., which also owns apparel brands Bootlegger, Ricki’s and Cleo.Comark chief executive officer Gerry Bachynski told the Canadian Press that the company’s poor performance, despite recent restructuring is to blame for the closures.“We continued to experience losses that ultimately we were reluctant to continue with,” he said. “The other thing that forced our hand was 10 of the 24 leases were terminating at the end of January and up for renewal, so if there was a time to wind the business up, it was the best possible timing.”The Canadian PressWelcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}