{"id": "Across Canada, caribou are on course for extinction, a prominent expert warns. What happens after that?", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.At a conference in Ottawa this week, Justina Ray will lay out grim predictions for animals First Nations have depended on for generationsCaribou from the Porcupine River herd on the move in the Yukon's Blow River Valley.Weronika Murray/The Globe and Mail More below• Photo essay: Caribou, a Yukon way of life   Caribou, the iconic herbivore that graces the back of the Canadian quarter, is on a pathway to extinction in every region where it is currently found, says one of the country’s foremost experts on the species.The stark assessment has emerged from nearly a decade of meticulous research aimed at understanding how 11 different subsets or “designatable units” of caribou should be listed under the federal Species at Risk Act.Justina Ray, a conservation biologist who co-led the work on behalf of the independent body that advises the government on the status of endangered wildlife, said the change in the caribou’s fortunes since 2004, the last time such an assessment was completed, is profoundly worrying.Story continues below advertisement“I think the conclusions startle even those of us who have been paying a lot of attention,” Dr. Ray told The Globe and Mail before a government-sponsored meeting of caribou researchers in Ottawa this week.“Every single unit is in some kind of danger, and more than half of them are [assessed as] endangered,” she said.Perhaps most alarming, the list includes the vast herds of barren-ground caribou that move across the Arctic tundra, as well as the eastern migratory herds around Hudson Bay. Neither category was considered in trouble 15 years ago. Now, scientists are recommending that the barren-ground caribou be listed as threatened, while the eastern migratory caribou – whose numbers have plummeted from more than one million to about 225,000 animals – qualify as endangered, the highest level of threat.canada’s Caribou populationDesignat-able unitCurrentestimateHighestestimateBarren-Ground800,0002,000,000EasternMigratory225,0001,100,000NorthernMountain43,00048,000Boreal33,000N/ANfld.32,000100,000Dolphinand Union20,000100,00013,700Peary50,000TorngatMountains1,4005,000SouthernMountain1,4002,500CentralMountain5001,300Atlantic-Gaspésie1301,500Note: Numbers collected 2014-2017THE GLOBE AND MAILSOURCE: CANADIAN GEOGRAPHICcanada’s Caribou populationDesignatableunitCurrentestimateHighestestimateBarren-Ground800,0002,000,000EasternMigratory225,0001,100,000NorthernMountain48,00043,000Boreal33,000N/ANewfoundland32,000100,000Dolphinand Union20,000100,000Peary13,70050,000TorngatMountains1,4005,000SouthernMountain1,4002,500CentralMountain5001,300Atlantic-Gaspésie1301,500Note: Numbers collected 2014-2017THE GLOBE AND MAIL, SOURCE: CANADIAN GEOGRAPHICcanada’s Caribou populationDesignatable unitCurrent estimateHighest est.800,000Barren-Ground2,000,000225,0001,100,000Eastern MigratoryNorthern Mountain48,00043,000Boreal33,000N/ANewfoundland32,000100,000Dolphin and Union20,000100,00013,700Peary50,000Torngat Mountains1,4005,000Southern Mountain1,4002,500500Central Mountain1,300Atlantic-Gaspésie1301,500Note: Numbers collected 2014-2017THE GLOBE AND MAIL, SOURCE: CANADIAN GEOGRAPHICDr. Ray, who is Canadian president of the Wildlife Conservation Society, said the dismal trend is echoed by continued declines among caribou in the Rocky Mountains and across the boreal forest that have long been understood to be at risk. Some caribou units are moving into higher threat levels faster than scientists can assess them.While the threats caribou face are complex and vary by region, the common denominator is human activity, primarily through resource development and, increasingly, climate change.Wherever they are found, caribou play the role of umbrella species, meaning their presence is of central importance to their ecosystems. In the North, they are also a food source for Indigenous communities.All caribou in Canada belong to one species. Scientists regard the 11 units as distinct because of a combination of their habitat, ecology and genetic differences. Some units contain only one herd; larger units have dozens.Story continues below advertisementStory continues below advertisementCARIBOU DISTRIBUTION ACROSS CANADACURRENT THREATSTATUS*DOLPHINAND UNION!!!Special concern!PEARYThreatened!!!!NORTHERNMOUNTAIN!Endangered!!!TORNGATMOUNTAINS!!!BARRENGROUND!!NFLD.!EASTERNMIGRATORY!!!CENTRALMOUNTAIN!!!!!!BOREAL!!!!!SOUTHERNMOUNTAINATLANTICGASPESIE*Based on assessments of 11 distinct population units ofcaribou for the Committee on the Status of EndangeredWildlife in CanadaCARRIE COCKBURN AND MURAT YÜKSELIR/THE GLOBEAND MAIL, SOURCE: CHRIS BRACKLEY/CANADIANGEOGRAPHICCARIBOU DISTRIBUTION ACROSS CANADACURRENT THREATSTATUS*DOLPHINAND UNION!!!Special concern!PEARYThreatened!!!!NORTHERNMOUNTAIN!Endangered!!!TORNGATMOUNTAINS!!!BARRENGROUND!!NFLD.!EASTERNMIGRATORY!!!CENTRALMOUNTAIN!!!!!!BOREAL!!!!!SOUTHERNMOUNTAINATLANTICGASPESIE*Based on assessments of 11 distinct population units of cariboufor the Committee on the Status of Endangered Wildlife in CanadaCARRIE COCKBURN AND MURAT YÜKSELIR/THE GLOBE AND MAILSOURCE: CHRIS BRACKLEY/CANADIAN GEOGRAPHICCARIBOU DISTRIBUTION ACROSS CANADACURRENT THREAT STATUS*!!!DOLPHINAND UNION!Special concernPEARY!!Threatened!!!!!EndangeredNORTHERNMOUNTAIN!!!!TORNGATMOUNTAINSBARRENGROUND!!!NFLD.EASTERNMIGRATORY!!!CENTRALMOUNTAIN!!!!!!BOREAL!!!!!SOUTHERNMOUNTAINATLANTICGASPESIE*Based on assessments of 11 distinct population units of caribou for theCommittee on the Status of Endangered Wildlife in CanadaCARRIE COCKBURN AND MURAT YÜKSELIR/THE GLOBE AND MAILSOURCE: CHRIS BRACKLEY/CANADIAN GEOGRAPHICThe vast geographic range of caribou presents a challenge for scientists trying to understand how the species is doing. That task is compounded by the fact that caribou populations are in constant flux, which makes it difficult to separate normal variations from a sustained downturn.Yet, even in the far north, the emerging prognosis for the caribou is no longer in doubt. Unless definitive action is taken, scientists say, caribou could be heading to a point of no return, even if they linger for generations.“We know there are natural cycles with their numbers, but all the herds except for a few seem to be approaching population minimums and we’re not seeing those signs of recovery that you normally would see,” said Brandon Laforest, an Iqaluit-based specialist in Arctic species and ecosystems with the environmental group WWF Canada.The caribou are among the most visible of the approximately 16,700 species that have suffered an average 60-per-cent decline since 1970, according to a new WWF report released on Monday.Experts say a big part of the problem in Canada has been government reluctance to come to grips with the plight of the caribou at a scale that goes beyond single resource projects and their local impact on individual herds.For example, last December, WWF Canada wrote to the Trudeau government, which opposes U.S. development on the Alaskan calving grounds of the Porcupine River caribou herd, which is part of the barren-ground unit, to ask why it has not moved to prevent mining projects on calving ground in Nunavut. The government has yet to respond.Story continues below advertisementConservation groups say the heel-dragging illustrates the inadequacies of Canada’s legal framework for species protection in the face of resistance from provincial governments and industry.Last year, the Canadian Parks and Wilderness Society launched a lawsuit against federal environment minister Catherine McKenna for what it says is a failure by the government to uphold its responsibilities to protect boreal caribou.In April, the federal government issued a report that said the provinces were failing to develop and implement boreal caribou protection plans as required, but Ottawa has so far not taken stronger action.“Canada’s caribou populations need our help, and the Government of Canada is working closely with the provinces and territories – who have primary responsibility – to better protect them,” a spokesman for the minister said.Boreal, or woodland, caribou are a threatened species in Canada’s boreal forests, due in large part to disruptions in their habitat by the forestry industry and roads.VALÉRIE COURTOIS/CANADIAN BOREAL INITIATIVEOutside of Canada, the Natural Resources Defense Council, based in Washington, is calling on Ottawa to employ a “safety net order” that would supersede provincial authority to protect boreal caribou habitat.From a global perspective, the action would be doubly effective, said Courtenay Lewis, a policy manager for the organization, because it would protect forests whose destruction would contribute significantly to climate change.Story continues below advertisement“Some of the largest carbon stores in the boreal directly overlap with some of the last remaining boreal caribou habitat,” she said.Dr. Ray said she plans to lay out her insights on Wednesday at the Ottawa meeting after having worked on six reports between 2009 and 2017 that detail the condition of every caribou unit in Canada.While her conclusions will not surprise experts, she said, her assessment work, based on the collective efforts of scores of scientists, has given her a rare vantage point on the species. In conjunction with her presentation, she has also worked with mapmakers at Canadian Geographic to show how the caribou units are distributed across the country and their worsening threat levels.But what is crucial, she said, is that the information translate into action.“It’s time to move in a real way towards protection,” she said. “We have to change the paradigm.”    Gwich'in people in the Yukon have depended on caribou for food for thousands of years. These animals are from the Porcupine River herd, a large subset of the so-called barren-ground caribou.Weronika Murray/The Globe and MailYukon hunter Harold Frost Jr., left, carries a caribou carcass to a meat cache with help from Gerald James of Fort Yukon, Alaska. Weronika Murray/The Globe and MailCaribou antlers are ever-present in Old Crow, Mr. Frost's hometown and the population centre of the Yukon's Gwich'in people. Antlers decorate homes and yards across the community.Weronika Murray/The Globe and MailA dog in Old Crow chews on a caribou skull.Weronika Murray/The Globe and MailDried caribou hooves and tendons are hung from trees. These can be used for making broth when caribou meat is scarce.Weronika Murray/The Globe and MailA poster hangs on the side of a log house in Old Crow, informing residents about the caribou harvest management plan. An arrow shows the caribou population in a healthy green zone. The Porcupine caribou's numbers aren't as badly depleted as other herds in Nunavut, Northern Ontario, Northern Quebec and Labrador.Weronika MurrayAt the John Tizya Centre in Old Crow, scenes of a caribou migration are painted on the windows. \"Vadzaih\" means caribou in the Gwich'in language.Weronika Murray/The Globe and MailBruce Charlie, chief of the Vuntut Gwitchin First Nation, wears a dress shirt with a caribou design. Mr. Charlie has pressed the Canadian government to challenge the Trump administration on Arctic oil drilling, which the chief has warned could damage the region's fragile ecosystem.Weronika Murray/The Globe and MailPorcupine caribou gather in the Yukon's Blow River Valley. Across the border in Alaska, the U.S. government is staking steps to allow oil drilling in the once-protected Arctic National Wildlife Refuge. Weronika Murray/The Globe and MailFirst Nations and environmentalists fear seismic testing to explore the underground oil and gas deposits will harm the pristine wilderness where the Porcupine caribou migrate every year.Weronika Murray/The Globe and Mail (Return to top) Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor. Latest News  Latest Videos © Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}