{"id": "Business, labour groups split over changes to Ontario apprenticeship system", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Ontario Premier Doug Ford speaks during question period inside the legislature at Queen's Park in Toronto on Sept. 17, 2018. Nathan Denette/The Canadian PressBusiness groups are praising proposed changes to Ontario’s apprenticeships system, saying it will ease labour shortages, but labour advocates say businesses will shift work onto apprenticeships as a way of reducing costs.The provincial government on Tuesday unveiled the Making Ontario Open for Business Act, a bill that scraps many employment reforms introduced by the previous government. The new law would eliminate paid sick days, freeze the minimum wage for two years and allow companies to pay temporary or part-time workers less than full-time staff doing the same work.The bill will also change the apprenticeship system. It would increase the ratio of apprentices to trained workers, or journeypersons, allowed on a job. This change affects 33 trades in which apprenticeship ratios are required and set by the Ontario College of Trades after independent reviews that involve industry and public consultations. The bill also proposes eliminating the College of Trades, the regulatory and enforcement body for tradespeople created in 2009.Story continues below advertisement“There have been persistent challenges in how the skilled trades in Ontario are regulated, the amount of College membership fees that apprentices and journeypersons are subject to and the complexity of the rules,” stated a release from the Ministry of Training, Colleges and Universities.Stephanie Rea, the ministry’s director of communications, said the bill’s intent is to reduce regulatory burdens on all parties and to encourage more people to become apprentices. The province has promised to release a plan in early 2019 for phasing out the College of Trades.Business groups such as the Ontario Chamber of Commerce and the Canadian Federation of Independent Business (CFIB) applauded the apprenticeship system reforms. They said the changes would make it easier to hire apprentices and address a growing labour shortage.“For more than a decade, both apprentices and employers alike have been urging the provincial government to remove barriers to apprenticeship training,” Plamen Petkov, CFIB’s vice-president for Ontario, said in a release. “Reducing artificial ratio restrictions, which were eliminated in most other provinces years ago, will allow more young people to enter the trades and pursue a meaningful career.”Many manufacturing companies have long been asking for these changes, said Ian Howcroft, chief executive of Skills Ontario, a non-profit that promotes trades careers to young people. He said there was “quite a bit of controversy” when the College of Trades was created.“Many felt it was too unnecessary and bureaucratic while others felt it would professionalize the trades,” he said, noting Skills Ontario doesn’t take a position and will work with whatever structure is in place. “In my personal view, it was off to a rocky start from the beginning ... it had a complicated governance structure and it became a partisan issue.”As the rules stand, an employer must have a prescribed number of trained workers for each apprentice, with varying ratios depending on the trade. The worker-to-apprentice ratios are as high as 6:1 for certain types of electricians, while many are 1:1, including powerline technicians and hoisting engineers.Story continues below advertisementStory continues below advertisementHaving one apprentice train alongside multiple experienced workers was meant to “ensure the safety and quality of on-the-job training of apprentices and as a way to provide for the future skilled labour needs of industry,” according to the College of Trades website. In the new regime, all trades ratios will be 1:1.Ms. Rea said the government listened to industry’s complaints about Ontario’s ratios, which she said are among the most restrictive in Canada.“Reducing ratios would allow them to hire more apprentices and meet anticipated future needs for skilled tradespeople,” she said. “In addition, a single consistent ratio requirement would reduce the regulatory burden on employers, modernizing and making the system easier to access and navigate for employers and workers.”Toronto & York Region Labour Council president John Cartwright said there’s a long history of construction companies trying to circumvent quality and safety in the name of cheap labour, something the apprenticeship ratio requirements were meant to address. Now, he expects some companies will take as many apprentices as they can get, in the name of cost savings, with little regard for the quality of their education.“Flooding the market with a whole bunch of apprentices is only about people who want to use them as cheap labour and not to see them trained to the highest level,” he said. “You [will see] impact on both sides of the generations: older workers who will find themselves without work and younger workers will find the market flooded.”Michael Grieger, owner of Define Metal Fabrication in Scarborough, Ont., said he wondered the same thing when he heard about the 1:1 ratio plan. “The training may be watered down,” he said.Story continues below advertisementAccording to Mr. Grieger, the measures don’t appear to address the immediate problem of finding qualified tradespeople. He said focusing on education would be a better strategy. There aren’t any schools left in Ontario that teach his trade, precision metal fabrication, so his apprentice has nowhere nearby to complete their education. “I find it’s a very empty [plan so far],” he said.Apprentice electrician Megan Kinch, who lives in Toronto, calls the 1:1 ratio plan “a disaster.” Competing with lower-cost apprentices, she said, is already a problem for newly minted journeypersons, who worry about getting laid off when they finish their training. “I’ve met plumbers who ... don’t want to write their exam because they feel they can’t compete.\"Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}