{"id": "Canadian ed-tech startup Squiggle Park improves literacy through play", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Educational video game – for children and adults learning English as a second language – champions reading in Canada and abroadA child works with a Squiggle Park video game created by a Canadian ed-tech company to improve language skills.A red cartoon cyclops with a toothy grin greets all visitors at Squiggle Park. A friendly, three-eyed green monster isn’t far behind. No, this isn’t some new trendy play space trying to compete with Chuck E. Cheese and the like, though there is one commonality: captivating games that hold the attention of young minds.At its core, Squiggle Park is a video game that teaches children how to read, but the educational program, developed by Canadian entrepreneurs Leah Skerry and Julia Dexter, offers more. It’s an immersive platform with a cheerful interface that promotes literacy among pre-kindergarten to Grade 2 students – and more recently, adults learning English as a second language – by building confidence in reading through play.According to the Canadian Education Statistics Council, just half of Canadian adults age 16 and above read at a level deemed necessary to live and work in today’s society. It’s an alarming statistic, and one that pushed Ms. Skerry and Ms. Dexter to take action, in addition to their own personal experiences with shortcomings in the education system.Story continues below advertisement“In classrooms, teachers have huge, diverse groups of learners, but they’re being asked to support them in a very personal way, which is impossible. It’s impossible to scale,” Ms. Dexter says. “We believe that if we can create innovations that help kids be driven to push their own learning that we can revolutionize how education is delivered.”Squiggle Park was brought to market as a paid product in 2017, though research and development initially began in 2014. Currently, it’s used in more than 10,000 educational institutions, including major school boards across Canada, like Peel Region in Ontario, Surrey Schools District in British Columbia, and all school boards in Nova Scotia. In the United States, Squiggle Park can be found in participating New York public schools and across the Chicago Public Schools district, the third-largest school district in the United States. Its reach extends beyond North America, too. Students as far as Oman, China, India, Vietnam, Brazil and soon Barbados use it to improve their English reading.Leah Skerry, left, and Julia Dexter of Squiggle Park, a Canadian EdTech company that uses video games to improve language.“Canadian education content is seen as a premium product around the world,” Ms. Dexter says. “Japan, for example, has a one-to-one tablet program for preschoolers. So there’s actually less reluctance to using technology with even the youngest learners in some of these nations.”Squiggle Park isn’t strictly used in school settings. Outside of the classroom, community programs such as the Boys and Girls Club of Canada as well as the YMCA have implemented the game in their programming, and parents can download the app onto a home computer or tablet.Earlier this year, Squiggle Park partnered with the Department of Immigration, Refugees and Citizenship Canada to help both children and adult English language learners improve literacy skills. The pilot program found that those who used the video game learned nearly twice as many new sounds as those who did not play, and on average, the pre-kindergarten players nearly tripled the number of letters they knew.The content is designed in such a way that players practice and repeat different skills, like phonemic awareness (comprehending the sounds of a word) and phonics (understanding the relationship between the sounds that letters make), to better understand words within each game. Everything is done at the player’s speed and, as with the structure of a traditional video game, one progresses only once the current level has been mastered.While Squiggle Park is a Canadian company – Ms. Dexter is based in Halifax and Ms. Skerry in Waterloo, though she’s spending the next several months in Chicago – the goal was always to go global.Story continues below advertisementStory continues below advertisement“We decided to target the U.S. market right away by hitting the phones and calling principals in the U.S. to join a pilot program that we launched in the fall of 2016. The pilot had 1,200 teachers participate and there were clusters from specific states, including, Rhode Island, Texas, California and Illinois,” Ms. Dexter says.Immediately focusing on the U.S. market helped to propel the business forward, but participating in startup incubators like Google For Entrepreneurs and Waterloo-based Communitech and its Fierce Founders accelerator program have also been critical in Squiggle Park’s success thus far.“In these programs we were paired up with top mentors who helped us understand the value of focusing on our strengths,” Ms. Dexter says. “Fierce Founders pushed us to think about how to reach real scale in our business by building sales and marketing infrastructure to succeed.”Squiggle Park has since graduated into Communitech’s Rev program, which focuses on accelerating revenue, and the company meets weekly with its mentors.With the company’s co-founders living in different parts of the country, operations are not that of a traditional business; there is no brick-and-mortar office building with a Squiggle Park logo on the front door. But for an ed-tech startup, a strong remote team is almost expected, and technology plays an important role in how the team stays on track.Currently there are 15 employees, two of whom are based in the United States (an account executive and a developer).Story continues below advertisementWeekly video conference calls to review KPIs (referred to affectionately by the team as “rocks”) and Friday check-ins to share highs and lows are strictly enforced. Twice per year in-person retreats with the entire staff provide invaluable face-to-face time.Squiggle Park is pushing boundaries in education, but not all Canadian innovators are as risk tolerant as its co-founders.Children work with the Squiggle Park video game. Educating adults on the value of meaningful screen time for children, meanwhile, is an uphill battle. 'Technology doesn’t have to be a negative thing. It can actually be a quite positive thing if used properly,' Ms. Dexter says. “Canadian CEOs have reported that their greatest barrier to innovation is ‘risk and uncertainty,’ which is rather ironic given that areas with risk and uncertainty are full of upside opportunity,” says Elicia Maine, professor of innovation and entrepreneurship and academic director of the Invention to Innovation program at the Beedie School of Business, at Simon Fraser University in B.C.Most recently, Dr. Maine was on the Council of Canadian Academies’ expert panel that researched how business schools can better promote and teach innovation skills across the country. (Findings were published on Oct. 18.)“What we need to teach and role model more in Canada are the skill sets of how to manage under conditions of uncertainty, so that our ventures and established companies have the chance to profit from the upside of uncertainty, while mitigating their downside exposure,” Dr. Maine says.Squiggle Park is profiting – it’s on track to generate $1-million in sales this year – but it still faces challenges. Hiring outside of Canada is one.Story continues below advertisement“The competition for technical talent is fierce and to attract the best when you are a startup means you have to find ways to inspire potential hires about your vision and culture and then deliver,” Ms. Dexter says.And while teaching may be the crux of Squiggle Park’s ethos, educating adults on the value of meaningful screen time for children is an uphill battle.“Technology doesn’t have to be a negative thing. It can actually be a quite positive thing if used properly,” Ms. Dexter says. “That’s why the global market is quite exciting because other countries are so much more advanced in terms of how they’re using technology in education and how open they are to trying that.”Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor. Latest News  Latest Videos © Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}