{"id": "A growing number of people seeking asylum in Canada are Americans, statistics show", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.As Canada grapples with an influx of irregular asylum seekers, statistics show a growing number of people seeking refugee protection in Canada are Americans.In 2017, people whose country of origin was identified as the United States made up the third largest cohort of asylum seekers. A total of 2,550 asylum claims were made by United States citizens in 2017.Partial statistics for this year show this trend continued at border and inland entry points, where 1,215 Americans sought asylum between January and August, according to government statistics.Story continues below advertisementAnd when it comes to “irregular” migrants who have arrived in Canada between official border crossings, the U.S. was No. 2 in the top five countries of citizenship between January and June, after Nigeria.Nearly all the Americans claiming asylum in Canada are children of immigrants who don’t have permanent status themselves, the Immigration Department says.“The majority of U.S. citizens claiming asylum are minor asylum claimants who were born in the United States whose parents are citizens of another country,” said Mathieu Genest, press secretary for Immigration Minister Ahmed Hussen.“In these instances, the claims of persecution are made against the parents’ country of origin, not the United States. However, given their citizenship, the minor children appear as U.S. citizens in these tables. These children predominately accompanied Haitian or Nigerian national adults.”Many of them have been living in the U.S. for years under a program established in the 1990s that offers temporary status to people from countries that have endured war or environmental disasters. Many of these migrants have had children during their time in the U.S., who were born American citizens.But after U.S. President Donald Trump announced plans in 2017 to end the temporary protected status program, Canada began to experience an influx of irregular migrants crossing the Canada-U.S. border.Over 36,000 asylum seekers have since arrived in Canada from the U.S., avoiding official border checkpoints where they would have been turned back to the U.S. under the Safe Third Country agreement between the two countries.Story continues below advertisementStory continues below advertisementCanadian immigration lawyers say they have seen an increase in the number of migrants without permanent status who have lived in the U.S. for years, with U.S.-born children, seeking refugee protection in Canada.“We have been getting a lot of calls, especially from Haitians who are living the U.S. and from certain South Asian groups,” said Zohra Safi, an immigration lawyer with the Bellissimo Law Group in Toronto.“They have a sense of insecurity because a lot of refugees that were accepted (to the U.S.) on a temporary basis are just worried, there is no closure for them right now and their statuses are being revoked.”Safi says she has advised such people against seeking refugee status in Canada because they’re be unlikely to be accepted under Canada’s refugee laws.But Ottawa immigration lawyer Arghavan Gerami says the changing political landscape in the United States could be grounds for migrants claiming fear of persecution and removal from the U.S. to be allowed to stay in Canada.“The situation in the U.S. with the Trump administration, with the policies of the government, with the changes that have happened – that in itself can act as a new trigger of fear,” Gerami said. “These are new types of arguments that can be advanced in these claims that may well be unique and precedent-setting in some cases.”Story continues below advertisementTrump has publicly mused about eliminating “birthright citizenship,” the principle that with a very few narrow exceptions, people are automatically citizens of the countries where they’re born. That would make the non-citizen parents of American-born children even less secure there.The Immigration Department says decisions on asylum cases made by the Immigration and Refugee Board are based on the merits of the specific facts presented in an individual case.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}