{"id": "Red flags raised as Ontario reinstates doctor’s note requirement for sick workers ", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.The Ontario government’s proposal to reinstate the doctor’s note requirement for staff who call in sick is welcome news to many employers, but critics say the policy overburdens the medical system and spreads illness.As part of the Making Ontario Open for Business Act, or Bill 47, the Progressive Conservatives plan to bring back the medical note requirement for employees. The legislation would replace the Fair Workplaces, Better Jobs Act, or Bill 148, passed by the previous Liberal government.The law now grants employees up to 10 personal emergency leave days a year, two of them paid. Employers also can’t ask employees to provide a medical note.Story continues below advertisementThe proposed bill, which was tabled this week and could become law as early as next month, would give workers up to three days for personal illness, two for bereavement and three for family responsibilities. The days will be unpaid and employers “have the right to require evidence of entitlement to the leave” from a health professional.Sarah Letersky, director of communications at the Ontario Ministry of Economic Development, Job Creation and Trade, said the government wants to create an environment where businesses can grow and create jobs. “Requiring ‘evidence reasonable in the circumstances,’ including sick notes, is an employer work force and attendance management tool,” she said in an email statement to The Globe and Mail.Many in the medical community argue that requiring employees visit a doctor to get a note puts additional strain on the health-care system. The requirement could also put others at risk of getting sick, in particular patients with serious illnesses and low immune systems.“This is a policy that will send more patients with uncomplicated viral illnesses into my emergency waiting room solely to get documentation so they don’t lose their jobs,” said Kate Hayman, an emergency physician in Toronto and spokesperson for the Decent Work & Health Network.Dr. Hayman believes the PC government is responding to anecdotal stories from business owners who reported staff abusing the no-note policy, but not taking into consideration the larger health and economic impacts.“It’s bad health policy,” Dr. Hayman says. “It’s not a good use of health care dollars and is shifting cost back on to the public system. For a government that talks about efficiencies, it’s nonsensical.”Some business owners are concerned employees will abuse the system if workers don’t have to get a medical note as proof of why they were off work. Employers also say they may not always ask for a doctor’s note from sick staff, but want the flexibility if they believe it’s required.Story continues below advertisementStory continues below advertisementRik Ocvirk, vice-president of The Distillery Restaurants Corporation, poses for a photo at Cluny Bistro and Boulangerie in the Distillery District in Toronto on Sept. 20, 2018.Tijana Martin/Globe and MailEmployers, including Rik Ocvirk, vice-president of Distillery Restaurants Corp., reported a spike in people calling in sick once Bill 148 took effect in January. He says about 75 per cent of the 700 staff he oversees have taken both of their sick days so far this year, a higher rate than in the past.“It’s a change people are unfortunately taking advantage of,” Mr. Ocvirk says. “[Bill 47] rights that wrong in some way and allows the employer-employee relationship to be something that is managed by them, not by a government.”Mr. Ocvirk believes most employers only ask for a note when they “think there’s not a real sickness.”“It’s just allowing an employer to have the ability to ask the question in order to hold people accountable,\" he says. \"The challenge for us is that [Bill 148] took away any ability for an employer to simply ask questions and have accountability of their own staff.”Ontario Medical Association president Nadia Alam, however, urged the government to “think of this in the broader public health context,” in a brief e-mail statement.“With flu season upon us, prolonged wait times and hallway medicine, we need to find ways to keep doctor’s offices free for patients sick enough to need it,” Dr. Alam said. “We need to find ways to let people stay home to recover from minor illnesses.”Story continues below advertisementShoetopia president Peter Mohr stands in his Waterloo store on March 28, 2018. Globe and MailPeter Mohr, owner of Shoetopia Footwear, which has stores in Fergus, Waterloo and Mount Forest, says he’s considering offering two paid sick days a year for employees, even if it’s removed in the new bill. But he will ask for a doctor’s note if allowed again by law. He believes the notes prevent employees from taking advantage of paid sick days.“If the doctor says you’re sick, we’ll pay for [the day off],\" he says. “If you’re not, we’re not paying for it.”Shoetopia offered some paid sick days before Bill 148 mandated it. When paid sick days became law in January, he estimates roughly 80 per cent of his 20 employees used their two paid sick days by the end of February.“If you’re sick, we don’t want you at work anyway because you’ll infect everyone else,” Mr. Mohr says. “I just don’t want to be taken advantage of.”Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}