{"id": "Targeted by the taxman: Why the CRA is playing tough with small business", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.The MGM Restaurant in Nanaimo, B.C., has always been a bit like a community centre. It hosts dance lessons, Wednesday night chess, even stamp-collector meetings. The city’s emergency response workers – paramedics, firefighters and local RCMP – used to have their own standing reservation in a separate section. But they stopped coming in soon after federal tax auditors made a bombshell allegation.The Canada Revenue Agency began poring through the MGM’s books in 2006 and became convinced that owner-operators Tony and Helen Samaroo were tax cheats of the highest order. The agency accused them of skimming $1.7-million over a two-year period, resulting in 21 criminal tax-evasion charges in 2008. The Samaroos faced serious prison time and financial ruin.Many individual taxpayers, accountants, tax lawyers and former CRA employees describe the agency’s approach as having become overly adversarial, straining its relationships with taxpayers.Chris Wattie/REUTERSAs a B.C. Supreme Court judge would later find, CRA investigators never seriously considered the possibility the Samaroos might be innocent. After the story made the front page of the local newspaper, one auditor said in an e-mail to colleagues, “I can’t wait to read the edition after the guilty verdict.” Even when it became clear the CRA didn’t have a case, the agency’s lead investigator on the file manufactured incriminating evidence, while concealing evidence that might have helped clear the restaurant owners, according to the judge’s ruling. The CRA set out to make the facts of the case fit, the judge said.Story continues below advertisementIt did not succeed. In 2011, the Samaroos were acquitted in a criminal trial that exposed serious flaws in the CRA investigation.Not that it meant an end to their saga. “Over the past 12 years we have not had a single day in which we have been free of the fear of destruction by the CRA,” the Samaroos said in an e-mail.In fact, many individual taxpayers, accountants, tax lawyers and former CRA employees describe the agency’s approach as having become overly adversarial, straining its relationships with taxpayers – particularly small businesses.Now facing a level of public, political and legal scrutiny the agency is unaccustomed to – including scathing reviews from the Auditor-General, who is scheduled to release a report on the CRA’s audit activities on Nov. 20 – the CRA is in the midst of a Trudeau government effort to soften its image and instill a “culture of service.”It has a long way to go, its critics say.“The Prime Minister has said that the CRA is to treat taxpayers like clients, but instead they treat them with contempt, they treat them abusively and predatorily,” said Steven Kelliher, a Victoria-based lawyer who has represented the Samaroos for more than a decade, as well as other clients who have found themselves in the taxman’s crosshairs. “When we sit down to fill out our tax form, we are afraid of them – and that’s what they want.”The CRA interacts with virtually every business and individual in the country, making it a main point of contact between Canadians and the federal government. For the most part, it’s a civil exchange: By global standards, Canada is a country of honest taxpayers, with some of the world’s highest tax compliance rates – about 93 per cent, according to the CRA.Story continues below advertisementStory continues below advertisementBut offshore tax evasion has assumed a high public profile recently, sparked by the revelations in the Panama Papers, which included dozens of Canadian names on a list of wealthy people hiding money in foreign tax havens. The CRA’s subsequent efforts to crack down on evasion and abusive tax avoidance “identified” $2.9-billion in “fiscal impact” last year. But PEI Senator Percy Downe, a frequent critic of the agency, said the CRA is proving less effective at actually collecting money from those sources. “So they overcompensate on domestic tax evasion,” he said. “The tough talk they use about overseas tax evasion is a reality domestically.”Which is one of the reasons why, in much of the tax profession, the CRA has developed a reputation for treating small-business owners with a presumption of guilt. Once the agency’s systems flag a potential tax evader, it can be hard to disabuse investigators of their suspicions.“We hear it from taxpayers and we see it as professionals,” said Fred O’Riordan, a former CRA assistant commissioner who is now the national leader for tax policy with Ernst & Young LLP. “There are audits that are not well founded, and it’s very difficult to move the agency off its positions.”Doing so often requires onerous amounts of time and money, which raises concerns about a two-track tax system – one for those with the means to hide from and fight the CRA and one for those who do not. “If you’re an average Canadian and you get a call that the CRA wants to visit you, you should be shaking in your boots,” Mr. Downe said.Any blame for the current state of the CRA, according to the government, belongs to its predecessors. “After 10 years of fear-mongering and aggressive communication with taxpayers under the Harper Conservatives, our government has been working hard to take a client-focused approach,” Revenue Minister Diane Lebouthillier said in a written statement. “However, I recognize that this will take some time and that there is still work to be done.”And yet, since the Liberals came to power, most new CRA funding has not gone to client services, employee training or dispute resolution but to auditing and enforcement. And the government expects a big return on that investment, putting pressure on investigators, auditors and collectors to hunt for hidden income and boost tax revenues.Story continues below advertisementIn the three budgets tabled so far by the Trudeau government, roughly $1.5-billion in new funding has been allocated to the CRA over a five-year period. About two-thirds of that money has been earmarked for enforcement activities meant to crack down on tax evasion and to fight sophisticated tax avoidance. “The pointy end of the stick gets all the attention and all the additional resources,” Mr. O’Riordan said.As the federal budget papers make explicit, for every new dollar of funding dedicated to auditing, the government expects a return of about $5 in tax revenues. That kind of expectation to deliver financially filters through the ranks of the CRA’s audit division. “If you’ve got an auditor who has a huge assessment, that’s viewed as a thumbs-up in the audit area,” Mr. O’Riordan said.Having that huge assessment stand up on appeal is a different matter. A 2016 Auditor-General report found that 65 per cent of tax objections reviewed by the CRA over a five-year period were settled fully or in part in favour of the taxpayer. The CRA has since seen little improvement on that front, with 63 per cent of assessments being reversed at the appeals level in the fiscal year ended last March.“That means that all those taxpayers were put through this grief for nothing,” Mr. O’Riordan said. And it suggests a quality-control problem in CRA investigations.The outcomes of tax objectionsTaxpayers filed more than 220,000 objectionsover a five-year period ending March 31, 2016.Nearly 175,000 went to review, resulting infavourable decisions for taxpayers in about 65per cent of cases.No change toassessment:34.8%Objection allowedin full: 42.3%Objection allowedin part: 22.3%Increase in incometax owed: 0.6%MATT LUNDY, THE GLOBE AND MAIL, SOURCE: AUDITOR-GENERALThe outcomes of tax objectionsTaxpayers filed more than 220,000 objections over a five-year period ending March 31, 2016. Nearly 175,000 went toreview, resulting in favourable decisions for taxpayers inabout 65 per cent of cases.No change toassessment:34.8%Objection allowedin full: 42.3%Objection allowedin part: 22.3%Increase in incometax owed: 0.6%MATT LUNDY, THE GLOBE AND MAIL, SOURCE: AUDITOR-GENERALThe outcomes of tax objectionsTaxpayers filed more than 220,000 objectionsover a five-year period ending March 31, 2016.Nearly 175,000 went to review, resulting infavourable decisions for taxpayers in about 65per cent of cases.No change toassessment:34.8%Objection allowedin full: 42.3%Objection allowedin part: 22.3%Increase in incometax owed: 0.6%MATT LUNDY, THE GLOBE AND MAIL, SOURCE: AUDITOR-GENERALIn the Samaroo case, for example, the original allegations were supported by a net worth audit, which looks at a taxpayer’s financial position at two points in time and compares it with income reported over the same period to identify discrepancies. That analysis suggested the Samaroos misappropriated $1.7-million. But the auditor made a basic accounting mistake that could have accounted for almost $1-million. Inheritances of almost $400,000 were also missed.“A net-worth audit is an increasingly popular tool for the CRA. But it’s a very blunt tool – and it’s often flawed,” said Toronto tax lawyer David Rotfleisch. “A lot of auditors are just ticking off boxes and coming up with numbers that make no sense.”Story continues below advertisementWhether taxpayer grievances and negative experiences add up to a systemic problem at the CRA is a matter of opinion. Mr. O’Riordan said that in his experience at, and with, the CRA, “99 per cent of the people are very professional and trying to do the best job possible.” But many dealing with auditors and collectors on a daily basis speak of a deterioration of service and an unfamiliarity with the tax code. “The CRA doesn’t give enough resources to their auditors. Tax evolves very quickly, and there are a lot of very difficult concepts. I find that sometimes auditors are left to figure it out on their own,” said James Rhodes, a Kitchener, Ont., lawyer specializing in tax disputes.Once auditors make their assessments, they are often taken off the file. Mistakes may never make their way back to the original auditor, even if the appeals division fully reverses the decision. “To me that’s the greatest fault with the system. I feel that there is no disincentive to doing a bad job,” Mr. Rhodes said. To that end, however, the CRA says it is making progress, having launched the “feedback loop” process, which is meant to improve communication between the agency’s various entities.But the sheer amount of time it takes the CRA to resolve disputes, particularly complex ones, undermines the idea of timely feedback. Auditor-General Michael Ferguson’s 2016 report also found that the average high-complexity income-tax objection took almost 2½ years to settle. “That type of performance just isn’t acceptable, and the government departments need to find a way to design their services so that they actually meet the needs of the citizens,” Mr. Ferguson said at the time. The CRA said it has brought down processing times, though they remain well in excess of those of other countries with similar tax systems. The most complex disputes, for example, currently take an average of 690 days – almost two years – to resolve.In other branches of the agency, service standards have also been found to be dismal. A subsequent Auditor-General report last November found that CRA call centres blocked more than half of the 53.5 million calls received between March, 2016, and March, 2017, so the agency could meet its standards for call wait times. Additionally, call-centre agents gave bad advice to taxpayers almost a third of the time. In response, the CRA said it has hired more agents and improved its training.Liz Temple had a reputation for being one of the “softer” collections officers. In 24 years at the CRA, she spent much of her time visiting people who owed taxes, assessing their ability to pay and figuring out a plan to settle their debts. “I didn’t go for the jugular right away. I gave them a chance,” Ms. Temple said. Her accounts often consisted of very small business owners who lacked basic accounting controls. “They’re trying to do it on their own. They need bookkeeping, but they just can’t afford it.”Liz Temple spent 25 years as a collections officers/auditor at the CRA. She left in 2014, unhappy with the CRA’s increasingly aggressive approach. She now acts on behalf of small businesses in Kitchener who find themselves facing big tax assessments.Ian WillmsOver the years, the softer approach lost favour with her superiors, Ms. Temple said. The process resorted more quickly to legal options such as garnishment and seizure of assets. She said she felt a culture shift to a stricter posture. There was less consideration for honest mistakes, reasonable explanations for anomalies or for a person’s ability to pay. By the time she retired in 2014, Ms. Temple said the CRA’s prevailing attitude toward anyone who owed taxes had hardened: “You’re stealing from the government.\"It took Luc Dubois six years to convince the CRA he hadn’t done anything wrong. He owned and operated a group of Quebec summer day camps as well as a large residential camp in the Laurentians. In 2010, an audit claimed Mr. Dubois and his company had underreported income for the four years prior by more than $1-million. He faced a bill of $750,000 in taxes, penalties and interest. When he met at his accountant’s office with the CRA auditor, Mr. Dubois’s heart sank. “He had already made up his mind. He was not interested in understanding our business at all,” Mr. Dubois said. “I realized I was in big trouble.”He committed himself almost full time to challenging the CRA’s claims, while simultaneously preparing for bankruptcy should he lose his case. “We were almost killed by this,” he said.In 2010, the CRA claimed Luc Dubois failed to report $1.4-million in revenue, making for a $750,000 bill with taxes and penalties. For six years he fought, eventually getting the CRA to admit he owed nothing. Roger LemoyneFinally, after dealing with six different investigators and managers and six reassessments over six years, Mr. Dubois wrestled his CRA tax bill down to about $6,000. He didn’t even want to pay that on principle. “But I had to stop the bleeding.” He had spent almost $100,000 in accounting and legal fees. He sold the company and vowed to never go into business in Canada again.The CRA said privacy rules prevent it from discussing Mr. Dubois’s file. But his lawyer confirmed the facts of the tax dispute. “It never should have happened in the first place,” said Alain Ménard, a partner at Cain Lamarre LLP in Montreal. “You can see it at work, this must-win-at-all-costs attitude.”This was not always the way of the CRA, said Mr. Rhodes, the Kitchener lawyer. In his early years in the business, the point of an audit was to arrive at the right answer. “They would say, ‘Your client didn’t claim enough for their work space and home, but here are some other expenses we just can’t accept.' It was a corrective thing. … These days, auditors will never mention anything that’s in your client’s favour.”The agency is not oblivious to the complaints. “While there’s no doubt that collection or audit situations can be tense, the CRA has heard the message that this is an area for improvement and is working with small business representatives on the issue,” CRA spokesman Dany Morin said in an e-mail.For much of its history, the CRA was left to its own devices as it went about the business of filling the national coffers. When Mr. Downe served as prime minister Jean Chrétien’s chief of staff, he sat in on every cabinet meeting for two years. “There were never any hard questions asked about just what kind of job they were doing. I don’t think the CRA was ever mentioned,” Mr. Downe said.Hard questions are being asked now. In addition to the Auditor-General’s attention, recent court decisions have opened the agency up to a new level of legal exposure. Once virtually immune to civil claims, the CRA was found by the B.C. Supreme Court in 2014 to owe a “duty of care” to taxpayers – an obligation the CRA strenuously resisted. “It’s an outrageous concept – though they have so much power and control over people, they’re not going to accept any responsibility in how they wield it,” said Laurie Armstrong, a retired lawyer who represented the plaintiff in the suit.In August, a ruling in Quebec Superior Court found the CRA negligent in conducting an offshore tax audit. “Taxpayers, the courts, and the CRA will now be alive that there’s a movement of the times towards negligence awards against the CRA,” said John Grant, a tax litigator at national law firm Miller Thomson LLP. “There should be a chilling effect on CRA’s management.\"For the Samaroos, the struggle did not end with their acquittal.Last March, they won a lawsuit against the CRA in a groundbreaking finding of malicious prosecution. In ordering the CRA to pay the Samaroos $1.7-million in damages and legal fees, Justice Robert Punnett said the prosecution of the family “violated fundamental rights and was highly reprehensible.” And he suggested the issues exposed by the trial and civil suit that followed may in fact extend to the core of the CRA – that it is potentially permeated by an “unfortunate culture.”The CRA is appealing the decision.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}