{"id": "Montreal satellite startup NorthStar Earth & Space inks partnership", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Montreal satellite startup NorthStar Earth & Space Inc. has inked a key space-research partnership to help it build a network of satellites and ground stations it hopes will change environmental monitoring, detecting events such as chemical shifts in farmland soil and unnoticed pipeline leaks.NorthStar will announce a partnership Thursday with the Space Alliance of Europe, which represents major Italian and French aerospace industrial groups, to help deepen the company’s expertise in satellite manufacturing and the development of ground stations to receive data. The Montreal startup announced $52-million in financing in August, including from the government of Quebec, and said this week that the Space Alliance and the federal government’s Strategic Innovation Fund were also contributors to that funding round.The company plans to launch a “constellation” of 40 satellites to circle the Earth in the next 30 to 36 months, each equipped with a suite of sensors – hyperspectral, infrared and optical – that would conduct chemical analysis of the Earth’s surface both night and day. “Those things combined bring information levels higher in a time when dimension, precision, richness and timeliness of data is more and more in demand,” said Stewart Bain, NorthStar’s chief executive officer, in a phone interview.Story continues below advertisementHe describes NorthStar’s mission as “continuous environmental management,\" offering a platform, open to application developers, to use predictive analytics to relay the consequences of the data for clients. Potential end users, the company says, could include farmers, who’d want to be aware of field contaminants to take action before crop death; oil and gas companies, who could be able to detect small, damaging leaks in pipelines and repair them before they grow disastrous; and forestry groups, who could be notified of extreme dry conditions to pre-emptively make water drops. The satellites would also scan the planet’s orbit for potentially harmful asteroids and space debris.The company would collect the data at three “Earth stations” in the Canadian North; Mr. Bain said that NorthStar has scouted six northern locations to house them, some of which already have existing stations they could use.“Northstar is a shining example of how Canada’s space sector is driving game-changing technologies,\" said Danielle Keenan, a spokesperson for Navdeep Bains, the federal Minister of Innovation, Science & Economic Development. The ministry oversees Ottawa’s Strategic Innovation Fund, which provided $13-million in funding to the company – part of the original $52-million announced in August, but which was not disclosed until this week. “This project will lead to more research and development, and more training in advanced technologies for Canadian workers and students,\" Ms. Keenan wrote in an e-mail.NorthStar’s majority owner is Telesystem Space Inc., which is jointly owned by Telesystem Ltd., the media-and-tech holding company chaired by veteran entrepreneur Charles Sirois, and an affiliate of Rogers Telecommunications Ltd. The Arizona aerospace company KinetX Inc. is a founding shareholder.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}