{"id": "Oversight gap at private infusion clinics poses health risk, Ontario documents say", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.The lack of formal oversight at private clinics where medications are administered intravenously could pose risks to the health of patients, including cancer patients receiving chemotherapy, according to government documents obtained by The Globe and Mail.Officials at Cancer Care Ontario (CCO) and Ontario’s Ministry of Health and Long-Term Care warned in briefing notes last year that private clinics providing prescription drugs by IV fall into a regulatory “grey area” – meaning that, unlike most other health-care facilities outside hospitals, infusion centres don’t have to be licensed or inspected.Although the briefing notes, released through freedom-of-information requests, speak only to clinics in Ontario, there are more than 350 private infusion centres across Canada that provide IV drugs to patients with diseases such as rheumatoid arthritis, Crohn’s disease and multiple sclerosis, among others.Story continues below advertisementThe briefing notes say that without formal licensing, there is no guarantee physicians will be on site at private clinics when they need to be, or that medications will be stored and prepared properly.However, three infusion-clinic operators mentioned in the CCO briefing note all told The Globe that their own high standards ensure the facilities are clean, safe and staffed by health professionals trained to help patients who react badly to IV medications. Indeed, the government documents do not mention any instances of harm coming to patients who received infused drugs at private clinics.Outside of Ontario, private infusion clinics operate in a similar regulatory void.In fact, when a complaint was filed with Health Canada in late 2016 alleging that McKesson, the giant drug wholesaler and pharmacy company, had improperly stored the IV drug Remicade at its chain of private infusion clinics, Health Canada officials spent four months trying to figure out which government body actually oversaw the clinics, according to more than 700 pages of Health Canada correspondence obtained through another freedom-of-information request.“It sounds like Health Canada is all good with the storage and transport of the medication, but they themselves don’t appear to know who regulates the actual dispensing. That was their actual question to me,” said a Jan. 5, 2017, e-mail from an official connected to the regulatory college that oversees nurses in British Columbia whose name is blacked out. “I found it a little strange that they didn’t know the answer to this.”The Globe and Mail obtained the Ontario and Health Canada documents as part of an investigation into how Remicade – an IV drug for rheumatoid arthritis and Crohn’s disease – became Canada’s top-selling drug by revenue and one of the most lucrative in the country’s history.Remicade’s arrival in Canada in 2001 helped to spawn a large private infusion-clinic industry that today exists outside the public health-care system. The clinics, which are operated by third parties such as McKesson but paid for by the pharmaceutical companies that make infused medications, sprung up when Canadian hospitals were slow to make space for patients who required a new generation of high-priced chronic-disease drugs delivered by IV.Story continues below advertisementStory continues below advertisementIn the 2016 complaint against McKesson, a former employee alleged that the drug wholesaler had improperly shipped vials of Remicade to McKesson’s Inviva chain of private infusion clinics, and that the vials were allegedly stored in “bar-type” fridges at the clinics, rather than medical refrigerators with temperature alarms and other safety features.McKesson, a company best-known for owning the Rexall chain of drugstores, said the allegations were untrue and co-operated with Health Canada’s probe. Health Canada took no action against the company, but only after more than four months of back and forth about who had jurisdiction over what one inspector called the “convoluted” file.In the end, Health Canada forwarded the case to the self-regulatory bodies that oversee physicians in British Columbia and in Ontario, where most of McKesson’s Inviva clinics are located, even though the College of Physicians and Surgeons of Ontario (CPSO) made it clear in a Jan. 26, 2017, e-mail to Health Canada that, “the CPSO does not regulate practices of clinics per se, and specifically, the Inviva infusion clinic[s.]”The CPSO primarily handles complaints against specific physicians. Registered nurses, who are governed by their own regulatory colleges in every province, usually insert the IV lines and monitor the infusions at private clinics, but the clinic operators also pay doctors to either be on site or on call, depending on what kind of medication is being infused.“Safety and high-quality patient care are our top priorities,” Darius Kuras, a spokesman for McKesson, told The Globe by e-mail. “Inviva practices ensure that qualified health-care professionals oversee the infusion process and comply with regulatory and industry standards in all markets in which we operate.”The CPSO inspects out-of-hospital premises where procedures are performed under anesthesia, such as endoscopy clinics and cosmetic-surgery centres, while Ontario’s Ministry of Health inspects other designated independent health facilities, such as diagnostic testing centres. Infusion clinics don’t fall under either oversight program, nor would they fall under a new, combined inspection program that the province’s former Liberal government passed into law but failed to enact before losing office in June.Story continues below advertisementWhen it comes to IV chemotherapy, most is provided in hospitals, not private clinics. However, there are exceptions to that rule when oncologists and patients with robust private drug insurance want access to cancer medications that are not covered by the public system − something that most often happens when a drug is new or its use in a particular type of cancer has not been approved by Health Canada.In those cases, oncologists may refer their patients to private centres such as the Provis Infusion Clinic in downtown Toronto. Graham Vincent, the president of Provis, said his clinic is operated much like a hospital chemo day unit, with exacting standards for cleanliness and safety. Doctors, nurses and pharmacists − all of whom work most of their hours in the public health-care system − are always on site when patients are receiving chemo, Mr. Vincent added.“I don’t think of IV therapy as something that needs to be regulated,\" Mr. Vincent added. \"Where do you stop? What about home IVs? [The system] is doing thousands upon thousands of IVs in the home in a more uncontrolled environment.”Still, in Cancer Care Ontario’s May 25, 2017, briefing note for the ministry, it warned that the lack of formal oversight at the clinics could pose risks: “Patients may be receiving treatment in private infusion clinics where concordance to CCO safe-handling guidelines (and other safety-related guidelines) are not assessed; patients may be receiving treatment in private infusion clinics that are not evidence-informed and not funded by CCO; patients may be receiving medications prepared by pharmacies within private infusion clinics that are not accredited by the [Ontario College of Pharmacists]; patients may be receiving chemotherapy when a physician is not on site to provide supervision.”However, Leta Forbes, a medical oncologist with CCO and one of the co-authors of the briefing note, told The Globe in an interview that the cancer agency simply wants to ensure that private-clinic patients are receiving the same quality care they would at a hospital. “I would like to know that what’s happening in [public] cancer clinics is happening in these facilities. It quite possibly is, because we have to remember that most health-care professionals go into the business to deliver good care.”Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}