{"id": "Morning Update: Opioid overdoses have reduced life expectancy in B.C.", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Good morning,These are the top stories:Opioid overdoses have reduced life expectancy in B.C.Story continues below advertisementLife expectancy dropped by just over a month in British Columbia primarily due to the rise of illicit fentanyl, but also the availability of prescription opioids. That’s according to a new report from Canada’s chief public health officer Theresa Tam, who noted that despite the lack of national data similar trends can be expected across Canada. (More than 8,000 Canadians have died from opioid-related overdoses since the start of 2016.) In developing countries, reduced life expectancy is often due to early childhood deaths from infectious diseases. Health officials say that makes B.C.’s trajectory – which can be attributed to deaths in an adult population – stark and troubling.This is the daily Morning Update newsletter. If you’re reading this on the web, or it was forwarded to you from someone else, you can sign up for Morning Update and all Globe newsletters here.Justin Trudeau is warning that cancelling the Saudi arms deal could cost $1-billionThe terms of the deal negotiated by the previous Conservative government could result in a prohibitive charge if Canada walks away, Trudeau said. His remarks came just a day after he said he was willing to freeze exports, as the NDP pressures the Liberal government to follow Germany’s lead to punish Riyadh over its alleged role in murdering dissident journalist Jamal Khashoggi. Referring to the 14-year deal to supply the Saudis with armoured vehicles, Trudeau said: “I do not want to leave Canadians holding a billion-dollar bill because we are trying to move forward on doing the right thing, so we are navigating this very carefully and that’s pretty much all I can say.”John Tory is confident the Toronto ward results will work in his favourThe centre-right mayor is likely to benefit from the reduction of NDP-affiliated voices on Toronto’s smaller 25-seat council. For one, that should allow Tory to follow through on his pledge to keep residential property-tax rate increases at inflation. The smaller group of NDP councillors and other progressives will be forced to woo centrists in order to defeat Tory and his allies on any key issue. Tory also noted that the fact he won majorities in every ward gives him a “very solid mandate” for his second four-year term.Here’s Denise Balkissoon’s view of the Toronto election: “As expected, the shortened, chaotic campaign season and reduced size of council also reduced the chances that different types of Torontonians might access political power. Perhaps council’s first agenda item should be changing the city’s motto, because “diversity our strength” is a joke, one so funny it hurts. Council remains extremely male, extremely white and extremely middle-aged-to-old, seemingly the exact opposite of the public it’s tasked with representing – and has been doing an unimpressive job representing for decades.”Story continues below advertisementStory continues below advertisementKennedy Stewart’s plan for affordable Vancouver housing faces hurdles in every directionThe mayor-elect wants to build 2,500 below-market-rate apartments every year for 10 years, plus another 6,000 a year at market rates. But he’s already seeing pushback from the region’s developers, who say construction and land costs, plus new rent-control changes, make it hard to achieve those goals. Stewart will also need to win support in a divided council, where even his presumed allies on the left may call for tough deals with developers that require things such as providing low-cost units in order to get permission to build. The Green Party, which holds three seats, wants half of all new projects to be at below-market rates. But at the same time, Green councillor Adriane Carr says the public needs to be consulted before increasing density.Got a news tip that you’d like us to look into? E-mail us at tips@globeandmail.com Need to share documents securely? Reach out via SecureDropIN CASE YOU MISSED ITTrudeau’s carbon-rebate plan – and why he’s doing itThe Prime Minister unveiled his plan for rebates during a speech at Toronto’s Humber College – located in the riding of Ontario Premier Doug Ford, who is a vocal opponent of the federally mandated carbon tax. Trudeau says the rebates will help offset the levy which will kick in on April 1, 2019. Here’s how Ottawa projects things will work out: Ontario households will pay $244 in carbon tax-related costs, and will receive $300 in rebates; those in Saskatchewan will fork over $403 and receive $598; Manitobans will pay $232 and get back $336; New Brunswickers will dish out $202 and earn $248.Story continues below advertisementHere’s our editorial board’s take: “It’s politically smart to hand carbon revenues directly to people, rather than to intransigent provincial governments. Doing so helps counter the federal Conservative talking point that the carbon tax is a revenue grab. … [But] voters might see their election-year rebate cheques as a kind of unseemly bribe – or, even worse, they might feel more burdened by higher prices all year than they feel gratified by the annual federal cash infusion.”And John Ibbitson argues that carbon tax versus climate change will be an epic contest: “The Liberals have scientists and economists in their corner. The Conservatives and opposing premiers are appealing to a tax-weary and skeptical public. Who will prevail? This debate will occupy us, perhaps consume us, in the months to come.”MORNING MARKETSMarkets mixedWorld stocks marked a sixth straight day of losses on Wednesday as fears about global economic growth kept sentiment fragile, with Wall Street tipped for a weak open and oil prices languishing near two-month lows. Tokyo’s Nikkei gained 0.4 per cent, and the Shanghai Composite 0.3 per cent, though Hong Kong’s Hang Seng lost 0.4 per cent. In Europe, London’s FTSE 100, Germany’s DAX and the Paris CAC 40 were up by between 0.4 and 0.7 per cent by about 6:05 a.m. ET. New York futures were down. The Canadian dollar was below 76.5 US cents.WHAT EVERYONE’S TALKING ABOUTStory continues below advertisementTrump can’t stop the migrant caravan by cutting foreign aid and closing the border“Harsh policies along the border do not stop migration. Instead, they drive desperate migrants to increasingly use human smugglers. Smuggling in turn provides funds for transnational criminal organizations that also traffic cocaine. White House Chief of Staff John Kelly has blamed violence in the region on these organizations, which cater to the U.S. demand for illegal drugs. Tougher migration policies increase their revenue, which in turn decreases U.S. security. … The government can pretend that tough policies will stop desperate people, or it can acknowledge that they will continue to come – legally or illegally. Providing a path to legal entry and status allows the government to monitor the flow of people, respond to needs of local communities, and screen those entering.” – Sarah Bermeo, associate professor of public policy and political science at Duke UniversityCanadians love living in the suburbs, so why aren’t we building more of them?“Canada’s National Dream, the modern edition, began in 1953. That was the year Don Mills, the country’s first large-scale, fully planned suburb, began selling affordable, ranch-style homes north of Toronto. Immediately, middle-class Canadian families yearning for their own bit of heaven – a yard, a garage and room for the children to play – began packing their bags for the burbs. And almost as quickly, folks who claimed to know better were complaining about it. … Not much has changed in 65 years. People are still flocking to the suburbs. And the experts are still complaining about it. But after more than half a century, isn’t it time to finally admit Canadians would simply rather live in the burbs and figure out how to make that happen?” – Peter Shawn TaylorBlunt honesty may be one way for the Alberta Party to gain political traction“You don’t often find political leaders answering questions with unflinching, unfiltered honesty. Today they have been trained to say as little as possible, as mundanely as possible. But once in a while, someone comes along who defies convention. Alberta Party leader Stephen Mandel did just that this past weekend when he was asked by reporters to give his appraisal of the province’s economic future without the Trans Mountain pipeline expansion. ‘We’re screwed,’ he said. While I’m not sure the situation is quite that dire, Mandel’s no-frills bluntness will be applauded in a province that appreciates straight talk. Making those types of provocative statements is easier when you’re the leader of a three-seat political party, and not Premier. But right now, the only thing Mandel should be worried about is building his political brand and establishing a persona that is unique and inviting. Truthsayer wouldn’t be a bad one.” – Gary Mason (for subscribers)LIVING BETTERHow apps are taking a bite out of pet care industryHeading out of town with nobody to take care of your dog? Houndr is the latest in a wave of dog-care apps which help owners find people in their neighbourhood to walk or pet sit. The cost is much cheaper than traditional services, with the payment meant more as a gift of gratitude. And if you’re not a dog owner, but still want to spend time with one, there’s even an app for that: Dogtime Community lets people pay a monthly fee to spend time with local pups.MOMENT IN TIMECanada wins gold in lacrosse at the Olympics(S&G and Barratts/EMPICS Sport)S&G/S&G and Barratts/EMPICS SportOct, 24, 1908: Not to brag, but this country has been the defending Olympic gold medalists in field lacrosse for 110 years. Canada, which first won a gold in the sport at the 1904 Games in St. Louis, repeated that feat on this day in 1908 in London. At those Olympics, which had started in July before taking a couple of months off, Canada fielded a group of men who are now considered to be the first Team Canada – elite players chosen from across the country. And they did the country proud against the only other competitor, Britain. Canada led 6-2 at the half, before the plucky Britons tied it 9-9. In the fourth quarter, Canada poured it on to win 14-10. (One of the players was Tommy Gorman, who would go on to be a founder of the National Hockey League.) Sadly for Canada, where the popular sport was the national game, the victory marked the end of lacrosse as an Olympic medal event. It was a demonstration sport in 1928, 1932 and 1948. The earliest it could return to the Games (no decision has been made) would be 2028 in Los Angeles. Canada would be a favourite. – Philip KingIf you’d like to receive this newsletter by e-mail every weekday morning, go here to sign up. If you have any feedback, send us a note.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}