{"id": "Dragons’ Den star raises $70-million for startup that finances e-commerce retailers", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Partners Andrew D'Souza, left and Michele Romanow at the Clearbanc office in Toronto on Nov. 9, 2018.Christopher KatsarovMichele Romanow started to notice a pattern as she sat through pitch after pitch as a star of TV’s Dragons' Den earlier this decade. While Ms. Romanow didn’t want to invest in many of the e-commerce businesses appealing for her money, she did think she could provide them with capital in a more effective way by temporarily underwriting their online advertising in exchange for a cut of revenues.After doing about 10 such deals with her life partner, Andrew D’Souza, the two successful serial entrepreneurs had a business idea of their own to pitch.On Monday, their three-year-old Toronto company, Clear Finance Technology Corp. (operating as Clearbanc) is set to announce it has raised US$70-million to offer a new financing alternative for young e-commerce businesses. Investors include a dozen U.S. and Canadian venture capital firms such as Emergence Capital Partners, 8VC, Social Capital, iNovia Capital and Power Corp. of Canada’s Portag3 Ventures.Story continues below advertisementClearbanc fronts companies' online advertising on Google and Facebook in exchange for a small percentage of revenues – typically 5 per cent to 10 per cent – that spending generates until they are repaid, plus a 6-per-cent premium. It’s relatively cheap financing and an opportunity that didn’t exist until the huge recent shift in online advertising dollars to Silicon Valley’s giant social-media platforms made it easier to measure returns on marketing dollars. “More than anything, Andrew and I built this by entrepreneurs, for entrepreneurs,” Ms. Romanow said.Customers don’t have to provide personal guarantees, give up equity or even submit to credit checks. They just have to provide Clearbanc access to business data from their online payment processors, Facebook and Google advertising accounts and their bank accounts.Clearbanc’s software platform crunches that data and assesses their unit economics in minutes, spitting out an automated financing offer based on what the software determines is the customer’s ability to repay. There is no fixed repayment schedule, maturity date, late penalties or collateral. As the revenue comes in to its customers, a small cut flows out daily to Clearbanc until it is repaid.“A credit score is useful for personal underwriting but we should be looking at real business data to make these decisions,” Ms. Romanow said. “We’re using totally different data sources than have been traditionally used” to assess credit-worthiness of small business.“No bank would ever say, ‘we’re going to give you a loan and please go spend it on marketing.’ But we have a lot of confidence in digital channels; we deeply understand [e-commerce] customer acquisition models,” Ms. Romanow said, thanks to her and Mr. D’Souza’s experience building and backing startups.Clearbanc chief executive Mr. D’Souza added, “We’ve invested a lot of time and money in building the integrations, testing the data, back-testing the underwriting. It’s one of these businesses where if you don’t do it right you can lose a lot of money very quickly.” He predicted the company could keep default rates below 1 per cent and “an order of magnitude lower than the industry average.”Clearbanc has already done 500 such financings, underwriting between $5,000 to $10-million a deal. The company has financed $100-million to date – translating to millions of dollars in revenues for Clearbanc this year. While Clearbanc has funded much of its business from venture capital financing, it is now working to tap a range of capital sources to fund its underwriting activities including large banks and credit funds.Story continues below advertisementStory continues below advertisement“The first time we looked at the metrics we didn’t really believe it,” said iNovia Capital’s Toronto-based general partner Karamdeep Nijjar. “The nuance here is the capital turns very quickly. It’s 6 per cent, but it goes out the door twice per year” – meaning Clearbanc can effectively earn 12 per cent, well more than its cost of capital.“If it helps their customers grow faster, they get paid faster and that generates a higher return.” Mr. Nijjar added that rather than aggressively grow revenues as some online lenders have done, “instead they’re building a real, scalable business.”With e-commerce still representing a minority of retail spending and much advertising flowing through Facebook and Google, Clearbanc’s founders estimate their total market could amount to tens of billions of dollars in financing annually.“The early numbers look quite good and the market is pretty large,” 8VC general partner Alex Kolicich said.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}