{"id": "Ontario to freeze minimum wage, eliminate mandatory paid sick days", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Ontario’s Progressive Conservative government says it plans to repeal chunks of the previous government’s Fair Workplaces, Better Jobs Act amid pushback from business owners who argued many of the changes were too costly, forcing them to raise prices and cut staff.Premier Doug Ford was elected last spring on an “open for business” platform that included a promise to freeze the minimum wage at $14 an hour instead of hiking it as planned to $15. On Tuesday, his government confirmed the freeze and followed up with a recently promised plan to scrap or amend other changes in the legislation, known as Bill 148.The government said it will maintain the current minimum wage at $14 an hour until 2020. Labour Minister Laurie Scott said it would be “immensely unfair” to workers to roll back wage increases that they’ve have already received. The government also said it will implement annual increases to the minimum wage, tied to inflation, starting in 2020.Story continues below advertisementThe government also said in a release that it will replace the previous government’s personal emergency-leave rules. Workers will be able to take up to three days for personal illness, two for bereavement and three for family responsibilities. The days will be unpaid.The current act allows employees to take up to 10 personal emergency-leave days a year, two of them paid.The government will also cut the section that forces employers to pay part-time and casual staff at the same rate as full-time workers doing the same work, but said it will maintain the requirement for equal pay on the basis of sex.“Over all, our reforms will simplify, harmonize and reduce the regulatory burden for anyone willing to create jobs in Ontario,” Ms. Scott said at a news conference.Many businesses cheered the changes on Tuesday, while labour groups argued that the government is removing workers' rights.The government’s new Making Ontario Open for Business Act was introduced in the legislature Tuesday afternoon and passed first reading.Ms. Scott said the government is also looking at at plan that would eliminate personal income taxes for minimum-wage workers. She said provincial Finance Minister Vic Fedeli is “actively working on that right now.”Story continues below advertisementStory continues below advertisementThe labour-related announcements were made at the Scarborough offices of Leland Industries Inc., which makes bolts, nuts and screws for the construction industry, and included Economic Development Minister Jim Wilson and Training, Colleges and Universities Minister Merrilee Fullerton.Business owners have complained about the higher labour costs, including the spike in the minimum wage to $14 from $11.60 as of last Jan. 1. They have also been concerned over additional staffing needed to cover for employees in other scenarios, such as the emergency-leave days and increases to vacation entitlements to three weeks for workers at a company for at least five years.The PC government maintained the three-week vacation entitlement after five years as well as current provisions for domestic- and sexual-violence leave, which it stated “is a valuable protection for employees.”Shalini Sheth, director of operations at food manufacturer Surati Sweet Mart in Scarborough, Ont., says Bill 148 was introduced and implemented too quickly to enable businesses such as hers, which employs 150 full-time workers, to assess the impact and make changes.The emergency-leave days were particularly harmful to her business, since if more than two people on their six-person fry line were to take an emergency day at the same time, the operation would have to shut down.Peter Gossmann, co-owner and vice-president at Richmond Hill-based Plasticap, which manufactures caps for bottles and jars, is also relieved about the changes. In particular, he is happy that the government stopped changes to scheduling rules, which were set to come into effect in January.Story continues below advertisementThe scheduling changes in Bill 148 were to give workers the right to refuse shifts scheduled less than 96 hours beforehand. As well, it would have required workers to be paid for a minimum of three hours at their regular rate if a shift was cancelled within 48 hours of its start time. In addition, the bill said that if an employee is on-call, but is not called in, the employer will have to pay them for at least three hours at their regular rate, with some exceptions.The personal-leave days were also an issue for Mr. Gossmann, as they had left him scrambling to cover shifts.He says that all of his 40 employees took their two paid leave days in the first three months of the year, many after Super Bowl Sunday, which cost the company about $30,000 in extra wages.“We are happy with the direction the government is taking to bring back business and increase employment,” he says. “This is a real step in the right direction … I’m optimistic.”Labour groups and some business owners have defended Bill 148, saying it protects and expands workers' rights and pays them more to help keep up with the rising costs of living, especially in larger urban centres.Gilleen Pearce, a spokesperson for the Better Way Alliance, a group of business owners that supports Bill 148, says she’s disappointed at the changes announced by the government that take away rights for workers.Story continues below advertisement“It’s all very short-sighted,” Ms. Pearce said. “It makes me think how disconnected business lobby groups are and the government is from the employees who help make businesses successful.”Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}