{"id": "Trudeau intends to work toward free-trade deal with China, despite clause in USMCA", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Prime Minister Justin Trudeau speaks with journalists after the 33rd ASEAN Summit in Singapore on Nov. 15, 2018.Bernat Armangue/The Associated PressCanada and China will continue to work together towards an “eventual” free-trade deal, Canadian Prime Minister Justin Trudeau said on Thursday.This is despite the country being a signatory to the United States-Mexico-Canada Agreement (USMCA), which specifies that if one of its partners enters a free trade deal with a “non-market” country such as China, the others can quit in six months and form their own bilateral trade pact.“This clause doesn’t prevent us from doing what we’re already doing which is indeed continuing to negotiate with China on an eventual free trade deal,” Mr. Trudeau said in a town hall with students at the National University of Singapore.Story continues below advertisementThe clause, which has stirred controversy in Canada, fits in with U.S. President Donald Trump’s efforts to isolate China economically and prevent Chinese companies from using Canada or Mexico as a “back door” to ship products tariff-free to the United States.“There is an element of transparency. We have to keep our partners informed on how we’re doing,” Mr. Trudeau added.The United States and China are locked in a trade war that has seen them level increasingly severe rounds of tariffs on each other’s imports.Under the clause, the countries in the USMCA must notify the others three months before entering into negotiations that could lead to a trade deal with an outside country.Mr. Trudeau said that he and Chinese Premier Li Keqiang spoke about more than just trade deals during their bilateral meeting in Singapore on Wednesday.“Yes, we talked about deepening trade ties, increasing flows of goods and services between Canada and China for the benefit of citizens and businesses on both sides,” Mr. Trudeau said.“But I also talked about human rights, the situation of the Uyghurs, we also talked about things that are difficult to talk about,” he added, without giving details.Story continues below advertisementStory continues below advertisementBeijing has faced an outcry from activists, academics, foreign governments and UN rights experts over mass detentions and strict surveillance of the mostly Muslim Uyghur minority and other Muslim groups in its western region of Xinjiang.Mr. Trudeau’s comments come just moments after Reuters reported that Canada is spearheading a group of 15 Western ambassadors in Beijing to seek a meeting with the top official in Xinjiang for an explanation of alleged rights abuses against ethnic Uyghurs.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}