{"id": "Coalition of U.S. lawmakers urge Trump not to sign USMCA until LGBTQ language excised", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Canada’s fraught new trade pact with the United States and Mexico is facing a new challenge: a group of conservative U.S. lawmakers who say its language on sexual orientation and gender identity is inappropriate and an affront to national sovereignty.In a letter to the White House flagged Friday by the U.S. website Politico, a coalition of 40 members of Congress is urging President Donald Trump not to sign the U.S.-Mexico-Canada Agreement unless the language is excised.“As a sovereign nation, the United States has the right to decide when, whether and how to tackle issues of civil rights, protected classes and workplace rights,” reads the letter, released Friday.Story continues below advertisement“A trade agreement is no place for the adoption of social policy. It is especially inappropriate and insulting to our sovereignty to needlessly submit to social policies which the United States Congress has so far explicitly refused to accept.”Signatories to the letter include Iowa Republican Steve King, who made headlines in Canada last month when he tweeted his support for the controversial Toronto mayoral campaign of alt-right anti-immigration champion Faith Goldy.The language in the agreement is relatively mild, pledging all three countries to support “policies that protect workers against employment discrimination on the basis of sex, including with regard to pregnancy, sexual harassment, sexual orientation, gender identity,” as well as caregiving responsibilities and child-rearing.Another offending clause calls for “co-operative activities” in the promotion of equality and ending job discrimination “in the areas of age, disability, race, ethnicity, religion, sexual orientation, gender identity, and other characteristics not related to merit or the requirements of employment.”But the critics fear that in its current form, the agreement would make it impossible for Trump to roll back changes to non-discrimination policies that added sexual orientation and gender-identity language to existing federal laws when Barack Obama was president.A New York Times report last month cited an internal Department of Health and Human Services memo that proposes defining gender as an immutable biological condition determined by a person’s sex organs at birth, triggering fear among gender-rights advocates that the Trump administration was planning to erode LGBTQ rights by making transgender Americans legally nonexistent.Friday’s letter cited that policy direction – as well as an October 2017 Justice Department memo that essentially declared that U.S. civil-rights law doesn’t ban sex-based workplace discrimination – as it warned that signing and ratifying USMCA would contradict the government’s goals.Story continues below advertisementStory continues below advertisement“At the same time your administration is carrying out a cohesive agenda regarding policies surrounding sexual orientation and gender identity, in the Departments of Justice and Health and Human Services specifically, it is deeply troubling that the office of the U.S. Trade Representative has included contradictory language in the (USMCA),” the letters tells Trump.The trade agreement, forged after 13 months of negotiations that laid bare tension in the Canada-U.S. relationship, is scheduled for what Canadian officials say will be a low-key, low-level signing when the three countries gather Nov. 30 for annual G20 meetings, taking place this year in Buenos Aires.The tensions have not eased, thanks largely to the fact that Canada and Mexico both remain subject to Trump’s punitive tariffs on steel and aluminum exports. Officials in the Canadian Embassy in Washington have been trying to get those tariffs lifted.And a Reuters report Thursday said Canada has been pushing back against what it described as U.S. attempts to amend the text of the deal, something officials in Ottawa characterize as a routine vetting exercise.One Canadian source familiar with the ongoing effort said Friday that officials in Ottawa don’t expect any substantive changes to the text before the signing.Trade watchers are also waiting nervously as the newly Democratic House of Representatives prepares to wield its power in opposition to the Trump legislative agenda. A number of prominent Democrats have signalled they won’t vote to ratify the USMCA without more robust enforcement measures for the agreement’s labour and environmental provisions.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}