{"id": "Why jobs and stocks won’t help Trump’s Republicans in the midterms", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.No matter the controversies swirling around his administration, U.S. President Donald Trump repeatedly points to two things as proof of his presidential success: stocks and jobs.Ten years after the Great Recession, the U.S. economy continues to churn out thousands of jobs by the month, and despite a recent pullback, stocks are broadly higher since Mr. Trump was elected two years ago – facts which the President is never shy to trumpet on social media.“Best Jobs Numbers in the history of our great Country! Many other things likewise. So why wouldn’t we win the Midterms? Dems can never do even nearly as well! Think of what will happen to your now beautiful 401-k’s!” Mr. Trump tweeted on Oct. 21.Story continues below advertisementBut the electoral math is a tad more complicated. Neither jobs nor stocks will help the Republican Party in the midterms, if history is any guide – and a more reliable equation suggests Mr. Trump’s side will lose its majority in the House of Representatives.Numbers aside, the U.S. midterm elections are a tough slog for any incumbent party. Since 1950, the president’s party has gained seats in the House only twice, and on three occasions for midterm Senate races. A strong jobs market doesn’t lessen the blow, either.On both occasions when incumbent parties gained House seats, the U.S. unemployment rate was south of 6 per cent. But consider the midterms of 1966 and 1994. In the latter, Bill Clinton’s Democrats lost 53 seats, despite the jobless rate being at 5.6 per cent. In 1966, Lyndon Johnson’s Democratic Party lost 47 seats, even with the unemployment rate at a scant 3.6 per cent. (The jobless rate is currently near a 50-year low of 3.7 per cent.)The situation is no better with stocks. We looked at the relationship between House results and the S&P 500’s one-year change up to election day. The message is clear: Even if stocks are bolstering Americans’ 401(k) retirement accounts, voters don’t seem to care.There are, however, some metrics with stronger predictive power. For one, there are presidential approval ratings. “That’s not great news for the GOP,” investment bank UBS Group AG said in a September report, when Mr. Trump’s approval rating was 41 per cent, according to Gallup figures. (It has since dropped to 40 per cent.) “Based on this figure alone, it would appear that Republicans face a challenging landscape in November.”Still, there are some historical outliers. Four years ago, Barack Obama’s approval rating was a paltry 42 per cent before election day, though his Democratic Party lost only 13 seats. Circa 1958, Dwight Eisenhower had a robust approval rating of 57 per cent, and his Republican Party lost 48 seats in the House, with many crediting a brief but nasty recession for the result.A stronger gauge is to combine approval ratings with two other metrics: real disposable income per capita – essentially, the change in each person’s spending money – and the deficit or surplus of House seats currently held by the president’s party compared to its eight-election moving average. Admittedly, this is getting into wonky territory. But combined, those variables explain about 65 per cent of the change in House seats since 1946, according to research from Gary Jacobson, a political scientist at the University of California at San Diego.Story continues below advertisementStory continues below advertisementThat’s likely bad news for Mr. Trump. In the second quarter, disposable income grew 2.1 per cent from a year earlier. Combined with Mr. Trump’s approval rating, the Republicans are slated to lose about 33 seats under Mr. Jacobson’s model, enough to lose the House. (The Democrats must flip 23 seats, assuming they hold on to vacated party seats, to form a majority.) That said, the model has a hefty margin of error (13 seats), so the Republicans retain a sliver of hope.Current House breakdownCurrent House breakdownDemocraticDemocraticDemocraticDemocraticRepublicanRepublicanRepublicanRepublicanVacantVacantVacantVacantMATT LUNDY, THE GLOBE AND MAIL, SOURCE: HOUSE.GOVMATT LUNDY, THE GLOBE AND MAIL, SOURCE: HOUSE.GOVCurrent House of Representatives breakdownCurrent House of Representatives breakdownDemocraticDemocraticDemocraticDemocraticRepublicanRepublicanRepublicanRepublicanVacantVacantVacantVacantMATT LUNDY, THE GLOBE AND MAIL, SOURCE: HOUSE.GOVMATT LUNDY, THE GLOBE AND MAIL, SOURCE: HOUSE.GOVCurrent House of Representatives breakdownCurrent House of Representatives breakdownDemocraticDemocraticRepublicanRepublicanVacantVacantMATT LUNDY, THE GLOBE AND MAIL, SOURCE: HOUSE.GOVMATT LUNDY, THE GLOBE AND MAIL, SOURCE: HOUSE.GOVOne “peculiarity,” Mr. Jacobson noted in a recent paper, is the disparity between a strong U.S. economy and Mr. Trump’s approval ratings.“Ordinarily, we would expect a president enjoying very good economic numbers (solid economic growth, very low unemployment, low inflation, a strong stock market, and the rosiest public views of the economy in more than a decade) to have much higher overall approval ratings than Trump has enjoyed so far,” he wrote. “His low approval ratings are thus eloquent testimony to how off-putting the rest of his performance has been to people outside his base.”As such, the Republicans need their economic story – one that goes beyond jobs – to overshadow a divisive president.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}