{"id": "Air Canada, WestJet latest companies to cut ties to SeaWorld ahead of whale bill", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Air Canada and WestJet Airlines Ltd. are joining a growing wave of companies that have cut ties to SeaWorld, in sync with the spirit of a bill to ban whale and dolphin captivity and in the wake of concerns raised by animal rights advocates.The Senate passed legislation last Tuesday that would make keeping and breeding cetaceans such as dolphins and whales a criminal offence.Air Canada says its vacation wing stopped offering SeaWorld tickets for purchase on its website last week, calling the move a “commercial decision.”Story continues below advertisementWestJet dropped the tickets — previously available as part of vacation packages — last August.“This was a decision our leadership team made entirely on its own and believes the decision is entirely in keeping with our caring culture,” spokeswoman Lauren Stewart said in an email.SeaWorld, which has three marine theme parks in Florida, Texas and California under the umbrella of SeaWorld Entertainment Inc., confirmed Monday that “the business relationship has ended” with both airlines.Carriers and other companies such as JetBlue Airways Corp., Southwest Airlines Co. and Taco Bell have all jettisoned links with SeaWorld, many amid the fallout from the 2013 documentary “Blackfish” that focused on orca captivity.People for the Ethical Treatment of Animals (PETA) organized a recent email campaign urging Air Canada to sever promotional ties.“Both lawmakers and corporations recognize that confining sea animals to tiny concrete cells and depriving them of the life that they were meant to have is abusive,” PETA executive vice-president Tracy Reiman said in a release.Bill S-203, introduced by now retired independent Liberal senator Wilfred Moore with Green party support in December 2015, is poised to wind through the House of Commons over the next seven months.Story continues below advertisementStory continues below advertisementCanadian marine parks that violate the proposed Criminal Code amendments could be fined up to $200,000.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}