{"id": "Ottawa earmarks $1.5-billion to help smaller businesses adapt to carbon pricing", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.The federal government expects to spend nearly $1.5 billion helping small and medium-sized businesses adapt to carbon pricing over the next five years — but it will not exempt them from the new carbon tax regime.Environment Minister Catherine McKenna says the government is no longer allowing anyone in Canada to pollute for free but that there will be supports to help small businesses adapt by making their operations more energy efficient. Pollution is already costing us money, said McKenna, as costs from climate-change related weather events has soared to more than $1 billion a year in Canada.“Whether one is a trucker, a farmer or a small business owner, an environmentalist or a child, we are all paying the cost of climate change right now,” she said Friday.Story continues below advertisementMinister of Environment and Climate Change Catherine McKenna rises during Question Period in the House of Commons on Parliament Hill in Ottawa on Oct. 26, 2018.Justin Tang/The Canadian PressBut Conservative MPs produced a list of companies on Friday that say will be harmed by a carbon levy in what is becoming repeat of last year’s fight over the effect of proposed tax changes on small businesses.Conservative finance critic Pierre Poilievre said wealthy corporations are getting a “sweetheart deal” compared to small business owners when it comes to the carbon tax.One of the companies on the list was Bert Baxter Transport Ltd., in Estevan, Sask.Darryl Shirley, the company’s owner, said the funding isn’t going to help his business. The company, which has about 60 trucks on the road at the moment, and employs about 80 people, uses more than four million litres of diesel a year.At $20 a tonne, the price of diesel goes up about 5.5 cents a litre, adding more than $221,000 to Shirley’s fuel costs. In 2022 when it rises to $50 a tonne, or 13.7 cents on a litre of diesel, the bill will rise to $554,171.Shirley said small trucking companies will go under because it is difficult to stay competitive if they have to raise their rates. He said he already raised his rates two per cent to counter the Alberta carbon price, and will have to hike it even more once Saskatchewan’s is imposed.While the government hopes the carbon levy is an incentive for companies to pay for innovations that lower their energy costs, Shirley said electric trucks are not an immediate option because the charging infrastructure is not there.Story continues below advertisementStory continues below advertisementHis company already paid to add systems to their trucks that help burn diesel more cleanly but he said it actually takes more diesel to run those systems.Small and medium-sized businesses will pay the carbon price on their energy input costs — $20 a tonne in 2019, rising by $10 a year until it hits $50 a tonne in 2022. Big industrial emitters are exempt from paying it on the energy they consume. Instead the government has set an emissions cap, based on 80 to 90 per cent of the average emissions in a specific industrial sector. Big companies will pay the tax only on their emissions above that cap.The federal Liberals are in the final stages of implementing their 2015 campaign promise to introduce a national carbon price. On Tuesday the government said six provinces and all three territories either have their own carbon price systems that meet federal standards or opted to use some or all of the federal option.Four provinces — Saskatchewan, Manitoba, Ontario and New Brunswick — that didn’t meet federal requirements will have Ottawa’s system imposed on them. About $2.3 billion will be raised from the levy in 2019-20, 90 per cent of which is being rebated to households via income tax returns.The other 10 per cent will be funnelled into a program to help smaller businesses and other organizations which can’t pass the levy on via higher prices. Details of how that will be done are not yet finished but some sort of energy efficiency program seems to be in consideration.In 2019-20, the government expects $73 million will be earmarked for universities, hospitals, schools, municipalities, non-profits and Indigenous communities. Over the next five years $727 million is expected to go to those organizations.Story continues below advertisementFor small and medium-sized businesses there will be $155 million in 2019-20 and $1.46 billion over the next five years.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}