{"id": "Review: Acura ILX’s ‘design evolution’ an aggressive push to fire up sales", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.The Acura ILX’s revised low-and-wide stance, featuring newly sculptured fascias in the front and back, sets the tone for a whole new aggressive look.The sedan’s design is further enhanced by the recessed, seven-element LED headlights, diamond pentagon grille, LED tail lamps, lower diffuser with a chrome exhaust finisher, and larger wheels pushed to the corners.Combine that with the unchanged starting price of $29,990 which includes a suite of safety technology, a power moonroof, and heated seats, and Acura feels they’ve done enough for now to turn around sales.Story continues below advertisement'We’ve given up on taking ourselves so seriously, and we want to get back to being fun,' says Emile Korkor, senior manager and brand leader, Acura Canada.As of September, 2018, Canadian sales of the entry-level ILX had dropped 6.9 per cent compared to 2017, as sedans industry-wide flounder against the tide of SUV sales. The mid-size TLX, had taken a 14.6 per cent dip.The new look, dubbed Precision Crafted Performance design language, is meant to further distinguish Acura from the line of vehicles by its parent, Honda.“The ILX is the final piece of today’s design evolution,” adds Emile Korkor, senior manager and brand leader, Acura Canada. “We’ve given up on taking ourselves so seriously, and we want to get back to being fun.”For now, the fun is being placed on design rather than performance, as the naturally aspirated 2.4-litre inline-four rated at 201 horsepower and 180 lb-ft of torque goes unchanged. That’s not to say it isn’t highly capable – especially in the top-tier, A-Spec trim sitting on new 18-inch shark grey alloy wheels.During a drive through the back streets of Columbus, the ILX showcased plenty of gusto and cornering abilities in a nonchalant manner. Every now and then, a little growl comes through as a reminder that this front-wheel sedan can be pushed further. A lot of that can be attributed to its instantaneous eight-speed dual-clutch transmission, a key component that powers those front wheels with a sport mode that can be worked through paddle shifters.The aim is to target young adults looking for a taste of luxury at an attainable price. That’s why the initial focus is on design, with more colour combinations inside and out. There’s a stunning red interior, as well as two A-Spec trim levels: the first at $33,990 with LEDs, larger wheels, aluminum sport pedals and leather seating; the second, Tech A-Spec at $35,390, features navigation, premium speakers and additional safety tech.Inside, new supportive leather seating aids that smooth ride, while its dual-screen infotainment unit is more responsive, has updated graphics, and is fully integrated at the Premium trim level with Apple CarPlay and Android Auto.Story continues below advertisementStory continues below advertisementEven at value pricing, the Mercedes-Benz A-Class and Audi A3 won’t be too far off that mark, and that’s why Acura is going about it the right way by addressing its image, a factor neglected in the past.\"We’re constantly looking at it and this new infusion of Acura’s exclusive design style will further differentiate the brand from Honda and make it relevant in the current marketplace,” Hayato Mori, AVP, product and business development, Acura Canada.The ILX is available starting Nov. 9.2019 Acura ILXThe 2019 Acura ILX front grille.David MillerThe “precision crafted performance” design enhancements give the ILX a more aggressive appeal that deviates from mainstream Honda. In total, 13 adjustments have been made to its front and back with its most significant being the diamond pentagon grille and sleek seven-element ‘jewel eye’ LED headlights.A stunning red interior in the 2019 Acura ILX.Seating is comfortable with added support and stitching for added flair in the front, while back seat passengers can enjoy plenty of legroom and enough headroom to not complain. The A-Spec trims offer a more exciting environment with special badging on the steering wheel, aluminum pedals, and a choice of ebony or red leather seating.Story continues below advertisementNo changes were made to the ILX’s engine or chassis. Improvement is mainly due to a responsive eight-speed dual-clutch transmission.Acura separates itself from other luxury makers with a standard suite of safety technology called AcuraWatch – collision mitigation braking, forward collision warning, lane keeping assist, adaptive cruise control, and road departure mitigation with lane departure warning. The dual-screen user interface is more responsive, but 3-D graphics and a more animated, colourful display lags behind some competitors.The new ILX has 351 litres of cargo space.The ILX comes with 351 litres of cargo space, relatively standard in the segment.The 2019 Acura ILX goes through a significant styling refresh, which is a step in the right direction for the entry-level sedan.The writer was a guest of the automaker. Content was not subject to approval.Shopping for a new car? Check out the new Globe Drive Build and Price Tool to see the latest discounts, rebates and rates on new cars, trucks and SUVs. Click here to get your price.Story continues below advertisementSign up for the weekly Drive newsletter, delivered to your inbox for free. Follow us on Instagram, @globedrive.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}