{"id": "Four nutrients you probably need more of", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Chances are, you need to boost your intake of at least one or two nutrients. Even the most disciplined eaters can be, unknowingly, skipping out on key essentials, which can eventually drain energy and lead to health problems.According to Health Canada’s Canadian Community Health Survey (CCHS), conducted in 2004, many people’s diets don’t provide enough vitamins and minerals. (Results from the 2015 CCHS have yet to be released.)Haphazard eating and an increased reliance on heavily processed foods can undermine your diet.Story continues below advertisementCertain eating plans can also shortchange your body of nutrients.A low-carbohydrate diet (e.g., ketogenic, Atkins-style) can deprive you of gut-friendly fibre, vitamin C and folate, a B-vitamin that repairs DNA in cells. Gluten-free diets can lack fibre and folate, too.Even if you do eat the recommended amounts of vitamins and minerals, you might need more. Aging and certain medications can interfere with nutrient absorption.Sure, you can take a supplement to bridge nutrient gaps. And, in some cases, I recommend that you do.Adding whole foods to your diet, though, should be your first line of defence. Along with vitamins and minerals, whole foods deliver fibre, antioxidants and anti-inflammatory phytochemicals.It’s necessary for normal vision and immune function. Yet, according to Health Canada, more than one-third of Canadians don’t consume enough.There are two types of vitamin A in foods: retinol, ready for the body to use, and carotenoids, which are converted to vitamin A in the body. Foods high in retinol include beef, pork, lamb, chicken, turkey, tuna, milk and cheese.Story continues below advertisementStory continues below advertisementIt’s carotenoids, though, that many people need more of. In addition to providing vitamin A, research suggests that a higher intake can help guard against heart attack, stroke and certain cancers.Outstanding sources include sweet potato, carrots, pumpkin, spinach, collards, kale, dandelion greens and cantaloupe. You’ll absorb more carotenoids if you eat your meal with a little fat.As many as 35 per cent of Canadian adults don’t consume the daily recommended 2.4 mcg of B12, a nutrient needed to make red blood cells, repair DNA and keep our nerves working properly.B12 is found primarily in animal foods – meat, poultry, fish, eggs and dairy products. Some foods are fortified with B12, including plant-based “milks” (1 mcg per cup) and soy products. Fortified nutritional yeast, sold in natural-food stores, is also high in B12.If you’re over 50, you might be getting less B12 than you realize. The absorption of B12 from foods relies on an adequate release of stomach acid. As many as 30 per cent of older adults have atrophic gastritis, a condition that reduces the stomach’s ability to release acid.Proton pump inhibitors (PPIs), drugs used to treat ulcers and gastroesophageal reflux disease, interfere with B12 absorption by reducing stomach acid. Metformin, a medication that controls blood sugar, also reduces B12 absorption.Story continues below advertisementOlder adults, vegans and people taking PPIs and metformin long-term should take multivitamin or B-complex supplements to ensure they’re meeting daily B12 requirements.More than one-third of our diets fall short of vitamin C, used to make collagen, help the immune system work properly and enhance iron absorption from plant foods. Vitamin C is also a powerful antioxidant, protecting cells from free radical damage.The recommended daily intake is 75 mg (women) and 90 mg (men). (Smokers need an extra 35 mg.)Include at least two vitamin C-rich foods in your daily diet such as red and green bell peppers (152 mg and 95 mg per ½ medium, respectively), oranges (70 mg per 1 medium), kiwifruit (64 mg each), strawberries (98 mg per cup), cantaloupe, broccoli, cauliflower and tomato juice.To prevent chronic disease, some experts recommend a daily intake of 200 mg, an amount you can get by eating at least 5 daily servings (2.5 cups) of fruits and vegetables.As many as 4 out of 10 Canadians consume too little magnesium, a mineral that helps regulate blood pressure, blood sugar and muscle and nerve function. That’s likely because some of the very best sources – pulses, leafy greens, bran cereal – are not everyday foods for many people.Story continues below advertisementEating a diet high in magnesium is also tied to a lower risk of type 2 diabetes, stroke and colon cancer.Adults need 310-320 mg (women) and 400-420 mg (men) each day. Excellent sources include oat bran, brown rice, quinoa, spinach, Swiss chard, hemp seeds, pumpkin seeds, almonds, cashews, black beans, lentils, tofu and edamame.People who are likely to take a proton pump inhibitor long-term should take a daily magnesium supplement (200 to 250 mg) in addition to eating magnesium-rich foods.Leslie Beck, a Toronto-based private practice dietitian, is Director of Food and Nutrition at Medcan.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}