{"id": "Denying solutions is the new climate change denial", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Imagine you’re buying a car.The first dealership you check out has a number of them. You can test drive these cars, you know other people who have them and you can read reviews online.The second dealership you go to has no cars. Instead, the salesperson spends his time criticizing the first dealership. He asks you to go on a wait list for one of his vehicles but offers no details – it might be a car, it might be a truck, and who knows what it’ll cost you.Story continues below advertisementMost Canadians would agree that this is not a real choice, because choice, put simply, requires reasonable options.And yet, here we are when it comes to debating how we’ll solve the most serious challenge of our time: fighting climate change. Climate solutions are frequently attacked by politicians and media pundits who acknowledge the problem, but offer no alternative. Canada has not only entered a new era of climate policy – we’ve entered a new era of denial.While once rampant, denying human-caused climate change is now considered out-of-touch and has been abandoned by most Canadian political leaders. As a recent poll from Abacus Data found, 90 per cent of Canadians are concerned about climate change. But a new form of denial has risen from the ashes of the old: denying the solutions that empower us to minimize climate change.This solutions denial underpins a variety of arguments. As we have heard ad nauseum this week, opponents say that putting a price on carbon pollution and then rebating the money back to Canadians (as was announced by the federal government) can’t possibly lead to less pollution.Any economist can tell you the federal government’s approach does work and in fact, the Nobel prize in economics was just awarded for research demonstrating this point. Here’s an example: Let’s say I go to my local pub only to find they’ve raised the price of an Alexander Keith’s by a dollar. That’s an incentive to order a Canadian instead. Let’s say the pub is also offering customers a dollar off their bill. The incentive still exists to order a Canadian and keep the extra dollar, but I’m no worse off if I decide to order a Keith’s. That’s how price signals work.Another common form of solutions denial is the notion Canada is too small, so what we do doesn’t matter. Yes, we have a big neighbour, but let’s not lose perspective on who we are: a medium-sized country with one of the largest economies in the world. We’re also one of the top 10 most-polluting countries in the world. Canada is responsible for 1.6 per cent of global emissions despite having just 0.5 per cent of its population. If Canada is “too small to matter,” what message does that send to the roughly 180 nations with smaller carbon footprints than ours?We also hear that China is the real problem, not us. In reality, China – which emits far less pollution per person than Canada – has emerged as a global leader in renewable energy and electric cars, outpacing the rest of the world in investment and deployment. According to Simon Fraser University economist Mark Jaccard, electricity and transportation policies in China now equate to a carbon price of $50. And in addition to those policies, earlier this year China put a price on pollution by launching the world’s largest cap-and-trade system.Story continues below advertisementStory continues below advertisementEnough is enough. We didn’t have time for climate denial, and we have even less time for solutions denial.As our climate breaks down and extreme weather intensifies, Canadians are beginning to be directly impacted – from floods to droughts to forest fires – and scientists have made it clear that things stand to get a whole lot worse unless we do something about it.A few weeks ago, the Intergovernmental Panel on Climate Change released its latest scientific assessment – authored by 133 scientists and drawing on more than 6,000 peer-reviewed papers – and its conclusion was stark. The consequences of warming 1.5 or 2 degrees would be far worse than those of the 1 degree of warming we’re already experiencing. And we may have as little as 12 years to limit warming to 1.5 degrees.Mark that date: 2030. The clock is ticking.To suggest we don’t have readily available solutions to cut pollution – market-correcting policies, renewable energy, cleaner fuels, more efficient homes and cars – is to deny technology and our capacity to innovate.It also ignores evidence from California, Britain, B.C., Quebec and many other places that have demonstrated how government policies can both cut pollution and support a strong and growing economy.Story continues below advertisementDenial is not a real option – not then and certainly not now.Merran Smith is the executive director and Dan Woynillowicz is the policy director of Clean Energy Canada, a think tank at Simon Fraser University.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}