{"id": "Security detail kills Kandahar officials in attack on top U.S. general in Afghanistan", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.The three top officials in Afghanistan’s Kandahar Province were killed when their own guards opened fire on them at a security conference Thursday, the deputy provincial governor said, and a Taliban spokesman said the target was Washington’s top general in Afghanistan, Scott Miller, who escaped without injury, according to NATO.Agha Lala Dastageri, Kandahar’s deputy provincial governor, said powerful provincial police chief Abdul Raziq was among the dead, along with Kandahar governor Zalmay Wesa, who died of his wounds at a nearby hospital.Mr. Dastageri said provincial intelligence chief Abdul Mohmin also died inside the governor’s sprawling residence where the attack occurred.Story continues below advertisementThree Americans – a service member and two civilians workers – were wounded in the shooting, said U.S. Colonel Knut Peters, a spokesman for the North Atlantic Treaty Organization’s troops in Afghanistan. Their conditions were not immediately known.“Gen. Miller is unhurt,” Col. Peters said. Gen. Miller is the commander of U.S. and NATO troops in Afghanistan.It was members of Mr. Wesa’s elite guard unit who turned their guns on their colleagues during a high-level security meeting ahead of Saturday’s parliamentary elections.Khalid Pashtoon, a member of parliament from the province, said Afghan Security Forces cordoned off the area and a U.S. military helicopter circled overhead as a gun battle that began at 3 p.m. local time raged on for more than one hour.Col. Peters said initial reports indicate one of the original attackers is dead. He had no further information.In a telephone interview, the spokesman for the Taliban in Afghanistan’s southern region, Yousuf Ahmadi, said the Taliban carried out the attack. He said Gen. Miller was the target and said Mr. Raziq, the governor and the intelligence chief were killed.Mr. Pashtoon said an Afghan military corps commander was also among the dead, although he didn’t name him.Story continues below advertisementStory continues below advertisementAn Interior Ministry official, speaking on condition of anonymity because he was not authorized to speak to the media, said Mr. Raziq rarely visited the governor’s residence and was meticulous about his own security.Mr. Raziq was a particularly powerful figure in southern Kandahar and a close U.S. ally despite widespread allegations of corruption. He ruled in Kandahar, the former Taliban heartland, with an iron fist and had survived several attempts to kill him, including one last year that resulted in the death of five diplomats from the United Arab Emirates.Security has been steadily deteriorating in Afghanistan, with increasingly brazen attacks being carried out by insurgents, and Afghanistan’s security forces have been on high alert ahead of Saturday’s elections.The Taliban have threatened the polls and warned teachers and students not to participate in the vote and not to allow schools to be used as polling centres. The insurgents said in a statement Wednesday that they will target Saturday’s elections, which they view as illegitimate, but that they do not want to harm civilians.Meanwhile, a NATO convoy was attacked late Wednesday near the Afghan capital, killing two civilians and injuring five Czech troops, Afghan officials and the Czech military said Thursday.The attack, which took place in the district of Bagram in Parwan Province, also wounded three Afghan civilians, said Wahida Shakar, spokeswoman for the provincial governor.Story continues below advertisementBagram is about 40 kilometres from Kabul and is also the home of a sprawling U.S. military base.The Taliban claimed responsibility for the attack.Of the five Czech soldiers, one was seriously injured when their vehicle overturned following the explosion. The soldier underwent surgery and the Czech military said he was not in life-threatening condition.Earlier, NATO spokeswoman Debra Richardson had said three alliance service members were hurt in the bombing but didn’t provide more details.Taliban spokesman Zabihullah Mujahid said an insurgent suicide bomber rammed his car into the NATO convoy.The attack on the NATO convoy came at the end of a particularly violent day across Afghanistan as tensions are rising ahead of the country’s parliamentary elections on Saturday.Story continues below advertisementA Taliban bombing in southern Helmand Province killed a candidate running in the elections. The Taliban also attacked checkpoints in the northern Baghlan Province, killing six policemen and wounding two others in a four-hour battle. Also, in eastern Maidan Wardak Province, a suicide car bomber targeted a military vehicle, killing two Afghan army troops.In recent months, Afghan troops have come under near-daily attacks. NATO troops, which handed over security to Afghan forces at the end of 2014, mostly train and assist with air power. So far this year, eight U.S. soldiers and three other NATO service members have died in Afghanistan.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}