{"id": "Ontario to allow marketing of vaping products", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Ontario government passed regulations as part of Bill 36 enabling promotion of vaping products in retail stores.Ontario is the first province to pass e-cigarette legislation that allows companies to directly market vaping products to the public, after the government made changes Wednesday that health advocates say will endanger young people.The Ontario government passed regulations as part of Bill 36, the province’s cannabis legislation, enabling the promotion of vaping products in stores. The new regulations state convenience stores, gas stations and other retailers can promote e-cigarette products, as long as the promotions comply with federal law. The federal government has several restrictions on e-cigarette advertisements, such as brand sponsorship or the use of colours, graphics or other elements that might be appealing to youth. The regulations don’t permit retailers to display e-cigarettes; those products must remain hidden from view, similar to tobacco products.Of the eight provinces with e-cigarette legislation, only Ontario allows product promotion. Alberta and Saskatchewan don’t have provincial e-cigarette laws.Story continues below advertisementOntario was set to ban the display and promotion of e-cigarettes in all retail stores on July 1, but the new Conservative government halted the changes days before.Health advocates say the promotions will normalize the products and make them appear enticing to youth, even if the advertisements are not directed at them.“This is a victory for Big Tobacco at the expense of Ontario kids,” said Rob Cunningham, senior policy analyst at the Canadian Cancer Society.E-cigarettes are typically battery-operated devices that turn a liquid substance containing nicotine into a vapour, which condenses into an aerosol and gets inhaled by the user. In addition to addictive nicotine, e-cigarettes can expose users to other harmful chemicals that emerging research suggests could be linked to long-term health problems. Young people who use e-cigarettes are also more likely to try traditional cigarettes, according to a study published earlier this year by the U.S. National Academies of Sciences, Engineering, and Medicine.New regulations state convenience stores, gas stations and other retailers can promote e-cigarette products, as long as the promotions comply with federal law.In September, the U.S. Food and Drug Administration launched a campaign aimed at young people to warn about the potential dangers of e-cigarette use and nicotine addiction. The agency conducted a surprise inspection at JUUL Labs Inc., which controls more than 70 per cent of the market for e-cigarettes in the United States. The company recently announced an expansion into Canada. FDA commissioner Scott Gottlieb said the rising rates of vaping by teens in the U.S. is an “epidemic.\"“The FDA won’t tolerate a whole generation of young people becoming addicted to nicotine as a trade-off for enabling adults to have unfettered access to these same products,” he said in a statement.In Canada, about 23 per cent of students from Grades 7 to 12 say they have tried e-cigarettes, according to the 2016-17 Canadian Student Tobacco, Alcohol and Drugs Survey, an increase from 20 per cent in 2014-15. Of those who had tried e-cigarettes, 17 per cent were current smokers, 35 per cent were experimental smokers, 12 per cent were former smokers and 36 per cent said they had never tried smoking. Less than one-quarter of students purchased their e-cigarettes from a retail store.Story continues below advertisementStory continues below advertisementOntario Health Minister Christine Elliott was not available for an interview. In an e-mail, press secretary Hayley Chazan said the government is focusing on protecting young people “from the potential harms of e-cigarettes and secondhand vapour.” Retailers can’t sell the products to minors and they can only be promoted “if the promotion complies with federal law,\" she wrote.Dave Bryans, chief executive of the Ontario Convenience Stores Association, said the changes will allow retailers to advertise to adult smokers, which he said are the target market for e-cigarettes.“All we want is the ability to communicate,” he said. \"Now at least we have some type of compromise that we can communicate the benefits or the less harmful alternatives of these products to tobacco smokers.\"In a statement, JUUL Labs Inc. said adult smokers need to be made aware of its products while ensuring minors don’t get access.“We believe the Ontario government has balanced these important public health objectives and support the government’s approach to allow responsible communication about vaping products in the places where they are sold.”Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}