{"id": "U.S. court affirms verdict holding Monsanto weed-killers responsible for man’s cancer", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.A U.S. judge on Monday affirmed a verdict against Bayer AG unit Monsanto that found its glyphosate-based weed-killers responsible for a man’s terminal cancer, sending the German company’s shares down 8 per cent.In a ruling by San Francisco’s Superior Court of California, Judge Suzanne Bolanos said she would slash the punitive damages award to $39 million from $250 million if lawyers for school groundskeeper Dewayne Johnson agreed.Bayer said in a statement the decision to reduce the damages was a step in the right direction, but it would still file an appeal with the California Court of Appeal, because the verdict was not supported by the evidence presented at the trial.Story continues below advertisement“According to an earlier hearing, the judge toyed with the idea of dropping the damages altogether,” brokerage alpha said in a note to clients. “Now, however, the judge made a U-turn and confirmed the jury’s previous verdict.”Monsanto, which denies the allegations, had asked the judge to throw out the entire original $289 million verdict or order a new trial on the punitive damages portion.A jury on Aug. 10 found the company’s glyphosate-based weed-killers, including RoundUp and Ranger Pro, had caused Johnson’s cancer and that the company failed to warn consumers about the risks.The verdict wiped 10 per cent off the value of the company and marked the first such decision against Monsanto, which faces more than 8,000 similar lawsuits in the United States.The German company, which bought Monsanto this year for $63 billion, says decades of scientific studies and real-world use have shown glyphosate to be safe for human use.Lawyers for Johnson in a statement on Monday said they were still reviewing whether to accept the reduced award or retry the punitive damages portion.“The evidence presented to this jury was, quite frankly, overwhelming,” the lawyers said.Story continues below advertisementStory continues below advertisementThe amount of punitive damages is limited by law, and Bolanos said California’s constitution did not permit a higher award. If Johnson accepts the reduced damages, the final verdict would order Monsanto to pay a total of $78 million, split equally between compensatory and punitive damages.Bolanos’ Monday decision is a turnaround from a previous tentative ruling she issued on Oct. 10.In that preliminary order, Bolanos said she was considering ordering a new trial on punitive damages, saying Johnson had failed to meet his burden of producing clear and convincing evidence of malice or oppression by Monsanto, a requirement for allowing a jury to award punitive damages.But following that tentative ruling, at least five of the jurors who delivered the Aug. 10 verdict sent letters to the judge, urging her to uphold their decision. Bolanos did not directly refer to the jurors’ letters in her Monday ruling, but said the jury was entitled to its findings.In September 2017, the U.S. Environmental Protection Agency concluded a decades-long assessment of glyphosate risks and found that the chemical was not a likely carcinogen to humans.However, in 2015, the cancer unit of the World Health Organisation classified glyphosate as “probably carcinogenic to humans.”Story continues below advertisementJohnson’s case, filed in 2016, was fast-tracked for trial due to the severity of his non-Hodgkin’s lymphoma, a cancer of the lymph system, that he alleged was caused by years of glyphosate exposure.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}