{"id": "How do you solve a marketing problem like Mary Jane?", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Tim Dewhirst is a senior research fellow in marketing and public policy at the College of Business and Economics at the University of Guelph.Despite Canada’s legalization of recreational marijuana on Oct. 17, uncertainty remains about what marijuana marketing is going to look like as the industry develops. That feeling reflects, in part, the fact that legislation differs in each province or territory, as well as the piecemeal approach to deciding what products are allowable and where they can be acquired. In Ontario, for example, purchases currently can only be made online, while in British Columbia, there is a single government-run store supplying cannabis products. With regard to variation, edibles will not be available for close to a year and, as yet, there is no clear legislation on how they will be marketed.A primary aim of the federal Cannabis Act is to better protect the health of Canadians, and to some extent, legislation will serve to achieve this aim. A federal task force was appointed in 2017 to recommend how to legislate for the legalization of marijuana. Respected experts with formidable backgrounds in addiction, public health, law and policy shared thoughtful considerations on legislation, but the task force suffered a notable absence: a business and marketing voice.Story continues below advertisementAn obvious way to build a responsible framework for any industry is to look at lessons learned from others. In this case, from a marketing standpoint, industries to examine would be the tobacco, vaping and beverage industries, where there is a lengthy history of products on the market. The strategies to consider in marketing relate to product, price, place and promotion, commonly dubbed the 4Ps by marketers, and how these should work together.Take e-cigarettes as an example. In the United States, e-cigarette use by young people was recently declared an “epidemic” by FDA Commissioner Scott Gottlieb, and marketing expertise is being employed to examine how sweet flavours such as cherry, cotton candy and chocolate make the products more palatable and appealing to youth. E-cigarettes resembling USB flash drives are now readily available, with discreetness being a key product feature that appeals to young people.These examples of product developments to suit a specific market segment are readily applicable to the marijuana sector, where banana split, strawberry shortcake and cookie strains are available. The edibles market will inevitably include options such as gummy bears and, of course, brownies. Moreover, a subset of next-generation marijuana products will be developed to suit the desires for discretion, given concerns about the lingering stigmas of cannabis. We need to look at what is being developed, and who it appeals to.Brand families usually start with a parent brand, with more variants under the existing name introduced over time. Think of Coca-Cola creating Diet Coke, Coke Zero, and so on. What is less clear is how marijuana regulation will deal with descriptors such as “light” and “mild.” These descriptors are no longer allowable for cigarettes but remain widespread in the beverage and food sectors. Expertise is needed to share insights around marijuana marketing and how strategies will develop in order to ensure ethical marketing standards are maintained.Price conversations, meanwhile, often focus on comparisons with provinces or territories, or indeed the long-standing black market. While important areas of focus, they often overlook the fact that uniform prices are an unlikely approach in appealing to varied consumer groups. Some products will be priced purposefully high to suggest prestige and superior quality – the thinking that “you get what you pay for.” Enter microproducers with organic, sustainably grown marijuana. Other products will be priced to convey value and affordability – using 99-cent endings, rather than rounded-off dollar endings, to stimulate sales. We may even see loyalty programs being considered as retail options broaden, and again need to consider the ethics attached.Marketing expertise would also offer insight about how the supply chain and distribution model should look, including the best level of competition for the economy and whose role it is to manage competition.Targeted marketing is unlikely to remain limited to existing marijuana users. While the first day of the marijuana business saw supply failing to meet demand, as the market stabilizes there will be competitive pressure to appeal to youth given the size of this prospective market, as well as the importance of initial brand selection in building loyalty. Strategic efforts to enhance usage among existing users or reassure those with health concerns is also expected.Story continues below advertisementStory continues below advertisementThere is considerable intrigue about forecasting what to expect from the industry. Only by looking at other industries and employing marketing expertise can we create a more informed legislative framework for marijuana in order to fulfill the goal of better protecting the health of Canadians.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}