{"id": "Mexico’s cannabis industry eyes potential exports to Canada", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.A man rolls a joint during a demonstration demanding the approval of the use of marijuana for medicinal and recreational purposes in front of the Mexican Senate building in Mexico City on Sept. 28, 2016. PEDRO PARDOPart of cannabis and investing Go to more stories on cannabis and investing Mexico’s new government is moving quickly to legalize cannabis for commercial, recreational and medical purposes, creating a potentially lucrative industry in a country ravaged by the drug war – and a major new supplier for Canada’s marijuana market.Olga Sanchez Cordero, a senator who will become interior minister when president-elect Andres Manuel Lopez Obrador takes over on Dec. 1, introduced draft legislation on Thursday to regulate cannabis. The Lopez Obrador administration wants to shift how government approaches public security and the cripplingly high rate of violence associated with the drug trade. Its primary goal is to ease the burden on the justice system and prisons from simple marijuana possession charges, and to end the social exclusion of the thousands of Mexicans who have served time in prison for crimes such as transporting drugs.But many in Mexico – and beyond – are enthused about another aspect of the proposed legislation: the creation of the largest market to date for recreational and medical marijuana sales, and of a potentially significant new export industry for Mexico.Story continues below advertisement“We’re going to be able to create a new industry based on new regulations, to produce cannabis for the rest of the world – our geographic situation and our labour [pool] gives us a major advantage,” said Guillermo Nieto, president of the National Association of Cannabis Industries. He said his office had been deluged with requests from potential investors and partners from outside Mexico in recent days.However, Mexico’s new industry will come with significant risks: Organized crime groups involved in drug trafficking control significant amounts of territory, including much of the area where illegal marijuana is currently grown. The country’s security forces are used to an adversarial, heavily militarized engagement with cannabis producers. Judicial and transparency institutions are weak. And Mr. Lopez Obrador is a leftist who will be keen to maintain heavy state involvement in the new industry.The new legislation will likely look much like Canada’s – Ms. Sanchez has been studying the Canadian model closely – and issue licences for the cultivation, processing, packaging, sale and possession of cannabis. Mr. Lopez Obrador’s party has a majority in both houses of Congress and so should be able to pass the legislation it wants, but the new regulatory system is unlikely to be signed into law for at least a year.Lorena Beltran, operations director for Mexicannabis, a company focused on medical research, called the new legislation \"amazing news for our country and for our patients … we’ve been working on medical regulation but now we have … the whole package.”Ms. Beltran said she, too, has had incessant phone calls from international cannabis businesses since the regulation process accelerated here 10 days ago. (On Oct. 31, Mexico’s Supreme Court ruled that the ban on recreational cannabis use is unconstitutional, in a pair of decisions that, combined with earlier rulings, created a national precedent and spurred the new government to act swiftly on regulation.)“International interest is growing by the minute,” she said. “Everyone is ready to come here – [companies from] Canada, Israel, Czech Republic, Spain, Colombia are ready to come … sooner rather than later Mexico is going to become the biggest producer of marijuana.”Canopy Growth Corp., based in Smiths Falls, Ont., is one company that is watching closely.Story continues below advertisementStory continues below advertisement“We’ve had people there [in Mexico] and we are interviewing people there,” Canopy co-CEO Bruce Linton said. “We think [Mexico] is a real opportunity. When you’re on both sides of America with really well-positioned products, this could be a very good platform to reflect both sides of the border with the U.S. and enter an economy that is substantial.”Still, Mr. Linton cautioned that it remains early to invest in Mexican assets. “You want to scout locations and you want to scout people but you don’t want to deploy capital until they’ve at least issued firm [regulations] and specs,” he said.Mr. Nieto said the fact that cannabis prohibition remains entrenched at the federal level in Mexico’s largest trading partner, the United States, will not be a problem. “We see a big market potential aside from the U.S. – Canada is not going to be able to grow product year-round and whatever it is able to grow is going to be really expensive – we’re also looking at Europe, for the same reason.”Mexico legalized medical marijuana use in 2017. Ms. Beltran, who is also the founder of CannabiSalud, a symposium on the uses of medical marijuana for Mexican health professionals, predicted that Mexico’s nascent industry would have an experience “very similar to what is happening in Colombia,” which legalized medical use in 2016 and where many of the major players in a new medical cannabis industry are Toronto Stock Exchange-listed, are joint Canadian-Colombian ventures, or have significant Canadian investment.Colombia, the primary competitor for Mexico’s new industry, has lured foreign investors with the promise of a perfect climate for cannabis cultivation; a location abutting the equator that offers the 12-hour day/night cycle preferred by the plant; a low-cost work force that, in some quarters, has plenty of experience with cannabis as a crop; and the social impact factor of turning the page on the drug war’s dark history. Mexico hopes to tell investors much the same story.“We have land to cultivate and even better conditions than Colombia,” insisted Ms. Beltrán; Mexico will have an additional advantage in that all forms of cannabis will be legal, allowing for synergies across types of production, she said. Colombia elected a right-of-centre government last May that is not expected to legalize anything beyond medical use cannabis. But she and Mr. Nieto both said they hope to see Mexican and Colombian businesses forming partnerships, given their shared history with the drug war.Story continues below advertisementMs. Beltran also sees Canada as the logical target market for the new industry. “Canada is running out of product, and spending so much money on production when they need greenhouses and we don’t.”Colombia was able to tell investors a good-news story about its 2016 peace deal ending a civil war fuelled by drug trafficking. Mexico’s drug war, however, continues; there were 31,000 murders last year, the highest number ever recorded. The powerful presence of drug cartels will likely give some would-be investors pause.Marijuana is a minimal revenue stream for most cartels, since the price per kilogram has fallen precipitously in Mexico in recent years after individual U.S. states legalized marijuana, shrinking a market that contracted further with Canada’s regulation last month. But security risks in most marijuana-growing regions are still significant.“A lot of investors … are very cautious because Colombia is already getting out of the drug war but in Mexico we still have one right now – that’s the big question for the new government, how they’re going to help us in this industry to be secure.” The military forces currently deployed to wipe out the crops of campesino farmers in the mountains of Guerrero and Michoacan will have to be redeployed to protecting them, she said.Another key question for would-be business owners will be the receptiveness of the incoming government: Mr. Lopez Obrador favours national industries and has a tepid relationship with the business community. The civil society organizations that have been advising his government on the bill have emphasized the importance of creating an industry that does not quickly become a monopoly enriching the traditional Mexican business elite, but instead has widespread financial benefits.“How do you promote a national industry to take people out of poverty, instead of creating revenues for already wealthy countries?” asked Lisa Sanchez, who heads a national public-security and human-rights organization called Mexico United Against Crime and who has been advising the government on the new law. Her organization hopes to see a mutually exclusive licensing system that would mean that a business authorized to grow could not process, or one that processed could not sell.Story continues below advertisement“Otherwise you will quickly create a very powerful lobby that will dismantle all the safeguards for public health and use of taxes – you need to put the lock in the law so that the predatory class do not take advantage of this.”With a report from Jameson Berkow in TorontoAvailable now: Cannabis Professional, the authoritative e-mail newsletter tailored specifically for professionals in the rapidly evolving cannabis industry. Subscribe now.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}