{"id": "Home from service, many veterans turn into entrepreneurs ", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Veteran Mike George has opened an artisanal import shop called Aurelius Food Co. on Ottawa’s west side.Dave Chan/Dave ChanHe didn’t know it at the time, but Mike George’s post-military career started to come together one August afternoon in 2016, in a small village just north of Rome.Mr. George had spent most of the past decade “go-go-go,” as he puts it, in a hectic military career that saw him on tours of duty in Bosnia, Afghanistan, Mali, Iraq and elsewhere. That summer afternoon in Italy, he was visiting his uncle, Jean, whose rural property contained an abundance of olive trees. The day before Mr. George was due to head back to Canada, his uncle asked whether there might be a market in Canada for the olive oil produced there.“It just went on like a light,” Mr. George says. “I thought, ‘I’m going to make this happen.’ The next day I was on the plane, drafting scenarios and creating plans of attack. I had zero connections with the food world, so I just started sketching out scenarios and figuring out how to make those connections.”Story continues below advertisementMr. George dove into the challenge with the intensity of a special forces soldier – which, of course, he was – and olive oil became his unlikely-sounding exit strategy from the Canadian Forces.“I had to step away,” he says. “I’d been doing this for 11 years; spent 900 days overseas, not including training. I was at a point in my life where I just wanted to be home a little more.”He finally put in his papers and was released from service in June. In September, he opened a brick-and-mortar shop called Aurelius Food Co. on Ottawa’s west side, specializing in artisanal imports, including the olive oil he started out with.Mr. George’s business may be unique, but his entrepreneurial path isn’t.Canada doesn’t track how many military veterans choose entrepreneurship. In the United States, veterans are 45 per cent more likely to own a business than non-veterans. In Canada, about 5,000 people exit the Forces every year, at an average age of 41 – young enough to have decades of working life ahead of them, but old enough to be disconnected from the civilian work force, and at a disadvantage in trying to break into existing professional networks. According to Veterans Affairs Canada, one-third of veterans report a difficult adjustment to civilian life.According to Kathleen Kilgour, program manager at Prince’s Operation Entrepreneur (POE) – which provides mentoring, educational and financial assistance to veterans seeking to start a business – entrepreneurship is a common path on this side of the border, as well. The organization lists nearly 350 veteran-owned Canadian businesses on its website at buyveteran.ca.“Military personnel have worked for years in careers where they’ve had to exercise discipline, leadership, stay on mission, troubleshoot problems, mitigate risk,” she says. “There are so many traits that are great for building a business.”Story continues below advertisementStory continues below advertisementThat is especially true, she believes, for the one-fifth of departing veterans who are medically released in any given year, for reasons ranging from physical injuries to PTSD and anxiety. Among POE’s clients, 70 per cent were medically released. “It’s a great fit because it’s flexible,” Ms. Kilgour says, “and if they need to take time to manage their physical or mental health, they have the autonomy to do that.”Regardless, she adds, entrepreneurship fills one of the veterans’ most common needs: a new mission.That was certainly the case for Mr. George, who was still working at what he calls a “high operational tempo” while planning his new business. He spent his days training, travelling and doing parachute exercises in California, and his nights arranging meet-and-greets with Ottawa chefs, and number-crunching expenses.One of the biggest impediments to post-military success, he believes, is veterans who don’t understand how to translate their skills into the civilian world.“I know a lot of guys who think they’re only good at shooting guns and exploding things,” Mr. George says. “But you’re good at planning, you’re good at scheduling, and time management.”Paul B. Carrol spent 24 years in uniform as an infantry and special operations officer, before leaving the military in 2016. Today, he divides his time between a full-time job with the Bank of Nova Scotia, and an entrepreneurial gig as managing partner with Pathfinder Leadership Associates, a company founded in 2015 by Mr. Carroll’s long-time “fire-team partner,” David Quick. Pathfinder provides military-style leadership training to corporate clients, including Air Canada, SNC-Lavalin Group Inc., and others.Story continues below advertisement“If you’ve spent decades being posted from job to job, you don’t know how to do job interviews,” he says.“You’re used to a very rigid hierarchy, which is different from the civilian world,” he adds. “But the money and time the taxpayer has invested in a soldier has produced a lot of skills, including leadership skills, that can be leveraged by the nation. To have those people just end up sitting in a townhouse in [Ontario towns] Oromocto or Petawawa is a waste to the nation.”For all of the strategic training inculcated in soldiers, Mr. Carroll says, many fail to strategize their own careers post-release. He suggests veterans develop a five-year plan before leaving. “If your network is only folks in uniform, you don’t really have a network,” he says.“The military is all ‘we, we, we,’ but in the private sector you’ve got to be able to say ‘I,’ and not be afraid to sell yourself, which is something a lot of veterans struggle with.”Mr. George concurs.“When people notice how much energy or discipline I put into it and my store, it’s all a function of how I was in the military. But the important thing is that I take it for what it is – my time in the military was really important to me, but it doesn’t define me. It’s something I did, not who I am.”Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}