{"id": "Five questions with Canadian women’s hockey team GM Gina Kingsbury", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Five questions with two-time Olympic gold medalist Gina Kingsbury, who took over as Hockey Canada’s director of women’s national teams this year from Melody Davidson. Davidson remains with the team as a scout. Canada is competing in the Four Nations Cup tournament in Saskatoon.This interview has been edited and condensed for space.What has surprised you most about the job?Story continues below advertisementThe many balls that are in the air at all times. There’s just so many little things. Just the administrative work and all of those things you have to think about. Certainly grew a huge appreciation for Mel. Just understanding how the whole organization works is a steep learning curve. I go home and my head is always spinning, ‘Oh yeah, I’ve got to remember that.’ The team aspect, I think there’s nothing that came as a surprise being part of teams for many years in different roles.What is a typical game day for you at the Four Nations Cup here in Saskatoon?If we have a skate, I would go to the rink with a team. I spend most of my mornings doing some of the office work I’m leaving behind, athlete agreements and following up with e-mails. Once I get to the rink, I sit in the coaches’ room and hear a little bit of their prep before the game. Then I head to the stands to watch the game. I don’t go to the dressing room between periods. I stay up top with Mel. After the game, we meet as a staff. We discuss the game, we rank the players. We have a postgame meal and get together with the staff and make sure they have everything they need for the next day. I would love to say I work out. I did go on one run when I got here, which is probably my first run in three years.How much pressure do you feel in this job? How did your experience as a national team player prepare you to handle it?It’s a very similar feeling as a player. You have less control in this position, but it’s the same feeling. It’s the same type of desire to win I had as an athlete. As soon as you’ve worn the jersey once in your life, you always have that pride, that chip on your shoulder, that competitiveness that, ‘Okay, we’ve got to win this.’ That never dies. The fact I get to be a small part of it is something I find great pleasure and honour in for sure.What is the No. 1 lesson Melody Davidson taught you, both as your coach in the 2006 and 2010 Olympics and as the person who groomed you for this position?I would say two things. At the 2010 Olympics, the last year I played for Mel, she talked about the process a lot. That gold-medal game, her pregame speech had nothing to do with the results. It was about having gold-medal performances. I know I talk about winning a lot, but there is a huge process in place and that’s where the focus needs to be. What you do today impacts tomorrow. I’ve applied that in various areas of my life, but now it’s certainly in the back of my mind. The second one: Working alongside of Mel is details. She always had this great vision for what it may look like eight years down the road and a great understanding of the details that go into it. I don’t think I’m as detailed as she is. I’m trying to catch up to her in that aspect.Story continues below advertisementStory continues below advertisementDo you still play, even for fun?I actually stopped cold turkey when I retired. I got into coaching with the Okanagan Academy and I got my hockey fix when I coached. I always put shin pads on so I could jump in on drills. I used to teach skills for Calgary-based athletes twice a week which got me out of the office and on the ice. It’s this year that I won’t be going on the ice. I think I will miss that aspect. There’s no doubt about it.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}