{"id": "Advisors: It’s time to ‘wake up' and smell the cannabis", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Large investment firms have kept clients out of marijuana stocks during the lead-up to legalization of the drug for recreational use, but that will have to change if financial advisors want to keep up with the performance of Canada’s broad benchmark index.Steve Hawkins, president and CEO of Horizons ETF Management Canada Inc., says cannabis stocks are going mainstream now that a number of companies have made it into the TSX Composite Index, and investors should buy in for long-term growth.Horizons launched the world’s first cannabis exchange-traded fund in June, 2017. The Marijuana Life Sciences Index ETF (HMMJ) has increased approximately 300 per cent in the run-up to the legalization of recreational cannabis Oct. 17. A second fund, launched in February, the Emerging Marijuana Growers Index ETF (HMJR), is down about 10 per cent since inception.Story continues below advertisementSteve Hawkins manages the world’s largest marijuana ETF, HMMJ.PIERRE GAUTREAUWhat’s been the industry’s response to your cannabis ETFs?Investors are recognizing there is a lot less risk investing in an ETF that provides broader, diversified exposure to a new and evolving marketplace. This sector is something different where there is not a lot of expertise in investing in individual securities. It’s such a new sector that is so news-driven, and we don’t know what is around the corner.How should an advisor manage client expectations? What’s the conversation that should be occurring? I’m hoping financial advisors are really describing the risks of investing in this sector. It is highly volatile. The standard deviation of returns, even if you’re investing in an ETF, is higher than most any of the broad-based indexes out there that investors are used to. This is not for the faint-of-heart investor. There are a lot who like to play the sector for short-term momentum gains, but I still look at it as a long-term play.Do you think that advisors should be warning clients that the sector is overvalued?These companies are trading at huge, unforeseen multiples from a price-earnings basis and from a revenue basis. But this is something very new and exciting and we don’t know what’s around the corner for this sector. For an advisor to say it’s overvalued and you shouldn’t be investing, okay he can say that – but does he really know that the sector won’t continue to perform upward? No, he doesn’t. He could be making a bad call, and I don’t think he wants to risk his business on that. He should describe the risk, say that this a longer-term investment opportunity, and tell clients “if you want to invest in it, you should be investing through diversified exposure rather than one, two or three of the [individual] issuers that are out there.”With more than 120 cannabis producers already licensed by the federal government, should investors be concerned about a coming oversupply?Story continues below advertisementStory continues below advertisementWill all of these LPs [licenced producers] survive? Absolutely not. But that’s why you want to invest in a diversified portfolio of an ETF. There will be big guys swallowing little guys. There will be companies outside this new space swallowing little guys and big guys.There has already been so much capital markets activity, and it is continuing to drive prices. Can speculation of further takeovers drive things into perpetuity? No. At some point in time will there be a come-to-Jesus moment affecting the valuations of these companies? There could be. But remember, these are bricks-and-mortar companies that are building a business to sell a product.Your funds have some international companies, but you are particularly bullish on Canadian ones. Why is that?Canadian companies have a leg up on U.S. companies who cannot distribute worldwide, or even outside of their state. Our Canadian companies have boots on the ground and are building out across the world in countries where medical marijuana has already been approved and recreational marijuana could potentially be approved. It’s not just about the Canadian marketplace. The global possibilities are very significant and Canadians have the advantage.Some investors remain hesitant about this new sector because they still see a stigma around cannabis, and there are some very real legal issues. If you are investing in companies that are selling products to U.S. states, they are doing so in violation of federal U.S. law. So what’s the conversation advisors need to have to make their clients comfortable?Generally speaking, Canadian companies are being extremely careful to ensure that they are not violating federal law in the United States. If the company is listed on the TMX, the TMX is restricting the ability of that company to operate in the United States from a production, cultivation and distribution perspective. The TMX does not want any of its listed companies operating in contravention of U.S. federal law. There are companies listed on the Canadian Securities Exchange that have some exposure to the United States, and you have to be very careful about those companies you invest in. There’s not necessarily any way that they can repatriate money back to Canada to reinvest in their business.Story continues below advertisementYou’ve said that when it comes to cannabis stocks, individual Canadian investors are out in front of big investment firms. Why is that?Financial advisors, especially at the bigger institutions, are not going out of their way to call their clients and say “you need to be investing in the cannabis industry.” It’s still a reactionary process. It’s my understanding that in the majority of conversations it’s the client who is asking advice from their financial advisor on how to get exposure to the cannabis space, or if they should get exposure.When we look at the trading stats of our ETFs, we believe that they are primarily owned by the direct investor because we’re seeing ticket sizes of between $3,000 and $5,000.Do you expect institutional investors to buy in once the market is legalized?They have to. You see cannabis company names now in the TSX Composite Index like Canopy Growth, Aurora Cannabis and Aphria. Financial advisors have to wake up to the fact that these companies are in the broad-based market index now and they may underperform by not owning these companies.It’s not easy to be a stock picker in this sector, and I don’t recommend any financial advisor try to be one. There isn’t a lot of precedent. The multiples don’t really mean anything. It really is a news-driven and highly biased investment mentality that is driving this, as well as momentum chasers.Story continues below advertisementWhat effect will Oct. 17 have on cannabis stocks?We’re not going to see sales numbers on Oct. 18. We’re not going to see financial information coming out of these companies right away. It’s going to take a few months for those numbers to come to market and for people to figure out what is really going on. This is still a very new and disruptive sector to the Canadian equity market place.This interview has been edited and condensed.Editor’s note: A previous version of this story stated that Mr. Hawkins is the co-CEO of Horizons ETF Management Canada Inc. In fact, he is the CEO. Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}