{"id": "The new assassins: Why countries are getting away with murder across borders", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Today’s international killers are incompetent – on purpose.They arrive at an international airport, wearing workaday clothes and stony expressions, attempting to blend in. But once the security footage emerges, they look and act nothing like innocent business travellers. They proceed to commit unspeakable acts upon a fellow foreigner, with chemicals and blades and bullets and usually a number of blunders, before rushing home, leaving a paper trail behind, to report to their intelligence agency.This ghastly, shambolic ritual – the cross-border murder of an untrustworthy fellow citizen by agents of a less-than-democratic government – has become our era’s signature act of international intrigue.This week, it was details of the disappearance of Saudi Arabian journalist Jamal Khashoggi, after he entered a Saudi consulate in Istanbul. Experts now strongly believe a mass of recorded evidence suggesting that this critic of Riyadh’s regime was murdered. They believe Mr. Khashoggi was probably tortured and dismembered by a team of Saudi intelligence agents who had arrived that morning in Istanbul on private jets, apparently under orders coming from Crown Prince Mohammed bin Salman’s circle. This follows high-profile cases in the past few years in which Russian and North Korean exiles have been killed abroad, using rare chemical agents, by intelligence agents from their home countries.Story continues below advertisementNot since the Cold War, when agents of the Soviet Union and the United States carried out numerous international assassinations under deep cover, has this practice been so widespread. Targeted extrajudicial killings became so rare in recent decades that Western intelligence agencies have directed most of their energies to “signals intelligence” and acts of electronic spying and sabotage, and shifted their primary focus to non-state actors such as terrorist organizations. As a result, investigators have been taken aback by this recent spate of old-fashioned flesh-and-blood killings, carried out by very human agents of well-known national governments.This looks like a return to a grisly past, but there is an important difference. Today’s assassins are comparatively incompetent, sometimes comically so, at concealing their identities and nationalities. And their governments don’t appear to care much about secrecy – perhaps deliberately.“I think it reflects the realities of the information age – the chances of keeping an operation secret, let alone the identities of the assassins, are diminishingly low,” says Mark Galeotti, a specialist in Russian intelligence and global crime at the Prague-based Institute of International Relations, who has documented Moscow’s sloppy tradecraft in recent cases. “This encourages quick and dirty operations rather than complex, subtle ones.”And there’s another factor: The international political environment may be enabling such killings. Rather than fearing retribution from the other side, these regimes currently enjoy support and backing from the United States, or at least from President Donald Trump, who studiously avoids voicing any criticism of the world’s major strongman regimes. While there have been some punishments and sanctions, these regimes appear to believe they can act with comparative impunity.Those Cold War assassinations (both countries killed several heads of government in developing countries, and the Soviets also killed dissidents abroad) were conducted in utmost secrecy by deep-cover agents using painstaking methods to cover their identities and tracks. Many of the Soviet acts were not known until some KGB archives were leaked by defector Vasili Mitrokhin in the 1990s; others may still be unknown.By comparison, today’s assassins usually have their identities and nationalities revealed by police, governments or citizen investigators within days, not just because digital technology makes such investigations easier, but because their tradecraft is often shockingly sloppy and they sometimes use substances that are easily traced to their home country.Consider these recent cases:Story continues below advertisementStory continues below advertisement- Two Russian men, charged with the nerve poisoning of former Russian double agent Sergei Skripal and his daughter Yulia Skripal, entered Britain on passports that had been issued on the same day in 2009 with consecutive serial numbers. Their passport files contain no information on the holders and stamps and markings issued by the Russian military intelligence agency, the GRU. Journalists and investigative groups such as Bellingcat were easily able to identify one of them as Anatoliy Chepiga, a GRU colonel who had earlier been honoured by president Vladimir Putin as a Hero of the Russian Federation, and the other as GRU agent Alexander Mishkin.The suspects’ claims that they were not agents but tourists were easily contradicted: Their flights were booked the day before travelling; their trip was only a couple days long; and they had visited the site earlier on an apparent reconnaissance trip.The potent nerve agent they used in the attempted assassination, Novichok, is a chemical-warfare substance manufactured only in Russia and is believed to be tightly held by Russian military. While they failed to kill either of their targets, the fake perfume bottle they apparently used to transport and apply the chemical was found in a dumpster by an English couple, one of whom subsequently died.Their actions echo those employed in the 2006 London poisoning of former Russian spy and defector Alexander Litvinenko, in which the agents used Polonium-210, a substance that would be unlikely for anyone other than a Russian military or intelligence service to obtain.- When Kim Jong-nam, the stepbrother of North Korean dictator Kim Jong-un, died suddenly of horrific nerve poisoning at Kuala Lumpur International Airport in Malaysia in February, 2017, authorities were quickly able to tie the attacks to four men who had flown in from Pyongyang days earlier and who immediately flew out through Jarkarta, Dubai and Vladivostok before returning to Pyongyang, and another three men who were living in Malaysia and who immediately sought refuge at the North Korean embassy. These men had trained and paid two young women, one Vietnamese and one Indonesian, to encounter Mr. Kim and smear a chemical on his face, in what they were told was a TV-show prank. An eighth North Korean man was arrested and a stock of chemicals was found in his condominium. The chemical that killed Mr. Kim was the internationally banned nerve agent VX, of which North Korea, as a non-participant in international treaties, is one of the few countries to hold a significant stock. At least one of the North Korean men (most of whom flew home or were deported) has been linked to Pyongyang’s intelligence agencies through his previous employment at North Korean embassies.- The 15 Saudi men who flew into Istanbul on Oct. 2 and entered the Saudi consulate shortly before Mr. Khashoggi disappeared were quickly identified by Turkish and U.S. authorities. Many of them were directly linked to Crown Prince Mohammed bin Salman’s circle. At least one of the men has been identified through photographs as a frequent member of the Prince’s travelling entourage, and three others are tied through documents and witnesses to Prince Mohammed’s security detail. A forensic doctor who was present (and believed to have conducted the dismemberment and possibly part of the torture) holds high-level positions in the Saudi Interior Ministry, was described by The New York Times as “a figure of such stature that he could be directed only by a high-ranking Saudi authority.”Story continues below advertisementThis scandal follows a number of highly visible kidnappings and killings tied to Saudi authorities – most notably the abduction and detainment in Riyadh last year of Lebanese Prime Minister Saad Hariri, who was slapped around and forced to read a televised resignation speech. That plot also backfired: Mr. Hariri soon renounced his resignation and returned to power with greater popularity. But the Crown Prince received little criticism from the United States or other allies.In all of these cases, the intelligence agencies did surprisingly little to conceal the nationality or motive of the attacks; it was all dagger and hardly any cloak. In comparison with the sort of killings known during the Cold War as “active measures,” these appear barely competent. But that lack of secrecy may be intentional. Mr. Galeotti argues that these regimes may be tolerant of less professional conduct in their intelligence agencies because they don’t mind being noticed. In the case of the Skripal attack, “using Novichok was in itself enough of a message, deniable but with a sly nod and a wink such that there could be no real doubt that Moscow was behind it.\"It sent a clear message to any would-be double agents or critics of the Putin regime – much as the North Korean and Saudi actions appear intended not just to eliminate one potential regime challenger, but to deter, through sheer horror and gruesomeness, others who might consider dissent in the future.And this sort of brazen warning, involving a serious crime as well as a violation of the sovereignty and border security of another country, may be effective in a way it wouldn’t have been a decade ago, for the simple reason that today regimes can get away with it.The disappearance and apparent murder of Mr. Khashoggi, says Jen Psaki, a vice-president of the Carnegie Endowment for International Peace and a former State Department and White House official, “points to a deeply troubling trend: the increased targeting of journalists and dissidents by foreign governments, without the risk of real consequences.”Story continues below advertisementThere have, however, been repercussions. After the Skripal attack’s origins in Russian intelligence were exposed, international outrage led to a mass expulsion of Russian officials, in which at least 153 Russian diplomats were expelled by 28 countries, including Canada. And there was a toughening of the economic sanctions on Russia under the Magnitsky Acts imposed by Canada, the United States and the European Union in the wake of the brutal 2009 solitary-confinement death of regime critic Sergei Magnitsky.But these punishments, and any repercussions felt by North Korea and Saudi Arabia for their assassinations, are contradicted by the messaging from the United States and some of its allies – and especially from the White House.Only four months after the Skripal poison attacks, Mr. Trump held his very friendly Helsinki summit meeting with Vladimir Putin, during which killings of critics were not discussed and Mr. Trump praised Mr. Putin, shortly after having described the European Union as “a foe.”Sixteen months after Kim Jong-nam’s airport slaying, Mr. Trump held a similar meeting with his stepbrother, the North Korean dictator, during which this and other slayings and abductions of critics were not discussed and Mr. Trump praised Kim Jong-un; four months later, he declared that he “fell in love with Kim. Really.”The attack on Mr. Khashoggi, a U.S. resident and Washington Post columnist, appears to be following a similar pattern. Mr. Trump has studiously avoided suggesting any Riyadh connection, blaming unnamed “rogue killers.” This week, he dispatched Secretary of State Mike Pompeo to Riyadh and Istanbul; Mr. Pompeo met with the Crown Prince uncritically and talked of working together to find a solution, without any suggestion of sanctions.The fact that the Trump administration strictly refuses to utter any criticism of illegal actions or abuses by Russia, North Korea, the Philippines, Israel, Egypt or Saudi Arabia means that these regimes know they can mete out punishments across international borders that would have turned them into pariah states in earlier eras.“The absence of a check from the United States is in part to blame,” Ms. Psaki says. “If there is going to be pressure on Saudi Arabia to come forward with details on the Khashoggi affair, there will need to be another country leading the charge. Otherwise there will be no consequences, and possibly more disappearances.”Few informed observers believe that the Khashoggi disappearance, even if it turns out to be deliberate torture-murder conducted by Saudi agents under direct orders from Prince Mohammed’s circle, will threaten or substantially change the warm relationship between the Trump administration and the Saudi regime. (There may be temporary and symbolic measures, and more substantial condemnations from other countries, following Canada’s recent lead.) This, they worry, will send a clear message to other countries thinking of eliminating dissidents.“We are all taken aback by the lack of condemnation by any of our traditional allies for the acts that we are seeing happen, most recently with [Khashoggi’s] case,” Sara Kayyali, a Syria researcher for Human Rights Watch, told reporters this week. “I think it is a very challenging time for all of us and our traditional allies are not around. It looks like it is the age of impunity.”Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor. Latest News  Latest Videos © Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}