{"id": "The (trans) kids are all right: What gender-affirming health care really means", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Kai Cheng Thom is an award-winning author and social worker with dual masters degrees in social work and couple and family therapy from McGill University. She is currently a youth and family therapist at Central Toronto Youth Services specializing in work with transgender young people and their parents.I will never forget the look on my parents’ faces when they came to meet me in the psychiatric ER of BC Children’s Hospital after my attempted suicide. I was 16 years old, and I had just come out as transgender – news that shocked and dismayed them. Terrified that I had lost their love, I tried to take the only way out I could think of at the time.What did we do wrong? They asked me on that day, their faces haggard with anxiety and shame. How did it get to this? That look in their eyes pierced me to my core. Determined never to hurt my parents again, I promptly went “back into the closet,” pretended that my trans identity had been a passing delusion brought on by adolescent angst, and did not mention it again to anyone for five years.Story continues below advertisementA decade later, I am happy to say that I am living as a trans woman, and I share a wonderful relationship with my parents. As a public-sector clinical social worker and family therapist to trans youth and their families, I meet parents like them – and children like me – every day.As proponent of gender-affirming trans health care, I think often of the lessons I learned as a teen about the complicated love that exists between parents and trans/gender-nonconforming youth, and the questions that it raises: What is the role of family in a trans person’s journey? And how can health-care institutions help? How can we bring parents and youth together in order to work for the happiness of the whole family?As the medical and popular debate about best practices in the treatment of gender-diverse young people rages on with seemingly inexhaustible fervor, such questions have become ever more pressing – and ever more tinged with political bitterness. This week, for instance, a headline in The New York Times warned the word “transgender” could be “defined out of existence” by Donald Trump’s administration, with the country’s Department of Health and Human Services reportedly proposing that sex be defined “as either male or female, unchangeable, and determined by the genitals that a person is born with.”Outside the arena of political and legal struggles, however, health-care professionals must look to both research-derived evidence and clinical wisdom in order to best meet the needs of the individuals and families we serve.This is why, as a mental-health clinician, a daughter and a trans person, I strongly believe in the importance of gender-affirming health care for trans and gender-nonconforming children and youth.The gender-affirming, or affirmative, model is a recent development in the history of psychological and medical treatment of trans/gender-nonconforming people. The basic premise of the affirmative model is that children and youth are most likely to grow into healthy adults when their parents and caregivers accept and affirm their gender, whatever that may be.In the affirmative model, families are encouraged to use their child’s preferred name and pronouns, even if they change more than once. Medical transition is understood to be a safe and voluntary process, initiated at the young person’s request, which may include puberty-blocking, cross-sex hormone therapy and surgery, undertaken at an appropriate age as determined by competent medical professionals. Gender exploration – as in experimenting with different kinds of gender expression through clothing, play and social roles – is seen as part of the healthy development of the young person.Story continues below advertisementStory continues below advertisementThe earliest model of care for trans and gender-nonconforming young people understood them as mentally ill, much as gay and lesbian people once were. Proponents of this model theorized that while trans adults were too far gone to “cure,” gender-nonconforming children could and should be saved from growing up trans. Parents were taught by mental-health professionals to discourage their children’s atypical gender expression and to refrain from using their preferred names and pronouns, at least until adulthood.Medical transition via hormone therapy and surgery were also to be put off until adulthood and reserved for a select number of individuals who could pass a battery of assessment tests determining whether they were “truly” transsexual.The more recent “watchful waiting model,” which is the approach most commonly used to contest the affirmative model, is more relaxed in its approach to gender diversity but continues to discourage parents from accepting, encouraging or celebrating gender nonconformity in youth until they have reached adulthood.Critics of “watchful waiting” take issue with its underlying insinuation that growing up to be trans is a negative outcome that should be avoided if possible. This is because being trans is neither an illness nor a burden, but rather one of the infinite variations of human expression that make our society so richly diverse.As a therapist, I am also critical of the ways in which the “watchful waiting” model pits the naturally protective instincts of parents against the self-determination of their children, thereby creating potentially lifelong ruptures in the bond between them.Youth, especially trans and gender-nonconforming youth, are in need of validation from their parents – no matter how standoffish and distant they may seem. In a teen world full of existential questions, parents ought to be a safe harbour. How can this protective dynamic possibly function when parents and youth are set at odds over something as fundamental as the young person’s gender?Story continues below advertisementRecent scientific research shows drastic decreases in suicidality and other mental-health challenges for trans and gender-diverse youth who feel affirmed by their parents. Youth do better in regards to almost every aspect of health, mental health and quality of life when they feel supported by their parents, as the Trans Pulse study, one of the most comprehensive evaluations of trans health to date, has shown.The key phrase here is “feel supported.” Many parents may act in ways that are rooted in selfless concern for their children. However, anxiety and fear can result in reactive, rather than responsive, parenting, which sends unintentionally hurtful messages to young people.Reactive parenting may come off as overly controlling, and escalates typically banal disagreements into conflict. With a topic as sensitive as gender identity, such miscommunications can cause serious damage to parent-child relationships when repeated over time.One example of reactive parenting is a knee-jerk refusal to use a young person’s preferred name and pronouns. This is felt as a profound betrayal by the youth in question. Rejection of the desire for medical transition due to fear of the (statistically extremely low) risk of regret becomes a rejection of the youth’s inner world.Gender-affirming approaches focus on strengthening the bond between trans youth and their families. My colleagues and I provide the information and psychological tools that parents need to assuage the natural worries they have about raising a trans child – What if they change their mind about being trans? What are the side effects of hormones and surgery? Will they face bullying and discrimination? Does this mean I have been a bad parent? – so that they can have honest, dynamic and, yes, sometimes difficult conversations with their youth about gender, sexuality and growing up.The core strength of the affirmative model of trans health care is its faith (backed up by scientific evidence) in trans/gender-nonconforming young people and their families. It assumes that, given a safe environment and supportive guidance, adolescents are capable of discovering their own best selves. It assumes that parents are their children’s most valuable allies, rather than their gatekeepers. It assumes that a gender-nonconforming youth’s journey is likely to be a long and twisting road, but wondrous as well as challenging.Story continues below advertisementSome detractors have argued that gender-affirming health-care professionals are “hijacking” children in order to “turn them trans,” and that we are using the threat of child suicide to strong-arm parents into accepting drastic medical and social interventions. Most recently, the term “rapid-onset gender dysphoria” has come into vogue to describe the belief that many transgender boys today are in fact lesbian girls who have been pressured into suddenly “turning trans” as a way of dealing with the trials of growing up young and female.Underlying this fear-based thinking is, once again, the classic belief that being trans is a bad thing. Gender-affirmative thinking is not invested in the outcome of a child’s gender journey: Trans or not, the ideal outcome is a happy, healthy person with a loving connection to their family.This can only be achieved when health care and parenting practices come from a place of trust, rather than fear. Young people are perceptive; when they sense that their caregivers are anxious, they withdraw. When adults criticize their chosen path without listening first, they are more likely to double down and reject adult guidance, and this is where true danger begins.Only when we trust trans youth do they begin to trust us.Every time I meet a parent of a trans/gender-nonconforming youth, sooner or later, they ask me a question. The question is always the same, although they ask it in many different ways: Am I being a good parent? What am I doing wrong? I see the same fear, the same guilt that I saw in my parents’ eyes that day in the hospital so many years ago.The answer, of course, is one they already know: All you have to do is love them. Love them with as much joy as fear. Love them, whoever they are, whatever they become. Love them for always becoming something new. Love them for the soul that stays the same. Love them for all of the dreams you gave them, all the dreams they threw away, all the new things that they dream today. Love them. Love them. Love them.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}