{"id": "Toronto Wolfpack waste little time in naming Brian McDermott coach", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.One day after parting ways with Paul Rowley, the Toronto Wolfpack signed former Leeds Rhinos coach Brian McDermott.McDermott, a 48-year Englishman, is a decorated coach who helped fill Leeds’ trophy case over eight years. But he was fired in July with the injury-plagued Rhinos, the reigning Super League champions, mired in a seven-game losing streak and fighting to maintain their place in the top-flight.On Saturday, the transatlantic rugby league club said Rowley’s decision to leave was mutual. The speed in appointing his successor suggests that there may be more to the story, however.Story continues below advertisementRowley, a former England hooker, led Toronto to a 49-8-2 competitive record over two seasons — taking a blank piece of paper and helping assemble a team that came within one win of back-to-back promotions.The Wolfpack are clearly looking for McDermott to complete their journey to the promised land — the Super League.McDermott’s trophy haul with the Rhinos is impressive — four Grand Finals, two Challenge Cups, a League Leaders’ Shield and a World Club Challenge in eight years at the helm.“We are delighted to bring in a head coach of Brian’s calibre, who we believe can lead us to the Super League,” Brian Noble, Toronto Wolfpack’s director of rugby, said in a statement Sunday.“Brian is a world-class coach and we are extremely excited that he has come on board with the Wolfpack. His track record in the game speaks for itself and having known Brian for many years, I know he has all the right attributes to take the club forward.”Noble and McDermott have history. McDermott played nine years at Bradford Bulls, three of which were under Noble who coached the team from 2001 to 2006. Together the pair won two Super League championships, a Challenge Cup and World Club Challenge title.McDermott, who took over Leeds in late 2010, coached the Rhinos for 265 games (162-97-6).Story continues below advertisementStory continues below advertisement“After being at the Rhinos for so long, I always knew I couldn’t just roll into any other club so easily,” McDermott said in a statement. “Toronto Wolfpack offers a challenge and ambition that not many other clubs have, already demonstrating this with how they’ve gone about getting to this stage.”“I’m excited on being a part of something that could genuinely be a game-changer for rugby league in the U.K.”McDermott also coached the U.S. national team between 2015 and 2018, taking the team to the 2017 Rugby World Cup.McDermott had been linked to the Wolfpack for some time. Asked about such reports, Wolfpack co-owner David Argyle said in October that the team had had “no discussions with any other coaches.”“I’m not sure where those rumours come from,” he added.Rowley’s squad won England’s third-tier League 1 in the club’s inaugural 2017 season and topped the second-tier Championship in 2018. Toronto missed automatic promotion to the Super League on points difference before losing a promotion playoff dubbed the Million Pound Game 4-2 to London Broncos on Oct. 7.Story continues below advertisementThe Wolfpack, bolstered by six new signings including Cronulla Sharks back Ricky Leutele, are slated to open training camp later this month in England.We have closed comments on this story for legal reasons or for abuse. For more information on our commenting policies and how our community-based moderation works, please read our Community Guidelines and our Terms and Conditions.© Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}