{"id": "Canadians love living in the suburbs, so why aren’t we building more of them?", "paragraph": "The subject who is truly loyal to the Chief Magistrate will neither advise nor submit to arbitrary measures.Besides being easier on the budget, the Suburban Dream also aligns perfectly with what most families actually want.Eric Chow/The Globe and MailCanada’s National Dream, the modern edition, began in 1953. That was the year Don Mills, the country’s first large-scale, fully planned suburb, began selling affordable, ranch-style homes north of Toronto. Immediately, middle-class Canadian families yearning for their own bit of heaven – a yard, a garage and room for the children to play – began packing their bags for the burbs.And almost as quickly, folks who claimed to know better were complaining about it. In 1954, a national report by Maclean’s titled Why Live in the Suburbs? highlighted a litany of social, environmental, economic and congestion problems arising from these newfangled housing developments: “Mile upon mile it sprawls, subdivision after subdivision, and…there is no sign it will stop,” the author groused. One expert in the article called the suburbs “a ghastly mess.”Not much has changed in 65 years. People are still flocking to the suburbs. And the experts are still complaining about it. But after more than half a century, isn't it time to finally admit Canadians would simply rather live in the burbs and figure out how to make that happen?Story continues below advertisementEarlier this year, the Council of Canadian Urbanism announced 67% of all Canadians live in what it calls “auto suburbs,\" meaning low-density housing where a car is necessary to get around. “Active cores” – downtown areas where high-rises and transit dominate – constitute a mere 14% of the country’s population. And almost all the new growth over the past decade has occurred in car-centric suburban areas. “[Big-city] downtowns may be full of new condo towers, but there is five times as much population growth on the suburban edges,” the report observes.“It’s shocking,” states David Gordon, one of the authors of the report and a professor at Queen’s University’s School of Urban and Regional Planning. “As a professional planner, I know the subject of urban sprawl has been on the radar for a long time,” he says. “Yet we are still getting a lot more of it.” His report hammers a long list of social, environmental, economic and congestion problems tied to suburban development that can only be solved by discouraging further expansion. “The suburbs have a sustainability problem,” Gordon firmly declares. His list of unsustainable problems is almost identical to the one critics laid at the feet of the suburbs decades ago.While Gordon's work adopts a usefully rigorous approach to estimating the size and growth of Canada's suburbs, it drops any pretense to science or logic when assessing their inherent worth. They're always a problem in need of fixing. Admittedly, suburban living creates significant issues around commuting time, energy use and municipal servicing costs that require careful consideration. But the suburb-as-pejorative routine is grotesquely overdone.More Canadians live in the suburbs—and the burbs are gorwing faster too% livingdowntown in“active cores”in 2016% living in thesuburbs in 2016% of totalpopulationgrowth in suburbsfrom 2006-201679%90%91%Edmonton1,321,426Vancouver2,463,431Calgary1,392,6098%16%12%17%12%15%Toronto5,928,040Ottawa1,323,783Montreal4,098,92784%83%74%15%Growth in the numberof people living inmetropolitan areas(including suburbsand downtown from2006-20169%Growth rate in “activecores,” where a highpercentage walk orcycle to work17%Growth rate in “auto suburbs.” where people commute by car8%Growth rate in “transitsuburbs,” wherepeople are more likelyto use public transitfor workSOURCE: SCHOOL OF URBAN & REGIONAL PLANNING,QUEEN’S UNIVERSITY; DR.DAVID GORDONMore Canadians live in the suburbs—and the burbs are gorwing faster too% livingdowntown in“active cores”in 2016% living in thesuburbs in 2016% of totalpopulationgrowth in suburbsfrom 2006-201679%90%91%Edmonton1,321,426Vancouver2,463,431Calgary1,392,6098%16%12%17%12%15%Toronto5,928,040Ottawa1,323,783Montreal4,098,92784%83%74%15%Growth in the numberof people living inmetropolitan areas(including suburbsand downtown from2006-20169%Growth rate in “activecores,” where a highpercentage walk orcycle to work8%Growth rate in “transitsuburbs,” wherepeople are more likelyto use public transitfor work17%Growth rate in“auto suburbs.”where peoplecommute by carSOURCE: SCHOOL OF URBAN & REGIONAL PLANNING,QUEEN’S UNIVERSITY; DR.DAVID GORDONMore Canadians live in the suburbs—and the burbs are growing faster too% living in thesuburbs in 2016% living downtown in“active cores” in 2016% of total population growthin suburbs from 2006-2016Calgary1,392,609Toronto5,928,04091%83%12%12%Edmonton1,321,426Ottawa1,323,78315%8%90%74%17%16%Vancouver2,463,431Montreal4,098,92779%84%15%Growth in thenumber of peopleliving inmetropolitan areas(including suburbsand downtownfrom 2006-20169%Growth rate in“active cores,”where a highpercentage walk orcycle to work8%Growth rate in“transit suburbs,”where people aremore likely to usepublic transit forwork17%Growth rate in“auto suburbs.”where peoplecommute by carSOURCE: SCHOOL OF URBAN & REGIONAL PLANNING, QUEEN’S UNIVERSITY; DR.DAVID GORDONMany of the complaints Gordon’s study heaps on suburban living – it leads to obesity, for example – have been disproven. (“We find no evidence that urban sprawl causes obesity,” reports a study appearing in the Journal of Urban Economics.) Other gripes are purely ideological in nature, such as the claim that suburbs give rise to divisive politics. And Gordon’s report makes no mention of key factors that might cause families to rationally eschew downtown living for a suburban retreat, like crime, noise and lack of space.Murtaza Haider, an outspoken and iconoclastic professor of real estate at Ryerson University’s Ted Rogers School of Management, says part of the suburbs' reputational problem lies in the downtown mindset of planners themselves. “The underlying philosophy of urban planning has always been that suburbs are bad. They are never recognized as having any virtue,” he says. Yet it’s hard to imagine anything being this popular without having a few arguments in its favour.Chief among those virtues is price. “The suburbs are affordable,” says Haider bluntly, pointing out that rents in downtown Toronto are double those in the outer ring of the Greater Toronto Area. Anyone truly concerned about housing affordability ought to be a tireless advocate for more suburban development on cheap and plentiful farmland.Besides being easier on the budget, the Suburban Dream also aligns perfectly with what most families actually want. “Whenever you ask people what kind of house they’d like, the majority view – without exception – is a single-family detached home,” says Haider. In the most recent survey of Canada Mortgage and Housing Corp., nearly two-thirds of all prospective homebuyers say a single-detached house is their preferred option.Story continues below advertisementStory continues below advertisementThe suburbs also seem to improve your mood. Work published earlier this year by University of British Columbia economist John Helliwell finds a strong correlation among lower housing prices, lower-density housing and selfreported happiness. “Life is significantly less happy in urban areas,” his study concludes. While rural residents are the happiest of all, people living in suburb-heavy cities such as Calgary, Oshawa and Trois-Rivières are also high on the leaderboard. Hyper-dense Vancouver, a city Gordon considers the “poster child” for good urban planning and intensification, is the unhappiest place in the country. It’s also Canada’s least affordable city.People like living in the suburbs. They really, really like it.Yes, commuting times can be brutal, and suburban residents may consume more energy per capita than city dwellers, but the situation isn't universally grim.According to Infinite Suburbia, a global research project seeking to change professional opinions about the suburbs, low-density living offers not only congenial and affordable housing for the masses but also some unheralded environmental and social benefits.Suburban backyards, for example, provide a greater diversity of species and habitat than some natural ecosystems. These ample landscapes also permit better wetland protection than dense, paved-over urban areas. And despite claims that the suburbs are endless, soul destroying rows of homogeneity, the Canadian experience proves them to be lively and welcoming destinations that are especially attractive to minority and immigrant families seeking upward mobility and their share of our collective national dream.With suburban growth still going strong after 65 years, urban planners and the rest of the “expert” community should stop vilifying the suburbs and instead learn how to embrace and improve them. The suburbs make people very happy. Let’s have more of them.Story continues below advertisementCorrection: Several figures as well as the source provided for the infographic associated with this article were incorrect and have been updated.Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff. Non-subscribers can read and sort comments but will not be able to engage with them in any way. Click here to subscribe.If you would like to write a letter to the editor, please forward it to letters@globeandmail.com. Readers can also interact with The Globe on Facebook and Twitter .Welcome to The Globe and Mail’s comment community. This is a space where subscribers can engage with each other and Globe staff.We aim to create a safe and valuable space for discussion and debate. That means:Comments that violate our community guidelines will be removed. Commenters who repeatedly violate community guidelines may be suspended, causing them to temporarily lose their ability to engage with comments.Read our community guidelines hereDiscussion loading ...Read most recent letters to the editor. Latest News  Latest Videos © Copyright 2018 The Globe and Mail Inc. All rights reserved.351 King Street East, Suite 1600, Toronto, ON Canada, M5A 0N1Phillip Crawley, Publisher"}