{"id": "What the midterms (and past elections) show about US democracy", "paragraph": "The contradictory outcome reflects deep political divisions and, increasingly, the antiquated quirks of the ConstitutionWashington, DC - A week and a half after the US midterm elections, the true scope of a vote that brought Democrats control of the US House of Representatives but left Republicans, the party of President Donald Trump, holding power in the Senate is coming into view.Democrats gained at least a 231-to-198 majority in the House, while Republicans held onto and will likely expand a 51-to-47 majority in the Senate, with some races in both chambers yet to be concluded.It's a contradictory outcome that reflects both the deep political divisions within the United States and, increasingly, the antiquated quirks of the American Constitution that stem from the nation's beginnings in 1787 as a federation of self-governing states.\"It shows that majoritarian democracy does not directly translate at the electoral level and the ideal of `The Will of the People' is intervened by the structural arrangements endemic to the American Constitution,\" said John Jackson, a visiting professor at the Paul Simon Public Policy Institute at Southern Illinois University.\"In effect, we can easily come out with minority rule and that's what we've had, and what we continue to have in the recently concluded elections,\" Jackson told Al Jazeera.In the US Senate, as set out in the Constitution, each of 50 states is represented by two senators, meaning the populations of large states like California and New York are underrepresented while small states like Alaska and North Dakota are over represented. Indeed, the incoming Republican majority in the Senate represents 26 million fewer people than the Democrat minority. More than four million people who live in Washington, DC, and territories like Puerto Rico, Guam and American Samoa are not represented in the Senate at all.The disparity in the US Senate matters and has become a more pronounced problem as Senate Republican leaders have abandoned old rules that required 60-vote majorities to approve lifetime judicial appointments to the federal bench. Trump Supreme Court nominee Brett Kavanaugh was confirmed by a narrow majority of Senators representing 41 million fewer Americans than the losing side.Looking forward, political analysts say it is quite likely that a Republican-controlled Senate, representing a minority of Americans, would block policy prescriptions and legislation favoured by a future Democrat president and majority Democrat House of Representatives.Similarly, the US Electoral College, which determines the outcome of presidential contests, is based on state-by-state apportionment of delegates. In 2016, Trump won election over Hillary Clinton by a 306-to-232 Electoral College margin while losing the nationwide popular vote by nearly three million. In 2000, Former President George W Bush fell short of Al Gore in the popular vote but won election with a majority of Electoral College delegates after the US Supreme Court halted a recount in Florida and awarded the state to Bush.Trump won in 2016 because he narrowly swept Pennsylvania, Michigan and Wisconsin, a feat that may be difficult for him in 2020 after Democratic wins in those states on November 6.Pennsylvania Democrat Senator Bob Casey won reelection handily by a 55.6 percent majority and Democrats picked up three House seats in the Philadelphia and Pittsburgh from Republicans. In Michigan, Democrat Senator Debbie Stabenow won with 52.2 percent and Democrats picked up two House seats around Detroit. In Wisconsin, Democrat Senator Tammy Baldwin won with 55.4 percent and a Democrat defeated incumbent the Republican Governor Scott Walker.In Arizona, a Democrat Kyrsten Sinema won a US Senate seat for the first time in decades and a Democrat won in Nevada signaling what may be a significant shift towards Democrats in the Southwest.Indeed, what looked like a modest win for Democrats on November 6 is proving to have been a wider and deeper victory, even if the Senate remains out of reach.  Broadly speaking, nationwide, Democrats expanded their base from urban to suburban areas while Republicans held rural districts.House Democrats did very well in districts where Clinton won in 2016 but Republican members of Congress remained in office, or in districts where Trump did slightly better than Clinton. Democratic gains were fewer in conservative districts that Trump carried by wider margins in 2016.But Democratic gains might well have been greater, were it not for heavily gerrymandered congressional districts in states like Ohio, Wisconsin and North Carolina. Gerrymandering occurs in the US when state legislatures draw boundaries for congressional districts that favor one party over another. Republicans gained an upper hand in this practice after the 2010 election when they won a large number of state legislatures and governorships.\"We are seeing something like a 54 to 46 percent split in the vote but Democrats are emerging with something like 52 percent of the House seats,\" said Chris Hughes, an lawyer at FairVote, an advocacy group seeking reforms to the US election system.\"So even in a huge wave year for Democrats, when they win the national popular vote by eight points, they are still out on two percent of seats because of the way districts are drawn and the way our voting method itself functions,\" Hughes told Al Jazeera.An increasing body of academic research by constitutional scholars shows just how unrepresentative the US system has become. Yet, as a practical matter, there is very little that can be done to change the US system, short of winning elections. While the Constitution can be amended in theory, any changes require approval by two-thirds of the states, a nearly impossible threshold in the modern era.Democrats have started to fight back against the Republican advantage in gerrymandered states. Former Obama Attorney General Eric Holder is heading a new Democratic organization, the National Democratic Redistricting Committee, that is focusing first on redrawing the congressional maps in Virginia, which will elect a new legislature next year. Many states will go through a redistricting process in 2021 after the 2020 census is completed. Illustrating the redistricting challenge, FairVote projects that 358 House seats - 190 Republican and 168 Democrat - are highly likely to remain in each party's hands in 2020. The battle for control of the House of Representatives will be fought in only 77 potentially competitive districts, more of them held by Democrats.\"We can predict a week after the election that 84 percent of seats will go to the same party in 2020 with fewer and fewer seats being competitive,\" Hughes said.In the Senate, the geographical advantage Republicans held in November's election will flip to Democrats in 2020 and 2022. Of 33 Senators facing reelection next year, nine Republicans are likely to face competitive challenges while perhaps four or five Democrats will be forced to defend their seats. That means control of Senate is likely to rest on outcomes in only 14 key battleground states.UpFrontIs the US on the brink of a constitutional crisis?\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}