{"id": "12 killed in Sicily as death toll in Italy floods mounts", "paragraph": "Devastating storms have destroyed 100,000 hectares of pine forest as number of people killed in flooding crosses 30.Floods in Italy have killed 12 more people in the southern island of Sicily, taking the week's death toll past 30, according to authorities.The latest deaths on Sunday include nine members of two families, who were spending a long weekend in a country home near Palermo that was overrun by water from a rapidly swelling river.Among the victims were three children, aged one, three and 15. Prime Minister Giuseppe Conte called the disaster \"an immense tragedy\", while officials opened an investigation to find out if houses built near the river complied with safety norms.In another incident, a 44-year-old man was found dead in his car near Vicari, also in the Palermo region, while a passenger in the car was missing. In the town of Cammarata near Agrigento, a popular tourist destination for its ancient Greek temple ruins, the fire department said its divers were working to recover the bodies of two people swept away while driving on a road.Six Italian regions remain on high alert after violent winds and strong rain killed at least 20 other people this week.Luca Zaia, the governor of Veneto who flew over the region with Interior Minister Matteo Salvini, said the storms have destroyed 100,000 hectares of pine forest.\"It's like after an earthquake,\" he said. \"Thousands of hectares of forest were razed to the ground, as if by a giant electric saw.\"Salvini, who is also one of the country's two deputy prime ministers, posted a series of tweets with photos he took while flying over the destroyed area near Belluno.\"We need $45.5bn to secure the national territory,\" he said.In a dig at the European Union, Salvini, leader of the far-right League party, said he hoped his plans would not provoke complaints from Brussels about overspending.The bloc has objected to Italy's proposed budget, which it says will worsen the country's already huge deficit.\r\n            SOURCE:\r\n            News agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}