{"id": "Tunis attack, a wake-up call for Tunisia's political leaders", "paragraph": "Suicide attack in Tunisia's capital sends a message that political polarisation needs to end to tackle security issues.Tunis, Tunisia - On Monday afternoon, a suicide bomb blast struck Habib Bourguiba Avenue, one of the most iconic and heavily protected places in the heart of the Tunisian capital, Tunis.A female attacker reportedly used a hand-made explosive device to target a police van, wounding at least nine people.This was the first such incident to hit the country since 2015 when the much larger attacks at the Bardo Museum in Tunis and Sousse beach left at least 60 people dead.Though much more limited in its scope and nature, Monday's explosion shook Tunisians and served as a reminder that the country's security threats are far from gone.\"It's really regrettable,\" said Messaoud Romdhani, president of the Tunisian Forum for Economic and Social Rights.\"It should make us think why we haven't got rid of terrorism? Why we're witnessing such acts of terror?\"The attack came weeks after President Beji Caid Essebsi announced the extension of Tunisia's state of emergency for one more month, amid growing political tensions ahead of next year's legislative and presidential elections.This year, Tunisia has been rocked by months of political turmoil which saw last month the end to the four-year alliance between the secular Nidaa Tounes party and the Islamist party Ennahdha.\"This attack is an expected result of the current political situation with the ongoing fierce debate between the ruling parties,\" argued Sami Brahem, political scientist and researcher at the government-run Centre for Economic and Social Studies.\"The strategy of terrorism is to capitalise on the tense climate in political life and make its way in.\"In light of the latest violence, Brahem urged all stakeholders - including all ministries - to put differences aside and join forces for the full implementation of the national counterterrorism strategy.But in a country struggling with high unemployment and inflation, the focus should not just be on strengthening security but also on improving the socioeconomic standards of those living on the margins, added Brahem, referring to the disadvantaged status of the suicide bomber, identified as 30-year-old Mouna Kebla.Originally from Sidi Alouane, a town in eastern Tunisia, Kebla held a university degree in English but did not have a job. According to local media, she had occasionally worked as a shepherd to help her family.She had no criminal record, nor was she previously suspected of links to violent ideologies.\"The problem today is not about people who are already implicated in terrorist activities, but those who are potentially exposed to involvement in such actions,\" said Brahem.\"If we had to map terrorism in Tunisia, we would find that the regions where [prospective] terrorists come from are the same economically and socially marginalised regions.\"For Romdhani, Monday's bomb explosion gives politicians a chance to come together and strategise about the country's direction.\"It's a political mess right now, there aren't people who care about the future,\" he said. \"This event tells us that we should get together in solidarity and change politics to be able to confront terrorism.\"Romdhani stressed that heavy-handed security should not be the focus in that fight.\"We need to reinforce democracy, we also need more social justice, and we need more a type of politics that is concerned about Tunisia's future and its interest only,\" he said.\"We have no other choice, violence is not an option,\" he added, urging civil society to play its part in making people aware of the need to change politics.The state of emergency, which has been in place since the 2015 attacks that decimated Tunisia's vital tourism sector, is now very likely to stay in place and be renewed in the aftermath of Monday’s incident, according to observers.With improved security since 2015, tourists had started to return to the country's resorts which had lain abandoned and deserted in the wake of the attacks.Tunisia hoped it had turned the corner - until Monday's attack. However, given the small scale of the explosion, concerns about a potential impact on its tourism industry are not as big.In addition, the makeshift nature of the attack showed that violent groups in the country had weakened as security forces dismantled several cells and disrupted a number of plots over the past couple of years.\"I think terrorism today does not pose a threat to Tunisians nor tourists in Tunisia,\" said Brahem.Still, Hassine Dimassi, political analyst and former economics professor at Sousse University, said that Monday's attack made it clear that authorities should not be complacent.\"One lesson to gather is that we need to strengthen the intelligence apparatus,\" said Dimassi, encouraging the state to remain in alert mode.\"Extremists seem to have lost momentum recently, and that's when they resort to this kind of action to mark their presence taking advantage of a loosening of grip on security forces.\"\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}