{"id": "California wildfires death toll at 42, more than 200 missing", "paragraph": "Search on for hundreds of people missing in wildfires as firefighters continue to battle blazes at both ends of state.As wildfires raged at both ends of the US state of California, authorities reported 13 more fatalities in burned-over towns bringing the death toll to 42 - the deadliest single fire in the state's history.The dead were found in burned-out cars, the smouldering ruins of their homes, or next to their vehicles, apparently overcome by smoke and flames before they could escape.Statewide the death toll stood at 42 early on Tuesday, including two dead in southern California, with authorities still searching for bodies and more than 200 people unaccounted for. Search teams were working in Paradise, a town of 27,000 that was largely incinerated on Thursday, and in surrounding communities in northern California's Sierra Nevada foothills.Authorities called in a DNA lab and anthropologists to help identify what, in some cases, were only bones or bone fragments.More than 8,000 firefighters battled wildfires that scorched at least 1,040sq km of the state, with the flames feeding on dry brush and driven by winds that had a blowtorch effect.\"This is truly a tragedy that all Californians can understand and respond to,\" Governor Jerry Brown said on Sunday.\"It's a time to pull together and work through these tragedies.\"California is requesting emergency aid from the Trump administration. President Donald Trump has blamed what he called poor forest management for the fires, without presenting evidence to support his claim.The governor said that the federal and state governments must do more forest management but that climate change is the greater source of the problem.\"And those who deny that are definitely contributing to the tragedies that we're now witnessing and will continue to witness in the coming years,\" Brown said.Drought and warmer weather attributed to climate change, and the building of homes deeper into forests have led to longer and more destructive wildfire seasons in California. While California officially emerged from a five-year drought last year, much of the northern two-thirds of the state is abnormally dry. In southern California, firefighters beat back a new round of winds Sunday and the fire's growth was believed to have been largely stopped, though extremely low humidity and gusty Santa Ana winds were in the forecast through at least Tuesday.Some of the thousands of people forced from their homes were allowed to return, and authorities reopened US 101, a major freeway through the fire zone in Los Angeles and Ventura counties.Malibu residents in nearby mountains were slowly learning whether their homes had been spared or reduced to ash. Two people were killed in Malibu, and the fire destroyed at least 180 or so structures.As of Sunday night, the fire had grown to more than 344sq km was 15 percent contained, authorities said. In northern California, where more than 6,700 buildings have been destroyed in the blaze that obliterated Paradise, firefighters contended with wind gusts up to 64km an hour overnight, the fire jumping 91 metres across Lake Oroville.The state fire agency said Monday that the fire had grown to 303sq km and was 25 percent contained.The magnitude of the devastation was beginning to set in even as the blaze raged on. Public safety officials toured the Paradise area to begin discussing the recovery. Much of what makes the city function was gone.\"Paradise was literally wiped off the map,\" said Tim Aboudara, a firefighters union representative. He said at least 36 firefighters lost their own homes, most in the Paradise area.Others continued the desperate search for friends or relatives, calling evacuation centres, hospitals, police and the coroner's office.Sol Bechtold drove from shelter to shelter looking for his mother, Joanne Caddy, a 75-year-old widow whose house burned down along with the rest of her neighbourhood in Magalia, just north of Paradise. She lived alone and did not drive.As he drove through the smoke and haze to yet another shelter, he said, \"I'm also under a dark emotional cloud. Your mother's somewhere and you don't know where she's at. You don't know if she's safe.\"The 29 dead in northern California matched the deadliest single fire on record, a 1933 blaze in Griffith Park in Los Angeles. A series of wildfires in northern California's wine country last fall killed 44 people and destroyed more than 5,000 homes.\r\n            SOURCE:\r\n            AP news agency\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}