{"id": "Trial of Salvadoran rape survivor for abortion delayed", "paragraph": "Judge postpones trial of Imelda Cortez, accused of aggravated attempted homicide, after prosecutor fails to show up.Usulutan, El Salvador - A Salvadoran judge postponed the trial of a young woman, who is accused of attempted aggravated homicide for giving birth to her rapist's child in a toilet, on Monday after the public prosecutor failed to show up to court.According to the judge, the prosecutor did not attend the scheduled proceedings due to a medical issue, but lawyers for Imelda Cortez said their client is being denied justice.\"It worries us because I don't think the public prosecutor has much interest in the case,\" said Bertha De Leon, one of the lawyers. De Leon told Al Jazeera outside the court on Monday that the prosecutor's failure to show up demonstrated negligence.Cortez, 20, is accused of attempted aggravated homicide of her newborn baby. She became pregnant at the age of 17 after being raped repeatedly by her stepfather.Cortez, who said she was not aware she was pregnant at the time, suffered abdominal pain and went to the toilet where she fainted in April 2017. Her baby was found in the toilet.The baby survived, but Cortez was sent to jail to await trial. She faces up to 20 years in prison if convicted.Her stepfather has been charged with aggravated sexual assault of a minor and faces up to 15 years in prison, according to lawyers with the Citizen Group for the Depenalisation of Abortion.This is the eighth time one of Cortez's hearings has been postponed, according to her lawyers. They had previously asked for the case to be terminated based on lack of evidence, but the request was denied. They also asked for Cortez to be released from prison while awaiting trial, but that request was also denied. The judge rescheduled the hearing for December 17, saying the court is \"very saturated\" with hearings.Cortez's lawyers believe the repeated postponement of the case is preventing their client from accessing justice.\"She is going to remain detained for more time while she is awaiting the sentence,\" De Leon said. A few blocks from the court in the city of Usulutan, more than 90km outside the capital San Salvador, about 100 protesters gathered outside the public prosecutor's office, calling him a \"coward\" for impeding justice.\"Imelda is not alone,\" they chanted. \"We, human rights defenders, are here.\"The public prosecutor was not immediately available for comment.A petition supporting the release of Cortez has collected more than 45,000 signatures.Maira’s case isn’t unusual. In 2017, El Salvador sentenced a rape victim to 30 years in jail after she had a stillbirth. pic.twitter.com/Ovddnvhf71The hearing was attended by international human rights defenders, including Pedro Vera of the Inter-American Court for Human Rights, who asked for the Salvadoran state to follow due process for a \"quick justice process free of stereotypes against women\".Cortez is one of dozens of women who have been imprisoned since El Salvador made abortion illegal under all circumstances in 1998. The country has made some strides forward in terms of loosening the total abortion ban, with at least five women released this year.But efforts to change legislation have recently been hindered by conservative voices within the country's national assembly, exposing the difficult path to reforming the laws.Cortez will remain in prison until her next court date.\"What's most important is her freedom,\" De Leon said.\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}