{"id": "Freedom of expression in Tanzania is slowly being eroded", "paragraph": "A seemingly innocuous new law on statistics is the latest measure designed to curb free speech in Tanzania.In September 2018, the Tanzanian parliament passed amendments to the national statistics law that included a provision for criminal penalties for anyone who publishes information that does not comply with the National Bureau of Statistics methodology or that challenges official statistics. At the time of its passage, the new law drew little attention outside Tanzania, except among organisations like the World Bank and UNDP which independently produce global statistics on development and the economy. But, as the National Bureau of Statistics struggles to create the regulations that will give the new law effect, it is increasingly apparent that this is another attempt by the legislature and the executive to suppress freedom of speech in the East African nation.Free speech is increasingly under threat across East Africa. In an interesting evolution from the street battles and protests of the 1990s, legislatures in the region have emerged as the new front in the battle for freedom of expression. Perhaps taking cues from Kenya and Uganda which have since 2013 passed legislation that has strangled the press, the internet and other spaces for expression, Tanzania is also entering a period of authoritarianism by legislation. In this approach, ruling parties that dominate the legislature in the countries in question simply overwhelm opponents and citizens with complex, punitive and burdensome legislation that does not in itself strike at the heart of the political work but creates enough bumps and roadblocks to slow down the putative activist or stop the momentum of any political or social mobilisation.This approach works on the principle of: \"90 percent of people obey 90 percent of the laws 90 percent of the time\". That is, most people like to continue to obey the more banal laws on taxation or social organisation - to pay taxes, obey parking regulation and not kill or steal.And most of the people who do mobilise for political action are not calling for general anarchy in their society but rather the loosening or undoing of a handful of unjust laws that make life difficult. They simply believe that a handful of state actions cut at the heart of what it means to live a life of freedom and dignity, and would like those laws undone.States like Tanzania and Kenya recognise that outrightly authoritarian laws will invite sharp criticism and resistance at home and abroad, so they focus on passing many seemingly innocuous laws that constrain everyday behaviour. Freedom of expression is a particularly soft target for such legislation because it often does not affect the financial wellbeing of citizens, so most unengaged citizens can dismiss such legislation as superfluous. It is easy to argue that freedom of speech does not affect food, shelter or clothing and can, therefore, be a secondary issue.But such legislation is often a gateway to more authoritarianism - a signal that the state is already working to diminish basic rights of the citizenry. The more authoritarian the state, the more likely it is to introduce draconian laws on even the most basic things. In Tanzania, the state now wants to be the final word on how people in Tanzania count, to be the final authority on how information on who Tanzania is prepared and disseminated. Beyond the statistical law, the current administration has also introduced punitive taxes starting at $900 a year on blogging to control what is said online. All of these rules are part of a growing network of invasive, dehumanising legislation that authorities can publicly say serves a public benefit, but in actual fact, is part of a broader effort of dehumanising social and political control.Significantly, because such concerns are increasingly dismissed as secondary, those who speak up against these laws are perceived to be increasingly irrational and focusing on \"unnecessary\" things. On October 31, Zitto Kabwe, a leader of the ACT opposition movement in Tanzania, was detained for questioning following a press conference in which he accused the police of killing dozens of residents of Kigoma, where he is a legislator, during an operation to address illegal grazing. The police have, to date, declined to issue a statement regarding the alleged killings and Kabwe urged them to do so. Kabwe was charged with three counts of incitement and released on bail on November 2. His supporters insist he was detained and continue to be persecuted simply for challenging the official state narrative.Last year, Kabwe was detained and questioned over issuing \"false statistics\" on economic growth. This is a symptom of creeping authoritarianism, and by extension, subtle dehumanisation of the state's victims and those who would speak up for them.Undoubtedly, the detention of such a high-profile figure is designed to intimidate lower-profile individuals that may want to challenge the government on other issues. It shows the extent to which the state is willing to go in order to maintain absolute authority over the country's narrative. But it is also a demonstration of how ill-informed and clumsy authoritarianism by legislation can be.Kabwe is a legislator - it is his job to ask such uncomfortable questions of the government. Yet, a blanket law challenging how information is produced and disseminated cannot make distinctions between a blogger producing fake news and a legislator doing his job. As numerous Tanzanian activists have pointed out, this is a symptom of democracy in decline.In international law, concepts like freedom of expression used to be called \"subsidiary rights\" - secondary concerns that should be addressed but only after basic rights like food, shelter and clothing have been taken care of. But looking back on the last 60 years of political organisation, it is apparent that if these rights are addressed, if people are able to exist in the fullness of their humanity, they would often find creative and innovative ways to claim their basic rights. Of course, there are many institutions that recognise that it doesn't have to be an either/or conversation, but this week's developments in Tanzania, and the increasing prevalence of authoritarianism by legislation in the region and around the world is a reminder to all of us to remain vigilant. The views expressed in this article are the author's own and do not necessarily reflect Al Jazeera's editorial stance.Nanjala Nyabola is a political analyst and the author of the forthcoming book \"Digital Democracy, Analogue Politics\". The Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.From Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}