{"id": "What's happening in Sri Lanka? All questions answered", "paragraph": "Here's how the constitutional crisis in Sri Lanka has unfolded, what's at stake if it drags on, and what to expect next.The surprise sacking of a prime minister; the return of a controversial leader; mass protests; a deadly shooting and warnings of a \"bloodbath\" - in just a few days, Sri Lanka has plunged into a bitter power struggle that risks undermining stability in the South Asian nation.Here's how the political crisis has unfolded and what is at stake if it drags on.The turmoil started on Friday when, in a surprise move, President Maithripala Sirisena sacked Prime Minister Ranil Wickremesinghe and replaced him with Mahinda Rajapaksa - a former president he had defeated in a 2015 election - in a hurried ceremony in the capital, Colombo.Wickremesinghe, who was touring the country's south, returned to the capital immediately, denouncing what he said was an unconstitutional and illegal move by Sirisena.He insisted he was the lawful prime minister and called for a parliament sitting to prove his majority. Sirisena responded by suspending parliament until November 16, in a move critics said was aimed at shoring up support for Rajapaksa, a popular leader who is credited with ending Sri Lanka's 26-year long civil war, but is also accused of grave human rights abuses and corruption.All eyes are on legislators as two prime ministers claim legitimacy [Dinuka Liyanawatte/Reuters]The shock moves over the weekend marked a dramatic fallout for Sirisena and Wickremesinghe, two former allies who took office in 2015 promising economic reforms, a crackdown on corruption and accountability for alleged crimes committed at the close of the country's civil war in 2009.But after assuming power, the pair shared a rocky relationship, clashing over the economy and the day-to-day administration of government. In recent days, Sirisena went on to accuse an unnamed member of Wickremesinghe's cabinet of involvement in an alleged assassination plot against him.\"Under these political problems, economic troubles and the strong plot to assassinate me, the only alternative open to me was to invite former President Mahinda Rajapaksa and appoint him as prime minister to form a new government,\" Sirisena said on Sunday.The crisis turned deadly on Sunday when the bodyguard of a deposed minister shot at a crowd of people who tried to prevent the official from entering his office. At least one man was killed and two others were wounded in the shooting.Speaker Karu Jayasuriya, who has refused to recognise Rajapaksa, has warned that unless parliament reconvenes the political deadlock may devolve into a \"bloodbath\".Human rights groups, meanwhile, have raised the alarm over Rajapaksa's return to power, pointing to allegations of war crimes against ethnic Tamils and people suspected of links to Tamil separatists during the country's civil war, as well as harassment and arrests of journalists, activists and dissidents during his decade-long rule.Amnesty International has also expressed concern over reports of Rajapaksa loyalists seizing state media amid the crisis.Others say Sri Lanka's very democracy is at stake. The country is South Asia's oldest democracy, albeit imperfect and fragile. A group of prominent students characterised Wickremesinghe's ouster as the first \"illegal\" transfer of power in the country since independence in 1948.On Tuesday, tens of thousands of people in Colombo protested against Sirisena's \"coup\", demanding the president reconvene parliament and allow legislators to choose between Wickremesinghe and Rajapaksa.Meanwhile, the country's already struggling economy has come under further strain from the political turmoil: The Sri Lankan rupee slumped to a record low of 174.75 a dollar on Tuesday, while several countries have issued travel advisories urging caution while travelling to Sri Lanka.Sri Lanka is a key country in India and China's rivalry for control of the Indian Ocean. New Delhi said it was following developments in Colombo closely, adding that it hoped parties respect democratic values and the constitutional process.For its part, China has been one of the few countries to congratulate Rajapaksa - the former president had moved Sri Lanka closer to Beijing during his 2005-2015 rule - while also calling for dialogue.Meanwhile, several Western countries have expressed concern, with the United States backing Wickremesinghe's call to resume parliament.The United Nations and European nations, including the United Kingdom, France and Germany, urged all sides to refrain from violence.With two political rivals claiming to be the legitimate prime ministers, all eyes now are on the country's legislators.Wickremesinghe appears to have a narrow edge in the parliament. Prior to the crisis, his United National Party (UNP) had 105 legislators in the 225-member House, while Sirisena and Rajapaksa's United People's Freedom Alliance (UPFA) had 95.Some 126 legislators from the UNP and two minority parties, the Tamil National Alliance and the People's Liberation Front, have sent the speaker letters urging him to recall parliament, according to Jayasuriya. Some politicians say the number is an indication of UNP's support in parliament.At least five UNP legislators have crossed over to the UPFA since the crisis began, and observers expect the horse-trading to intensify in the coming days. Analysts, meanwhile, say Wickremesinghe may lose his advantage the longer Rajapaksa is allowed to consolidate power.The army has pledged not to interfere, while Wickremesinghe's supporters say they will continue to protest his removal. Some legislators have raised the prospect of taking legal action.For his part, Rajapaksa has said his government will \"eschew politics of hate\" as well as that he plans to hold long-delayed provincial polls and call general elections as soon as possible.\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}