{"id": "US arrested 16,658 migrant family members at border in September", "paragraph": "Number represents a 31 percent increase from the previous month, and comes as Trump ramps up anti-immigrant rhetoric. US border agents arrested nearly 17,000 members of family units attempting to cross the US border with Mexico in September, a 31 percent increase over the previous month, according to official statistics released on Tuesday.In a news briefing with reporters on Tuesday, Trump administration officials pointed to the increase in migrant families as evidence of a \"border crisis\" because those groups are more difficult for immigration enforcement officials to detain and deport because of protections granted by US law to migrant children. Rights groups, however, dispute Trump's claim, saying that while there was an increase in apprehensions in 2018, overall, irregular immigration has been at a historic low over the last few years.The Trump administration expressed alarm at the change in the makeup of migrants attempting to cross into the United States from mostly single adults to children and families travelling together.About 40 percent of those apprehended in the fiscal years 2017 and 2018 were unaccompanied children or families with children, compared with 10 percent in 2012, according to the Migration Policy Institute, a non-partisan think-tank.According to numbers released on Tuesday, US border officials arrested nearly 397,000 people in total at the southern border in the 2018 fiscal year that ended September 30, an increase over the 304,000 apprehended in 2017 but largely in line with arrest trends of migrants at the US southern border over the past decade.Border arrests dropped in the months after Trump took office in January 2017 but have rebounded over the past year.Trump has vowed to begin cutting millions of dollars in aid to Central America over a caravan of thousands of mostly Honduran migrants and refugees fleeing violence and poverty at home.Earlier this year, the Trump administration tried to deter families from travelling to the border by instituting a \"zero tolerance\" policy, which included separating thousands of children from their parents as the adults were prosecuted.About 2,500 children and parents were separated before Trump abandoned the practice in June after a public outcry. A federal judge ordered the families reunited, a process that is still incomplete, with hundreds of children still separated from their families.Earlier this month, the Washington Post reported that the White House was considering plans that may result in family separations. Citing officials briefed on the issues, the Post said the Trump administration was looking at potentially asking detained asylum seekers to choose between staying in detention with their children for an indefinite period of time or allowing their children to be sent to government shelters where family members could seek custody.  Hogan Gifly, White House deputy press secretary, told the newspaper in a statement at the time that \"career law enforcement professionals in the US government are working to analyse and evaluate options that would protect the American people, prevent the horrific actions of child smuggling, and stop drug cartels from pouring into our communities.\" In Texas's Rio Grande Valley (RGV), where more migrants are arrested crossing between official ports of entry than in any other section of the 2,000-mile-long (3,200-km) border with Mexico, apprehensions continued to rise in October, said the Border Patrol sector's Chief Patrol Agent Manuel Padilla.There were over 12,700 arrests in the RGV during the first three weeks of October, marking a 112 percent increase over the same period in 2017, Padilla said in a phone interview.Sixty-four percent of those detentions were of family members or unaccompanied children from countries other than Mexico, up from a rate of 51 percent in all of the fiscal year 2018, Padilla said.More than 5,400 family units were detained in the first half of October, up 300 percent from the same period in 2017.\"Right now we're at maximum capacity when it comes to detention, and so is ICE [US Immigration and Customs Enforcement]. Our detention capacity is just breaking at the seams,\" said Padilla, predicting border-wide family apprehensions would rise again in October. \"This is not sustainable.\"\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}