{"id": " Five things you should know about the US progressive surge", "paragraph": "After the election of US President Donald Trump, the US saw an historic uptick in interest in left-wing groups.Protests enveloped Washington, DC and other cities, where the streets teemed with hundreds of thousands of demonstrators on January 20, 2017, when Donald Trump was sworn in as the United States's 45th president.Angry rallygoers stuffed airports nationwide the following month, when the newly minted Trump administration introduced an executive order banning entry to the US for travellers from several Muslim-majority countries.With public furore generated by the president's anti-immigration programme, anti-Muslim policies, controversial remarks about women and flirtation with white nationalists, the political landscape was primed for change.In the early months of Trump's presidency, membership in several left-wing outfits flourished, while progressives vied to chart an alternative path within the Democratic Party.More recently, Democratic Socialists of America-backed candidates garnered a flurry of media attention in primary elections, during which many of them challenged - and some bested - centrist Democratic incumbents.On November 6, Americans will cast their ballot in midterm elections largely understood to be a referendum on Trump's presidency. But after months of upheaval in the Democratic Party, with young progressives seeking to displace party longtimers, there is heightened attention on a surge in left-wing newcomers. We break down the five things you should know about the US progressive surge: When Trump became president after a heated campaign taking aim at immigrants, Muslims, women and others, the US saw an historic uptick in interest in left-wing groups.Bernie Sanders, who unsuccessfully challenged Hillary Clinton in the 2016 Democratic primaries, describes himself as a democratic socialist and has been a senator for Vermont since 2007. His 2016 primary campaign saw a swell in support, particularly from young people.The Democratic Socialists of America (DSA), founded by Michael Harrington in 1982, more than doubled from May 2016 to February 2017, reaching 16,000 members. The growth continued at a breakneck pace, touching 32,000 by the end of 2017.Now, the group estimates that it has 50,000 members across the country and describes itself as the largest socialist outfit in the US.Though not a political party, the DSA endorses candidates with politics that align with the organisation's. Those candidates share the DSA's views on broadening access to healthcare and education, opposing capitalism and US wars, and advocating for labour rights, among other issues.Earlier this year, DSA-backed candidate Alexandria Ocasio-Cortez defeated Democratic incumbent Joe Crowley in the Democratic Party primary election for New York's 14th District in the House of Representatives.Her victory was celebrated by advocates as a step in the direction of creating a society more broadly able to provide a decent life for the many.Alexandria Ocasio-Cortez defeated Democratic incumbent Joe Crowley in the Democratic Party primary election for New York's 14th District [Scott Eisen/Getty Images/AFP]But while the DSA has received the lion's share of attention in discussions about socialism in the Trump era, several other groups and parties reported increased membership in the wake of the president's election. Among them were the International Socialist Organization, Socialist Alternative and the Socialist Party USA.Socialist organising is nothing new in the US. Its roots can be traced back to the 19th century, when immigrant communities arriving in the country played a vital role in its inception and growth.In 1901, the Socialist Party of America was founded after a merger of previously existing socialist groups. During that era, several socialist politicians landed in office.In 1910, Victor L Berger became the first socialist elected to US Congress after winning Wisconsin's 5th District Congressional seat. In New York, Meyor London became the second socialist elected to Congress in 1914. In the 1912 and 1920 elections Eugene V Debs, a socialist icon who ran for president five times, pulled in more than 900,000 votes. His Socialist Party of America's membership peaked in 1912 at around 118,000. During that period, socialists played an active role in campaigning against the US's entry into World War I. Many of them were jailed over that advocacy, owing to the Espionage Act.In June 1917, more than 2,000 protesters were jailed for rallying against US participation in the war. Debs himself was arrested and put on trial in September 1918 on 10 counts of violating the Espionage and Sedition acts. He was sentenced to 10 years in prison and campaigned for the presidency from behind bars in 1920. His sentence was commuted, and he was released from jail in 1921.Crackdowns on socialist organising continued throughout the 20th century, most notably during the \"Second Red Scare\", a period during which US Senator Joseph McCarthy led a far-reaching campaign against leftists.At the time, with the Cold War in its early years, McCarthy's efforts led to the highly publicised trials - and imprisonment - of many people merely suspected of being socialists or communists.During the 1960s and 1970s, the New Left saw socialists and other leftists participate in struggles for civil rights and against US wars abroad, such as the war in Vietnam. Many prominent black rights groups, such as the Black Panthers, were self-described as Marxist organisations.Later, socialists played important roles in the pushback against a slew of wars, including the first Gulf War in 1990 and the 2003 invasion of Iraq under President George W Bush.Actor Mark Ruffalo is one of many famous Americans to embrace democratic socialism in recent years, along with fellow actor Wallace Shawn, acclaimed author Angela Davis, writer Barbara Ehrenreich, and many others.But they follow in the footsteps of largely celebrated socialists and others who embraced elements of socialism.Civil rights activist Martin Luther King Jr was a staunch opponent of capitalism, who often sang the praises of socialism and an end to the class system. \"I am much more socialistic in my economic theory than capitalistic,\" he famously told a girlfriend. Later, he called for a politics that waged war on both racism and poverty, supported a guaranteed annual income, advocated constitutional amendments to secure economic equality and pushed for an expansion of public housing.Hellen Keller, the first deaf-blind person to earn a Bachelor of Arts degree and celebrated writer, was an active socialist until her death in 1968. A member of the Socialist Party of America and the Industrial Workers of the World, Keller actively campaigned for women's suffrage, labour rights and anti-war causes, among others.Albert Einstein, the legendary physicist, admired Soviet revolutionary Vladimir Lenin and called for the establishment of a socialist economy. Writing for the Monthly Review, a socialist publication, Einstein stated: \"I am convinced there is only one way to eliminate these grave evils, namely through the establishment of a socialist economy, accompanied by an educational system which would be oriented toward social goals. In such an economy, the means of production are owned by society itself and are utilized in a planned fashion.\"Albert EinsteinThese views led to the FBI keeping a file on him that eventually amassed some 1,400 pages.Less than half of Americans between 18 and 29 embrace capitalism, according to an August 2018 poll by Gallup. The poll marked a 12-point decline from a previous survey in 2010, when 68 percent of young Americans viewed capitalism positively.That same poll found that 51 percent of young people view socialism favourably. The increase came owing to growing costs of living, stagnant salaries, increasing healthcare costs, dwindling pensions and the need to take on second jobs to make ends meet.Earlier this year, a University of Chicago GenForward Survey of Americans found that 62 percent of respondents between 18 and 34 years old believe that the US needs \"a strong government to handle today's complex economic problems\".That survey concluded that 45 percent of young Americans view socialism favourably, contrasted with a previous poll that found that 26 percent of their parents' generation would prefer to live in a socialist country.Meanwhile, a 2016 survey published by Stanford University found that Americans entering the job market \"are far less likely to earn more than their parents when compared with children born two generations before them\".Although the current surge has elicited widespread attention, not all of it has been positive. When DSA-backed Ocasio-Cortez's decried Israel's response to Palestinian protests in the Gaza Strip and was criticised, she replied by admitting that she is not \"an expert on geopolitics on this issue\". It led critics to lambast the faces of the nascent left-wing surge as unserious.The primary campaign of Julia Salazar, another DSA-backed candidate for New York State Senate, was marred in controversy after a string of news reports accused her of falsifying her background, a charge she rejected and chalked up to misreporting and confusion.Others have charged the left with either being implausible in the US, where history has been less than kind to self-described socialists, or out-of-tune with the priorities of most American voters. In a country whose history and ethos are so intimately tied to capitalism and individualism, critics say, socialism could not work in practice.For his part, Trump has attempted to brand his opponents as radicals, alleging on several occasions that his detractors were \"paid\" protesters or \"professional anarchists\".With US midterms approaching, Trump's current approval rating hovers just below 43 percent, a fact large enough to cast hesitation on the longevity of the progressive uptick. Unemployment is low, sitting below four percent, and it remains unclear how widespread a traction the new progressives can command.\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}