{"id": "South Sudan: Riek Machar to return to Juba for peace ceremony", "paragraph": "Machar fled South Sudan's capital two years ago under a hail of gunfire when an earlier peace deal collapsed.\r\nSouth Sudan's main rebel leader Riek Machar will return to the capital, Juba, on Wednesday to take part in a peace ceremony, more than two years after he fled the country following the collapse of a power-sharing deal.Machar last month signed a peace deal with South Sudan's President Salva Kiir in Ethiopia to end a ruinous five-year war that killed tens of thousands and forced millions from their homes.\"Machar will lead a delegation of the SPLM/A-IO members for the peace celebration in Juba, but the programme in Juba is entirely in the hands of the regime,\" group spokesperson Lam Paul Gabriel said in a statement on Tuesday.Along with Kiir and Machar, a number of regional heads of state are also expected at the ceremony to publicly welcome the most recent peace agreement, which was approved in August before being signed in Ethiopia's capital, Addis Ababa. Machar's previous homecoming, in April 2016, was put off by wrangling over how many bodyguards he could bring with him and what weapons they would carry, but Gabriel said this time the rebel leader would be accompanied by only around 30 political figures.\"We are worried for his security in Juba, but the truth is here: we are for peace, and what we are trying to do is build trust,\" Machar's spokesperson said. \"So that is why he is able to leave his forces behind and just go with politicians. Two years after gaining independence, South Sudan descended into civil war in December 2013 when Kiir accused his then-deputy, Machar, of plotting a coup.Ethnically-charged fighting soon spread from the capital across the impoverished state, shutting down oil fields, forcing millions to flee and killing tens of thousands of people.A power-sharing deal that returned Machar to the vice presidency was signed in 2015. But it collapsed a year later in a deadly battle that saw Machar flee into exile in the Democratic Republic of the Congo.He later travelled to South Africa where he was held under house arrest until peace talks started again in June, sponsored by the Intergovernmental Authority on Development, a regional bloc.Talk to Al JazeeraSalva Kiir and Riek Machar: South Sudan's shaky peace\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}