{"id": "N Ireland: KKK incident at Islamic centre probed as hate crime", "paragraph": "Investigation under way after several people dressed in costumes of white supremacist group pose outside Islamic centre.A group of at least eight people dressed as Ku Klux Klan (KKK) members posed outside an Islamic centre in a Northern Irish town over the weekend, in an incident that is being treated by police as a hate crime.A picture published on social media showed the group, also carrying crucifixes, close to the Bangladesh Islamic Centre in Newtownards, east of Belfast, on Saturday.A pig's head was left outside the same centre in August last year, according to British media.\"We are treating this as a hate crime,\" Inspector Richard Murray, from the Police Service of Northern Ireland, said in a statement on Tuesday.The KKK is a white supremacist group founded in the 19th century after the abolition of slavery in the United States.The group also posed for pictures at a pub in the town with Sharon Mellor, the girlfriend of Tony Martin, leader of the fringe far-right group National Front, the Belfast Telegraph reported.The newspaper published a picture showing Mellor with someone dressed in a KKK costume spattered with what looked like blood and holding a beer.She told the paper the people were \"random strangers\".\"A few blokes were dressed up for Halloween, no idea who they were,\" she said.The paper said Mellor \"joked\" three years ago about having tried to set fire to the Islamic centre in the town.One of the pubs the group entered on Saturday night was The Spirit Merchant owned by the JD Wetherspoon chain.Wetherspoon spokesperson Eddie Gershon said: \"We can confirm that a group dressed in KKK clothing came to our pub.\"They were refused entry by door staff but pushed past them into the pub. They were told by bar staff that they would not be served. They remained in the pub for five minutes, unserved, and then left.\"\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}