{"id": "Why is it raining so much in Qatar this season?", "paragraph": "Al Jazeera explores if this year's repeated floods in the Middle East are an aberration or part of a trend.After a dry \"rainy season\" last year, Qatar this year has seen abnormally early thunderstorms and rains starting last month.In less than three weeks, there has been 136mm of rainfall, while the annual average for capital Doha is around 75mm. Just three days of thunderstorms produced 89mm of rain.In records going back to 1962, no significant rain was recorded in the months of June to September in Doha. October in 1977 was wet, but with just 17.3mm of rain.The rainy season in Qatar is influenced by the Indian monsoon. In the summer, the extensive Tibetan plateau, \"the roof of the world\", acts as the driving force for the monsoon and a suppressor of rainfall throughout the Middle East.As the sun heads south, Eurasia gets colder and there is no longer a big summer monsoon system in action. This is the time when autumn storm systems leave Europe and across the Levant.Fronts of colder air then thrust down into the Arabian Peninsula, as happened in October this year, which also coincided with another weather event.At the same time, tropical cyclone Luban made landfall over eastern Yemen on October 14 and dissipated over land, spreading vast amounts of moisture into the atmosphere.Days later, some of that moisture also reached the Gulf states.The combination of the first autumn breakout from Europe and the injection of moisture from cyclone Luban was the reason for the downpours and extensive flooding in Qatar on October 21.The consequent thunder outbreaks that occurred on October 28 and 29 and ongoing since November 11, seem to have no abnormal driving force.There is one thing to consider though: climate change.The weather patterns around the northern hemisphere have shown an increasing trend towards being static. In other words, the same sort of weather sits over the same region for days or weeks on end.This is currently the case over Europe, resulting in a train of depressions from the Atlantic being directed northeastwards over Western Europe.The quiet weather in Eastern Europe allows the naturally occurring showers over western Iran and the Gulf and storm systems over the eastern Mediterranean to keep going without suppression.However, the trend in climate change models points to a reduction in average rainfall over the Middle East and a general rise in temperature.It also allows for any rain that falls to be more intense. We may just be seeing a natural variation in the weather being enhanced by a changing climate.\r\n            SOURCE:\r\n            Al Jazeera\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}