{"id": "Does Europe need its own army?", "paragraph": "Most Searched12 Nov 2018 21:22 GMT United States, Donald Trump, Emmanuel Macron, EuropeFrench President Emmanuel Macron and his US counterpart, Donald Trump, have been at odds on many issues.This week, that divide stretched further when Macron appeared to call for the creation of a European army in an interview on French radio, saying that the continent could no longer rely on the support of the United States in defence matters.In the same interview, Macron also spoke about cybersecurity threats and France having \"to protect [itself] with respect to China, Russia and even the United States\" - comments that were apparently taken out of context by many, including Trump, amid suggestions in media reports that the French president had named the three countries as military threats.But the two leaders differ on much more than just defence.Trump has pulled out of a number of global treaties, from the Paris climate agreement to the Iran nuclear deal and recently announced plans to withdraw from a decades-old nuclear disarmament treaty with Russia.Meanwhile, Macron has repeatedly emphasised the need for a global order and the rejection of nationalism. He did so again during Sunday's remembrance ceremony in Paris to mark the 100th anniversary of the end of World War I.But can Europe do without the US in matters of defence?Presenter: Richelle CareyGuests: Renaud Girard - chief foreign correspondent at Le Figaro newspaperDavid DesRoches - associate professor at the National Defense University and former Pentagon officialGlenn Diesen - professor of international relations at Higher School of Economics in MoscowSource: Al Jazeera NewsPresident Trump says it's time for the US to end the arms pact it signed with Russia more than 30 years ago.United States, Russia, US & Canada, Nuclear weaponsUS President Donald Trump accuses allies in the military alliance of failing to adequately pay for their protection.United States, Donald Trump\r\n      Commenting has been disabled. To find out more, click      \r\n      here.\r\n     The Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nInteractive, Philippines, EnvironmentRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.Europe, Russia, Saudi ArabiaFrom Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.Environment, Native Americans, US & CanadaAnswer as many correct questions as you can and see where your country ranks in the global cost of living.InteractivePresident Trump says it's time for the US to end the arms pact it signed with Russia more than 30 years ago.United States, Russia, US & Canada, Nuclear weaponsUS President Donald Trump accuses allies in the military alliance of failing to adequately pay for their protection.United States, Donald TrumpStatement comes after US media reports say CIA has concluded Saudi crown prince ordered Khashoggi's murder.Jamal Khashoggi, Middle East, Saudi Arabia, Turkey, Journalism Is Not A CrimeThousands of people blocked roads across France during 'yellow vest' demonstrations against the rising price of fuel.France, Business & Economy, Emmanuel Macron, EuropeMeet the hardline group willing to do anything, including going against their government, to claim land for Israel. Israel, Occupied West Bank, Middle EastMoroccan dissident Abraham Serfaty was jailed, tortured and exiled for his radical views over decades.History, Morocco, Human RightsAn insight into the Trump administration's relationship with the religious right and implications for US politics.Religion, Donald Trump, US Midterms 2018In an age of non-stop news feeds and disposable media, which stories and images stay with us and how do they shape us?Journalism, Humanitarian crises, Media\n \n\t\t\t© 2018 Al Jazeera Media Network\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t "}