{"id": "Palestinian 'geeks' code their way to a better future in Gaza", "paragraph": "Coding is empowering a new generation of Palestinians in the besieged Gaza Strip and helping many find work.Gaza - When Yasmin Helles was an English literature student at a Gaza college, she would spend most of her time online looking for information that could help her in academic life.She always wondered who designed these websites, making all this information available.She wanted to become that person.Six months ago, the 24-year-old saw an advertisement by Gaza Sky Geeks (GSG), a rapidly growing business and tech incubator, calling for young graduates to enrol in the first coding school in the beleaguered Palestinian territory, which only recently saw yet another round of deadly Israeli air raids.Helles took the unexpected step of quitting her job as an English teacher to spend more time pursuing her dream.Now, she has joined the coding academy.\"I said to myself 'Yes, that was what I wanted,'\" Helles told Al Jazeera in GSG's main room, a computer lab, taking a respite from typing lines of code.Ibrahim Al-Sheik, 23-year-old computer engineering graduateGaza is home to roughly 2 million people and experiences one of the highest unemployment rates in the world - more than 50 percent are without work.The unemployment is a product of its isolation. Gaza has been under an Israeli blockade, assisted by Egypt under the governments of former President Hosni Mubarak and current leader Abdel Fattah el-Sisi, since 2007.But Gazans are finding opportunities beyond the besieged strip. There is a rise in entrepreneurial start-ups and tech accelerators, providing residents of the strip with outside opportunities previously unavailable.   GSG's coding school was established in 2017 with funding from the likes of Google and London-based coding boot camp Founders & Coders. It aims to empower students to be full-stack developers, which means they will be able to handle software building for mobile, computer and web.Graduates learn to deploy production-grade software online and secure high-quality jobs with companies or work as freelance developers.To join the academy, one doesn't have to have a prior technical background; it requires full-time availability, English language skills at an intermediate level and the motivation to become a professional software developer. It teaches programming to anyone regardless of their specialisation and technical knowledge.The academy also values equality. Gender parity is required for those who enrol in its 16 seats, a rare thing in the conservative Gaza Strip.Though Helles had no previous experience in coding, she challenged herself and qualified for enrolment, winning a seat out of the eight of reserved for females.In comparison, a Reuters report from May showed that about \"one in three employees at Google, Facebook and Apple is a woman\".GSG's managers boast female participation in their programme is higher than in Silicon Valley, Helles said.Helles expressed her pride in being one of the girls involved in the tech industry, which is largely a male-dominated, tiny field in Gaza.The curriculum is taught in peer-led, project-based groups of four students. They make up the teams which find problems and solve them in logical ways to finally design a website.Students in the academy study the same curriculum taught in the Founder & Coders, a UK-based coding school.   Because the coding programme is part of an international organisation, foreign mentors and facilitators can obtain Israeli permits to regularly enter Gaza to follow the process of the curriculum.Once they complete the programme, graduates are competent full-stack developers able to work in big teams, build complete prototypes in order to test their ideas, work with clients and manage the life cycle of a product, Helles explained.Gaza's already high unemployment is even worse among the youth, reaching 70 percent, according to recent numbers by the World Bank.Ambitious and smart graduates like Helles who are fortunate enough to attend GSG see the coding boot camp as a sliver of hope that prevents them from joining the army of unemployed.The academy follows graduates in the labour market, providing them with quarterly assessments and guidance on their work.GSG also tracks their progress in the market as a means of support, whether they are working in companies, ministries and banks or as freelancers who find work online.In addition to the blockade, and the recent flare-up of violence, the Gaza Strip has suffered three Israeli wars that severely damaged its infrastructure. Israeli restrictions and intra-Palestinian fighting between Hamas and the West Bank-based Palestinian Authority impede infrastructure rehabilitation.Electricity is available for four hours a day, water is undrinkable and travel is severely limited.These issues worsen Gaza's dire economic situation. While general unemployment sits at 50 percent, the youth unemployment rate is roughly 70 percent, economist and media official from the Gaza Chamber of Commerce and Industry, Maher Tabaa, told Al Jazeera.Demand for jobs is higher than supply, Tabaa continued, causing graduates to work at low wages despite their high qualifications.There are about five tech and business incubators and accelerators in Gaza, but there is no estimate of the job opportunities they create.These tech accelerators have helped Gaza find success in the field of software and information technology despite the scarcity of possibilities, Tabaa continued.Ibrahim Al-Sheik, 23-year-old computer engineering graduate from Gaza's Al-Azhar University, told Al Jazeera that writing code has proven to be the fastest way to find work in the besieged strip.His time with GSG not only helped him find work, but also equipped him with a skillset to succeed.\"It was a wonderful experience that had a positive impact on my personality,\" Sheik said of his participation in the programming camp.Through his time at the academy, he learned skills like \"self-confidence, self-reliance, teamwork, and good communication with clients,\" all while improving his English. The Academy has added a lot to me,\" Sheik said.Sheik is using these skills for the benefit of others. He created a chat website to connect patients dealing with mental health issues with doctors who provide online consultations.\"I'm proud that I can now build a mobile app to serve a large slice of people who need it.\"GSG's coding school is free, but enrolees are required to transfer what they learned to the students in the next cohort.Sheik looks forward to passing the skills and knowledge he learned from the GSG programme.\r\n            SOURCE: Al Jazeera News\nThe Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.From Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}