{"id": "Where does the future of the American left lie?", "paragraph": "Ordinary Americans, not elected officials, will determine the future of progressive politics in the US.Two weeks before the November 6 midterm elections, the White House released a special report by the Council of Economic Advisers (CEA) on the opportunity costs of socialism in response to what they call its \"comeback\" in American political discourse. The timing of the report was no coincidence. Left-wing ideas such as universal healthcare, fully funded public education and the abolishment of ICE were at the forefront of midterm debates. And indeed, on November 6, American voters elected two socialist women of colour, Rashida Tlaib and Alexandria Ocasio-Cortez, to Congress. Their historic wins are a true sign of shifting political terrains in the United States. Everyday people are now embracing real left-wing politics, and this has the capitalist class shaking in their boots.The CEA report is one of the many examples of the far-right red-baiting aimed to scare people away from socialist politics. Resources are scant, they argue, so fascism, not equality, is the way out of poverty. Meanwhile, Wall Street Democrats are clinging to a moderate agenda rooted in corporate interests. Giving millions to big business owners, they say, is the best way to get everyday Americans back on their feet.Still, in the face of these powerful forces of opposition, the American people elected some of the most progressive politicians we've seen in decades. With Tlaib and Ocasio-Cortez set to enter the House of Representatives, alongside Bernie Sanders in Senate, we now have three openly socialist politicians in Congress - the most in US history - and even more socialist politicians in local offices across the country.But the ability of these elected officials to realise the progressive platforms on which they ran will ultimately come down to what we, ordinary citizens, do. It is on us to continue to organise - to march, knock on doors and fight for a political agenda that puts the needs of working-class people over big corporations.  It is very clear that Americans across the political spectrum are ready for something different. In fact, neoliberal policies are less popular than ever before. Seventy percent of Americans support a single-payer healthcare system. More Americans disapprove of the controversial GOP tax-reduction package than approve of it. Among young people, socialism is now more popular than capitalism. The right's ideas are unpopular. So unpopular that, in many places this election cycle (and around the world), far right candidates didn't even campaign on them. Fully aware that the support for their political demands is waning, they instead chose to lie, incite racism and rig the election to assume or maintain power.Here in Florida, GOP gubernatorial candidate, Ron Desantis, followed this playbook to a T. Instead of presenting policy proposals to win over voters, he turned his campaign into a race war, using racist dog whistles against black people, Jews, Muslims and immigrants in order to lure white voters to his side, and away from the progressive agenda of Mayor Andrew Gillum. Desantis called Gillum \"too radical\" for associating with groups like ours, the Dream Defenders. Our political platform, the Freedom Papers, which outlines a plan for quality healthcare, shelter, food, education and safety for all, became the centre of his attacks. But Desantis didn't debate the substance of the agenda itself - perhaps because he couldn't find a way to argue against a proposal to meet people's most basic needs, especially when so many are struggling to get by. So instead, he used lies and scare tactics, stirring up a racist frenzy promoting white nationalist violence, to steer people away from what's best for everyone, in favour of a right-wing, pro-corporate and anti-people agenda.In addition to using fear and racism, the political right also uses methods like gerrymandering, purging voter rolls, shutting down polling sites and confusing voters to suppress progressive votes and maintain their power globally as political minorities.Following such right-wing attempts to suppress votes, Florida and Georgia experienced razor-thin margins between the GOP and progressive candidates for governor. As a result, both states are now in the middle of recounts. In Florida, incumbent Republican Governor Rick Scott has equated calls to count every vote with voter fraud and an attempt by Democrats to steal the elections.While many progressive candidates scored landmark victories in the election, many others, mainly as a result of the aforementioned voter suppression methods, either narrowly lost to their right-wing opponents or are still facing a real possibility of a loss. However, rather than doubling down on a left-wing agenda that already proved its popularity among voters, and fighting against the GOP's voter suppression methods, many within the Democratic establishment are already arguing that, perhaps, some candidates were just too progressive to win. The path to defeating Trumpism and the far right in 2020, they say, is to move further to the centre. We are already seeing the Democratic establishment's attempts to take down the left-wing flank that Tlaib and Ocasio-Cortez have the potential to build within the party. Right after Democrats took back the House of Representatives, Nancy Pelosi announced that she believes \"Democrats have a responsibility to seek common ground\" with Republicans in Congress, implying that she will focus on making compromises rather than impeaching Trump. This is unacceptable and irresponsible. Our lives are on the line. And clearly, Nancy Pelosi's interests don't align with ours. It is because of political stances like hers and the Democratic establishment's overall neglect of the interests of working-class people that we've ended up with Trump in the first place.We cannot defeat fascism by moving towards the centre. Unfortunately, all too often, politicians who run on left-wing platforms opportunistically move towards the centre for the sake of their \"career\" once they are elected. But ultimately, whether or not the progressives we fought to elect will be able to realise the platforms they ran on is not so much a matter of what they do once in office, but a matter of what we do. For progressive politics to succeed, we - as the people - need to change our attitude towards electoral politics. We need to understand that electing a candidate is not a matter of choosing a champion or a supreme leader. It's a matter of choosing our best opponent. At times, we will organise with these elected officials to bring about real change, but at other times, we will organise against them to achieve the same. It is our responsibility to build the necessary power to hold them accountable to the needs of working people and not corporate interests.Midterm voter turnout hit a 50-year high in 2018, with more than 47 percent of the voting-eligible population casting a ballot. However, more than half of Americans still did not go to the polls, likely because of how disillusioned they are by the entire political system. Grassroots movements should seize this opportunity and work tirelessly to convince these disillusioned Americans that they, and no one else, have the power to change our world.We cannot fight fascism with neoliberalism or by entrusting our fate in the hands of a few politicians. Our only fighting chance is to build power. In the face of rising violence and efforts to make everyday people turn their back on one another, so we don’t rise up against the one percent, we must bring people together across race, religion and borders to struggle towards long-term political unity. In the spirit of Fred Hampton and the Black Panther Party, we must reignite the Rainbow Coalition, a 1960s Chicago-based alliance between young people in Black, poor white and Puerto Rican communities. The Rainbow Coalition was a real threat to the established powers in Chicago and across the country because it helped people find common fate and move a shared agenda across difference.Solidarity among working people in the US and around the world is our only way out. Together, we need to organise our neighbours, plan marches and use boycotts and direct actions to advance a shared, progressive agenda that would benefit us all. We must be clear and unapologetic in what it means to be leftist - universal healthcare, fully funded public education, an end to war and a redistribution of wealth. Ultimately, the most important takeaway from the midterm election is that we can't wait for politicians to lead. Our power lies in realising that the progressive agenda is ours to set.The views expressed in this article are the author's own and do not necessarily reflect Al Jazeera's editorial stance.Rachel Gilmer is an organiser with and the Co-Director of the Dream Defenders.\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}