{"id": "How the US media became the 'enemy of the people'", "paragraph": "Most Searched04 Nov 2018 21:49 GMT Media, Donald Trump, US Midterms 2018, Journalism, United StatesAs Americans prepare to vote in midterm elections this week, it is worth considering the stories monopolising the US airwaves recently: the coverage of the migrant caravan from Central America; the pipe bombs sent to CNN among others, and President Donald Trump's incessant tweets - all developments with significant media angles to them.Jay Rosen, journalism professor at New York University, is an academic who's been studying the US media for more than 30 years. He spoke to The Listening Post's Richard Gizbert about Trump's attacks on the mainstream media, why they work, how CNN became a hate object and the larger crisis of credibility American journalism faces today.Al Jazeera: How has Donald Trump, two years into his presidency, turned the media into such a useful enemy - perhaps the most useful political enemy of them all?Jay Rosen: Let's start with some basic facts about Donald Trump as president of the United States. One is he doesn't know anything about the issues that he must deal with. He isn't good at the job.Nothing he says can be trusted, and when you have a president like that, what's going to happen is he generates a lot of bad news for himself. He has managed to convince his supporters that this happens because the news media hates him ... And he's gone one step further to say to them \"When they criticise me, it's because they hate you.\" So, he's not only turned the press into a hate object, but he's made it the foundation of his support.Al Jazeera: On the recent migrant caravan story, Fox has plenty to answer for, but there were some other news organisations that also bought into the narrative that Trump and the Republicans were trying to push. To what extent do you think news outlets from the centre, even from the left, or near-left, are also giving this particular story outsized attention, once again allowing Trump to be the media's assignment editor?Rosen: It's very difficult for TV producers to resist that. Even something as simple as showing us on the map where those people were and how close, in fact, they were to the US border, which was one time hundreds of miles away. Even something as simple as that was too difficult for cable news producers. So, that was a case where Trump and his propaganda outmanoeuvred TV news and simply capitalised on some of its weaknesses.Al Jazeera: There's this ongoing battle between Trump and the likes of CNN. Trump screams \"fake news\", and CNN responds with a robust defence of its journalism. For those of us on the outside, this would seem to be an easy argument for CNN to win - it seems like a slam dunk. Why hasn't that been the case? Rosen: I think what you have to understand is that for this portion of the public, Trump is the major source of news about Trump, which is to say that for that part of the country, an authoritarian news system is already up and running.And in that sense, nothing CNN could say would make a bit of difference to the core of Trump's supporters who have now assimilated CNN as a symbol of everything they hate - it's a symbol of cultural elites; of the people who are in control of the system. And the paranoid style of politics that Trump practises and the conspiracy thinking that it often produces are all bound up with this mistrust of CNN.Al Jazeera: In the pieces that you posted back in 2016 after Trump won his election, you made all kinds of observations about the American media. You issued a few warnings, you offered a few bromides. But I went through the comments under the piece and one reader left one saying: \"Good luck getting the genie back in the bottle\". Does he have a point? Can what ails the US media be fixed? Rosen: Yes, he had a point. I think we're in a cycle where it's not obvious how we change it, except through political change. The fusing of the media system and the political system has proceeded to such a degree that it's very hard to imagine how just by changing practices, our press changes its status.After all, Fox News and the White House are, in a way, the same operation right now. So, I think this cycle that we're in is going to have to run its course, somehow. It's either going to have to burn out or meet with massive political change before we see any real change between the dynamic between the press and the president.This interview has been edited for clarity and brevity.Source: Al JazeeraWhat's behind Trump's attacks on the media before the US midterms? Plus, Trump and the Christian Broadcasting Network.Media, US Midterms 2018, Donald Trump, Journalism, United StatesMore than 200 journalists, mostly retired and semi-retired, released an open letter decrying Trump's press attacks.Press Freedom, United States, Donald Trump\r\n      Commenting has been disabled. To find out more, click      \r\n      here.\r\n     The Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nInteractive, Philippines, EnvironmentRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.Europe, Russia, Saudi ArabiaFrom Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.Environment, Native Americans, US & CanadaAnswer as many correct questions as you can and see where your country ranks in the global cost of living.InteractiveWhat's behind Trump's attacks on the media before the US midterms? Plus, Trump and the Christian Broadcasting Network.Media, US Midterms 2018, Donald Trump, Journalism, United StatesMore than 200 journalists, mostly retired and semi-retired, released an open letter decrying Trump's press attacks.Press Freedom, United States, Donald TrumpStatement comes after US media reports say CIA has concluded Saudi crown prince ordered Khashoggi's murder.Jamal Khashoggi, Middle East, Saudi Arabia, Turkey, Journalism Is Not A CrimeThousands of people blocked roads across France during 'yellow vest' demonstrations against the rising price of fuel.France, Business & Economy, Emmanuel Macron, EuropeMeet the hardline group willing to do anything, including going against their government, to claim land for Israel. Israel, Occupied West Bank, Middle EastMoroccan dissident Abraham Serfaty was jailed, tortured and exiled for his radical views over decades.History, Morocco, Human RightsAn insight into the Trump administration's relationship with the religious right and implications for US politics.Religion, Donald Trump, US Midterms 2018In an age of non-stop news feeds and disposable media, which stories and images stay with us and how do they shape us?Journalism, Humanitarian crises, Media\n \n\t\t\t© 2018 Al Jazeera Media Network\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t "}