{"id": "North Korea hiding missile bases in remote areas: report", "paragraph": "US think-tank names at least 13 secret bases, raising doubts over Donald Trump's signature foreign policy initiative.\r\nNorth Korea is moving ahead with its ballistic missile programme, according to a new report by a US-based think-tank which identified over a dozen small undeclared bases.Based on satellite images analysed by the Center for Strategic and International Studies (CSIS), the report detailed 13 of the suspected 20 hidden sites, which are mostly scattered in the country's remote mountainous areas.\"The ballistic missile operating bases are small, dispersed throughout the nation, and, with few exceptions, located in narrow mountain valleys,\" the report, which was released on Monday and could not be independently verified, said.The reported findings raised new doubts over US President Donald Trump's assertion that \"incredible\" progress had been made in Washington's talks with Pyongyang. Trump has hailed his June summit in Singapore with North Korean leader Kim Jong Un as having opened the way to denuclearisation of the divided peninsula, but the agreement between the two was short on specifics and negotiations have made little headway.Since that meeting, North Korea has forgone nuclear and missile tests, dismantled a missile test site and promised to also break up the country's main nuclear complex.\"North Korea's decommissioning of the Sohae satellite launch facility, while gaining much media attention, obscures the military threat to US forces and South Korea from this and other undeclared ballistic missile bases,\" the CSIS report said.\"These missile operating bases, which can be used for all classes of ballistic missile from short-range ballistic missile (SRBM) up to and including intercontinental ballistic missile (ICBM), would presumably have to be subject to declaration, verification, and dismantlement in any final and fully verifiable denuclearization deal,\" it added elsewhere.According to Mark Fitzpatrick, from the International Institute for Strategic Studies, the findings did not come as a surprise. \"North Korea said at the beginning of the year that it would continue its mass production of missiles and nuclear weapons, and what we have here are more than a dozen missile development and production sites,\" Fitzpatrick told Al Jazeera.\"I'm sure the US intelligence agencies already had a pretty good idea of these sites, and now the rest of us also have a better idea of what is going on,\" he added.Al Jazeera's Rosiland Jordan, reporting from Washington, DC, said US intelligence \"has long been aware North Korea has not dialled back its efforts to expand its nuclear or conventional missile programme\".But she added: \"One of the things that critics are seizing on with this CSIS report is that when Trump met with [North Korean leader] Kim Jong Un in Singapore earlier this year, there was no detailed agreement that was going to prevent North Korea from carrying this work\".The denuclearization deal with North Korea is being praised and celebrated all over Asia. They are so happy! Over here, in our country, some people would rather see this historic deal fail than give Trump a win, even if it does save potentially millions & millions of lives!Trump has been upbeat on the denuclearisation progress so far, as well as over his relationship with Kim, whom he once called \"Little Rocket Man\".\"You got no rockets flying, you have no missiles flying, you have no nuclear testing,\" Trump said in the Oval Office last month. \"We've made incredible progress - beyond incredible.\"But according to Fitzpatrick, the CSIS report is bound to embarrass Trump.\"I'm very pleased North Korea hasn't tested any more missiles, but while it hasn't tested them, it continues to produce them,\" Fitzpatrick said.\"Donald Trump, who declared everything is fine, now has egg on his face.\"Earlier this month, North Korea expressed dismay over tough US sanctions imposed on the country, warning that Pyongyang may revert to its former policy if the US did not change its stance.\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}