{"id": "Arab refugees in Bangkok long for home amid immigration crackdown", "paragraph": "Hundreds fled Syrian war and arrived in Thailand on tourist visas, but are now desperately trying to avoid arrest.Bangkok - Six years ago, several days after taking his high school exams, Ibrahim and his family fled Syria to Lebanon where they boarded a flight to Bangkok.Arriving in the Thai capital on tourist visas, they experienced freedom away from the horrors of war in Syria. But since their visas expired, they have been living as undocumented migrants.\"We thought of Thailand as a transit point,\" Ibrahim told Al Jazeera, \"and that we would stay one or two years. Yet after six years, our lives are stuck in limbo.\"In Thailand, Ibrahim's family applied for resettlement in the United States only to wait for two years with no progress.They then requested resettlement in Canada, restarting the entire process.In Bangkok, it takes an average of three to four years to complete the resettlement process, leaving many refugees vulnerable and frustrated. \"We'd love to live here, it's like the Middle East. People are friendly and will talk to you, unlike people in Europe who won't say hello,\" said Ibrahim. \"We no longer dream of peace, only of a passport.\"Thailand is not a signatory to the 1951 UN Refugee Convention and the Thai Immigration Act of 1979 views anyone overstaying their visa as an undocumented migrant, including asylum seekers and refugees.The UNHCR told Al Jazeera that Thailand is home to 103,000 refugees with an estimated 6,000 urban refugees from countries including Pakistan, Somalia, Vietnam, Cambodia, Iraq, and Syria.Thailand was among the last countries to maintain a consulate in Damascus, making it an obtainable visa at a time when doors were shutting to those fleeing Syria.Mirvat came to Thailand in 2012 soon after graduating from Damascus University. Six years later, she remains in Bangkok where she has had four children but has not been able to pursue her career. \"The most difficult thing is that our kids can't attend school and have nothing to do,\" she told Al Jazeera. The greatest fear facing Bangkok's urban refugees is arrest and as a result, many stay inside their homes for long stretches of time.\"I can no longer go to the market and am scared to go to the hospital. We feel scared by everything,\" said Mivrat.Refugees' fears have recently been heightened by a major police operation that began in October with the appointment of Surachet Hakparn, the new immigration bureau commissioner of the Royal Thai Police. \"Operation X-Ray Outlaw Foreigner\" aims to round up and detain undocumented migrants, with asylum seekers and refugees caught up in the clampdown.Police raids have led to hundreds of refugees and asylum seekers being held at immigration detention centres.Last month, the immigration bureau also revoked bail for undocumented migrants who could have previously been released on 50,000 baht ($1,500).An estimated 200 refugees from Syria were among those summoned back into detention.Evan Jones, Asia Pacific Refugee Rights NetworkRefugees previously granted bail are now subject to increased harassment and arrest, said migrants and rights groups.\"The immigration detention centre is not designed for long-term stay, but hundreds of detainees stay for more than one year,\" Puttanee Kangkun of Fortify Rights told Al Jazeera.Most are overcrowded with more than 300 detainees held in a cell designed for 70 inmates. In violation of children's rights under international law, children are separated from parents and siblings while unaccompanied boys under the age of 12 are held alongside adult men.Officially, Thai authorities claim that some refugees have fake UNHCR cards and that the operation will check their documents, and re-release genuine asylum seekers on bail.However, local refugee rights groups told Al Jazeera on condition of anonymity that they were sceptical, noting that the Thai government works closely with UNHCR and can easily check its database. \"Beside the UNHCR card, which has almost no meaning under domestic legal provisions, [refugees] have no other legal protection,\" said Puttanee Kangkun.The hostile environment has made a bad situation worse for refugees. Over the past year, Thai immigration police have targeted African immigrants in Bangkok in what has been criticised as racial profiling. Compared with Somali, Nigerian and other African nationalities, Arabs have had moments where they were able to evade authorities more easily and enjoy some degree of greater freedom.Ibrahim and his mother used to supplement their remittances by selling Arab street food including shawarma, hummus, and bread at community events and near local mosques. But the recent clampdown on immigration has put a stop to this.Basil, a 20-year old Palestinian refugee from Syria, explained: \"For a long time, I could go out, eat, party and have a life here. But that has all changed now.\"\"Soi Arab\", the Middle Eastern quarter in the heart of Bangkok's tourist district of Nana, is home to restaurants where young Syrian and Palestinian refugees work without documentation. \"I was paid 250 baht ($7.50) a day for a 12-hour shift washing dishes and the owner gave leftover food for me and my family,\" said Basil. Yet recently, fearing police raids, owners are asking refugee workers to stay home. \"Nobody is working now,\" said Basil.Despite the recent immigration raids, refugees Al Jazeera spoke to were not critical of the Thai government. \"We feel abandoned by the United Nations,\" said Mivrat. \"We do not ask for money, only to be resettled.\"Sources told Al Jazeera that around 20 percent of the refugees from Syria in Thailand have been resettled, which is high compared with the less than 1 percent global average for third country resettlement. The majority were Syrian passport holders, with only around 50 individuals left in Thailand.Those stuck in Bangkok are primarily Palestinian refugees whose options are more limited. No Palestinian refugees have been resettled in 2018, while resettlement to the US has ground to a halt since the election of President Donald Trump. \"For many Syrian and Palestinian refugees, the sad reality is that they may never be considered for resettlement in a third country,\" Evan Jones of the Asia Pacific Refugee Rights Network told Al Jazeera. \"With global resettlement numbers dropping, these individuals may be stuck on the fringes of Thai society for years or even decades ahead, unable to access some of their most basic human rights.\"If given a choice, many Palestinian refugees from Syria would settle in Thailand. The majority interviewed for this story have university degrees and had established careers before fleeing the war.But within some sections of Thai society, Arab refugees are perceived as posing a security threat.\"The Thai government should accept the reality that not every refugee could resettle in third countries, so the concept of local integration needs to be taken into consideration in balance with national security concerns for a sustainable solution,\" said Puttanee Kangkun of Fortify Rights.Jones added: \"The recurrent myth that refugees are a security threat and a drain on society is simply not true. Palestinians and Syrians are incredibly productive and resourceful and bring a range of skills and knowledge that could help benefit Thai society.\"Even if the Syrian war ends, Palestinian refugees who travelled to Thailand on now-expired emergency documents have lost the right to return to Palestine. Renewing their travel documents has also become much more difficult since the Syrian consulate in Bangkok closed in 2017. Refugees that Al Jazeera spoke with estimated that there are 400 Palestinian refugees from Syria remaining in Bangkok, with another 201 from Iraq and 15 from Gaza. For some of them, resettlement will be to a fourth rather than a third country. Asma was born in Haifa in 1940 and as a young girl fled Palestine for Iraq. She was displaced again by Iraq's descent into violence after 2003, living for three years in a refugee camp in Cyprus before arriving in Thailand. \"I asked the UN to send me home to Haifa,\" she said. \"I just want to be in my country.\"\r\n            SOURCE: Al Jazeera NewsSansom Milton is a senior research fellow at the Doha Institute for Graduate Studies.The Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.From Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}