{"id": "Denmark recalls ambassador to Iran over alleged foiled 'attack'", "paragraph": "Iranian intelligence unit accused of 'planning an attack in Denmark', Tehran strongly denies allegations.Denmark has recalled its ambassador to Iran after it accused Tehran of plotting a foiled \"attack\" against three Iranians living in the Scandinavian country.\"I have decided to recall Denmark's ambassador in Tehran for consultations...Denmark can in no way accept that people with ties to Iran's intelligence service plot attacks against people in Denmark,\" Danish Foreign Minister Anders Samuelsen told reporters.The alleged plot was \"totally unacceptable\", he said, adding that he was consulting with \"partners and allies\", including the European Union, about possible sanctions.Earlier on Tuesday, the head of Denmark's intelligence service PET, Finn Borch Andersen, said his agency believed the Iranian intelligence service \"was planning an attack in Denmark\" against three Iranians suspected of belonging to the Arab Struggle Movement for the Liberation of Ahvaz.A Norwegian of Iranian origin was arrested on October 21 and placed in custody, suspected of planning the attack and spying for Iran.The suspect was detained in Sweden, according to the Swedish security service Sapo.Tehran has denied the Danish allegations, saying they were part of a European conspiracy against Iran.Foreign Ministry spokesperson, Bahram Ghasemi, said the allegations were a \"plot\" against \"growing Iran-Europe relations\", Iran's Mehr News quoted him as saying. In late September, Tehran accused Denmark, the Netherlands and Britain of \"hosting several members of the terrorist group\" that Iran accuses of being responsible for an attack in the mainly ethnic Arab city of Ahvaz in southwestern Iran.The September 22 attack in Ahvaz, in which five armed men opened fire on a military parade, left 24 people, many of them civilians, dead.The Islamic State of Iraq and the Levant (ISIL, also known as ISIS) armed group and a separatist Arab group claimed responsibility. \"It is totally unacceptable that Iran or any other foreign state plans assassinations on Danish soil,\" Danish Prime Minister Lars Lokke Rasmussen wrote on Twitter.\"Further actions against Iran will be discussed in the EU.\" In Oslo, where he was participating in a meeting of Northern European leaders, Rasmussen met British counterpart Theresa May, whom he said expressed \"support\" for Denmark in the matter.\"In close collaboration with UK and other countries we will stand up to Iran,\" he added.US Secretary of State Mike Pompeo said the US stood behind Denmark.\"We congratulate the government of Denmark on its arrest of an Iranian regime assassin. For nearly 40 years, Europe has been the target of Iran-sponsored terrorist attacks. We call on our allies and partners to confront the full range of Iran's threats to peace and security,\" he wrote on Twitter.Iran's ambassador to Copenhagen was summoned to the foreign ministry for an explanation on Tuesday.PET's announcement ended weeks of media speculation about why Denmark shut down bridges to Sweden and ferries for several hours on September 28 in a massive manhunt that mobilised hundreds of police and the military.The shutdown was aimed at foiling the Iranian operation, PET acknowledged on Tuesday.In October, France accused Iran's intelligence ministry of plotting to bomb a rally held by the exiled opposition group, People's Mujahideen of Iran (MEK), near Paris.The MEK was previously designated as a \"terrorist organisation\" by the US but was taken off the list in 2012.\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}