{"id": "Two border crossings open in divided Cyprus, first in 8 years", "paragraph": "The island opened two new border crossings between its southern Greek and northern Turkish parts.Officials in Cyprus said they have opened two new border crossings for the first time in eight years, in the latest push for peace in the ethnically divided nation.Dozens of people from the island's Greek Cypriot south streamed across the eastern Dherynia border post on Monday, walking past United Nations peacekeepers into the breakaway Turkish-backed north.At the same time, the Lefka or Aplici crossing opened in the northwest of the Mediterranean island, with the total number of such crossings now touching nine.Despite arguments breaking out among onlookers in the run-up to the midday (10:00 GMT) opening, a crowd passed peacefully through the Dherynia crossing.\"I am very pleased,\" said 65-year-old Turkish Cypriot Hasan Uzun about the move. \"I am sick, but I wanted to come here and see this beautiful day with my eyes. I am very emotional now.\"\"We dream that soon all the roads on our island be freely passable,\" one Greek Cypriot woman said.Cyprus has been divided along ethnic lines since 1974 when Turkish troops invaded and occupied its northern region, following an Athens-inspired coup seeking to unite the island with Greece.The two communities lived isolated for decades until the easing of border restrictions following a round of talks in 2003.In 1996, Dherynia was the scene of riots when two Greek Cypriot civilians were killed in one of the worst incidents on the ceasefire line.\"Today is good day 4 #Cyprus . We welcome opening of 1st crossing points in 8 years. These crossing pts will play an important role by increasing people-to-people contacts; contribute 2 build much-needed trust & confidence b/w communities.\"- Elizabeth Spehar, SRSG/Head, #UNFICYP pic.twitter.com/5QW182YPauThe move to open the border crossings on Monday was welcomed by Elizabeth Spehar, head of the UN peacekeeping force in Cyprus.\"Today is good day for Cyprus,\" she said in a statement. \"These crossing points will play an important role in helping to increase people to people contacts, contributing to build much-needed trust and confidence between the communities on the island.\"The development is also seen as a vital step to reviving peace negotiations, which collapsed in July last year.The UN negotiations now aim to create a federation of two politically equal states governed by a central government.Inside StoryCyprus divided - 40 years on\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}