{"id": "Cathay Pacific data leak affects millions of passengers", "paragraph": "Hong Kong-based airline claims \"malicious, criminal attack\" on its website hit over 9 million passengers.Hong Kong flag carrier Cathay Pacific has said it suffered a major data leak affecting up to 9.4 million passengers.The airline admitted on Wednesday that data including passport numbers, identity card numbers, email addresses and credit card details had been accessed.\"We are in the process of contacting affected passengers, using multiple communications channels, and providing them with information on steps they can take to protect themselves,\" Cathay Pacific Chief Executive Officer Rupert Hogg said in a statement on the airline's website.\"We have no evidence that any personal data has been misused,\" the statement said.Cathay said it had launched an investigation and alerted the police after an ongoing IT operation revealed unauthorised access of systems containing the passenger data of over nine million people.Hogg added: \"The following personal data was accessed: passenger name, nationality, date of birth, phone number, email, address, passport number, identity card number, frequent flyer programme membership number, customer service remarks, and historical travel information.\"The CEO also revealed that 403 expired credit card numbers and 27 credit card numbers with no CVV were accessed.\"The combination of data accessed varies for each affected passenger,\" he said.The leak comes as the troubled airline battles to stem major losses as it comes under pressure from lower-cost Chinese carriers and Middle East rivals.It booked its first back-to-back annual loss in its seven-decade history in March and had previously pledged to cut 600 staff, including a quarter of its management, as part of its biggest overhaul in years.Hogg did not mention financial compensation for passengers affected by the data leak.Last month, British Airways pledged to compensate customers when the UK flag carrier suffered a data hack.The British airline revealed in September that personal and financial details of about 380,000 customers who booked flights on the group's website and mobile phone app over several weeks had been stolen.The revelation came just a few months after the European Union tightened data protection laws with the so-called General Data Protection Regulation (GDPR).CEO Alex Cruz said the firm had been the victim of a \"malicious, criminal attack on our website\".The airline took out full-page adverts in UK newspapers to apologise to customers, while the share price of parent group IAG was hit.\r\n            SOURCE:\r\n            News agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}