{"id": "Nigerian police 'open fire' at Shia protesters amid Abuja clashes", "paragraph": "At least one protester wounded in latest round of violence amid protests by supporters of jailed cleric Ibrahim Zakzaky.Police have opened fire and shot tear gas at hundreds of Shia Muslim protesters during clashes in Nigeria's capital, Abuja, according to a witness.The crackdown came on Tuesday, a day after soldiers opened fire on the same protest march by supporters of Ibrahim Zakzaky, the imprisoned leader of the Islamic Movement of Nigeria (IMN).At least one protester was wounded by the gunfire on Tuesday, the witness told Reuters news agency.Police were attempting to stop the march towards the city centre, where most government buildings and the presidency are located. When marchers refused to turn back, police fired tear gas on the crowd. The protesters responded by hurling rocks and the police opened fire, the witness said.On Monday, soldiers killed at least 18 demonstrators, according to the protesters. The military put the death toll at three, saying that four soldiers were also wounded during the clashes.The deaths bring to six the number of IMN supporters who have been killed in demonstrations since Saturday and heighten concerns about further crackdowns on the group.The army claimed the soldiers opened fire on Saturday after the protesters attacked a military convoy and tried to steal weapons and ammunition.Zakzaky has been in custody since December 2015 after clashes in the northern city of Zaria.At the time, the military was accused of killing more than 300 IMN supporters and burying them in mass graves.Zakzaky has been at loggerheads with Nigeria's secular authorities for years because of his calls for an Iranian-style Islamic revolution.Northern Nigeria is majority Sunni Muslim.The cleric, who is in his mid-60s and lost the sight in one eye during the 2015 clashes, has only been seen in public twice since he was detained.Nigeria's government has previously ignored a court order to release Zakzaky and his wife.In April, at least 115 IMN supporters were arrested during protests in Abuja during which police used tear gas and water cannon.IMN processions for the annual Ashoura festival have frequently been flashpoints. In November 2016, at least 10 people were killed when police opened fire near the northern city of Kano.\r\n            SOURCE:\r\n            News agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}