{"id": "Renegade General Khalifa Haftar joins Libya conference in Palermo", "paragraph": "Italian city hosts representatives of Libya's various factions and other countries in bid to find political settlement.Palermo, Italy - Renegade General Khalifa Haftar has arrived in the Italian city of Palermo to attend an international conference seeking to explore a new United Nations road map for Libya.Haftar heads one of Libya's key rebel factions in the east of a country that has been plagued by violence and political chaos since 2011, when its former leader Muammar Gaddafi was deposed.His arrival on Monday came despite sources close to him in Benghazi increasing rumours throughout the day that he might cancel his participation \"due to the presence of Islamist and al Qaeda-linked delegates\". Also attending the summit are Aguila Saleh, speaker of the eastern parliament, and Khalid al-Mishri, speaker of the upper chamber in the capital, Tripoli.Egyptian President Abdel Fattah el-Sisi and his Tunisian counterpart, Beji Caid Essebsi, are among a number of leaders who also arrived in Palermo at the behest of Italian Prime Minister Giuseppe Conte.Haftar, after a brief meeting and handshake with Conte, skipped the working dinner, where representatives from other Libyan factions and their foreign sponsors were present.Italian government sources said he would return for a bilateral meeting later in the evening.\"General Haftar's decision to participate or not in the Palermo conference is more about theatrics than blackmail,\" said Claudia Gazzini, a Libya expert at the International Crisis Group.\"He is believed to have been present in Palermo during the day, and some of his advisers even participated in the morning sessions of the conference.\" During the day, in a series of working groups led by the UN mission to Libya (UNSMIL) and the Italian Ministry of Foreign Affairs, delegates discussed both economic and security measures.The Palermo conference aims to bridge the divide between secularist Haftar, believed to be supported by Russia, Egypt and France, and the UN-backed government of Fayez al-Serraj, who counts the Italians among his closest western supporters.It also seeks to bring to the table the warring factions and get them behind a new UN plan for a national conference and elections early next year in a \"Libya-led, Libya-owned process\".The talks, however, are overshadowed by a diplomatic wrangling between France and Italy. A French plan to hold Libyan elections in December also failed.The Italians have tried to broaden the spectrum of the conference by inviting Libya's armed militias and tribal leaders, efforts that Haftar sees as a direct threat to his military ambitions.Rome insists the summit is meant to support the UN-led initiative as presented by Ghassan Salame, the UN special envoy to Libya, to the Security Council last week.While key Western leaders have stayed away from the conference, envoys from both Russia and the United States expressed their support for the UN plan on Sunday.David Satterfield, acting assistant secretary for Near Eastern Affairs in the US administration, and Russia's Deputy Foreign Minister Mikhail Bogdanov met Salame.\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}