{"id": "Imagining a Bolsonaro Brazil", "paragraph": "While Bolsonaro has offered no concrete political and economic plans for Brazil, I cannot but fear for our future.After comfortably winning Brazil's presidential runoff on Sunday, controversial far-right candidate Jair Bolsonaro delivered a televised victory speech and said his administration is \"going to change the destiny of Brazil\".The former army officer, who has been a member of Congress for nearly three decades, cited the Bible in his speech and, despite being elected with the help of the largest fake news campaign ever seen in Brazil, claimed that with his victory \"truth has triumphed\".Bolsonaro, who ran on a promise to clean up Brazil and bring back \"traditional values\", also said that he would respect the constitution and personal liberties. He said that wasn't just the words of a man but a promise to God. His speech succeeded in firing up his already ecstatic supporters, but did not offer any new clues into what he is planning to do regarding countless fundamental problems facing the world's fourth-largest democracy when he takes over the presidency on January 1.Throughout his eventful and divisive election campaign, Bolsonaro backtracked on several major pledges he had made previously, rendering it impossible for even the most seasoned analysts to determine exactly what Brazil may look like under his rule. In an interview with Globonews, for example, he announced that he could privatise Petrobras (Brazil's largest company and pivot of the scandal that led to the Operation Car Wash), but he recanted the idea a month later.When asked what he will do to get the country out of economic turmoil when elected, he initially said that he does not understand economics, and that a specialist team led by his future minister of economy Paulo Guedes would be in charge of Brazil's economy if and when he is in power. However, soon after that interview, he made it quite clear that he would not allow Guedes, an economist and cofounder of the investment bank BTG Pactual as well as liberal think-tank Instituto Millenium, to shape the economy on his own. When Guedes announced that he is planning to bring back a tax on banking transactions, Bolsonaro swiftly forced him to withdraw the proposal.On the campaign trail he first announced that he may withdraw Brazil from the Paris Climate Agreement, then he abandoned the idea; he later said that he would eliminate the environment ministry if elected, then backtracked once again. To this day, we do not know what path Brazil's new government will follow regarding the environment. However, in light of all the comments he had made about the environment, even though most had since been retracted, many fear the Amazon may not survive a Bolsonaro presidency.On other subjects, he did not even make concrete promises that he could backtrack from, and only hinted at his intentions. For example, he did not lay out detailed proposals on how he plans to increase public safety and reduce the country's record-breaking homicide rate. Instead, he said he is planning to give license to the military police officers to kill on duty, but he did not explain how this would help reduce violence and keep Brazilians safe.Even though the president-elect did not yet provide a detailed, coherent plan or manifesto for us to analyse, his divisive, authoritarian and aggressive discourse rightfully caused many Brazilians and human rights advocates across the world to fear for the future of Brazil.Bolsonaro's divisive rhetoric already empowered violent elements within the Brazilian society.According to an investigation by independent journalism group Agencia Publica, Bolsonaro's supporters, nicknamed \"Bolsominions\", were behind 50 separate attacks - including beatings, a knife attack and a murder - between September 30 and October 10. In the same period, six Bolsonaro supporters were also assaulted, the report found. Bolsonaro himself was the victim of an assassination attempt last month.The number of violent attacks by Bolsominions has risen since then. Two transsexual women were killed in two separate incidents on October 16 and October 19 by supporters of Bolsonaro, who once proclaimed that he is \"homophobic - and very proud of it.\"On October 27, a young man was shot and killed while taking part in a campaign event for the now defeated presidential candidate, Fernando Haddad, in the north-eastern capital of Fortaleza. Police are investigating allegations that the shots were fired by a man who declared himself a Bolsonaro supporter. An eight-year-old boy was shot killed on Election Day, allegedly by a supporter of the president-elect who wanted to celebrate his victory by firing shots in the air.Bolsonaro once said he \"will make a Brazil for the majority\" adding that \"minorities have to bow down to the majority. Minorities [should] adapt themselves or simply disappear\", which has caused many minority groups to prepare for the worst.Brazil's LGBTQ community, which became the primary target of Bolsonaro's supporters, is already talking about resistance, about uniting against hate and looking for ways to stay safe. Members of other minorities, such as black and indigenous communities, have also voiced their concerns, even saying thanks to Bolsonaro they are afraid to walk on the streets of their own country. Journalists, people who are tasked with keeping the actions of the government in check and informing the public about its crimes and mistakes are also feeling threatened. During Bolsonaro's campaign, journalists have faced hacking, doxing and other threats. Two female journalists have been physically and verbally assaulted as they covered Bolsonaro's victory in the state of Ceara. Moreover, Bolsonaro's press officer, Carlos Eduardo Guimaraes, sent messages to journalists after his candidate's victory, calling them \"trash\".All in all, even though we do not really know what plans Bolsonaro has for Brazil (or whether he indeed has any plans), there is ample reason to fear for the future. The only thing the president-elect seems to be consistent about is his desire to follow the path most damaging, most aggressive and most divisive on every issue.But now that a Bolsonaro presidency is inevitable, what can be done to hold his government in check? More importantly, is there still hope for the Brazilian democracy?While the Brazilian civil society seems ready and eager to stand its ground and fight to protect the rights of Brazil's future generations, the actual opposition forces in the Brazilian parliament does not offer much assurance.The Workers' Party (PT), which is hated by more than half the population and does not even have the support of everyone who voted for its candidate Fernando Haddad (many voted for him just because they were scared of the alternative), is the strongest bloc against Bolsonaro in the parliament.To make any gains against the new president, and succeed in stopping the erosion of fundamental rights in the country, they will need to make some drastic changes within their party.The PT MPs need to stop defending former President Lula de Silva, who is currently imprisoned for corruption, if they want to regain the public's trust. They need to stop arguing that former President Dilma Rousseff, who was impeached for illegally manipulating government accounts, was victim of a coup. They need to change their ways, stop contributing to the polarisation of the Brazilian society and demanding blind faith and obedience from their supporters.Unfortunately, few in Brazil believe the PT is capable of transforming itself into a successful and trustworthy opposition party. So it seems Bolsonaro and his party will soon have free reign to create a Brazil in which minorities are targeted, journalists are silenced and police can kill with impunity.Bolsonaro is a populist, who is nostalgic for the military dictatorship, supports torture and does not believe women should have equal employment rights. He is openly homophobic, does not care for the environment and tacitly supports slave labour.The agenda of Brazil's president-elect may still be unclear, but the demise of Brazil's democracy appears to be very near. Even if he is not likely to transform the country into a fully-fledged dictatorship, he seems determined to do something arguably worse: to construct a pseudo-democracy, in which appearances are kept and institutions pretend to work, but most citizens have no voice or political power. The views expressed in this article are the author's own and do not necessarily reflect Al Jazeera's editorial stance. Raphael Tsavkko Garcia is a journalist and a PhD candidate in Human Rights at the University of Deusto in Spain.The Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.From Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}