{"id": "Dozens of bodies found after attack on CAR refugee mission", "paragraph": "Thousands of internally displaced people flee site in Alindao, in latest violent incident in Central African Republic. More than 40 people have been killed and dozens wounded in Central African Republic (CAR), in an attack on a Catholic mission sheltering 20,000 refugees, according to a regional legislator.The violence in the town of Alindao, some 300km east of the capital, Bangui, began on Thursday when Christian militiamen known as \"Anti-balaka\" killed Muslims, prompting revenge attacks.A church was burned, forcing \"thousands\" of people to flee, the United Nations' peacekeeping mission in the CAR (MINUSCA) said.\"We have counted 42 bodies so far, but we are still searching for others. The camp has been burned to the ground and people fled into the bush and to other IDP (internally displaced person) camps in the city,\" Etienne Godenaha, Alindao legislator, told the Reuters news agency on Saturday.A humanitarian source also said that more than 40 people were killed, according to Reuters. The UN on Friday said 37 deaths had been confirmed in Alindao, including that of a priest.On Saturday, the Catholic Church said that the remains of a second priest were recovered in Alindao.\"We found his charred body,\" Father Mathieu Bondobo, the vicar-general of the main cathedral in Bangui, told the AFP news agency.The violence came just weeks about 10,000 people ran to a hospital in Batangafo, some 400km north of Bangui, after armed groups looted and burned thousands of homes, three camps hosting 27,000 displaced and a market in the city.In a statement on Saturday, MINUSCA condemned the latest violence that \"resulted in the loss of life, mass displacement of internally displaced people and the destruction of property\".It also said it had implemented \"security measures\" to protect civilians who sought refuge near the mission's military outposts.➨Over 642,000 people are internally displaced in #CARcrisis➨Persistent violence results in recurring displacements #NotATarget ➨Over 27,000 IDPs in Batangafo town have been brought to their knees after a site was burned #SaveLives➨@rochdi_najat listens to their plight pic.twitter.com/STZE4SOX4BOne of the world's poorest nations despite a rich supply of diamonds and uranium, the CAR has struggled to recover from a 2013 civil war that erupted when President Francois Bozize, a Christian, was overthrown by mainly Muslim Seleka rebels.In response, Christians, who account for about 80 percent of the population, organised vigilante units dubbed \"Anti-balaka\".The conflict has killed thousands of people and caused the displacement of a fifth of the country's 4.5 million population. More than 642,000 have been internally displaced, according to the UN.Despite electing a new leader - President Faustin-Archange Touadera - in 2016, the country has continued to face political instability and tit-for-tat inter-communal violence.The Norwegian Refugee Council said last year that the conflict in the CAR topped its list of the world's most neglected displacement crises.The UN has about 12,500 personnel deployed in the CAR as part of its MINUSCA mission, one of the world body's largest peacekeeping forces. The UN Security Council voted on Thursday to temporarily renew the mandate of the mission until December, amid heated debates about its ability to stem the unrest.\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}