{"id": "Students call for NYU to cancel Milo Yiannopoulos lecture", "paragraph": "The far-right writer is slated to talk about the 'politics of Halloween' on Wednesday, prompting student ire.Update: Hours after this story was published, NYU spokesperson John Beckman released a statement that the university has decided to postpone the classroom appearance by Milo Yiannopoulos. The decision was reached after New York Mayor Bill de Blasio requested postponement \"for public safety reasons in light of the nearby Halloween parades and NYPD assessments of risk\", the statement said. Original story:Last week, far-right speaker and writer Milo Yiannopoulos took to Instagram to bemoan the fact that no pipe bombs had arrived at the Daily Beast news site when a spate of explosive devices was mailed to CNN and critics of US President Donald Trump.After Instagram removed the post, Yiannopoulos derided journalists who \"cry\" when he makes a \"joke\" about a \"false flag designed to distract us\" from a US-bound caravan of refugees and migrants he baselessly claimed is funded by Democrats. But, on Wednesday, Yiannopoulos will speak at New York University (NYU), where Professor Michael Rectenwald invited him to lecture on the politics of Halloween, prompting anger among many students.Time and again embroiled in controversy, Yiannopoulos, a former editor of the right-wing Breitbart news site, has regularly railed against Muslims, immigrants and the press. Last year, he was forced to resign from Breitbart over ostensibly pro-paedophilia comments made on a podcast. Earlier this year, he said that vigilante death squads should gun down journalists.Speaking to Al Jazeera by email, Rectenwald said he invited Yiannopoulos to \"introduce a different perspective into the classroom, especially in connection with the issues raised by Halloween\".Among the issues the speaker will cover are \"costumes, identity, identity politics and the left's censorious policing of what was once a holiday for 'misrule' and harmless play\", Rectenwald said, adding that he expects protests against the event.Yiannopoulos did not reply to Al Jazeera's request for a comment.Some student activists and groups have called on the university to cancel the event.\"Our main frustration is that the university is using this justification of free speech to invite white nationalists to our campus and allow this really violent ideology to have a platform,\" NYU student senator-at-large Rose Asaf told Al Jazeera. \"We think it's dangerous.\"On Twitter, the Graduate Student Organizing Committee at NYU decried Yiannopoulos. \"Milo and his fascist, white supremacist speech which has often included calls to violence - are dangerous for many of our students,\" the post reads.\"For educational workers, this is what a workplace safety struggle looks like. He has no place in any classroom.\"Milo and his fascist, white supremacist speech—which has often included calls to violence—are dangerous for many of our students. For educational workers, this is what a workplace safety struggle looks like. He has no place in any classroom. https://t.co/LwWoWJTn7lBut NYU spokesman John Beckman insisted that Yiannopoulos's lecture \"must be understood not as the institution's endorsement of the speaker's views, but as the fulfillment of its commitment to the free exchange of ideas\".\"Mr Yiannopoulous has espoused many ideas that are at odds with the values of the NYU community and are offensive to its members,\" Beckman told Al Jazeera by email.\"But as an invited speaker, he will be allowed to address Professor Rectenwald's class because even in the face of controversy and profound disagreement, adherence to the principles of academic freedom is a core value.\"Yiannopoulos's appearances have sparked demonstrations in the past, including at the University of California Berkeley in February 2017, when an anti-fascist rally led to the cancellation of his speech.\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}