{"id": "'A crucial moment': Yemen's warring sides to attend peace talks", "paragraph": "UN envoy says representatives from the Yemeni government and Houthi rebels will attend negotiations in Sweden.The UN envoy for Yemen has said the country's warring parties have agreed to attend negotiations in Sweden aimed at ending more than three years of brutal war.Martin Griffiths told the UN Security Council on Friday that the Yemeni government and Houthi rebels had shown a \"renewed commitment\" to work on a political solution to end a war that has driven millions to the brink of famine.\"I have received firm assurances from the leadership of the Yemeni parties - the government of Yemen, of course, first, and the Houthis - that they are committed to attending these consultations,\" he said.\"I expect them to appear for those consultations and indeed, so do the Yemeni people, who are desperate for a political solution to a war in which they are the main victims.\"Griffiths said he planned to travel to the rebel-held capital Sanaa next week to finalise arrangements and even offered to travel with the Houthi delegation to Sweden \"if that's what is needed.\"No date for the talks was announced.David Beasley, head of the UN World Food ProgrammeThe new round of peace talks to end the war, which has killed more than 56,000 people according to a recent estimate, was initially scheduled to take place in November but had been pushed back to late December.Griffiths said the Saudi-UAE military alliance had agreed to \"logistical arrangements\" to pave the way for talks including medical evacuations out of Sanaa.He added that he was close to reaching a deal on an exchange of prisoners and detainees, in a further confidence-building measure in advance of planned talks.\"This is a crucial moment for Yemen,\" he said, warning that a flare-up of fighting on the ground could derail the peace effort. A number of countries have recently called for a cessation of hostilities between the Saudi-UAE military alliance and Houthi rebels, among them the US, Britain and France.On Monday, the UK is expected to present a draft resolution to the Security Council to address the conflict, Ambassador Karen Pierce said.The UK and the US have sold more than $12bn-worth of weapons to Saudi Arabia since Riyadh intervened in the war in 2015.Earlier this week, pro-government forces suspended an offensive on the rebel-held port of Hodeidah, a major entry point for humanitarian aid and vital goods to Yemen.The UN envoy said he would also travel to Hodeidah next week to discuss plans for the UN to take over control of the port and oversee the arrival of aid deliveries and supplies.This would address concerns from the Saudi-UAE alliance that weapons were being smuggled into Yemen for the Houthis through the port.In the capital Sanaa, Yemenis pleaded with the international community to help broker a settlement.\"We are tired of the war, the blood and the killing,\" Hassan Abdel Kareem, a father of seven, told the AFP news agency.\"We've had enough. It is time to start rebuilding Yemen, and Yemen will need every person in it to be rebuilt.\"Back from a recent visit to Yemen, the head of the UN World Food Programme warned that the country faced a full-blown famine in around six months.\"What I have seen in Yemen this week is the stuff of nightmares, of horror, of deprivation, of misery,\" David Beasley told the council. \"Children are already dying.\"Eight million people are affected by severe food shortages, according to UN officials, who warn that up to 14 million - or half of Yemen's population - are at risk of famine.\"One little child, I remember his little feet were sticking out of the blanket, and it was kind of cute, and I went and tickled the little feet thinking I'd get a little smile, and it was like tickling a ghost. Nothing there,\" he added.The conflict in Yemen, the Arab world's poorest country, began when the Yemeni government slashed fuel subsidies in the summer of 2014, prompting massive protests in Sanaa.The Houthis seized the opportunity and marched south from their stronghold of Saada province to the capital, where they toppled Hadi's government.Concerned by the rise of the Houthis, a Saudi-led military coalition, backed by the United States, intervened in 2015 with a massive air campaign aimed at reinstalling Hadi's government.Since then, data collected by Al Jazeera and the Yemen Data Project has found that more than 18,000 air raids have been carried out in Yemen, with almost one-third of all bombing missions striking non-military sites.Weddings, funerals, schools and hospitals, as well as water and electricity plants, have been hit, killing and wounding thousands.\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}