{"id": "In small town Kentucky, Trump supporters dig their heels in", "paragraph": "Many Trump supporters say their support for the US president and the Republican party couldn't be stronger.Irvine, Kentucky - President Donald Trump is not on the ballot next week in Estill County Kentucky, but for some residents, he might as well be.When Trump ran for president two years ago, promising more jobs, a crackdown on immigration and to \"make America great again\", it resonated with 27-year-old construction worker Cortland Wilder, who joined 70 percent of fellow rural county voters helping to sweep Trump into office.Just days before the US midterm elections widely viewed as a referendum on Trump, Walker is among conservative voters in Trump-supporting states such as Kentucky headed to the polls in local races to show they have not wavered and believe the US president has done a good job since he was elected two years ago.Kentucky, which twice elected Democrat President Bill Clinton, has become reliably red, giving Trump 62 percent the vote in 2016 largely on the strength of rural residents like Wilder.\"Every one of my friends and family wants to vote for him more than they did the first time,\" Wilder, a father of two who lives in a district where Trump-backed Republicans have argued that residents \"forgotten\" by politicians before Trump came to power.Wilder hasn't been put off by Trump's pugilistic style. He knows Trump has angered allies, opened a trade war with China, criticised the \"fake news\" media, regularly provoked outrage on Twitter and dismissed as a \"witch-hunt\" a federal investigation into his campaign's relationship to Russia's alleged 2016 election interference.Cortland Wilder, Trump supporterMore important to him, he said, is jobs. They are plentiful in nearby cities where many work, even though unemployment around the small brick downtown stood at 9.4 percent in July. Walker attributes a recent $3-an-hour raise to Trump's tax cuts, despite criticism it will balloon the national debt. He believes Trump's policies mean fewer undocumented immigrants taking jobs. Add to that Trump's two conservative Supreme Court justices who will favour conservative causes for years to come. It is propelling Wilder to vote in the bellwether 6th District Congressional race that's drawn Trump and high-profile Democrats to campaign for the candidates.A Morning Consult/Politico poll taken in late October found that 43 percent of voters approved of the job Trump was doing, while 54 percent of voters disapproved. But few Trump supporters that Al Jazeera has been following since the election have changed their minds.On the other side of Kentucky from Wilder, the story is much the same - even among those weary at times of Trump's social media outbursts.\"Do I love Trump? Nope. I wanted him in the White House in order to fix our most pressing issue, which was economic security. So far, so good; things have gone as well or better than I thought they would,\" said Robert Berry, 42, of Owensboro in western Kentucky who buys and sells used car parts online.He added, \"Just as most in marriages would change things about their beloved spouse, I would change things about Trump. However, like a marriage, this is a package deal.\"A resident walks past an old theatre in Irvine, Kentucky, where 70 percent of voters opted for Trump in 2016 [Chris Kenning/Al Jazeera]In Simpsonville, Kentucky, located just West of the Bluegrass state's renowned horse farms, Sovanna Chhan, 61, a retired Cambodian American factory worker who now works at retail store Wal-Mart, said he voted for Trump because of his stance on immigration - even though he's an immigrant himself.Trump has stoked fears about immigration as he campaigns for the midterm elections that could determine whether Democrats retake the US House or Senate. At a recent rally in Kentucky, Trump warned that \"Democrats want to open America's borders and turn our country into a friendly sanctuary for murderous thugs from other countries who will kill us all.\" Chhan does not mind that Trump has not built a giant wall on the US-Mexico border as promised, or gotten Mexico to pay for it.\"They want to get him, because they don't like his policies on refugees. But I support him. Some refugees are good, come to work and pay taxes. But some immigrants come to destroy America, to hurt Americans, and hurt our economy,\" he said.To the south, just 30 miles north of the Tennessee border, Sherry Perdue, a 56-year-old retired teacher who lives on a farm near Breeding, Kentucky, said she thinks Trump has done a good job, too. She recently attended a Trump rally, wearing a \"Kentucky Deplorable\" T-shirt and standing in a line of thousands who chanted, \"USA!\" and \"Trump!\"She voted for Obama in 2012 but found that the Affordable Care Act was not as helpful as she'd hoped. Two years ago, she voted for Trump and is now an ardent supporter of his positions ranging from immigration to trade deals.She said the wrenching confirmation battle over Justice Brett Kavanaugh, who she believes is innocent accusations that he assaulted a woman in the 1980s, galvanised her desire to vote next week. While coal industry jobs have not come rushing back despite Trump's promises, she said the nation's economy, in general, was strong. \"There are jobs - you might have to travel a ways, but there are jobs. There are factories that have stayed, and I give him quite a bit of credit,\" she said, noting that her support of Trump in such divided times has cost her friendships including some former teaching colleagues. \"I've been blocked on Facebook, I've been cussed,\" she said.In Spencer County, Kentucky, located outside of Louisville, real estate agent Linda Greenwell, 69, said the economy is also driving continued support for Trump. She said she's had her best year ever, doubling her salary. She's involved in the local Republican party and said voter registrations have gone up. In fact, across Kentucky, Republicans have added more than 58,000 registered voters since Trump took office while Democrats have lost more than 2,500 registered voters, The Associated Press reported, giving Republicans the majority among registered voters.\"Obama helped us a lot. And now we are going gangbusters with Trump,\" she said of the new registration. \"For the first time, we have a Young Republicans club in the high school.\"She hopes that Trump fever that swept Kentucky in 2016 will keep Congress in the hands of Trump and the Republicans. \"Every person we put into office who supports him gives him one more tool to do his job,\" she said.\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}