{"id": "Barcelona investigates racist incident on Ryanair as 'hate crime'", "paragraph": "City council files case with police after white man was filmed racially abusing a 77-year-old black woman last week.Barcelona is pursuing a case against a man filmed subjecting a 77-year-old black woman to racist abuse on a Ryanair flight, according to a report in the Guardian.Flight FR015 was departing Barcelona for the United Kingdom on October 19 when the man launched his tirade, calling the elderly woman an \"ugly black b***ard\" and demanding that she change her seat.\"I don't care whether she’s f****** disabled or not, if I tell her to get out she gets out,\" said the man, who has been identified by British police but not publicly named.British police have forwarded the details to their Spanish counterparts, who are leading the investigation.The woman, later named as Delsia Gayle, asked to be reseated next to her daughter, who was also travelling.She told ITV News that she felt \"very low\" after the accident.\"He pays his fare, I pay mine. So why did he abuse me for that? Because of the colour of my skin,\" she told the news outlet, adding: \"If I had done that to him, I'm sure they would have called the police.\"When are you going to apologise to Delsie Gayle and her daughter? What a horrible level of customer care you deliver.Staff are heard asking the racist man to calm down but he was not asked to leave the aircraft, prompting outrage and calls to boycott Ryanair.Barcelona's deputy mayor Jaume Asens called Ryanair's response \"unacceptable\", in a tweet calling for witnesses on Monday.Ryanair has acknowledged the video but has not yet yielded to calls for an apology.\"We are aware of this video and have reported this matter to Essex Police,\" it said in a short statement published on Twitter on Sunday.WATCH: \"I feel really depressed about it...I travel a lot and nobody ever said this word to me.\" Our exclusive interview with racially-abused #Ryanair passenger Delsie Gayle and her daughter on their anger and shock over how they've been treated by the airline https://t.co/rHv9cijmNI\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}