{"id": "How can Gaza's contaminated water catastrophe be solved?", "paragraph": "Barely three percent of Gaza's drinking water wells is fit for human consumption, and the crisis is claiming lives.This article is the second of a two-part series on Gaza's water crisis. The first, which examines Gaza's water and health catastrophe, was published on Monday, October 29.Gaza - When it comes to survival in Gaza, safe, clean drinking water is not at the top of Mousa Hillah's list of priorities. Since the 2014 war, Hillah, known to neighbours and family as Abu Ali, has had far bigger worries, which are etched deeply into the exhausted face of the 48-year-old grandfather.Dodging shell fire from Israeli tanks, he fled with his family from the destruction of his Shuja'iyya neighbourhood, flattened by Israel in an attack so devastating - 7,000 shells in barely an hour - that it astonished even US military officials. (\"Holy bejeezus!\" one retired general exclaimed.)The family took refuge for months in an in-law's house near the sea, along with 50 other people. When they returned, Abu Ali found his home - the one he had built after 30 years of working construction in Israel - utterly destroyed. Brick by board, he rebuilt it, adorning his front entrance, in a dose of biting irony, with repurposed tank shells.And now, as he sits in the filtered morning light beneath a lattice of grape leaves, he worries less about potable water than the Israeli drone buzzing overhead - often the harbinger of another attack.Gidon Bromberg, director of Ecopeace Middle East, based in Tel Aviv\"I want to sleep well,\" Abu Ali says, as his family takes refuge inside the rebuilt house. \"I don't feel safe in my home.\"So the brackish, undrinkable water that sputters from his tap, or the sweet water with possible faecal contamination in his rooftop tank: these are issues Abu Ali files under the category of extreme nuisance. This very morning, for example, the electricity came on only from 6:30 to 8:30. It shut off before the water delivery truck arrived - \"too late to pump the water to the roof,\" Abu Ali complains. A shortage of drinking water is a major concern, but clearly, worrying about the buzzing drone takes priority. Yet if the Gaza Strip truly becomes \"uninhabitable\" by 2020, as the UN and humanitarian groups warn, it will be largely because of the utter collapse of the system for delivering safe drinking water and properly disposing of disease-causing sewage.Because of Gaza's water and sewage catastrophe, medical experts are now seeing sharp increases in waterborne and foodborne diseases, including gastroenteritis, severe diarrhoea, salmonella, typhoid fever, an \"alarming magnitude\" of stunting in young children, and even something called \"blue baby syndrome.\"Independent, peer-reviewed medical studies also document an alarming rise in anaemia and infant mortality. And doctors in Gaza's hospitals now report increased cases of paediatric cancer.For years these torments seemed sealed off from the outside world by layers of fences, locked gates, patrolling Israeli drones and warplanes, and international disdain and indifference. Now, finally, from Washington to European capitals, and even to the Israeli security infrastructure in Tel Aviv, alarm bells are going off, warning that something must be done to prevent the water catastrophe in Gaza from spinning out of control. \"If you really want to change the lives of people, you have to solve the water issue first,\" says Adnan Abu Hasna, Gaza spokesperson for the UN Palestinian refugee agency, UNRWA.The crisis essentially began with the creation of Israel in 1948, when hundreds of thousands of Palestinians were driven from their towns and villages and the population of Gaza quadrupled in a matter of weeks. Now, three-quarters of Gaza's two million people are refugees. Their descendants put immense pressure on Gaza's aquifer, drawing it down so far that seawater is flowing in. What is increasing the pressure on the aquifer are the billions of gallons pumped by Gaza's now debilitated citrus industry, and the billions more by Gaza's Israeli settlers, who helped drain a sweet pocket of Gaza water before Israel removed them in 2005. Now, barely three percent of Gaza's drinking water wells are fit for human consumption.The aquifer is badly contaminated with disease-causing nitrates from pesticide use, and from sewage which flows freely as Gaza's sewage plant is shut down for lack of electricity.And the desalinated drinking water used by two-thirds of Gazans, according to tests by the Palestinian Water Authority, is prone to faecal contamination, causing more disease and making it a severe risk for Gaza's children.Israel's bombing of water delivery infrastructure - including wells, water towers and pipelines, and sewage plants - in the 2014 war, made matters much worse.A comprehensive peace deal, in theory, could have eliminated the challenges by connecting Gaza to the West Bank, where the vast Mountain Aquifer is big enough to drown Gaza's water crisis.As it is, there is no peace. The two territories are splintered, and Israel has effective control over all of the water - from the Jordan River to the Mediterranean.As a health epidemic looms, experts, politicians, humanitarian officials and ordinary Gazans are left to debate the best way out of Gaza's water catastrophe.\"We have 15 percent of our water resources, and the rest is stolen by the Israelis,\" says Mazen Al Banna, deputy minister for the Hamas government's water authority. As he speaks, the wail of an ambulance and a slow mournful dirge pass by the minister's Gaza City office - a memorial for three Gazans killed in Israeli air attacks the previous day. Decades ago, Israel captured the Jordan River, directing much of its flow into Israel's National Water Carrier.Equally important, it controls the Mountain Aquifer, exercising its power under the Oslo accords to prohibit Palestinians from drilling wells - even though the aquifer lies almost entirely beneath the West Bank. \"And this is against international law,\" says Al Banna. \"I'm talking about Palestinian water rights. It is very important.\"Yet arguing for Palestinian water rights is akin to debating the right of return for Palestinian refugees. It may be inscribed in international law, but it remains a distant and faltering prospect within the current political reality.Instead, Hamas ministers and everyone else in Gaza must contend with Israel's ongoing economic siege, which has restricted the movement of basic goods, including medical supplies and crucial parts for water infrastructure.\"Occupation and siege are the primary impediments to the successful promotion of public health in the Gaza Strip,\" declared a 2018 study in the Lancet, which cited \"significant and deleterious effects to health care.\" According to a 2017 report by the Israeli human rights group B'tselem: \"During the siege, the health system has further deteriorated due to the lack of medical equipment, medicines, and rescue vehicles, and because of the frequent, prolonged power blackouts.\"The Israeli siege sharply restricts the movement of people and materials to and from Gaza - including \"dual-use\" materials it claims could serve both civilian and military purposes. This is a direct reason why nearly half the population is unemployed, and an increasing number of Gazans - now more than three-quarters of the population - are dependent on humanitarian aid. The blockade has also delayed the entry of vital water infrastructure - in some cases, for years at a time. A proposed desalination plant for Gaza City, for example - one of a series of proposed plants - has been delayed since 2010 because of dual-use restrictions. \"Eight years,\" says Yasmin Bashir, project coordinator for Gaza's Coastal Municipal Water Utility. \"We got the funding in 2012. This plant is supposed to serve the people who are suffering from bad quality, high salinity water.\" For years Bashir continued to submit \"a long list\" of material for Israeli approval, including pipes, pumps, and spare parts for the desalination plant. \"But because of the blockade and frequent closure, that delayed the material entry into Gaza.\" And that is just one project. \"We manage more than 25 projects nowadays,\" Bashir added.Now, even voices within Israel's military and security infrastructure are sounding warnings. According to a 2017 report by Israel's Institute for National Security Studies, \"severe limits on access and movement imposed by Israel and Egypt have hindered post-conflict repair and reconstruction.\" Israel's long list of dual-use items, according to the report, \"includes 23 essential items\" needed for Gaza's WASH sector (water, sewage and hygiene), \"such as pumps, drilling equipment, and chemicals for water purification.\"A consensus is now emerging between the Palestinian Authority, the UN, international donors, and even, it appears, the Israeli army, to establish a network of large desalination and sewage plants. This solution carries an, at least, 500 million euro price tag, and is years away from operation, at best - if it's ever built. \"Of course Gaza needs this project,\" says Rebhi al Sheikh, former deputy minister for the Ramallah-based Palestinian Water Authority. Others criticise the large, expensive development solution as inappropriate technology for an impoverished population that would struggle to afford desalinated water. \"The fantastic plans,\" says Ramallah-based German hydrologist Clemens Messerschmid, fail to account for the fact that \"Gaza can't afford it. You just start crying if you look at the GDP.\"He argues that outside contractors, including in Israel, would be the biggest beneficiaries of the desalination scheme. Perhaps more to the point, says Messerschmid, the amount of water to be produced by the plant won't ultimately meet Gaza's needs. \"You don't reach these quantities under realistic conditions in Gaza.\"Yet the desalination plan appears to be gaining momentum. The PA's concerns about Gaza's water crisis are joined by humanitarian agencies, foreign governments, and even, it appears, an emergency response committee of the Israeli army. In a Gaza Emergency Response document circulated to unnamed \"Friends and Colleagues,\" the Israeli army calls for \"an immediate humanitarian response\" to \"enhance the energy supply\" and \"increase the access to potable water\" in Gaza. Despite the desalination push, a pilot plant in southern Gaza barely operates. A midday visit in late summer revealed a quiet plant; birds were chirping in the rafters above the idle plant floor: no power. \"We don't have more than four hours these days,\" said plant manager Kamal Abu Moamar. \"But we hope.\" He is waiting for his superiors, PA ministers to solve the problem. \"But we don't know how or when.\"Even if the plants are built, there's no guarantee they would remain standing. Some officials question whether Israel would decide to bomb the desalination plants in the next Gaza war, just as it bombed Gaza's power plant and other critical infrastructure in previous wars. \"Nobody can tell Israel that you are doing the wrong thing,\" says Hamas's Al Banna. \"Israel is doing everything against international law but nobody can prevent Israel doing everything she wants to do.\"In the \"Emergency Response\" document, the Israel army endorses the Gaza desalination plan, but so far has offered no guarantees it wouldn't target these plants in the next war. Al Jazeera contacted an Israeli army spokesman a dozen times, but did not receive a response by time the of publishing.So the question came to Gregor von Medeazza, a UNICEF water and sanitation expert working in Gaza: Under the circumstances, is investing hundreds of millions in donor funds wasn't too big a risk?\"Any infrastructure is a risk\" he said, \"[But] what is the way forward?\"Other risks abound, both with Gaza's water and its sewage, which flows into the sea at a rate of 110 million litres a day.These risks flow well beyond Gaza's borders, flowing north in the currents.Gidon Bromberg, director of Ecopeace Middle East, based in Tel Aviv, said Gaza sewage led to the closure of Israeli beaches, and even at one point the shutdown of the desalination plant in Ashkelon, which supplies Israel with 15 percent of its drinking water. Bromberg says Israelis cannot continue to ignore the humanitarian disaster in Gaza. He called it \"a ticking time bomb\", and warned of an outbreak of pandemic disease - a direct consequence of Gaza's contaminated water. If that happens, Bromberg says, Gazans could flock to the fence on Israel's border - not \"with stones or rockets,\" but \"with buckets\", demanding clean water. \"God forbid if the military on either side, Israel or Egypt, starts shooting people approaching the fence, desperate for clean water.\"\r\n            SOURCE: Al Jazeera News\nThe Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.From Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}