{"id": "Mobster 'Whitey' Bulger killed in prison at 89 years old: reports", "paragraph": "James 'Whitey' Bulger was serving two consecutive life sentences for 11 murders, racketeering and other charges.James \"Whitey\" Bulger, who lived a double life as one of Boston's most notorious mobsters and as a secret FBI informant before going on the run for 16 years, was found dead at a federal prison in West Virginia, the Federal Bureau of Prisons said.The FBI was looking into Bulger's death, the Bureau of Prisons said in its statement on Tuesday. Bulger's death at age 89 came a day after he was transferred to the high-security prison. Federal officials did not give a cause of death but the Bureau of Prisons said no other inmates or staff were injured.CNN and the Boston Globe reported that Bulger was killed without giving further details.Henry Brennan, a defence lawyer for Bulger, said in an email he could not confirm or deny the reports.Bulger was convicted in August 2013 of 11 murders, among other charges including racketeering, and sentenced to two consecutive life terms plus five years.Prison had been something Bulger had gone to great lengths to avoid - killing potential witnesses, cultivating corrupt lawmen and living as a fugitive for 16 years. It all ended when a tip from a former Icelandic beauty queen led to his capture in June 2011 in Santa Monica, California, where he was living with a long-time girlfriend.Bulger and his Winter Hill gang had operated for more than two decades in the insular Irish-dominated South Boston neighbourhood, engaging in loan sharking, gambling, extortion, drug dealing and murder.They did so with the tacit approval of an FBI agent who looked the other way when it came to Bulger's crimes so that he would supply information on other gangsters.Bulger, portrayed by Johnny Depp in the 2015 film \"Black Mass\", was feared for his short temper and brutality. Prosecutors said he strangled two women with his hands and tortured a man for hours before shooting him in the head with a machine gun.\"We took what we wanted,\" Kevin Weeks, a former Bulger lieutenant who would eventually give evidence against him, wrote in \"Brutal\", his memoir. \"We made millions through extortion and loansharking and protection. And if someone ratted us out, we killed him. We were not nice guys.\"Bulger was born September 3, 1929, and grew up in South Boston. He was called \"Whitey\" because of his light blond hair but was said to detest the nickname and preferred being called Jimmy. As a teenager, he joined a gang known as The Shamrocks, compiled an arrest record for assault and armed robbery and ended up in a juvenile reformatory.Bulger was a bank robber early in his criminal career, which landed him in prisons such as the infamous Alcatraz, located on an island in San Francisco Bay.Upon his release in 1965, he eventually fell in with the Irish mob in South Boston and worked his way through the ranks as a bookie and loanshark. He survived a gang war between two Irish mobs and was a leading figure in Boston's underworld by the early 1970s.His career was boosted by his relationship with rogue FBI agent John J Connolly, who Bulger had known since they were boys. Connolly was supposed to be in charge of getting information out of him and Bulger did provide information that helped the FBI go after his main rival, New England's Italian Mafia, as well as local criminals.In return, Connolly let Bulger know about working investigations while Bulger and close associate Steve \"The Rifleman\" Flemmi carried on with impunity. After he retired from the FBI, Connolly tipped off Bulger about a coming indictment, sending the mobster on the run in 1995.Connolly was convicted in 2008 of racketeering, taking bribes and second-degree murder for his role in the slaying of an accountant who Bulger and Flemmi feared would give evidence against them.Bulger's former associates turned on him while he was at large and their information led to a 2000 indictment that originally charged him with 19 murders.\"The guy is a sociopathic killer,\" Tom Foley, who worked on Bulger cases for the Massachusetts State Police, told CNN.\"He loved that type of life. He's one of the hardest and cruelest individuals that operated in the Boston area. He's a bad, bad, bad guy.\"When Bulger fled, he first took Teresa Stanley, his girlfriend of 30 years, with him. After a few weeks at large, however, Stanley wanted to go home so Bulger dropped her off in the Boston area. He picked up another of his girlfriends, Catherine Greig, and disappeared again.Bulger spent his final years of freedom in Number 303 of the Princess Eugenia apartment complex in Santa Monica with Greig.One of their neighbours, Anna Bjornsdottir, a former US television actress and Miss Iceland of 1974, earned a $2m reward for turning in Bulger. She was watching a television news report about the Bulger manhunt when she recognised the man she knew by the name Charlie Gasko and notified the FBI.At first, he denied his identity but eventually told authorities, \"You know who I am. I'm Whitey Bulger.\" More than $800,000 in cash and a cache of weapons was found hidden in the walls of his apartment.Greig was sentenced to eight years in prison and fined $150,000 for helping Bulger evade capture. She is scheduled for release in September 2020.Bulger's two-month trial for murder, extortion and drug dealing in 2013 was sometimes raucous. A parade of former associates testified against him, giving brutal details about how Bulger would kill enemies and then take a nap.Sometimes Bulger sat silently at the defendant's table and at other times he engaged in profane shouting matches with witnesses such as Flemmi.Bulger, who denied ever being an FBI informant, refused to give evidence on the grounds that the trial was a sham.The US Justice Department paid more than $20m in damages to families of people killed by Bulger on the grounds that he was operating under government supervision while killing.While Bulger was robbing banks and killing people, his younger brother Billy was acquiring political notoriety and power.Billy served in the Massachusetts legislature for 35 years, including several years as president of the state Senate, after which he was president of the University of Massachusetts.He was forced to resign the latter job in 2003 after it was learned that eight years earlier he had spoken by phone with his brother, who at the time was a federal fugitive, and did not report it to authorities.\r\n            SOURCE:\r\n            Reuters news agency\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}