{"id": "Will the US punish Mohammed bin Salman over Khashoggi's murder?", "paragraph": "Most SearchedInside Story17 Nov 2018 17:49 GMT Jamal Khashoggi, Mohammed bin Salman, Saudi Arabia, Middle East, United StatesIt's what many have suspected ever since Jamal Khashoggi disappeared in Istanbul six weeks ago.The Washington Post says the CIA has concluded that the Saudi Crown Prince Mohammed bin Salman did give the order to kill the journalist.The American spy agency is not commenting on the reports.Meanwhile, the Saudi embassy in Washington says the CIA assessment is false.If not, the CIA finding is the first direct confirmation of the crown prince's involvement after Turkey said the order to kill came from the highest level in the kingdom.Where does the finding leave Saudi-US relations? And where does it leave the fate of bin Salman?Presenter: Sami ZeidanGuests:Glenn Carle - Career CIA officer and the former deputy national intelligence officer for transnational threatsScott Lucas - Professor of American studies at the University of BirminghamSource: Al Jazeera News\r\n      Commenting has been disabled. To find out more, click      \r\n      here.\r\n     The Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nInteractive, Philippines, EnvironmentRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.Europe, Russia, Saudi ArabiaFrom Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.Environment, Native Americans, US & CanadaAnswer as many correct questions as you can and see where your country ranks in the global cost of living.InteractiveStatement comes after US media reports say CIA has concluded Saudi crown prince ordered Khashoggi's murder.Jamal Khashoggi, Middle East, Saudi Arabia, Turkey, Journalism Is Not A CrimeThousands of people blocked roads across France during 'yellow vest' demonstrations against the rising price of fuel.France, Business & Economy, Emmanuel Macron, EuropeMeet the hardline group willing to do anything, including going against their government, to claim land for Israel. Israel, Occupied West Bank, Middle EastMoroccan dissident Abraham Serfaty was jailed, tortured and exiled for his radical views over decades.History, Morocco, Human RightsAn insight into the Trump administration's relationship with the religious right and implications for US politics.Religion, Donald Trump, US Midterms 2018In an age of non-stop news feeds and disposable media, which stories and images stay with us and how do they shape us?Journalism, Humanitarian crises, Media\n \n\t\t\t© 2018 Al Jazeera Media Network\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t "}