{"id": "Malaysia and Indonesia are bucking the global trend on democracy", "paragraph": "Across the world, democracy is in retreat, but that's not the case in Southeast Asia's two biggest Muslim countries.In October, Latin America's most populous nation, Brazil, elected as president Jair Bolsonaro, a former military man and historically fringe, far-right senator known for his pro-gun, pro-torture views. In 1999, he told Brazilian television, \"Elections won't change anything in this country. It will only change on the day that we break out in civil war here and do the job that the military regime didn't do: killing 30,000. If some innocent people die, that's fine. In every war, innocent people die.\"Elsewhere in the world, Donald Trump, Xi Jinping, Vladimir Putin, Recep Erdogan, Viktor Orban and Rodrigo Duterte are some of the names that have dominated headlines as leaders who are spearheading the world's reported march towards authoritarianism. In January, the Economist Intelligence Unit's Democracy Index for 2018 reported that electoral democracy was continuing its \"disturbing retreat\" the world over. The TIME magazine recently declared that \"a new archetype of leader has emerged. We're now in the strongman era.\"If this is true of Brazil, the United States, China, Russia, Turkey and even the Philippines, it is not so in the Malay Archipelago.In May, Malaysian politics was changed irrevocably with the election of its opposition for the first time in 60 years of independence. Accountability, openness and democratic progress appear to be finally within reach.While many Western observers continue to argue that Islam is incompatible with democracy - Indonesia and Malaysia beg to differ. With the former already the strongest electoral democracy in Southeast Asia and the latter an unlikely late bloomer, the two countries are leading the charge for democratic politics in their immediate region, and perhaps the world.As Malaysia went to the polls in May, Indonesia was celebrating 20 years of Reformasi - a word in both Malay and Indonesian which means reform, specifically of the democratic kind. Protests from a broad civil society coalition of students, Muslim groups and women in 1998 saw Indonesia's outrageously corrupt dictator of more than three decades, Soeharto, step down.It has since seen the unshackling of its media; the emergence of non-traditional political actors including trade unionists, rights activists and feminists as well as a forceful re-emergence of Islamists; and the establishment of a range of anti-corruption and human rights protection institutions.Indonesia's wildly popular if somewhat goofy President Joko \"Jokowi\" Widodo has been accused of authoritarian tendencies, particularly after the outlawing of the Hizbut Tahrir group, which campaigns for Indonesia to adopt Islamic law and become a caliphate, under a controversial presidential decree in July 2017.But unlike most heads of state in the region, he is less about smearing the media and threatening NGOs than he is about shoring up support through building rural infrastructure and giving land rights to indigenous groups. He likes groovy jackets and giving away push bikes to kids.Indonesia's smaller, richer cousin Malaysia had lagged behind in its own Reformasi. But come May 2018, Prime Minister Najib Razak was turfed out by the electorate despite incessant gerrymandering and a rigged voting system. His demise came largely due to accusations he stole hundreds of millions of dollars from the sovereign fund 1Malaysia Development Berhad or 1MDB and the return to politics of now-PM Mahathir Mohamad.When in power between 1981 and 2003, Mahathir was known for his intolerance of critics and has since admitted to serving as a \"dictator\". Shortly after being elected in May, however, the 93-year-old took to Twitter to chastise authorities for arresting a man who had allegedly slandered him and Islam on Facebook. \"I don't agree with the action taken against those who criticise me,\" he said.Electoral democracy is not everything. Democracy is typically understood as requiring strong separation of powers and the protection of human rights. Like their Southeast Asian neighbours, both Indonesia and Malaysia have checkered human rights records. Law enforcement and the legal systems of both countries remain corrupt and inadequately independent.The year 1965 saw the massacre of up to a million leftists in Indonesia - one of the worst mass killings of the 20th century for which the perpetrators are yet to face any consequences. Malaysia still organises its society along the lines of race and class, providing benefits to the Malay-Muslim majority in a system that elsewhere would be described as apartheid. In both countries, anti-LGBT sentiment has grown in recent years, sparked by growing Islamic conservatism and pushes for same-sex marriage and other LGBT equality struggles in the West.Nevertheless, both states were the only in ASEAN to criticise Myanmar in a timely manner for the atrocities carried out against its Rohingya population, sending more than 700,000 people into neighbouring Bangladesh since August last year.Indonesian civil society organisations routinely criticise the government on a range of rights issues and stage public protests. Rapid domestic change is also afoot in Malaysia. Last month, the government announced it would bring in a moratorium on the death penalty with the view of abolishing it. The government has also said it will remove a \"pink tax\" on menstrual products.Most importantly, the Malaysian Anti-Corruption Commission is finally able to do its work unobstructed. Authorities have raided former prime minister Najib Razak's properties, seizing jewellery and luxury handbags worth millions of dollars. In September, he was arrested for alleged abuse of power, while his wife Rosmah Mansor was detained last month over money-laundering accusations.While it faces ongoing political threats, Indonesia's Corruption Eradication Commission (KPK) remains one of the most important, independent institutions of the democratic era. Just this April, it took down the speaker of the house, Setya Novanto, jailed for 15 years for corruption, sending a strong message to the nation's political class.Despite Samuel Huntington famously proclaiming in 1993 that \"Islam has bloody borders\", neither Malaysia nor Indonesia has fought a full-scale, international war since the Bornean Confrontation of the 1960s, in which Indonesia fought against colonial powers to oppose the formation of Malaysia. Neighbouring Australia, meanwhile, which then sent troops to repel the Indonesians, has fought in the Vietnam, Gulf, Afghanistan and Iraq wars, and has joined the coalition against the Islamic State in Iraq and the Levant (ISIL) in the Middle East.Indonesia's leadership within ASEAN has ensured decades of peace. None of the member states has fought each other since the 1980s. Former diplomat and dean of the Lee Kuan Yew School in Singapore, Kishore Mahbubani, has even argued that the bloc deserves a Nobel Peace Prize.Conservative pundits in the West have long argued that Islam is incompatible with democracy. But since 2004, Indonesia has held competitive elections deemed free and fair by international observers.\"If the 1990s was a decade of reform and political transformation in Southeast Asia, then the first two decades of the twenty-first century have seen disappointing dividends,\" concluded former editor of the Far Eastern Economic Review, Michael Vatikiotis, in his 2017 book Blood and Silk. Across the Mekong region, most ASEAN states have increasingly adopted the People's Republic of China's mode of autocratic capitalist development.A different story, however, is playing out in the Malay part of archipelagic Southeast Asia. Having campaigned on the issue, Malaysia's new government has cancelled several projects it deemed threatening to state sovereignty, while the Indonesian opposition has vowed to review China's Belt and Road project if elected in the 2019 presidential elections. Both countries are careful to maintain good relations with the West and India, as well as their trading partners in the Middle East.Much of the world may be having its doubts about democracy. Even in the Asia Pacific's veteran democracy Australia, a recent poll showed that a third of the population favoured an authoritarian or \"strongman\" type leader. But in the Muslim Malay world, it looks like democracy is here to stay.The views expressed in this article are the author's own and do not necessarily reflect Al Jazeera's editorial stance.Max Walden is a journalist focused on Southeast Asia and a PhD candidate at Melbourne Law School.\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}