{"id": "How do Palestinians see the Syrian war?", "paragraph": "A complex set of factors is shaping Palestinian attitudes towards Syria. Over the past few years, there has been a growing tension between supporters of the Palestinian cause and supporters of the Syrian revolution and opposition in the West. This has often turned into heated exchanges during public debates, in traditional and on social media. While these rhetorical clashes have often reduced the conversation on Syria and Palestine to a single narrative (supporting Palestine means supporting the Assad regime), the way Palestinians see the situation in Syria is much more complex than that.Since it gained independence in 1946, Syria has always had an important role to play in Palestine, both because of its geographic proximity and because of its direct confrontation with the Israeli state. From the early independence period to the Baathist era, successive Syrian governments have had the Palestinian issue among their top priorities. Yet the relationship between the various Palestinian political forces and Damascus has always seen its ups and downs. The Arab uprisings of 2011 shook the entire region and inevitably affected Syrian-Palestinian relations. They also stirred the Palestinian people who had also been suffering from growing alienation and dissatisfaction with their political elite.It is within this historical and contemporary context that we should view the relations and attitudes of the Palestinian people and their political leadership to Syria and the various political actors there.Throughout their long struggle against Zionism, Palestinian political factions have found support in Syria, often maintaining headquarters on its territory. Traditionally it was leftist, nationalist and Baathist movements in Palestine that were closest to Damascus, but as Hamas and Islamic Jihad came to prominence in the early 1990s and developed close relations with Iran, they also started receiving Syrian support. Syria would give Palestinian groups logistical assistance, training, and political backing to the level that no other Arab country would.Yet these close ties between the Syrian regime and various Palestinian political groups caused strain in relations with the official Palestinian leadership, especially during Yasser Arafat's time. Syria stood against the political course that he had undertaken, and encouraged a number of splits within his Fatah movement. In the early 1990s, a coalition of Palestinian forces opposing the peace process Arafat was part of came together and set up their base in Damascus.This led to a crisis in relations between the Palestinian authorities and the Syrian regime which ultimately ended with the death of Arafat and the rise to power of Mahmoud Abbas. Since then, Syria has pressed for rapprochement, fearing that the Palestinian Authority could move closer to Jordan and Egypt, curbing its influence over the Palestinian issue. The Arab uprisings of 2011 inevitably affected the relations between Syria and the Palestinian groups. The leftist and nationalist strands of the Palestinian political elite maintained their support for Damascus - like the Democratic Front for the Liberation of Palestine (DFLP) and the Popular Front for the Liberation of Palestine (PFLP) - declaring that the Syrian revolution was a Zionist plot. Fatah remained remarkably silent on the events in Syria although there have been a number of official visits by its members to the country. Hamas took a very different position. After much internal deliberation, it chose to leave Syria as a way to demonstrate its rejection of the Syrian regime's brutal crackdown on popular protests. It joined the axis of the Syrian opposition supported by Gulf states, cutting its relations with the regime and angering Iran. Although Hamas has maintained this position for more than seven years now, it feels growing pressure to change it; there are some members who already regret the group's decision to withdraw from Syria. As the US-Israeli-Saudi axis intensifies its campaign against Iran, it might seek to bring the Palestinian armed groups back into its \"axis of resistance\" with Hezbollah and other regional allies. This would mean that Hamas and Damascus would have to reconcile, which might be difficult to accomplish. Until 2011, the Palestinian people generally saw the Assad regime as more committed to their cause than most other Arab regimes. The Palestinian refugees in Syria enjoyed much better socioeconomic conditions than their counterparts in Lebanon and Egypt. But with the outbreak of the Syrian revolution, the situation in the Palestinian refugee camps quickly deteriorated. The Assad regime accused Palestinian refugees of joining protests and the armed opposition. A number of the camps, especially Yarmouk, saw fierce fighting between the regime and opposition forces and were almost completely destroyed.Thousands of Palestinians have been killed in Syria due to the fighting or debilitating sieges laid by the Assad regime on their camps; more than a thousand have also been detained in regime prisons. More than 100,000 Palestinian refugees have been displaced to third countries, including Lebanon, Jordan, Turkey, Egypt and a number of European states.The Arab Spring also affected attitudes towards the Assad regime in Palestine itself. When Arab peoples revolted one after the other, driven by decades of frustrations with their ruling elites, the Palestinians joined. They too had grown increasingly angry with the mismanagement and corruption of their political leaders. Although the Palestinian protest movement in 2011 was short-lived and quickly put down in the West Bank and Gaza, public support for the uprisings - including for the Syrian one - remained. A September 2012 poll found that almost 80 percent of respondents in the West Bank and Gaza were supporting the Syrian protesters and opposition. But over the years, as the Syrian uprising transformed into a bloody sectarian conflict, attitudes started to change. Reports of Israel providing support to some opposition groups in southern Syria did not help; for those who already believed that the revolution was an Israeli conspiracy, that was just another piece of evidence. By 2016, some 40 percent of respondents in a survey indicated that they supported the Free Syrian Army, one of the main moderate opposition groups at that time; 18 percent said they supported the Assad regime.Palestinians are increasingly convinced that their cause is not really one of the priorities of the Syrian opposition, or of any of the movements and groups that took part in the Arab uprisings. There is growing concern in Palestine that there is little interest in the rest of the Arab world in alleviating its suffering and putting up a fight against the Zionist project. Arab states have either focused on their own internal problems or have joined the Saudi-led group which seeks closer ties with Israel in an effort to create a united front against Iran. As for the Syrian regime, if and when it emerges from the current crisis, it in all likelihood would be unable to provide the same support for Palestinian political groups as it did in the past. Its own survival now largely depends on outside actors and its future will be sealed in a deal between foreign powers in which it is unlikely to have much say. The views expressed in this article are the author's own and do not necessarily reflect Al Jazeera's editorial stance.  Dr Adnan Abu Amer is the head of the Political Science Department at the University of the Ummah in Gaza.The Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.From Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}