{"id": "\n\n\n\nWhat makes family planning controversial in some African nations?", "paragraph": "The Stream is a social media community with its own daily TV show.In some African countries, reproductive health organisations say they are improving maternal health and empowering women to have greater freedom in their lives to decide when they bear children. But critics say family planning programmes, which are often funded by foreign philanthropy groups, are pushing a Western agenda and promote ideas that might be at odds with local culture. One UN-sponsored initiative, Family Planning, has a target of getting 120 million women and girls – particularly from Africa – to use contraceptives by 2020. \nFamily planning can refer to a wide range of services, including reproductive health education, the promotion of ideas like \"child spacing\", greater access to birth control pills and implantable devices, emergency contraceptives, or even elective sterilisation procedures.\nWhat are the challenges in promoting family planning ideas in African countries?\nWhat do you think? Record a video comment for leave your thoughts below.On this episode of The Stream, we speak with:\n Obianuju Ekeocha @obianuju\nFounder, Culture of Life Africacultureoflifeafrica.com/\nKaren Kaz Lucas @Karenkazlucas\nHost, The Spread Podcast\nAlex Ezeh @aezeh\nProfessor of Global Health, Drexel Universitydrexel.edu/\nGeorge Wirnkar @HumanLifeIntnl\nRegional Director, Human Life Internationalhli.org\n Read more:\nWhy family planning matters for maternal deaths and child survival  - The Conversation\nThe West is colonizing Africa with abortion and population control, Obianuju Ekeocha says - Christian Post  Every Monday through Thursday onAl Jazeera English or this site.What does the killing of a Kosovo Serb politician reveal about the deep fault lines running through the Balkan state?Kosovo, Serbia, PoliticsIraqi artists Dia al-Azzawi and Mahmoud Obaidi discuss the ongoing conflict and destruction in their homeland.Arts & Culture, Iraq, Middle EastWhile working on a kibbutz in 1967, a Japanese journalist discovers the hidden remains of a Palestinian village.Palestine, Al Nakba, JapanWe meet John Nicholson, Trump's top general in Afghanistan, to find out if the conflict can ever be brought to an end.ISIS, Taliban, Afghanistan\n \n\t\t\t© 2018 Al Jazeera Media Network\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t "}