{"id": "Tanzania: Abducted tycoon Mohammed Dewji returns home", "paragraph": "Businessman says his abductors spoke a Southern Africa language, confirming suspicions that they were foreigners.Tanzanian tycoon Mohammed Dewji, who was kidnapped a week ago in Tanzania's economic capital Dar es Salam, has returned home unharmed.Dubbed as Africa's youngest billionaire, the 43-year-old heads the MeTL Group which operates in about 10 countries with interests from agriculture to insurance, transport, logistics and the food industry.\"I thank Allah that I have returned home safe and sound,\" Dewji told a press conference on Saturday in Dar es Salaam where he was abducted on October 11 as he entered a gym at a hotel.He also thanked the \"Tanzanian authorities, including the police, who worked for my return\".\"I thank all my fellow Tanzanians and everyone around the world for their prayers,\" he added.\"I thank Allah that I have returned home safely. I thank all my fellow Tanzanians, and everyone around the world for their prayers. I thank the authorities of Tanzania, including the Police Force for working for my safe return.\" — Mohammed Dewji(3:15AM, Dar es Salaam)Dewji earlier tweeted that he had been released and his father, Gullam Dewji, confirmed his son's release in comments to the Tanzanian daily Mwanachi.Simon Sirro, national police chief, said the businessman had provided some information about the kidnapping, \"Mohammed Dewji told us that the kidnappers wanted money but were very afraid, even though they were armed. He asked them several times how much they wanted but they gave no figure,\" Sirro said.\"We now know their network, we know which country the plans were made,\" he added, without giving details.Dewji had indicated that his abductors spoke a Southern Africa language, confirming suspicions that the kidnappers were foreigners, said Lazaro Mambosasa, Dar es Salam police chief.The family had offered a reward of one billion Tanzanian shillings ($440,000) for information that would help police find him.Dewji is Tanzania's richest man and is reportedly worth $1.5bn. He served as a member of parliament from 2005 to 2015.In 2013, he became the first Tanzanian to be featured on the cover of Forbes magazine. Two years later he was named Forbes Africa Person of the Year.In 2016, he signed a pledge to donate at least half of his fortune to philanthropic causes, according to Forbes.\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}