{"id": "Exporting Hungary's media model", "paragraph": "Most Searched20 Oct 2018 19:41 GMT Media, Hungary, Europe, CensorshipAfter a third successive landslide election victory this past April, Prime Minister Viktor Orban's dominance over Hungarian politics is clear. And with allies taking over previously critical news outlets, his influence over the Hungarian media seems equally unassailable.Last month, a member of Orban's ruling coalition took a 50 percent stake in the company that controls advertising revenues for Index.hu, one of Hungary's last news outlets to maintain credibility on both sides of the political spectrum.\"The most important question is how the ownership change will affect our independence,\" says Gabor Miklosi, editor-in-chief of Index.hu. \"We set up a an 'independence barometer' on a separate web domain from Index. If we feel that someone is influencing our work then we will change the barometer from 'independent' to either 'at risk' or 'not free'.\"Following the election, Hungarian media consumers saw the shutdown of the 80-year-old daily newspaper, Magyar Nemzet, and its sister radio station, Lanchid Radio. Under the ownership of Orban-opponent Lajos Simicska, these outlets had maintained a critical stance but suffered big losses after being cut off from state advertising. The sale of Simicska's popular cable news channel, Hir TV, was followed by a shift in editorial line.In 2015, the previously critical news portal Origo was sold to pro-Orban investors.\"Origo used to be a competitor of Index and it used to be independent,\" Miklosi says. \"By now, it has been completely degraded and [has become] a propaganda mouthpiece of the government. These tabloids do not function as media, but rather as subsidiaries of the ministry of information.\" We set up an 'independence barometer' on a separate web domain from Index. If we feel that someone is influencing our work then we will change the barometer from 'independent' to either 'at risk' or 'not free'.Gabor Miklosi, editor-in-chief, Index.hu Tabloids such as Ripost serve the sensationalist bottom end of the Hungarian media market. Coverage tends to be dominated by outrage against the EU, migrants and Orban's political enemies.According to some, it's an imported media model that Orban's allies are now promoting in countries outside Hungary's borders.\"Ripost is a copycat version of Informer in Serbia,\" says Zselyke Csaky from Freedom House. \"Orban essentially imported something from another country and now, he's exporting it to other countries in the Balkans.\"Ripost's Hungarian co-owner, Peter Schatz, has been linked with investments in media outlets in both Slovenia and Macedonia. In both cases, Hungarian money effectively bailed out loss-making concerns in the run-up to important national plebiscites.According to Akos Keller-Alant, a journalist at Magyar Narancs, \"In Slovenia, they bought media co-owned by the right-wing, nationalist, populist party, the SDS. Viktor Orban personally campaigned for SDS leader Janez Jansa during the recent election campaign. In Macedonia, Hungarian-owned media outlets called for a boycott of a referendum on changing of the country's official name to enable it to join the European Union. Both there and in Slovenia, Hungarian-owned media disseminates far-right, populist messages.\"On September 12, the European Parliament voted to trigger Article 7 of the EU's treaties against Hungary over the rollback of human rights and civil liberties in the country, including freedom and plurality in the media.The Article 7 process could lead to Hungary having its EU voting rights suspended. In this context, and with the 2019 elections for the European Parliament approaching, Hungarian investments in the media of other EU and prospective EU member states fit with Orban's ambition to form an alliance in central and southeastern Europe around anti-integration and anti-migrant politics.\"On the one hand, they provide know-how. How to rule the media landscape, how to set the public agenda, how to run a propaganda media network,\" explains Agnes Urban of Mertek Media Monitor. \"On the other hand, we see 'shopping trip' acquisitions with no genuine business motivations. As in Hungary, it is not lucrative to run a propaganda machine, however, it does pay off in politics.\"Contributors  Agnes Urban - Economist, Mertek Media Monitor  Gabor Miklosi - Editor-in-chief, Index.hu  Zselyke Csaky - Senior researcher, Freedom House  Akos Keller-Alant - Journalist, Magyar Narancs  Sandra Basic-Hrvatin - Head of Media Studies, University of PrimorskaSource: Al Jazeera\r\n      Commenting has been disabled. To find out more, click      \r\n      here.\r\n     The Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nInteractive, Philippines, EnvironmentRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.Europe, Russia, Saudi ArabiaFrom Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.Environment, Native Americans, US & CanadaAnswer as many correct questions as you can and see where your country ranks in the global cost of living.InteractiveStatement comes after US media reports say CIA has concluded Saudi crown prince ordered Khashoggi's murder.Jamal Khashoggi, Middle East, Saudi Arabia, Turkey, Journalism Is Not A CrimeThousands of people blocked roads across France during 'yellow vest' demonstrations against the rising price of fuel.France, Business & Economy, Emmanuel Macron, EuropeMeet the hardline group willing to do anything, including going against their government, to claim land for Israel. Israel, Occupied West Bank, Middle EastMoroccan dissident Abraham Serfaty was jailed, tortured and exiled for his radical views over decades.History, Morocco, Human RightsAn insight into the Trump administration's relationship with the religious right and implications for US politics.Religion, Donald Trump, US Midterms 2018In an age of non-stop news feeds and disposable media, which stories and images stay with us and how do they shape us?Journalism, Humanitarian crises, Media\n \n\t\t\t© 2018 Al Jazeera Media Network\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t "}