{"id": "'Leave Pittsburgh': Protesters greet Trump after synagogue attack", "paragraph": "Trump visits city where a gunman killed 11 in one of the worst acts of anti-Semitic violence in the US in recent memory.US President Donald Trump arrived in Pittsburgh as funerals began for the victims of last weekend's anti-Semitic shooting at a synagogue in the US city that left 11 dead. The Republican leader came to the city on Tuesday despite statements by several Jewish leaders that he would not be welcome.Those calls came from progressive Jewish groups, as well as the former president of the Tree of Life synagogue, which was attacked by suspected gunman Robert Bowers on Saturday. Bowers reportedly made anti-Semitic remarks as he opened fire on worshippers inside the building, killing 11 and wounding several others, including police officers responding at the scene.Before Trump's arrival, a crowd of protesters blocked the entrance to the city's Republican club, over the party's purported failure to denounce white supremacism.Protesters also shouted \"Leave Pittsburgh, leave Pennsylvania\" as Trump and First Lady Melania Trump visited the Tree of Life Synagogue. There were also signs that read \"Trump go home\" and \"words matter\". Elisa Borrero, 26, held a sign reading \"Stronger than hate\", decorated with the Star of David. The research lab worker said she has friends who lost loved ones in the shooting.She blamed Trump's rhetoric for encouraging increasingly toxic political divisions that can lead to violence.\"The shooting is almost like a manifestation of his hate that really hits home,\" she said. \"I wanted to let him know we do not want him here.\"Others, including Yulia Kushner, who lives in the Squirrel Hill neighbourhood near the Tree of Life Synagogue, acknowledged many in the Jewish community did not want Trump to visit because they blame his rhetoric for increasing hate, but it was still fitting that the president paid his respects.\"It's not like I'm a Trump supporter,\" Kushner told Al Jazeera. \"But today we have to concentrate on mourning and set aside our political differences.\"The protests and memorial vigils coincided with funerals for victims of Saturday's mass killing, one of the worst acts of anti-Semitic violence in the US in recent memory.Several of those killed were alive at the time of the Holocaust. In posts online before the shooting, Bowers had blamed a Jewish NGO, the Hebrew Immigrant Aid Society, for helping immigrants and refugees enter the US.He also voiced anger at Trump for surrounding himself with Jews.In the initial aftermath of the shooting, Trump suggested that an armed guard at the synagogue may have been able to stop the attack \"immediately\". He also condemned the shooting and called for the death penalty for the attackers.In a week marred by violence, the killings have intensified focus on Trump's role in stoking the far right. The US president has repeatedly used terms, such as \"globalist\", which has a historic anti-Semitic connotation, and has indulged in conspiracy theories that originated in white supremacist circles, such as his unfounded claim that George Soros was funding protesters against his Supreme Court pick.Additional reporting by Chris Kenning in Pittsburgh. \r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}