{"id": "The Brexit endgame ", "paragraph": "Most Searched17 Nov 2018 12:09 GMT Business & Economy, Brexit, United Kingdom, Theresa May, EuropeUK Prime Minister Theresa May's draft agreement over Britain's departure from the European Union has sparked an extensive amount of controversy. The deal has been described in rather unglowing terms as a least bad Brexit, but May says the draft agreement she managed to stitch together is in the national interest.Addressing the nation, she said it's better than no deal and she wants to use it as the basis for negotiating the future economic relationship with the European Union. But getting her divorce accord ratified by parliament may prove impossible, as she faces opposition outside and within her own party. Several of her ministers have resigned. The draft agreement focuses a lot on new proposals over the Irish border. Both sides have committed to avoiding a hard border between Northern Ireland and the Republic of Ireland. There's an arrangement to keep the UK within the EU 's customs union after Brexit for a certain amount of time. The customs union is the arrangement by which EU members apply the same tariffs to products imported from the rest of the world. Brexit's been a massive distraction of efforts, of energies - it was really a misguided decision but we have to live with it.Lorenzo Codogno,  founder and chief economist, LC Macro Advisors \"Brexit's negative for the UK and the rest of the EU, so there's no doubt that any kind of deal you can strike with the UK and the EU is going to be negative, but at least it's less negative than other options that are on the table,\" explains to Lorenzo Codogno, founder and chief economist at LC Macro Advisors.\"It would be highly disruptive if there was no deal and the UK ends up with the WTO backstop ... so, the one solution that's on the table - and while not yet 100 percent sure, clearly, as it has to go through the political process and approval - is the least damaging option.\"\"It's probably going to end a long period of political uncertainty in the UK, which started with the referendum. Too much time in the UK has been detracted by this whole issue, and the government has more important things to do ... So, it's good news if we at least have a deal.\"While UK citizens will \"be paying for Brexit, this deal is also negative for the EU,\" says Codogno, \"it's a lose-lose proposition, so everybody's going to lose. But clearly, the UK is going to lose more than the EU.\"Ultimately, \"Brexit's been a massive distraction of efforts, of energies - it was really a misguided decision but we have to live with it. UK people decided to leave the EU and the government has to deliver, but it has been a massive distraction from more important issues.\"The global oil market is to experience an oversupply of oil in 2019, according to a new report by the International Energy Agency (IEA). It also highlighted the relentless growth in non-OPEC supply.Most of the world expected Iran's oil output hit by US sanctions to fall to zero, but with the US granting waivers to eight countries, that will no longer be the likely scenario. It has sparked OPEC's top producer, Saudi Arabia, to call for a cut in production by OPEC countries as early as December. Slamming the brakes on oil production is a dramatic turnaround for the cartel, which up until recently was ramping up production.However, it's unlikely there will be a production cut at the next OPEC meeting, suggests Professor Giacomo Luciani from the Graduate Institute in Geneva, because of disagreements between members. \"The Russians don't seem ready to cut their production now. I've never been happy with prices reaching $80 or more per barrel, but I think it's too early for them to react and reduce production and that makes it very difficult for OPEC, as well.\"Drilling for oil in shale rock, known as fracking, has dramatically reshaped the global oil industry. And US shale oil production continues to defy expectations. The IEA predicts the US will rival OPEC when it comes to market share in the years ahead. But some say the new black gold rush in the US is overhyped, as shale is hard to reach and reserves decline quickly.Explaining current US oil policy Luciani says \"it's pursuing two different aims. One is to increase shale oil production, and that's favoured by higher prices and the other is to defend the American consumer against price increases. The miracle of shale oil production in the US has been going on for a long time ... and in the last year, the US has added 1.5 million barrels to oil production and that's quite remarkable.\"Broadly speaking, \"the oil market's influenced by the market opinion and sentiment on broader economic data. There's considerable uncertainty about the future of the global economy. Continuing commercial conflict between the US-China, difficult relations between the US and Europe, Brexit - all of this is not very positive at all,\" concludes Luciani.Also on this week's episode of Counting the Cost:UK poverty: People are getting poorer in Britain and the United Nations is trying to find out why. The world body is to investigate areas in the UK hardest hit by a decade of austerity, such as the town of Jaywick on England's east coast. Laurence Lee reports.Iran-China relations: China could be Iran's most important economic ally. It's one of the most loyal customers when it comes to buying Iranian oil. US economic pressure has not spared Chinese businesses. But in the face of penalties from Washington, the Chinese say they'll stick by Iran, as Zein Basravi reports from Tehran.Amazon's new headquarters: Amazon, one of the biggest corporations on the planet right now, has recently announced that it has chosen New York and Virginia to house its new headquarters. But, as Kristen Saloomey reports from New York, not everyone is celebrating.Source: Al Jazeera News\r\n      Commenting has been disabled. To find out more, click      \r\n      here.\r\n     The Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nInteractive, Philippines, EnvironmentRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.Europe, Russia, Saudi ArabiaFrom Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.Environment, Native Americans, US & CanadaAnswer as many correct questions as you can and see where your country ranks in the global cost of living.InteractiveDraft UK-EU Brexit deal sparks political turmoil in Britain, with Prime Minister Theresa May assailed from all sides.Brexit, United Kingdom, European Union, Europe, Theresa MayOPEC and its allies are set to meet in Algeria on Sunday to discuss the price of oil. Oil Price, Donald Trump, US & Canada, United States, Saudi ArabiaStatement comes after US media reports say CIA has concluded Saudi crown prince ordered Khashoggi's murder.Jamal Khashoggi, Middle East, Saudi Arabia, Turkey, Journalism Is Not A CrimeThousands of people blocked roads across France during 'yellow vest' demonstrations against the rising price of fuel.France, Business & Economy, Emmanuel Macron, EuropeMeet the hardline group willing to do anything, including going against their government, to claim land for Israel. Israel, Occupied West Bank, Middle EastMoroccan dissident Abraham Serfaty was jailed, tortured and exiled for his radical views over decades.History, Morocco, Human RightsAn insight into the Trump administration's relationship with the religious right and implications for US politics.Religion, Donald Trump, US Midterms 2018In an age of non-stop news feeds and disposable media, which stories and images stay with us and how do they shape us?Journalism, Humanitarian crises, Media\n \n\t\t\t© 2018 Al Jazeera Media Network\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t "}