{"id": "Kateryna Handziuk: Ukraine activist, 33, dies from acid attack", "paragraph": "Handziuk had recently called on the government to probe attacks on activists as she tried to recover in hospital.Kateryna Handziuk, a 33-year-old Ukrainian anti-corruption activist and political adviser, died on Sunday after suffering critical injuries from an acid attack in July.Handziuk, who was an adviser to the mayor of Kherson and critic of local police, sustained severe burns to more than a third of her body after she was sprayed with a litre of sulphuric acid outside her home in the southeastern city of Kherson. She had been battling the injuries in a hospital in Kiev, where she underwent 11 operations.Five suspects have been detained for their alleged involvement, but no further information has been released about who ordered the attack.From her hospital bed and covered in burns, Handziuk had recently called on the government to probe rising attacks on activists.Police initially listed the case as \"hooliganism\" but after public uproar changed it to \"attempted murder committed with extreme cruelty\".Local and international human rights groups have recorded more than 55 unsolved attacks on activists - including Handziuk - since the start of 2017.President Petro Poroshenko on Sunday called on law enforcement agencies to do \"everything possible\" to find and punish Handziuk's killers.But campaigners say his remarks are too little, too late.Marya Guryeva from Amnesty International Ukraine told Al Jazeera: \"The situation is getting worse and has been for about a year now. Many attacks have been identity-focused - committed by far-right groups against LGBT and Roma people. But now we see they are happening against anti-corruption activists, too.\" Natalia Shapovalova, a Ukraine expert from Carnegie Europe, told Al Jazeera: \"Activists campaign against corruption, they name the names of people who are behind illegal construction. Those people are not happy and they try to shut up the activists.\"In one case, on October 4, politician Sergiy Gusovsky was doused with an antiseptic liquid and beaten in Kiev City Council following his speech at a rally.Gusovsky told Al Jazeera he was attacked because he opposed various investment agreements, highlighting his work in challenging the construction of 25 buildings in Kiev's Echo Park for ecological reasons.\"If an attack inside Kiev's city council can't be stopped, it's impossible to keep any public figure safe,\" he said.About two weeks earlier, anti-corruption activist Oleg Mikhaylik was left in critical condition after he was shot in the chest by an unidentified assailant in the southeastern city of Odessa. On the day of the shooting, he had protested against illegal construction on the Lanzheron Beach.Mikhaylik, who is currently housebound for safety reasons, leads the local branch of the People's Power movement and had recently announced himself as a candidate for the 2020 mayoral elections. He told Al Jazeera he believes the attack was organised by local authorities.Activists say police rarely investigate the attacks, nurturing a climate in which more violence can take place. \"People who order the attacks are never brought to justice. In the last nine months, only one case was investigated and closed. Ninety-nine percent of the time there is impunity,\" said Amnesty's Guryeva.Carnegie Europe's Shapovalova added: \"The lack of investigation reflects inadequate reform in the justice system, and corruption - the biggest problem facing Ukraine today.\"Dmytro Bulakh, head of the Kharkiv Anti-Corruption Center has been assaulted several times, apparently for his anti-corruption work, most recently in August 2017 when unknown assailants punched him in the head with knuckle dusters and broke three ribs. He was in hospital for nine days.President Poroshenko introduced what he calls а Western-oriented reform to cleanse the judiciary, starting mid-2016.However, his critics see the actions as an effort to establish control over the courts and ensure impunity for corrupt, high-level officials.According to Bulakh, the government views civic activists as opponents. \"I am convinced the passivity in government is a kind of revenge for our attempts to rid the country of corruption and create accountability.\"Over the past few months, protesters have gathered outside government buildings across Ukraine in a campaign called \"silence kills\", urging the authorities to properly investigate the attacks. Following a rally in September, Ukraine prosecutor general and presidential appointee Yuriy Lutsenko said activists were partly to blame for the violence because they create an \"atmosphere of total hatred toward the authorities\".But according to Amnesty's Guryeva, officials do not show enough effort in responding.\"There are hardly any public statements, and only after huge resonance in the country did we see some tweets by politicians. You would expect that they would loudly condemn such acts.\"\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}