{"id": "Honduran caravan met with outpouring of support in Guatemala", "paragraph": "Thousands of migrants and refugees headed to the US find temporary shelter and help as they pass through Guatemala.Esquipulas, Guatemala - A small laundry basket full of shoes sits outside Ana Ruth Alvarado's eatery in Esquipulas, located 10km away from Guatemala's border with Honduras.A sign is taped to the basket, letting passing migrants and refugees, who are part of a caravan headed towards the US, know they are welcome to take a pair. Bags of water and bread sit on a table above the shoes, and a note encouraging people to donate sweaters is nearby.An initial wave of Honduran migrants and refugees came through here on October 15, and most of them are now travelling up through southern Mexico. But hundreds of Hondurans have been making their way through Esquipulas every day since.\"We do what we can,\" Alvarado tells Al Jazeera of the ad hoc support centre in front of her business, along one of the main streets of Esquipulas.Originally from El Salvador, Alvarado makes and sells simple meals, including pupusas, the most iconic Salvadoran food. But she also runs a small migrant support group called Corazones Bondadosos, which translates as Generous Hearts. In the eatery's kitchen, Reina Madrid is busy making corn dough and preparing meals for customers. Al Jazeera first interviewed the mother-of-four over the weekend, when she had just arrived after an arduous journey across the border, where police were blocking hundreds of Hondurans from leaving.Madrid, a cook who left Honduras due to unemployment, is now cheerfully working away in the kitchen. She slept, ate, and has clean and dry clothes. She also has some temporary work for now, helping out Alvarado.\"It's all thanks to her,\" Madrid tells Al Jazeera, referring to the job that will help her send money to her children for food, bills, and school supplies.Madrid is one of thousands of Hondurans who left their country en masse over the past 10 days, fleeing violence and unemployment. Dubbed a migrant caravan, there are now groups ranging between a few people and several thousand at different points in Guatemala and Mexico.US President Donald Trump has been tweeting against the exodus since it began, threatening to cut aid to Central American governments, deride regional government responses, shut down the border, and call in the military to stop the caravan's advance. The Mexican, Guatemalan and Honduran government have also responded to the mass exodus with similar rhetoric, as well as concrete measures, including beefing up the presence of security forces at their borders.Hundreds of Hondurans are still managing to get out, though, often hiking around the border and police checkpoints. They walk into Esquipulas, and just a block away from Alvarado's corner eatery, they go to the local Casa del Migrante Jose shelter.The shelter, which is affiliated with the Catholic Church, is entirely volunteer-run.According to volunteer Griselda Garcia the shelter celebrated its one-year anniversary last month, but a group of volunteers have been supporting migrants and refugees for much longer.They started organising to provide relief and support for the wave of African migrants and refugees heading north through Central America over the past few years, she says, taking a brief break from her cooking duties.\"At first we started just giving coffee and bread. The truth is we saw people were in need, and when one sees kids, one is even more moved,\" Garcia tells Al Jazeera. The shelter provides food for migrants and refugees, and a place to stay when possible. But lately there have been so many people they have had to borrow two large halls belonging to the Catholic Church to provide somewhere for everyone to sleep.\"Every day, 400 or 500 people arrive to us here,\" Garcia says, referring to the current exodus from Honduras.\"There are many families, many single mothers, and many youth passing through,\" she says.The situation in shelters all around Guatemala is similar to that of Esquipulas, where Guatemalans are providing a place to rest, as well as rides, food, water and clothing to help out their Honduran neighbours. Back in Esquipulas, a young man interrupts Garcia to ask if there are plastic bags left over from the water that can be used as rubbish bags for people wanting to help clean up. They're out of the bags, it turns out, but will improvise.Garcia and the other volunteers come in shifts and help out whenever possible, but they also all have jobs and families, she says. Regardless, they're committed to providing food, shelter and support to the waves of Honduran migrants and refugees that continue to cross the border into Guatemala on a daily basis.\"We will continue as long as we can,\" says Garcia.\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}