{"id": "Slim chance Khashoggi killers will be tried in Turkey: experts", "paragraph": "Experts say those responsible for the murder are unlikely to see inside of a Turkish court, despite calls by Erdogan.Istanbul, Turkey - Despite calls by Turkish President Recep Tayyip Erdogan to extradite and try those involved in murdering Saudi journalist Jamal Khashoggi, experts say chances of the Saudi suspects facing trial in Turkey are slim.Breaking his silence on the case on Tuesday, Erdogan laid out several details about the October 2 murder of the Washington Post contributor, which took place inside the Saudi consulate in Istanbul.Erdogan said a group of Saudi nationals \"pre-planned\" the \"brutal\" murder and called on the kingdom to extradite the 18 suspects to Turkey to face justice.On Wednesday, Turkish Justice Minister Abdulhamit Gul said: \"If Turkish prosecutors find evidence or strong suspicion of involvement of the Saudi consul in the Khashoggi murder, [they] can open an invitation and demand the extradition of the Saudi consul to Turkey by a court order.\"However, legal experts told Al Jazeera that the chances of extradition were slim.\"According to international laws, a state shall not extradite its own citizen,\" said Guclu Akyurek, associate professor of criminal law at Mef University in Istanbul.Akyurek said since the two countries do not have an extradition treaty between them, their only option is to sign an ad hoc agreement, valid only in the Khashoggi case.William Schabas, professor of international law at Middlesex University, said such a deal was unlikely. \"If [the suspected killers] are in Saudi Arabia, there is no legal obligation to extradite,\" Schabas said.Saudi Crown Prince Mohammed bin Salman has called the killing a \"heinous crime that cannot be justified\".In his first public comments in the weeks since Khashoggi's murder, the crown prince, known as MBS, said on Wednesday that the perpetrators would be brought to justice with the help of Turkey.However, the crown prince is under increasing pressure as critics believe he had knowledge of and possibly ordered the killing. University of Parma professor Stefano Maffei, an expert on extradition, said Turkey could go to Interpol if Saudi Arabia did not cooperate in the investigation.Interpol would then issue what is called a \"red notice\", an international request for arrest and extradition, he said. It would prevent the suspects from travelling abroad, where they may be arrested.\"They would have to remain in Saudi Arabia for the rest of their lives,\" he said.Stefano Maffei, University of ParmaBecause the murder involves diplomatic missions, the case is even more challenging to pursue.\"Embassy and consulate premises are inviolable,\" Schabas said, adding it was the reason why the killing allegedly took place there.This inviolability led to Turkish investigators not being able to enter the Saudi consulate for several days after the murder.However, Maffei said, immunity is only valid for the consulate building, not the people who work there.\"Being a diplomat does not allow you to kill anybody. If a diplomat is responsible for killing somebody, the country where the murder happened will have full jurisdiction to try that person,\" he said.\"But there is an additional problem. If the evidence of the murder is inside the consulate, the investigation would require Saudi Arabia's cooperation,\" Maffei added.Referring to the 1963 Vienna Convention, Mef University's Akyurek said: \"Consular officers can be arrested or detained pending trial in the case of a grave crime and pursuant to a decision by the competent judicial authority.\"All 18 suspects in Khashoggi's killing are in Saudi Arabia, where they were arrested by Saudi authorities for their alleged involvement, indicating Riyadh's attempt to try them itself.Five high-ranking members of the Saudi government have also been fired for their alleged ties to Khashoggi's murder.Following these arrests and dismissals, several organisations, including the United Nations and European Parliament, called for an independent investigation.But Maffei told Al Jazeera there is little chance of the case reaching an international body such as the International Criminal Court (ICC).\"The ICC jurisdiction is limited in situations where countries are unable or unwilling to prosecute,\" he said.For Schabas, the killing of a journalist inside a consulate does not constitute an international crime. \"It's just a murder,\" he said.\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}