{"id": "Will Caspian deal help 'barely surviving' fishermen in Dagestan?", "paragraph": "Five-nation deal signed this year expected to add to fishermen's burden in Dagestan village by increasing restrictions.Kraynovka, Russia - After more than 20 years of dispute, five countries - Russia, Iran, Azerbaijan, Kazakhstan, and Turkmenistan - have signed an agreement that will resolve the legal status of the Caspian Sea, and devised a formula to divide its resources.Besides vast oil and gas reserves, the Caspian Sea is enormously rich in fish, with sturgeon being the most valuable. The average price for caviar - fish roe, specifically from sturgeon - can run up to 25,000 roubles ($380) a kilo on the black market in Russia. But fishermen are expected to be the last to benefit with strict measures and fines in place, not only for selling the banned product - it is illegal in Russia to privately harvest or sell black caviar, which comes from the endangered sturgeon fish - but also due to the new sweeping and convoluted laws controlling the sea. Kraynovka is a small village on the shore of the Caspian Sea, an hour's drive along a bumpy road from the nearest city of Kizlyar in northern Dagestan. There are 2,648 people living there currently.Ruslan Amirov, fishermanIn its booming years, the Soviet '60s, the village hosted a large fish factory employing most locals and villagers from the surrounding areas. Ruslan Amirov's parents moved to Kraynovka when he was five or six years old.He had already started fishing by the time he was 11. \"We didn't use any boats back in the day, you could put a net near the shore, where the water reaches your knees, and catch something,\" he reminisces.There were plenty of fish \"back in the day\". Now, the numbers are dwindling, according to statistics from the Federal Agency for Fishery. This, combined with the ban on fishing sturgeon and strict restrictions by border control, place a heavy burden on fishermen's shoulders.Amirov lives in a small apartment that his mother received from the government while working at the factory. Now, half of that two-storey building is abandoned. The empty window frames used to frighten the village children as they passed by, but they've grown used to it. Several houses in the village are this dilapidated. There is no central heating and power outages are frequent.Amirov has to provide for his small son and pregnant wife by fishing in the Caspian. He worked for two years in Sochi before the 2014 Olympics, making 50,000 to 60,000 roubles ($750 to 900) a month, but decided to return to where he grew up.   \"People are barely surviving here. If there were any other jobs, no one would go to sea,\" says Amirov. \"Now, fishermen have to travel between 200 and 400km [to catch fish]. They are being caught [by border authorities], killed and drowned but they have to feed their families somehow; they have to pay off their debts. There's no other solution,\" says Amirov. \"What's the point of them looking for other jobs? It's easier to go to sea once and take the risk, then, they'll be able to pay off their debts.\" In December 1992, at a meeting of fishery representatives from Azerbaijan, Kazakhstan, Turkmenistan and Russia, a protocol was signed establishing the Interdepartmental Commission on Aquatic Bioresources of the Caspian Sea. This commission has become the only body for joint management of the Caspian's plentiful wealth.The official ban on fishing sturgeon in the Caspian was implemented in 2009 and has been renewed every year since.Stanislav Pritchin, an analyst at Chatham House and one of the most prominent experts on the Caspian Sea's legal negotiations, says that \"there's no other way but imposing a ban\" as sturgeon is \"becoming extinct\".\"The fishing industry is quite a painful topic because poaching is very common in the Caspian Sea. It is a very profitable industry, and sturgeon is a very valuable breed of fish, especially for black caviar. \"There is an official ban on sturgeon fishing in the Caspian Sea, but in practice, it is very difficult to put such restrictions on fishermen, because for them it is a source of income, a source of profit, sometimes the only one, says Pritchin.\"Therefore, there are strict controls on the fishermen. I believe that this is a justified measure, given that the situation in the Caspian Sea and the environment, in general, is not the best.\"The area around the village and port has turned into a border control zone, so anyone crossing this virtual border without permission - a document can be obtained in Kaspiysk, 18km from the capital, Makhachkala - would be fined.Fishing hours are strictly regulated: fishermen have to be back at the port before sunset, around 7.30pm, which affects their customary fishing techniques. One example is the mugil, a fish which they can no longer catch as it must be netted at night.According to the Russian Foreign Ministry and Federal Agency for Fishery, the ban needs to be maintained until at least 2027 in order to replenish the sturgeon population.\"Dagestan's fish industry has been and still is one of the leading sectors of the republic's economy. Dagestan has significant potential to develop its fishing industry with all its components - from fish and aquaculture production to the processing of aquatic organisms and product sales,\" says Russian agriculture deputy minister and head of the federal fishery agency, Ilya Shestakov.According to the agency, since the start of 2018, there have been 3,009 cases of administrative offences and 47 criminal cases registered in the Caspian. Border authorities have seized 1,358kg of sturgeon during this same period.\"An important component of the fight against this evil is, of course, the fight against the trafficking of illegally obtained aquatic biological resources. \"We are taking a number of steps to ensure full traceability of the origin of aquatic biological resources in our markets, and we believe that they will be applied together with the Ministry of Industry and Trade of Russia in the very near future,\" Shestakov told Al Jazeera. For women, there's even less work in Kraynovka and few want anything to do with fish.Zapir Amaradziev raises a 13-year-old son by himself, as his wife left nine years ago. He says that \"she got tired of this sort of life.\"\"It's like gambling here. If you go to sea and bring back some fish - you are lucky, otherwise, you drown in debt,\" he adds. Amaradziev has accrued large debt through buying nets and petrol for the last fishing season.In August, he only managed to go to sea five times due to unfavourable conditions. The Caspian is famous for strong winds that fishermen cannot weather in their light, self-made boats, or \"baydas\", equipped with fast engines and little else. When asked whether his son will follow in his footsteps, Amaradziev says that he desperately doesn't want him to become a fisherman. His son, sitting nearby, exclaims, \"Yeah, no way in hell!\" Amaradziev continues: \"It's getting worse and worse here. I would love to sell all this fishing equipment, including the boat, but I wouldn't know what else to do.\"\r\n            SOURCE: Al Jazeera News\nThe Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.From Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}