{"id": "After protests, Felix Tshisekedi quits DRC opposition unity deal", "paragraph": "Move casts doubt over whether opposition can defeat Emmanuel Ramazani Shadary, who is backed by President Joseph Kabila.Felix Tshisekedi, head of the largest opposition party in the Democratic Republic of the Congo (DRC), has pulled out of an agreement to field a joint candidate in next month's crucial presidential elections.The move on Monday cast serious doubt over whether the opposition can defeat Emmanuel Ramazani Shadary, the challenger backed by longtime President Joseph Kabila in the December 23 vote.It came just a day after Tshisekedi signed a pact with six other top opposition figures who chose Martin Fayulu as their single contender after three days of negotiations in the Swiss city of Geneva.But on Monday, Tshisekedi's Union for Democracy and Social Progress (UDPS) party issued a statement which demanded the leader withdraw his signature from the document.\"I gather that the agreement reached in Geneva was not accepted by the grassroots and was rejected by them,\" Tshisekedi said in an interview with radio station Top Congo later on Monday.\"As a result, I am withdrawing my signature from this agreement, which we signed yesterday.\"The choice of Fayulu was seen as a surprise development, with Tshisekedi - son of longtime opposition leader Etienne Tshisekedi - widely regarded as the frontrunner before the announcement. As news spread in the capital, Kinshasa, demonstrators on Monday gathered in the pouring rain to express their discontent outside the UDPS party headquarters.Pierrot Mwanamputu, police spokesperson, told the AFP news agency that the crowd burned effigies and pictures of Tshisekedi, while witnesses reported seeing them burning tyres.A similar protest took place outside the offices of the UNC, a party headed by Vital Kamerhe, a former National Assembly speaker, who had also been flagged as a possible unity choice in Geneva.Tshisekedi, who has a home in Belgium, has not yet returned to Kinshasa.Earlier, Kabila's ruling PPRD coalition said it was \"not worried\" by the choice of Fayulu.\"I wonder if they will have time to prepare to face our candidate, who has a team which has been working for many months,\" Tunda ya Kasende, the PPRD's deputy secretary-general, said.The upcoming elections are critical for the future of the DRC, a mineral-rich country that has never experienced a peaceful transition of power since it gained independence from Belgium in 1960.Kabila, 47, has been in power since 2001 after the assassination of his father, Laurent-Desire Kabila, the country's third president.He was elected in 2006 and secured a second term in 2011, though that vote was plagued by allegations of widespread voter fraud.Kabila's mandate expired in late 2016, but he remained in office after presidential elections were postponed twice.The country has been struggling with various internal conflicts, which forced millions of people from their homes. It has also seen violence and widespread anger over what some saw as Kabila's refusal to relinquish power after the end of his second full term two years ago. \r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}