{"id": "Comic book genius Stan Lee, creator of Spider-Man, dies at 95", "paragraph": "Lee revolutionised comic books by introducing human frailties in superheroes such as Fantastic Four and Incredible Hulk.Stan Lee, who dreamed up Spider-Man, Iron Man, the Hulk and a cavalcade of other Marvel Comics superheroes that became mythic figures in pop culture with soaring success at the movie box office, died at the age of 95, his daughter said on Monday.As a writer and editor, Lee was key to the ascension of Marvel into comic book titan status in the 1960s when, in collaboration with artists such as Jack Kirby and Steve Ditko, he created superheroes who would enthral generations of young readers.\"He felt an obligation to his fans to keep creating,\" his daughter JC Lee said in a statement to Reuters news agency. \"He loved his life and he loved what he did for a living. His family loved him and his fans loved him. He was irreplaceable.\"Lee was declared dead at Cedars-Sinai Medical Center in Los Angeles, according to Kirk Schenck, a lawyer for Lee's daughter. The cause of death was not disclosed.Americans were familiar with superheroes before Lee, in part thanks to the 1938 launch of Superman by Detective Comics, the company that would become DC Comics, Marvel's archrival.Lee was widely credited with adding a new layer of complexity and humanity to superheroes. They had love and money worries and endured tragic flaws or feelings of insecurity.\"I felt it would be fun to learn a little about their private lives, about their personalities and show that they are human as well as super,\" Lee told NPR News in 2010.He had help in designing the superheroes but he took full ownership of promoting them.His creations included web-slinging teenager Spider-Man, the muscle-bound Hulk, mutant outsiders The X-Men, the close-knit Fantastic Four and the playboy-inventor Tony Stark, better known as Iron Man.Dozens of Marvel Comics movies, with nearly all the major characters Lee created, were produced in the first decades of the 21st century, grossing over $20bn in theatres worldwide, according to box office analysts. Spider-Man is one of the most successfully licensed characters ever.Lee, as a hired hand at Marvel, received limited payback on the windfall from his characters.In a 1998 contract, he wrestled a clause for 10 percent of profits from movies and TV shows with Marvel characters.In 2002, he sued to claim his share, months after \"Spider-Man\" conquered movie theatres. In a legal settlement three years later, he received a $10m one-time payment.Hollywood studios made superheroes the cornerstone of their strategy of producing fewer films and relying on big profits from blockbusters. Some people assumed that, as a result, Lee's wealth had soared. He disputed that. \"I don't have $200m. I don't have $150m. I don't have $100m or anywhere near that,\" Lee told Playboy magazine in 2014. Having grown up in the Great Depression, Lee added that he was \"happy enough to get a nice paycheck and be treated well\".In 2008, Lee was awarded the National Medal of Arts, the highest government award for creative artists.Lee was born as Stanley Martin Lieber in New York on December 28, 1922, the son of Jewish immigrants from Romania. At age 17, he became an errand boy at Timely Comics, the company that would evolve into Marvel. He got the job with help from an inside connection, his uncle, according to Lee's autobiography, Excelsior!Lee soon earned writing duties and promotions. He penned Western stories and romances, as well as superhero tales, and often wrote standing on the porch of the Long Island, New York, home he shared with his wife, actress Joan Lee, whom he married in 1947 and who died in 2017.The couple had two children, Joan Celia born in 1950 and Jan Lee who died within three days of her birth in 1953.In 1961, Lee's boss saw a rival publisher's success with caped crusaders and told Lee to dream up a superhero team.Lee at the time felt comics were a dead-end career. But his wife urged him to give it one more shot and create the complex characters he wanted to, even if it led to his firing.The result was the Fantastic Four. There was stretchable Mr Fantastic, his future wife Invisible Woman, her brother the Human Torch and strongman The Thing. They were like a devoted but dysfunctional family.\"Stan's characters were always superheroes that had a certain amount of humanity about them or a flaw,\" said Shirrel Rhoades, a former executive vice president of Marvel and its publisher in the mid-1990s.\"As iconic as Superman may be, he's considered a Boy Scout. He doesn't have any real flaws,\" Rhoades said. \"Whereas you take a Spider-Man, kids identify with him because he had his problems like they did. He suffered from great angst.\"Lee considered the comic-book medium an art form and he was prolific. By some accounts, he came up with a new comic book every day for 10 years.\"I wrote so many I don't even know. I wrote either hundreds or thousands of them,\" he told the Associated Press in 2006.Lee involved his artists in the process of creating the story and even the characters themselves, in what would come to be known as the \"Marvel Method.\"It sometimes led critics to fault Lee for taking credit for ideas not entirely his own.He described his creative process to Reuters in outlining how he came up with his character Thor, the god of thunder borrowed from Norse mythology.\"I was trying to think of something that would be totally different,\" he said. \"What could be bigger and even more powerful than the Hulk? And I figured why not a legendary god?\"To give Thor more rhetorical punch, Lee gave him dialogue styled after the Bible and Shakespeare.As for Tony Stark-Iron Man, he was based on industrialist Howard Hughes, Lee told interviewers.Lee became Marvel's publisher in 1972. He went on the lecture circuit, moved to Los Angeles in 1980 and pursued opportunities for his characters in movies and television. Through it all, he kept connected with fans, writing a column called Stan's Soapbox into which he often slipped his catchphrase, \"'Nuff Said,\" or the sign-off, \"Excelsior!\" In his later years, he gave constant updates via Twitter.\"Stan was a character. He was a character as much as any he ever created,\" Rhoades said. \"He created himself, in a way.\"He also made cameos in most Marvel films, pulling a girl away from falling debris in 2002's Spider-Man and serving as an emcee at a strip club in 2016's Deadpool.The Walt Disney Co bought Marvel Entertainment in 2009 for $4bn in a deal to expand Disney's roster of characters, with the most iconic ones having been Lee's handiwork.By that point, Lee had all but parted ways with Marvel after being made a chairman emeritus of the company. But even in his 80s and 90s, Lee was a wellspring of new projects, running a company called POW! Entertainment.pic.twitter.com/dTdDjRvXbsRecent projects he helped make possible range from the films Black Panther and Doctor Strange to such TV series as Agents of S.H.I.E.L.D and Guardians of the Galaxy.\"His greatest legacy will be not only the co-creation of his characters but the way he helped to build the culture that comics have become, which is a pretty significant one,\" said Robert Thompson, a pop culture expert at Syracuse University.\r\n            SOURCE:\r\n            News agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}