{"id": "$1.5bn Mega Millions lottery ticket sold in South Carolina", "paragraph": "Lottery officials say a lucky South Carolina resident has won record $1.5bn Mega Millions jackpot.Lottery officials in the United States say an unidentified, and clearly very lucky, individual has won a record $1.5bn Mega Millions jackpot.Mega Millions officials said a ticket purchased in South Carolina matched all six numbers in Tuesday night's drawing. The winning numbers were 5, 28, 62, 65, 70 and Mega Ball 5.The lucky player overcame miserable odds - the chances of matching all six numbers and winning the top prize is 1 in 302.5 million.Still, the jaw-dropping $1.537bn jackpot failed to break the record for lottery winnings, held by the $1.586bn Powerball prize shared by three winners in January 2016.The announcement prompted social media users to marvel at the sheer amount of money in play.When you have to wake up in the morning and get that bread because you didn’t win the mega millions #MegaMillionsJackpot pic.twitter.com/a5j4EhBKKRMe coming back to reality after dreaming about being a billionaire all day #MegaMillionsJackpot pic.twitter.com/HMiAfk0YNCWas so close I’m sick 🤮#MegaMillionsJackpot pic.twitter.com/5V6cqBvNIGMega Millions is a US lottery game that saw its first drawing in 2002. The lottery is coordinated by the Multi-State Lottery Association, along with several other lottery games, including Powerball. The name of the winner has not been revealed yet, and it can remain anonymous. It could be days or even weeks before a winner steps forward to claim the prize.Depending on the state, winners have 180 days to a year to claim the prize.In eight US states - Delaware, Georgia, Kansas, Maryland, North Dakota, Ohio, South Carolina and Texas- winners can remain anonymous, but in others, their identities will become public.The ticket costs $2 each and they are sold in 44 US states, as well as Washington, DC and the Virgin Islands. Several states allow online ticket purchases, but they prohibit out-of-state and foreign purchases.All states, except California, also offer a different option called Megaplier where non-jackpot prizes are multiplied by 2, 3, 4 or 5. Plays with the Megaplier cost $3 each. The minimum age to buy a ticket is 18, except in Arizona, Iowa and Louisiana where the minimum is 21. A player must select six random numbers and hit all of them to win the jackpot.If the player wins, the person can opt for an immediate cash payment of $904m or receive the $1.6bn prize over 29 years. If more than one winner is picked, the jackpot would be divided proportionately. The Mega Millions' odds were lowered a year ago to 1-in-303 million from 1-in-259 million to generate larger prizes. The Mega Millions jackpot grew large this time because it had been nearly three months since a player had matched all six numbers and won the top prize.These calculations were done using the estimated amount. The final amount will be lower depending on taxes and delivery methods. Provide food to 10,000 families in Yemen with $900,000  In war-torn Yemen, $90 can give a family food for a whole month. So, with a small contribution of $900,000, you could help a country that is on the verge of widespread famine.Sponsor three million orphans for a yearAccording to a charity organisation in the US, only $516 could sponsor a child in Bangladesh, Chad, Ethiopia, Malawi, Somalia, South Africa, Sri Lanka, Chechnya, India or Mali. With $1.5bn, you could help no less than three million orphans.Buy private island or peninsula in Belize, Bahamas, and French PolynesiaTiger Point peninsula in Belize is available for $6,400,000. The property consists of a primary peninsula and a secondary island to the west.In Bahamas, you can buy Pelican Cay island at $4,500,000, while in French Polynesia, Marakorako island is up for grabs for $949,684.Freeze your body for $200,000In Arizona in the US, there is a company called Alcor that allows you to freeze your body for $200,000 with the goal of it being revived one day.According to The Guardian newspaper, there are nearly 300 cryogenically frozen individuals in the US.  Plan a trip to space Jeff Bezos' rocket company, Blue Origin, is charging passengers between $200,000 to $300,000 for its first planned trips into space next year.\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}