{"id": "Indians protest after train accident kills dozens", "paragraph": "India's huge railway network is notorious for accidents that lead to thousands of deaths each year.Angry relatives staged a protest on Saturday on the tracks where a speeding train ran into crowds celebrating a Hindu festival, killing around 60 people in northern India.The Jalandhar-Amritsar express hit scores of revellers who had gathered on the railway tracks on the outskirts of Amritsar city in Punjab state on Friday to watch a firework display.Many of the victims were dismembered or mutilated beyond recognition and police said it would take several days to complete the identification of the dead.Some desperate parents went from hospital to hospital in the city on Saturday looking for missing children, while the first funerals of some victims were held.Hardeep Singh, chief medical officer for Amritsar, told the AFP news agency 59 deaths had been confirmed and 90 people had been injured, with seven in critical condition.Singh said only 25 bodies had been identified so far. Amritsar's main hospital did not have enough space in its morgue, and some corpses were laid outside.The disaster led to new demands for safety reforms to India's accident-plagued railway system, which records thousands of deaths each year.Punjab State Governor VP Singh Badnore said: \"Those who need to be punished will be punished and accountability will be fixed.\"Scores of protesters, who gathered on the railway tracks, condemned the Punjab state government and demanded action against the driver who was questioned by police on Saturday. Others blocked a nearby road.Police moved the protesters off the tracks and brought in reinforcements to control a crowd of hundreds that gathered around the scene of the disaster.Investigators said victims did not hear the train because the drone of the locomotive was drowned out by firecrackers. Another train had narrowly missed the crowds two minutes earlier, officials said.According to media reports, the driver told police he did not see the revellers until the last second because he had come around a bend in the dark into the firework smoke.As attempts to apportion blame continued, police said they had given permission for the display of the annual Dussehra festival fireworks, but that organisers did not have approval from the city, health department and fire brigade.Indian Railways said it had not been informed of the celebration, even though locals said it had been held at the same place for several years.According to media reports, the organisers - members of the Congress party which rules Punjab - had gone into hiding.Railway Minister Piyush Goyal returned early from a trip to the United States to go to Amritsar on Saturday. Punjab Chief Minister Amarinder Singh called off a trip to Israel to go to the disaster scene.India's huge railway network is notorious for accidents.A 2012 government report described the loss of 15,000 passengers to rail accidents every year in India as a \"massacre\". The government has pledged $137bn over five years to modernise the crumbling network.In 1981, seven carriages from a train fell into a river as it crossed a bridge in the eastern state of Bihar, killing between 800 and 1,000 people.But nearly every month there are accidents involving trains that derail or hit vehicles on crossings.In April, 13 children were killed when a train hit their school bus. In November 2016, the Patna-Indore express derailed in Uttar Pradesh state in the middle of the night, killing 139 people.WitnessPowerless in India\r\n            SOURCE:\r\n            AFP news agency\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}