{"id": "Saudi crown prince promises justice in Khashoggi murder case", "paragraph": "Perpetrators involved in journalist's killing will be brought to justice with Turkey's help, says Mohammed bin Salman.Saudi Crown Prince Mohammed bin Salman has called the killing of Saudi journalist Jamal Khashoggi inside the kingdom's consulate in Istanbul a \"heinous crime that cannot be justified\".In his first public comments in the weeks since Khashoggi's murder, the crown prince, known as MBS, said on Wednesday that the perpetrators would be brought to justice with the help of Turkey.Speaking at the Future Investment Initiative in Riyadh, he said that \"some people are trying to seize this painful moment to drive a wedge between Saudi Arabia and Turkey\".He continued: \"I want to send them a message: You will not be able to do that as long as we have a king called Salman bin Abdulaziz and a crown prince called Mohammed bin Salman and a Turkish president named Erdogan.\"The rift will never be created. We will prove to the entire world that the both countries are cooperating to punish all perpetrators and justice will be above everything.\"Al Jazeera's Sinem Koseoglu, reporting from Ankara, said President Recep Tayyip Erdogan spoke with the royal over the phone just before his speech at the conference.It was the first time the pair had spoken since Khashoggi disappeared on October 2.\"A couple of hours before that, President Erdogan had a phone call with Jordan's King Abdulla. When you look at this diplomatic phone traffic, you see that there are mediators who are trying to build up [ties] between Turkey and Saudi Arabia,\" Koseoglu said.MBS' remarks on Wednesday came a day after US President Donald Trump for the first time implied that the crown prince may have had a role in the killing.Saudi Arabia has come under increasing pressure over the killing, which has also strained ties with other key Western allies. Jamal Khashoggi case: All the latest updatesKhashoggi, a critic of the crown prince, vanished after he entered the Saudi consulate in Istanbul on October 2.After Riyadh first denied any involvement in his disappearance, it eventually admitted its officials killed the journalist, attributing the death to a chokehold.Erdogan on Tuesday dismissed Saudi efforts to blame Khashoggi's death on rogue operatives, calling the operation a planned, \"savage killing\", and demanded Riyadh punish those responsible, no matter how highly placed.Secretary of State Mike Pompeo said the United States had identified some of the Saudi government and security officials it believed were involved in Khashoggi's murder and would take appropriate actions including revoking US visas.\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}