{"id": "Syrian refugees guide their way to integration in Oxford museum", "paragraph": "Refugees, including Syrians, become volunteer tour guides in Oxford's history museum as part of an integration scheme.Oxford, United Kingdom - Leaning in closely over a brass sphere the size of a clenched fist, Hussein Kara Ahmed explains to his audience the mechanical workings of the world's only complete surviving spherical astrolabe, created by a 15th-century Islamic craftsman named Musa.A Syrian refugee who fled deadly violence in his home city of Aleppo and arrived in the United Kingdom six months ago via Turkey, Ahmed is giving one of his first tours at Oxford's History of the Museum of Science, home to an impressive collection of Islamic astronomical instruments.He has been preparing for four months for his debut performance as part of the Multaka Oxford scheme, which trains refugee volunteers to curate, research and engage with museum visitors in the historic university town.\"When I first joined the Multaka programme, I felt so happy already because the collection came from my culture and religion,\" he told Al Jazeera. \"I wanted to join because it's my right to talk about the collection and my culture.\"Multaka, which means meeting place, is a model which was established in Germany's capital, Berlin, in 2015. It aims to aid integration and cultural understanding by encouraging refugees and migrants to explain their own cultural history to the public, both through Arabic and English.So far, 26 recently arrived volunteers from Syria, Iraq, Sudan, Zimbabwe and Oman have taken part in the programme in Oxford.Participants broaden their vocational and language skills through organising events, writing blog posts and conducting research on museum's artefacts.Next year, they will also begin working with a collection of Arab textiles in the town's Pitt-Rivers Museum.\"The museum is changing who's speaking about the museums, so it's about bringing different voices in, different layers of interpretation,\" said Nicola Bird, Multaka Oxford's project manager.\"We have these amazing Islamic, Arabic and Middle Eastern collections and we have lots of people we work with from that area who can actually enrich the interpretation and actually be the public face for the collections.\"The programme works two ways, says Mohammad Al Awad, a participant and former assistant professor at the University of Damascus, who worked on archaeological sites in Palmyra, Bosra and the Syria's Hauran region, and studied in France for several years.The museum's collection allows him to learn more than ever about the golden age of Islamic science, while also contributing his own expert knowledge and insight into the Middle East's history.\"It's an opportunity to speak together, for learning together, for living together, for sharing our culture together,\" he said.\"We've seen families from the Middle East and this is their first time [going to a museum in the UK]. This will encourage them to go other times to a museum. This is a step for integration.\"For Mohammed, exchanging cultural knowledge and engaging with the local community is the perfect way for his family to settle into their new lives in the UK.\"I speak with people as my neighbour in Syria, or in France. It's similar, I don't think the other person is different … We have [different] things but we live together.\"More than 11,000 Syrian refugees have been resettled in the UK since 2015 and about 8,000 more have been granted asylum in the country since Syria's civil war broke out in 2011.\"Refugees can contribute an enormous amount to the UK, bringing a wealth of skills and experience that are really valuable,\" said Lisa Doyle, director of advocacy at the Refugee Council.\"It's fantastic to see initiatives and projects like these, which support refugees to integrate in the UK by giving back to the country that granted them protection, as well as providing opportunities for them to meet people in their new communities.\"\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}