{"id": "Salvadoran rape survivor faces prison for giving birth in toilet", "paragraph": "Imelda Cortez is charged with aggravated attempted homicide after giving birth to stepfather's child in a latrine.Usulutan, El Salvador - The trial of a young Salvadoran woman, who became pregnant after being raped and suffered complications during her pregnancy, is set to begin on Monday in the latest case tried under the country's strict abortion laws.Imelda Cortez, 20, is accused of attempted aggravated homicide of her newborn baby. She became pregnant at the age of 17 after being raped repeatedly by her stepfather.Cortez, who said she was not aware she was pregnant at the time, suffered abdominal pains and went to the toilet where she fainted in April 2017. Her baby was found in the toilet.The baby survived, but Cortez was sent to jail to await trial. She faces up to 20 years in prison if convicted. Her stepfather has been charged with aggravated sexual assault of a minor and faces up to 15 years in prison, according to lawyers with the Citizen Group for the Depenalisation of Abortion. Cortez's lawyers had previously asked the judge to suspend the case due to lack of evidence of an attempted aggravated homicide. Medical reports from government institution Legal Medicine show that the young mother experienced a natural birth with no signs of having induced it herself. The baby did not show signs of aggression after birth, the institution reported.A verdict in the case is expected sometime this week.Cortez is one of the dozens of Salvadoran women accused of attempting to kill their babies in a country with a total abortion ban and some of the highest rates of disapproval of legalising abortion. The Central American country criminalised abortion in all circumstances in 1998 when the country rewrote the penal code to remove previous exceptions that allowed abortion in some cases. Since then, El Salvador has put dozens of women behind bars for suspected abortions.In the face of national and international pressure, El Salvador released some women imprisoned for suspected abortions earlier in the year.This included Teodora Carmen Vasquez, who was released in February after serving more than 10 years in prison for aggravated homicide in one of the most high-profile cases of women imprisoned for abortion in El Salvador.Carmen Vasquez was convicted in 2008 for allegedly aborting her child and sentenced to 30 years in prison. She maintained she suffered a stillbirth after health complications. Her sentence was reduced before her release.Since Carmen Vasquez was allowed to walk free, at least four other women have been released.\"For us women who have been detained in a prison for late-term obstetric emergencies, I consider the system unjust because they have not investigated the things as they have happened,\" Carmen Vasquez told Al Jazeera in September. \"They've accused us of something that we've never done, just because we had these emergencies outside a hospital.\"Although Vasquez's release marked a small step forward for women's rights, recent shifts in the political makeup of the Salvadoran National Assembly worry rights advocates.Despite lobbying by activists, a bill to depenalise abortion in cases of rape of a minor and risk to the life or health of mother failed to pass in April 2018.In May 2018, newly elected representatives for the legislative assembly took their seats, with the right-wing ARENA party retaking control, leaving little possibility of passing a similar bill until the next election cycle.Sara Garcia, Citizen Group for the Depenalisation of AbortionSara Garcia, an activist with the Citizen Group for the Depenalisation of Abortion, called the failed attempts a \"step backwards for the assembly, for our democracy and for the human rights of women\".She also called on the international community to \"be alert because sexual and reproductive rights often take a back seat when there are these steps backwards for human rights. The worst part is always lived by women.\"Carmen Vasquez stands in solidarity with Cortez because they've gone through the same experience, with just one difference.\"Now, I'm free and she's still going through this process,\" she said. \"They should investigate the cases well to serve justice as it should be.\"Maira's case isn't unusual. In 2017, El Salvador sentenced a rape victim to 30 years in jail after a she had a stillbirth. pic.twitter.com/Ovddnvhf71\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}