{"id": "US midterms: Georgia's early voting marred by suppression claims", "paragraph": "An estimated 53,000 voter applications are being held up by Georgia's Secretary of State.With early voting soaring in the US state of Georgia, civil rights and voting rights groups have sounded the alarm on what they describe as widespread voter suppression that disproportionately impacts blacks.On November 6, voters across the US will cast their ballots in heated midterm elections that are expected to be a referendum on President Donald Trump's job performance.Stacey Abrams, the Democratic gubernatorial candidate, could become the nation's first black female governor. But a potential challenge looms: her Republican opponent is Georgia's secretary of state, the office that oversees voter registration applications.Brian Kemp, Abrams's pro-Trump challenger, is currently holding up 53,000 applications, most of them belonging to African Americans.Kemp maintains that his actions comply with Georgia's 2017 \"exact match\" law, which requires that voter registration information precisely matches with data from the Social Security Administration or Department of Motor Vehicles.Along with a handful of civil rights groups, Abrams has accused Kemp of voter suppression, charges that he has consistently denied.On Tuesday morning, Abrams lashed out at Kemp on The View, a daytime talk show. \"We know he has disproportionately purged voters of colour, stopped voters of color, arrested voters of colour,\" she said.\"Regardless of his intent, the result is that racial bias has been injected into our system, and that undermines confidence.\"Last week, the state chapter of the NAACP, a civil rights organisation, filed complaints with the state election officials alleging that some machines were changing early votes for Abrams to votes for Kemp.\"I am disappointed in how unaccountable the secretary of state seems to be to the people of Georgia,\" said Nse Ufot, executive director of the New Georgia Project, a voting advocacy organisation founded by Abrams.\"Given all the challenges and his failures to execute the responsibilities of secretary of state, it's odd and interesting that he is now asking the people of Georgia for a promotion,\" she told Al Jazeera.Kemp's spokesperson did not reply to Al Jazeera's multiple requests for a comment. But during a heated debate last week, the Republican candidate dismissed the allegations as a \"farce\".\"This farce about voter suppression and people being held up from being on the rolls … is absolutely not true,\" he said during the debate.Kemp claimed that any voters with pending applications could cast their ballot as long as they show up with a form of identification on Election Day. But advocates worry that those names may not be on a \"supplemental list\" required to allow them to vote in such a case.During the debate, Abrams replied, \"Voter suppression is not simply about being told no, it's about being told it's going to be harder for you to vote.\"The Brennan Center for Justice says the number of voters \"purged\" skyrocketed under Kemp, reaching an estimated 1.5 million between the 2012 and 2016 elections. That total is nearly twice the number purged between 2008 and 2012, the group said in a report.Last year, Kemp settled a lawsuit with civil rights organisations over voting rights. The suit included allegations that the voter registration system was discriminatory, citing the cancellation of around 34,000 people's registration status between 2010 and 2013.\"The way black votes are suppressed in Georgia are much more sophisticated than in previous decades,\" said the New Georgia Project's Ufot.\"That's the legacy of Jim Crow. What we have today is James Crow, PhD, a data scientist.\"Former US President Jimmy Carter has urged Kemp to step down, and former President Barack Obama has endorsed Abrams.As of last Thursday, Georgia's early voting tally was 944,426, nearly three times as many ballots cast in the same duration during the 2014 midterm vote.A Pew Research Center survey recently found that voter enthusiasm was at its highest level for any midterm election in the past two decades.During the upcoming midterm elections, voters will decide 39 state and territorial governorships, all 435 seats in the House of Representatives and 35 of the 100 seats in Senate, among others.Trump won Georgia during the 2016 presidential election, gaining 50.4 percent of the vote as compared with Hillary Clinton's 45.3 percent.\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}