{"id": "Is Riyadh's claim Jamal Khashoggi died in a fistfight credible?", "paragraph": "Most SearchedInside Story20 Oct 2018 20:23 GMT Saudi Arabia, Donald Trump, Jamal Khashoggi, Middle EastSaudi Arabia says Jamal Khashoggi was killed inside its consulate in Istanbul.The announcement was made on Saudi state TV in the middle of the night - 17 days after the Saudi journalist was last seen going into the compound.The kingdom says there was a brawl and Khashoggi died. US President Donald Trump says he finds that explanation \"credible\" but many politicians in the US and around the world are sceptical.Turkish security sources have a different story.They say Khashoggi was tortured, murdered and his body dismembered.Presenter: Imran KhanGuests: John Jones - Former US senior congressional adviserSaad al-Faqih - Movement for Islamic Reform in Arabia Amanda Rogers - Professor of Middle East and Islamic Studies at Colgate UniversityNewsweek interview: Rula JebrealSource: Al Jazeera News\r\n      Commenting has been disabled. To find out more, click      \r\n      here.\r\n     The Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nInteractive, Philippines, EnvironmentRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.Europe, Russia, Saudi ArabiaFrom Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.Environment, Native Americans, US & CanadaAnswer as many correct questions as you can and see where your country ranks in the global cost of living.InteractiveStatement comes after US media reports say CIA has concluded Saudi crown prince ordered Khashoggi's murder.Jamal Khashoggi, Middle East, Saudi Arabia, Turkey, Journalism Is Not A CrimeThousands of people blocked roads across France during 'yellow vest' demonstrations against the rising price of fuel.France, Business & Economy, Emmanuel Macron, EuropeMeet the hardline group willing to do anything, including going against their government, to claim land for Israel. Israel, Occupied West Bank, Middle EastMoroccan dissident Abraham Serfaty was jailed, tortured and exiled for his radical views over decades.History, Morocco, Human RightsAn insight into the Trump administration's relationship with the religious right and implications for US politics.Religion, Donald Trump, US Midterms 2018In an age of non-stop news feeds and disposable media, which stories and images stay with us and how do they shape us?Journalism, Humanitarian crises, Media\n \n\t\t\t© 2018 Al Jazeera Media Network\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t "}