{"id": "What happens if the Democrats take the House?", "paragraph": "Would they be able to launch another investigation against Trump?To begin with, no one knows or can predict what will happen in the US midterms on November 6. Polls used to be very accurate. We, as the public, viewed them as predictors of voting. As a commercial product employed both by political campaigns and businesses, they were disciplined by the demands of the market and had been one of the few true successes of the social sciences. Yet something went wrong. Almost all the major political events of the past dozen years - the election of a black president, the collapse of the Democratic majority in his first midterms, his re-election, the nomination of Donald Trump, the election of Donald Trump, plus a Republican sweep of the house and senate - have been shocks and surprises. At this point, we can't consider the polls to be much more than guesses. Informed, calculated, well-considered guesses, but still guesses. The consensus of those guesses is that Democrats will take the House of Representatives and the Republicans will hold the Senate. Let's start with that scenario.It would make for fabulous drama. More outrageous than House of Cards, not quite as murderous as Game of Thrones. The Democrats will control the house committees, meaning they'll control investigations and they will have subpoena power. Donald Trump, his family, and a multitude of his appointees have been accused of committing a wide-ranging and colourful assortment of crimes. So far, the Republican majority has been able to block any real investigations. With a Democratic majority, they will go forward with broad and endless publicity.Where does that lead? One possibility is a constitutional crisis. If recent history is a guide, the Trumpettes will claim extreme and unprecedented versions of executive privilege plus newly invented theories of why they don't have to answer questions. Congress and congressional committees have the authority to declare witnesses - or those who refuse to be witnesses - in contempt and detain them. However, the procedure, by agreement and by custom, is that Congress does not carry out contempt proceedings by itself. It refers them. To whom? To the Department of Justice. In recent decades, the Department of Justice has dishonoured that obligation when it suited their politics. In 1982, Anne Gorsuch was Ronald Reagan's head of the Environmental Protection Agency (EPA). Like many EPA administrators appointed by Republican presidents, she thought it was her mission to diminish and destroy the agency she was in charge of. Congress disagreed. They asked her to turn over documents. She didn't do so. The House voted to cite her for contempt. It was referred to the Department of Justice, where it died. The same happened with \"EPA Assistant Administrator Rita Lavelle in 1983, White House Counsel Harriet Miers in 2008, White House Chief of Staff Joshua Bolten in 2008, Attorney General Holder in 2012 and IRS Director Lois Lerner in 2014\". At that point, Congress can attempt to assert its authority by going to court for a writ of mandamus, compelling government officials to carry out their duties, or by changing the process and reclaiming the right of enforcement. Best guess is that if they do either, it goes to the Supreme Court. Then there are two best guesses. The five Republican, conservative judges - including Anne Gorsuch's son, Justice Neil Gorsuch - vote to protect their guys whatever the circumstances. The other possibility is that Chief Justice John Roberts would not want the Supreme Court under his watch to lose the rest of its respect and moral authority in the eye of the US public. If so, he may swing from the rhetorical law and order side to the actual law. (It's a shame that the judicial and political systems are so degraded that any hope boils down to the possibility that just one person has a moment of honour, putting principle above partisanship).Even if key members of the administration manage not to testify, House committees should be able to get enough information to make it clear that crimes have been committed. If so, who actually prosecutes? On the federal level, it is, once again, the Department of Justice, which is part of the executive branch, answering to the president. The states, however, are separate entities with their own attorney generals. Certain federal violations are also state violations. For example, if Trump and the Trump family cheated, failed to report, or committed some sort of fraud in their federal taxes, they would almost certainly have done exactly the same with their state and even city taxes. The attraction of high-publicity prosecutions is great. The Office of the New York State Attorney General has given us a president (Martin Van Buren), a vice president (Aaron Burr), a senator, and two governors. One Manhattan district attorney became governor, another, Thomas Dewey, very nearly became president. There is much talk of impeachment. If a House majority votes to impeach, it would be the equivalent of an indictment. Then it goes to the Senate for a \"trial.\" In the very unlikely event that Democrats get a one or two seat majority there, it still requires a two-thirds vote to \"convict\", to remove the person from office. Even if strong incriminating evidence is uncovered, it remains impossible to imagine 15 Republicans crossing the aisle to vote against a president of their own party. If you're a pollster, it looks like a 1 out of 6 shot that Republicans keep the House. If you're betting, you can get much better odds, about 1:2. Should that happen, expect that whatever you don't like about Donald Trump, from his hair to his rump, from his anti-immigrant policies to the destruction of the commitment to liberal democracy, the demonisation of the press and the end of truth, to double, double-bubble, quadruple. So hunker down, find the psychic fallout shelters, and watch old Marx Brothers movies to have something to laugh about.The views expressed in this article are the author's own and do not necessarily reflect Al Jazeera's editorial stance. Larry Beinhart is a novelist, best known for Wag the Dog.The Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.From Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}