{"id": "Ibrahim Mohamed Solih sworn in as new Maldives president", "paragraph": "Maldives president vows to end systematic corruption and investigate alleged human rights abuses under his predecessor.Maldivian President Ibrahim Mohamed Solih has taken the oath of office before thousands of people and hundreds of foreign dignitaries, vowing to end systematic corruption and investigate alleged human rights abuses under his predecessor, Abdulla Yameen.Solih received a 21-gun salute after being sworn in on Saturday as the Indian Ocean island nation's seventh president at a special parliamentary assembly at the national football stadium in the capital, Male.Addressing the crowd of 12,000 people, the 54-year-old pledged to see through his promises to establish justice and equality, as well as \"eradicate corruption and theft\".\"We need to focus on moving ahead, to take back the rights we have been denied, and save our nation from its dismal condition,\" he said.Solih is expected to appoint a 19-member cabinet and name the attorney general later on Saturday.Solih won a contentious election in September promising to restore democracy after a wide-ranging crackdown on dissent during Yameen's five-year term.The former president had jailed or forced into exile nearly all opposition leaders, banned protests, detained Supreme Court judges and suspended parliament for long periods of time.Most politicians who were sentenced during Yameen's tenure were released following Solih's shock win on September 23.\"We need to help seek justice for those subject to abuse and unfair treatment. The treasury needs to be strengthened. Unaccountable deaths and disappearances need to be investigated and findings disclosed,\" Solih said on Saturday.\"For us to move ahead as one nation, such grave matters need to be addressed immediately.\"Aishath Rasheed, whose brother was murdered last year in an attack over his religious beliefs, said Solih's inauguration was a \"moment of hope\" for her family.\"His speech gives me hope to find justice for my brother. I pray and hope this holds true,\" said Rasheed, who was among the thousands invited to the stadium by the new president's office.Fezleen Saleem, who was also at the stadium, said people were \"jubilant\" and \"applauding\" when Solih was sworn in.\"There was hope in the air. It gave me goosebumps every now and then,\" she said.Many Maldivians also took to social media to celebrate.Zuroo Majid, in a Twitter post, said: \"What a glorious feeling to wake up to hope and change\", while Ahmed Fauzan said he could not believe Yameen was \"out ... it would take some time for this to sink in\".India's Prime Minister Narendra Modi was among the more than 300 foreign dignitaries at the ceremony in Male.The visit is Modi's first to the Maldives after years of tense relations between the two countries because of Yameen's embrace of China during his tenure.Beijing reportedly loaned more than $1.5bn to fund a massive infrastructure boom under the former president.India's Prime Minister Narendra Modi was among the more than 300 foreign dignitaries at the ceremony in Male [Ashwa Faheem/Reuters]In an apparent reference to the Chinese debt, Solih, who has promised an \"India first\" foreign policy, said the Maldives was \"in a precarious financial situation\" because of \"reckless mega development projects undertaken purely for political gain\", and appealed for help from foreign countries and international organisations to address the issue. Modi, in a Facebook post on Friday, already pledged India's help to the Maldives \"in the areas of infrastructure, healthcare, connectivity and human resource development\".Meanwhile, Yameen, who lost a court challenge to overturn his poll defeat, did not attend the ceremony, nor did several legislators from his party.Mohamed Nasheed and Maumoon Abdul Gayoom, two former presidents who were jailed during Yameen's time in office following trials that were widely condemned as politically motivated, were both present at the oath-taking ceremony.Solih, who ran as the joint candidate of a coalition led by Nasheed and Gayoom, said reforms to ensure judicial independence was his government's \"highest priority area\".\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}