{"id": "Macron hails New Caledonia vote to 'remain French'", "paragraph": "Initial results suggest French archipelago has opted against independence, with nearly 60 percent of votes counted.The French archipelago of New Caledonia in the South Pacific has voted to remain part of France in a much anticipated referendum on independence, according to official results.About 56 percent of voters rejected secession in Sunday's poll, with turnout above 80 percent among the more than 174,000 voters registered to take part in the ballot.French President Emmanuel Macron said the \"majority\" of New Caledonians had declared they wanted the territory to \"remain French\".The archipelago, a cluster of islands home to about 270,000 people, is situated nearly 17,000km southeast of France.\"Voters were allowed to make a sovereign choice, with full knowledge of the facts and the relationship between New Caledonia and France,\" Macron said in a televised statement from the Elysee Palace in the French capital, Paris, on Sunday.\"I am proud we have finally passed this historic step together,\" he added.Commenting on initial results released earlier on Sunday, Al Jazeera's Andrew Thomas, reporting from Sydney, Australia, said the vote was pointing towards a \"victory for those that said New Caledonia was much better off economically as part of France\".\"France gives about $1.5bn a year to New Caledonia, that's about 15 percent of its GDP, that would have been missed,\" Thomas said.\"There was concern, too, that an independent New Caledonia would quickly fall under the sphere of influence of China, which has an increasing footprint right across the Pacific,\" he added.\"Other Pacific island nations receive a lot of Chinese money in terms of aid projects and infrastructure but in return, Beijing expects political favours.\"Macron has previously accused China of \"building its hegemony step by step\" in the Pacific and talked up plans for an axis of democratic powers, including India and Australia, in the region.As well as housing French troops, New Caledonia is a major source of nickel and rich fishing resources.The territory's indigenous Kanak people make up about 40 percent of its population, with those of European descent constituting about 27 percent.France claimed the islands in 1853 under Emperor Napoleon III - Napoleon's nephew and heir - and used them to hold prisoners.  It later became an overseas territory, after World War II, with French citizenship granted to all Kanaks in 1957.Under French colonial rule, the Kanaks faced strict segregation policies and suffered discrimination, and violent clashes between officials and the territory's indigenous people took place throughout the 1980s.A peace deal struck in 1988 ended the unrest and paved the way for a future agreement, the 1998 Noumea Accord, which guaranteed a referendum on independence by the end of 2018.The accord also allowed for two further such polls to be held by 2022 and kickstarted a steady devolution of powers away from Paris.Sunday's vote was the first on self-determination to be held in a French territory since Djibouti in the Horn of Africa opted for independence during a poll in 1977.In recent years, France has faced protests and calls for independence in several of its overseas territories, which are a legacy of the country's colonial history.A result in favour of independence would have seen New Caledonia become the world's newest state, overtaking South Sudan, which declared independence from Sudan on July 9, 2011.\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}