{"id": "Khashoggi case: What's next for Saudi Arabia's economic dream?", "paragraph": "Most Searched20 Oct 2018 14:51 GMT Business & Economy, Saudi Arabia, Jamal Khashoggi, Food, AgricultureEditor's note: This show was recorded shortly before Saudi Arabia confirmed Khashoggi's death.The killing of Saudi journalist Jamal Khashoggi at his country's consulate in Istanbul has shocked the world.Saudi Arabia was under intense pressure to explain what happened. And after initially remaining quiet and denying allegations that Khashoggi never left the consulate, Saudi Arabia has now admitted that Khashoggi was killed inside the consulate, but made no mention of where his body is.The world's largest oil exporter could face international sanctions. The cost of insuring against Saudi default has increased 32 percent, which means investors view the country as a much riskier bet. The government may now be forced to raise more debt at a higher cost. It's already running a budget deficit.The Saudi government is trying to court investment for new cities and projects. But big names in business, media and finance, including US Treasury Secretary Steven Mnuchin, are now boycotting the second edition of the kingdom's prestigious economic Future Investment Initiative (FII) conference, due to take place on October 23-25.This conference was seen as a chance for the Saudis to resuscitate business confidence which has been plunging for months because of underlying fears of sanctions.Sanctions against Saudi Arabia \"would be terrible for the plans of the young crown prince, Mohammed bin Salman,\" says Laurent Lambert, senior policy analyst at Qatar University.He points out this is not the first case that has undermined investor confidence in Saudi, referring to last year's arrest of a number of prominent princes, government ministers and businessmen.\"The problem was there was little transparency, no real trials, and at the end of the day, people believed that this was a form of extortion,\" says Lambert. \"So, how can the people believe in the judicial system of Saudi Arabia? That's also a concern for investors.\"\"The oil market is always very reactive to news,\" explains Lambert and adds that, although Saudi Arabia could potentially play the \"oil card\", \"they don't want to disrupt any global [oil] economy. They are completely depending on oil exports. There's a fair share of bluff, but this is diplomacy.\"Lambert says that the cancellations for the upcoming Saudi investment conference are \"not good for business, but at the same time, the conference has its own domestic and regional audience so it was not completely depending on these essentially Western investors. But it's a set back for the Saudi economy, definitely.\"Turning to Saudi's 2030 economic vision, \"For now, the momentum is not there, so they're very unlikely to have the kind of diversification they aspire to ... the diversification strategy is not on track so many investors are waiting.\"The UN's Food and Agriculture Agency says the world will need to change the way it produces its food in order to cater to an increasing global population. Emma Hayward went to Scotland to look inside the world of vertical farming. \"If it's just about delivering calories, there's enough land around the world and probably enough resources for people [to feed the world]. The problem is where that food has to be, whether it's nutritious enough or whether it's affordable,\" according to Adam Anders, cofounder and managing partner at Anterra Capital, the largest single dedicated agtech fund in the world.\"Agtech is the adoption of new ideas, new technologies, be it digital, biotech, material sciences applied to any aspect of the food and agriculture value chain. That works from the stage of breeding, pesticides, on-farm practices, transportation, shelf life and logistics.\"An agtech farm would consider \"the genetics, the actual performance of the plant ... and ... once you've actually made a planting decision, how can you use data to be more precise, both about that first moment of planting and to treat that plant as it grows ... Then, a treatment process of the next generation of pesticides and harvesting and how can the farmer best market their product.\"\"Digital biotech solutions are available to help every aspect of that for the farmer ... Using your smartphone or an iPad in order to prioritise what to do that day, to know more in specificity where there might be disease pressure, how you can more accurately apply pesticide or look after your field and actually farming at that more detailed at that level will be helped more by technology,\" says Anders.Also on this episode of Counting the Cost:Canada cannabis: Canada has joined the very exclusive club of countries that allow the sale of recreational cannabis. After Uruguay, it's only the second country to do so, as Daniel Lak reports from Toronto.Tunisia tourism: Tunisia is enjoying a tourism revival. The industry had gone into decline following a series of attacks by armed groups on visitors in 2015, as Mohamed Vall reports.Netflix earnings: Better than expected earnings at Netflix have helped its shares this week. The streaming video service added seven million new customers in the three months to September. Now, there are 137 million people globally using Netflix.China debt: China could be facing a debt iceberg, according to S&P Global. The ratings agency is highlighting what it called titanic credit risks because of unreported local government debt. Meanwhile, the world's number two economy reported its slowest quarterly growth rate since the global financial crisis.Brexit latest: European Union leaders have given themselves several more weeks to reach a break-up deal with the UK. Talks this week failed to deliver a hoped for breakthrough.Source: Al Jazeera News\r\n      Commenting has been disabled. To find out more, click      \r\n      here.\r\n     The Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nInteractive, Philippines, EnvironmentRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.Europe, Russia, Saudi ArabiaFrom Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.Environment, Native Americans, US & CanadaAnswer as many correct questions as you can and see where your country ranks in the global cost of living.InteractiveExecutives of US private equity firms and credit card company Mastercard are the latest to withdraw from Saudi forum.Jamal Khashoggi, Saudi Arabia, Middle EastHailed as the start of Saudi's economic reform, the Future Investment Initiative is now tainted by the Khashoggi case.Jamal Khashoggi, Saudi Arabia, Business & Economy, Mohammed bin SalmanStatement comes after US media reports say CIA has concluded Saudi crown prince ordered Khashoggi's murder.Jamal Khashoggi, Middle East, Saudi Arabia, Turkey, Journalism Is Not A CrimeThousands of people blocked roads across France during 'yellow vest' demonstrations against the rising price of fuel.France, Business & Economy, Emmanuel Macron, EuropeMeet the hardline group willing to do anything, including going against their government, to claim land for Israel. Israel, Occupied West Bank, Middle EastMoroccan dissident Abraham Serfaty was jailed, tortured and exiled for his radical views over decades.History, Morocco, Human RightsAn insight into the Trump administration's relationship with the religious right and implications for US politics.Religion, Donald Trump, US Midterms 2018In an age of non-stop news feeds and disposable media, which stories and images stay with us and how do they shape us?Journalism, Humanitarian crises, Media\n \n\t\t\t© 2018 Al Jazeera Media Network\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t "}