{"id": "The US economy is booming. It may not matter much to voters.", "paragraph": "Why aren't Republicans poised to take better advantage of the thriving economy during Tuesday's midterm elections?New York City - A strong economy usually favours the party in power. This year's US midterm elections could be an exception.Many regard Tuesday's elections as a referendum on President Donald Trump and his policies. If the Democrats retake control of the House of Representatives, it would threaten Trump's ability to carry out his agenda.Pollster FiveThirtyEight gives the Democrats an 85 percent chance of doing just that.Yet, the headline indicators on the economy couldn't be better for the Republicans going into Tuesday's vote. Some 250,000 jobs were created last month, beating expectations. Unemployment is holding at a 49-year low, wages are going up and economic growth clocked in at a slower but still robust 3.5 percent last quarter. Little wonder the latest reading on consumer confidence from business researcher the Conference Board   is at an 18-year high. And though the stock market shuddered last month due to concerns over rising interest rates, the US-China trade war and a handful of disappointing earnings reports, American consumers expect the happy times to continue into early next year. So why aren't the Republicans poised to take better advantage of the thriving economy?Healthcare is top of the agenda for many Americans this midterm season. Though it's a separate issue from the economy, the main concern surrounding it is economic in nature, specifically affordability.The United States spends around twice as much on healthcare as other high-income countries and spiralling costs can deter those with and without health insurance from accessing it. A recent survey by the Kaiser Family Foundation found that 71 percent of voters ranked healthcare as a \"very important\" issue in their voting decision for Congress, slightly higher than the percentage citing jobs and the economy. Around a third said healthcare was their \"most important\" issue. Much of the debate has centred around safeguarding protections for people with preexisting conditions. Before the Affordable Care Act (ACA) became law under former President Barack Obama, health insurance companies could deny coverage to people with preexisting medical conditions in many states, or charge them more for it. The ACA put paid to those practices and many voters want to keep it that way.That's why Democrats have been hammering their Republican opponents over the party's repeated attempts to dismantle the ACA and pave the way for insurance companies to once again raise premiums on people with preexisting conditions.President Trump has tried to shore up his party's Achilles heel, tweeting that Republicans would do a better job at protecting Americans with preexisting conditions. But that doesn't square with efforts by his administration to have such protections declared unconstitutional.A record number of women are running in the midterms and some could score historic firsts.Democratic candidate Stacey Abrams could become the first African American woman in the country to be elected governor when she faces off against her Republican opponent, Brian Kemp, in Georgia. Democrat Rashida Tlaib, running unopposed in Michigan, is set to become among the first two Muslim women and first Palestinian American to be elected to Congress, while Democrat Deb Haaland of New Mexico could become the first Native American woman elected to Congress.That so many barriers still need smashing, especially by women of colour, underscores the pernicious sexism and misogyny in American life that's received renewed scrutiny under Trump. The #metoo movement, which exploded during Trump's first year in office, has heightened awareness of the gender wage gap. So have moves by the Trump administration to undo Obama-era policies designed to redress wage discrimination.As of 2017, women working fulltime and year-round in the US were paid on average only 80 percent of what men were paid.Not surprisingly, confidence in the economy has started to split along gender lines. Polls conducted by Pew Research Center dating back to 2004 showed little gender variation among Americans who felt \"good\" or \"excellent\" about the economy. But when Trump took office, attitudes diverged as men started feeling much better than women about the economy. The divide even crosses party lines.\"While many states are updating decades-old pay equity laws, there has been no progress in strengthening federal equal-pay laws - and in fact, there's evidence we're moving in the wrong direction,\" said Kimberly Churches, CEO of the American Association of University Women which has conducted extensive research on the gender wage gap in the US.\"The wage gap exists in almost every field of work – even occupations like nursing that are historically predominantly female,\" she told Al Jazeera \"And when women are making inroads into traditionally male-dominated professions, such as law, medicine and finance, they are still paid less.\"In a final bid to refocus voters on the economy, President Trump's campaign committee released a TV ad on Monday splicing images of darker times with scenes of renewed economic growth. The 60-second spot features a woman voting Republican as the narrator warns, \"this could all go away if we don't remember where we came from\". Clearly aimed at white, suburban, affluent women whose votes could prove critical in congressional races, the ad makes no mention of Trump, who polls poorly with the demographic.But the ad was quickly eclipsed by the president himself.Rather than laud the economy in the final stretch of campaigning, Trump doubled down on immigration, threatening to end birthright citizenship, vilifying a caravan of Central Americans making their way through Mexico, and deploying troops to the US-Mexican border to deal with what he calls a \"crisis\".The rhetoric could help get out the conservative vote.In a recent Pew survey, Republicans ranked \"illegal immigration\" as the biggest problem facing the nation.Democratic voters named healthcare. \r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}