{"id": "Bangladesh moves towards a 'managed' election", "paragraph": "As the poll date nears, hopes for a free and fair election, and a democratic future, diminish further in Bangladesh.On Monday, Bangladesh's election commission announced that it had deferred the date for the country's next parliamentary poll from December 23 to December 30, partially meeting demands from several opposition parties, who recently agreed to contest the election, for more time to prepare.The announcement came as various political parties were still demanding talks with the government to set up modalities that could ensure a free and fair election and left major politically contentious issues unsettled. Bangladesh's main opposition parties still demand the polls be deferred by a month, the current parliament dissolved, and an election-time special cabinet installed, one not led by current Prime Minister Sheikh Hasina.Sheikh Hasina and her party, Bangladesh Awami League, on the other hand, insist that both the current set of parliamentarians and the prime minister should stay in power during the upcoming election.Because of the deep-rooted mistrust among politicians and a vicious zero-sum political culture, Bangladesh had installed provisions for election-time caretaker governments under which four previous elections - 1991, 1996, 2001, and 2008 - were held. The constitutional provision for election-time caretaker governments was abolished during the tenure of Sheikh Hasina prior to the 2014 parliamentary elections, which the opposition boycotted, eventually handing out the ruling party 50 percent of the parliamentary seats uncontested. Political observers soured on Bangladesh's democratic prospects since that election, some going as far as to term the entire 2014 affair as an electoral farce.If the status quo prevails and the next election is held under conditions similar to 2014, Sheikh Hasina may easily win a contiguous third term, allowing her to govern an otherwise difficult to govern nation of 170 million for more than 10 continuous years - something no other leader, military or civilian, managed to achieve in post-independence Bangladesh since 1971.Relative to her beleaguered opposition, Sheikh Hasina is an authoritative leader with unparalleled political dexterity and geopolitical acumen. Under her leadership, Bangladesh Awami League was able to crush its political adversaries, while forging numerous alliances of convenience with fringe political elements both secular and religious. After 10 years in power, Sheikh Hasina's party has penetrated all layers of the key state organs of Bangladesh by appointing personnel favourable to the party's agenda. This allowed the party to govern unchallenged.Hasina's strong rule brought relative political stability to Bangladesh, enabling it to make noticeable socioeconomic progress over the past 10 years. Bangladesh's per capita income was $1,355 as of 2016, 40 percent higher than it was just three years prior. During the same time, South Asian giant India's per capita income went up by only 14 percent and Pakistan's 21 percent.India's per capita income stood only 25 percent higher than Bangladesh's in 2016, while it used to be 87 percent higher back in 2011 when the current Hasina government was just two years into its tenure. Bangladesh surpassed India and Pakistan in the human development index with higher life expectancy and lower infant mortality rates. Bangladesh also achieved preliminary qualifications to enter the list of middle-income countries by 2024, provided that it maintains its current socioeconomic development trajectory.Hasina's political opponents, however, want everyone to look beyond economic figures and development indices.Bangladesh has become increasingly authoritarian under Sheikh Hasina, and in some aspects, it is now a de-facto one-party state, where the ruling party has usurped even the most basic constitutional rights of its political opponents and citizens.Arbitrary arrests, detentions, disappearances, and extrajudicial killings of political personnel have increased alarmingly over the last 10 years. Special security forces regularly engage in activities akin to death squads, operating with total impunity, killing political opponents of the government, often under officially sanctioned missions billed as \"anti-terror\" and \"anti-drug\" operations.Under an increasingly authoritarian style of governance over a decade, Bangladesh's ruling party and its cronies monopolised both the country's politics and business. Large sums of cash left the country to safe havens abroad and income inequality measures went through the roof. Bangladesh registered the fastest growth in \"Ultra High Net Worth\" people over the past five years.The politicisation of Bangladesh's banks has resulted in a liquidity crisis with an alarming increase in defaulted and non-performing loans. Total defaulted loans increased about 20 percent from 2016 to 2017 alone. Experts are raising the alarm, comparing the current situation in Bangladesh to that of Indonesia prior to its banking crisis of 1997, which cost the country more than 50 percent of its gross domestic product (GDP) to fix.While lopsided political and economic incentives have emboldened the ruling elite in Bangladesh, the country's major opposition parties, both secular and religious, became increasingly marginalised - some barely surviving, if at all.Begum Khaleda Zia, leader of the country's largest secular opposition party Bangladesh Nationalist Party (BNP), was put in house arrest during the 2014  election. This time around, she is in special jail serving 10 years imprisonment on \"corruption\" charges. Her son and heir apparent, Tarique Rahman, has been in exile in London for the past 10 years, from where he is running the party as its acting chairman. One of the lower courts in Bangladesh recently sentenced Rahman to life imprisonment in absentia for a grenade attack on Sheikh Hasina which took place fourteen years ago.The country's largest Islamist party, Jamaat-e-Islami, lost its right to contest in national elections, while its central leadership, many of whom were languishing in jail during the last national election in 2014, have since been executed, defying international outcry.  Finding the country's major opposition leaders in jail, in exile or already executed, some of the remaining anti-government politicians have created an alliance to force a free and fair election.However, within weeks of its formation, the new alliance faced the wrath of the state machinery. Moinul Hosein, one of the central alliance figures was sent to jail for calling a journalist \"characterless\". Amir Khasru, the senior BNP leader who was handling western diplomats, was sent to jail for \"hatching a conspiracy\" against the government. Dr Zafarullah, another central figure of the alliance, had numerous charges filed against him, including one specific charge of \"stealing fish\" from a pond.Not only the political leaders but also anyone talking against the government is now a target of several repressive machinations installed by the government for constraining political speech. For example, the newly passed Digital Security Act 2018 makes it a crime punishable by 14 years in prison for anyone defaming the father of the prime minister, who was the first president of Bangladesh, also referred by many as the \"Father of the Nation\".  The parliament recently passed another draft law, named \"Broadcast Law 2018\", which will jail anyone for seven years for making false statements on TV talk shows, the only remaining space for public political dissent.There are no credible polls in Bangladesh that measure the popularity of a government and its actions. Therefore, it is hard to predict whether the people of Bangladesh would prefer a repressive government delivering trophy economic indices in exchange for free speech, pluralistic democracy and basic human dignity. A free and fair election would be the best instrument capable of answering that question - if only there was indeed a chance to hold such an election.The views expressed in this article are the author's own and do not necessarily reflect Al Jazeera's editorial stance.UpFrontIs Bangladesh moving towards a one-party state?Shafquat Rabbee is a Bangladeshi-American geopolitical columnist and an Adjunct Faculty at the University of Dallas.The Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.From Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}