{"id": "Khashoggi killing: All eyes on Turkey as calls for answers mount", "paragraph": "Analysts say Riyadh's 'brawl' account of critic's killing puts onus on Turkey to disclose any proof it may have.After more than two weeks of denials, Saudi Arabia on Saturday admitted that journalist Jamal Khashoggi was killed inside its consulate in the Turkish city of Istanbul.In a statement read out on state media - in the middle of the night, on a weekend - the Saudi attorney general's office claimed the 59-year-old died in a \"brawl\".The explanation marked a sharp u-turn for the kingdom which had always insisted that Khashoggi - a prominent critic of the powerful Crown Prince Mohammed bin Salman (MBS) - had left the consulate shortly after he had entered on October 2. It also contradicted leaked information from unnamed Turkish security sources that Khashoggi was tortured, killed and dismembered inside the building.Eighteen men were in custody over the killing, the kingdom said, as it also announced the sacking of two top aides of MBS as well as three other intelligence officials.However, the admission, which came amid increasing pressure on Riyadh, has done little to ease international demands for accountability.After Turkey said it would not allow a \"cover-up\", Germany called the Saudi account \"inadequate\" while the United Nations stressed the need for \"a thorough and transparent investigation\".Rights groups, meanwhile, urged the UN to get involved in the probe, saying they were worried about a \"Saudi whitewash\" of the circumstances around Khashoggi's killing.Britain, a key Saudi ally, said it was considering the Saudi report and its \"next steps\", while the kingdom's allies in the Middle East - Egypt, Bahrain, the United Arab Emirates and Yemen's government-in-exile - praised King Salman's actions over Khashoggi.There was also another notable exception among the critical voices - US President Donald Trump.Even as legislators from across the political spectrum in Washington expressed scepticism over the Saudi narrative, Trump on Friday said Riyadh's explanation was credible and called the arrests a \"good first step\". A day later, he appeared to slightly change his tune by saying that he is \"not satisfied\" with the Saudi handling of the case but emphasised once again the importance that Washington's multibillion-dollar arms sales to Riyadh have for US jobs.Amid the outrage and the growing calls for answers, including for the whereabouts of Khashoggi's body, analysts said the Saudi account - by creating \"scapegoats\" - was aimed at defusing the weeks-long crisis and deflecting blame from the top Saudi leadership, particularly MBS.The crown prince has been drawn closer to the case after media reports claimed Khashoggi was killed by a 15-person \"assassination team\" who flew into Istanbul on two chartered planes. One of the 15 suspects was \"a frequent companion\" of MBS, according to The New York Times, while three others were reportedly linked to the crown prince's security detail.The Saudi admission was not about \"establishing the truth\", argued Andreas Krieg, assistant professor at King's College London, but about \"coming up with a story that provides [the kingdom] plausible deniability\".\"It is what Donald Trump thinks is moral to get away with,\" he said. \"And as long as he sits in front of the camera, saying I buy this and the Saudis are taking action ... the Saudis could get away with it.\"That is why audio and video evidence unnamed Turkish officials claim they have of the killing were critical to establishing accountability, Krieg said.Since Khashoggi's disappearance, anonymous Turkish officials have drip fed details of his killing - some of it lurid and gruesome - to the media. A Turkish official, who spoke to Al Jazeera on condition of anonymity, said earlier this week that Turkey's authorities have an 11-minute audio recording which indicates that Khashoggi was killed in the consulate.Last week, pro-government Turkish newspaper Yeni Safak, citing the audio, said the journalist's killers cut off his fingers during an interrogation. His body was later beheaded and dismembered, the report said.Trump has called on Turkey to share that evidence, \"if it exists\".Those leaks may have helped push the Saudi government to reverse its stance, analysts said. Sultan Barakat, director of the Center for Conflict and Humanitarian Studies at the Doha Institute, said while Saudi Arabia has managed to \"find scapegoats\" for now, it would be difficult for King Salman to stand by his son if Turkey were to reveal the purported evidence.Barakat said Turkey's possible reluctance to do so could be because it \"cannot own up to where the evidence is coming from\" as \"the Turkish government may have tapped the Saudi consulate or infiltrated the Saudi consulate for some time - and that will complicate Turkey's relations with Saudi Arabia\".A key factor in whether Turkey will publicise the alleged audio and video recordings will be the US response in the coming days, said Matthew Bryza, a former US diplomat and long-standing Turkey observer. If Trump \"becomes part of the effort to whitewash\" the killing, \"they will leak this information\", he said.Osman Sert, research director at Ankara Institute and former aide to ex-Turkish Prime Minister Ahmet Davutoglu, said he expected Turkey to continue its investigation until it uncovers \"who was behind the order\" for the killing. \"That's because Turkey wants to show foreigners that Istanbul and Turkey will stay a safe and secure place for visitors, whatever their political views are,\" he said. \"If powerful elites are allowed to remain free by blaming others, how can they convince the world Turkey is safe?\"He also noted high-ranking Turkish officials have pledged to prevent a \"cover-up\".Hours after the Saudi admission, Omer Celik, spokesperson for the ruling Justice and Development Party (AK Party), said Turkey was not \"accusing anyone in advance but we don't accept anything to remain covered (up)\". Meanwhile, Numan Kurtulmus, AK Party's deputy head, promised Turkey \"would not abstain from sharing with the world\" evidence of Khashoggi's death and will never \"allow a cover-up\" of what he called an \"ugly, frightening, inhumane case\".Sert said Celik and Kurtulmus' statements should be taken \"seriously\" and reflect Turkey's commitment to establish the truth of what happened to Khashoggi.There were geopolitical factors at play, too, Sert said.Observers said the strategy Turkey deployed over Khashoggi's killing - controlled leaks to the media - gives it political leverage over Saudi Arabia - Ankara and Riyadh are at odds on a number of regional issues, including a Saudi-led boycott of Qatar and relations with Iran.The case has also presented an opportunity for Ankara to repair its relations with Washington, which had soured over several disputes, including US support for Kurdish fighters in Syria and Turkey's plans to buy a Russian missile defence system.It is precisely the political manoeuvring that has others worried.Mohamed Cherkaoui, professor of conflict analysis and resolution at George Mason University, said neither Turkey nor Saudi Arabia could be trusted to be fully transparent on the Khashoggi case.\"My concern is there is a heavy-handed diplomatic political force that has suppressed the transparency of the legal investigation by the Turks, and the same thing will be done by Saudi Arabia.\"Calling for a UN probe into Khashoggi's killing, Cherkaoui said: \"The longer it takes, the more politicised it will become ... and you need someone who doesn't have any political investment in the process.\"\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}