{"id": "'Open the borders': New York rally urges US to welcome caravan", "paragraph": "Before the crucial midterm elections on November 6, advocates put spotlight on Trump's immigration 'scare tactics'.New York, US - Voters in the United States will take to the polls on Tuesday to cast their ballots in the midterm elections, in what is seen as a referendum on President Donald Trump's first two years in office.But for the hundreds of immigration advocates who gathered in central New York on Saturday, the fight for migrants' rights will be far from over no matter the result.\"We want Americans to understand this is beyond Republican and Democrat or Trump and his administration,\" Patricia Okoumou, the activist who climbed the Statue of Liberty on July 4 to protest against forced separations at the US-Mexico border, told Al Jazeera.\"If we don't act, we are all complicit … people need to open their eyes,\" Okoumou said, adding that it was time to acknowledge migrants and refugees as fellow human beings.It was a message echoed the busy Union Square in Manhattan, where people of all ages expressed solidarity with a US-bound caravan of thousands of Central American migrants and refugees. Activists said it was a last-bid effort to expose the \"horrific treatment\" of undocumented immigrants in the country, including family separations, detentions at the border and fear mongering from Trump and his Republican administration before the November 6 vote.Democrats are eyeing the midterm elections as an opportunity to take back a majority in the Senate and the House of Representatives from the Republicans, but activists said their fight is beyond the bi-partisan struggle for power.\"We are not putting all our eggs with the Democrats,\" said Denise Romero Gonzalez, an activist with the International Socialist Organisation (ISO).\"We were in a similar situation in 2008 and the idea then was that we would vote blue for [former President] Barack Obama, who was supposed to protect immigrants. But that didn't happen,\" she added.\"Elections are just one strategy. At the end of the day, there are Democrat politicians who are also invested in mass incarceration and deportation,\" Gonzalez told Al Jazeera.Patricia Okoumou, the activist who climbed the Statue of Liberty, at the protest on Saturday [Azad Essa/Al Jazeera]Since October 12, thousands of migrants and refugees - mostly Hondurans - have been collectively heading north to flee economic hardship, poor healthcare and violence, including political persecution.  The immigration caravan is currently in Mexico. But this has not stopped Trump from seeking to drum up fear of immigrants and issuing repeated warnings that appeal to his conservative base.In the lead-up to the vote, he called the caravan an \"invasion\" and claimed \"gang members\" were among its participants - all of which is unfounded.In a statement last week, the US Department of Homeland Security said, without offering any proof, that people from more than 20 countries - including Somalia, India, Haiti, Afghanistan and Bangladesh - had joined the caravan.Protesters called for the abolition of the US Immigration and Customs Enforcement [Azad Essa/Al Jazeera]Trump has also stated that the caravan would not be allowed into the US.Last week, he deployed more than 5,000 troops to \"protect the border\", even though under US and international law, members of the caravan are entitled to apply for asylum.At the protest in New York, the activists called for the humane treatment of those travelling in the caravan and said they should be allowed into the US.Holding up signs that read \"Abolish ICE\" (Immigration and Customs Enforcement) and \"Do not succumb to fear mongering\", they shouted slogans such as \"Open the borders\", their chants reverberating across the square.Barbara Mutnick, an organiser with the Jackson Heights Solidarity Network, said Trump was \"trying to divide the American people and trying to scapegoat immigrants\".\"We feel no human being is illegal, and we fight for that,\" she said, adding that even progressive Democrats have been silent on the migration caravan issue.Dustin Reyes, activist with the Immigrant Justice Working Group, told Al Jazeera the US president is using the caravan \"to fuel fear\".Nearby, a small group of hecklers, identified as Trump supporters, held up signs that mocked the rally and called for the caravan to be cancelled. The American Civil Liberties Union (ACLU) said in October that even though anti-immigrant policy was Trump's hallmark, he could still be swayed by public outrage.Activists at the rally said they are hopeful the new wave of mobilisation around Trump's policies will force his administration and the representatives voted in Congress to take their concerns seriously.They also pointed out the US' role in Honduras being in a state of dysfunctionality - \"a human rights and security abyss\" - since a 2009 coup, which Washington supported.At the time Hillary Clinton, Trump's Democrat rival in the 2016 presidential election, was US secretary of state.According to the World Bank, 66 percent of the people in the country live in abject poverty, with one in five living in extreme poverty, or earning less than $1.90 a day.Honduras has been in a state of dysfunctionality since a 2009 coup, which the US supported [Azad Essa/Al Jazeera]Meanwhile, Human Rights Watch said last year the murder rate in Honduras was among the highest in the world with activists, journalists routinely targeted.\"Marred by corruption and abuse, the judiciary and police remain largely ineffective,\" HRW said.Yasmine Kemel, an activist with the New York-based Bay Ridge For Social Justice group, said history is precisely why many immigrants living in the US understand that \"it not about who is in office\".\"I cannot forget that it was Obama who deported millions of people from the US and it was his administration that supported the coup in Honduras that has in part led to the situation in that country.\"It doesn't matter who is in office ... it is the extent to which we can mobilise people into action and force change to take place.\"\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}