{"id": "'Profoundly dismayed': Amnesty strips Suu Kyi of top honour", "paragraph": "Rights group withdraws top award over Myanmar's leader 'indifference' to the plight of the Rohingya.Amnesty International has stripped Myanmar leader Aung San Suu Kyi of its highest honour over her \"indifference\" to the atrocities committed by the country's military against the Muslim-majority Rohingya.The UK-based human rights group on Monday said it was revoking the Ambassador of Conscience Award it gave Aung San Suu Kyi in 2009 during her 15-year house arrest.\"Today, we are profoundly dismayed that you no longer represent a symbol of hope, courage, and the undying defence of human rights,\" Amnesty chief Kumi Naidoo said in a letter to Aung San Suu Kyi released by the group.\"Amnesty International cannot justify your continued status as a recipient of the Ambassador of Conscience award and so, with great sadness, we are hereby withdrawing it from you.\"The group said it informed Myanmar's leader of the decision on Sunday. She has so far issued no public response.Once hailed as a champion in the fight for democracy, Aung San Suu Kyi has been stripped of a series of international honours over a Rohingya exodus that began in August 2017.More than 720,000 Rohingya fled the Buddhist majority's western Rakhine State in a military crackdown since August last year, with most seeking refuge in neighbouring Bangladesh.Many are believed to have been either murdered or tortured and raped.Aung San Suu Kyi and her National League for Democracy (NLD) party swept to power in 2015 in a landslide victory ending decades of military rule in the southeast Asian country of around 50 million.But her tenure has been marred by a failure to speak up for Rohingya, who were driven out of the country by the army in what the United Nations has called an ethnic cleansing campaign.Aung San Suu Kyi's administration rejected the UN findings as one-sided, and said the military action was engaged in a legitimate operation against armed rebels.Last month, the 73-year-old was stripped of her honorary Canadian citizenship over her failure to speak up for the Rohingya.In March, the US Holocaust Memorial Museum rescinded its top award while other honours, including the freedom of the cities of Dublin and Oxford, England, were also withdrawn.She has also lost numerous smaller awards from individual universities and local and regional governments.In 1991, she was awarded the Nobel Peace Prize, which many of her critics have also called to be withdrawn. The Swedish foundation that oversees the award has refused.Inside StoryWho can protect Rohingya returnees?\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}