{"id": "Israeli air raids kill five Palestinians as Gaza tensions rise", "paragraph": "Jets pound Gaza, including Hamas TV station, after 300 rockets fired from enclave following deadly covert raid.At least five Palestinians were killed by Israeli air attacks on the Gaza Strip and an Israeli civilian died in a barrage of rocket fire in the worst violence between the two sides since the 2014 war.The latest escalation came less than 24 hours after at least seven Palestinians were killed in a covert Israeli operation in the besieged enclave.Hamas, the group administering the strip, said one of Monday's air attacks destroyed the building of its television station. There was no immediate word of casualties.Along with the air raids, Israeli artillery units also shelled positions across the densely populated enclave.The moment when Israeli warplanes bombing the building of Al-Aqsa TV.   Please, Stop this madness!#IsraeliCrimes #PrayForGaza #GazaUnderAttack pic.twitter.com/fNQLNPvACGThe attacks followed massive rocket fire from the Gaza Strip into Israel earlier in the day.Israel said its Iron Dome system intercepted many of the 300 missiles fired from the Palestinians. One, however, hit a bus and another struck a building in southern Israel.One Israeli man was pulled out dead from the ruins of the building hit by rockets, the emergency service said on Tuesday. A woman, also recovered from the debris in Ashkelon, was in a critical state, said the organisation United Hatzalah.One soldier was seriously wounded, the Israeli army said, and at least 27 other Israelis were also hurt in the projectile fire from Gaza.UN Secretary-General Antonio Guterres pressed all sides to back down. \"He urges all parties to exercise maximum restraint,\" UN spokesman Farhan Haq said.UN Special Coordinator Nickolay Mladenov was working closely with Egypt and all concerned parties to restore calm, Haq said in a statement.Electronic Intifada's Ali Abunimah said Israel was targeting the people of Gaza with \"terror, bombing and killing\".\"But they've also subjected their own Israeli population to the retaliatory operations of the Palestinian resistance factions,\" Abunimah told Al Jazeera.Mediation efforts not going well from what we are being told #gazaThe rising tensions came as thousands of people in the enclave took part in rallies following the killing of seven Palestinians - including Nour Baraka, a prominent commander of the al-Qassam Brigades, the armed wing of Hamas - in the Israeli military raid on Sunday evening.One Israeli lieutenant colonel was also killed and another one was seriously wounded in the undercover operation.Hamas leader Ismail Haniya led a funeral for Palestinians killed on Sunday as mourners called for revenge.Later, Palestinian factions said in a joint statement they had begun firing rockets into Israel in response to the Israeli military incursion.\"Over the past two hours, the Israelis have targeted many resistance training camp and many buildings,\" Mukhaimar Abusada, professor at Gaza's al-Azhar University, told Al Jazeera on Monday evening.\"It seems to me that we are going to witness a very hard night as a result of the ongoing Israeli retaliation.\"According to Hamas, Israeli undercover forces on Sunday entered the Strip in a civilian car and exchanged fire with the group's gunmen near the city of Khan Younis. A pursuit ensued and witnesses said Israeli aircraft fired dozens of missiles into the area to provide cover for the commandos to escape.In the immediate aftermath of the raid, more than 10 rockets were fired from Gaza as the Israeli forces carried out air raids.Israel's army provided few details about the reason for the covert operation. A military spokesperson claimed the raid was \"not intended to kill\" Hamas commanders, adding the forces faced a \"very complex battle\".The escalation comes in a period where both Hamas and Israel seemed to have moved closer to a truce, mediated by Egypt, the UN and Qatar.Last week, Israel allowed Qatar to deliver aid and fuel worth $15m to besieged and poverty-stricken Gaza, which only has a few hours of electricity a day and an unemployment rate of more than 50 percent.Abunimah said Israel has a long history of \"sabotaging\" ceasefire agreements, adding the deadly commando raid was ordered to stoke the flames of conflict.\"You would think that after Israel violated numerous ceasefires with similar results they would learn the lesson, but it seems the Israeli leaders are pyromaniacs. They cannot tolerate calm. They cannot tolerate that the people in Gaza live in anything like peace. Israel is incapable of living in peace and calm with the Palestinians,\" he said.It remains to be seen what happens next as Israel's security cabinet meets on Tuesday to plot a course of action. Abusada said: \"Hamas is not interested in another military escalation, but they feel they are under pressure ... especially from the other Palestinians resistance groups that there has to be a retaliation against the Israeli raid into the Gaza Strip\". Since 2008, Israel has launched three major assaults on Gaza that have heavily damaged the Strip's infrastructure and sources of livelihood.Violence has flared frequently on the frontier since Palestinians in the Strip began weekly protests along the fence with Israel on March 30, demanding their right to return to the homes and land their families were expelled from 70 years ago.The protesters are also demanding an end to Israel's crippling blockade of the enclave, which has destroyed its economy and deprived its two million inhabitants of many basic commodities.Since the Great March of Return demonstrations began on March 30, more than 200 Palestinians have been killed and thousands more wounded by Israeli troops deployed along the other side of the fence.\"The Palestinians have been suffering as a result of lack of electricity for the past two years, at least, and Hamas has also been facing a very serious financial crisis,\" said Abusada.\"But the Palestinians are not in any way are ready to betray their dignity and freedom for money and fuel.\"REWINDChildren of Conflict: Growing up in Gaza\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}