{"id": "Understanding Afghanistan's elections 2018", "paragraph": "Most SearchedAlia Chughtai, Shereena Qazi  | 20 Oct 2018 15:36 GMT | Afghanistan, Asia, Taliban, ElectionsAfghanistan headed to the polls on October 20 to vote for its third parliament since the country's new constitution was adopted in 2004.It has not been easy for Afghanistan to arrive at this point; the country is wracked with violence as the government fights the Taliban, which controls up to 14 percent of the country's territory. In the past three months, 10 of the 2,565 candidates who put their names forward to run have been killed in attacks, the majority carried out by the Taliban.Elections were originally scheduled for 2014 but have been delayed several times, not only because of the security situation, but also due to unresolved disagreements about election reforms and potential fraud.In Kandahar, the polls were delayed by a week following the killing of the southern province's powerful police chief, General Abdul Raziq, which was claimed by the Taliban.Ghazni, one of Afghanistan's 34 provinces, was excluded from the vote this year because of a volatile security situation and an ongoing dispute over how to divide electoral constituencies to have a more balanced ethnic representation.In 2010, parliamentary elections, the Hazaras, a minority community, won all the seats from Ghazni, leaving majority Pashtuns and also Tajiks without representation as voting was not conducted in their areas that are mostly controlled by the Taliban.The parliament of Afghanistan comprises two houses: The upper house, or Mesherano Jirgaw, serves in a mostly advisory role with some veto powers, and the lower house, or Wolesi Jirga, is tasked with passing legislation.The 250 seats in the Wolesi Jirga are distributed among the 34 provinces according to proportional representation.One seat is reserved for the Sikh and Hindu communities and 10 are reserved for representatives of the nomadic Kuchi peoples. Sixty-eight seats are earmarked for female representatives, two from each of Afghanistan's 34 provinces.A total of 205 candidates across the country have registered as members of political parties. The rest of them are registered as independent candidates. There is no voting for the upper house of parliament, the Mesherano Jirga, which consists of parliamentarians chosen from local councils and those appointed by the president, as well as members elected in district elections. Source: Al Jazeera\r\n      Commenting has been disabled. To find out more, click      \r\n      here.\r\n     The Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nInteractive, Philippines, EnvironmentRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.Europe, Russia, Saudi ArabiaFrom Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.Environment, Native Americans, US & CanadaAnswer as many correct questions as you can and see where your country ranks in the global cost of living.InteractiveMeet the hardline group willing to do anything, including going against their government, to claim land for Israel. Israel, Occupied West Bank, Middle EastMoroccan dissident Abraham Serfaty was jailed, tortured and exiled for his radical views over decades.History, Morocco, Human RightsAn insight into the Trump administration's relationship with the religious right and implications for US politics.Religion, Donald Trump, US Midterms 2018In an age of non-stop news feeds and disposable media, which stories and images stay with us and how do they shape us?Journalism, Humanitarian crises, Media\n \n\t\t\t© 2018 Al Jazeera Media Network\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t "}