{"id": "Brazil: Fake news scandal hits country's presidential election", "paragraph": "Bolsonaro appears to be at least temporarily shaken by reports his backers allegedly flooded voters with fake news.Sao Paulo - Brazil's turbulent election enters its final phase with far-right candidate Jair Bolsonaro poised for victory amid a high-profile fake-news scandal and an uptick of reports of electoral violence.Latest opinion polls from the Datafolha polling agency suggest that Bolsonaro - who openly praises Brazil's 1964 - 1985 military dictatorship - is heading for a landslide victory against his centre-left rival Fernando Haddad of the Workers' Party (PT) on October 28 with the 59 percent of intended votes compared with 41 percent.But on Thursday, his campaign appeared to be at least temporarily shaken, as Brazil's Folha de Sao Paulo newspaper reported that businessmen and companies were secretly financing the mass spread of slanderous messages about Haddad via the online messaging platform Whatsapp.According to the newspaper, the practice constitutes an electoral crime as all political campaign donations must be declared and donations from companies were banned in 2015, a practice introduced to tackle corruption.\"We will call on the Federal Police and the Electoral Justice to prevent Deputy Bolsonaro from violently violating democracy as he has done,\" Haddad tweeted.In an article published by the Brazilian news portal UOL, legal experts commented that if proven the case could eventually lead to Bolsonaro's electoral ticket being cancelled though this is considered highly unlikely before the final round of voting next Sunday. On Friday, a video - originally posted on August 28 - circulated on Brazilian social media of two prominent businessmen Luciano Hang and Mario Gazin calling for Bolsonaro to win in the first round to not have to spend \"more money,\" fuelling further speculation of illegal campaign practices.Hang, owner of the chain of department stores Havan, is one of the businessmen cited in the Folha de Sao Paulo newspaper report. He denied the accusations and said he planned to sue the newspaper.Bolsonaro hit back on Thursday night with a 20-minute Facebook Live in which he attacked the newspaper as \"continuing to sink into the mud\" and the Workers' Party; calling Haddad a \"scoundrel\".\"We don't need fake news to combat Haddad, the truths are sufficient,\" he said.Brazil's electoral court scheduled a meeting for Friday to discuss measures to tackle the spread of fake news on social media but delayed the meeting until Sunday. On Friday night, the electoral court opened an investigation. And on Saturday, Brazil's Federal Police opened an inquiry to investigate the scandal.The mass spread of fake news during Brazil's 2018 election has become a key concern. While attacks have been directed at all candidates, observers say that Bolsonaro is a main benefactor.\"It's a campaign based very little on news, based more on images and videos, with a language of social media and of very poor quality,\" Pablo Ortellado, a professor of public policy at the University of Sao Paulo, who leads a project to monitor online debates, said of content found in pro Bolsonaro Whatsapp groups.Here's how Brazil is fighting back against fake news. pic.twitter.com/5O1h7tcfo3Meanwhile, the number of reports of electoral violence in Brazil continues to rise and prompted the United Nations Human Rights Commission last week to issue a condemnation. Bolsonaro and Haddad have both publicly condemned the violence.Sao Paulo police are investigating the murder of a transgender woman who died from stab wounds in the early hours of Tuesday morning in which a witness reported that the attackers shouted \"Bolsonaro\".On Wednesday, police in Bahia state confirmed that the murder of capoeira master Moa do Katende was committed by Bolsonaro supporter Paulo Sergio Ferreira de Santana who stabbed the victim 12 times in the back after an argument about politics.Throughout his nearly three-decade career in politics as a congressman, Bolsonaro repeatedly made statements affirming support of the use of torture, extrajudicial police killings and calling for the execution of political opponents, including former Brazilian President Fernando Henrique Cardoso.Observers worry that if he's elected, an iron-fisted crackdown on Brazil's spiralling crime problem - with more than 63,000 homicides last year - could lead to a greater even explosion of violence, disproportionately affecting marginalised groups.\"We hope that control of any excesses would be made by Brazil's democratic institutions and that, the outrageous remarks he made throughout his career, weren't serious and won't be put into practice,\" said Bruno Paes Manso, a researcher at the Nucleus of Violence Studies at the University of Sao Paulo.\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}