{"id": "How indigenous 'vigilante' grandfathers protect forest life", "paragraph": "A group of elders, frustrated with state response, protect forest from looting against backdrop of rising deforestation.Rovieng, Cambodia - At the edge of a forest on the northern plains of Cambodia, an indigenous community is building its own security system.It comprises a small outpost made of timber confiscated from illegal loggers at the main access point looters use as they look to rob the forest of its riches.For the community's self-appointed forest patrol, it is a key line of defence when most indigenous people have been reduced to bystanders as their ancestral forests are felled.\"We can't depend on the law, it's too slow,\" says Ruos Lim, the 67-year-old patrol leader.A group of mostly tribal elders, they see themselves as vigilantes, tasked with defending the forests that provide them with food and income.\"Day and night, we will lead our children and grandchildren to protect our livelihoods from all intruders,\" says Lim, who believes that if the forests are destroyed, next goes the community, its traditions, its language, and potentially an entire way of life.The forest has wild fruit, timber and honey. \"This place is a special kind of bank,\" says Lim. \"We invest by nurturing the forest, and there is always plenty to take out.\"He has lived his entire life in the tiny village of Bang Khanphal, which backs the Chom Penh forest, part of the 242,500-hectare Beng Per Wildlife Sanctuary.Chom Penh has provided the village with building materials, food and higher-value products like honey and resin for trading.For Lim's grandparents - members of the Koi indigenous minority, with populations through the north of Cambodia and across the border into Thailand - the forest was the community's only source of wealth. \"The trees, the streams, the mountains are our gifts to our children,\" Lim said late one night, swinging in an old hammock and puffing on wild tobacco rolled in a leaf. \"The forest is their inheritance and we must protect it from the thieves.\"But as deforestation has increased, indigenous people are forced to venture further into Beng Per to find products of value, putting Chom Penh, at the heart of the sanctuary, increasingly under threat. Satellite images show grids of rubber plantations eating away at the lush green Beng Per Sanctuary. In 2013 alone, Beng Per lost 12.4 percent of its forest cover, according to satellite data by Licadho, a Cambodian rights group. It has lost at least 33 percent since 2000.For more than two decades indigenous communities have been fighting against a wave of investment from agribusinesses, foreign and local, that bought permission from the central government to clear, according to Licadho, more than half of Cambodia's arable land, an area roughly the size of El Salvador.This land is then leased to concessionaires, mostly well-connected tycoons, who use it to launder billions of dollars' worth of luxury timber stolen from the surrounding forests. Once the wood makes it onto a concession, it's as good as legal, its source untraceable. National parks and wildlife sanctuaries, where logging is prohibited, became targets of those hired to cut down trees for concession owners.And as the oldest and most valuable trees were picked off, reclassified as \"degraded forest\", they were turned into plantations. In Southeast Asia's most corrupt country, according to Transparency International, poorly paid rangers have little incentive to confront logging cartels with the cash and connections to bend the law.\"In remote areas, groups like the rangers tend to work for the highest bidder,\" says Marcus Hardtke, a German environmentalist who has been chronicling the illegal timber trade in Cambodia since 1996.\"In these situations, the local communities are the final and only line of defence for forest and wildlife.\"\"In reality, we are the only active patrollers here,\" Lim says. \"The rangers' only concern is who pays for their fuel.\"Journalists and environmental watchdogs have published evidence tying unlawful deforestation to the highest levels of authority in Cambodia, including the prime minister's office.In 2011, Try Pheap, an associate of Prime Minister Hun Sen with a 10,000-hectare rubber plantation in Beng Per, donated $100,000 to build a ranger station for the sanctuary.Global Witness, a watchdog that was kicked out of Cambodia after releasing a damning expose of the timber industry, labelled Pheap a timber gangster \"destroying Cambodia's last forests and robbing indigenous communities of their livelihoods\".In a 2015 report, Global Witness said: \"The very officials in Cambodia who should be stopping [illegal logging] are conspiring to ensure that contraband wood enjoys safe passage and is exported as seemingly legitimate lumber.\"Despite evidence, Phnom Penh has rejected such reports. Every so often, a new enforcement drive is launched, such as in 2016, when the prime minister ordered military police in helicopters to fire rockets on illegal loggers \"without mercy\".No rockets were fired, and, in recent months, with deforestation again on to the national agenda, the prime minister recycled his rockets and helicopters measure using almost identical language.Neth Pheaktra, a spokesman for the Environment Ministry says that the government supports community patrols and would act on any reports of illegal logging.He says that clear-cutting protected forests was necessary to \"develop the country and create jobs\" and that an environmental effect assessment was conducted before each concession was handed over.\"We found that [there would be] no impact on the sanctuary,\" he says.The challenges in Beng Per started in the sanctuary's southeast, and as the destruction churns towards Chom Penh, Lim and his band of vigilantes are bracing for further looting.And in the world of illegal logging, no one is safe. About 200km east of Chom Penh, a military police officer, a government ranger and a conservation worker were murdered earlier this year after confiscating chainsaws from loggers inside a protected area. The suspects, Cambodian soldiers, are in prison awaiting trial.Lim and his men have turned their regular forest jaunts into rolling patrols. Their mission is to stop Chom Penh from being pillaged, and they use a combination of education, scolding and threats.On a clear day in August, two patrol teams left Bang Khanphal village before dawn, on foot and in opposite directions to look for intruders.The main party departed hours later, on a ko yun - or mechanical cow - a long, flat trailer attached to a diesel engine on wheels. They carried fuel, hammocks and four days' worth of rations: 30kg of rice, 10 litres of rice wine, energy drinks and salt. Everything else would come from the forest.Aside from locals coming out of their earth-floor homes to stop the party and offer a winter melon or some spices for the trip, the planning and departure was carried out with military precision, and later that day, when the patrol hit the southern reaches of Chom Penh, Lim's background bubbled forth. \"This is the war zone,\" he said. At the age of 21, Lim joined the Khmer Rouge, rising from lowly village spy to the head of a local security unit whose area encompassed parts of Chom Penh. At 67, he claims that he never killed anybody in battle or lost control of his forest.Today, his front line is marked by chainsaw-scarred trees and piles of freshly cut timber - the remnants of battles won and lost.\"If we find thieves here today,\" Lim says, a patrol team of six in tow, \"it will make me very happy.\" The pillagers the patrol eventually encountered, however, were mainly opportunists. Ninety percent of the \"thieves\" the patrol finds are Koi people whose community forests have been razed, driving them closer to Chom Penh in search of a quick buck. \"Some days they find a single piece of wood, some days they find nothing,\" Lim explained later, as he rested in his hammock. \"They don't' know how to find a job. They've lost their forests, their farms - it's all been cleared. That's why they come looking.\"Having to scavenge for a livelihood is exactly the fate he is trying to keep from his people.One afternoon, after tracking the buzz of chainsaws to a makeshift logger's camp just outside Chom Penh, Lim called out, \"The rangers are here, the rangers are here. Come and face us.\" Three young men caked in sweat and sawdust emerged and faced a group of grandfathers carrying pick axes and knives. They sat in the dirt as Lim stood over them and delivered an impassioned scolding.\"Do you understand how important the forest is to your people,\" he said. \"Have you forgotten who you are?\"The loggers said they'd heard rumours the forest would soon be cleared and replanted with rubber and decided that they may as well get a piece of the loot.\"It's a trick to make you cut down your own forest,\" Lim said. \"You are listening to outsiders and they have made you crazy about money.\"In about a dozen encounters with loggers on the patrol's four-day trip, only one group tried to escape. The patrollers tracked them down later in their village and handed them over to the police. The rest accepted their punishment, a vocal beatdown from a local elder they knew, feared and respected. One absorbed his lecture and then joined the patrol team.Reporting for this story was supported by the Earth Journalism Network's 2018 Asia-Pacific Story Grants.\r\n            SOURCE: Al Jazeera News\nThe Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.From Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}