{"id": "Saudi-led coalition sends thousands of troops towards Hodeidah", "paragraph": "The deployment of troops, including Sudanese forces, is part of new offensive expected to start 'within days'.A Saudi-UAE-led coalition fighting Yemen's Houthi rebels has sent more than 10,000 additional troops towards the rebel-held port city of Hodeidah, according to Yemeni government officials.The deployment is part of a planned new offensive aimed at securing \"areas liberated\" from the Houthis, a military official told AFP news agency on Tuesday.According to the unnamed official, the mission is expected to commence \"within days\" and forces from Sudan, part of the coalition, had moved in to \"secure\" areas around the strategic city.For the past 10 days, Houthi rebels have stationed fighters on the rooftops of buildings in Hodeidah city, AFP reported government military officials as saying.The Yemen conflict began in 2014 when the Houthis toppled the government of President Abd-Rabbu Mansour Hadi and took control of the capital, Sanaa. Saudi Arabia led an intervention in 2015 to fight the Houthis.Civilians have borne the brunt of the conflict, which has sparked the world's worst humanitarian crisis and a cholera epidemic. According to the United Nations, at least 10,000 people have been killed since the coalition's intervention. The death toll, however, has not been updated in years and is likely to be far higher.The Red Sea port city of Hodeidah has strategic importance in the conflict. It is the only port held by the Houthis and serves as the entry point for the bulk of Yemen’s commercial imports and aid supplies.Saudi Arabia has accused the Houthis of using the port to smuggle in weapons from Iran. The UAE has said the Houthis generate $30m to $40m a month in revenue from the port.Last week, the UN's humanitarian chief warned that the situation in Yemen was far worse than previously estimated.Mark Lowcock, UN undersecretary-general for humanitarian affairs, said 14 million people in Yemen face a serious threat of famine, noting that the worsening food crisis was largely the result of the fighting around Hodeidah.The coalition launched an aerial bombing campaign in June 2018 aimed at pushing the Houthis out of the Red Sea city.After UN-backed peace talks collapsed in September, the Saudi-UAE-led coalition announced it would relaunch an assault on Hodeidah.Since then, Saudi-led forces have focused their raids on the city limits and other parts of the surrounding province.Last week, air strikes in the province killed dozens of civilians, the UN said, which the Houthis blamed on the coalition.\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}