{"id": "Hate before the vote: Pipe bombs, shootings, incitement", "paragraph": "Experts and monitors say this could be one of the most violent election seasons in living memory.Washington, DC - Eleven people shot dead in a synagogue. Two African Americans killed at a supermarket. More than a dozen pipe bombs mailed to prominent Democrats and CNN.As President Donald Trump and Republicans escalated campaign rhetoric, much of it anti-migrant and anti-Muslim, deadly attacks and threats of violence marred the lead-up to the midterm elections.Experts say it is one of the most violent election campaigns in living memory, and critics lay much of the blame on the president. Heidi Beirich heads the Intelligence Project at the Southern Poverty Law Center (SPLC), an Alabama-based hate monitor. In her decades of experience, she cannot recall a pre-election tide of violence as worrisome as the one pouring over the US right now.\"This is three major attacks, the last being the most devastating, in just a few days right before an election,\" she told Al Jazeera, explaining that uptick in hate crimes and far-right violence have traditionally followed elections rather than preceded them.On Saturday, a gunman stormed the Tree of Life Synagogue in Pittsburg, Pennsylvania, and perpetrated what has been described as the deadliest assault on the American Jewish community in the country's history. \"All Jews must die!\" he reportedly screamed, while unloading a barrage of bullets that killed 11 worshippers during prayer time. Police quickly arrested 46-year-old Robert Bowers, a frequent poster on the Gab social media platform, where he reportedly announced his intent to carry out the massacre just hours earlier. Although Bowers criticised Trump, he shared the president's anger over a US-bound caravan of Latin American migrants and refugees. The massacre came just a day after police arrested Cesar Sayoc, who they believe mailed more than a dozen pipe bombs to outspoken critics of Trump.The recipients were frequent targets of far-right ire: former President Barack Obama, former Secretary of State Hillary Clinton, Hungarian-American billionaire George Soros and US Congresswoman Maxine Waters, among others.Sayoc's now-suspended Twitter accounts teemed with pro-Trump posts, conspiracy theory memes and often violent threats to journalists and others.And as authorities intercepted explosive packages across the nation, a murder occurred in Louisville, Kentucky on Wednesday. A white man allegedly shot and killed two black shoppers at a Kroger supermarket after failing to break into a predominantly African American church. \"Whites don't kill whites,\" the suspect reportedly told a bystander.From the earliest days of his presidential campaign, Trump faced accusations that his rhetoric fueled racism, xenophobia and violence.Although hate crimes were nothing new, Trump's ascent to power sent them soaring as far-right groups rallied behind his message. During the 10 days following his election, the SPLC documented nearly 900 reports of \"harassment and intimidation\" across the US, with many of the assailants declaring their support for Trump.A steady stream of violence, clashes between far-rightists and anti-fascists, and a deadly white supremacist rally in Virginia punctuated Trump's first year in office.White supremacists killed at least 18 people in 2017, according to the Anti-Defamation League. Daryle Lamont Jenkins, One People's ProjectEven with last year's string of hate crimes, confrontations and brawls across the nation, the current spate of violence shocks Daryle Lamont Jenkins, who has monitored white nationalists, racist skinheads and neo-Nazi groups for more than three decades.\"Attempted assassination of elected officials past and present, a synagogue being attacked and people being killed in a grocery store in Kentucky - none of these folks engaged in any kind of violence,\" he told Al Jazeera, adding: \"It has never really been this [violent] during elections.\"Jenkins, who founded the One People's Project hate watchdog in 2000, added, \"These [the far right] are the people who are supposed to be in power right now, and yet they still feel they're threatened.\"Although he expected similar far-right violence had Hillary Clinton bested Trump during the 2016 presidential elections, he says that the stakes are especially high now. \"You're talking about people who are predicting civil war if Trump is impeached … this is what they are looking for.\"Critics point to Trump's rhetoric, arguing that president's words have contributed to the spike in incitement, surge in hate crimes and mushrooming of hate groups.In early October, members of the far-right, pro-Trump Proud Boys group attacked anti-fascist protesters outside the Metropolitan Republican Club in New York City. Gavin McInnes, the group's founder, had been invited to speak at the club, where his supporters assaulted the protesters and yelled homophobic slurs. Last week, when Trump addressed a campaign event in Texas for Senator Ted Cruz, he deemed himself a \"nationalist\" gripped in a battle against \"power-hungry globalists\".Condemnation followed soon after, and Trump's opponents pointed out that the term globalist is often employed in the service of far-right conspiracy theories and carries thinly-veiled anti-Semitic undertones.With little success, Trump and his supporters have sought to distance the president's rhetoric from the violence unravelling on the ground.After the deadly synagogue shooting in Pittsburgh, Trump took to Twitter to blame \"fake news\" for \"great anger\" in the country. His comments echoed similar ones made a few days earlier in response to the spate of attempted bombings.Steven Rogers, a former law enforcement officer who sits on the Trump for President advisory board, defended Trump against allegations of incitement and fearmongering.\"Hate is embedded in one's heart,\" he told Al Jazeera, arguing that films, music and video games have cultivated a culture of violence.\"It is not caused by a person's political speech. The president is not responsible for the terrible acts of… deranged people.\"But the SPLC's Beirich says there is \"no question\" that Trump's rhetoric has tilled the soil for would-be attackers. \"We have been tracking domestic terrorism incidents for more than 20 years, and I don't really remember seeing something like this.\"\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}