{"id": "'Help us': Aasia Bibi's husband in Pakistan appeals for asylum", "paragraph": "Ashiq Masih's request for asylum in US, UK or Canada comes a day after he criticised the government deal with TLP.The husband of a Pakistani Christian woman acquitted in a blasphemy case has pleaded for international help to leave the country, saying he feared for his family's safety.The request on Sunday by Aasia Bibi's husband, Ashiq Masih, came a day after he criticised a government deal with far-right Tehreek-e-Labbaik Pakistan (TLP) that left her in legal limbo, and called on authorities to protect her.Bibi, 53, who had been on death row since 2010 on blasphemy charges, was acquitted by the Supreme Court on Wednesday.Her acquittal triggered massive protests by TLP, which paralysed parts of the country for three days, blocking roads and disrupting traffic.The government reached a deal on Friday to end the protests by agreeing to put Bibi on an \"exit control list\", and saying it would not object to Muslim groups appealing the verdict.An appeal has been filed with the top court against Bibi's release.Masih criticised the government deal, saying it was \"wrong\".\"I request [US] President Donald Trump to help us leave [the country], and I request the prime minister of the UK to do their level best to help us, to grant us freedom,\" Masih said in a video message, according to news agencies.\"I also request the prime minister of Canada,\" he said.Wilson Chowdhry, of the British Pakistani Christian Association, told the AFP news agency that Masih also wants asylum for some members of his extended family.\"The daughters are weeping. They still haven't seen their mother. The family is totally shattered,\" he said.Masih's appeal came a day after Bibi's lawyer fled Pakistan on Saturday, also citing threats to his life.\"In the current scenario, it's not possible for me to live in Pakistan,\" Saif-ul-Mulook told AFP before boarding a plane to a European country.Blasphemy is a sensitive subject in Pakistan, where the country's strict laws prescribe a mandatory death penalty for some forms of the crime.Increasingly, blasphemy allegations have led to murders and mob lynchings, with at least 74 people killed in such violence since 1990, according to an Al Jazeera tally.Bibi had been on death row for eight years following her arrest in the central Pakistani village of Ithan Wali over an argument with two Muslim women, who refused to drink water from the same vessel as her due to her religion.The women accused her of having insulted Islam's Prophet Muhammad during the altercation, a charge Bibi has consistently denied.Salman Taseer, the then-Punjab provincial governor, spoke in Bibi's defence before being assassinated by his bodyguard in 2011.The TLP was founded out of a movement to support Taseer's assassin, who was hanged in 2016.Shahbaz Bhatti, a federal minister for minorities, was also killed after calling for Bibi's release.Pakistan's leading rights watchdog criticised the recent deal to end the protests, saying it was \"appalled\" at the government's failure to \"preserve the rule of law\".But Information Minister Fawad Chaudhry insisted the government was not ignoring the actions of the far-right groups.\"No one should have this wrong impression that the state will ignore this behaviour,\" he told reporters on Sunday. \"The state will not ignore the rebellion.\"Meanwhile, police said they have arrested over 150 people across Pakistan for arson, violence and incitement during the protests this week.\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}