{"id": " 'Explosive devices' sent to Clinton, Obama, CNN", "paragraph": "Officials intercept packages sent to top Democrats as police respond to device found where CNN New York office is based.At least five suspicious packages were sent to top Democrats, including former President Barack Obama and former Secretary of State Hillary Clinton, and CNN's New York offices, authorities said on Wednesday.All the packages were intercepted, and there were no reports of injuries.  US Secret Service said it recovered a single package addressed to Clinton in Westchester, a suburb north of Manhattan late on Tuesday.A second package, addressed to Obama, was found early on Wednesday in Washington, DC.\"The packages were immediately identified during routine mail screening procedures as potential explosive devices and were appropriately handled as such,\" the Secret Service said in a statement.\"The protectees did not receive the packages nor were they at risk of receiving them,\" it said.Secret Service launched an investigation to find the source of the packages. Hillary Clinton was not at her New York home when Tuesday's package was sent, but her husband, former President Bill Clinton was present, officials told the Associated Press. While at a Florida fundraiser, she said \"we are fine\" and thanked US Secret Service for intercepting the package \"long before it made its way to our home\". The New York Police Department (NYPD) also responded to a suspicious device, believed to be a pipe bomb, found at the Time Warner Center, where CNN's New York newsroom is based. George Soros: Explosive device found in the mailbox outside the philanthropist's New York home on Monday.    Hillary Clinton: Authorities intercepted suspicious device sent to Clinton's New York suburban home late on Tuesday.    Barack Obama: Authorities intercepted suspicious device sent to Obama's Washington, DC home early on Wednesday.    CNN New York office: Suspicious package, addressed to former CIA Director John Brennan, found in mailroom of the Time Warner Center, home to CNN's New York office on Wednesday.   Debbie Wasserman Schultz: Suspicious package found on Wednesday in the building where Florida Congresswoman Schultz's office is located. CNN reported that the package was meant for former US Attorney General Eric Holder. Maxine Waters: The US representative said in a statement that Capitol Police informed her that her Washington, DC office was a target of a suspicious package on Monday.The New York City police commissioner said the package contained what appeared to be a live explosive and envelope containing white powder. The package was addressed to former CIA Director John Brennan, CNN reported, citing city and local law enforcement officials. Brennan appears on other cable and broadcast networks. According to the NYPD's chief of counterterrorism, the explosive appeared to be sent by the same person who mailed suspicious packages to the Clinton and Obama homes, as well as the device found on Monday at the home of billionaire philanthropist George Soros.  FBI officials said at a news conference that the devices all appeared to be crude pipe bombs. New York City Mayor Bill de Blasio said the attempted attacks were \"clearly an act of terrorism\".CNN anchors were on the air from New York discussing the explosive devices addressed to Obama and Clinton when they were interrupted by a fire alarm and cut to a commercial. Here's the moment CNN had to handoff to DC and evacuate Time Warner Center in New York pic.twitter.com/TUtnWrss9zThe news organisation's New York staff evacuated the building as a precaution.    CNN Worldwide President Jeff Zucker said there is a \"total and complete lack of understanding\" at the White House about the seriousness of the administration's attacks on the media. \"The president, and especially the White House press secretary, should understand their words matter. Thus far, they have shown no comprehension of that,\" he said. CNN has been a repeated targeted of Trump's attack on the media, with the US president often labelling the network as \"fake news\".Police are also investigating a suspicious package sent to a building where the office of Democratic Congresswoman Debbie Wasserman Schultz is located. The building was evacuated, but it remains unclear what the package contains, according to 7 News Miami. CNN reported that the package was addressed to former US Attorney General Eric Holder, but was sent to the wrong address and returned to Wasserman Schultz's office due to the return address on the package. Democratic Representative Maxine Waters said in a statement on Wednesday that US Capitol Police said that her Washington, DC, office was the target of a suspicious package that was referred to the FBI. It's unclear whether the package was related to those sent to Clinton, Obama and the CNN New York office. The White House condemned the attempted attacks, saying \"terrorising acts are despicable, and anyone responsible will be held accountable to the fullest extent of the law\".Press Secretary Sarah Sanders added in a statement that the \"United States Secret Service and other law enforcement agencies are investigating and will take all appropriate actions to protect anyone threatened by these cowards\".US President Donald Trump said that \"acts or threats of political violence have no place in the United States\", adding that a \"major federal investigation\" is under way. With the country deeply polarised under Trump, the packages brought a new level of tension to the upcoming midterm elections on November 6.Democratic leaders said that Trump's call for unity after the packages were found \"rings hollow\" because of his past statements that condone acts of violence. \"Time and time again, the president has condoned physical violence and divided Americans with his words and his actions,\" Senate Democratic Leader Chuck Schumer and House of Representatives top Democrat Nancy Pelosi said in a statement.They cited Trump's \"support for the congressman who body-slammed a reporter, the neo-Nazis who killed a young woman in Charlottesville, his supporters at rallies who get violent with protesters, dictators around the world who murder their own citizens, and referring to the free press as the enemy of the people.\"House Republican leaders said the person or people who sent explosives to the Clinton and Obama homes should be brought to justice. House Speaker Paul Ryan said they were \"reprehensible acts\" and \"we cannot tolerate any attempt to terrorise public figures\".\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}