{"id": "\n\n\n\n‘We Fed An Island’: Chef Jose Andres tells us about his activism", "paragraph": "The Stream is a social media community with its own daily TV show.Activist and award-winning chef Jose Andres didn’t want to “just give food” to Puerto Ricans recovering from the impact of Hurricane Maria. He wanted to give “the best food”. In his new book, We Fed an Island: The True Story of Rebuilding Puerto Rico, One Meal at a Time, Andres recounts the struggle of trying to provide aid to a US territory ravaged by storm and entangled in bureaucratic red tape.\nAndres founded the World Central Kitchen in 2010 after an earthquake rocked Haiti, using his personal and professional networks to secure resources and provide food services to the devastated nation. But in Puerto Rico, he found himself frequently at odds with US government institutions that, to him, seemed more concerned with playing politics than helping the island’s more than 3 million residents.\n“Even with expanded numbers of military personnel, the troops were overwhelmed by the sheer scale of the challenge. Besides, those numbers weren’t nearly as important as the 55 percent of Puerto Ricans who didn’t have access to clean water,” he says in the book. “That represented 1.87 million Americans without the essential ingredient for life. Fully 95 percent of islanders still had no access to power.”\nIn this episode, Jose Andres joins us to discuss the challenges of providing relief to Puerto Ricans after Hurricane Maria, and his efforts to do the same for those currently affected by subsequent storms. Join the conversation. Joining us today:\nJose Andres, @chefjoseandres\nChefjoseandres.comRead more:\n‘We All Were Driven by the Need to Feed an Island’ - Eater\nAfter Hurricane Maria, Chef José Andrés Had A 'Crazy Dream' To Feed Puerto Rico - NPR\nJosé Andrés comes to Florida to feed Hurricane Michael victims - Tampa Bay TimesWhat do you think? Leave a comment in the section below, or click here to record your thoughts. Every Monday through Thursday onAl Jazeera English or this site.What does the killing of a Kosovo Serb politician reveal about the deep fault lines running through the Balkan state?Kosovo, Serbia, PoliticsIraqi artists Dia al-Azzawi and Mahmoud Obaidi discuss the ongoing conflict and destruction in their homeland.Arts & Culture, Iraq, Middle EastWhile working on a kibbutz in 1967, a Japanese journalist discovers the hidden remains of a Palestinian village.Palestine, Al Nakba, JapanWe meet John Nicholson, Trump's top general in Afghanistan, to find out if the conflict can ever be brought to an end.ISIS, Taliban, Afghanistan\n \n\t\t\t© 2018 Al Jazeera Media Network\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t "}