{"id": "'Don't threaten us,' Iranians tell US as sanctions return", "paragraph": "Thousands take part in annual anti-US demonstration, in show of defiance before latest bout of US-imposed sanctions.Tehran, Iran - Sporting a blonde wig, red tie and an ill-fitting blue suit, a slightly overweight man took to the stage and began working the small crowd as if in a campaign rally.But this was the wrong rally.As the rotund impersonator was smiling and waving at passing traffic, another man stepped onto the stage to break the news to him: this was Tehran, the Iranian capital, and not some city in the United States.Bemused, the unwitting Donald Trump - in this makeshift Iranian version - let out a scream and ran off stage to the audience's delight.The short sketch about the US president injected a dash of humour to the events unfolding just a few metres away, where thousands of people gathered on Sunday to mark the 39th anniversary of Students' Day.Held every year, the government-backed rally commemorates a seminal moment in the history of the Islamic Republic, when university students supporting Ayatollah Ruhollah Khomeini stormed the gates of the US embassy, took 52 Americans prisoners and sparked a 444-day hostage crisis.The event in 1979 triggered a complete breakdown of Washington's ties with Tehran and ushered in a long period of hostility between the two.This year, commemorations at the old US embassy in the heart of Tehran came just hours before a deadline for the renewal of US sanctions, which were lifted in 2015 as part of a landmark multinational nuclear deal.The pact, which was negotiated for years by diplomats from all parts of the world, is now hanging by a thread following Trump's controversial decision in May to unilaterally withdraw the US from it and reimpose sanctions on Iran.With one Trump signature, the goodwill that had been built between Iranians and the rest of the world crumbled in a matter of months.On Monday, three months after the return of the first wave of US sanctions, Iran is being hit with the second - and most impactful - round of measures which will forbid it from selling oil freely on the international market.Unsurprisingly, the reimposition of the sanctions loomed large over Sunday's rally, where protesters from all walks of life chanted in one voice the familiar anti-US slogan, \"Death to America\".The country's military chief, Major General Mohammad Ali Jafari of Iran's Revolutionary Guard Corps, used his speech at the rally to warn Trump against overreaching when dealing with Tehran.\"I want to say something to America and its weird president,\" Jafari said.\"Never threaten Iran, because we can still hear the horrified cries of your soldiers in the [desert] … and you know it better, how many of your old soldiers in American society commit suicide every day because of depression and fear that they suffered in battlefields.\"So, don't threaten us militarily and don't frighten us with military threats,\" he added.Over the past year, Tehran has accused Trump of waging \"economic warfare\" and devastating its economy.In his speech, Jafari assured the crowd that Trump's attacks on Iran's economy were a desperate attempt to defeat the republic - an attempt doomed to fail.But his optimistic tone stood in stark contrast to the widespread economic chaos Iran has endured during the past 12 months, including a nosedive in the value of its currency, a shake-up of President Hassan Rouhani's economic team - which saw several senior ministers dismissed - and nationwide protests against price hikes and dire economic conditions.Whether Tehran opts to remain committed to the 2015 nuclear deal or not, Iranians are angry and say the next US president may not be able to fix the relationship with their country that Trump has broken.On Sunday, Iranians appeared to set aside criticism of their own government's mishandling of the economy and instead raised their voices in the kind of familiar contempt that has come to define their country's relationship with the US.\"My message to America is that many of their previous presidents before Trump took office and imposed many sanctions, also made many, announced their 'options on the table,' but nothing happened,\" said one young woman who declined to give her name.\"As our supreme leader said, we're seeing signs of America's decline,\" she added, referring to recent comments by Ayatollah Ali Khamenei.Faramarz, a 48-year-old government employee, said there was no chance of the US and Iran ever being friends again.\"It is impossible,\" she said passionately.\"It's like a friendship between a sheep and a wolf. How is it possible to be friends with an enemy who has sworn to destroy your roots and religion and the [Islamic] Revolution? America will finally understand that as long as this arrogance and wild and criminal nature exists, not only Iran but any free country would not welcome it.\"Parveen, a telecommunications engineer in her 50s who lives in the US, said Iran was right to overrun and shut down the \"nest of spies\", a phrase Iranians commonly use to describe the American embassy building.\"Otherwise the revolution would be destroyed and America would have controlled [Iran],\" she said.\"I may disagree with some policies of the [Iranian] establishment but I agree with the foreign policies of the country and I'm proud to be an Iranian.\"Counting the CostWhat is US hoping to achieve by reimposing sanctions on Iran?\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}