{"id": "\n\n\n\nWill the US ban Central American migrants?", "paragraph": "The Stream is a social media community with its own daily TV show.A caravan of thousands of Central American men, women and children is slowly making its way north through Mexico. Trekking hundreds of miles on foot, many of the asylum seekers say their eventual goal is to cross the southern border of the United States. But what type of welcome will they receive once they get there?\nUS President Donald Trump is considering plans to deny asylum and ban the entry of Central American migrants. Additionally, 5,200 US troops will be deployed to provide support to US Border Patrol - a decision that has prompted outrage from rights groups.\nWith the US midterm elections one week away, Trump and other Republicans are portraying the migrant caravan as \"an invasion\" and using the issue to criticise US Democrats' position on immigration.\nThe president's opponents, though, accuse him of whipping up fear to win support for an anti-immigration agenda, pointing out that the caravan is still more than 1,000 kilometres away and that such caravans are not unusual.\nThis latest caravan – which has inspired the formation of new caravans – started in mid-October in Honduras. As word of the Honduran migration spread, people from Nicaragua, Guatemala and El Salvador also joined. Many say they are fleeing poverty and gang violence in their home countries.\nHow should the US respond to Central American caravans, is the issue being exploited for political ends, and what can the people making their way to the US expect from the asylum seeking process? We will ask a panel of experts. On this episode of The Stream, we speak with:\nJohn Holman, @johnholman100\nAl Jazeera Correspondent\nHugo Castro\nHuman Rights Activistborderangels.org\nRaquel Godos, @RaquelGodos\nJouranlist, EFE NewsRead more: \nTrump considering plan to ban entry of migrants at southern border, deny asylum - Washington Post\nHow Republicans are using immigration to scare voters to the polls - Reuters\nLatin American asylum seekers hit US policy “wall” – IRIN News​What do you think? Leave your thoughts in the comments section below.\n  Every Monday through Thursday onAl Jazeera English or this site.What does the killing of a Kosovo Serb politician reveal about the deep fault lines running through the Balkan state?Kosovo, Serbia, PoliticsIraqi artists Dia al-Azzawi and Mahmoud Obaidi discuss the ongoing conflict and destruction in their homeland.Arts & Culture, Iraq, Middle EastWhile working on a kibbutz in 1967, a Japanese journalist discovers the hidden remains of a Palestinian village.Palestine, Al Nakba, JapanWe meet John Nicholson, Trump's top general in Afghanistan, to find out if the conflict can ever be brought to an end.ISIS, Taliban, Afghanistan\n \n\t\t\t© 2018 Al Jazeera Media Network\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t "}