{"id": "Putin: If US delivers missiles to Europe, we will mirror this", "paragraph": "Russian leader vows to respond in kind if US quits INF treaty and deploys intermediate-range missiles in Europe.Russian President Vladimir Putin says Russia will respond in kind if the US withdraws from the Intermediate-range Nuclear Forces Treaty.Putin's warning followed US President Donald Trump's weekend announcement that he intends to opt out of the landmark 1987 nuclear arms control pact - which rid Europe of land-based nuclear missiles - over alleged Russian violations.\"If the United States does withdraw from the INF treaty, the main question is what they will do with these newly available missiles. If they will deliver them to Europe, naturally our response will have to mirror this,\" Putin told reporters in Moscow on Wednesday.Trump said the treaty was ineffective because it does not include China, which has intermediate-range missile capability. Negotiated by then US President Ronald Reagan and Soviet leader Mikhail Gorbachev and ratified by the US Senate, the INF treaty eliminated the medium-range missile arsenals of the world's two biggest nuclear powers and reduced their ability to launch a nuclear strike at short notice.American Cruise and Pershing missiles deployed in Britain and West Germany were removed as a result while the Soviet Union pulled back its SS-20s out of European range.But since 2014, the US has accused Russia of breaching the INF by developing the SSC-8, a land-based, intermediate-range Cruise missile which also has the name of Novator 9M729. On Wednesday, Putin again rejected Trump's claim that Russia breached the INF, saying a collapse of the pact would lead to a new arms race, a situation which he described as \"extremely dangerous\".He alleged it was the US that violated the agreement. If the US were to deploy intermediate-range missiles in Europe, Putin said Russia would have to respond by targeting the countries where the missiles are based.\"The European nations that would agree to that should understand that they would expose their territory to the threat of a possible retaliatory strike. These are obvious things.\"He continued: \"I don't understand why we should put Europe in such a grave danger.\"I see no reason for that ... I would like to repeat that it's not our choice. We don't want it.\"The Russian leader said he hopes to discuss the issue with Trump in Paris on the sidelines of a November 11 event marking 100 years since Armistice Day.European countries see the INF treaty as a pillar of arms control and, while accepting that Moscow is violating it by developing new weapons, are concerned its collapse could lead to a new arms race with possibly a new generation of US nuclear missiles stationed on the continent.Meanwhile, NATO allies are due to meet on Thursday to hear Washington explain the thinking behind Trump's move to quit INF.Earlier on Wednesday, NATO Secretary General Jens Stoltenberg said that the Western military alliance's members blame Russia for developing a new missile in violation of the INF Treaty, but doesn't expect them to beef up nuclear arsenals in Europe in response.\"I don't foresee that allies will deploy more nuclear weapons in Europe as a response to the new Russian missile,\" Stoltenberg told reporters at NATO headquarters in Brussels.Stoltenberg also blamed Russia for alleged breaches of the treaty. \"All allies agree that the United States is in full compliance ... the problem, the threat, the challenge is Russian behaviour,\" Stoltenberg said. \"NATO is in favour of arms control but to be effective, arms control agreements have to be respected by all parties,\" he added.He spoke a day after senior US official John Bolton informed Putin of Washington's plans in Moscow.Bolton said Washington hasn't served a formal withdrawal notice, but he voiced scepticism the treaty could be salvaged.\r\n            SOURCE:\r\n            News agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}