{"id": "Turkey ship to begin drilling for oil, gas in Mediterranean", "paragraph": "The Turkish move is likely to reignite tensions with Cyprus and Greece over jurisdiction on disputed territories.A Turkish ship is heading to its first drilling spot for oil and natural gas in the eastern Mediterranean, according to state media, in a move that is likely to reawaken tensions with neighbouring Cyprus and Greece over jurisdiction.Attempts to tap gas and oil in the region have recently caused friction between Athens and Ankara as well as between the Greek Cypriot-run Republic of Cyprus and the Turkish Republic of Northern Cyprus (TRNC), a self-proclaimed state only recognised by Turkey.Turkey and the internationally recognised Greek Cypriot government have overlapping claims of jurisdiction for offshore oil and gas research in the eastern Mediterranean, a region thought to be rich in natural gas.Speaking at a ceremony for the launch of the drilling ship Fatih on Tuesday, Fatih Donmez, Turkey's energy and natural resources minister, said the first point of drilling has been planned 100km off the southern province of Antalya.\"Turkey has set its main goal as independence in energy,\" Donmez said. \"We don't have an eye on others' resources, our only issue is to present to our people the riches within our territory.\"The first borehole will be some distance from the disputed territory, which lies further south and around Cyprus.Turkey is almost completely reliant on imports to meet its energy needs and the lira's tumble against the dollar this year has driven up that cost, putting pressure on companies to raise prices for consumers.To meet more of its needs domestically, Turkey recently announced a tender for operating rights to three new solar power plants and privatised seven coal fields. It also opened a new refinery to reduce dependence on imported oil products.Donmez also said that Turkey was very close to buying another drilling ship.Last week, Turkey warned Greece to stay out of its activities in the eastern Mediterranean, saying it would not tolerate further Greek harassment of Turkish vessels after complaining that a Greek frigate had hassled a Turkish exploration ship west of Cyprus.Greece, which has a defence protection pact with Cyprus, denied the charge.Earlier this year, Cyprus accused Turkey of threatening to use force against a ship chartered by Italy's Eni to drill for gas in the waters off Cyprus, triggering a diplomatic standoff.The breakaway TRNC says any offshore wealth also belongs to them, as partners in the establishment of the Republic of Cyprus in 1960.Greek Cypriots say any future benefits of gas finds will eventually be shared by all Cypriots.Cyprus has been practically divided since 1974 when Turkey intervened militarily on the island in response to a brief Greek-inspired coup. Ankara said it acted in line with a treaty of guarantee signed in 1960 when the Republic of Cyprus was founded. Countless peacemaking endeavours have failed, and offshore wealth has increasingly complicated peace negotiations even though Greek Cypriots say that matter is not up for discussion.Greece and Turkey have also been in a dispute for decades over the former's maritime borders in the Aegean Sea between the two countries.Talk to Al JazeeraAkinci: Greek Cypriots all talk and no action on reunification\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}