{"id": "Argentina: Wreck of ARA San Juan submarine found after one year", "paragraph": "Navy lost contact with ARA San Juan's 44 crew following an explosion on board in November 2017.The wreckage of an Argentine navy submarine that exploded and disappeared one year ago was located in the Atlantic Ocean on Friday, said the navy, crushing the last hopes for relatives of the 44 crew.There has been \"positive identification of the ARA San Juan,\" at a depth of 800 metres, a statement on Twitter from the navy said.The Seabed Constructor, a vessel owned by US search firm Ocean Infinity, which set out in September on the latest attempt to find the San Juan, made the discovery.The navy lost contact with the submarine on November 15, 2017, about 450km from the Argentine coast. It was on its way back to base from Ushuaia at the southern tip of Argentina.\"I still had hopes that they could be alive,\" Luis Niz, the father of one of the missing sailors, told reporters, even though the government of President Mauricio Macri had earlier declared that there were no survivors from the San Juan.\"We are with the other relatives. They are going to show us the photos. They say that our youngsters are inside,\" said Yolanda Mendiola, the mother of crewman Leandro Cisneros, 28.\"We are all destroyed here.\" The navy has been fiercely criticised for its handling of the operation since first reporting the submarine overdue at Mar del Plata on November 16, 2017. It was only several days into the tragedy that navy officials acknowledged the old, German-built submarine had reported a problem with its batteries in its final communication of November 15. Nearly 10 days later, the navy confirmed there had been an explosion on board, which experts said was likely linked to the battery problem.Several senior officers were dismissed, including navy chief Marcelo Srur.An air and sea search involved units from 13 countries but the majority withdrew before the end of 2017.The Seabed Constructor is equipped with cameras that can be submerged to a depth of 6,000m. It was to receive a reward of $7.5m if it found the missing sub.Before it departed for its mission, Luis Tagliapietra, whose son Alejandro was a lieutenant on the San Juan, described it as \"the last opportunity to find them\".Ocean Infinity was also assigned the task of searching for the Malaysia Airlines flight MH370 which vanished without trace in March 2014 en route from Kuala Lumpur to Beijing.Authorities have opened a criminal investigation into the San Juan's disappearance. The judge heading the case has so far heard testimony from 70 people but says she is no closer to knowing what happened.Families of the missing crew had kept up pressure on the government not to give up on the search.Several grieving mothers of the missing have turned up every morning in protest at the submarine's home base in Mar del Plata.The submarine disappeared on the edge of the Argentine shelf where depths plummet from 200m to more than 3,000m.Experts say the sub would have been crushed by water pressure once it dropped below about 600 metres.\r\n            SOURCE:\r\n            AFP news agency\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}