{"id": "Indonesia to inspect all Boeing 737 MAX jets after Lion Air crash", "paragraph": "Lion Air currently operates 10 737-MAX jets in its fleet while national carrier Garuda has one.The Indonesian government has ordered the inspection of all Boeing 737-MAX airliners as rescue teams recovered more victims from a brand new jet that plunged into the sea with 189 people on board.The Lion Air plane, which went into service just a few months ago, plunged into the Java Sea on Monday just minutes after taking off from the capital, Jakarta.Indonesian Transport Minister Budi Karya announced on Tuesday that both Lion Air - the country's biggest budget airline - and Garuda - the national carrier - have been ordered to inspect all their Boeing 737-MAX aircraft. Lion Air currently has 10 737-MAXs in its fleet while Garuda has one.Budi, who stopped short of grounding all new models, said the results of the inspections will be handed over to Indonesia's transport safety agency to help with the investigation into the crash of Flight JT610.The accident has resurrected concerns about Indonesia's patchy air safety record which led to a now-lifted ban on its planes entering US and European airspace.Authorities are trying to pinpoint the smashed jet's location and flight data recorders, which are expected to be crucial to the crash investigation.Indonesia's search and rescue agency said it was prioritising finding the main wreckage using sonar metal detectors, and all but ruled out finding any survivors from the high-impact crash in water some 30 to 40 metres deep.Meanwhile, scores of relatives on Tuesday thronged a hospital building being used for victim identification in Jakarta.\"My daughter has no husband, my grandchild no longer has a father,\" a grieving Hari Setiyono told AFP at the police hospital, referring to his missing son-in-law.The single-aisle plane was en route to Pangkal Pinang city, a jumping-off point for beach and sun-seeking tourists on nearby Belitung island, when it dropped out of contact around 6:30am on Monday (23:30 GMT on Sunday). The pilot and co-pilot had more than 11,000 hours flying time between them and had undergone recent medical checkups and drug testing, the carrier said.Aviation experts said it was too early to determine what caused the accident.But investigators will look at everything from catastrophic mechanical failure and pilot error to weather conditions or unusual cockpit activity that could point to a hijacking or pilot suicide, they said.\"Locating the so-called black boxes is most important now,\" Terence Fan, an aviation expert at the Singapore Management University, told AFP.\"That should show how the aircraft and pilots actually behaved,\" Fan said.Data from that flight suggested the plane may have flown erratically and a technical log circulating on social media pointed to different speed and altitude readings on the captain and first officer's instruments.On Monday, Lion Air acknowledged the plane had an unspecified technical issue fixed in Bali before it was flown back to Jakarta, calling it \"normal procedure\". The company announced earlier this year it was buying 50 Boeing 737-MAX 10 jets for $6.24bn.In 2017, Boeing suspended the release of the fuel-efficient 737 MAX just days before its first commercial delivery due to an issue with the engines.In a statement, Boeing said it is providing \"technical assistance\" to the investigators of the accident.\"We extend our heartfelt sympathies to the families and loved ones of those on board,\" the statement read. In 2014, an AirAsia crash in the Java Sea during stormy weather killed 162 people.Lion has been involved in a number of incidents, including a fatal 2004 crash and a collision between two of its planes at Jakarta's Soekarno-Hatta airport.\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}