{"id": "Sri Lankan president orders Parliament to reconvene November 14", "paragraph": "Sacked Sri Lankan leader's party denounces November 14 as 'too late' to resolve protracted crisis over rival PMs. Colombo, Sri Lanka - Sri Lanka's President Maithripala Sirisena has ordered parliament to reconvene in 10 days, drawing sharp criticism from the party of the country's sacked prime minister which decried it as \"too late\".The announcement on Sunday came amid mounting pressure to let legislators hold a vote in order to resolve a protracted political crisis over two rival prime ministers.Sirisena had suspended parliamentary proceedings until November 16 after abruptly firing Prime Minister Ranil Wickremesinghe last week and replacing him with Mahinda Rajapaksa, a controversial former president.The parliament will now meet on November 14 at 10am local time (04:30 GMT), according to an official gazette notification.Mangala Samaraweera, a member of Wickremesinghe's United National Party (UNP), condemned Sirisena's decision to recall parliament two days prior to the initial suspension order, saying it was \"an eyewash to appease the ever increasing\" international and local pressure.The United Nations and many Western countries had urged Sirisena to summon the House immediately, after Wickremesinghe called his October 26 sacking \"unconstitutional\" and refused to step down.The deposed leader has demanded a vote to prove his majority. But in recent days, a steady stream of defections has eroded his narrow majority in the 225-member House.At least eight legislators from the UNP and a member of an opposition party have now crossed over to the Sirisena and Rajapaksa-led United People's Freedom Alliance (UPFA), which had the backing of 96 legislators prior to the crisis.Nearly all politicians who left the UNP took up ministerial posts in the new cabinet.The stream of defections, as well as the delayed summoning of parliament, has worried Wickremesinghe's supporters and some observers that resuming sessions and holding a vote would only legitimise the former president's return to power.Gayantha Karunatilleke, a UNP member, said the date for parliament recall was \"too late\".\"What's the point convening parliament two days before November 16? We want the president to reconvene parliament immediately,\" he said, urging Speaker Karu Jayasuriya to defy the president and summon parliament \"in the next few days\". Dharisha Bastians, a former editor at the Colombo-based Sunday Observer magazine, said Sirisena was \"mocking parliament\" by recalling the House just two days before the date set in the initial notice.The move would only bring \"12 more days of bargaining and defections\", she said in a Twitter post, and would allow the UPFA to obtain \"post facto legitimacy after an illegal power grab\".Sirisena insists Rajapaksa's appointment was in line with the constitution.Alan Keenan, researcher at International Crisis Group, called for international action, saying the US, India and other concerned governments must \"make it clear now that Rajapaksa's ratification by parliament in the current context will not be enough to make his premiership legitimate\".On Friday, the UNP submitted a no-confidence motion against Rajapaksa after the UPFA said it would not hold a vote to test the former president's support even when the legislature reconvened.The UNP said the petition has the backing of 118 parliamentarians - five more than the majority of 113 required to vote out a prime minister.But Dayasiri Jayasekara, a UPFA legislator and minister in Rajapaksa's cabinet, said the alliance is \"confident\" that it \"can get the majority in parliament\".The coalition is scheduled to hold a mass rally on Monday. It hopes to mobilise more than a 100,000 people in front of the parliament house in the capital, Colombo.\"Everyone is super confident and tomorrow you will see how confident the party is when a crowd at least five times larger than the UNP rally in Colombo,\" said Jayasekara, referring to the crowd of tens of thousands of people who attended a UNP rally last week.Meanwhile, hundreds of people rallied in Colombo earlier on Sunday, calling Sirisena's actions \"an attack on democracy\" and protesting against allegations that legislators were being offered millions of dollars to switch support amid the intensified horse-trading between political parties.Activists gathered under an overcast sky in central Colombo, carrying placards that read, \"Do not trade off democracy\" and \"Don't sell my vote\".A group of women from the country's ethnic Tamil minority, who accuse Rajapaksa of grave human rights abuses against members of their community during the final phase of a decades-long civil war in 2009, chanted: \"We are scared to speak. We are scared to protest … You have taken our rights! Don't kill democracy!\"The Tamil National Alliance, a coalition of parties representing the Tamils, vowed on Sunday that its 15 members would back the no-confidence motion against Rajapaksa.  \"Our democracy is being stolen in broad daylight,\" activist Shreen Saroor said. \"The president has betrayed the people and members of parliament must not take money and cross over, because it is our vote they are trading now.\"The UPFA has denied the allegations of bribery.\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}