{"id": "'They said leave or else': Why a Honduran family is fleeing to US", "paragraph": "Many Hondurans on the Central American exodus to the United States are fleeing violence and political persecution. Tijuana, Mexico - It was the day of the 2017 general elections in Honduras when unknown men approached Obedi Miranda and her husband, Allan Escobar, two opposition Libre party activists.\"They told us to leave, or else,\" Miranda said this week, sitting on a couch in a corner of a migrant and refugee shelter after just arriving in Tijuana.She and Escobar, along with their two-year-old son, are more than 4,000km from their home in Trinidad, in the Copan department of Honduras.The family fled the town the day they had received the death threats, first to another part of Honduras, then to southern Mexico, and finally to Tijuana after joining an exodus of migrants and refugees headed to the US border in hopes of applying for asylum.Miranda, Escobar and their son are three of the more than 2,000 migrants and refugees who arrived in the Mexican border town this week as part of what is now being called the Central American exodus. Thousands more are heading north in subsequent waves to join them, and other groups forming in El Salvador and Honduras plan to follow behind.The story of each migrant and refugee in the collective exodus is different, but overall, the reasons for leaving are generally the same. Many are fleeing poverty, unemployment, gang violence or political persecution. Often, it is for multiple reasons. Miranda and Escobar fled for safety, from the threat of politically motivated violence in a country where killings of activists are all too common.Miranda got involved in politics after the 2009 coup d'etat, when the Honduran military ousted elected President Manuel Zelaya, forcibly removing him from his home and flying him out of the country. The coup sparked months of protests and marches around the country, and tens of thousands of Hondurans who had never before participated in social movements joined in. Miranda and Escobar were among them.Other civilian politicians from the Liberal Party, not the military, took over the presidency. It was not long before the United States and Canada recognised the new government, prompting a normalisation of international relations, even as massive protests and repression continued in the streets.Within a year the country held the country held an election, which many considered illegitimate, and the National Party took over, leading to widespread repression and heightened violence.The Libre party grew out of opposition to the coup.In the years the followed, Miranda and Escobar said they participated in the Libre party in the municipality, eventually becoming more well known in the region. In the November 2017 election, Escobar became Libre's alternate to Copan department congressional candidate Juan Carlos Ruiz.The campaign was an uphill battle in a department dominated by the ruling party. Due to the threat, the couple immediately left their hometown without sticking around for the election results.After the general election, things only got worse.The November 2017 presidential election between President Juan Orlando Hernandez of the National Party and Salvador Nasralla of an opposition alliance was already marred in controversy before campaigning really got started. A Supreme Court ruling permitted Hernandez to run for a second term despite a constitutional ban on presidential reelection.During the election, Nasralla had a five-point lead when the preliminary results were first announced. The elections data transmission system then went down for hours, and when it came back online, Hernandez was in the lead, prompting months of street protests and highway blockades.The government instituted a crackdown on the protesters with tear gas and live ammunition. Hundreds were arrested and rights groups documented at least 30 deaths, which they reported occurred mostly at the hands of the military police.Calls for total recounts and new elections lost momentum after the US government recognised Hernandez as the winner in late December. But the protests and government crackdown continued, prompting Miranda and Escobar, along with their son, to leave Honduras altogether and head to Mexico.Roughly half of the dozens of Hondurans with whom Al Jazeera has spoken over the past month along their journeys through Guatemala and Mexico, including those simply fleeing poverty not violence, have cited the re-election of Hernandez and ensuing crisis as a motivating factor behind their decisions to leave Honduras this year.For those, including Miranda and Escobar, who have made it to Tijuana, the next phase of their journey has just started. There was confusion and fear at the downtown shelter where Miranda and Escobar stayed on Thursday. The shelter was full, rumours of detentions were circulating, and people did not know whom they could trust or where they would sleep.\"There is a collective hysteria,\" Escobar said. A woman nearby nodded in agreement.A group of anti-migrant protesters also confronted newly-arrived migrants and refugees nearby on Wednesday, adopting the same language used by President Donald Trump, who has falsely called the collective exodus an \"invasion\".On Friday, local Tijuana government officials announced that they were expecting some 10,000 migrants and refugees to arrive and that the situation would last for months. The federal government has not yet provided financial assistance to continue to shelter the Central Americans at a local sports complex, local officials said. Meanwhile, the migrants and refugees must now begin to navigate the long and seemingly complicated process of applying for asylum at the the US border.Miranda, Escobar and their son are prepared to wait in Tijuana for as it long as it takes. On Friday morning, the family signed up on the waiting list. It will be three weeks until the family can claim asylum in the US, they were told.\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}