{"id": "Saudi cleric's son: 'Everyone is threatened'", "paragraph": "Most Searched17 Nov 2018 12:20 GMT Saudi Arabia, Mohammed bin Salman, Jamal Khashoggi, Middle East, Human RightsSoon after Mohammed bin Salman, also known as MBS, was appointed Saudi crown prince in 2017, prominent Muslim leader Sheikh Salman al-Awdah was arrested, allegedly for his refusal to tweet in support of the Saudi-led blockade of Qatar.In September 2018, prosecutors applied for him to be sentenced to death.UpFront speaks with Awdah's son, Abdullah Alaoudh, who is based in the United States and is a Senior Fellow at Georgetown University.\"The charges [against Salman al-Awdah] actually represent how the state would crack down on any different view and, on any person who disagrees,\" says Alaoudh.\"The same 'rogue operation' is going on for dissidents abroad, for those who disagree at home, for journalists, economists - public figures in general.\"Asked whether he thinks Saudi would really execute one of its top Muslim scholars, Alaoudh refers to the Khashoggi murder and says \"it's a pattern. It did not start with my father; it did not start with Jamal Khashoggi. It's a pattern that we have seen through the past one-and-a-half years since the crown prince came to power. They did everything in their power to silence others, to crack down on dissent.\"Saudi Arabia is now seeking the death penalty for five people accused of the gruesome murder of journalist Khashoggi.\"At some point I thought it's very difficult for the state ... to reach dissidents abroad,\" says Alaoudh. \"But now, after what happened to Jamal Khashoggi the message the state sent is that everyone is threatened, ' we can reach everyone everywhere'.\" Follow UpFront on Twitter @AJUpFront and Facebook.Source: Al Jazeera NewsScholar, 61, charged with 37 counts, including incitement against the ruler and spreading discord, his family says.Saudi Arabia, Islam, Middle EastWe talk to the son of cleric Salman al-Awdah and debate the danger of social media with tech pioneer Jaron Lanier.Saudi Arabia, Human Rights, Jamal Khashoggi, Mohammed bin Salman, Social media\r\n      Commenting has been disabled. To find out more, click      \r\n      here.\r\n     The Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nInteractive, Philippines, EnvironmentRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.Europe, Russia, Saudi ArabiaFrom Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.Environment, Native Americans, US & CanadaAnswer as many correct questions as you can and see where your country ranks in the global cost of living.InteractiveScholar, 61, charged with 37 counts, including incitement against the ruler and spreading discord, his family says.Saudi Arabia, Islam, Middle EastWe talk to the son of cleric Salman al-Awdah and debate the danger of social media with tech pioneer Jaron Lanier.Saudi Arabia, Human Rights, Jamal Khashoggi, Mohammed bin Salman, Social mediaStatement comes after US media reports say CIA has concluded Saudi crown prince ordered Khashoggi's murder.Jamal Khashoggi, Middle East, Saudi Arabia, Turkey, Journalism Is Not A CrimeThousands of people blocked roads across France during 'yellow vest' demonstrations against the rising price of fuel.France, Business & Economy, Emmanuel Macron, EuropeMeet the hardline group willing to do anything, including going against their government, to claim land for Israel. Israel, Occupied West Bank, Middle EastMoroccan dissident Abraham Serfaty was jailed, tortured and exiled for his radical views over decades.History, Morocco, Human RightsAn insight into the Trump administration's relationship with the religious right and implications for US politics.Religion, Donald Trump, US Midterms 2018In an age of non-stop news feeds and disposable media, which stories and images stay with us and how do they shape us?Journalism, Humanitarian crises, Media\n \n\t\t\t© 2018 Al Jazeera Media Network\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t "}