{"id": "US: Voter suppression claims at centre of Georgia governor race", "paragraph": "On Tuesday night, Democratic gubernatorial hopeful accused her opponent, Brian Kemp, of voter suppression during debate.If Georgia Democrat Stacey Abrams can best her Republican opponent, Brian Kemp, in midterm elections on November 6, she will become the first female African American governor in US history.With less than two weeks until Election Day, the two are currently neck and neck in the polls. An Opinion Savvy survey published earlier this week had Abrams and Kemp tied at 48 percent.But the 44-year-old state representative's chances of outperforming Kemp could partially hinge on the fate of an estimated 53,000 voter applications currently being held up by the very office Kemp currently holds, Georgia Secretary of State.Earlier this month, the Associated Press revealed that the applications are on hold for verification by Kemp's office, noting that the majority of them are for African Americans.Prompting accusations of racial bias and voter suppression, the AP report led civil rights organisations to sue the state in a federal court.On Tuesday, Abrams and Kemp butted heads in a combative debate in Atlanta, with the latter dismissing the accusations as a \"farce\".Kemp, who has held office for eight years, defended himself by arguing that any voters with pending applications could cast their ballot as long as they show up with a form of identification on Election Day.\"This farce about voter suppression and people being held up from being on the rolls … is absolutely not true,\" he said during the debate.Claiming that former President Barack Obama's administration approved an \"exact match\" of the verification process in 2010, Kemp added, \"If you want to blame somebody, blame President Obama.\"But Abrams, who in the past has called for Kemp to step down, pushed back. \"Voter suppression is not simply about being told no, it's about being told it's going to be harder for you to vote,\" she said, adding: \"If even five Georgians are being denied the right to vote or are afraid of the right to vote, then we are not doing our jobs.\"Earlier this month, Kemp accused Abrams of inflating the voter applications issue to distract from her \"extreme record\" as a state legislator. \"She uses fear to fundraise and liberal billionaires continue to bankroll her corrupt enterprise,\" he tweeted.The 53,000 Georgians on our pending list can vote this fall. Abrams is afraid to run on her extreme record so she manufactures outrage off a \"problem\" she created. She uses fear to fundraise and liberal billionaires continue to bankroll her corrupt enterprise. #gapol #gagop pic.twitter.com/UQpdurabG5On Tuesday, Rolling Stone published a leaked audio recording in which Kemp expressed dismay over the Abrams campaign's efforts to drum up voter turnout. He said that the effort \"continues to concern us, especially if everybody uses and exercises their right to vote\".But according to the Brennan Center for Justice, the number of voters \"purged\" skyrocketed under Kemp, who took office in 2010.Between the 2012 and 2016 elections, more than 1.5 million voters were purged, nearly twice as many as the between the 2008 and 2012 elections, the group said in a report.Last year, Kemp settled a lawsuit with civil rights organisations over voting rights. The suit included allegations that the voter registration system was discriminatory, citing the cancellation of around 34,000 people's registration status between 2010 and 2013.Separately on Wednesday, a federal district court judge ruled that the state's elections officials must stop rejecting absentee ballots and absentee ballot applications due to a mismatched signature without first giving voters the opportunity to fix the issue. The ruling came as a result of two lawsuits. Georgia's current governor, Republican Nathan Deal, has since 2011 served two consecutive four-year terms, the maximum allowed under law.During the upcoming midterm elections, voters will decide 39 state and territorial governorships, all 435 seats in the House of Representatives and 35 of the 100 seats in Senate, among others.Georgia has never had a female governor or an African American governor.During the 2016 presidential elections, Donald Trump won Georgia, gaining 50.4 percent of the vote as compared with Hillary Clinton's 45.3 percent.\r\n            SOURCE:\r\n            Al Jazeera News\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}