{"id": "China and US clash on trade at heated APEC summit", "paragraph": "China's President Xi slams protectionism, as US VP Pence says Washington could double tariffs on Chinese goods.Chinese President Xi Jinping has warned that economic protectionism is overshadowing global growth and urged countries to pursue free trade policies.\"One who chooses to close his door will only cut himself off from the rest of the world and lose his direction,\" Xi told a summit of Asia Pacific Economic Cooperation (APEC) chief executives on Saturday.Xi urged the world to \"say no to protectionism and unilateralism\", warning it was a \"short-sighted approach\" that was \"doomed to failure\".Speaking after Xi, US Vice President Mike Pence told the summit that Washington will not change its approach until Beijing changes its own trade policies.He also warned that the US could double the tariffs already imposed on Chinese goods.\"We have taken decisive action to address our imbalance with China,\" he said. \"We put tariffs on $250bn in Chinese goods, and we could more than double that number.\"\"The US will not change course until China changes its ways.\"The two countries have been involved in an escalating trade war this year, imposing tariffs on hundreds of billions of dollars' worth of goods, and have said that the tariffs could be increased.Experts have warned that the tit-for-tat trade war could seriously harm the global economy.The APEC summit in Papua New Guinea of leaders from 21 countries across the region has developed into a tussle for influence between an increasingly assertive China and a more withdrawn US.Saturday's summit of CEOs is the precursor to the official leaders' meeting, which will take place on Sunday.Xi criticised \"America First\" trade protectionism and stressed that global trade rules should not be applied \"with double standards or selfish agendas.\"In a rebuke to China, Pence met with the representative from Taiwan, a self-governing island which China considers to be part of its own territory.He also announced the US would join with Australia in the development of a new naval base.Pence also mocked China's Belt-and-Road initiative, under which China offers loans to poorer countries in the region to improve infrastructure.He said the terms of China's loans were \"opaque at best\" and \"too often, they come with strings attached and lead to staggering debt.\"\"Do not accept foreign debt that could compromise your sovereignty,\" he said.\"We don't drown our partners in a sea of debt… We don't coerce, corrupt, or compromise your independence. The United States deals openly and fairly.\"In his own address, Xi defended the policy, saying there was no \"hidden political agenda…nor is it a trap as some people have labelled it.\"He also warned that no one would gain from the tensions between Beijing and Washington.\"History has shown that confrontation – whether in the form of a cold war, hot war or trade war – will produce no winners,\" he said.Pence also said that The US wanted a \"better relationship\" with China, if it respects its neighbours' sovereignty, embraced \"free, fair and reciprocal trade\" and its human rights record.Reporting from the Papua New Guinean capital Port Moresby, Al Jazeera's Andrew Thomas said the Saturday speeches set a competitive rather than a cooperative tone for the summit.\"[Pence and Xi] represent the two biggest economies that are part of the APEC group,\" he said. \"Mike Pence used his speech to take a lot of digs at China, particularly the way that China goes around making loans… President Xi was all about [US President] Donald Trump's tariffs. Trump might not be here but his policies are certainly being talked about.\"Thomas added that the fringe events at the summit provided more insight into the wider geopolitical aims of the participants, with China looking to boost support for its position on Taiwan.\"It is the bilateral meetings, the sideline meetings that perhaps tell us more about what's going on here,\" Thomas said. \"President Xi on Friday night hosted a reception for Pacific island leaders, particularly those he invests heavily in, in terms of aid and investment projects, but also, interestingly, only those Pacific island countries that recognise China and not Taiwan.\"Meanwhile, across town, Taiwan hosted its own event for the smaller number of countries that recognise it.\"So, just [as] with aid and investment, food and drinks receptions come with strings attached. If you want them from China's President then you better recognise China and not Taiwan…It's that geopolitical context that's on show here, as much as it's about the official talks.\"Trump is set to meet Xi at the G20 summit in Argentina next month.\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}