{"id": "Saudi energy minister calls for one million bpd oil output cut", "paragraph": "Khalid al-Falih's comments come a day after unveiling Riyadh's plan to slash production by 500,000 barrels per day.\r\nSaudi Arabia's energy minister has called for a global output cut of one million barrels per day (bpd) to re-balance the market, a day after Riyadh unveiled plans to cut production by 500,000 bpd from December.\"The technical analysis we reviewed yesterday shows that we need a reduction approaching one million bpd to balance the market,\" Khalid al-Falih told an energy conference in Abu Dhabi on Monday.The proposed reduction is from October production levels, al-Falih said, cautioning that further study was needed before final decisions were made.\"There are a lot of assumptions in their projections that may change,\" al-Falih said. \"We don't want to throttle the global economy. \"Russia, another major producer, struck a more measured tone, however, saying it preferred a wait-and-see approach.\"I would not want to focus purely on production cuts,\" Russian Energy Minister Alexander Novak told Bloomberg on Monday.\"This is not the ultimate goal, to cut or not to cut,\" he added.\"I think we would have to wait and see how the market is unfolding because our ultimate goal is market stability.\"Oil prices have shed a fifth of their value over the past month due to oversupply and signs of a softer-than-expected impact from sanctions on Iranian crude exports.But they climbed on Monday as Saudi Arabia, the world's largest oil supplier, announced the plans to cut production in response to fears of oversupply.The 15 members of the Organisation of Petroleum Exporting Countries (OPEC), which include Saudi Arabia, alone pump over a third of global crude supply.Any official decision on global output cuts will be made at a key ministerial meeting for OPEC and non-OPEC producers in Vienna in early December, al-Falih said.Oil producers will continue to evaluate the market data prior to the Vienna summit, \"but if we need to trim production by one million bpd, we will do,\" he added.Suhail al-Mazrouei, the UAE's energy minister, said balancing the market would \"require changes in the strategy\" of producers.\"We need not overreact\" to falling prices, Mazrouei said, adding that crude was a dynamic market.Assem Jihad, Iraqi energy minister spokesperson, told the AFP news agency his country, also an OPEC member, was hoping for \"any decision that would help balance and stabilise the market\".Brent crude dropped below $70 a barrel on Friday for the first time since April but it was trading above $71 a barrel on Monday.West Texas Intermediate crude also dropped to a nine-month low, below $60 a barrel. It was trading above $61 on Monday.Al-Falih's comments followed a meeting in Abu Dhabi at the weekend, where major producers started laying the groundwork to cut supply in 2019, reversing an almost year-long expansion.The group, including Russia and Saudi Arabia, warned that crude supply would outstrip demand next year.In a final statement, they said they had \"reviewed current oil supply and demand fundamentals and noted that 2019 prospects point to higher supply growth than global requirements\".That in mind, they vowed to consider \"options on new 2019 production adjustments, which may require new strategies to balance the market\".Al-Falih on Monday said inventories had been building up, adding that \"the 25 producers will not allow this to continue\" and that they had signalled they would do \"whatever it takes to balance the market\".\"We are going to do everything we can to keep inventories and supply-demand fundamentals within a reasonably narrow band around balance,\" he said.\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}