{"id": "Trump signs bipartisan legislation to combat US opioid crisis ", "paragraph": "Legislation is geared to expanding access to drug addiction treatment and crack down on illicit drug shipments. Medical treatment will become more widely available to opioid users while mailing illicit drugs will be more difficult under a measure to fight drug addiction that was signed into law by US President Donald Trump on Wednesday. The bipartisan measure is aimed at tackling the nation's addiction crisis, which led to a record 72,000 drug overdose deaths in 2017. Of that, opioids were responsible for 49,000.The number of overdose deaths in 2017 marked a seven percent increase compared to 2016. In a year more typically marked by partisan gridlock, Trump signed the sweeping opioids package passed by Congress earlier this month. The legislation expands access to substance abuse treatment in Medicaid, the government health insurance programme for the poor and disabled.It also cracks down on mailed shipments of illicit drugs such as fentanyl, a synthetic opioid far more powerful than heroin, and provides a host of new federal grants to address the crisis.\"Everybody agrees we must and will do more,\" Trump adviser Kellyanne Conway said.Trump declared the opioid epidemic a public health emergency last year, enabling the government to respond more quickly to crises. But addiction experts, advocacy groups and Democrats said the administration was not doing enough.On Tuesday, Democratic Senators Elizabeth Warren and Patty Murray released a US Government Accountability Office report that they said showed Trump's emergency declaration fell short of his promises.The report said the government has used few of the powers it could use under the declaration.\"Hand waving about faster paperwork and speeding up a few grants is not enough. The Trump Administration needs to do far more to stop the opioid epidemic,\" Warren said in a statement.Conway said the criticism from the senators was \"predictable and unfortunately very partisan\", noting that both political parties voted for the opioids legislation.In addition to educating the public and expanding access to treatment, Conway said the administration was also focused on securing the border with Mexico to stop drugs from coming into the US. \"This is part of the president's call to secure the border as well because, in addition to the people coming through, he often talks about the drugs and poison coming through,\" Conway said.In a speech on Tuesday at a Milken Institute health summit, Alex Azar, secretary of the US Department of Health and Human Services, said that early data suggests that the number of deaths is starting to level off. \"We are so far from the end of the epidemic, but we are perhaps, at the end of the beginning,\" he said, pointing to newly-released statistics from the Centers for Disease Control.That data suggests that the rate of overdose deaths started to decrease towards the end of 2017.  \"Simply put, America has prescribed, and still prescribes, a stunning amount of potentially addictive pain medications,\" Azar said. \r\n            SOURCE:\r\n            News agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}