{"id": "Judge tells all sides of Florida recount to 'ramp down rhetoric'", "paragraph": "Trump accuses Democrats of trying to 'steal' election without evidence, amid tight races for governor and Senate.State judge Jack Tuter on Monday told lawyers representing the warring sides in the Florida recount that they need to \"ramp down the rhetoric\" after Republicans, including President Donald Trump, alleged illegal activity. A vote recount is under way in the state's governor and US Senate races after results showed a narrow difference between the Republican and Democratic candidates. The state's law enforcement arm and elections monitors have found no evidence of wrongdoing, but lawyers for the Republican party and its candidates joined with Trump in alleging that irregularities, unethical behaviour and fraud have taken place since the polls closed last week.\"An honest vote count is no longer possible\" in Florida, Trump declared Monday, without providing evidence. The comments came just hours before Tuter held an emergency hearing on a request by lawyers for Republican Governor Rick Scott, whose lead in the Senate race over incumbent Democrat Bill Nelson has narrowed with the counting of provisional and other ballots.The lawyers allege Broward County Supervisor of Elections Brenda Snipes, a Democrat who was appointed in 2003 by then-Republican governor Jeb Bush, of engaging in \"suspect and unlawful vote counting practices\" that violate state law and that she might \"destroy evidence of any errors, accidents or unlawful conduct\". The motion was supported by lawyers representing the state Republican Party and opposed by Snipes's office, Nelson's campaign and the state Democratic Party. Snipes denies the allegations. The lawyers asked for additional sheriff's deputies to be sent to Snipes's office to monitor ballots and voting machines. The lawyers requested that the deputies be present when the ballots and voting machines are not being used and until the recount is over.Tuter said: \"If someone in this lawsuit or someone in this county has evidence of voter fraud or irregularities at the supervisor's office, they should report it to their local law enforcement officer.\"He added: \"If the lawyers are aware of it, they should swear out an affidavit, but everything the lawyers are saying out there in front of the elections office is being beamed all over the country. We need to be careful of what we say. Words mean things these days.\"After Tuter told all sides to meet to discuss a compromise, they agreed to add three deputies to the elections office in Broward.The state is the scene of a bitter struggle between Republican and Democrat politicians over the results of the Senate and governor races during last week's midterm elections.Republican candidates saw their leads whittled down after election night as ballots from urban areas, which lean Democrat, were counted. Margins fell to within the levels needed to force recounts in both the governor race, between Republican Ron DeSantis and Democrat Andrew Gillum, and the Senate race between current Republican governor Rick Scott and Democrat incumbent, Bill Nelson.Authorities ordered machine recounts of the votes this weekend, with a Thursday deadline to finish the recount. The Republicans, backed by Trump, have openly accused the Democrats of trying to \"steal\" the election despite presenting no evidence to support the claim.The Democrats want to ensure that all votes are counted, and to that end, Nelson is suing the Florida Department of State in a bid to count ballots that were postmarked before election day but were not delivered before polls closed.Nelson's lawyer, Marc Elias, filed the lawsuit Monday, saying voters should not be disenfranchised because of mail delivery delays that aren't their fault. Unofficial election results show Nelson trailing Republican Scott by 0.14 percentage points, which amounts to around 12,500 votes.In the race for governor, former US Representative Ron DeSantis led his Democrat rival and Tallahassee Mayor Andrew Gillum by a margin of 0.41 percent.The two contests, along with those for governor in Georgia and for the Senate in Arizona, are the most high-profile races still undecided after Tuesday's midterm elections.Florida is the country's third-largest state in terms of population. It is also an important \"swing state\" in the US, especially in presidential elections.The Sunshine State has never been a sure constituency for either the Republicans or the Democrats, resulting in presidential candidates spending considerable time campaigning here.The move conjured up memories of Florida's 2000 presidential recount when the winner hung in the balance for weeks before the Supreme Court stopped the count and Republican George W Bush triumphed over Democrat Al Gore. \r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}