{"id": "Could swing voters sway the crucial US midterm elections? ", "paragraph": "Most SearchedInside Story04 Nov 2018 19:55 GMT United States, Donald Trump, US Midterms 2018It is the final stretch of the all-important US midterm elections. Enthusiasm is high and voter turnout could reach record numbers.So far, in early voting, more than 30 million Americans have cast their ballots. But it is one group of swing voters that is expected to play a crucial role, and that is female voters, particularly white women.Many are outraged by the antics of President Donald Trump and his approach towards women.Last month, that anger turned into rage - after the nomination of Supreme Court Justice Brett Kavanaugh - who is accused of sexual assault by several women.Now, with all 435 seats in the House of Representatives and 35 of the 100 Senate seats up for grabs, the midterms will certainly shape the final two years of Trump's first term in office.So, what will be the role of swing voters - especially women - in this election?Presenter: Richelle CareyGuests:Ashley Pratte - Board member of Republican Women for Progress.Kira Lerner - Political reporter with ThinkProgress covering voting and election rights.Scott Lucas - Professor of political science and American Studies at the University of Birmingham. Source: Al Jazeera News\r\n      Commenting has been disabled. To find out more, click      \r\n      here.\r\n     The Philippines’ Typhoon Haiyan was the strongest storm ever to make landfall. Five years on, we revisit this story.\r\n\r\nInteractive, Philippines, EnvironmentRussian-Saudi relations could be very different today, if Stalin hadn't killed the Soviet ambassador to Saudi Arabia.Europe, Russia, Saudi ArabiaFrom Qatar to Alaska, a personal journey exploring what it means to belong when your culture is endangered.Environment, Native Americans, US & CanadaAnswer as many correct questions as you can and see where your country ranks in the global cost of living.InteractiveStatement comes after US media reports say CIA has concluded Saudi crown prince ordered Khashoggi's murder.Jamal Khashoggi, Middle East, Saudi Arabia, Turkey, Journalism Is Not A CrimeThousands of people blocked roads across France during 'yellow vest' demonstrations against the rising price of fuel.France, Business & Economy, Emmanuel Macron, EuropeMeet the hardline group willing to do anything, including going against their government, to claim land for Israel. Israel, Occupied West Bank, Middle EastMoroccan dissident Abraham Serfaty was jailed, tortured and exiled for his radical views over decades.History, Morocco, Human RightsAn insight into the Trump administration's relationship with the religious right and implications for US politics.Religion, Donald Trump, US Midterms 2018In an age of non-stop news feeds and disposable media, which stories and images stay with us and how do they shape us?Journalism, Humanitarian crises, Media\n \n\t\t\t© 2018 Al Jazeera Media Network\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t "}