{"id": "Deadly air attack hits vegetable market in Hodeidah", "paragraph": "Locals and medical workers say at least 10 were killed in attack on a group of farmers. At least 10 people were killed in an air raid that struck a group of farmers in a vegetable market in Yemen's Hodeidah province, medical workers and residents said.The Saudi-UAE alliance, which has carried out hundreds of air attacks in the country, said it was investigating the incident.At least nine others were killed in the attack in Bayt al-Faqih, around 70km south of the city of Hodeidah, according to medical sources, while Houthi sources put the number of dead at 19 with 10 others wounded.Al Jazeera could not immediately verify the number of casualties, which were reported by Reuters.In June, forces loyal to Yemen's government, alongside Saudi and Emirati forces, launched an offensive to take the city of Hodeidah from Houthi rebels, but have struggled to make significant gains.The port of Hodeidah is the main gateway for commercial imports and relief supplies into the country, and also carries strategic importance. Saudi and Emirati officials say it is the main entry point for Iranian arms shipments to the Houthis.In the four months since the battle began, civilians have frequently been killed in air attacks. At least 15 people were killed in air raids that hit a strategic highway linking the city of Hodeidah with Sanaa in September.The war in Yemen began in 2014 when Houthi rebels, traditionally confined to the north of the country, swept south taking over much of the country, including the southern port of Aden, forcing Yemen's President Abd-Rabbu Mansour Hadi to flee.Conflict escalated in March 2015, when a Saudi-UAE led alliance began a campaign to roll back Houthi gains.The aerial campaign and ground offensive succeeded in pushing the Houthis out of Aden and surrounding southern areas, but has stalled since, with little territorial change since.According to the UN, at least 10,000 people have been killed since the coalition intervened in Yemen. The death toll has not been updated in years and is likely to be far higher.\r\n            SOURCE:\r\n            Al Jazeera and news agencies\n\t\t\t\t\t© 2018 Al Jazeera Media Network\n\t AdvertisementAdvertisementAdvertisement"}