{"id": "Lessons from building Brex into a billion-dollar startup", "paragraph": "When I think about my experience as an immigrant and entrepreneur in Silicon Valley, I remember growing up in Brazil and how we saw tech founders and CEOs as kings. We imagined what it would be like to assume the throne.But these weren’t just any kings. Silicon Valley was the kingdom of nerds and underdogs. We identified with these guys, they were just like us. We were fed the myth of a Silicon Valley meritocracy, and the illusion that all you needed was ambition, determination, and a good idea to meet the right person and get funded.What we didn’t understand was that this myth was not completely rooted in reality. Not everyone has access to the American Dream, and those who do have a track record of success before they’re given their moment to prove, or in our case, pitch ourselves.Part of this disconnect was cultural. In Brazil, when I began my first startup, Pagar.me, a payment processing company, my co-founder Pedro Franceschi and I were two 16 year-old kids who learned how to code before we were ten. While it was hard for people to take us seriously initially—I mean, would you quit your job to work for two 16 year- olds? Being so young also worked to our advantage; it revealed that we were passionate, driven, and invested in tech at an age that we didn’t need to be.Once we got our start-up off the ground, our employees were as invested in us as we were invested in them and the company. That’s because in Brazil, most of us grew up with parents that stayed their whole lives at the same company. You grew with the company, and that’s the approach we took when it came to hiring for our first company: who did we see sharing our same vision and growing with us?Coming to the United States was almost a completely opposite experience. The barrier of entry was much higher. You have to go to the right college, graduate from right incubator programs, develop relationships with the right VCs, and have at least one successful startup under your belt before anyone would even consider booking a meeting with you.Pedro and I had to carefully position ourselves before we even got to the Valley. When we finally did get to the U.S., we had already launched a successful startup and we were accepted to Stanford. Soon after, we were accepted by Y-Combinator, and that’s where we built relationships with the key players that would open up the doors for future meetings.With our current startup, Brex,  we found that there weren’t just cultural differences at play, but different approaches we needed to take in order for our business to be successful. For example, in Brazil, we bootstrapped our first startup, and as a result, we had to find our product-market fit immediately. When you are so cash-constrained, it also limits how much you can build your company, and you think in terms of short-term wins instead of sustained growth. Your growth strategy is confined and you’re constantly reacting to your immediate client demands.In the U.S., VCs and angel-investors aren’t interested in the short-term. They’re interested in long-term growth and how you are going to deliver 10x profits over a ten year period. Our strategy could no longer be: plan as we go and grow with our customer. Instead, we needed to deliver a roadmap, and when that roadmap changed or evolved, communicate those changes and adopt a culture of transparency.   Additionally, we learned how difficult it is to find and retain  talent in the U.S.; it can feel like a Sisyphean task. Millennials for example, spend less than two years on average at a job, and if you spend six years or more at the same company, recruiters will actually ask you: “why?” So how can you build a company for the long-term in an environment where employees are not personally invested in the growth of your company?We also learned that many successful tech startups offer stock options to their early employees, but as the company evolves and changes over time, those same stock options are not offered to future employees. This creates the exact opposite of a meritocracy. Why would a new employee work harder, longer, and bring more to the table if you are not going to be compensated for it?Instead of using this broken model, we have invested in paying our team higher wages upfront, and based on performance, we award our team members with stock options. We want to be a company that people are proud of working at longterm, and we want to create a culture that is merit-based.While some of the myths that we first believed in about Silicon Valley are now laughable looking back, they were also really instructional as to how we wanted to build our company and what pitfalls we wanted to avoid.Even though nearly half of tech startups are founded by immigrant entrepreneurs, we have a cultural learning curve in order to have the opportunity to be “the next unicorn.” And maybe that’s the point, we’re experiencing a moment in time during which myths and unicorns no longer serve us, and what we need instead is the background, experience, and vision to create a company that is worth the hype."}