{"id": "NBC to launch a new streaming network, NBC News Signal", "paragraph": "NBC is looking to reach a younger audience with today’s announcement of a new streaming news network, NBC News Signal. Instead of airing on traditional pay TV platforms, Signal will be available through NBC’s news mobile and over-the-top apps, as well as on other services including PlutoTV, YouTube, and Twitter. The focus will be on the “political and social issues in America,” the company says.The service will include an evening show hosted by Simone Boyce at 7 PM ET on weekdays. At launch, this program is available on Thursdays at 7 PM ET only. Other programming consists of a morning and afternoon show and hourly news updates called “Brieflies,” which launches later this quarter and in early 2019.There will also be a Steve Kornacki-hosted digital show “218: Race for the House” which will air daily at 12pm ET and on Election Day, November 6th; as well as a Katy Tur-hosted pre-show on the network from 7-9pm ET.The channel will have 24/7 news coverage starting in mid-2019, NBC says.“There is a growing segment of people who have never had a cable subscription, but who are just as hungry for smart news as the prior generations of news watchers who have consumed NBC News for decades,” said Nick Ascheim, SVP of digital at NBC News Group, about the launch. “These consumers – who are up-to-date on the headlines but are seeking a deeper understanding of the news of the moment – are increasingly turning to OTT devices for ‘lean back’ news consumption or an on-the-go informative experience and that’s exactly what NBC News Signal will deliver,” he added.The streaming network isn’t NBC’s only attempt at wooing millennial viewers. The company also operates a Snapchat show called “Stay Tuned.”However, it is now one of many digital-first initiatives in the news industry, aimed to reach the younger, cord cutter crowd.CBS last year added streaming news from CBSN to its offering for cord cutters, CBS All Access, which it plans on augmenting with local news from CBS stations.Fox News will soon launch its own over-the-top streaming service, Fox Nation. ABC’s new streaming network ABC News Live partnered with Roku to be featured on its devices’ free channel.Meanwhile, Cheddar has been doing deals left-and-right with various streaming TV services for inclusion in their lineups.There’s also VICE News Tonight on HBO, and others, like Plex’s news service, based on its Watchup acquisition.Plus, today’s youngest users – like many of us – get a lot of their news from social media sites, like Facebook and Twitter. That means NBC’s Signal will have a lot of competition fresh out of the gate.Erica Fink and Christine Cataldi are the executive producers for the network. Rashida Jones, SVP of specials for NBC News and MSNBC, is the executive in charge of programming for NBC News Signal.The service is available here, and across the above-mentioned platforms."}