{"id": "Comics legend Stan Lee has died", "paragraph": "Stan Lee,  likely the best-known and most beloved comics writer of all time, has died at the age of 95.“Stan Lee was as extraordinary as the characters he created,” said Disney CEO Bob Iger in a statement. “A super hero in his own right to Marvel fans around the world, Stan had the power to inspire, to entertain, and to connect. The scale of his imagination was only exceeded by the size of his heart.”Lee was the pen name of Stanley Martin Lieber — he later said that he was saving his real name for the serious writing he planned to do one day, but it’s as Stan Lee that he’ll be remembered.Along with artists Jack Kirby and Steve Ditko, Lee was one of the primary creative forces at Marvel Comics during an extraordinary run in the 1960s, which saw the launch of a mind-boggling list of popular characters, including Spider-Man, the Fantastic Four, Iron Man, the Incredible Hulk, the Mighty Thor (granted, he had some mythological inspiration for that one), the X-Men and Black Panther.At first glance, those classic storylines might seem primitive when compared to modern comics, to say nothing of the big-budget cinematic blockbusters that they inspired. But with their flawed heroes and real-world themes, not to mention their emphasis on a shared universe (specifically a New York City teeming with superheroes), they represented a major breakthrough. And they can still be read with pleasure today, thanks to the bold, energetic art and the bombastic charm of Lee’s writing: Face front, true believers!It was also during these years that Lee became the face of Marvel Comics. Through his editorials, his interviews and his tongue-in-cheek appearances in the comics themselves, he created the legend of the Marvel Bullpen, and of Stan Lee, the team’s friendly, alliteration-loving leader.There’s been some reassessment of Lee’s legacy in recent years, as his subsequent ventures became entangled in legal and financial issues, and as fans and critics argued that his talent for self-promotion had obscured the contributions of others, particularly Ditko and Kirby.Nonetheless, to the world at large, Stan Lee remained synonymous with Marvel, an association cemented by his recent cameos in Marvel films. Even when those cameos failed to make me laugh, I enjoyed them as a reminder that these billion-dollar franchises began in the fertile imaginations of individual writers and artists.Plus, they suggested that Lee remained charming and funny well into his 90s, and they even made me hope that he might live for as long as his characters survived. Sadly, that wasn’t the case."}