{"id": "A blockchain firm bought asteroid mining company Planetary Resources", "paragraph": "Here’s a match made in…I don’t know, somewhere on the blockchain, I guess. Pioneering space startup Planetary Resources was acquired by, of all things, a blockchain firm this week. ConsenSys, a Brooklyn based firm that specializes in all things Ethereum issued an announcement noting that it has snagged the asteroid mining  company.It’s not entirely clear how the two companies will work together, though ConsenSys founder Joe Lubin (who also helped author Ethereum) did manage to mention “decentralizing space endeavors,” which is certainly on-brand for the head of a blockchain company. “I admire Planetary Resources for its world class talent, its record of innovation, and for inspiring people across our planet in support of its bold vision for the future,” Lubin said in a statement tied to the news. “Bringing deep space capabilities into the ConsenSys ecosystem reflects our belief in the potential for Ethereum to help humanity craft new societal rule systems through automated trust and guaranteed execution. And it reflects our belief in democratizing and decentralizing space endeavors to unite our species and unlock untapped human potential.”Lubin also promised to offer up more information in the coming months. Meantime, Planetary Resources CEO Chris Lewicki (formerly of NASA JPL) and General Counsel Brian Israel will both be joining ConsenSys. Here’s what Lewicki had to say about the matter, “I am proud of our team’s extraordinary accomplishments, grateful to our visionary supporters, and delighted to join ConsenSys in building atop our work to expand humanity’s economic sphere of influence into the Solar System.”Founded in 2010 as Arkyd Astronautics, Planetary Resources was considered a bright light in the world of privatized space companies, with X Prize founder Peter Diamandis on-board as director. Earlier this year, however, the company noted that it was rethinking its approach and making cutbacks after failing to secure its most recent funding round. "}