{"id": "True Ventures has two new funds totaling $635 million to plug into a wide range of startups", "paragraph": "True Ventures never seems to be short on exits. Most recently, the 13-year-old venture firm saw early checks to Ring, Blue Bottle Coffee, Duo Security and Evident.io pay off via exits to Amazon, Nestle, Cisco and Palo Alto Networks, respectively. Collectively, it should be mentioned, these acquirers shelled out about $4 billion for the startups.Then again, True, which has offices in Palo Alto and San Francisco, has been on a bit of a roll for years. Others of its bets include the 3D printing company Makerbot, acquired for $604 million in 2013; adtech company Brightroll, sold to Yahoo in late 2014 for $640 million in cash; cybersecurity company Caspida, acquired for $190 million by Splunk in the summer of 2015; and wearable device maker Fitbit, which went public in June 2015 and is currently valued at roughly $1 billion but whose market cap hovered around $7 billion in the months following its IPO. At the time, True owned 22 percent of the company.Little wonder investors keep giving True more capital to invest. Indeed, just two years after the firm closed its fifth flagship fund with $310 million, it’s today announcing it has closed its sixth flagship fund with $350 million, along with its third “select” fund, which True will use to provide follow-on funding to the breakout companies in its portfolio. That new vehicle just closed with $285 million. (True closed its second “select” fund last year with $112 million in capital commitments.)Last week, we caught up with firm co-founders Jon Callaghan and Phil Black to talk about True, which has long managed to secure ownership of up to 25 percent of the companies it backs with fairly small first checks of between $1 million and $3 million. We wanted to know whether and how shifts in the market have impacted its strategy.Black, for his part, said that not much had changed, that the firm has always invested in founders, versus sectors, which explains bets like WeFarm, a digital farmer-to-farmer social network that enables far-flung individuals to share ideas and that currently operates in Kenya and Uganda.Other bets that underscore the range of companies that True has backed include the molecular products company Zymergen, which received one of its first checks from True in 2013 and has gone on to raise $175 million altogether; the hair care company Madison Reed (it has now raised roughly $70 million); the Finnish global satellite monitoring company ICEYE ($54 million and counting); and more recently, Whole Biome, a company that’s using gut bacteria to help with drug discovery and whose pills Black says he has been happily taking — joking that, so far at least, “they have not killed me.”Callaghan meanwhile says that even with the firm’s fifth fund, it was typically able to invest between $2 million and $2.5 million for between 20 and 25 percent of the companies it funds, largely by partnering early with founding teams that are trying to take a big swing at a particular market. It was among the first institutional investors in Blue Bottle Coffee, for example, investing in 2012 when the company was already a decade old and it was far from clear that its appeal would extend beyond Bay Area hipsters.Another bet that looks smart in retrospect but struck plenty of other investors as odd early on is Peloton, the connected fitness company that blends stationary bikes and streaming live video classes. The company, which has raised nearly $1 billion at this point and is valued at $4 billion, reportedly had to piece together checks from more than 200 angel investors to get off the ground.True co-led the company’s $30 million Series C round with Tiger Global Management back in 2015. Thanks to its select funds, it also committed the first $20 million to Peloton’s Series F round, which closed with a whopping $550 million back in August. (Callaghan says True can “comfortably” invest up to $50 million in a single company, thanks to its later-stage vehicles.)A large part of True’s success centers on its relentlessly positive messaging, which is that it supports founders through thick and thin — a claim it can support in many cases. When a financing round for the connected doorbell company Ring fell apart shortly before its acquisition by Amazon, True stepped in and re-invested in the company.The firm has also long linked its founders in a kind of social network that many will say they’ve found highly useful over the years — so much so that some founders have now turned to True Ventures  for their second and even third startups.And True connects undergraduates and recent graduates who find tech jobs through its various fellowship programs. Over the last decade, says Callaghan, True has recruited 130 students who wouldn’t necessarily find an easy path to Silicon Valley, paying for them to intern at True’s portfolio companies with the hope that they might stick around the industry. (Perhaps invariably, a “bunch” have gone on to start their own companies, says Callaghan, though True has only invested directly in a couple of these.)Not last, True, like certain other Bay Area venture firms, has a new, if inadvertent, advantage over some of its competitors: it has never raised money from a sovereign wealth fund — for largely economic reasons.“Unless you count institutions and family offices in the U.K., we haven’t taken money from foreign sources,” says Black, explaining that: “As the years have passed, we’ve been approached by lots of newer groups to the category, including big hedge funds, but we’ve never done any weird, special deals. A lot of sovereigns expect you to give them special terms, and we don’t do that.”Callaghan says the composition of True’s LPs also matter to the firm on an intellectual level. He points to a fund of funds called Legacy Venture in Palo Alto, which has backed True Ventures for years, as well as Andreessen Horowitz, Accel, Index Ventures and others. Legacy channels investment profits into causes and charities championed by the firms producing the profits, and “when you look at the foundations and groups they are looking to help, it’s really impressive,” says Callaghan. “It’s pretty great to think that a big win in Silicon Valley could have an impact on influencing poverty in Africa.”"}