{"id": "In a court filing, Edward Snowden says a report critical to an NSA lawsuit is authentic", "paragraph": "An unexpected declaration by whistleblower Edward Snowden  filed in court this week adds a new twist in a long-running lawsuit against the National Security Agency’s surveillance programs.The case, filed by the Electronic Frontier Foundation  a decade ago, seeks to challenge the government’s alleged illegal and unconstitutional surveillance of Americans, who are largely covered under the Fourth Amendment’s protections against warrantless searches and seizures.It’s a big step forward for the case, which had stalled largely because the government refused to confirm that a leaked document was authentic or accurate.News of the surveillance broke in 2006 when an AT&T technician Mark Klein revealed that the NSA was tapping into AT&T’s network backbone. He alleged that a secret, locked room — dubbed Room 641A — in an AT&T facility in San Francisco where he worked was one of many around the U.S. used by the government to monitor communications — domestic and overseas. President George W. Bush authorized the NSA to secretly wiretap Americans’ communications shortly after the September 11 terrorist attacks in 2001.Much of the EFF’s complaint relied on Klein’s testimony until 2013, when Snowden, a former NSA contractor, came forward with new revelations that described and detailed the vast scope of the U.S. government’s surveillance capabilities, which included participation from other phone giants — including Verizon (TechCrunch’s parent company).Snowden’s signed declaration, filed on October 31, confirms that one of the documents he leaked, which the EFF relied heavily on for its case, is an authentic draft document written by the then-NSA inspector general in 2009, which exposed concerns about the legality of the Bush’s warrantless surveillance program — Stellar Wind — particularly the collection of bulk email records on Americans.The draft top-secret document was never published, and the NSA had refused to confirm or deny the authenticity of the 2009 inspector general report, ST-09-0002 — despite that it’s been public for many years.Snowden, as one of the few former NSA staffers who can speak more freely than former government employees about the agency’s surveillance, confirmed that the document is “authentic.”“I read its contents carefully during my employment,” he said in his declaration. “I have a specific and strong recollection of this document because it indicated to me that the government had been conducting illegal surveillance.”Snowden left his home in Hawaii for Hong Kong in 2013 when he gave tens of thousand of documents to reporters. His passport was cancelled as he travelled to Moscow to take another onward flight. He later claimed political asylum in Russia, where he currently lives with his partner.U.S. prosecutors charged Snowden with espionage.EFF executive director Cindy Cohn said that the NSA’s refusal to authenticate the leaked documents “is just another step in its practice of falling back on weak technicalities to prevent the public courts from ruling on whether our Constitution allows this kind of mass surveillance of hundreds of millions of nonsuspect people.”The EFF said in another filing that the draft report “further confirms” the participation of phone companies in the government’s surveillance programs.The case continues — though, a court hearing has not been set.AT&T collaborates on NSA spying through a web of secretive buildings in the US"}