{"id": "Domio raised $12 million in Series A funding to build ‘apart hotels’ across the US", "paragraph": "Hotels can be pricey, and travelers are often forced to leave their rooms for basic things, like food that doesn’t come from the minibar. Yet Airbnb  accommodations, which have become the go-to alternative for travelers, can be highly inconsistent.Domio, a two-year-old, New York-based outfit, thinks there’s a third way: apartment hotels, or “apart hotels,” as the company is calling them.The idea is to build a brand that travelers recognize as upscale yet affordable, more tech friendly than boutique hotels and features plenty of square footage, which it expects will appeal to both families as well as companies that send teams of employees to cities and want to do it more economically.Domio  has a host of competitors, if you’ll forgive the pun. Marriott International earlier this year introduced a branded home-sharing business called Tribute Portfolio Homes wherein it says it vets, outfits and maintains to hotel standards homes of its choosing. And Marriott is among a growing number of hotels to recognize that customers who stay in a hotel for a business trip or a family vacation might prefer a multi-bedroom apartment with hotel-like amenities.Property management companies have been raising funding left and right for the same reason. Among them: Sonder, a four-year-old, San Francisco-based startup offering “spaces built for travel and life” that, according to Crunchbase, has raised $135 million from investors, much of it this year; TurnKey, a six-year-old, Austin, Tex.-based home rental management company that has raised $72 million from investors, including via a Series D round that closed back in March; and Vacasa, a nine-year-old, Portland, Ore.-based vacation rental management company that manages more than 10,000 properties and which just this week closed on $64 million in fresh financing that brings its total funding to $207.5 million.That’s saying nothing of Airbnb itself, which has begun opening hotel-like branded apartment complexes that lease units to both long-term renters and short-term visitors in partnership with development partner Niido.Whether Domio can stand out from competitors remains to be seen, but investors are happy to provide it the financing to try. The company is today announcing it has raised $12 million in Series A equity funding led by Tribeca Venture Partners,  with participation from SoftBank Capital NY and Loric Ventures. The round comes on the heels of Domio announcing a $50 million joint venture last month with the private equity firm Upper 90 to exclusively fund the leasing and operations of as many as 25 apartment-style hotels for group travelers.Indeed, Domio thinks one advantage it may have over other home-share companies is that rather than manage the far-flung properties of different owners, it can shave costs and improve the quality of its offerings by entering five- to 10-year leases with developers and then branding, furnishing and operating entire “apart hotel” properties. (It even has partners in China making its furniture.)As CEO and former real estate banker Jay Roberts told us earlier this week, the plan is to open 25 of these buildings across the U.S. over the next couple of years. The units will average 1,500 square feet and feature two to three bedrooms, and, if all goes as planned, they’ll cost 10 to 25 percent below hotel prices, too.And if the go-go property management market turns? Roberts insists that Domio can “slow down growth if necessary.” He also notes that “Airbnb was founded out of the recession, supported by people who were interested in saving money. We’re starting to see companies that want to be more cost-effective, too.”Domio had earlier raised $5 million in equity and convertible debt from angel investors in the real estate industry; altogether it has now amassed funding of $67 million."}