{"id": "Alexa for Business opens up to third-party device makers", "paragraph": "Last year, Amazon  announced a new initiative, Alexa for Business, designed to introduce its voice assistant technology and Echo devices into a corporate setting. Today, it’s giving the platform a big upgrade by opening it up to device makers who are building their own solutions that have Alexa built in.The change came about based on feedback from the existing organizations where Alexa for Business is today being used, Amazon says. The company claims thousands of businesses have added an Amazon Echo alongside their existing office equipment since the program’s debut last year, including companies like Express Trucking, Fender and Propel Insurance, for example.But it heard from businesses that they want to have Alexa built in to existing devices, to minimize the amount of technology they need to manage and monitor.The update will allow device makers building with the Alexa Voice Service (AVS) SDK to now create products that can be registered with Alexa for Business, and managed as shared devices across the organization.The device management capabilities include the ability to configure things like the room designation and location and monitor the device’s health, as well as manage which public and private skills are assigned to the shared devices.A part of Alexa for Business is the ability for organizations to create their own internal — and practical — skills for a business setting, like voice search for employee directories, Salesforce data or company calendar information.Amazon also recently launched its own feature for Alexa for Business users that offers the ability for staff to book conference rooms.Amazon says it’s already working with several brands on integrating Alexa into their own devices, including Plantronics, iHome and BlackBerry. And it’s working with solution providers like Linkplay and Extron, it says. (Citrix has also begun to integrate with the “for Business” platform.)“We’ve been using Alexa for Business since its launch by pairing Echo devices with existing Polycom equipment,” noted Laura Marx, VP of Alliance Marketing at Plantronics, in a statement about its plans to make equipment that works with Alexa. “Integrating those experiences directly into products like Polycom Trio will take our customer experience to the next level of convenience and ease of use,” she said.Plantronics provided an early look at the Alexa experience earlier this year, and iHome has an existing device with Alexa built in – the iAVS16. However, it has not yet announced which product will be offered through Alexa for Business.It’s still too soon to see how well any of Amazon’s business initiatives with Alexa pay off — after all, Echo devices today are often used for consumer-orientated purposes like playing music, getting news and information, setting kitchen timers and making shopping lists. But if Amazon is able to penetrate businesses with Echo speakers and other Alexa-powered business equipment, it could make inroads into a profitable voice market, beyond the smart home.But not everyone believes Alexa in the workplace is a good idea. Hackers envision how the devices could be used for corporate espionage and hacks, and warn that companies with trade secrets shouldn’t have listening devices set around their offices.Amazon, however, is plodding ahead. It has even integrated with Microsoft’s Cortana so Alexa can gain access to Cortana’s knowledge of productivity features like calendar management, day at a glance and customer email.The Alexa for Business capabilities are provided as an extension to the AVS Device SDK, starting with version 1.10, available to download from GitHub. "}