{"id": "Alumni Ventures Group is the most active venture fund you’ve never heard of", "paragraph": "Alumni Ventures Group’s (AVG) limited partners aren’t endowment or pension funds. Its typical LP is a heart surgeon in Des Moines, Iowa.The firm has both an unorthodox model of fundraising and dealmaking. Across 25 micro funds, AVG is raising and investing upwards of $200 million per year for and in tech startups.Tucked away in Boston, far from the limelight of Silicon Valley, few seem to be paying attention to AVG. There are a few reasons why, and those seem to be working to the firm’s advantage.Today, AVG is announcing a close of roughly $30 million for three additional funds: Green D Ventures, Chestnut Street Ventures and Purple Arch Ventures, which represent capital committed by Dartmouth, the University of Pennsylvania and Northwestern alums, respectively.AVG walks and talks like a venture fund, but a peek under the hood reveals its unconventional fundraising mechanisms.Rather than collecting $5 million minimum investments from institutional LPs, AVG takes $50,000 directly from individual alums of prestigious universities. The firm pools the capital and creates university-specific venture funds for graduates of Duke, Stanford, Harvard, MIT and several other colleges. “People don’t really know what to make of us because we’re so different,” said Michael Collins, AVG’s founder and chief executive officer.Collins started AVG to make venture capital more accessible to individual people. He’s been a VC since 1986, formerly of TA Associates, and had grown tired of the hubris that runs rampant in the industry. In 2014, he started a $1.5 million fund for alums of his alma mater, Dartmouth. Since then, AVG has grown into 25 funds, each of which fundraise annually and are seeing substantial growth over their previous raises. “What we observed is VC is a really good asset class but it’s really designed for institutional investors,” Collins (pictured below) said. “It’s really hard for individual people to put together a smart, simple portfolio unless they do it themselves. That’s why we created AVG.”AVG and its team of 40 investment professionals make 150 to 200 investments per year of roughly $1 million each in U.S. startups across industries. In the second quarter of 2018, PitchBook listed the firm as the second most active global investor, ranked below only Plug and Play Tech Center and above the likes of Kleiner Perkins, NEA and Accel. Unlike the Kleiners, NEAs and Accels of the world, AVG never leads investments. Collins says they just “tuck themselves into” a deal with a great lead investor. They don’t take board seats; Collins says he doesn’t see any value in more than one VC on a company board. And they don’t try to negotiate deal terms. Though unusual, all of this works to their advantage. Founders appreciate the easy capital and access to AVG’s network, and other VC firms don’t view AVG as a threat, making it easier for the firm to get in on great deals.“We are low friction, we are small and we have a hell of a Rolodex,” Collins said. Despite a deal flow that’s unmatched by many VC firms, AVG manages to fly under the radar — and the firm is totally OK with that.“A lot of VC is a bit of a star business where people try to build their own individual brand,” Collins said. “They get out there; they like publicity; they blog; they speak at conferences; they want to be known as the person to bring great deals to. We don’t lead. We work in the background. We just don’t feel the need to put the energy into PR.”“Most VC returns are really achieved through investing in great companies as opposed to changing the trajectory of a company because you’re on the board,” he added. “If you’re a seed investor in Airbnb or Google, you were really great to be an early investor in that company, not because you sat on the board and you’re brilliance created Google’s success.”AVG has completed 115 investments in the last 12 months. It’s investing out of 10-year funds, so at just four years in, it has some more waiting to do before it’ll see the full outcomes of its investments. Still, Collins says 65 of their portfolio companies have had liquidity events or up rounds so far, including Jump, which sold to Uber in April, and Whistle, acquired by Mars Petcare a few years back.“I hope that we can be a catalyst to bring more people into this asset class,” he concluded.“I am a big believer that it’s really important that America continues to lead in entrepreneurship and I think the more people that own this asset class the better.”Base10’s debut fund is the largest ever for a Black-led VC firm"}