{"id": "Myspace reborn! Facebook will let you pin song clips to your profile", "paragraph": "Facebook  will let friends learn about you by streaming clips of your favorite songs from your profile in a throwback to Myspace Music. You’ll be able to choose tracks to add to a revamped Music section of your profile that now actually plays songs instead of just showing what artists you Like, and you can pin your favorites right to the top of your profile. The feature will launch in select countries later this year.While friends won’t be able to listen to the whole song to see how you express yourself, they’ll get to watch an accompanying video that collages artist photos and album art, like an algorithmic music video. Facebook could eventually strike streaming partnership with companies like Spotify or Apple Music to allow full-song streaming.The new Music section of the profile comes alongside the rollout of two previously tested features that all build off Facebook’s recently acquired music licenses from major record labels.Facebook’s Musical.ly-esque Lip Sync Live feature has now rolled out to all users in many countries, and today opens to Pages to let artists perform for and connect with fans. Lip Sync Live lets you broadcast a video stream of you singing or dancing to a popular song you’ve chosen. And to make singing easier, Facebook is starting to add lyrics to Lip Sync Live, starting with hits like Dua Lupa’s “New Rules,” Khalid’s “Better” and “Girls Like You” by Maroon 5.Facebook is finally rolling out its soundtracking feature for Stories. It’s now available on iOS and Android in Australia, Belgium, Czech Republic, France, Germany, Great Britain, Ireland, Italy, Luxembourg, Mexico, New Zealand, Portugal, Spain, Sweden, Switzerland and the United States. This lets you pick from a catalog of songs, choose the section of the track you want, and overlay it on a Story. You also can share these clips to your News Feed. Facebook began testing Music Stories over the past few months following their launch on Instagram in June.What started as licensing deals to make sure users’ videos wouldn’t be taken down for copyright infringement if they’d added a soundtrack or overhead songs in the background has now blossomed into music features across the app. Facebook clearly sees this as a way to deepen engagement, especially with the elusive teen audience that’s been slipping away to apps like Snapchat that lack the same licenses.Music is also such a core way that people express themselves. Celebrity dating app Raya, who’s COO Jared Morgenstern worked at Facebook for years, lets users pick soundtracks for slideshows of their photos. It’s almost surprising Facebook never acquired an audio app like Spotify in its infancy, or later Rdio or Deezer. But now through the licensing deals, it can get much of the social benefit of music without having to buy or build an entire streaming music service."}