{"id": "Why we lie to ourselves every day", "paragraph": "Human action requires motivation, but what exactly are those motivations? Donating money to a charity might be motivated by altruism, and yet, only 1% of donations are anonymous. Donors don’t just want to be altruistic, they also want credit for that altruism plus badges to signal to others about their altruistic ways.Worse, we aren’t even aware of our true motivations — in fact, we often strategically deceive ourselves to make our behavior appear more pure than it really is. It’s a pattern that manifests itself across all kinds of arenas, including consumption, politics, education, medicine, religion and more.In their book Elephant in the Brain, Kevin Simler, formerly a long-time engineer at Palantir, and Robin Hanson, an associate professor of economics at George Mason University, take the most dismal parts of the dismal science of economics and weave them together into a story of humans acting badly (but believing they are great!) As the authors write in their intro, “The line between cynicism and misanthropy — between thinking ill of human motives and thinking ill of humans — is often blurry.” No kidding.Elephant in the Brain by Kevin Simler and Robin Hanson. Oxford University Press, 2018The eponymous elephant in the brain is essentially our self-deception and hidden motivations regarding the actions we take in everyday life. Like the proverbial elephant in the room, this elephant in the brain is visible to those who search for it, but we often avoid looking at it lest we get discouraged at our selfish behavior.Humans care deeply about being perceived as prosocial, but we are also locked into constant competition, over status attainment, careers, and spouses. We want to signal our community spirit, but we also want to selfishly benefit from our work. We solve for this dichotomy by creating rationalizations and excuses to do both simultaneously. We give to charity for the status as well as the altruism, much as we get a college degree to learn, but also to earn a degree which signals to employers that we will be hard workers.The key is that we self-deceive: we don’t realize we are taking advantage of the duality of our actions. We truly believe we are being altruistic, just as much as we truly believe we are in college to learn and explore the arts and humanities. That self-deception is critical, since it lowers the cost of demonstrating our prosocial bona fides: we would be heavily cognitively taxed if we had to constantly pretend as if we cared about the environment when what we really care about is being perceived as an ethical consumer.Elephant in the Brain is a bold yet synthetic thesis. Simler and Hanson build upon a number of research advances, such as Jonathan Haidt’s work on the righteous mind and Robert Trivers work on evolutionary psychology to undergird their thesis in the first few chapters, and then they apply that thesis to a series of other fields (ten, in fact) in relatively brief and facile chapters to describe how the elephant in the brain affects us in every sphere of human activity.Refreshingly, far from being polemicists, the authors are quite curious and investigatory about this pattern of human behavior, and they realize they are pushing at least some of their readers into uncomfortable territory. They even begin the book by stating that “we expect the typical reader to accept roughly two-thirds of our claims about human motives and institutions.”Yet, the book is essentially making one claim, just applied in a myriad of ways. It’s unclear to me who the reader would be who accepts only parts of the book’s premise. Either you have come around to the cynical view of humans (pre or post book), or you haven’t — there doesn’t seem to me to be a middle point between those two perspectives.Worse, even after reading the book, I am left completely unaware of what exactly to do with the thesis now that I have read it. There is something of a lukewarm conclusion in which the authors push for us to have greater situational awareness, and a short albeit excellent section on designing better institutions to account for hidden motivations. The book’s observations ultimately don’t lead to any greater project, no path toward a more enlightened society. That’s fine, but disappointing.Indeed, for a book that arguably strives to be optimistic, I fear its results will be nothing more than cynical fodder for Silicon Valley product designers. Don’t design products for what humans say they want, but design them to punch the buttons of their hidden motivations. Viewed in this light, Elephant in the Brain is perhaps a more academic version of the Facebook product manual.The dismal science is dismal precisely because of this cynicism: because as a project, as a set of values, it leads pretty much nowhere. Everyone is secretly selfish and obsessed with status, and they don’t even know it. As the authors conclude in their final line, “We may be competitive social animals, self-interested and self-deceived, but we cooperated our way to the god-damned moon.” Yes we did, and it is precisely that surprise from such a dreary species that we should take solace in. There is indeed an elephant in our brain, but its influence can wax and wane — and ultimately humans hold their agency in their own hands."}