{"id": "Up close and hands-on with the new MacBook Air", "paragraph": "Why, it seems like only yesterday that Steve Jobs first pulled the MacBook Air from a manila envelope for the world to see. It wasn’t, of course — that was 10 years ago this January. In that past decade, the ultraportable laptop has become a massive hit for the company, helping to redefine the notebook space. But the world moves on, of course. In fact, that was kind of a theme at today’s big event in Brooklyn — bringing some overdue updates to some of the company’s most iconic lines. Heck, even the Mac Mini got some love onstage today. But no Apple product deserved a makeover more than the MacBook. The big change to the product is the most obvious — and far and away the most requested. Apple FINALLY brought a retina display to the device. That puts the new 13-inch screen at 2560 x 1600 — and it looks great. The bump up will be like night and day for longtime Air users who are finally ready to upgrade.Of course, the update also means a bit of a price bump, from $999 to $1,199, which is one of many things that will further blur the line between the redesigned Air and the entry-level MacBook. As it happens, the new Air also looks an awful lot like the rest of the MacBook line. No surprise there, of course. Today’s announcements kept with a theme of aesthetic consistency, with even the iPad Pro and Mac Mini joining in on the space-gray aluminum club.In fact, at first glance, it’s hard to distinguish the laptops, as evidenced by the above picture. That’s the new Air (top) with my 13-inch MacBook Pro (bottom). A closer look, however, reveals the same beveled design that defines previous generations of Airs. The keyboards are new, which is kind of a mixed bag. Apple has certainly improved upon things on that front over three generations, including the most recent version, which are quieter, courtesy of a kind of rubber bladder that also doubles as protection against spills. Touch ID is now present up top — a great addition — though Apple opted not to include the Touch Bar.That could be for any number of reasons. There’s some speculation that the company will ultimately move away from the feature, but more likely, it was simply a cost-cutting measure. After all, price has long been one of the Air’s selling points. The trackpad, too has been made much larger, in keeping with the rest of the line.There are two USB-C ports on the left side. I know I’ll personally miss the end of the SD card reader, but we all saw things moving in this direction. The headphone jack, thankfully, is still on-board.All in all, a solid and long-awaited update to Apple’s best-loved laptop. It’s nice to see the company keeping the model around, rather than simply doing away with it in favor of the low-end MacBook. "}