{"id": "What does SoftBank’s Masayoshi Son plan to say or do about its ties to Saudi Arabia? We’re about to find out", "paragraph": "Throughout October, it seemed that among others in tech, SoftBank might be forced to rethink its cozy relationship with Saudi Arabia’s Crown Prince Mohammad bin Salman, or MBS, who has charmed many captains of industry since rising to power, but whose dark side came into abrupt view over the murder and gruesome disposal of journalist Jamal Khashoggi. (MBS has steered Saudi Arabia into plenty of other terribleness, but the brutal end of Khashoggi, a resident of Virginia, a Washington Post columnist, and a critic of MBS, managed to capture the West’s attention in a way that tens of thousands of dead Yemeni children have not.)Certainly, parting ways with MBS wouldn’t be easy for SoftBank, whose CEO, Masayoshi Son,  has said that his ambitious Vision Fund, which finally closed this past May with $100 billion in commitments, is anchored by MBS. In fact, Son has said that MBS committed $45 billion to the effort in 45 minutes time, and MBS more recently revealed his intention to give SoftBank a separate $45 billion for a second Vision Fund.That’s a lot of money to turn down. Still, for a minute, it seemed that SoftBank might legitimately be having second thoughts about whether it’s good to be in business with MBS. According to the Financial Times, SoftBank’s COO Marcelo Claure said publicly last month that there was “no certainty” that SoftBank will launch another Vision Fund.Then time passed. Some of the public’s outrage was directed elsewhere. And by the end of this past week, it seemed to be all systems go for SoftBank, which took its finger off the pause button and struck two big deals: plugging $375 million into the robotic food-prep company Zume (with reported plans to invest another $375 million into the company at a later date), and announcing on Friday that it has sunk $1.1 billion into View, a maker of glass used in internet-connected windowpanes.Apparently, both companies’ management teams see more to gain from partnering with SoftBank than trying to find other funding sources.The question is whether SoftBank itself will make the same decision as it maps out its own future. And we’re about to find out, seemingly. As the Financial Times notes, Son is reporting SoftBank’s second-quarter results tomorrow, and there’s no question he will be posed a long list of questions about SoftBank’s ties to the Public Investment Fund, the sovereign-wealth fund that MBS controls.Some answers would be helpful, to say the least. To date, Son has said nothing about the Khashoggi case. And though Son skipped an appearance at investment conference organized the week before last by MBS in Riyadh, he met with the prince privately before the event. Our sources say this was to privately express his concern over Khashoggi, but we also get the impression that there was no talk about breaking up the band.We’ll should find out imminently whether that’s right or wrong. Either way, SoftBank’s association with MBS doesn’t look to be forgotten anytime soon. As the FT notes, SoftBank’s shares have fallen fully 26 percent since the fateful day that Khashoggi walked into that Saudi consulate in Turkey in early October and did not come out."}