{"id": "Walmart passes Apple to become No. 3 online retailer in U.S.", "paragraph": "Walmart has overtaken Apple to become the No. 3 online retailer in the U.S., according to a report this week from eMarketer. While Amazon still leads by a wide margin, accounting for 48 percent of e-commerce sales in 2018, Walmart – including also Sam’s Club and Jet.com – is poised to capture 4 percent of all online retail spending in the U.S. by year-end, totaling $20.91 billion.The news of the shift in e-commerce rankings comes alongside Walmart’s strong earnings which saw the retailer reporting a 43 percent increase in online sales and upping its year-end forecast for both earnings and sales.The company had beat Wall St.’s expectations in its fiscal third quarter, with $1.08 earnings per share instead of the expected $1.01. However, it fell short on revenue with $124.89 billion versus the $125.55 billion expected, due to currency complications, it said.eMarketer had estimated in July that Walmart would capture a 3.7 percent e-commerce share in the U.S. this year, but increased that to 4 percent based on its quickly growing online sales.This year, Walmart’s online sales will grow by 39.4 percent – just slightly behind the growth rate for online furniture and home goods retailer Wayfair, which is expected to see sales grow by 40.1 percent, the firm also noted.Apple, meanwhile, will grow just over 18 percent in 2018 – a slowdown related to slowing domestic sales for smartphones and other devices. Its portion of the e-commerce market is relatively unchanged from 2017 to 2018, going from 3.8 percent to 3.9 percent.Walmart, by comparison, is increasing its share from 3.3 percent to 4.0 percent.But both are behind eBay, now at 7.2 percent. And they’re both vastly outranked by Amazon, which will account for a whopping 48 percent of the U.S. e-commerce market in 2018, up from 43.1 percent last year.Amazon will take in more than $252.10 billion domestically this year, eMarketer said.“Walmart’s e-commerce business has been firing on all cylinders lately,” said eMarketer principal analyst Andrew Lipsman, said in a statement. “The retail giant continues to make smart acquisitions to extend its e-commerce portfolio and attract younger and more affluent shoppers. But more than anything, Walmart has caught its stride with a fast-growing online grocery business, which is helped in large part by the massive consumer adoption of click-and-collect.”"}