{"id": "NASA’s prolific planet-hunter Kepler has finally earned its retirement", "paragraph": "After nine years of service, half a million stars surveyed, and thousands of planets discovered around those stars, NASA’s  astonishingly successful Kepler space telescope is finally taking a well-earned rest. Out of fuel but in a safe orbit, the spacecraft will drift through the solar system looking at nothing in particular as its immense trove of data continues to drive discoveries here on Earth.Kepler launched in 2009 after, as is so often the case, decades of preparation, studies, and delays. Its mission, slated to last three and a half years, was to stare unblinkingly at one small patch of sky, watching each star for the minute changes that could indicate a planet briefly blocking its light.The mission was successful beyond all expectations, and once the telescope was operational the data began producing exoplanets not by the dozen but by the thousand. And some came closer to an Earth analogue than astronomers had dared hope — suggesting rocky planets about our size aren’t all that rare. (Good news if we need to relocate.)Kepler’s “first light” image showing its original field of view.In 2014 the original mission was complete but Kepler was still going strong, largely due to robust construction and frugal fuel use. A second mission, dubbed K2, was approved, different from the first: instead of looking at a single patch for years, Kepler would shift its view to a new location every three months. Naturally the number of stars catalogued and observed skyrocketed.Not all was well aboard, though: The craft lost one of its four reaction wheels, used to reorientate the craft against the pull of the sun and other forces, though fortunately it was designed to function without all of them. It was only the later failure of another wheel that essentially put a hard time limit on K2.Without a reaction wheel to change its direction along all three axes, Kepler would have to burn precious fuel every time it needed to change its view or spin around to send data home.Fuel or no fuel, Kepler was still churning out the data. Scientists verified and announced the existence of more than 1,200 more exoplanets in one go, while AI tools like Google’s were working to find others hidden in the noisy data.But the end has come at last, and Kepler used the last of its reserves to maneuver into position to relay its final batch of data through the Deep Space Network. This, like the rest, will soon be available to citizen scientists and research organizations as well as NASA’s own teams.As for the exoplanet hunt, that’s been taken up by the Transiting Exoplanet Survey Satellite, or TESS, launched earlier this year and now in operation. There’s every reason to think it’ll be as productive and inspiring as its predecessor and perhaps more so.“When we started conceiving this mission 35 years ago we didn’t know of a single planet outside our solar system,” said Kepler’s founding principal investigator, William Borucki, since retired. “Now that we know planets are everywhere, Kepler has set us on a new course that’s full of promise for future generations to explore our galaxy.”Having delivered its last package, Kepler has completed its final duty and now enters a rather pleasant retirement. Unlike Cassini, which ended up a new crater on Saturn’s surface (a sudden but glorious end), Kepler will simply fall into an Earth-like orbit some distance behind its home planet, likely to remain stable (barring the extraordinarily unlikely possibility of a cosmic debris strike) for many years to come.We won’t hear from Kepler, and Kepler won’t hear from us. But it’s nice to think it’ll still be looking."}