{"id": "Sequoia leads $10M round for home improvement negotiator Setter", "paragraph": "You probably don’t know how much it should cost to get your home’s windows washed, yard landscaped or countertops replaced. But Setter does. The startup pairs you with a home improvement concierge familiar with all the vendors, prices and common screwups that plague these jobs. Setter finds the best contractors across handiwork, plumbing, electrical, carpentry and more. It researches options, negotiates a bulk rate and, with its added markup, you pay a competitive price with none of the hassle.One of the most reliable startup investing strategies is looking at where people spend a ton of money but hate the experience. That makes home improvement a prime target for disruption, and attracted a $10 million Series A round for Setter co-led by Sequoia Capital  and NFX. “The main issue is that contractors and homeowners speak different languages,” Setter co-founder and CEO Guillaume Laliberté tells me, “which results in unclear scopes of work, frustrated homeowners who don’t know enough to set up the contractors for success, and frustrated contractors who have to come back multiple times.”Setter is now available in Toronto and San Francisco, with seven-plus jobs booked per customer per year costing an average of over $500 each, with 70 percent repeat customers. With the fresh cash, it can grow into a household name in those cities, expand to new markets and hire up to build new products for clients and contractors.I asked Laliberté why he cared to start Setter, and he told me “because human lives are made better when you can make essential human activities invisible.” Growing up, his mom wouldn’t let him buy video games or watch TV so he taught himself to code his own games and build his own toys. “I’d saved money to fix consoles and resell them, make beautiful foam swords for real live-action games, buy and resell headphones — anything that people around me wanted really!” he recalls, teaching him the value of taking the work out of other people’s lives.Meanwhile, his co-founder David Steckel was building high-end homes for the wealthy when he discovered they often had ‘home managers’ that everyone would want but couldn’t afford. What if a startup let multiple homeowners share a manager? Laliberté says Steckel describes it as “I kid you not, the clouds parted, rays of sunlight began to shine through and angels started to sing.” Four days after getting the pitch from Steckel, Laliberté was moving to Toronto to co-found Setter.Users fire up the app, browse a list of common services, get connected to a concierge over chat and tell them about their home maintenance needs while sending photos if necessary. The concierge then scours the best vendors and communicates the job in detail so things get done right the first time, on time. They come back in a few minutes with either a full price quote, or a diagnostic quote that gets refined after an in-home visit. Customers can schedule visits through the app, and stay in touch with their concierge to make sure everything is completed to their specifications.The follow-through is what sets Setter apart from directory-style services like Yelp  or Thumbtack . “Other companies either take your request and assign it to the next available contractor or simply share a list of available contractors and you need to complete everything yourself,” a Setter spokesperson tells me. They might start the job quicker, but you don’t always get exactly what you want. Everyone in the space will have to compete to source the best pros.Though potentially less scalable than Thumbtack’s leaner approach, Setter is hoping for better retention as customers shift off of the Yellow Pages and random web searches. Thumbtack rocketed to a $1.2 billion valuation and had raised $273 million by 2015, some from Sequoia (presenting a curious potential conflict of interest). That same ascent may have lined up the investors behind Setter’s $2 million seed round from Sequoia, Hustle Fund and Avichal Garg last year. Today’s $10 million Series A also included Hustle Fund and Maple VC. The toughest challenge for Setter will be changing the status quo for how people shop for home improvement away from ruthless bargain hunting. It will have to educate users about the pitfalls and potential long-term costs of getting slapdash service. If Laliberté wants to fulfill his childhood mission, he’ll have to figure out how to make homeowners value satisfaction over the lowest sticker price."}