{"id": "Okay, one final Form D note", "paragraph": "Some more comments from readers on the changing culture around startups filing their Form Ds with the SEC, and then a short update on SoftBank and a bunch more article reviews.We are experimenting with new content forms at TechCrunch. This is a rough draft of something new – provide your feedback directly to the authors: Danny at danny@techcrunch.com or Arman at Arman.Tabatabai@techcrunch.com if you like or hate something here.If you haven’t been following our obsession with Form Ds, be sure to read our original piece and follow up. The gist is that startups are increasingly foregoing filing a Form D with the SEC that provides details of their venture rounds like investment size and main investors in order to stay stealth longer. That has implications for journalists and the public, since we rely on these filings in many cases to know who is funding what in the Valley.Morrison Foerster put together a good presentation two years ago that provides an overview of the different routes that startups can take in disclosing their rounds properly.Traditionally, the vast majority of startups used Rule 506 for their securities, which mandates that a Form D be filed within 15 days of the first money of the round closing. These days though, more and more startups are opting to use Section 4(a)(2), which doesn’t require a Form D, but also doesn’t provide a “blue sky” exception to start securities laws, which means that startups have to file in relevant state jurisdictions and no longer have preemption from the SEC.David Willbrand, who chairs the Early Stage & Emerging Company Practice at Thompson Hine LLP, read our original articles on Form Ds and explained by email that the practices around securities disclosures have indeed been changing at his firm and others:We started pushing 4(a)(2) very hard when our clients kept getting “outed” thru the Form D and upset about it. In my experience, for 99% is the desire to remain in stealth mode, period.[…]When I started in 1996, Form Ds were paper, there was no internet, and no one looked. Now they are electronic and the media and blogs scrape daily and publish the information. It actually really is true disclosure! And it’s kind of ironic, right, which goes to your point – now that it’s working, these issuers don’t want it.[…]What I find is that the proverbial Series A is the brass ring, and issuers wants to call everything seed rounds (saving the title) until something chunky shows up, and stay below the radar too. So they pop out of the cake publicly for the first time with a big “Series A” that they build press around – and their first Form D.Another piece of feedback we received was from Augie Rakow, the co-founder and managing partner of Atrium, which bills itself as a “better law firm for startups” that TechCrunch has covered a few times before. He wrote to us that in addition to the media concerns, startups also have to be aware of the broad cross-section of interested parties to Form Ds that hasn’t existed in the past:Today, there is a bigger audience in terms of who cares about venture backed companies. Whether this spun off from the launch of the Facebook movie or the fact that over two billion people across the global have the internet at their fingertips via smartphones, people are connected and curious. The audience is not only larger but also encompasses more national and international interests. This means there are simply more eyes on trends, announcements, and intel on privately held companies whether they are media, investors, or your competitors. Companies that have a good reason to stay stealth may want to avoid attracting this attention by not making a public Form D filing.For startups, the obvious advice is to just consult your attorney and consider the tradeoffs of having a very clean safe harbor versus more work around regulatory filings to stay stealthy.But the real message here is for journalists. Form Ds are no longer common among seed-stage startups, and indeed, startup founders and venture investors have a lot of latitude in choosing how and when they file. You can no longer just watch the SEC’s EDGAR search platform and break stories anymore. Building up a human sourcing capability is the only way to get into those early investment rounds today.Finally — and this is something that is hard to prove one way or the other — the lack of disclosure may also mean that the fears around seed financing dropping off a cliff may be at least a little bit unfounded. Eliot Brown at the Wall Street Journal reported just yesterday that the number of seed financings is down 40 percent, according to PitchBook data. How much of that drop is because of changing macroeconomic conditions, versus changes in filing disclosures?Tokyo Stock Exchange. Photo by electravk via Getty ImagesLast week, I also got obsessed with SoftBank. The company confirmed today that it intends to move forward with the IPO of its Japanese mobile telecom unit, according to WSJ and many other sources. The company is targeting more than $20 billion in proceeds, and its overallotment could drive that above $25 billion, or roughly the level of Alibaba’s record IPO haul.One interesting note from Taiga Uranaka at Reuters on the public issue is that everyday investors will likely play an outsized role in the IPO process:Yet SoftBank’s brand name is still likely to draw retail investors long accustomed to using SoftBank’s  phone and internet services. Many still see CEO Son as a tech visionary who challenged entrenched rivals NTT DoCoMo Inc ( 9437.T ) and KDDI, and brought Apple Inc’s ( AAPL.O ) iPhone to Japan.Japanese households are commonly seen as an attractive target in IPOs with their 1,829 trillion yen in financial assets, even if they are traditionally risk-averse with over 50 percent of assets in cash and deposits.More than 80 percent of the shares will be offered to domestic retail investors, a person with knowledge of the matter told Reuters.Pavel Alpeyev at Bloomberg noted that “SoftBank is looking to tempt investors with a dividend payout ratio of about 85 percent of net income, according to the filing. Based on net income in the last fiscal year, that would work out to an almost 5 percent yield at the indicated IPO price.” A higher dividend ratio is particularly attractive to retired individual investors.Despite SoftBank’s horrifying levels of debt, Japanese consumers may well save the company from itself and allow it to effectively jump start its balance sheet yet again. Complemented with a potential Vision Fund II, Masayoshi Son’s vision for a completely transformed SoftBank seems waiting for him in the cards.Tech C.E.O.s Are in Love With Their Principal Doomsayer – Nellie Bowles writes a feature on Yuval Noah Harari, the noted philosopher and popular author of Sapiens. Bowles investigates the paradoxical popularity of Harari, who sees technology as creating a permanent “useless class” and criticizes Silicon Valley with his now enduring popularity in the region. Interesting personal details on the somewhat reclusive Israeli, but ultimately the question of the paradox remains sadly mostly unanswered. (2,800 words)Why Doctors Hate Their Computers – Atul Gawande discusses learning and using Epic, the dominant electronic medical records software platform, and discovers the challenges of building static software for the complex adaptive system that is health care. His observations of the challenges of software engineering will be well-known to anyone who has read Fred Brooks, but the piece does an excellent job of exploring the balancing act between the needs of technocratic systems and the human design needed to make messy and complicated professions work. Worth a read. (8,900 words)Picking flowers, making honey: The Chinese military’s collaboration with foreign universities – An excellent study by Alex Joske at the Australia Strategic Policy Institute on the hundreds of military scientists from China who use foreign academic exchanges as a means of information acquisition for critical scientific and engineering knowledge, including in the United States. China’s government under Xi Jinping has made indigenous technology development a chief domestic priority, and the U.S. innovation economy is encouraged to increasingly guard its intellectual property. (6,500 words)The Digital Deciders – New America report by Robert Morgus who investigates the fracturing of the internet, which I have written about at some length. Morgus finds that a small group of countries (the “digital deciders”) will determine whether the internet continues to be open or whether nationalist interests will close it off. Let’s all hope that Iraq believes in freedom of expression and not Chinese-style surveillance. Worth a skim. (45 page report, but with prodigious tables)"}