{"id": "Waymo, take the wheel: Self-driving cars go fully driverless on California roads", "paragraph": "Self-driving startup Waymo, a Google spin-off owned by parent company Alphabet, has been granted the first permit in California to begin driverless testing on public roads. Yes, that means self-driving cars without a human behind the wheel will be cruising around California, beginning with a limited geographic area in Silicon Valley.The company’s autonomous vehicles are a common sight on public roads in and around Google’s headquarters in Mountain View, California. The startup, which began as a moonshot project under X, has been testing on public roads for years now. But this permit, issued by the California Department of Motor Vehicles, allows Waymo  to test these self-driving cars without a human test driver behind the wheel.New California DMV regulations that took effect in April allow companies to apply for fully driverless testing within carefully defined limits. Waymo is the first to get approval. At least one other company is waiting in the wings.Waymo said its driverless test cars will initially hit the streets near its Silicon Valley headquarters, including parts of Mountain View, Sunnyvale, Los Altos, Los Altos Hills and Palo Alto. See the map below for the initial driverless launch.Perhaps anticipating wariness from the public, Waymo emphasized that it knows this area “well.”“Mountain View is home to more than a dozen autonomous vehicle companies, and has supported safe testing for years,” the company said in its announcement.Waymo will eventually expand its driverless testing territory. Before it moves into a new area, Waymo said it will notify the new communities where this expansion will occur, and submit a request to the DMV.Members of the public won’t be invited into these driverless cars just yet. However, Waymo is working toward that goal. The first driverless rides will be for Waymo employees. Waymo said it will eventually “create opportunities for members of the public to experience this technology,” similar to its early ride program in Arizona.The driverless permit allows Waymo to test its driverless vehicles during the day and night on city streets, rural roads and highways with posted speed limits of up to 65 miles per hour. Waymo is also allowed to test in fog and light rain, conditions that the company said its vehicles can handle.If one of its driverless vehicles encounters a situation it doesn’t understand it will come to “safe stop,” Waymo said, adding that it has well-established protocols that include contacting fleet and rider support.The company announced earlier this month that its autonomous vehicles have driven 10 million miles on public roads in the United States since it began working on self-driving technology in 2009.California is not the first state to test true driverless vehicles on public roads. Arizona gets that distinction. Waymo began testing self-driving Chrysler Pacifica Minivans in Phoenix suburbs, notably Chandler, in 2016. The company launched an early rider program in April 2017. Later that year, Waymo removed employees and passengers from its test fleet, sending empty self-driving minivans onto the streets of greater Phoenix.By May of this year, Waymo began allowing some early riders in Phoenix to hail a self-driving minivan without a human test driver behind the wheel."}