{"id": "ZypMedia raises $5.6M to help traditional media companies embrace online ads", "paragraph": "Local advertising startup ZypMedia is announcing that it has raised $5.6 million in Series C funding.That’s a relatively small amount of money for a Series C (the company had previously raised $6.9 million total, according to Crunchbase), but co-founder Aman Sareen said, “We had the opportunity to raise a lot more, but we chose not to.” In fact, Sareen said ZypMedia became profitable last year.So the new funding round should allow the company to continue expanding its product lineup and its team — it has plans to double its headcount in the United States and India over the next year — while still leaving room for organic growth.“We didn’t want to be a cautionary tale [like] other previous adtech companies,” Sareen said. “We are buckling down for the long haul … We didn’t want to necessarily raise money just for the sake of it.”Sareen founded ZypMedia with his former college roommate Ramandeep Ahuja, as well as former Current TV executive Mark Goldman, with the aim of helping local broadcasters move into programmatic advertising.The idea is to help those media companies offer campaigns that can reach advertisers’ desired audiences across traditional and digital channels, such as display, video (including over-the-top), social media and native advertising.“Local digital advertising has been very neglected,” Sareen said. “It’s a huge market, and our goal was to be one of the leaders. I’ll be honest, it wasn’t an easy to task, but we have been decently successful in our mission.”“Decently successful” means signing up partners like Sinclair Broadcast Group and Univision. It also means enlisting Archer Venture Capital as the lead investor in the new round. (Existing investors US Venture Partners and Sinclair also participated.)“Not only have Aman and Ramandeep created a superior tech stack for delivering local advertising, they’ve also developed a really smart and defensible business model, partnering with local media companies to act as their direct sales force,” said Archer Managing Director John Hadl in the funding announcement.And ultimately, the vision goes beyond bringing incremental revenue to traditional media companies. Sareen argued that ZypMedia’s model positions it right at the intersection of traditional and digital advertising.“Within the next two-to-five years, digital or linear, over-the-top or over-the-air, it will jump through one platform,” he said. “Everything will use the same technology and currency.”"}