{"id": "To actually change the world, Big Tech needs to grow up", "paragraph": "“Fierce competitor” is one of the biggest, and most culturally ingrained, compliments that exists in sports. The same is true in the technology world. However, as competitors originating from outside of Silicon Valley rise, so do the stakes for previously unchallenged tech firms, like Uber,  Facebook and Google, to enter new markets responsibly. Companies that were once earnest startups helmed by say-anything, hoodie-wearing twenty-somethings are now big corporations with boards, stakeholders and tremendous impacts on society.They need to start acting like it.Amid mounting government and public pressures, tech firms famous for pushing far beyond boundaries now need to play by the rules when they enter new cities and towns. They now have to embrace more humble methods of conducting business and admit defeat when younger upstarts create better, faster innovations. Freshly relocated tech companies need to respect the indigenous innovation scene in a chosen location — not simply conduct headquarter operations somewhere else. They need to bring to every new market entrepreneurial thinking, jobs and a willingness to develop strong connections with public and private sector leaders.The good news is that it’s not too late for tech giants to learn to be responsible, self-aware competitors. However, a few central questions need to be answered: Will big tech companies begin to bring more to cities than they take? Will they become responsible community partners building smart technologies in a way that respects new market values — especially around diversity, privacy and respect for people’s data? Or will they use their heft to out-maneuver municipal authorities, outbid local startups for engineering talent and ship intellectual property and data back to headquarters?As Uber’s rebrand takes hold, for instance, CEO Dara Khosrowshahi needs to guide his organization toward working with municipal and community leaders — rather than coexisting with them at best. He and his team need to deepen their understanding of regulatory environments at the city level, play within the rules governing specific places and work to encourage homegrown tech talent in Uber’s new markets to pursue career opportunities with international reach. Uber needs to back up the company’s newly rolled out softer, safer image with concrete efforts to complement the innovation ecosystems already flourishing in cities outside of its hometown of San Francisco — and compete collaboratively in markets around the world.Other tech giant founders, CEOs and executive teams around the world need to follow suit — regardless of whether actual suits are involved.Indeed, there’s a right way for tech companies to contribute to local causes and be good corporate citizens in general. The process starts with bigger tech companies establishing information exchanges with new communities that build trust and prioritize learning. After establishing operations and understanding the needs of communities surrounding them, tech companies need to prove their genuine interest in local innovation ecosystems. One way to do this is by donating money to a relevant charity or nonprofit organization that provides useful skill development to underserved communities.Another, more humbling, option for tech giants is to invest in native startups building innovations that help them improve corporate citizenship — a technology that reduces their global carbon footprint, for example — and complement their own capabilities.I am a serial entrepreneur and optimist. That’s why I believe that technology companies like Uber, Google  and Facebook  have a unique opportunity to deliver more than monetary investment into communities around the world. They need to assume responsibility for advancing innovation and talent upon arrival in a new city — and actively build programs that bridge location-specific digital, skill and transportation gaps.Tech giants need to work with government and community peers to connect with local competitors already building the next generation of technology platforms. Success requires a balance of fierce competitiveness and humble respect. The entry of a tech giant to a new place should inspire connectivity, understanding and competition that lifts a community’s entire innovation ecosystem."}