{"id": "Apply for free tickets to Startup Battlefield Latin America 2018", "paragraph": "We’re just a few short weeks away from the inaugural Startup Battlefield Latin America 2018 that takes place November 8 at the Tomie Ohtake Institute in São Paulo, Brazil. That’s when up to 15 of Latin America’s exceptional early-stage startup founders will launch their companies to the world as they compete for cash, glory and investor love.It promises to be a fierce competition, and we want you to come revel in the excitement, the knowledge-sharing, the networking and the opportunities. Best of all, spectator tickets are free — simply apply right here. We’ll select people in the Latin American startup scene on a first-come-first-served basis. We’ll notify all ticket winners via email.Here’s how the Startup Battlefield format works. During three preliminary rounds, up to five startups per round will each have six minutes to pitch and present their demo before a panel of expert tech and VC judges. The judges have six minutes following each pitch to ask teams probing questions. Five of the competing startups will move on to the finals and pitch again to a new set of judges.One finalist will be named the first TechCrunch Startup Battlefield Latin America champion and win a $25,000 non-equity cash prize and a trip for two to the next Disrupt, where they can exhibit free of charge in the Startup Alley — and possibly qualify to participate in the Startup Battlefield at Disrupt.In-between all the fast-paced Startup Battlefield rounds, we’ve gathered an outstanding lineup of speakers to discuss a range of tech topics of interest to the LATAM region. Here’s just a sample:Read the full Startup Battlefield LATAM 2018 agenda to learn what else we have planned throughout the day.Don’t miss your opportunity to watch the first Startup Battlefield Latin America competition, hear dynamic speakers discuss tech and investment issues specific to Latin America and enjoy a day of networking and opportunity with like-minded entrepreneurs. It all takes place November 8, 2018, in São Paulo, Brazil. Apply for your free spectator ticket today."}