{"id": "In State Tectonics, an explosive ending for the future of democracy", "paragraph": "An omnipotent data infrastructure and knowledge-sharing tech organization has spread across the planet. Global conspiracies to disseminate propaganda and rig elections are ever present. Algorithms determine what people see as objective truth, and terrorist organizations gird to bring down the monopoly on information.Malka Older faces a problem few speculative science fiction authors face in their lifetimes: having their work become a blueprint for reality. The author, who began formulating her Centenal Cycle series just a few years ago, now finds that her plots have leapt off the page and have become the daily fodder for cable news programs and Congressional investigations. Her universe is set decades into the future, but history is accelerating, and decades into the future can now mean 2019.So we arrive at the third and final volume of a trilogy that began as a single work called Infomocracy and has proliferated into Null States and now State Tectonics. Ending a trilogy is rarely easy, but State Tectonics does what Older has always done best with her works, smashing together ideas about the future of politics with a medley of thriller styles to deliver an ample helping of thought-provoking nuance.Older’s world is built on two simple premises. First, through a project called microdemocracy, the world has been subdivided into 100,000 person governing units known as centenals, and every citizen in the world has the right of migration to choose the government they want. This creates strange artifacts — for instance, in dense areas like New York City, citizens can change governments from a corporate-backed libertarian paradise to a leftist environmental oasis in as quick as a subway stop.Second, to ensure that citizens can make the best choices for themselves, a global organization called Information (a hybrid Google, United Nations, and BBC) tirelessly works to provide objective information to citizens about politics and the world, verifying claims about everything from election promises to the taste of items on a restaurant menu.Together, they allow Older to explore a world of information manipulation and electoral strategy while meditating on the meaning of objective truth. Across the trilogy, we follow a crew of Information staffers as they uncover political plots and intrigue around a series of global elections. This structure allows Older to create paced thrillers without losing the intellectual spirit of speculative fiction.While in her last work Null States, the focus was on inequality and lack of access to information, in State Tectonics, Older interrogates the meaning of Information’s monopoly on … information itself. In this microdemocratic world, it is a crime to provide unverified information to people, and yet, Information hardly has infinite knowledge about the world. A shadowy group starts to purvey local information about cities and people outside the normal Information channels, and that raises profound questions — who ultimately “owns” reality? How do we decide what objective truth even is?In the background of this central question is a trial for an Information staffer accused of the crime of algorithmic bias, of adjusting reality to suit her own ends. Sound familiar?As a work of speculative fiction — particularly about a subject as complex as the future of democracy — State Tectonics is superlative. Older is striking in her frenetic ability to weave together idea after idea into vignettes that caused this reader to constantly stop and wander in thought. In just this book, we have discussions on the future of politics, mental health, infrastructure finance, transportation, food, nationalism, and identity politics. The dynamic range here is exhilarating.Unfortunately, that enormous range forces Older to sacrifice depth, not only in the sophistication of some of these topics, which are often only conceived in slight brushstrokes, but also in the characters themselves. After three reasonably hefty books, I still don’t feel as if I truly know the characters I’ve spent so much time with. They are like friends in a transient city such as New York City, people to hang out with on weekends, but not worth a followup once they move on.More pejoratively, the book feels constantly weighed down by extraneous details that at times can feel more like Wikipedia than assiduous worldbuilding. In this regard, Older has actually matured as a writer from her earlier works, as the detailed digressions are fewer and far between, but they remain as distracting from her core plot, and take time away from the needed work of fleshing out her characters further.State Tectonics, like its earlier siblings, is the best and worst of fusion cuisine: the brilliant items on the menu can inspire us to think radically beyond our traditional categories and beliefs, but the vast majority of the dishes end up being mishmashes that are ultimately ephemeral and forgotten. The novel is brilliant in discoursing on the future of democracy, and if that is a topic of keen interest, few books will satisfy that urge like this one will."}