{"id": "Lyft is launching a rider loyalty program in December", "paragraph": "Ridesharing service Lyft  is today announcing its new plan to encourage repeat use: the launch of Lyft Rewards, a loyalty program for riders. The program, which will begin rolling out next month to select riders across the U.S., will let riders earn points for each dollar spent, which can then be used for upgrades to nicer cars or savings on future rides, among other things.The company already caters to its regular riders in several ways, including through its recently launched subscription service, a program that rewards business users, and its partnership with Delta that allows riders to earn Delta airline miles with Lyft.The new rewards program will aim for everyday riders, in order to better retain their business as a part of Lyft’s larger battle with Uber .According to Lyft, riders will soon be able to earn points as they ride with Lyft, which can be accumulated over time and then used for upgrades. Initially, this includes getting upgraded to Lyft Lux or getting discounts on future rides. The company says it’s considering how to offer other passenger perks, like access to more experienced drivers and double-points days, for example. It’s also listening to customer feedback to hear about other rewards people may want.The company says the program will launch in December 2018 and be available to select riders in various cities to start, before rolling out to more riders in 2019. If invited to join, riders will have an email or a notification from Lyft with the offer. Once enrolled in the program, riders will be able to check their points progress in the app.The launch of Lyft’s loyalty program comes shortly after the company announced its “1 billion rides” milestone in September, a couple of months after Uber hit 10 billion trips.Uber, meanwhile, has also been working on ways to better cater to its most frequent customers, including with last year’s launch of an Uber credit card that offers cash back on rides and UberEats dining. It has also dabbled with merchant offers, and rolled out its own subscription program."}