{"id": "Twitter removes thousands of accounts that tried to dissuade Democrats from voting", "paragraph": "Twitter  has deleted thousands of automated accounts posting messages that tried to discourage and dissuade voters from casting their ballot in the upcoming election next week.Some 10,000 accounts were removed across late September and early October after they were first flagged by staff at the Democratic Party, the company has confirmed.“We removed a series of accounts for engaging in attempts to share disinformation in an automated fashion – a violation of our policies,” said a Twitter spokesperson in an email to TechCrunch. “We stopped this quickly and at its source.” But the company did not provide examples of the kinds of accounts it removed, or say who or what might have been behind the activity.The accounts posed as Democrats and try to convince key demographics to stay at home and not vote, likely as an attempt to sway the results in key election battlegrounds, according to Reuters, which first reported the news.A spokesperson for the Democratic National Committee did not return a request for comment outside its business hours.The removals are a drop in the ocean to the wider threats that Twitter faces. Earlier this year, the social networking giant deleted 1.2 million accounts for sharing and promoting terrorist content. In May alone, the company deleted just shy of 10 million accounts each week for sending malicious, automated messages.Twitter had 335 million monthly active users as of its latest earnings report in July.But the company has faced criticism from lawmakers for not doing more to proactively remove content that violates its rules or spreads disinformation and false news. With just days before Americans are set to vote in the U.S. midterms, this latest batch of takedowns is likely to spark further concern that Twitter did not automatically detect the malicious accounts.Following the publication of Reuters’ report, Yoel Roth, Twitter’s head of site integrity, said in a tweet thread that public research identifying bots is often “deeply flawed” and that many are identifying bots “based on probability, not certainty,” since “nobody other than Twitter can see non-public, internal account data.”Twitter does not have a strict policy on the spread of disinformation in the run-up to election season, unlike Facebook, which recently banned content that tried to suppress voters with false and misleading information. Instead, Twitter said last year that its “open and real-time nature” is a “powerful antidote to the spreading of all types of false information.” But researchers have been critical of that approach. Research published last month found that more than 700,000 accounts that were active during the 2016 presidential election are still active to this day — pushing a million tweets each day.A Twitter spokesperson added that for the election this year, the company has “established open lines of communication and direct, easy escalation paths for state election officials, Homeland Security, and campaign organizations from both major parties to help us enforce our policies vigorously and protect conversational health on our service.”Thousands of Twitter accounts that spread fake news during the 2016 election are still active today, say researchers"}