{"id": "Facebook launches Candidate Info where politicians pitch on camera", "paragraph": "Facebook  wants to make YouTube-style monologue videos the new way for politicians to talk straight with their constituency. Today, Facebook launches Candidate Info, featuring thousands of direct-to-camera vertical videos where federal, state and local candidates introduce themselves and explain their top policy priority, qualifications and biggest goal if they win office. Elizabeth Warren (D – MA Senate), Scott Walker (R – WI Governor) and Beto O’Rourke (D – TX Senate) have already posted, and Facebook expects more candidates to jump in shortly.These videos will soon be available as part of an Election 2018 bookmark in the Facebook mobile app’s navigation drawer. And starting next week, the clips will begin appearing to potential constituents in the News Feed.Facebook tells me these videos will make it easier for people to learn about and compare different candidates. The effort extends the Town Hall feature Facebook launched in 2017 that offers a personalized directory of candidates they could vote for. Candidate Info will similarly only show videos from politicians running in elections relevant to a given user, so if you’re in California you won’t see videos from the Texas senate race between O’Rourke and Ted Cruz. But you can still find their videos on their Facebook Pages.With the mid-terms fast approaching, Facebook is trying to do everything it can to protect against election interference by foreign and domestic attackers, offer transparency about who bought campaign ads, connect users to candidates and encourage people to register and vote. With fake news that spread through the social network thought to have influenced the 2016 election, and ill-gotten Facebook user data from Cambridge Analytica applied to Donald Trump’s campaign ad targeting, Facebook is hoping to avoid similar problematic narratives this time around.You can see some examples of Candidate Info videos below from O’Rourke and Wisconsin Governor Scott Walker."}