{"id": "How cities can fix tourism hellThe struggle for cities to manage “Overtourism”Smart city tech enabling more “tourist-ready” citiesAnd lastly, some reading while in transit:\n", "paragraph": "A steep and rapid rise in tourism has left behind a wake of economic and environmental damage in cities around the globe. In response, governments have been responding with policies that attempt to limit the number of visitors who come in. We’ve decided to spare you from any more Amazon HQ2 talk and instead focus on why cities should shy away from reactive policies and should instead utilize their growing set of technological capabilities to change how they manage tourists within city lines.Consider this an ongoing discussion about Urban Tech, its intersection with regulation, issues of public service, and other complexities that people have full PHDs on. I’m just a bitter, born-and-bred New Yorker trying to figure out why I’ve been stuck in between subway stops for the last 15 minutes, so please reach out with your take on any of these thoughts: @Arman.Tabatabai@techcrunch.com.\u2028  Well – it didn’t take long for the phrase “overtourism” to get overused. The popular buzzword describes the influx of tourists who flood a location and damage the quality of life for full-time residents. The term has become such a common topic of debate in recent months that it was even featured this past week on Oxford Dictionaries’ annual “Words of the Year” list. But the expression’s frequent appearance in headlines highlights the growing number of cities plagued by the externalities from rising tourism.In the last decade, travel has become easier and more accessible than ever. Low-cost ticketing services and apartment-rental companies have brought down the costs of transportation and lodging; the ubiquity of social media has ticked up tourism marketing efforts and consumer demand for travel; economic globalization has increased the frequency of business travel; and rising incomes in emerging markets have opened up travel to many who previously couldn’t afford it.Now, unsurprisingly, tourism has spiked dramatically, with the UN’s World Tourism Organization (UNWTO) reporting that tourist arrivals grew an estimated 7% in 2017 – materially above the roughly 4% seen consistently since 2010. The sudden and rapid increase of visitors has left many cities and residents overwhelmed, dealing with issues like overcrowding, pollution, and rising costs of goods and housing.The problems cities face with rising tourism are only set to intensify. And while it’s hard for me to imagine when walking shoulder-to-shoulder with strangers on tight New York streets, the number of tourists in major cities like these can very possibly double over the next 10 to 15 years. China and other emerging markets have already seen significant growth in the middle-class and have long runway ahead. According to the Organization for Economic Co-operation and Development (OECD), the global middle class is expected to rise from the 1.8 billion observed in 2009 to 3.2 billion by 2020 and 4.9 billion by 2030. The new money brings with it a new wave of travelers looking to catch a selfie with the Eiffel Tower, with the UNWTO forecasting international tourist arrivals to increase from 1.3 billion to 1.8 billion by 2030.With a growing sense of urgency around managing their guests, more and more cities have been implementing policies focused on limiting the number of tourists that visit altogether by imposing hard visitor limits, tourist taxes or otherwise.But as the UNWTO points out in its report on overtourism, the negative effects from inflating tourism are not solely tied to the number of visitors in a city but are also largely driven by touristy seasonality, tourist behavior, the behavior of the resident population, and the functionality of city infrastructure. We’ve seen cities with few tourists, for example, have experienced similar issues to those experienced in cities with millions.While many cities have focused on reactive policies that are meant to quell tourism, they should instead focus on technology-driven solutions that can help manage tourist behavior, create structural changes to city tourism infrastructure, while allowing cities to continue capturing the significant revenue stream that tourism provides.THOMAS COEX/AFP/Getty ImagesYes, cities are faced with the headwind of a growing tourism population, but city policymakers also benefit from the tailwind of having more technological capabilities than their predecessors. With the rise of smart city and Internet of Things (IoT) initiatives, many cities are equipped with tools such as connected infrastructure, lidar-sensors, high-quality broadband, and troves of data that make it easier to manage issues around congestion, infrastructure, or otherwise. On the congestion side, we have already seen companies using geo-tracking and other smart city technologies to manage congestion around event venues, roads, and stores. Cities can apply the same strategies to manage the flow of tourist and resident movement.And while you can’t necessarily prevent people from people visiting the Louvre or the Coliseum, cities are using a variety of methods to incentivize the use of less congested space or disperse the times in which people flock to highly-trafficked locations by using tools such as real-time congestion notifications, data-driven ticketing schedules for museums and landmarks, or digitally-guided tours through uncontested routes.Companies and municipalities in cities like London and Antwerp are already working on using tourist movement tracking to manage crowds and help notify and guide tourists to certain locations at the most efficient times. Other cities have developed augmented reality tours that can guide tourists in real-time to less congested spaces by dynamically adjusting their routes.A number of startups are also working with cities to use collected movement data to help reshape infrastructure to better fit the long-term needs and changing demographics of its occupants. Companies like Stae or Calthorpe Analytics use analytics on movement, permitting, business trends or otherwise to help cities implement more effective zoning and land use plans. City planners can use the same technology to help effectively design street structure to increase usable sidewalk space and to better allocate zoning for hotels, retail or other tourist-friendly attractions.Focusing counter-overtourism efforts on smart city technologies can help adjust the behavior and movement of travelers in a city through a number of avenues, in a way tourist caps or tourist taxes do not. And at the end of the day, tourism is one of the largest sources of city income, meaning it also plays a vital role in determining the budgets cities have to plow back into transit, roads, digital infrastructure, the energy grid, and other pain points that plague residents and travelers alike year-round. And by disallowing or disincentivizing tourism, cities can lose valuable capital for infrastructure, which can subsequently exacerbate congestion problems in the long-run.Some cities have justified tourist taxes by saying the revenue stream would be invested into improving the issues overtourism has caused. But daily or upon-entry tourist taxes we’ve seen so far haven’t come close to offsetting the lost revenue from disincentivized tourists, who at the start of 2017 spent all-in nearly $700 per day in the US on transportation, souvenirs and other expenses according to the U.S. National Travel and Tourism Office. In 2017, international tourism alone drove to $1.6 trillion in earnings and in 2016, travel & tourism accounted for roughly 1 in 10 jobs in the global economy according to the World Travel and Tourism Council. And the benefits of travel are not only economic, with cross-border tourism promoting transfers of culture, knowledge and experience.But to be clear, I don’t mean to say smart city technology initiatives alone are going to solve overtourism. The significant wave of growth in the number of global travelers is a serious challenge and many of the issues that result from spiking tourism, like housing affordability, are incredibly complex and come down to more than just data. However, I do believe cities should be focused less on tourist reduction and more on solutions that enable tourist management. Utilizing and allocating more resources to smart city technologies can not only more effectively and structurally limit the negative impacts from overtourism, but it also allows cities to benefit from a significant and high growth tourism revenue stream. Cities can then create a virtuous cycle of reinvestment where they plow investment back into its infrastructure to better manage visitor growth, resident growth, and quality of life over the long-term. Cities can have their cake and eat it too."}