{"id": "Audioburst turns the best part of podcasts into personalized news briefs", "paragraph": "Tel Aviv-based Audioburst has been developing a search engine for audio news, which allows users to locate audio content within podcasts and other talk radio programs. Today, the company is capitalizing on its technology to launch personalized playlists that deliver custom news briefs that get better over time the more you use the product.The feature has been built using deep AI learning, the company says.The content itself is drawn from top podcasts and the radio stations in Audioburst’s  index, and will alert you to new information based on your chosen keywords and topics.To use the feature, you first sign up on the Audioburst website, then select from a set of interests or add your own. When you’re finished with the selection process, you just hit the “I’m done” button to be taken to your personalized playlist of audio clips.The end result is being able to listen to the parts of the podcasts or other audio programs you would actually care about, rather than slogging through half an hour or more of chatter for the one tidbit of news you were interested in.For example, when testing the feature this morning, I chose a variety of topics like “tech news,” “movies,” “entertainment,” “science,” “parenting” and more, and was delivered a set of audio clips that included a discussion of Disney’s “Star Wars” spin-off series starring Diego Luna; a chat about the 2018 MacBook Air overhaul; an assessment of the smog in L.A.; and a lot of other clips I chose to skip (but will hopefully train the AI further).You can try the feature yourself at search.audioburst.com by clicking on “Personalized Playlist” in the top left.The results were hit or miss, which is expected — to some extent — fresh out of the gate. But there were also times when the clips didn’t actually serve up too much information. That is, you’d still need to turn to the podcast itself for the full story.However, the feature itself isn’t necessarily going to be used by consumers directly on Audioburst’s website. Instead, its development came about thanks to requests from partners using its API.The company says you can expect to see the personalized playlists integrated into its partners’ products in the smart speaker, mobile, in-car infotainment, and wearable tech spaces in 2019.Audioburst currently has partnerships with ByteDance, Nippon, Bose, Harman, Samsung and more."}