{"id": "Oracle’s Larry Ellison keeps poking AWS because he has no choice", "paragraph": "Larry Ellison  gave his Oracle Openworld keynote on Monday and of course he took several shots at AWS. In his view, his company’s cloud products were cheaper, better and faster than AWS, but then what would you expect him to say?He rolled out a slide with all the facts and figures in case you doubted it. He wrapped it up in a neat little marketing package for the world to see. Oracle has an autonomous self-healing database. AWS? Nope. That much he’s right.Slide: OracleHe makes claims that his cloud products are faster and cheaper, claims that are hard to substantiate given how hard it is to nail down any vendor’s cloud prices and speeds. He says they have no disaster recovery, when they do. None of it matters.This was about showmanship. It was about chest beating and it’s about going after the market leader because frankly, the man has little choice. By now, it’s well documented that Oracle was late to the cloud. Larry Ellison was never a fan and he made it clear over the years, but today as the world shifts to a cloud model, his company has had to move with it.It hasn’t been an easy transition. It required substantial investment on the part of the company to build its infrastructure to support a cloud model. It took a big change in the way their sales people sell the product. The cloud is based on a subscription model, and it requires more of a partnership approach with customers. Oracle doesn’t exactly have a reputation for playing nicely.To make matters worse, Oracle’s late start puts it well behind market leader AWS. Hence, Ellison shouting from the rooftops how much better his company’s solutions are and how insecure the competitors are. Synergy Research, which follows the cloud market closely, has pegged Amazon’s cloud market share at around 35 percent. It has Oracle in the single digits in the most recent data from last summer (and the market hasn’t shifted dramatically since it came out with this data).At the time, Synergy identified the four biggest players as Amazon, Microsoft, Google and IBM with Alibaba coming up fast. Synergy chief analyst John Dinsdale says Oracle is falling behind. “We have seen Oracle losing market share over the last few quarters in IaaS, PaaS and managed private cloud,” he said. “In a market that is growing at 50 percent per year, Microsoft, Google and Alibaba are all gaining market share, while the share of market leader AWS is holding steady,” he added.To its credit, the company has seen some gains via its SaaS business. “As Oracle works to convert its huge on-premise software client base to SaaS, Oracle grew its share of enterprise SaaS markets in 2016 and 2017. Its market share then held steady in the first half of 2018,” Dinsdale pointed out.Yet the company stopped breaking out its cloud revenue last June. As I wrote at the time, that isn’t usually a good sign:That Oracle chose not to break out cloud revenue this quarter can’t be seen as a good sign. To be fair, we haven’t really seen Google break out their cloud revenue either with one exception in February. But when the guys at the top of the market shout about their growth, and the guys further down don’t, you can draw your own conclusions.Further Oracle has been quite vocal about protesting the Pentagon’s $10 billion JEDI contract, believing that it has been written to favor Amazon over other vendors, a charge the Pentagon has denied. It hasn’t stopped Oracle from filing protests or even bringing their case directly to the president.At least Ellison might have had some good news yesterday. CNBC reported that the big Amazon Prime outage in July might have been related to a transition away from Oracle databases that Amazon is currently undertaking. (Amazon’s Werner Vogels strongly denied  that assertion on Twitter.)Regardless, Oracle finds itself in an unfamiliar position. After years of domination, it is stuck behind in the pack. When you find yourself in such a position, you need to have a strong bark and Ellison is going after AWS hard. As the clear market leader, he has few other options right now."}