{"id": "SparkLabs Taipei closes initial $4.25M for its first fund, adds Jeremy Lin as an advisor", "paragraph": "SparkLabs Taipei, part of SparkLabs Group, the global network of accelerator programs and funds that works with emerging startup ecosystems, has raised $4.25 million in an initial close led by CTBC Group, along with individual investors, for its first venture capital fund. SparkLabs Taipei also announced today that it has added Atlanta Hawks player Jeremy Lin, who sparked “Linsanity” as the first player of Chinese- or Taiwanese-descent in the NBA, to its board of advisors.The funding was first disclosed in a Form D filed with the SEC this week that says SparkLabs Taipei’s ultimate goal for the fund is to raise $10 million.In a prepared statement, Lin said “SparkLabs Taipei is an innovative fund offering support and guidance for entrepreneurs in Taiwan. Being a trailblazer is challenging and having a strong support is critical to your success. I’m excited to join a strong team of partners and advisors at SparkLabs Taipei and look forward to meeting some great entrepreneurs.”Other SparkLabs Taipei advisors include YouTube co-founder Steve Chen; Kabam co-founder and CEO Kevin Chou; and RedOctane (the producer of Guitar Hero) co-founders Charles and Kai Huang.SparkLabs Taipei was launched last year under the leadership of Edgar Chiu,  the former COO of Taipei-based app developer Gogolook (acquired by Korean Internet giant Naver in 2013) and founding general manager of Camp Mobile Taiwan, part of Naver’s mobile app development subsidiary. In an interview with TechCrunch at the time, Chiu said SparkLabs Taipei’s goal is to help prepare Taiwanese startups to enter global markets.In a press statement, Chiu said “Jeremy Lin  embodies what we look for in our entrepreneurs. Persistence, dedication, and hard work. Our team is extremely excited and proud to have him on board and join an already stellar board of advisors. Plus I’ve been a big fan when he first joined the NBA, through the craziness of ‘Linsanity’ and his continued excellence in the NBA.”While the SparkLabs network backs tech companies from around the world, it is known in particular for its work with Asian startups. SparkLabs launched in South Korea in 2012, and since then has opened accelerator programs across the Asia-Pacific region and in Washington, D.C., including programs dedicated to financial technology, agriculture, cybersecurity and blockchain startups, and energy."}