{"id": "Gearing up to step into virtual reality", "paragraph": "Editor’s note: This post was done in partnership with Wirecutter. When readers choose to buy Wirecutter’s independently chosen editorial picks, Wirecutter and TechCrunch may earn affiliate commissions.For the past two years, we’ve been closely following the advances of new VR experiences. Much of this gear is still in development, but if you’re eager to dive in and get a sense of what’s available right now, we’ve put together our current recommendations for mobile, PC, console and budget VR headsets.The Oculus Go is light enough to wear comfortably, but it’s still a bit front-heavy. (Photo: Signe Brewster)                          Standalone Headset: Oculus GoThe Oculus Go is a standalone headset  that doesn’t require a PC, game console or mobile phone to run. The Go comes with a sharp built-in screen and a comfortable controller that convincingly puts your hand in whatever virtual world you’re exploring. It’s compatible with Oculus games and shares the Stream VR app library with the Samsung Gear VR, so there are enough games to keep you busy for hours.You can also watch movies and TV via streaming services. Its straps fit around the sides and over the top of your head and it’s light enough that you’ll forget you’re wearing it. Although its field of view is wider and its lenses are better than Gear VR’s, its screen resolution is lower. While you can move your head from left to right, up and down, and forward and backwards, your view won’t change when you tilt your head.For what it currently offers, we think the Oculus Go is bit pricey, and some people might want to wait for the Oculus Quest next year. But the Go’s hardware is impressive and it’s the best overall standalone headset for most people right now.Photo: Signe BrewsterVR Headset for PC: Oculus Rift + TouchWhether you’re a beginner or seasoned gamer, the Oculus Rift + Touch VR headset for PC provides an enjoyable experience that’s easy to navigate and deeply immersive. The Rift + Touch has three cords, one that’s tethered to your PC — which gives the system more processing power — and two that are connected to its included sensors. It’s the most comfortable headset we tested, fitting to wear over long periods of time, and easy to set up. Playing games with it calls for a bit of space; Rift recommends at least a 5-by-5 box.We found that gameplay in a larger area (a 5-by-11 space) is even better. You’ll be able to interact within and see different parts of virtual worlds through head movements and by stepping from side to side. We like that its controllers are balanced and that the system comes with its own set of headphones. Like the Oculus Go, the Rift + Touch can be used with Oculus and Stream VR games.Photo: Signe Brewster                                                                                                                                                   PS4 Headset: Sony PlayStation VR BundleIf you already own a PlayStation 4 and want to give virtual reality a try, we recommend doing so with the Sony PlayStation VR. This system’s tracking isn’t as powerful as a high-end PC’s, but it still offers an incredibly immersive experience. Tracked by the PlayStation VR camera, the Move controllers are responsive and one of the system’s best features.The bundle we recommend comes with two Move controllers, a camera, and the Skyrim VR game — it’s important to note that PlayStation VR bundles are frequently discontinued and the only difference in the newer versions have been the featured game. Unlike our VR headset for PC picks, PlayStation VR does not have separate screens for each eye and it has a higher refresh rate for a high-quality visual experience. The headset fits more like a hard hat as opposed to goggles, but it’s one of the most comfortable headsets we tested.Photo: Signe BrewsterMobile Headset: Samsung Gear VRSamsung Gear VR is the best VR headset made for a phone — but it’s only compatible with Samsung Galaxy and Note smartphones. It can be used with a broad variety of apps and games, and overall offers the best mobile VR experience. We like its UI and that there’s more to explore within its app ecosystem than with than with our runner-up pick, the Google Daydream View.Its headset has adjustable straps, comfortable padding and a lens adjustment dial. The Gear VR’s controller is intuitive, easy to hold and connects to your phone over Bluetooth. Instead of tracking every hand movement, the remote is primarily limited to pointing and clicking, but its trigger button and trackpad feel natural and still give you a sense of immersion. It’s a bit heavier to wear than other mobile VR headsets we tested, but it fits better to the face for some and is more secure.Aside from puzzle, shooting and adventure titles, you can download any Oculus games you already own and play them with the Gear VR for free. If you don’t own one of Samsung’s flagship phones, we recommend the Google Daydream View, or the standalone Oculus Go.Photo: Signe BrewsterBudget VR & AR Headset: Merge VR/AR GogglesIf you don’t need the absolute best experience and want an inexpensive way to try VR for the first time, Merge VR/AR Goggles for Google Cardboard is the best offering. Compared to the other six budget headsets we tested, we preferred its combination of adjustability, price and comfort. It’s an upgrade from Cardboard and is still compatible with Google’s  ecosystem of apps.We like that it doubles as an augmented reality headset that can be paired with the Merge Cube and Merge’s curated VR library. You can play games, go on virtual expeditions, and watch films with the Merge VR/AR Goggles. It works with more phones (including iPhones). But that makes the quality feel a bit lower than experiences tailored for specific mobile systems. So long as you have a smartphone with a large screen and high resolution you’ll get a decent introductory VR experience.These picks may have been updated by Wirecutter. When readers choose to buy Wirecutter’s independently chosen editorial picks, Wirecutter and TechCrunch may earn affiliate commissions."}