{"id": "Mobvoi launches new $200 smartwatch and $130 AirPods alternative", "paragraph": "Chinese AI company Mobvoi  has consistently been one of the best also-rans in the smartwatch game, which remains dominated by Apple. Today, it launched a sequel to its 2016 TicWatch, which was a viral hit raising over $2 million on Kickstarter, and it unveiled a cheaper take on Apple’s AirPods.The new TicWatch C2 was outed at a London event and is priced at $199.99. Unlike its predecessor, it has shifted from Mobvoi’s own OS to Google’s  Wear OS. That isn’t a huge surprise, though, since Mobvoi’s newer budget watches and ‘pro’ watch have both already made that jump.The C2 — which stands for classic 2 — packs NFC, Bluetooth, NFC and a voice assistant. It comes in black, platinum and rose gold. The latter color option — shown below — is thinner so presumably it is designed for female wrists.However, there’s a compromise since the watch isn’t shipping with Qualcomm’s  newest Snapdragon Wear 3100 chip. Mobvoi has instead picked the older 2100 processor. That might explain the price, but it will mean that newer Android  Wear watches shipping in the company months have better performance, particularly around battery life. As it stands, the TicWatch C2 claims a day-two life but the processor should be a consideration for would-be buyers.Mobvoi also outed TicPods Free, its take on Apple’s  wireless AirPods. They are priced at $129.99 and available in red, white and blue.The earbuds already raised over $2.8 million from Indiegogo — Mobvoi typically uses crowdfunding to gather feedback and assess customer interest — and early reviews have been positive.They work on Android and iOS and include support for Alex and Google Assistant. They also include gesture-based controls beyond the Apple-style taps for skipping music, etc. Battery life without the case, which doubles as a charger, is estimated at 18 hours, or four hours of listening time.The TicPods are available to buy online now. The TicWatch C2 is up for pre-sale ahead of a “wide” launch that’s planned for December 6.Mobvoi specializes in AI and it includes Google among its investors. It also has a joint venture with VW that is focused on bringing Ai into the automotive industry. In China it is best known for AI services but globally, in the consumer space, it also offers a Google Assistant speaker called TicHome Mini."}