{"id": "Blockchain gaming gets a boost with Mythical Games’ $16M Series A", "paragraph": "Fortnite, the free multi-player survival game, has earned an astonishing $1 billion from in-game virtual purchases alone. Now, others in the gaming industry are experimenting with how they too can capitalize on new trends in gaming.Mythical Games, a startup out of stealth today with $16 million in Series A funding, is embracing a future in gaming where user-generated content and intimate ties between players, content creators, brands and developers is the norm. Mythical is using its infusion of venture capital to develop a line of PC, mobile and console games on the EOSIO blockchain, which will also be open to developers to build games with “player-owned economies.”The company says an announcement regarding its initial lineup of games is on the way.Mythical is led by a group of gaming industry veterans. Its chief executive officer is John Linden, a former studio head at Activision and president of the Niantic-acquired Seismic Games. The rest of its C-suite includes chief compliance officer Jamie Jackson, another former studio head at Activision; chief product officer Stephan Cunningham, a former director of product management at Yahoo; and head of blockchain Rudy Kock, a former senior producer at Blizzard — the Activision subsidiary known for World of Warcraft. Together, the team has worked on games including Call of Duty, Guitar Hero, Marvel Strike Force and Skylanders.Galaxy Digital’s EOS VC Fund has led the round for Mythical. The $325 million fund, launched earlier this year, is focused on expanding the EOSIO ecosystem via strategic investments in startups building on EOSIO blockchain software. Javelin Venture Partners, Divergence Digital Currency, cryptocurrency exchange OKCoin and others also participated in the round.Epic Games, the creator of Fortnite, raises $1.25 billionIt’s no surprise investors are getting excited about the booming gaming business given the success of Epic Games, Twitch, Discord and others in the space.Epic Games raised a $1.25 billion round late last month thanks to the cultural phenomenon that its game, Fortnite, has become. KKR, Iconiq Capital, Smash Ventures,Vulcan Capital, Kleiner Perkins, Lightspeed Venture Partners and others participated in that round. Discord, a chat application for gamers, raised a $50 million financing in April at a $1.65 billion valuation from Benchmark Capital, Greylock Partners, IVP, Spark Capital and Tencent. And Dapper Labs, best known for the blockchain-based game CryptoKitties, even raised a VC round this year — a $15 million financing led by Venrock, with participation from GV and Samsung NEXT.In total, VCs have invested $1.8 billion in gaming startups this year, per PitchBook.Bunch scores $3.8M to turn mobile games into video chat LAN parties"}