{"id": "Italian consumer watchdog hands down €15M in fines to Apple and Samsung for slowing devices", "paragraph": "Italy’s Autorità garante della concorrenza e del mercato, roughly equivalent to this America’s FTC, has fined Apple  and Samsung a total of $15 million for the companies’ practice of forcing updates on consumers that may slow or break their devices. The amount may be a drop in the bucket, but it’s a signal that governments won’t always let this type of behavior fly.The “unfair commercial practices” are described by the AGCM as follows:The two companies have induced consumers – by insistently proposing to proceed with the download and also because of the significant information asymmetry of consumers vis-a-vis the producers – to install software updates that are not adequately supported by their devices, without adequately informing them, nor providing them an effective way to recover the full functionality of their devices.Sounds about right!In case you don’t remember, essentially Apple was pushing updates to iPhones last year that caused performance issues with older phones. Everyone took this as part of the usual conspiracy theory that Apple slows phones to get you to upgrade, but it turns out to have been more like a lack of testing before they shipped.Apple addresses why people are saying their iPhones with older batteries are running ‘slower’Samsung, for its part, was pushing Android Mashmallow updates to a number of its devices, but failed to consider that it would cause serious issues in Galaxy Note 4s — issues it then would charge to repair.The issue here wasn’t the bad updates exactly, but the fact that consumers were pressured into accepting them, at cost to themselves. It would be one thing if the updates were simply made available and these issues addressed as they came up, but both companies “insistently suggested” that the updates be installed despite the problems.In addition to this, Apple was found to have “not adequately informed consumers about some essential characteristics of lithium batteries, such as their average duration and deterioration factors, nor about the correct procedures to maintain, verify and replace batteries in order to preserve full functionality of devices.” That would be when Apple revealed to iPhone 6 owners that their batteries were not functioning correctly and that they’d have to pay for a replacement if they wanted full functionality. This information, the AGCM, suggests, ought to have been made plain from the beginning.Samsung gets €5 million in fines and Apple gets €10 million. Those may not affect either company’s bottom line, but they are the maximum possible fines, so it’s symbolic as well. If a dozen other countries were to come to the same conclusion, the fines would really start to add up. Apple has already made some amends, but if it fell afoul of the law it still has to pay the price."}