{"id": "Unicorns aren’t special anymore", "paragraph": "When Aileen Lee, the former Kleiner Perkins partner and founder of the seed-stage venture capital firm Cowboy Ventures, coined the term “unicorn” in 2013 on this very site, there were just 39 companies that had earned the title. She called them “the lucky/genius few.” Her definition: U.S. software startups launched since 2003 worth more than $1 billion. When she authored the viral post, just four companies were garnering valuations that high each year, according to her calculations. Five years later, the rate at which startups are becoming unicorns has increased 353.1 percent, according to PitchBook’s latest research.Welcome To The Unicorn Club: Learning From Billion-Dollar StartupsToday, there are 145 “active unicorns” in the U.S. alone, worth an aggregate valuation of $555.9 billion. Why? A couple of reasons. Namely, because companies are staying private longer and longer, allowing the unicorn count to continue to swell with very few companies transitioning out and into another club — the public markets club. Plus, there is so much capital available in the market, $80.1 billion, to be exact, that late-stage companies are opting for “mini-IPOs” sponsored by SoftBank instead of airing their dirty laundry in an S-1 filing.There are no signs pointing to a slowdown in new unicorns. The latest data shows that it only took the average U.S. unicorn six years to achieve such status, versus 7.5 years only three years ago. I can think of several examples of companies that did it much faster than that: Brex, Lime and Bird are some recent companies to be worth $1 billion or more in record time. Valuation step-ups are meatier than ever, too. The median late-stage valuation has increased by 50.7 percent year-over-year. Meanwhile, early-stage and seed-stage median valuations have jumped roughly 28 percent and 12 percent, respectively. Not to mention venture capital investment in 2018 is expected to reach highs not seen since the dot-com boom.Venture capital investment in US companies to hit $100B in 2018At the end of the day, a startup’s valuation, regardless of how large it is or how quickly it reached the billion-dollar milestone, shouldn’t matter. But these are metrics in which others in the startup ecosystem measure success and they determine the worth of a company — or at least the amount an investor is willing to pay for a piece. As much as I’d like to do away with the term, even the concept entirely, the proliferation of billion-dollar companies isn’t something I can ignore."}