{"id": "Gift Guide: The best gear for that friend who wants to start a podcast", "paragraph": "Welcome to TechCrunch’s 2018 Holiday Gift Guide! Need more gift ideas? Check out our Gift Guide Hub.“How do I start a podcast?”As the producer of the TechCrunch podcast Equity, I get this question all the time. Fortunately, it’s easier than ever to get your voice out there, even on a shoestring budget.As interest skyrockets, the barrier to entry is getting lower, with more microphones, gadgets and services hitting the market all the time. But unless you have an audio engineering degree, it can all be a bit overwhelming.I’ve spent a lot of time researching, testing and breaking podcasting gear so you don’t have to. We all have that friend who always talks about starting their very own podcast. Want to help them (or you) get the ball rolling this holiday season? Here’s where I’d start.[inline-ad]Never let the gear get in the way of getting your voice heard. First you’ll need a microphone. For better or worse, there are microphones in everything these days — and some of them are actually pretty decent. If all you have is your phone, your phone is all you need. Get that voice memo application out and hit record.While the built-in microphone will do in a pinch, a few bucks can go a long way to improve the sound quality that you can capture with your phone. Pop on this Rode VideoMic Me ($50 on Amazon) and the audio captured by your phone will be greatly improved (pro tip: you’ll need a dongle if your phone, like many these days, doesn’t have a headphone jack.)If you want those sexy ASMR sounds, though, you will have to invest in a bigger microphone.In the mid-level range, the microphone I most often recommend is the Blue Yeti Pro ($250 on Amazon). It’s simple and sounds great, and is the closest thing to a plug-and-play solution that I have found. It supports both USB and XLR, which makes it way more flexible (and makes it play friendly with audio interfaces, which I’ll talk about next). Blue Mics also sells a cheaper alternative with the non-pro Yeti ($130 on Amazon), the downside being that there’s no XLR support there.If you are looking for something on the higher end, here at TC we run our podcasts off of four Neumann KMS 105 Handheld Condenser Microphones ($699 on Amazon). They sound amazing — but if you’re just getting started, it’s almost certainly not a big enough improvement from the Yeti to justify the price.Macs are unable to run two of the same USB mics at the same time. When you need more than one mic at one time, you’ll need an interface that lets you funnel and control multiple mics into one computer. This is one of the places where that aforementioned XLR support on the Yeti Pro comes in handy.We use the Tascam US-4×4 4-Channel USB Audio Interface ($200 on Amazon). It’s simple and does its job well, handling up to four mics at once. Tascam also sells a two-mic version ($150 on Amazon) if you don’t need as many mics simultaneously — but at only $50 cheaper, you might want to spend the cash now for the sake of future flexibility.You can’t always be in the studio, but podcasting on-the-go can be a pain in the ass. Imagine having to lug around a bunch of mics and interfaces and tangled-up wires just to shoot an episode from the road.One solution to this problem is to use a smaller recording device. Again, here, your phone works. But when I need higher fidelity when recording remotely, I tap one of the portable recorders put out by Zoom.My go-to is the Zoom H4N ($220 on Amazon). This thing is an audio beast with the ability to capture stereo audio with the built-in microphones on the top in addition to being able to connect two external mics. I see a ton of reporters running around with this recorder.Smaller and less robust than the H4N, but still able to capture that crisp juicy audio, is the Zoom H1N ($120 on Amazon). It doesn’t have the ability to connect external mics and can’t act as an audio interface like the more capable H4N — but for getting audio on the fly, this small package is what you are looking for.[inline-ad]In addition to hardware, any fledgling podcaster will need some software to get the job done. A common situation that many podcasters come across is how to record an interview or conversation with multiple people when all of those people are in different locations.Zencastr is essentially a conference call service that has a bunch of extra features specifically designed for podcasters. It records your audio and the audio of your guest locally. That greatly improves the audio quality of your guest, making sure their side of the conversation doesn’t sound like a Skype call. They have a free option (two guests, 8 hours of recording per month) to get you started, but $20 a month bumps you up to unlimited guests and unlimited recordings.Another neat feature Zencastr offers is automatic post-production; just select the tracks from your recording session and in a few minutes Zencastr spits out a track that has perfectly leveled sound. Zencastr also allows you to input your intro music, sound effects or anything else you’ve got pre-recorded to cut down on the things you need to add in post-production. Zencastr is the only service out there that I have found that incorporates all these essentials — it’s not perfect, but it’s the best thing I’ve seen out there.If you didn’t want to spend the money on a subscription service, you can always patchwork it together with Skype, the ECAMM recorder plug-in, Soundflower and Linein. To explain how to rig all of these together would require a separate post that I hope to never write, but Googling those keywords should get you started.Unless you’re a one-take wonder, you’re going to need to get yourself some editing software. You might get away with posting raw audio at first, but eventually you’ll want to edit out those umms and uhhs and trim out any random background noise.These editing programs can get complicated and expensive, and it’s easy to find yourself in the editing deep end. My suggestion? Start with the free stuff.The first podcasts I ever edited were done on GarageBand. It was free and simple enough for me to learn quickly, with the catch that it’s Mac/iOS only. Another option for simple/free is Audacity. Unlike GarageBand, it’s available on Windows/Linux — and it does a lot more than you might expect from the price tag.Once you reach the point where you find yourself needing to spend money, you have all sorts of options to pick from. Ask five editors what to use and each will give you a different answer. Most will just recommend the program that they learned on. The big three are Audition by Adobe, Pro Tools by Avid and Logic Pro X by Apple. The first two have free trials, so start there and figure out what you like best.Where is your podcast going to live?Before it can make it onto iTunes, your podcast needs to be hosted somewhere. There are many ways to do this from building your pod a website on services like Squarespace or Wix. Another option is to use to use the music / audio sharing service SoundCloud.My favorite option for hosting is a service called Simplecast. Simplecast makes uploading and distributing your podcast… well, simple. For about 10 bucks a month Simplecast will host as many episodes as you can make, provides you with an RSS feed to submit to iTunes and provides you with nifty perks like embeddable players for social media.But by far one of the best features of Simplecast is their analytics. They provide you with how many downloads each episode gets, where those downloads are coming from and what service your audience is listening on (whether it be Pocketcast, Apple’s podcasting app or the embedded player you just tweeted out).I hope that helps you on your podcasting journey. Now get out there and start making content![inline-ad]"}