{"id": "Southeast Asia’s Grab partners with MasterCard to offer prepaid cards", "paragraph": "Ride-hailing firm Grab branched out into payments last year and now the $11 billion-valued company, which acquired Uber’s Southeast Asia business earlier this year, has given its fintech division a major boost after it announced plans to introduce virtual prepaid in partnership with Mastercard.The move is the largest digital payment push in Southeast Asia to date. The deal will see its Grab  Pay business offer Grab’s 110 million registered users the option to use a virtual Mastercard to make payments both online and in-person.Users will be able to use physical Grab Pay cards or virtual ones — the latter being a card number, expiry date, and other details that are held within the Grab app. Interestingly, TechCrunch understands that Grab had been in contact with Visa over a similar deal but it ultimately chose MasterCard . Grab declined to comment on that when asked.Regardless of the issuer, the deal instantly gives Grab Pay the potential for serious legs.Last November, Grab launched its first payment integration by allowing users in Singapore to pay for food at selected restaurants using its app. While it has expanded that support in Singapore and other parts of Southeast Asia, it has needed to onboard merchants to do so. Now, with MasterCard, it is tapping into a vast network of three million retailers across Southeast Asia, with support for worldwide and also via online merchants.That turns Grab Pay into a serious payment network on paper, but it will also give a large chunk of Southeast Asia’s 650 million population a chance to own plastic for the first time.While the region’s middle-class is growing quickly as internet access continues to increase — Southeast Asia’s internet population is larger than the total U.S. population, and growing — few people have a card.Many, in fact, remain unbanked. The World Bank claims 71 percent of the region is paid their salary in cash while just 30 percent own a debit card and only nine percent have a credit card. Many simply don’t qualify to own one. Grab’s effort, which is the largest pre-paid push in the region, could make a difference.‘Could’ is very much the operative word here. While Grab has made progress with Grab Pay — which also runs an offline merchant network that enables those with limited internet knowledge to take advantage of e-commerce and other online services — the service is intrinsically linked to Grab.Grab Pay can now exist as a standalone service. The question is whether Grab can market the virtual card service effectively and tap the undoubted potential that it has for its business and consumers in Southeast Asia. To date, no fintech firm has managed to build a regional network that covers over 100 million consumers, although there are plenty of promising challengers that have started out in a single market right. While Grab’s efforts have been periphery and, based on anecdotal evidence, not all users are convinced they need Grab Pay in their life.Grab though is confident that its raft of non-transportation — which includes food deliveries, grocery deliveries and third-party services on its platform — can make the Mastercard venture work.“We see Grab Pay as a glue that goes across all the products we offer, and rewards our users for using them,” Reuben Lai, senior managing director at Grab Financial, told TechCrunch in an interview. “Grab Pay users spend two times more than regular users and they stay twice longer on our platform.”Lai added that those who use Grab Pay are 30 percent more likely to use other Grab services — they, it seems, are the power users — but he added that Grab’s mission, beyond increasing engagement, is to digitize payments in Southeast Asia.“What we want to do next is democratize payments and access to financial services,” he said. “Many consumers don’t have access to the things we take for granted, we want to make these available to our users, drivers and partners.”Just as Grab founders Hooi Ling Tan and Anthony Tan have said that street hailing is Grab’s biggest competitor, so Lai suggested that cash is the biggest rival to Grab Pay right now.That’s certainly true since the deal with Uber  removed Grab’s main competitor from the eight markets that it serves in Southeast Asia, but regulators are keen to see increased competition. Singapore fined Uber and Grab a collective $9.5 million from what it deemed to be an “anti-competitive” merger deal while the Philippines followed suit with a far smaller $300,000 wrap on the knuckles.That shock to the system, coupled with a consumer backlash around more limited choice and a bodged effort to revamp Grab’s loyalty program, has seen Grab admit for the first time that it needs to rebuild ties. The MasterCard deal has the potential to be useful if executed right, but many Grab users will be looking for it to shore up on the basics, with complaints centered around issues like driver reliability and fair pricing.That’s right, in the absence of Uber, Grab is learning that it isn’t easy being the top dog. But that status does give it the potential to work on major new products and with huge partners like MasterCard. A deal like this was unthinkable when Grab was the scrappy underdog, but now it’s a company that raises billions on a regular basis and is a category leader."}