{"id": "GM is going to allow Ford vehicles and other competitors on its Maven car-sharing platform", "paragraph": "GM’s car-sharing subsidiary Maven  is undergoing another expansion. This time, it’s not just to a new city.Maven plans to open up its new peer-to-peer car rental service to allow owners to rent out non-GM vehicles.It is also setting its sights on bigger changes in the future, according to Julia Steyn, vice president of GM Urban Mobility and Maven, said Monday during a presentation at the UBS Global Technology Conference in San Francisco.By mid-2019, Maven will allow non-GM branded vehicles on the platform, Steyn said. That means a Maven member with a Tesla Model S or a Ford F-150 will be able to rent their vehicle out via the peer-to-peer car-sharing platform.Steyn said Maven plans to open up the platform to micro-fleet entrepreneurs and add more services and expand its geographic footprint, including in Canada and other international markets.Maven, which launched in January 2016 and has undergone a number of changes in its two-and-a-half years of existence. The mobility division initially launched as a car-sharing service akin to Zipcar. The company owns a fleet of GM vehicles and developed an app that lets customers rent the cars when they want and for short periods of time. In 2017, the company launched Maven Reserve in Los Angeles and San Francisco to allow customers to rent its GM-branded vehicles for a month at a time. It also has a program called Maven Gig that rents out vehicles to rideshare and delivery drivers who use apps like Instacart, Uber, Lyft and UberEATS.Earlier this year, Maven launched a peer-to-peer car rental service, which operates similarly to how Turo and Getaround work, in Chicago, Detroit and Ann Arbor, Mich. At the time of the launch, the program only allowed owners to rent out their personal Chevrolet, Buick, GMC or Cadillac cars or trucks. To qualify, the vehicles have to be a GM model year 2015 and newer.Unlike competitors, Maven is maintaining this dual car-sharing approach. It will continue to offer its own fleet of GM-branded cars for rent on the platform and expand the peer-to-peer option to more cities. In short, Maven, which has 170,000 members, is using the peer-to-peer car-sharing option to diversify its supply and to expand its market reach.“Cars is where our heritage is, but I’ll tell you where else it’s going to go, Steyn said, before noting that there are a lot of assets out their such as boats that are under-utilized and could be monetized on a platform like Maven.“If, at some point, there’s a UFO that you want shared and you want to be on the platform and it’s going to do a job for somebody, we’ll be able to put it on the platform,” Steyn said, emphasizing the flexibility of the Maven."}