{"id": "Zuckerberg says the future is sharing via 100B messages & 1B Stories/day", "paragraph": "The News Feed won’t sustain Facebook  forever, and that’s scaring investors. Today on Facebook’s earnings call, Mark Zuckerberg stressed that sharing is shifting to private chat, where people send 100 billion messages per day on Facebook’s family of apps, and Stories, where he says people share 1 billion of these slideshows per day (though it’s unclear if that includes third-party apps like Snapchat).But that means Facebook will have to realign its business towards these mediums where monetization is more complex and it has less experience. The result of Zuckerberg’s comments was a reversal of Facebook’s initial 2 percent share price gain after earnings were announced that dragged it down to a 3.5 percent loss. That was only reversed when Zuckerberg said Facebook would reduce limits on video advertising, pushing shares up 3 percent in after-hours trading. Facebook’s year-over-year revenue growth has already slowed from 59 percent in Q3 2016, to 49 percent a year ago, to 33 percent now as Zuckerberg admits it’s hitting saturation in developed markets, plus it’s running out of News Feed space. Now it will both have to deal with the sharing medium shift, and that the new users it’s adding in the Asia-Pacific and Rest Of World regions earn it 10X less than users in North America.Facebook shares climb despite Q3 user growth and revenueIn messaging, Zuckerberg says “People share more photos, videos, and links on WhatsApp and Messenger than they do on social networks.” He sees Facebook’s position as strong, saying “We’re leading in most countries”, though that’s mostly in the developing world Android market where people choose their own default messaging app. “Our biggest competitor by far is iMessage. In important countries like the US where the iPhone is strong, Apple bundles iMessage as the default texting app, and it’s still ahead” Zuckerberg notes.The “bundled” language harkens back to antitrust lawsuits against Microsoft for bundling computers with Internet Explorer. With Apple CEO Tim Cook constantly harping on the poor privacy practices of ad-supported companies like Facebook, Zuckerberg might be gunning to draw regulator attention to iMessage.Facebook is starting to more aggressively monetize Messenger through inbox ads, and its now selling enterprise tools to brands on both Facebook and WhatsApp  that let them pay to ping users. But Facebook risks its chat apps seeming annoying or intrusive if it packs in too many ads or allows too much Message spam. Users could stray to status quos like iMessage and Android Messages if it puts monetization above the user experience.On Stories, Zuckerberg says Facebook is doing even better. Over 1 billion people use its Stories features across Facebook, Messenger, Instagram,  and WhatsApp each day, compared to 186 million daily users on Stories inventor Snapchat as a whole. Stories are where the majority of Facebook sharing growth is happening, and Facebook Stories are gaining momentum after a slow and buggy start. That’s why Zuckerberg never mentioned Snapchat, and instead talk about YouTube as its primary competitor in video.The problem is that creating attractive video ads, especially vertical full-screen ones for Stories, is beyond the capability of the long-tail on small businesses that have fueled Facebook’s News Feed ad revenue. Users often rapidly skip through Stories ads, and Facebook currently doesn’t offer unskippable ones like Snapchat. Many people don’t think to tap or swipe up to visit a link from a Story, or simply don’t want to lose their place in ways that didn’t happen on desktop or even mobile feed ads.Beyond Stories, Facebook salvaged its after-hours share price by discussing how it plans to show more video, and therefore more of its lucrative video ads. Back in January, Facebook admitted its Q4 user count had declined and revenue might stumble in part because it had decided to show people fewer viral videos that they watch passively. This came as part of its drive for Time Well Spent. But now, Zuckerberg says that Facebook has cracked the code for how to make passive video consumption a positive experience, so Facebook will lift some limits:“People really want to watch a lot of video. To a large degree we’ve had to rate limit its growth, and we need to do the things so we can stop limiting it. The things that have caused us to limit it are on the one hand, when we see passive consumption of video displacing social interactions . . . We needed to figure out a way that video can grow but people can also keep on interacting and doing what they tell us that they uniquely want from Facebook. And now I think we’re starting to work through what the formula is going to be so we can take some of those rate limits off and let video grow at the rate that it wants to. I feel that that’s a very exciting opportunity ahead.”Even more video creates new problems, though. Zuckerberg says that per minute, it monetizes less than other features. Just think, you could browse across multiple News Feed ads in 90 seconds while Facebook would only serve you one mid-roll video ad during that time. Still, Zuckerberg believes that video is the future (even after all the hubbub about Facebook’s misleading metrics headfaking news publishers into pivoting to video and then laying off staffers)Across Facebook’s other products, Zuckerberg noted that 800 million people now use Marketplace, its Jobs feature have helped people find 1 million jobs, and its birthday fundraisers have raised $300 million alone this year. But it will be teaching advertisers how to effectively create sponsored messages and Stories ads that will define whether Facebook’s revenue keeps growing.Facebook shares climb despite Q3 user growth and revenue"}