{"id": "WhatsApp could wreck Snapchat again by copying ephemeral messaging", "paragraph": "WhatsApp  already ruined Snapchat’s growth once. WhatsApp Status, its clone of Snapchat Stories, now has 450 million daily active users compared to Snapchat’s 188 million. That’s despite its 24-hour disappearing slideshows missing tons of features, including augmented reality selfie masks, animated GIFs, or personalized avatars like Bitmoji. A good-enough version of Stories conveniently baked into the messaging app beloved in the developing world where Snapchat hasn’t proved massively successful. Snapchat actually lost total daily users in Q2 and Q3 2018, and even lost Rest Of World daily users in Q2 despite that being where late-stage social networks rely on for growth.That’s why it’s so surprising that WhatsApp hasn’t already copied the other big Snapchat feature, ephemeral messaging. When chats can disappear, people feel free to be themselves — more silly, more vulnerable, more expressive. For teens who’ve purposefully turned away from the permanence of the Facebook profile timeline, there’s a sense of freedom in ephemerality. You don’t have to worry about old stuff coming back to haunt or embarrass you. Snapchat rode this idea to become a cultural staple for the younger generation.Yet right now WhatsApp only lets you send permanent photos, videos, and texts. There is an Unsend option, but it only works for an hour after a message is sent. That’s far from the default ephemerality of Snapchat where seen messages disappear once you close the chat window unless you purposefully tap to save them.Instagram has arrived at a decent compromise. You can send both permanent and temporary photos and videos. Text messages are permanent by default, but you can unsend even old ones. The result is the flexibility to both chat through expiring photos and off-the-cuff messages knowing they will or can disappear, while also being able to have reliable, utilitarian chats and privately share photos for posterity without the fear that one wrong tap could erase them. When Instagram  Direct added ephemeral messaging, it saw a growth spurt to over 375 million monthly users as of April 2017.Snapchat lost daily active users the past two quartersWhatsApp should be able to build this pretty easily. Add a timer option when people send media so photos or videos can disappear after 10 seconds, a minute, an hour, or a day. Let people add a similar timer to specific messages they send, or set a per chat thread default for how long your messages last similar to fellow encrypted messaging app Signal.Snap CEO Evan Spiegel’s memo leaked by Cheddar’s Alex Heath indicates that he views chats with close friends as the linchpin of his app that was hampered by this year’s disastrous redesign. He constantly refers to Snapchat as the fastest way to communicate. That might be true for images but not necessarily text, as BTIG’s Rich Greenfield points out, citing how expiring text can cause conversations to break down. It’s likely that Snapchat will double down on messaging now that Stories has been copied to death.Given its interest in onboarding older users, that might mean making texts easier to keep permanent or at least lengthening how long they last before they disappear. And with its upcoming Project Mushroom re-engineering of the Snapchat app so it works better in developing markets, Snap will increasingly try to become WhatsApp.…Unless WhatsApp can become Snapchat first. Spiegel proved people want the flexibility of temporary messaging. Who cares who invented something if it can be brought to more people to deliver more joy? WhatsApp should swallow its pride and embrace the ephemeral."}