{"id": "The Criterion Collection is launching its own streaming service", "paragraph": "When WarnerMedia announced last month that it would be shutting down its streaming service FilmStruck, the team at the Criterion Collection said it would be looking for a new digital home. Today, Criterion announced that it will be building that home itself — namely, launching a streaming service called The Criterion Channel.The company remains best known for its beautifully restored and packaged DVDs and Blu-rays of classic art-house films, but it’s also moved into streaming, first by offering selections from its film library on Hulu, and then by creating its own channel within the larger FilmStruck service.In a blog post, Criterion described The Criterion Channel as “picking up where the old service left off, programming director spotlights and actor retrospectives featuring major Hollywood and international classics and hard-to-find discoveries from around the world, complete with special features like commentaries, behind-the-scenes footage, and original documentaries.”The plan is to launch in the spring of 2019, at a price of $10.99 per month or $100 per year. However, Criterion is already looking for “charter subscribers” to sign up now — in exchange for supporting Criterion (and presumably offsetting the technical costs), those subscribers will get a discounted rate and other perks.“We need everyone who was a FilmStruck subscriber or who’s been tweeting and signing petitions and writing letters to come out and to sign up for the new service,” the company says.As for FilmStruck, a number of high-profile filmmakers have reportedly reached out to Warner Bros. executives in the hopes of saving the service. It sounds, however, like WarnerMedia already has plans for a more comprehensive service that will encompass aspects of FilmStruck — in fact, Criterion says its library will also be available on the WarnerMedia service when it launches."}