{"id": "Tim Berners-Lee on the huge sociotechnical design challenge", "paragraph": "In a speech discussing ethics and the Internet, the inventor of the World Wide Web, Sir Tim Berners-Lee, has tasked the technology industry and its coder army with paying continuous attention to the world their software is consuming as they go about connecting humanity through technology.Coding must mean consciously grappling with ethical choices in addition to architecting systems that respect core human rights like privacy, he suggested.“Ethics, like technology, is design,” he told delegates at the 40th International Conference of Data Protection and Privacy Commissioners (ICDPPC) which is taking place in Brussels this week.“As we’re designing the system, we’re designing society. Ethical rules that we choose to put in that design [impact the society]… Nothing is self evident. Everything has to be put out there as something that we think we will be a good idea as a component of our society.”If your tech philosophy is the equivalent of ‘move fast and break things’ it’s a failure of both imagination and innovation to not also keep rethinking policies and terms of service — “to a certain extent from scratch” — to account for fresh social impacts, he argued in the speech.He pointed to how Wikipedia had to rapidly adapt its policies after putting online the power for anyone to edit its encyclopedia, noting: “They introduced a whole lot of bureaucracy around it but that actually makes it work, and it ended up be coming very functional.”He described today’s digital platforms as “sociotechnical systems” — meaning “it’s not just about the technology when you click on the link it is about the motivation someone has to make such a great thing because then they are read and the excitement they get just knowing that other people are reading the things that they have written”.“We must consciously decide on both of these, both the social side and the technical side,” he said. “[These platforms are] anthropogenic, made by people… Facebook  and Twitter  are anthropogenic. They’re made by people. They’ve coded by people. And the people who code them are constantly trying to figure out how to make them better.”His keynote touched on the Cambridge Analytica data misuse scandal as an illustration of how sociotechnical systems are exploding simple notions of individual rights as people’s data is being cumulatively pooled and linked so that it can be repurposed and used to manipulate entire groups and even societies as a whole.“You data is being taken and mixed with that of millions of other people, billions of other people in fact, and then used to manipulate everybody.“Privacy is not just about not wanting your own data to be exposed — it’s not just not wanting the pictures you took of yourself to be distributed publicly. But that is important too.”Given how the Internet’s ballooning connectivity has swept up and swept along personal data, enabling it to flow and pool far from the individuals who generated it in the first place, Berners-Lee also impressed the need for web users to have “the right to be able to share my data with whoever I want”.And “the right to be able to get at all my data” — praising recent data download efforts from Apple, Twitter and others that let people take their information elsewhere, and lauding the companies for “recognizing that my data is mine to control”.He also touched on his new startup: Solid, which is on a mission to push the envelope of interoperability, via decentralization, in order to transform how people control and share their own data.Tim Berners-Lee is on a mission to decentralize the web“The principle of Solid is it’s a new platform in which you as a user have complete control of your data,” he explained. “It is revolutionary in the sense that it makes any app ask you where you want to put your data. So you can run your photo app or take pictures on your phone and say I want to store them on Dropbox, and I will store them on my own home computer. And it does this with a new technology which provides interoperability between any app and any store.”Free speech and fighting censorship are other causes helped by putting people in control of their own data, he argued.“We are not ready for people to use this at home,” he said of Solid. “We are ready for developers to join us in the quest to make new apps, and to make our service more powerful and more secure.“The platform turns the privacy world upside down — or, I should say, it turns the privacy world right side up. You are in control of you data life… Wherever you store it you can control and get access to it.”On the wider societal challenges, as regulators are paying increasing attention to powerful tech platforms, Berners-Lee added: “We have to get commitments from companies to make their platforms constructive and we have to get commitments from governments to look at whenever they see that a new technology allows people to be taken advantage of, allows a new form of crime to get onto it by producing new forms of the law. And to make sure that the policies that they do are thought about in respect to every new technology as they come out.“We’ve got a lot of work to do, and a lot of discussion — across the boundaries of individuals, companies and governments. But very important work.”"}