{"id": "Tinder rolls out expanded set of gender options in India", "paragraph": "Tinder  is rolling out more gender options in its app in India. The company has announced that users will be able to edit their profiles in order to choose a different option for their gender identity, instead of just “Man” or “Woman,” as well as toggle a setting that will display their gender on their profile in the app.These same options have been live in the U.S. since November 2016, when the dating app added options for transgender and gender non-conforming people.The news was published earlier to Tinder’s blog ahead of a planned announcement, a spokesperson said. (Update: that post is now live).In the post, the company admits it hasn’t always “had the right tools” to serve its community in the past, and is now trying to learn to be a better ally to transgender and gender non-conforming people using its app. On this front, Tinder says it’s expanding its support team and educating its staff about the issues that these communities face in India. Additionally, the company is opening up its support channels and inviting back users who were banned after being unfairly reported by others due to their gender. Tinder users will be able to email the company with a link to their Facebook profile in order to have their request reviewed by Tinder’s team, in order to be let back in. To what extent banned users will want to return, of course, is less clear at this point.Tinder has not fared well with the trans community in particular, as some users in the past have been banned from the app even when using the identifiers for trans people and displaying this on their profile.For the U.S. launch of the expanded gender options, Tinder had worked with organizations like GLAAD, activists and others.In India, it worked with users and consultants, including an LGBTQ organization working for the health and human rights of the LGBTQ community since 1994, The Humsafar Trust, as well as LGBTQ author and inclusion advocate, Parmesh Shahani.The post also pointed users to Umang, a Mumbai-based support group run by The Humsafar Trust, which offers mental health counseling, legal support, community support and events. And it linked to the clinical and counseling unit of The Humsafar Trust.The group also runs a helpline Monday through Friday, 10 AM to 8:30 PM at +91 9930095856, and is available on WhatsApp.“Every new person in your life expands your horizons in some way. Inclusion and acceptance drive this expansion, and we want Tinder to reflect the world that surrounds us every day. No one will ever be banned from Tinder because of their gender,” said Tinder.The move is notable not just because of the arrival of these important and inclusive features, but because of how critical the Indian market is for dating apps. So far, it seems straight Indian men have been flocking to Tinder and other apps in large numbers, but they’ve had trouble diversifying their user base. To address this problem, Tinder and others have focused efforts on recruiting the millions of young, educated India-based users who have left home to go live and work in cities.Tinder – like all major tech companies – sees India as a key market, because of the rapid smartphone adoption and the population size. It even launched its Bumble-inspired “My Move” feature there first, back in September.Bumble, meanwhile, has its sights on India as well, having said it plans to be in the market in full force by year-end."}