{"id": "Kairos founder countersues his own company for $10 million", "paragraph": "The turmoil continues at facial recognition startup Kairos. Last night, Kairos  founder Brian Brackeen filed a counter lawsuit against Kairos and its interim CEO Melissa Doval that seeks $10 million in damages.Kairos is a facial recognition startup that has become well-known for its stance to never sell to law enforcement. At Disrupt SF 2018, Brackeen showed his technology and spoke on a panel about the hazards of facial recognition and algorithmic bias.This countersuit comes after Kairos terminated Brackeen from his role as chief executive officer, citing Brackeen misled shareholders and potential investors, misappropriated corporate funds, did not report to the board of directors and created a divisive atmosphere. Kairos followed that up with a lawsuit, alleging theft and breach of fiduciary duties — among other things.In a countersuit, Brackeen now “seeks to hold Kairos and Doval accountable for intentionally destroying his reputation and livelihood through fraudulent conduct, the publication of malicious falsehoods, and the commission of illegal corporate acts.” The suit also alleges Kairos refused to pay him the compensation to which he was entitled.In one example, Brackeen alleges Kairos, under the leadership of board chairperson Stephen O’Hara, did not pay him a salary for 34 weeks in order for Kairos to have a better cash flow.“We’ve come to expect this behavior on his behalf,” Doval said in an email to TechCrunch. “We stand firmly with our original complaint and the courts will rule in our favor once they are presented with the evidence for the case. Our fiduciary duty is to our stakeholders, and we remain dedicated to doing right by them.”The lawsuit alleges O’Hara also did not share Brackeen’s commitment to ensuring Kairos’ technology did not contribute to racial bias and other social injustices. It also alleges O’Hara pressured Brackeen to retract his promise to never sell the technology to law enforcement. That clash, the lawsuit alleges, resulted in O’Hara seeking to push Brackeen out of the company. O’Hara, in an email to TechCrunch, denies those claims.“Of note, as far as I know as chairman of the board, we are not trying to sell this to law enforcement and have no plans to do so until such time we can insure [sic] any biases of facial recognition are solved and all privacy issues addressed,” O’Hara wrote. “Frankly, we are focused on much more attractive opportunities now.”In the coming weeks, Kairos will hold a meeting of the shareholders, where Brackeen hopes they will vote to remove the board and reinstate him as CEO. That meeting was supposed to happen last week, but has since been rescheduled. Brackeen says he’s currently trying to get enough shareholders on his side to force a vote. In the last week, however, the company presented an offering to shareholders that was fully subscribed.“Meanwhile, thanks to a vote of support from all classes of shareholders this past week, Kairos under Melissa Doval is focused on building its business behind its new on-premise product,” O’Hara wrote. In a follow-up email, O’Hara said, “Shareholders voted to approve the Rights offering which was fully subscribed, and included ratification of the Board and Ms. Doval.”That offering valued the company at $1.5 million — a significant drop from Kairos’ previous $120 million valuation. That means shareholders were able to purchase 43,366,780 shares at a price of just $0.01153 per share.“Though the emergency nature of this offering and the Company’s precarious financial position have led the Company to offer common stock in this offering at a price well below that received in prior fundraising transactions, the structure of the offering as a rights offering to all existing investors in the Company will allow the Company to raise needed capital without subjecting participating investors to dilution of their ownership stakes in the Company,” the memo, obtained by TechCrunch, states.One of the conditions of that offering is to reconstitute the Kairos board of directors as a three-person board that consists of O’Hara, Kairos Director Mike Gardner and Doval.The point of this offering is to raise $500,019 in “emergency capital” to be able to pay its employees and continue operating into 2019. As O’Hara noted, the offering was fully subscribed.Thanks to this current legal situation, which Brackeen refers to as a “cram down,” his ownership in the company has decreased by 90 percent, which “shows a disrespect for founders.”Kairos is pretty cash-strapped right now. Even with the emergency capital in place, Kairos is only set up to be able to operate through Q1 2019, “by the end of which management believes that revenue growth through sales either will enable the Company to become financially self-sustaining or will place the Company on a more sound financial footing that allows it to conduct further capital-raising,” the memo states.Meanwhile, however, Brackeen says he has been able to raise $3.5 million in venture funding, and is targeting a total of $5 million. This funding, he hopes, will be successful in convincing shareholders to vote to replace the board. Brackeen raised this funding from Beyond Capital Markets, an impact investment fund. Though, that money is contingent upon Brackeen rejoining the company as CEO and the board resigns.But convincing BCM to invest given the current state of Kairos was quite the feat, Brackeen said.“It’s like riding a bike backwards with one arm — and blind,” he told me.The lesson for founders, Brackeen told me, is “when you’re taking those first investments and you’re really excited, you need to have callouts for the founder versus the current CEO.”He added that “angel groups shouldn’t have that kind of power too late in a company’s lifecycle.” Additionally, once founders are starting to raise a Series A, “you need to make sure your lawyers are not meeting them halfway on docs and not necessarily playing nice.”"}