{"id": "PlayStation Vue is first US pay TV provider to integrate with Apple’s TV app", "paragraph": "Sony’s  live TV streaming service, PlayStation Vue, announced this week it has become the first U.S. pay TV provider to integrate with Apple’s TV app in order to display content*. Until now, Apple’s  TV app has featured content from both free and paid on-demand streaming apps like Hulu, Prime Video, HBO NOW, PBS Kids, The CW and others, along with those that require you log in with your pay TV credentials, like ABC, AMC, USA, SYFY, Showtime Anytime and many more.With the new PlayStation Vue integration, subscribers to Sony’s  pay TV service will be able to access all of Vue’s on-demand content across its nationally available channels in the Apple  TV app’s Watch Now and Up Next sections.Live sports, including both national and regional sports networks, will be supported, too, Sony says.Explains the company, users will be able to search and browse the PS Vue catalog in the TV app, taking advantage of the TV app features like “Watch Now” and “Up Next” to organize their shows, movies and sports. When you find content you want to watch, it will open the stream right in the PS Vue app.This integration will matter more to those who already subscribe to at least a couple of other streaming services in addition to PS Vue, as the TV app is designed to aggregate content and recommendations from across services in a single place. It works on iOS devices, including iPhone and iPad, and on Apple TV.PS Vue is one of now several pay TV streaming services, and a rival to YouTube TV, Hulu with Live TV, Sling TV, AT&T’s DirecTV Now and WatchTV. But it’s been lagging behind on subscribers.Dish’s Sling TV and DirecTV Now lead the space, thanks to Sling’s early mover advantage and DirecTV Now’s distribution through AT&T’s wireless business. The former had 2.3 million subscribers as of June, while AT&T said DirecTV Now had 1.8 million, as of its earnings report in July. Hulu with Live TV cracked a million subscribers in September, ahead of YouTube TV.Welcome to the Apple TV app, @PlayStation Vue. 🎉With a seamless experience and features like Watch Now and Up Next, you will never miss an episode or live game.https://t.co/GckxcyRawF pic.twitter.com/LJaVLAoN5q— Apple TV (@AppleTV) October 18, 2018Sony’s PlayStation Vue, meanwhile is just somewhere over half a million. It may have struggled to grow due to its branding, which seems to imply it’s only for PlayStation owners. (It’s not).Perhaps the company is hoping the closer ties with Apple’s TV app will give its service more visibility.The integration also arrives just ahead the launch of Apple’s own original content, which could bring more people back to the Apple TV app, further boosting PS Vue’s visibility.Some PS Vue users noticed the new functionality a week or so ago, but Sony only officially announced the news on Thursday.How PS Vue integration is different After publication, there was some confusion from readers about what the PS Vue integration looked like, and how it was different from integrating another pay TV provider with the TV app. This section has been added for clarity. We’ve confirmed with Apple that PS Vue is the first pay TV provider that’s integrated in the TV app for both VOD and live sports content.This is not the same integration as offered by the existing ability to connect a TV provider with Apple’s TV app. Today, many pay TV services – like cable and satellite providers – as well as live TV streaming services, like DirecTV Now and YouTube TV, are available from the “TV provider” single sign-on setting.When a TV provider is connected, the TV provider settings page will then show you the “available apps” that work with that provider. These the “TV Everywhere”-enabled applications  – meaning, apps that require a pay TV login for authentication. You pick which ones you’d like to install from the list.The content from those apps is then surfaced in the TV app in various ways. For instance, the Watch Now section shows you what’s available to watch across services by way of Apple’s editorial recommendations and a look at what’s trending across movies, sports, and TV. Currently, there are over 80 video apps that feed into Watch Now, including those you have the right to access after entering in your “TV provider” credentials, as well as on-demand apps.However, other pay TV services, including YouTube TV or DirecTV Now, are not integrated in the same way as PS Vue is now, Apple says.With the new PS Vue integration, you’ll see both its video-on-demand content and live sports in the TV app’s Watch Now and Up Next sections. Below are some examples of what that looks like.When you see live programming in Watch Now, you can actually tap to start watching them right in the PS Vue app itself, not just in the “TV Everywhere”-enabled app.This is where the integration shines. The Sports tab in the TV app shows you every live and upcoming game across all of the available services.Participating apps in the Sports tab today include ESPN / ESPN+, Prime Video, CBS, NBC Sports, FOX NOW, TBS, TNT, NBA, MLB At Bat, DAZN, March Madness Live, and, now, PlayStation Vue.PS Vue’s live sports integration in the TV app means you can track and watch live games from national and regional sports networks available through PS Vue, organized alongside the on-demand shows and movies you’re watching.In the Sports tab, fans can favorite teams, so their games will be added to Up Next and you’ll receive a notification on iPhone, iPad, Apple TV and Apple Watch when games are starting. Fans can also receive notifications when an exciting game is happening.The PS Vue integration is live now in the U.S.(image credits – iPhone screenshots: TechCrunch; Apple TV: Apple)"}