{"id": "Voting is a social experience", "paragraph": "If your Instagram followers aren’t aware that you’ve voted, did you really even vote?In 2018, the act of voting is great social media fodder. People want their friends to know they’ve registered to vote, or that they’ve just mailed in their absentee ballot or even that they’ve bought some sort of “look, I voted” t-shirt. These announcements are being shared across social platforms like it’s a required part of the voting process.Whether or not those people only voted for the likes doesn’t really matter, the important thing is that they voted. Social media, because of the unprecedented access it grants people to the lives of their peers and influencers, is an effective strategy of pushing eligible voters to the polls. Why? Because people care about their friends and often even more about what their friends think of them. No one wants to be that friend that didn’t vote.Vote.org and Outvote, a texting app for political campaigns, have taken note. The nonprofit platform for voter registration, information and advocacy has teamed up with the Y Combinator graduate to launch a new nonpartisan social media app that syncs with a user’s address book to help them quickly and efficiently remind their friends to check their registration status, find their polling place location and vote.According to Outvote’s research, one text message from a known contact made people 10 percent more likely to vote versus 8 percent from a typical conversation with a political canvasser. Using the app, you can essentially perform 2 hours of canvassing in 5 minutes, from the comfort of your own bed.“This November, reminding your friends is your new civic duty,” Outvote co-founder Naseem Makiya said in a statement. Outvote’s flagship app is tailored for Democrats and is meant to inspire and personalize grassroots-style campaigning. Using that app, you can send messages to your friends using Facebook Messenger, too, though the app doesn’t sync with any contacts outside of your phone’s address book. In addition to YC backing, Outvote has raised $300,000 in seed funding. The startup was founded by Makiya, formerly of startups Moovweb and DataCamp, as well as Nadeem Mazen, the former chief executive officer of a creative agency called Nimblebot.  Something I wish I knew about when I was 18 and voting for the first time: ✨EARLY VOTING✨. It makes it so quick and easy to go and cast your vote before November 6. Early voting starts TODAY in Tennessee and goes to Nov 1 🇺🇸 You can check out your state’s early voting dates at the link in my bioA post shared by  Taylor Swift (@taylorswift) on Oct 17, 2018 at 6:02am PDTAxios reported earlier today that while TV and email campaigns are still used by political campaigns, text messaging has proven to be a whole lot more successful. Per Opn Sesame, 90 percent of text messages are read within 5 minutes: “That intimate delivery, and the ability to target and personalize messages, is what makes them so effective for campaigns — but also annoying for many voters who didn’t sign up for them,” Axios’ Kim Hart wrote.Social media companies, other avenues for targeted and personalized messaging, have stepped up their voter education efforts ahead of the midterm elections.Snap announced yesterday that after adding a vote button to its app, more than 400,000 of its users registered to vote via TurboVote. Meanwhile, Facebook and Twitter have added small reminders to their feeds, as have Reddit, Tinder, Bumble, Lyft and several other big tech companies.Instagram, for its part, has Taylor Swift. Her recent social media campaign, beginning with a post earlier this month prodding her fans to vote, caused a big spike in voter registrations. According to Vote.org, 65,000 people registered to vote in the 24-hour period that followed her first-ever politically fueled gram.Since then, Swift has been sharing on her Instagram story images of her fans who voted. It’s her reward to those who followed her advice to express their political opinions. So vote, and you may be featured on a pop star’s Instagram. That’s 2018 for you.Outvote hopes to flip elections by getting Democrats to text their friends"}