{"id": "Can Apple finish 2018 on a high note? We’ll find out Thursday", "paragraph": "Apple (NASDAQ: APPL) has had a great 2018.Even as the other FAANG stocks slumped, the trillion-dollar electronics company has continually satisfied Wall Street with quarter-over-quarter revenue growth. But will Apple’s momentum continue after it reports its fourth-quarter earnings on Thursday?The consensus, so far, is yes. Apple  is expected to post revenue of $61.43 billion (earnings per share of $2.78), an increase of 17 percent year-over-year and GAAP EPS of $2.78, according to analysts polled by FactSet. Investors will be paying close attention to iPhone unit sales, which account for the majority of Apple’s revenue, as well as Mac sales, which accounted for roughly 10 percent of the company’s revenue in Q3.The company reported its Q3 earnings on July 31, posting $53.3 billion in revenue, its best June quarter ever and fourth consecutive quarter of double-digit revenue growth, the company said.At today’s hardware event in Brooklyn, Apple’s chief executive officer Tim Cook shared that the company’s Mac business had grown to 100 million monthly active users — a big accomplishment for the nearly 10-year-old product. Cook also showcased the new MacBook Air and introduced the new iPad Pro and Mac Mini.Not even Lana Del Rey’s surprise performance at the event was enough to rile up Wall Street. Apple’s stock was unreactive today, as is typically the case with hardware spectacles like these. Apple ultimately closed up about .5 percent. That’s a better outcome than its last hardware event in September, which despite the highly anticipated announcements of the iPhone XS and Apple Watch Series 4, forced the company’s stock down about 1.2 percent on the news.Apple’s stock performance year to dateYear to date, Apple’s stock has risen more than 30 percent from a February low of $155 per share to an October high of $229.If it fails to meet analyst expectations on Thursday, it’s bad news for the stock market: “Apple is the last domino standing,” Market Watch wrote earlier today. “Its FAANG brethren have all crashed, even the mighty Amazon, which has slumped about 25% from all-time highs.”If you missed today’s event, we live-blogged the whole thing here and detailed all the new hardware here."}