{"id": "Tesla has opened up Model 3 orders to customers in China", "paragraph": "Tesla  is now taking orders for the Model 3 from customers in China, according to its website.Reuters was the first to report that Tesla is taking orders in China.Tesla won’t confirm or comment on the information published on its own China-focused website. Tesla CEO Elon Musk did say in a tweet Thursday that some deliveries to customers in China will probably begin in March, but “April is more certain.”Probably some deliveries in March, but April is more certain— Elon Musk  (@elonmusk) November 15, 2018Customers must place a deposit of 8,000 yuan, or about $1,153, to begin their booking, according to materials on Tesla’s China website. They are eventually invited to configure the car to their liking (items such as paint color and other features). Once they complete the car purchase agreement, the remaining amount is due. It appears, based on the FAQs section, that Tesla will make most of the options (including the Performance variant) that are available in the U.S. accessible to Chinese customers, as well. It’s unclear if the cheaper mid-range version of the Model 3 will be sold in China.Tesla has had mixed success in China, home of the world’s largest EV market. When Tesla first began delivering Model S vehicles to China in 2014, the company went on a hiring spree and eventually amassed a staff of 600 people. Tesla opened stores and service centers and erected fast-charging stations known as superchargers.Tesla sold an estimated 3,500 cars in 2014, below its sales goal and behind electric and plug-in hybrid vehicles produced by Chinese rivals BYD and BAIC. Those sales continued to lag in the beginning of 2015. Tesla pulled off a turnaround in China by 2016, tripling its sales over the previous year, and extended gains into 2017.Now, it’s facing new headwinds thanks to pressure from new tariffs.Last month, Tesla announced plans to speed up construction of a factory in Shanghai as tariffs, shipping costs and missed incentives continue to drive up the price of the company’s electric vehicles and dampen demand.Trade tensions between the U.S. and China have led to 40 percent tariffs on Tesla vehicles compared to 15 percent duties placed on imported autos from other countries. The tariffs, combined with the cost of shipping its vehicles via ocean carrier and the lack of access to cash incentives that are available to locally produced electric vehicles, has put the company at a disadvantage, the company warned at the time.As a result, Tesla said it’s now operating at a 55 percent to 60 percent cost disadvantage compared to the exact same car locally produced in China."}