{"id": "China’s hottest news app Jinri Toutiao announces new CEO", "paragraph": "You may not have heard of ByteDance,  but you probably know its red-hot video app TikTok, which gobbled up Musical.ly in August. The Beijing-based company also runs a popular news aggregator called Jinri Toutiao, which means “today’s headlines” in Chinese, and the app just assigned a new CEO.At a company event on Saturday, Chen Lin, an early ByteDance  employee, made his first appearance as Toutiao’s new CEO. That means Toutiao’s  creator Zhang Yiming has handed the helm to Chen, who previously headed product management for the news app.Zhang’s not going anywhere though. A company spokesperson told TechCrunch that he remains the CEO of ByteDance, which operates a slew of media apps besides TikTok  and Toutiao to lock horns with China’s tech giants Baidu, Alibaba, and Tencent.The story of ByteDance started when Zhang created Toutiao in 2012. The news app collects articles and videos from third-party providers and uses AI algorithms to personalize content for users. Toutiao flew off the shelves and soon went on to incubate new media products, including a Quora-like Q&A platform and TikTok, known as Douyin in China.The handover may signal a need for Zhang to step back from daily operations in his brainchild and oversee strategies for ByteDance, which has swollen into the world’s highest-valued startup. The company spokesperson did not provide further details on the reshuffle.Toutiao itself is installed on over 240 million monthly unique devices, which makes it a top news aggregator in China, according to data analytics firm iResearch. TikTok and Douyin collectively command 500 million monthly active users around the world, while Musical.ly has a userbase of 100 million, the company previously announced.Toutiao’s success has prompted Tencent, which is best known for creating WeChat  and controlling a large slice of China’s gaming market, to build its own AI-powered news app. Toutiao’s fledgling advertising business has also stepped on the toes of Baidu, which makes the bulk of its income from search ads. More recently, Toutiao muscled in on Alibaba’s territory with an e-commerce feature.At the Saturday event, Chen also shared updates that hint at Toutiao’s growing ambition. For one, the news goliath is working to help content providers cash in through a suite of tools, for instance, e-commerce sales and virtual gifts from live streaming. The move is poised to help Toutiao retain quality creators as the race to grab digital eyeball time intensifies in China.Toutiao also recently launched its first wave of “mini programs,” or stripped-down versions of native apps that operate inside super apps like Toutiao. Tencent has proven the system to be a big traffic driver after WeChat mini programs crossed two million daily users.Lastly, Toutiao said it will take more proactive measures to monitor what users consume. In recent months, the news app has run afoul of media regulators who slashed it for hosting illegal and “inappropriate” content. Douyin has faced similar criticisms. While ByteDance prides itself on automated distribution, the company has demonstrated a willingness to abide with government rules by hiring thousands of human censors and using AI to filter content."}