{"id": "Watch BepiColombo’s twin spacecraft launch tonight on a mission to Mercury", "paragraph": "Update: BepiColombo launch successful! We should have confirmation that all is well soon.Liftoff of #Ariane5! #BepiColombo Watch live: https://t.co/JVwQjT07a5 pic.twitter.com/r6pauaoQpn— ESA  (@esa) October 20, 2018Humanity is about to return to the hottest planet in the solar system. BepiColombo is a mission to Mercury conducted jointly by the European and Japanese space agencies, due to launch from French Guiana at 6:45 PM Pacific time tonight aboard an Ariane 5 rocket. But while there’s just the one launch, there are two spacecraft.The broadcast starts at 6:15; you can watch the launch at this link or the bottom of this post.The last time we visited Mercury wasn’t actually that long ago. NASA’s Messenger mission arrived there in 2011 and spent four years orbiting the planet and collecting data before impacting the surface at nearly 9,000 MPH (don’t worry, they planned that).BepiColombo is a follow-up to Messenger in a way, but it’s very much its own thing. To start with, there’s the fact that it’s two spacecraft, not one. They’ll launch together and travel to the planet attached to each other and the Mercury Transfer Module, after which point they’ll separate into ESA’s Mercury Planetary Orbiter and JAXA’s Mercury Magnetospheric Orbiter (called MIO).Having two spacecraft opens up a lot of possibilities. One can emit a signal that bounces off the planet as it is picked up by the other, for instance. Or one can watch the shady side of the planet while the other monitors the sunny (and extremely hot) side.Speaking of heat, Mercury is of course the closest planet to the sun, so these spacecraft are going to be exposed to some serious radiation. The MPO will use a sun shield to keep the worst of the heat off, using a big radiator for the rest, and the MIO will spin as it travels along, doing a complete revolution every 4 seconds so that no one side is exposed to the sun for too long. Both craft also have highly heat-resistant materials and electronics, many of which are flying for the first time.MIO and MPO are equipped with a host of scientific instruments, and will be able to look more closely at features of phenomena identified by Messenger. The latter checked out the magnetosphere in the northern hemisphere of the planet, for instance, and BepiColombo will fill that in with readings from the southern one. Messenger also identified some interesting features around the poles, and MPO will have an orbit that takes it right over them — not to mention a better camera.In order to achieve a stable orbit around Mercury the craft will have to perform a few loops and gravity assists, including two of Venus. The team is taking the opportunity to point their instruments at our neighboring planet; we haven’t visited there in a long time.The mission isn’t expected to be a very long one — BepiColombo’s spacecraft will not only be exposed to serious radiation and temperature swings, but the proximity to the sun means they’ll constantly be fighting against its gravity, meaning fuel will run out fast.Still, MIO and MPO are expected to stay in orbit for about one Earth year, which would be four Mercurial years. If they’re still in good shape and there’s still budget for it, the mission could be extended for another year — but by that point it seems likely that fuel reserves will be running low.BepiColombo has been a long time in the making — it was approved 18 years ago! But it’s launching at last and when it arrives (in seven more years) we should expect to learn a lot more about this weird, boiling hot planet. You can watch the launch live here; broadcast should start at 6:15 Pacific time. "}