{"id": "Airbnb ends forced arbitration days after Google, Facebook did the same", "paragraph": "The Google employee walkout on Nov. 1 is leaving a lasting impact on the tech industry.In the immediate aftermath of the walkout, which saw thousands of Googlers  across the globe protest the company’s mishandling of sexual harassment and misconduct claims, the search giant said it would put an end to its policy of forced arbitration for employees claiming workplace harassment. Facebook followed suit, announcing the next day that it would allow its employees to pursue claims of sexual harassment in court.Today, Airbnb and eBay  confirmed to TechCrunch they too would no longer require sexual harassment claims to be settled through private arbitration. Their announcements follow a BuzzFeed News article exploring which tech companies were updating their policies in light of the Google protest.Thousands of Google employees protested the company’s handling of sexual harassment & misconduct allegations on Nov. 1.“We are a company who believes that in the 21st Century it is important to continually consider and reconsider the best ways to support our employees and strengthen our workplace,” a spokesperson for Airbnb said in a statement provided to TechCrunch. “From the beginning, we have sought to build a culture of integrity and respect, and today’s changes are just one more step to drive belonging and integrity in our workplace.”Here’s what eBay  had to say about its decision: “eBay takes great pride in fostering an inclusive culture that allows employees to feel comfortable and encouraged to report any workplace issues. We’ve adjusted our existing employee policy regarding sexual harassment claims to better reflect and encourage eBay’s values of being open, honest and direct.”According to BuzzFeed, Pinterest, Oath, Twitter, Reddit and others have never required mandatory arbitration. Uber, Lyft and Microsoft each put an end to forced arbitration in the last year.Arbitration is a private method of solving a dispute without a judge, jury or right to an appeal. Companies that require forced arbitration waive their employees’ rights to sue and to participate in a class-action lawsuit.Google walkout organizers aren’t satisfied with CEO’s responseThrowing out its policy of forced arbitration was one of the five demands disgruntled employees had for Google. In a Medium post last week, the walkout organizers commended Google’s decision to end forced arbitration while emphasizing the company’s failure to address all of their demands.…”The response ignored several of the core demands — like elevating the diversity officer and employee representation on the board — and troublingly erased those focused on racism, discrimination, and the structural inequity built into the modern day Jim Crow class system that separates ‘full time’ employees from contract workers. Contract workers make up more than half of Google’s workforce, and perform essential roles across the company, but receive few of the benefits associated with tech company employment. They are also largely people of color, immigrants, and people from working class backgrounds.”Google employees began crafting a plan for a company-wide walkout in late October, days after a bombshell New York Times investigation revealed Google had given Android co-creator Andy Rubin a $90 million exit package despite multiple relationships with other Google  staffers and accusations of sexual misconduct.Rubin, for his part, has said that the NYT’s story contained “numerous inaccuracies.”Google walkout organizer: ‘I hope I still have a career in Silicon Valley after this’"}