{"id": "Twitter’s U.S. midterms hub is a hot mess", "paragraph": "Today, Jack Dorsey  tweeted a link to his company’s latest gesture toward ongoing political relevance, a U.S. midterms news center collecting “the latest news and top commentary” on the country’s extraordinarily consequential upcoming election. If curated and filtered properly, that could be useful! Imagine. Unfortunately, rife with fake news, the tool is just another of Twitter’s small yet increasingly consequential disasters.The midterm elections right now #Midterms2018 https://t.co/7T2IojpxWw— jack (@jack) October 30, 2018Beyond a promotional tweet from Dorsey, Twitter’s  new offering is kind of buried — probably for the best. On desktop it’s a not particularly useful mash of national news reporters, local candidates and assorted unverifiable partisans. As Buzzfeed news details, the tool is swimming with conspiracy theories, including ones involving the migrant caravan. According to his social media posts, the Pittsburgh shooter was at least partially motivated by similar conspiracies, so this is not a good look to say the least.Why launch a tool like this before performing the most basic cursory scan for the kind of low-quality sources that already have your company in hot water? Why have your chief executive promote it? Why why whyA few hours after Dorsey’s tweet, likely after the prominent callout, the main feed looked a bit tamer than it did at first glance. Subpages for local races appear mostly populated by candidates themselves, while the national feed looks more like an algorithmically generated echo chamber version of my regular Twitter feed, with inexplicably generous helpings of MSNBC pundits and more lefty activists.For Twitter users already immersed in conspiracies, particularly those that incubate so successfully on the far right, does this feed offer yet another echo chamber disguised as a neutral news source? In spite of its sometimes dubiously left-leanings, my feed is still peppered with tweets from undercover video provocateur James O’Keefe — not exactly a high quality source.In May, Twitter announced that political candidates would get a special badge, making them stand out from other users and potential imposters. That was useful! Anything that helps Twitter function as a fast news source with light context is a positive step, but unfortunately we haven’t seen a whole lot in this direction.Social media companies need to stop launching additional amplification tools into the ominous void. No social tech company has yet exhibited a meaningful understanding of the systemic shifts that need to happen — possibly product-rending shifts — to dissuade bad actors and straight up disinformation from spreading like a back-to-school virus. Unfortunately, a week before the U.S. midterm elections, Twitter looks as disinterested as ever in the social disease wreaking havoc on its platform, even as users suffer its real-life consequences. Even more unfortunate for any members of its still dedicated, weary userbase, Twitter’s latest wholly avoidable minor catastrophe comes as a surprise to no one.Twitter suspends accounts linked to mail bomb suspect"}