{"id": "Female founders have brought in just 2.2% of US VC this year (yes, again)", "paragraph": "Despite efforts to level the playing field for female entrepreneurs, U.S. female-founded startups have raised just 2.2 percent of venture capital investment in 2018.That statistic may sound familiar; it’s the exact same portion of capital startups founded by a solo female founder or an all-female team secured last year, too, according to PitchBook.That figure has become a sort-of rallying cry for female founders and their advocates as they try to develop solutions to a long-standing problem: female entrepreneurs raise significantly less private capital than their male counterparts. Several new efforts and entire organizations, like All Raise, for example, have cropped up to ameliorate this through mentorship and programming, but it’s clearly going to take more than one year for that increase in resources to effect change.Currently, less than 10 percent of decision-makers at VC firms are women and 74 percent of U.S. VC firms have zero female investors. Until those numbers begin to transform, it’s likely little progress will be made on closing the funding gap.The good news is women have raised a record amount of VC this year with two months still remaining in 2018. In the last ten months, female-founded startups have closed 391 deals worth $2.3 billion, up from $2 billion in 2017. Mixed-gender teams have raised $13.2 billion this year across 1,346 deals, an increase from $12.7 billion last year.Venture capital investment in US companies to hit $100B in 2018For context, U.S. startups have raised a total of $96.7 billion in 2018, a number that’s expected to surpass $100 billion before the year is through. Female-founded companies have raised just 2.2 percent of that total; mixed-gender teams have raised about 12.8 percent, up from roughly 10.4 percent last year.Last year, U.S. startups raised a total of $82 billion across more than 9,000 deals in what was similarly an impressive year for the venture industry."}