{"id": "Early-stage SaaS VC slip snaps recovery as public software stocks soar", "paragraph": "A few months ago, Crunchbase  News reported that a longstanding period of SaaS investment stagnation had come to an end.However, the investment boom times didn’t necessarily carry over to the seed and early-stage end of the subscription software businesses.The chart below displays deal and dollar volume of seed and early-stage venture investments1 made into companies from around the world in Crunchbase’s SaaS category. Note that it is subject to historically documented reporting delays, which are most pronounced in seed and early-stage deals.As can be plainly seen that Q3 2018 took quite a turn in terms of investment into SaaS. And it’s a bit bewildering as to why.Overall, the venture market in Q3 hit record heights, and nearly every stage of investment saw more dollars and more rounds. Yet, as shown above, SaaS startups don’t appear to be beneficiaries of this influx of cash.The picture becomes even more distorted when we account for public market SaaS comps, which set the benchmark for private companies. And that benchmark hasn’t been suffering. Public cloud companies have enjoyed a steep run up in asset value over the past several years.The newly revamped BVP Nasdaq Emerging Cloud Index (formerly known as the Bessemer Cloud Index) tracks a basket of publicly traded SaaS stocks, including the likes of Salesforce, Adobe and more recent debuts like Dropbox, DocuSign and Okta, among others.Public companies in the Bessemer Cloud Index grew their public valuations much faster than more broad-based indices like the Dow Jones Industrial Average and the S&P 500. Carried by the high and still-growing value of recurring revenue, warm reception of SaaS companies new to public markets and (with the exception of the past couple of weeks) generally stable markets overall, public SaaS companies have done well. Despite a pretty absurd rate of growth on the public side, no such consistent growth could be found on the early-stage, private end of the market.However, rather than viewing Q3 2018 as a disappointment for the early-stage SaaS investment market, it’s more like a reversion to the mean. It’s the first half of the year that’s the outlier, not Q3.The first half of 2018 had some truly huge early-stage deals cross the wires. In March, Robotic process automation software company UiPath raised $153 million in its Series B. (UiPath just raised another $225 million in a Series C round in September.) Collaborative email inbox Front App raised $66 million in its January Series B. Rival Chicago logistics software companies FourKites and project44 each raised $35 million Series B rounds earlier in the year. On a one-off basis, these are big rounds, but collectively they add up to a huge pile of money.The conclusion we’re drawn to here is that we were perhaps premature in declaring the long-time downtrend snapped to the upside."}