{"id": "Facebook reorganizes Oculus for AR/VR’s long-haul", "paragraph": "Facebook  is again looking to whip Oculus into shape for its 10-year journey towards making virtual reality mainstream. According to two sources, Facebook reorganized its AR and VR team this week from a divisional structure focused around products to a functional structure focused around technology areas of expertise. While no one was laid off, the change could eliminate redundancies by uniting specialists so they can iterate towards long-term progress rather than being separated into groups dedicated to particular gadgets.Facebook confirmed the reorg to TechCrunch, with a spokesperson providing this statement: “We made some changes to the AR/VR organization earlier this week. These were internal changes and won’t impact consumers or our partners in the developer community.” Oculus  CTO John Carmack and Oculus co-founder/newly-promoted Head of PC VR Nate Mitchell will remain in their leadership positions within VP of AR/VR Andrew ‘Boz’ Bosworth’s hardware wing of the company.The shift obviously communicates that Facebook believes Oculus could be running more effectively. Organizing the company around areas of expertise rather than broader divisions is probably more appropriate for a moonshot effort that can’t afford redundancies, on the other hand, keeping expertise siloed could isolate new approaches and advancements from reaching other teams. As the company builds out its first full lineup of headsets, there seems to be significant overlap in the tech problems and products bring tackled by those working on mobile and PC products.TechCrunch reported earlier this week that the company is planning to release a new Rift headset as early as 2019, possibly called the Rift S, which will featured upgraded displays and an inside-out tracking system. The company’s “Rift 2” project, codenamed Caspar, was left behind in the reorganization, a source tells us. We can’t confirm whether any other products or concepts have been shelved.After canceling ‘Rift 2’ overhaul, Oculus plans a modest update to flagship VR headsetWhile an immersive virtual world that users can hang out and communicate in certainly seems to fit Facebook’s broader mission, the company has spent the better part of the past few years deciding how a costly, ambitious venture like Oculus fits into its corporate structure.First, things went smoothly. The company and its empowered co-founders were building out a developer network and prepping for the launch of their Rift headset after creating a successful partnership with Samsung for the Gear VR. Then, the company’s good fortune turned as the Rift headset was racked by expensive delays and Oculus failed to ship the company’s Touch motion controllers at launch losing some initial ground to HTC. By the end of 2016, it was announced that co-founder Brendan Iribe was out as CEO and that the company would be reorganizing around divisions focused on things like PC VR, mobile and content with Xiaomi exec Hugo Barra coming aboard as VP of VR to lead the new effort working directly beneath CEO Mark Zuckerberg. An additional layer of oversight has been built in since then, with Bosworth was put in charge of the company’s consumer hardware ambitions with Oculus as a central pillar. His title is now VP of AR/VR.The absorption of Oculus deeper into Facebook’s corporate structure was a trend that soon replicated itself as the company looked to rein in the independent teams under a more cohesive vision. The culmination of this was a major executive reshuffle earlier this year that changed the landscape for how divisions within the company were managed.Now, they’re changing things up even more.Oculus GoThe new structure sounds like it could coordinate efforts around more general lines like hardware and software allowing insights to flow more intuitively across Facebook’s planned devices.Given the slow adoption of VR and engineering challenges of AR headsets, which at TechCrunch’s LA conference last month Facebook’s head of AR Ficus Kirkpatrick confirmed it was building, this structure could help Oculus iterate its way to long-term success rather than just getting the next product out the door.Facebook confirms it’s building augmented reality glassesIf Facebook is going to beat companies solely focused on AR like Magic Leap, and potential incumbent invaders like Apple if it so chooses, it needs to maximize efficiency. And if it’s going to get both developers and users excited about these next-generation computing platforms, it will have to produce products that make cutting-edge technologies feel unified and accessible. That’s a lot easier when everyone’s not stepping on each other’s virtual shoes."}