{"id": "What if Google unionized?", "paragraph": "Last week more than 20,000 Google employees walked out of their workplace to protest, and demand major changes in, how the company handles harassment and discrimination. Mass employee organization, demands made of management — doesn’t that all vaguely remind you of some kind of old-fashioned twentieth-century concept? What was it called again? The name’s on the tip of my tongue, I swear…A participant said, “Just the threat of us walking out was enough for the company to remove DeVaul from the payroll,” referring to Richard DeVaul, the Google executive who resigned this week amid a swirling storm of accusations of sexual harassment and worse. Meanwhile, an organizer of the walkout said, plaintively, “I hope I still have a career in Silicon Valley after this” … while other organizers declined to go on the record.If only there were some formal, structured way in which tech employees could bring grievances to their management, and negotiate with them as a group, via, say, elected representatives, for whom protection from retaliation could be established. Surely the disruptors and out-of-the-box thinkers of Silicon Valley could come up with some revolutionary new system for that. Imagine — and I know this sounds like science fiction but bear with me — one day, such a structure might even achieve some kind of special legal recognition and protections.But what would they call it? I don’t know. Maybe, and I’m just spitballing here, they could call it a “union” or something crazy like that. After the set operation, get it? They like math entendres down at Google,  after all…I am not necessarily saying such a concept is all benefit and no cost. I’m not even saying I think it would necessarily be a net good idea. But it is striking to me how nobody seems to have even publicly considered the possibility, under the circumstances.I get that the Valley idea of a union is basically that of a terrible hidebound boa constrictor which chokes off all hope of speed and/or innovation. That might well be true, if one were to simply try to apply twentieth-century union notions, ones which tried to control hours worked and physical conditions, because those were the primary concerns of the manufacturing and/or otherwise physical laborers of that era. But it surprises me greatly that nobody seems to even be talking about a “Union 2.0” concept, one built for 21st-century software engineers rather than 20th-century auto workers, one which didn’t necessarily sacrifice speed, flexibility, or openness to experimentation.Not least because such could have important repercussions beyond the companies in question. Big tech companies have become among the most powerful entities in the world, at least indirectly. An argument about government regulation of tech is often that it is both heavy-handed and so slow that by the time it finally happens it applies to the tech of several years ago and is already essentially obsolete. This is often a fair criticism, and often applies to legal restitution too.So what are the checks and balances for Big Tech? What forces and people can keep them honest? The obvious answer is: their employees. Google and Facebook and company fear unrest among their tens of thousands of employees far more than they do the anger of a few hundred million users around the world. It’s by no means a perfect lever of influence, but it’s better than nothing. Whether you want to call it a union or not, I can’t help but think that a more formal structure for grievances, collective negotiation, and protection from reprisal, among employees of major tech companies, might just be a pretty good idea for everyone."}