{"id": "Convene uses landlord partnership model to outclass WeWork", "paragraph": "Recent reports that SoftBank may take a majority stake in WeWork has added fuel to the already hot market for startups in the workspace and property tech sectors. One of the more compelling companies that stands to benefit from this trend is New York-based Convene. Started by co-founders Ryan Simonetti (CEO) and Chris Kelly (president), 500-person strong Convene  has distinguished itself as a top-tier provider of meeting, event and flexible workspace offerings in its 21 locations.But unlike freelance-heavy WeWork  and other co-working companies that cater to 1-10 person companies, Convene puts owners of Class A office buildings at the center of its business model. The goal is to help these landlords provide tenants with the high-end of amenities of, say a unicorn tech startup.On the back of the company’s recent $152 million Series D, Simonetti and Kelly were eager to discuss new initiatives, including a co-branded turnkey workplace and amenity solution and their plans to launch additional Convene locations, including London. They also elaborate on how they plan to benefit during the next recession and open up on their differences with category giant WeWork. Finally, they explain why paintings by renowned artists, including Picasso and Calder, are tucked into corners of the company’s first, soon-to-be-opened members club at Club 75, at RXR’s Rockefeller Center.Gregg Schoenberg: Ryan and Chris. It’s great to see you both. To kick things off, I want to establish that Convene is not a typical startup in that you’ve been around for about nine years.Ryan Simonetti: Yes, is that called being washed-up in the startup world?GS: Not necessarily. Tell me about where the idea for Convene came from?RS: Chris and I met during our freshman year orientation at Villanova University, ended-up pledging the same fraternity and spent a lot of time getting to know each other. From the beginning, we were probably two of the more entrepreneurial guys at Villanova. We sold used textbooks, spring break trips, parties into Philadelphia. If there was a way to monetize something in college, we were the two guys that were trying do it.GS: Two scrappy guys from Villanova.RS: Yes, we’ve always joked that we were probably the only kids at Villanova who didn’t have our parents’ credit cards.GS: So years later, what was that catalyzing moment where you said, “Okay, here’s the idea for Convene”?Chris Kelly: I remember two phone calls from Ryan that represent the earliest seeds of Convene. The first phone call was in the middle of the financial collapse, and in that phone call, Ryan said, “We’re about to witness the largest shift of wealth that the world has ever seen and we have to figure out how to be on the winning end of that.” Then a few weeks later, Ryan called me up and introduced the crazy idea for Convene.GS: And what was that specific pitch?RS: He walked me through the Grand Hyatt in Midtown Manhattan and said, “Look at the way these guys are doing business. This is a $60 million a year catering and meetings operation that was in essence being outsourced to hotels.”GS: And you’re saying hotels weren’t doing a great job?CK: Hotels simply didn’t have the sensibility about what people really need in a business environment. They treated a shareholder meeting like a wedding with a projector. And we saw a huge opportunity to create spaces that met enterprise workplace requirements.GS: So fast forward to today and tell me exactly what Convene is, because I think sometimes people struggle and just say, “Well you’re a WeWork competitor on the premium end.”RS: We partner with Class A building owners to design places where people can meet, work and be inspired. It’s not any more complicated than that.CK: To build on that, you could say that we’re essentially allowing landlords to offer Googleplex-style workplace experiences.RS: That’s a big challenge for even large organizations. Look at Google, Facebook or JP Morgan. These companies can deliver an amazing experience at their corporate headquarters location. But in their smaller offices, it’s really tough to deliver a corporate HQ experience if you only have five, 10 or 15,000 square feet. You can’t build the kitchen infrastructure, or the gym, or all of those other things. So to Chris’s point, we’re democratizing access to that experience, and doing it with the landlord as the key partner.GS: So the landlords are the core client?RS: Just like Airbnb would tell you that their primary stakeholder is the homeowner, or OpenTable would tell you the primary stakeholder is a restaurateur, we view the building owner as our primary stakeholder. And what we’re helping them do is respond to the changing demands of today’s tenant, who want increased flexibility and better agility to adapt to change.GS: I take it marrying technology infrastructure to the physical spaces is key to that, which is why you recently bought Beco. What exactly do they do?RS: Beco is a workplace analytics platform that’s using sensor-based technology to help us, our landlord partners and our corporate clients better understand the way that people are actually interacting with space and services.GS: As you contemplated that acquisition, were you worried that it might be perceived to some of your traditional clients as Big Brothery?RS: Look, everyone today is concerned about data privacy, and rightfully so. The way that the technology actually operates is that the actual users are anonymous to us.GS: So is that data anonymous, or anonymous anonymous?RS: Anonymous anonymous, meaning all we’re capturing is a random ID assigned to a phone, and that ties back to the sensor and data analytics platform.GS: Do you have to opt in?RS: It’s all opt in.GS: Okay, I want to turn to the big gorilla in the broader flexible workspace category, because right or wrong, everyone, including Convene, gets compared to WeWork.RS: Look, if we think about the macro trends that are shaping and changing not just the way that we work, but also the way that we live and travel, I would argue that WeWork and us have a similar view of the world and the future. But from a business model perspective, the quality of the product that we’ve built, the level of service that we deliver, the strategic nature of our partnerships with building owners, I don’t view us as directly competitive.GS: I appreciate that WeWork ultimately caters to smaller-sized end-users than Convene, so in that way you’re different. But it’s also true that even though Red Bull and Coca Cola are different drinks, you’re not going to drink a Coke and a Red Bull at the same time.RS: From an analogy perspective, there’s a difference between Planet Fitness and Equinox, right? Would you argue that they’re competitive? Maybe. But the way I think about office real estate is Class C, Class B, Class A. Convene is a Class A partner to landlords.GS: Right, but WeWork, with all that current and possibly future cash from SoftBank, is moving upmarket.RS: Sure, as they move more into enterprise and upmarket, of course, they’ll be competitive. But what really differentiates us strategically is that we’re not trying to build our own supply chain or our own inventories. We’re partnering with the existing supply chain to create a new category of supply that speaks to the collective demand from our customer demographic.GS: As a service provider, I get that. But what happens when the next recession comes —RS: — Yes, by the way, we’re excited for the next one.GS: Because the knock on WeWork and other companies in the broader sector is that when the recession hits, the blood will hit the fan because of those short-term tenant leases.RS: Well, right now, you see a lot of capital flowing into the sector and you have platforms that probably shouldn’t be here as well.GS: Let’s take Brookfield. WeWork has a relationship with Brookfield. You guys have a relationship with Brookfield. But I think the difference is this: If bad things happen in the economy, they have to hope that WeWork is going to effectively manage those short-term lease obligations. From my outsider’s perspective, that looks to me like a counterparty relationship. But in Convene’s case, it looks more like an aligned partnership. After all, Brookfield, as well as Durst and RXR, are on your cap table.RS: Every deal structure is aligned and even the leases we have are aligned. And when the recession hits, we will use it as an opportunity to deepen our landlord partnerships and take market share.GS: With whose balance sheet?RS: We’re using the landlord’s balance sheet to grow our business.CK: And WeWork is using the SoftBank balance sheet to grow their business.GS: Could you elaborate?RS: WeWork did us the greatest favor in the world, because our strategy since day one has been to make the landlord a key partner and stakeholder. Do you want to know who has the cheapest cost of capital? Cheaper than SoftBank’s? It’s the landlord’s balance sheet. Their cost of equity capital is like six to eight percent.GS: Really?RS: Yes. If you think about the investor-anticipated yield in asset classes, real estate sits between a fixed income expectation and an equity capital markets expectation.GS: Okay, but how does using the landlord’s balance sheet enhance your approach strategically?CK: Because there are elements of the way we structure our deals that allow our performance to be variable. And by using the landlord’s balance sheet to grow our business, it aligns us and the landlord to be able to ride through a recession together.GS: Have many of the nation’s Class A landlords have bought into your model?RS: If you look at our current partners that we’re actively working with, I think they globally control over 250 million square feet of Class A office space. So if 10 percent of that moves to flexible consumption, that means Convene could have an addressable market of 25 million square feet of inventory.GS: So given the way you’re talking, would it be fair to say that your landlord partners have recognized that the flexible workspace trend is here for the long term?CK: How we consume real estate is undergoing a fundamental shift. This is the same conversation that was happening in the transportation industry 15 years ago. It’s the same thing that was happening in the travel industry when Airbnb was starting. That same conversation is happening today within the existing supply chain. So, yes, it’s a buy, build, partner decision that is being made in every landlord’s office around the country today.GS: It still sounds odd to hear the phrase, “consume real estate.” Maybe I’m old-school, but you guys are down to earth. Do you find that language odd?CK: Actually, what we’re seeing is the consumerization of real estate. Real estate was historically very B2B, very financially driven. Today, it’s being driven by human experience, so yes, brands matter, the customer experience matters. And that consumerization of real estate actually is happening.GS: I take it that’s why you launched this new managed workplace solution that features the services you bring, but enables a client to use its own name?CK: What makes that platform unique is that it’s co-branded. It’s an endorsed brand model by Convene, which means that the Convene brand standards, the Convene operating model, the Convene staffing model and the Convene university training program comes with it.GS: So Intel inside?CK: Yes, which gives clients the best of both worlds. It gives them the brand and reach and expertise of Convene. At the same time, they can now have something that feels more authentic and unique to them as a landlord.GS: I want to shift to the future of work, which is something you both have spoken about in pretty bold terms. We’re at this amazing Convene members’ club, which sort of feels like a SoHo House except we’re in midtown. And you’ve talked about how an experiential personal life will be closer to a work life. Where is all this going?RS: From a trend perspective, we believe fundamentally in what we call work/life integration. It used to be that you go to work and at the end of the day that stops and then you move to the rest of your life. That’s not really the way it works anymore. And when we think about some of the services that we’ve launched over the last couple years, it’s been with that idea in mind.GS: Are you creating future offerings in-house or partnering?RS: Actually, we’re about to announce a partnership on the wellness side, where we’re taking some of the wellness elements and starting to incorporate them into the broader Convene ecosystem.GS: Do either of you guys have children?RS: Yes, we both do.GS: Because if you want to talk about quality of life and the war for talent, it seems like a natural extension to see if your plan to help the workforce addresses the challenges of working while raising young kids. Are such extensions on your whiteboard?RS: Yes, they’re definitely on the whiteboard and some of those things are already in process. The difference is partnership. When I think about the way that we’re building our platform and the way that WeWork is building theirs, I think about us as being an open-source platform, Do you think you need to do everything yourself because you’re the best in the world at everything, or do you want to work with best-in-class partners?GS: So for something like childcare, you’d bring in a partner?RS: If we decide, which I’m not saying we are, to get into childcare, we’re going to do that with a proven partner that has a track record of delivering that experience and doing it really well.GS: How does Convene fare in a world where remote work becomes an even bigger trend?CK: Actually, there’s a difference between remote work and mobility. Remote work is the traditional concept of working from home, and we’re actually seeing some backlash now of companies who are really trying to drive culture, and want more face-to-face interaction.GS: Does that show up in the design of your spaces?CK: Yes, the built environments of our offices are changing from looking like cubicle farms where everybody reports to their desk and their computer to operating a lot more like a digitally enabled campus. And the decoupling of people and their work from their desk is opening up an opportunity to build what’s called an activity-based workplace, where there are different types of spaces that are specialized and built for specific uses.GS: You guys don’t even have offices, right?CK: Right. None of us have offices.RS: Also, people used to talk about remote work in magical terms. They’d say, I’m not going to need an office. We don’t believe that this is the case. We think that there are a few things that will continue to matter to organizations. One is brand, two is culture, three is collaboration. And until technology can somehow magically replicate that experience, we think that the best ideas will come from face-to-face interaction.GS: I have two important last topics to cover. First-off, why on earth, nestled into a semi-remote corner of this club, do you have a Picasso painting hanging on the wall? Because in my experience, usually people like to show off the Picasso if they have one.RS: Ha, well, the Picasso, as well as all of the other amazing art that you’ve seen at Club 75, is part of the partnership here with the landlord.GS: Well, it speaks to the confidence they have in you.RS: Yes, but it also speaks to the experience we’re creating. We think about space as the body language of an organization. Space has the ability to move people and we think that art is a big part of that.CK: It also demonstrates the extent to which landlords are committed to delivering a great experience.RS: Right. Having a coffee next to a Calder or a Picasso can put you in a totally different headspace.GS: Well, I’m glad you didn’t use shareholder money to buy these works, which brings me to my last topic. At this point, are you concerned about profitability?CK: Yes, we are and that’s another one of the differences between us and others. In fact, we’ve been cash flow positive since Day one. And as an organization, profitability has always been something that we think is very important.GS: It’s because you don’t have enough VCs on your cap table. Speaking of which, you’re obviously aware of the fact that SoftBank and other megafunds may helicopter drop a lot more money into this space, which could change the competitive dynamics.RS: First of all, the last time I checked, we were the second most capitalized platform in the category, by dollars raised. And if you look at our partnership-driven approach, where the landlord’s balance sheet is funding a lot of our growth, the actual capital that’s being invested in the platform is multiples of the $260 million we’ve raised.But to your point, our concern isn’t so much about the capital that’s flooding in; there’s no amount of money in the world that can buy you a partnership with Brookfield or a half a dozen landlords that we’ll be powering next year. And money, whether it’s from SoftBank or anyone else, can’t give an organization its corporate culture. And I think one of the reasons we’ve been selected as the partner to some of the most discerning customers in the world is because of the fact that every day, we deliver consistently against a premium experience.GS: Well, on that note, Chris and Ryan, I’d like to thank you for your kind hospitality.RS: It’s been our pleasure and thank you."}