{"id": "Facebook shares climb despite Q3 user growth and revenue", "paragraph": "After last quarter’s bloodbath earnings report that cut 20 percent from Facebook’s  share price, the social network stumbled in Q3 2018, reaching 2.27 billion monthly users, up 37 million users or 1.79 percent — only slightly better than Q1’s slowest-ever growth rate of just 1.54 percent, and compared to an 2.29 billion Wall Street estimate. It added 24 million daily active users hit 1.49 billion, up 1.36 percent compared to Q1’s 1.44 percent, missing the 1.51 billion estimate.But the real growth story depends on its core US/Canada and Europe markets where Facebook saw zero growth and lost 1 million monthly users respectively last quarter. In Q3, Facebook added 1 million monthly users to reach 242 million in the US/Canada region, but held flat at 185 million dailies there. It lost 1 million users in Europe in both dailies and monthlies. Those markets make up over 70 percent of its revenue, which is why the slow growth and shrinkage is scaring Wall Street.[Update: Facebook did make an adjustment to its user count measurements this quarter to disclude some misclassified activity, reducing counts by 0.3 percent to 1 percent. Notably, without this correction its daily US & Canada count would have grown by 1 million instead of staying flat this quarter, its daily Europe users would have grown 5 million instead of shrinking 1 million, and its monthly Europe count would have grown 1 million instead of shrinking by 1 million.]As for Facebook’s business, the company earned $13.73 in revenue, compared to Refinitiv’s consensus estimate of $13.78 billion, and saw $1.76 EPS compared to an estimate of $1.47, making for a mixed report. Revenue was up 33 percent year-over-year, but that’s much slower than the 49 percent YOY gain it had a year ago, and the 59 percent it had in Q3 2016.Facebook blamed foreign exchange headwings for $159 million in Q3, which was the difference between its miss and a beat on revenue. Mobile accounted for 92 percent of Facebook’s ad revenue, up from 91 percent last quarter, so when you think of the social network, be sure you’re not thinking of a desktop website.Long-term, Facebook can’t exchange growth in its core markets for expansion in Asia-Pacific and the developing world. Facebook average revenue per user worldwide is $6.09, but the regional differences are stark. It rakes in $27.61 per users in the US and Canada, and $8.82 in Europe, but just $2.67 in Asia-Pacific and $1.82 in the Rest Of World region. In fact, ARPU dropped 4 percent in the Rest Of World, indicating users there may be spending fewer minutes per day browsing the News Feed and seeing ads.Facebook’s share price closed at $146.22 before earnings were released, still massively down from its $217 peak for before it announced user growth troubles and slowing revenue growth in Q2’s earnings report. Facebook shares climbed 2 percent upon the announcement of earnings, in part thanks to Facebook pulling in $5.14 billion in profit and it adding 1 million users in the North American region after going flat last quarter, but oscillated wildly throughout the earnings call.There, Zuckerberg stressed that sharing is shifting towards private chat where users send 100 billion messages on Facebook’s apps per day, and Stories where people share 1 billion slideshows per day. He cited Apple’s iMessage and YouTube, but not Snapchat, as Facebook’s big competitors going forward. Those comments drove shares down 5 percent, reversing early gains. But later, he noted that Facebook believes it’s found the right formula for showing people more meaningful passive video, so Facebook will lift some restrictions on how many lucrative video ads it showed. That pushed Facebook’s share back to 3 percent up in after-hours trading.Facebook hoped to show that its business can keep growing even as amidst a wide range of troubles. It did note that “more than 2.6 billion people now use Facebook, WhatsApp, Instagram, or Messenger each month” compared to 2.5 billion last quarter. It also revealed another new stat: “more than 2 billion people use at least one of our Family of services every day on average.” The goal of both of these stats is to distract from Facebook’s own slow growth by reminding people that some of those users who leave are going to its other properties.But still, the company’s revenues and profits have been overshadowed by the non-stop parade of scandals ranging from election interference to its biggest security breach ever. Next quarter we’ll see if the breach scared users away or if Facebook logging them out for safety led some to never log back in.Let’s remember that the company should be lauded for investing so much to beat back fake news and election interference, and cutting back on viral videos and clickbait that juice engagement but are terrible for user well-being and society. It doubled its security and content moderation staff from 10,000 to 20,000 this year. They now make up over half the company, as headcount grew 45 percent year-over-year to 33,606. Twitter’s shares soared on last week’s profitable Q3 earnings report, but it’s made no such measureable commitment to fight harassment and misinformation. Facebook is still constantly screwing up when it comes to privacy and security, but at least it’s putting its ample money where its mouth is.Zuckerberg says the future is sharing via 100B messages & 1B Stories/day"}