{"id": "Disrupt Berlin 2018 early-bird prices extended", "paragraph": "It’s possible that St. Expeditus, the patron saint of procrastinators, has taken a shine to time-stressed startuppers. Call it whatever you like — divine intervention, planetary alignment or darned good luck — we’re extending the deadline for early-bird tickets to Disrupt Berlin 2018. That means you have 10 days until the 2 November deadline to save up to €500. Expedite your decision-making and buy your ticket today.Why wouldn’t you join thousands of your peers and colleagues for two full days devoted to all things startup? Disrupt Berlin draws an international audience — literally thousands of attendees from more than 50 countries, including all the European Union members, Turkey, Russia, Egypt, India, China, South Korea and the list goes on. It’s an opportunity to see some of the best technology the world has to offer — and connect with the people behind it.Take Startup Alley for example. More than 400 pre-Series A startups will populate our expo floor and showcase some pretty spectacular tech products, platforms, services and talent. It’s where innovation, collaboration and opportunity meet.And you won’t want to miss our curated cohort of startups that earned the coveted TC Top Pick designation. More than 40 exceptional startups span these tech categories: AI/Machine Learning, Blockchain, CRM/Enterprise, E-commerce, Education, Fintech, Healthtech/Biotech, Hardware, Robotics, IoT, Mobility and Gaming. Here are just a few:Here’s the complete list of TC Top Picks at Disrupt Berlin 2018.Disrupt Berlin 2018 offers an opportunity at every turn. Learn from our roster of outstanding speakers — leading founders, investors and technologists sharing their knowledge, perspective and advice. Take advantage of our Q&A Sessions to go deep on crucial tech topics with experts in a smaller, more intimate setting. Experience the thrill of Startup Battlefield, our epic pitch competition, as founders from 15 startups compete for the heralded Disrupt Cup, $50,000 cash and potentially life-changing media and investor love. Oh, and do not miss our kick-ass After Party. Want more specifics? Read the agenda.Disrupt Berlin 2018 takes place on 29-30 November. You have a little over an extra week to save up to €500. Don’t disappoint St. Expeditus — buy your pass before the 2 November deadline."}