{"id": "AT&T’s streaming video device is now in beta testing", "paragraph": "AT&T has begun beta testing a streaming device that seems to be something of its own Roku competitor, according to a statement made by John Donovan, CEO of AT&T Communications, during the company’s third quarter earnings call. The device, first scooped a year ago by Variety is an Android TV-based set-top box which integrates other streaming apps and ships with a voice remote, according to an FCC filing.While AT&T didn’t comment on Variety’s report at the time, it did later confirm the device on an earnings call earlier this year.The box was then described as a way for customers to watch DirecTV Now or other streaming services from their home. The plan at the time was to have the device launched by the end of 2018, the company had said.The word today is that timeframe has shifted.Donovan said the service was in “beta testing” now, but added that AT&T planned to “roll out trials in the first half of next year.”The thin client-based service – as this product was referred to as by the exec – would be the next step in transitioning traditional pay TV customers to the streaming service, DirecTV Now.It could also be used to target cord cutters in search of a more traditional TV experience, by offering access to streaming TV without requiring the installation of a satellite dish.“This will be a more measured roll out,” Donovan said, of the new thin client-based service. “Like our introduction of WatchTV, we expect this service to be EBITDA positive. And over time, it should lower our acquisition cost of our premium video service. And both of these use the common platform we introduced with DirecTV Now,” he noted.The device’s arrival comes at a time when AT&T’s pay TV business is in decline.The company reported a 346,000 net loss in traditional TV customers (DirecTV and AT&T Uverse) in the quarter. However, it gained 49,000 for its streaming service, DirecTV Now, which has grown to 1.86 million subscribers.AT&T said it would also begin evaluating its channel lineups, in order to better “align content costs with the price.” That seems to mean that AT&T may also be thinking about breaking up content into even skinnier bundles – something Hulu says it’s doing, as well."}