{"id": "Analysts weighing in on $8B  SAP-Qualtrics deal don’t see a game changer", "paragraph": "SAP CEO Bill McDermott was jacked up today about his company’s $8 billion Qualtrics acquisition over the weekend. You would expect no less for such a big deal. McDermott believes the data Qualtrics  provides could bridge the gap between his company’s operational data and customer, data wherever that resides.The idea behind Qualtrics is to understand customer sentiment as it happens. McDermott sees this as a key piece to the company’s customer management puzzle, one that could propel it into being not only a big player in customer experience, but also drive the company’s underlying cloud business. That’s because it provides a means of constant feedback from the customer, one that is hard to ascertain otherwise.In that context, he saw the deal as transformative. “By combining this experience data with operations, we can combine this through Qualtrics and SAP  in a way that the world has never done before, and I fundamentally believe it will change this world as we know it today,” McDermott told TechCrunch on Monday.Others who follow the industry closely were not so convinced. While they liked the deal and saw the potential of combining these types of data, it might not be the game changer that McDermott is hoping for after spending his company’s $8 billion.Paul Greenberg, who is managing principal at The 56 Group and author of the seminal CRM book, CRM at the Speed of Light, says it’s definitely a big acquisition for the company, but he says it takes more than an acquisition or two to challenge the market leaders. “This will be a beneficial acquisition for SAP’s desire to continue to pivot the company to the customer-facing side, but it isn’t a decisive one by any means,” Greenberg told TechCrunch.Customer experience is a broad term that involves understanding your customer at a granular level, anticipating what they want, understanding who they are, what they have bought and what they are looking for right now. These are harder problems to solve than you might imagine, especially since they involve gathering data across systems from a variety of vendors that deal with different pieces of the puzzle.Companies like Adobe and Salesforce have made this their primary business focus. SAP is at its heart an ERP company, which gathers data by managing key internal operational systems like finance, procurement and HR.Tony Byrne, founder and principal analyst at Real Story Group, says he likes what Qualtrics brings to SAP, but he is not sure it’s quite as big a deal as McDermott suggests. “Qualtrics enables you to do more sophisticated forms of research which marketers certainly want, but the double benefit is that — unlike SurveyMonkey and others — Qualtrics has experience on the digital workplace side, which could complement some of SAP’s HR tooling.” But he adds that it’s not really the central CEM piece, and that his company’s research has found that SAP still has holes, particularly when it comes to marketing tools and technologies (MarTech).Brent Leary, who is founder at CRM Essentials, agrees that SAP got a nice company, especially when combined with the $2.4 billion CallidusCloud purchase from earlier this year, but it has a ways to go to catch up with Salesforce and Adobe. “Qualtrics does provide a more broad perspective of customers because of operational data from back and front office systems. The Callidus acquisition helps to turn insights into certain B2B-focused customer experiences. But I think more pieces may be needed in terms of B2C experience creation tools that companies like Adobe and Salesforce are focusing on with the marketing/experience clouds,” he explained.Whether this is an actual game changer as McDermott suggested remains to be seen, but the industry experts we spoke to believe it will be more of an incremental piece that helps move the company’s customer experience initiative forward. If they’re right, McDermott might not be finished shopping just yet."}