{"id": "The Biggening", "paragraph": "Everything is already big.The iPhone SE died. The iPad Mini was last upgraded in 2015. The 11-inch MacBook Air died years ago. The smaller Series 4 Apple  Watch has a bigger display than the larger Series 3 Apple Watch.Apple’s smallest devices are slowly getting bigger and the company’s events don’t suggest those ambitions are going to stop. While the release of the truly monstrous 6.5” iPhone XS Max last month embodies this trend in the most readily apparent way, the way Apple has emphasized external displays on its new iPad Pro and its MacBook Pro line are perhaps more telling of the company’s future ambitions: a world where displays are boundless.If you’re thinking that Apple can only make displays so much bigger while reducing the sizes of the device, there’s a lot further they can take this. Apple’s wants bigger displays.The old iPad Pro was perhaps too big; its massive form factor was great for creative tasks but it was one of the most niche devices Apple had released in recent years. The company’s new 12.9” iPad Pro reaches for the edges more but shrinks its overall footprint in the process, turning the somewhat novelty device into what I imagine will be a much more palatable mainstream product. The smaller Pro jumped from 10.5” to 11” while maintaining an overall size similar to its predecessor.Apple.comMuch in the way that the iPhone 6S Plus was the “big” phone when it came out with a 5.5″ display, and consumers buying it were making that choice for themselves, Apple is shaping the new normal. The 5.8″ iPhone XS and 6.5″ iPhone XS Max show that. With the new Apple Watch Series 4, Apple made the decision to make the devices bigger, bumping the 38mm and 42mm watches up to 40mm and 44mm sizes. The upgrade signified that Apple felt that even its biggest tiny display was still too small.One of the other big changes on the new iPad Pros was the use of USB-C, and a big reason Apple was fine ditching its proprietary port is that it really wanted to enable the device to drive 5K external displays. Apple wants the device to be at the heart of creatives’ workflows, but it still sees its display size as a limiting factor.Today we also saw Apple make a number of big improvements to the 13.3” MacBook Air that seem to overshadow the 12” MacBook in major ways, throwing into question whether the 12″ device is too small a form factor for Apple to continue supporting. And while the company no longer sells a 17-inch MacBook Pro, their latest 15-inch MacBook Pro was built to power up to four 4K displays, so that should tell you quite a bit about where the company is moving.All of this is to say that Apple wants to fill your visual world. When Apple starts working toward something across its entire product line, individual updates almost start to feel like inevitabilities, not choices. But in pushing toward larger displays and more external display support, Apple is very much deciding that its devices should take up more of your perspective.But handheld devices can only get so large. You may one day cram an iPhone with an 8″ display into your pocket, but you’ll never get an iPad Pro in there. Samsung is building folding phones to cheat this concept in the short term, but Apple seems to be working on small screens closer to your eyes as the solution.The company has been reportedly building VR devices and working on AR display tech to create long-rumored devices that could fill broader sections of our field-of-view.Apple buys Denver startup building waveguide lenses for AR glassesApple’s vision for augmented reality has hardly been secret. Their wonky prototype ARKit demos play out on the same keynote stages as major hardware releases.But how Apple decides to interface an eventual head-worn AR product with the rest of its lineup will be incredibly important for the company. Much in the way that products like AirPlay or external displays give the content you’ve created or discovered a place to be seen in a more immersive way, digital AR screens could also give a bigger home for the intimate interactions users still host on mobile devices.Today, Apple tellingly called the iPad Pro the “world’s best device for AR” in their event keynote, signifying that the best augmented reality is the biggest window into that world. As Apple crafts “edge-to-edge” devices that allow us to peer deeper into their digital services, the question, perhaps, isn’t how much bigger those physical screens will become but how long it will be until AR displays are trimming down the bezels of our unadulterated view."}