{"id": "China is funding the future of American biotechChinese VCs seek healthy returnsGV and Founders Fund look to keep the Valley competitiveVCs target a disastrous health system", "paragraph": "Silicon Valley is in the midst of a health craze, and it is being driven by “Eastern” medicine.It’s been a record year for US medical investing, but investors in Beijing and Shanghai are now increasingly leading the largest deals for US life science and biotech companies. In fact, Chinese venture firms have invested more this year into life science and biotech in the US than they have back home, providing financing for over 300 US-based companies, per Pitchbook. That’s the story at Viela Bio, a Maryland-based company exploring treatments for inflammation and autoimmune diseases, which raised a $250 million Series A led by three Chinese firms.Chinese capital’s newfound appetite also flows into the mainland. Business is booming for Chinese medical startups, who are also seeing the strongest year of venture investment ever, with over one hundred companies receiving $4 billion in investment.As Chinese investors continue to shift their strategies towards life science and biotech, China is emphatically positioning itself to be a leader in medical investing with a growing influence on the world’s future major health institutions.We like to talk about things we can interact with or be entertained by. And so as nine-figure checks flow in and out of China with stunning regularity, we fixate on the internet giants, the gaming leaders or the latest media platform backed by Tencent or Alibaba.However, if we follow the money, it’s clear that the top venture firms in China have actually been turning their focus towards the country’s deficient health system.A clear leader in China’s strategy shift has been Sequoia Capital China, one of the country’s most heralded venture firms tied to multiple billion-dollar IPOs just this year. Historically, Sequoia didn’t have much interest in the medical sector.  Health was one of the firm’s smallest investment categories, and it participated in only three health-related deals from 2015-16, making up just 4% of its total investing activity. Recently, however, life sciences have piqued Sequoia’s fascination, confirms a spokesperson with the firm.  Sequoia dove into six health-related deals in 2017 and has already participated in 14 in 2018 so far.  The firm now sits among the most active health investors in China and the medical sector has become its second biggest investment area, with life science and biotech companies accounting for nearly 30% of its investing activity in recent years.Health-related investment data for 2015-18 compiled from Pitchbook, Crunchbase, and SEC EdgarThere’s no shortage of areas in need of transformation within Chinese medical care, and a wide range of strategies are being employed by China’s VCs. While some investors hope to address influenza, others are focused on innovative treatments for hypertension, diabetes and other chronic diseases.For instance, according to the Chinese Journal of Cancer, in 2015, 36% of world’s lung cancer diagnoses came from China, yet the country’s cancer survival rate was 17% below the global average. Sequoia has set its sights on tackling China’s high rate of cancer and its low survival rate, with roughly 70% of its deals in the past two years focusing on cancer detection and treatment.That is driven in part by investments like the firm’s $90 million Series A investment into Shanghai-based JW Therapeutics, a company developing innovative immunotherapy cancer treatments. The company is a quintessential example of how Chinese VCs are building the country’s next set of health startups using their international footprints and learnings from across the globe.Founded as a joint-venture offshoot between US-based Juno Therapeutics and China’s WuXi AppTec, JW benefits from Juno’s experience as a top developer of cancer immunotherapy drugs, as well as WuXi’s expertise as one of the world’s leading contract research organizations, focusing on all aspects of the drug R&D and development cycle.Specifically, JW is focused on the next-generation of cell-based immunotherapy cancer treatments using chimeric antigen receptor T-cell (CAR-T) technologies. (Yeah…I know…) For the WebMD warriors and the rest of us with a medical background that stopped at tenth-grade chemistry, CAR-T essentially looks to attack cancer cells by utilizing the body’s own immune system.Past waves of biotech startups often focused on other immunologic treatments that used genetically-modified antibodies created in animals.  The antibodies would effectively act as “police,” identifying and attaching to “bad guy” targets in order to turn off or quiet down malignant cells.  CAR-T looks instead to modify the body’s native immune cells to attack and kill the bad guys directly.Chinese VCs are investing in a wide range of innovative life science and biotech startups. (Photo by Eugeneonline via Getty Images)The international and interdisciplinary pedigree of China’s new medical leaders not only applies to the organizations themselves but also to those running the show.At the helm of JW sits James Li.  In a past life, the co-founder and CEO held stints as an executive heading up operations in China for the world’s biggest biopharmaceutical companies including Amgen and Merck.  Li was also once a partner at the Silicon Valley brand-name investor, Kleiner Perkins.JW embodies the benefits that can come from importing insights and expertise, a practice that will come to define the companies leading the medical future as the country’s smartest capital increasingly finds its way overseas.Despite heavy investment by China’s leading VCs, Silicon Valley is doubling down in the US health sector.  (AFP PHOTO / POOL / JASON LEE)Innovation in medicine transcends borders. Sickness and death are unfortunately universal, and groundbreaking discoveries in one country can save lives in the rest.The boom in China’s life science industry has left valuations lofty and cross-border investment and import regulations in China have improved. As such, Chinese venture firms are now increasingly searching for innovation abroad, looking to capitalize on expanding opportunities in the more mature US medical industry that can offer innovative technologies and advanced processes that can be brought back to the East.In April, Qiming Venture Partners, another Chinese venture titan, closed a $120 million fund focused on early-stage US healthcare. Qiming has been ramping up its participation in the medical space, investing in 24 companies over the 2017-18 period.New firms diving into the space hasn’t frightened the Bay Area’s notable investors, who have doubled down in the US medical space alongside their Chinese counterparts.Partner directories for America’s most influential firms are increasingly populated with former doctors and medically-versed VCs who can find the best medical startups and have a growing influence on the flow of venture dollars in the US.At the top of the list is Krishna Yeshwant, the GV (formerly Google Ventures) general partner leading the firm’s aggressive push into the medical industry.Krishna Yeshwant (GV) at TechCrunch Disrupt NY 2017A doctor by trade, Yeshwant’s interest runs the gamut of the medical spectrum, leading investments focusing on anything from real-time patient care insights to antibody and therapeutic technologies for cancer and neurodegenerative disorders.Per data from Pitchbook and Crunchbase, Krishna has been GV’s most active partner over the past two years, participating in deals that total over a billion dollars in aggregate funding.Backed by the efforts of Yeshwant and select others, the medical industry has become one of the most prominent investment areas for Google’s venture capital arm, driving roughly 30% of its investments in 2017 compared to just under 15% in 2015.GV’s affinity for medical-investing has found renewed life, but life science is also part of the firm’s DNA.  Like many brand-name Valley investors, GV founder Bill Maris has long held a passion for the health startups.  After leaving GV in 2016, Maris launched his own fund, Section 32, focused specifically on biotech, healthcare and life sciences. In the same vein, life science and health investing has been part of the lifeblood for some major US funds including Founders Fund, which has consistently dedicated over 25% of its deployed capital to the space since at least 2015.The tides may be changing, however, as the recent expansion of oversight for the Committee on Foreign Investment in the United States (CFIUS) may severely impact the flow of Chinese capital into areas of the US health sector.  Under its extended purview, CFIUS will review – and possibly block – any investment or transaction involving a foreign entity related to the production, design or testing of technology that falls under a list of 27 critical industries, including biotech research and development.The true implications of the expanded rules will depend on how aggressively and how often CFIUS exercises its power.  But a lengthy review process and the threat of regulatory blocks may significantly increase the burden on Chinese investors, effectively shutting off the Chinese money spigot.Regardless of CFIUS, while China’s active presence in the US health markets hasn’t deterred Valley mainstays, with a severely broken health system and an improved investment environment backed by government support, China’s commitment to medical innovation is only getting stronger.Deficiencies in China’s health sector has historically led to troublesome outcomes.  Now the government is jump-starting investment through supportive policy. (Photo by Alexander Tessmer / EyeEm via Getty Images)They say successful startups identify real problems that need solving. Marred with inefficiencies, poor results, and compounding consumer frustration, China’s health industry has many. Outside of a wealthy few, citizens are forced to make often lengthy treks to overcrowded and understaffed hospitals in urban centers.  Reception areas exist only in concept, as any open space is quickly filled by hordes of the concerned, sick, and fearful settling in for wait times that can last multiple days. If and when patients are finally seen, they are frequently met by overworked or inexperienced medical staff, rushing to get people in and out in hopes of servicing the endless line behind them. Historically, when patients were diagnosed, treatment options were limited and ineffective, as import laws and affordability issues made many globally approved drugs unavailable.As one would assume, poor detection and treatment have led to problematic outcomes. Heart disease, stroke, diabetes and chronic lung disease accounts for 80% of deaths in China, according to a recent report from the World Bank. Recurring issues of misconduct, deception and dishonesty have amplified the population’s mounting frustration. After past cases of widespread sickness caused by improperly handled vaccinations, China’s vaccine crisis reached a breaking point earlier this year.  It was revealed that 250,000 children had been given defective and fallacious rabies vaccinations, a fact that inspectors had discovered months prior and swept under the rug.Fracturing public trust around medical treatment has serious, potentially destabilizing effects. And with deficiencies permeating nearly all aspects of China’s health and medical infrastructure, there is a gaping set of opportunities for disruptive change.In response to these issues, China’s government placed more emphasis on the search for medical innovation by rolling out policies that improve the chances of success for health startups, while reducing costs and risk for investors.Billions of public investment flooded into the life science sector, and easier approval processes for patents, research grants, and generic drugs, suddenly made the prospect of building a life science or biotech company in China less daunting. For Chinese venture capitalists, on top of financial incentives and a higher-growth local medical sector, loosening of drug import laws opened up opportunities to improve China’s medical system through innovation abroad. Liquidity has also improved due to swelling global interest in healthcare. Plus, the Hong Kong Stock Exchange recently announced changes to allow the listing of pre-revenue biotech companies.The changes implemented across China’s major institutions have effectively provided Chinese health investors with a much broader opportunity set, faster growth companies, faster liquidity, and increased certainty, all at lower cost.However, while the structural and regulatory changes in China’s healthcare system has led to more medical startups with more growth, it hasn’t necessarily driven quality.US and Western investors haven’t taken the same cross-border approach as their peers in Beijing. From talking with those in the industry, the laxity of the Chinese system, and others, have made many US investors weary of investing in life science companies overseas.And with the Valley similarly stepping up its focus on startups that sprout from the strong American university system, bubbling valuations have started to raise concern.But with China dedicating more and more billions across the globe, the country is determined to patch the massive holes in its medical system and establish itself as the next leader in international health innovation."}