{"id": "Kofax to buy Nuance’s imaging division for $400M in cash", "paragraph": "Some consolidation and subsequent divestment are in play in the worlds of imaging and voice recognition. Today, Kofax and Nuance announced that Kofax would be acquiring Nuance’s imaging division, for $400 million in cash. The deal, which had been rumoured in recent days, is expected to close in Q1 2019.The acquisition is a notable move for Kofax  — itself acquired by Thoma Bravo last year in a $1.5 billion deal — as it continues to build up its business in Robotic Process Automation (RPA), the area of enterprise IT services that uses machine learning, computer vision and other AI-based tools to bring automation to repetitive or mundane back-office tasks that would have in the past been done by humans. (The idea is that this frees up the humans to make more sophisticated assessments in specific cases, or focus on entirely different tasks.)On the side of Nuance, the company is a leader in voice recognition services that served as an early partner to the likes of Apple with Siri, and has also worked on a number of other AI-based solutions to improve how enterprises build services and work.Publicly traded Nuance’s imaging division accounted for about 11 percent of its revenues last year, and it has stated would be making several changes in its business to rationalise it and focus on more profitable operations. The biggest parts of its $5 billion business today are healthcare solutions, enterprise and automotive.Kofax is bringing on Nuance Document Imaging, as the division is officially called, specifically to bring more services in the area of imaging services, which include services like providing security and compliance around any image scanning or printing that takes place across an organization. NDI, Kofax said, is one of the biggest companies of its kind in the field, covering 6 million knowledge workers and over 100,000 active deployments of its Print Management solutions.“Through the acquisition of Nuance’s document imaging division, Kofax will drive customer value by adding key technologies, including cloud compatibility, scan-to-archive, scan-to-workflow, print management and document security, to our end-to-end Intelligent Automation platform,” said Reynolds C. Bish, Chief Executive Officer of Kofax. “In addition we will now be able to combine the best capture and print management capabilities available in the market into one product portfolio.”Kofax said this makes it the leader in this area globally: and indeed it is racing to keep ahead of competition.RPA has been one of the fastest-growing areas in IT, fueled by the rising interest in bringing more AI into enterprise services. UiPath, one of the leading startups in the space, has raised close to $400 million in two separate rounds this year on the back of its rapid growth. Just last week, UiPath just last week expanded its own imaging capabilities."}