{"id": "The Boring Company goes brick-and-mortar with The Brick Store", "paragraph": "Elon Musk has shot out some crazy, unbelievable tweets over the last year, but he wasn’t joking about the bricks. Musk has started a company called The Brick Store LLC to produce and sell bricks, according to public documents obtained by TechCrunch. The new company, which was founded in July, will be managed by Steve Davis, the ex-SpaceX engineer who is also running The Boring Company (TBC).TBC is developing new tunneling and transportation technologies, and the bricks will be made from soil displaced by the company’s tunnel-boring machines. Elon Musk has tweeted that the bricks could cost as little as 10 cents each, and might even be given away to affordable housing projects. The Brick Store’s first physical outlet will be a far cry from Tesla’s sleek, designer showrooms. Planning documents submitted to Hawthorne, a city in southwestern Los Angeles County, show a rundown stucco building about a mile from TBC and SpaceX’s headquarters. Forbidding black steel security grilles “will be utilized … to accent the entrances and windows,” TBC wrote in its application to repaint the building. Despite these design flourishes, TBC did not select the building for its aesthetic appeal. The building — formerly housing a kitchen cabinet business — is located above an exit tunnel that TBC is digging to extract the boring machine from its first test tunnel. This is intended to showcase Loop, a proposed underground transportation system carrying people or cars on self-contained electric skates traveling at up to 150 miles per hour. The tunnel was originally planned to stretch around two miles under public roads from a parking structure next to SpaceX. However, in April this year, TBC used a subsidiary to quietly buy the Hawthorne corner lot, which sits about halfway along the planned route, for $2 million. In July, TBC asked Hawthorne for permission to use that lot to build an access shaft to extract its tunnel-boring machine, which, because it cannot move backwards, would otherwise have been abandoned at the end of the excavation. The same month, Musk founded The Brick Store, whose purpose, according to state filings, is the “manufacture and sale of bricks.” TBC has already produced some structures from bricks made from tunnel spoil, and Musk tweeted yesterday that they would be used to build a watchtower at the entrance to the tunnel. The Boring Company  is building a watchtower in LA out of dirt bricks & we need a knight to yell insults at people in a French accent https://t.co/VChOVXXVaz— Elon Musk  (@elonmusk) November 15, 2018Turning tunnel waste into a valuable commodity fits in with Musk’s environmental leanings — and will save TBC from the cost of disposing all that dirt. TBC has even suggested that the bricks could potentially be used as part of the tunnel lining itself. Musk has previously said that the tunnel would officially open on December 10. TBC did not immediately respond to requests for comment on this story. Bricks made from everyday soil, usually called compressed earth blocks (CEB), date back to ancient times. CEBs are still used in developing countries today, and are part of building codes in California and New Mexico. But even there, the market for them is tiny — possibly because CEB buildings can be awkward to build, wire and insulate. BC has even suggested that the bricks could potentially be used as part of the tunnel lining itself. Dwell Earth sells machines that produce CEBs by applying pressure to a mixture of earth and a little cement. “Elon seems to have a way of bringing energy and talent to big challenges, and we are happy to see that he may be as excited about [CEBs] as we are,” Dwell Earths founder Bob de Jong told TechCrunch.TBC received around $112 million from Musk earlier this year. These funds will be used to build a number of tunnels around the country, including a Loop to connect Dodger Stadium to the subway in L.A., one that would link Chicago and O’Hare airport, as well as an ambitious commuter Loop between Washington, D.C. and Maryland.These projects could be thwarted, or at least delayed, because of an increasingly heated trade war between the U.S. and China. TBC lawyers wrote to the United States Trade Representative in July that the tariffs imposed by President Trump on Chinese-tunneling machine parts, among other products, would delay its projects by up to two years and mean lost job opportunities. The company asked for an exemption from the tariffs that has not yet been granted. If there’s anyone who can re-brand dirt and build a market for CEBs, it’s Elon Musk. But even if The Brick Store’s bricks don’t raise enough money for a Mars mission or save the planet, at least they are a little more practical than a novelty “not a flamethrower.”"}