{"id": "The team behind XOXO is taking over Kickstarter’s Drip crowdfunding community", "paragraph": "Two years ago, Kickstarter acquired Drip, an indie musician crowdfunding platform, on the eve of the service’s untimely demise. After relaunching Drip last year, Kickstarter is again reinventing the Patreon-like artist platform. This time, by placing it under the stewardship of two guys who love indie creators so much they dreamed up a whole festival about it.The idea grew out of conversations between Kickstarter principal founder Perry Chen and Andy Baio, Kickstarter’s  former (and first) chief technology officer and one half of XOXO Fest, a sometimes annual, very beloved celebration of independent artists and creators. XOXO co-founder Andy McMillan will join Baio on the project, with an undisclosed round of seed funding provided by Kickstarter.Kickstarter buys Drip, a community for independent musicians“Andy [McMillan] and I had been thinking about this for some time,” Baio said in an interview with TechCrunch. “The whole thing being about celebrating independent artists, bringing them together to talk about difficult things… So much of what we’ve focused on was that: helping independent artists who use the internet to make a living.”The two Andys (as they’re known at XOXO) maintain a very active year-round Slack composed of former XOXO attendees, a responsibility that’s seen them grow into their role as stewards of a community that’s taken on a life of its own, both online and off. For their new project — the evolution of Drip into a yet-to-be-named community and crowdfunding hub — Baio and McMillan have formed a public-benefit corporation to reflect their values and those of Kickstarter, also a public-benefit corporation. Chen clarifies that the new site is separate from Kickstarter and will “not be a subsidiary in any way, wholly its own thing [with] its own leadership.”It’s too early to say if Baio and McMillan plan to weave the new platform into XOXO Fest, but the two projects are “really closely aligned in mission,” Baio said. Some of Drip’s existing creators are XOXO Fest regulars and the event itself grew out of a successful Kickstarter that raised $175,511 back in 2012. “I think we’re all used to seeing at this point how the platforms that we use have failed,” Baio said. “The challenges that independent artists face are so profound already — to then have the tools and the platforms that you’re using work against you has been a painful thing.” That pain was a central theme at XOXO Fest this year, which I attended. (Full disclosure: I was also an early member of the XOXO Outpost, a year-round creative space that grew out of the festival.) Across genres, writers, musicians and developers alike expressed concerns that unaddressed harassment, racism and misogyny had turned once well-loved social platforms against some of the users who need them most.“We really hope that we can show people that this platform reflects the values and care we have for the artists that we care about,” Baio said. “We want it to be sustainable and independent for a long time.”"}