{"id": "Firefox’s newest Test Pilot experiments help you track prices and email links", "paragraph": "Test Pilot is Mozilla’s program for experimenting with some of its more outlandish ideas for Firefox and beyond. Some of those experiments make it into the browser itself, some become standalone extensions and others get unceremoniously canned. Today, the organization is announcing two new Test Pilot projects: Price Wise, which lets you track the price of items in online stores, and Email Tabs, a tool for making it easier to send links to people by email.Price Wise is a pretty self-explanatory service. It works for Best Buy, eBay, Amazon, Walmart and Home Depot, and lets you track price changes right in Firefox. That’s obviously not a novel idea. Plenty of other extensions do the same. Still, it’s nice to see a tool like this from a relatively neutral source. Mozilla  tells me that all of the work happens on the user’s machine and that all of the development was done in-house, without relying on third-party tools. Mozilla also notes that it’s not monetizing this service through affiliate links.One interesting side note here is that Mozilla is using machine-learning to power Price Wise. “We leverage machine learning outside the extension to make it happen,” a spokesperson told me. “You’ll be hearing more from us about machine learning as we evaluate more use cases to help Firefox users in their day to day without sacrificing privacy.”While the idea behind Price Wise isn’t exactly new, Email Tabs is a more novel concept. The idea here is to make it easier for you to send links by email, which is apparently still the most popular way to share links, even today. Typically, that’s a process of copying and pasting links, which gets the job done, but isn’t exactly an elegant solution — or at least that’s what the engineers at Mozilla thought. When you click the Email Tabs button, the extensions let you choose which tabs you want to share and how much of the content from a link you want to be part of the email it creates for you. That could be just the link, but also a screenshot or the full text of the page you’re linking to.Right now, this only works with Gmail, but you can also copy all the info to the clipboard and then paste it at will.These two new experiments are now available for anybody who signs up to the Test Pilot program.Mozilla also announced today that two of its previous experiments are about to graduate. Send, which lets you encrypt and share large files up to 1GB, will be updated and relaunched later this year. Color, which lets you customize the look of Firefox to your heart’s content, will become a standalone extension and Side View, which lets you view two browser windows side-by-side inside the same Firefox window, is joining Color as a standalone extension."}