{"id": "Tiger Global returns with a $3M investment to help restaurants deal with delivery apps", "paragraph": "Tiger Global has returned to backing early-stage Indian startups after it wrote a $3 million check for CheckMate, a U.S.-Indian startup that helps restaurants deal with the pain of multiple food ordering platforms.The Series A and it represents the first time that CheckMate has raised outside funding for its business. It is also a return to early-stage investing in India — where CheckMate’s largest office is — for Tiger Global following a period of relative inactivity.Founded two-and-a-half years ago initially as a bill-splitting app, CheckMate provides a platform that unifies food and payments to ease the chaos of working with modern consumer platforms. In this current age, restaurants simply must work with platforms like Uber Eats,  Postmates, GrubHub, DoorDash and others to get orders, but the services don’t play together, or even with, existing restaurant systems.That means that each service requires its own tablet for managing orders. On top of that, none integrate with order systems that print receipts for chefs or point-of-sale software. That means that restaurant staff must not only operate a bunch of iPads to handle the orders, but they have to manually enter them into their ordering systems (to ensure the ticket is processed so the order is cooked), then handle point of sale and bank the order for accounts.That’s a lot of manual hassle, and it’s the core issue that CheckMate aims to solve.It effectively operates like a bridge that connects the various delivery platforms to a restaurant’s management system. It automatically feeds orders from multiple food delivery services into the ordering system, and feeds the sales back into the restaurant management system. That helps keep the orders moving quickly, whilst managing account and sales without manual input.“Online orders are still treated as a stepchild that’s alien to the business,” CheckMate founder and CEO Vishal Agarwal told TechCrunch in an interview. “With our solution, we inject online orders into the true heart and center of these businesses.”Headquartered in New York where Agarwal is based, CheckMate has rolled out to more than 1,000 locations in the U.S., and it counts Five Guys among its customers. The company recently expanded to Australia with its first customers, and Agarwal — previously with e-commerce company Choxi.com — said he is looking for further international growth. The plan to get it, however, is by piggybacking the POS systems it supports, including Brink, Toast and Revel, rather than establishing CheckMate’s own sales team.That makes a lot of sense since the POS providers have a major incentive for linking their restaurant customers with CheckMate because it streamlines their operations and makes their life easier. It also helps keep CheckMate lean and mean.The team itself is already lean and international. While Agarwal, who comes from India, is based in New York, the rest of his 10-person U.S. team is distributed, while the operations and tech team of 25 is located in CheckMate’s India office.Because there are no public APIs, CheckMate has built its own platform in conjunction with food delivery services, and now Agarwal — who said he has invested his own money in CheckMate — plans to double down on R&D, and in particular more integrations, by using this Series A raise for hiring.“Technology in the restaurant sector is under-utilized — I was coming from an e-commerce background where technology is everywhere,” he explained. “We quickly realized how much resistance to tech there is and we want to make it as easy as possible for operators to adopt our product.”That simplicity also applies to CheckMate’s pricing model, which was recently adjusted. Previously, the company charged a set-up fee, but that has been abolished in favor of two tiers: $85 per restaurant for up to two platforms, and $100 for unlimited platforms per location.“As restaurants streamline their operations to take advantage of rapidly increasing online orders, we\nexpect hundreds of thousands of restaurants to benefit from Checkmate’s unique solution,” Tiger Global partner Scott Shleifer said in a prepared statement.The deal is an interesting one for Tiger Global, the 17-year-old New York investment firm that just closed a new $3.75 billion fund. The firm became well-known for writing bold checks that backed ambitious startups in India a couple of years ago before it put the brakes on that strategy.According to a multitude of media reports, the firm’s management grew concerned that it was overexposed in India, where it had deployed some $2 billion via deals in unicorns like Flipkart  and Uber rival Ola. Flipkart’s exit via a majority investment from Walmart, however, made the firm around $3 billion in returns, while it also retained a small stake in the business, which is tipped to have its own IPO in the future.Tiger Global executive Lee Fixel, who spearheaded the India strategy, is said to have spent the last year working closely with Flipkart to realize the deal. Now that it is done, Tiger Global is said to be returning to investment mode in India, according to a recent Economic Times story. That means that CheckMate may be the first of many as the tiger begins to roar again."}