{"id": "Cities that didn’t win HQ2 shouldn’t be counted out", "paragraph": "The more than year-long dance between cities and Amazon  for its second headquarters is finally over, with New York City and Washington, DC, capturing the big prize. With one of the largest economic development windfalls in a generation on the line, 238 cities used every tactic in the book to court the company – including offering to rename a city “Amazon” and appointing Jeff Bezos  “mayor for life.”Now that the process, and hysteria, are over, and cities have stopped asking “how can we get Amazon,” we’d like to ask a different question: How can cities build stronger start-up ecosystems for the Amazon yet to be built?In September 2017, Amazon announced that it would seek a second headquarters. But rather than being the typical site selection process, this would become a highly publicized Hunger Games-esque scenario.An RFP was proffered on what the company sought, and it included everything any good urbanist would want, with walkability, transportation and cultural characteristics on the docket. But of course, incentives were also high on the list.Amazon could have been a transformational catalyst for a plethora of cities throughout the US, but instead, it chose two superstar cities: the number one and five metro areas by GDP which, combined, amounts to a nearly $2 trillion GDP. These two metro areas also have some of the highest real estate prices in the country, a swath of high paying jobs and of course power — financial and political — close at hand.Perhaps the take-away for cities isn’t that we should all be so focused on hooking that big fish from afar, but instead that we should be growing it in our own waters. Amazon itself is a great example of this. It’s worth remembering that over the course of a quarter century, Amazon went from a garage in Seattle’s suburbs to consuming 16 percent — or 81 million square feet — of the city’s downtown. On the other end of the spectrum, the largest global technology company in 1994 (the year of Amazon’s birth) was Netscape, which no longer exists.The upshot is that cities that rely only on attracting massive technology companies are usually too late.At the National League of Cities, we think there are ways to expand the pie that don’t reinforce existing spatial inequalities. This is exactly the idea behind the launch of our city innovation ecosystems commitments process. With support from the Schmidt Futures Foundation, fifty cities, ranging from rural townships, college towns, and major metros, have joined with over 200 local partners and leveraged over $100 million in regional and national resources to support young businesses, leverage technology and expand STEM education and workforce training for all.The investments these cities are making today may in fact be the precursor to some of the largest tech companies of the future.With that idea in mind, here are eight cities that didn’t win HQ2 bids but are ensuring their cities will be prepared to create the next tranche of high-growth startups. AustinAustin just built a medical school adjacent to a tier one research university, the University of Texas. It’s the first such project to be completed in America in over fifty years. To ensure the addition translates into economic opportunity for the city, Austin’s public, private and civic leaders have come together to create Capital City Innovation to launch the city’s first Innovation District at the new medical school. This will help expand the city’s already world class startup ecosystem into the health and wellness markets.BaltimoreBaltimore is home to over $2 billion in academic research, ranking it third in the nation behind Boston and Philadelphia. In order to ensure everyone participates in the expanding research-based startup ecosystem, the city is transforming community recreation centers into maker and technology training centers to connect disadvantaged youth and families to new skills and careers in technology. The Rec-to-Tech Initiative will begin with community design sessions at four recreation centers, in partnership with the Digital Harbor Foundation, to create a feasibility study and implementation plan to review for further expansion.BuffaloThe 120-acre Buffalo Niagara Medical Center (BNMC) is home to eight academic institutions and hospitals and over 150 private technology and health companies. To ensure Buffalo’s startups reflect the diversity of its population, the Innovation Center at BNMC has just announced a new program to provide free space and mentorship to 10 high potential minority- and/or women-owned start-ups.DenverLike Seattle, real estate development in Denver is growing at a feverish rate. And while the growth is bringing new opportunity, the city is expanding faster than the workforce can keep pace. To ensure a sustainable growth trajectory, Denver has recruited the Next Generation City Builders to train students and retrain existing workers to fill high-demand jobs in architecture, design, construction and transportation. ProvidenceWith a population of 180,000, Providence is home to eight higher education institutions – including Brown University  and the Rhode Island School of Design  – making it a hub for both technical and creative talent. The city of Providence, in collaboration with its higher education institutions and two hospital systems, has created a new public-private-university partnership, the Urban Innovation Partnership, to collectively contribute and support the city’s growing innovation economy. PittsburghPittsburgh may have once been known as a steel town, but today it is a global mecca for robotics research, with over 4.5 times the national average robotics R&D within its borders. Like Baltimore, Pittsburgh is creating a more inclusive innovation economy through a Rec-to-Tech program that will re-invest in the city’s 10 recreational centers, connecting students and parents to the skills needed to participate in the economy of the future. TampaTampa is already home to 30,000 technical and scientific consultant and computer design jobs — and that number is growing. To meet future demand and ensure the region has an inclusive growth strategy, the city of Tampa, with 13 university, civic and private sector partners, has announced “Future Innovators of Tampa Bay.” The new six-year initiative seeks to provide the opportunity for every one of the Tampa Bay Region’s 600,000 K-12 students to be trained in digital creativity, invention and entrepreneurship.These eight cities help demonstrate the innovation we are seeing on the ground now, all throughout the country. The seeds of success have been planted with people, partnerships and public leadership at the fore. Perhaps they didn’t land HQ2 this time, but when we fast forward to 2038 — and the search for Argo AI, SparkCognition or Welltok’s new headquarters is well underway — the groundwork will have been laid for cities with strong ecosystems already in place to compete on an even playing field."}