{"id": "Coinbase is now worth more than all but three cryptocurrencies", "paragraph": "With its shiny new $8 billion valuation, Coinbase is now worth more than all but the top three cryptocurrencies that trade on the platform.That’s right, the only cryptocurrency assets that are worth more than the platform that trades them are Bitcoin,  Ethereum and Ripple. Bitcoin Cash, the currency forked from Bitcoin, is a distant fourth in valuation at $7.3 billion.Coinbase’s  Series E is nearly three times as much as the company raised in its Series D, and the fresh cash brings Coinbase’s total-capital-raised-to-date to over $520 million.That’s a lot of money. Indeed, if Coinbase’s capital raised figured is compared to the market cap of the world’s various cryptocurrencies and other similar assets, it would rank around 20th.But the bet for investors is, and should be, that if cryptocurrencies are indeed the next big idea in the ways that humans determine value, then Coinbase should be worth far more than any of the assets that trade on its exchange.The fact that it’s neither indicates how much farther the company has to grow, or the limits of the thesis that cryptocurrencies will take over the world.It shows that the wager on a particular crypto company is looking like a better investment than putting money to work in nearly any of the other crypto assets that are for sale. During the last few crypto booms, some investors said that it was probably simpler to just invest in various tokens instead of companies working on blockchains — faster returns and your money would be more liquid, to boot.However, at least in the case of Coinbase, that wager likely wouldn’t have worked. Coinbase is also the company that every investor has wanted to invest in; it’s been a known winner for a while now, so its performance isn’t a huge surprise.And now with $300 million, Coinbase is well-capitalized to survive either a market downturn (one will come eventually), and the current Crypto Interregnum.Coinbase’s chief executive certainly thinks the market will grow. As we noted, Coinbase currently allows trading to just a handful of cryptocurrencies, but it has long harbored ambitions to expand beyond that.Speaking at TechCrunch Disrupt SF in September, CEO Brian Armstrong revealed that he sees a future in which every cap table will have its own token. Based on that, he said he believes that Coinbase could host hundreds of tokens within “years” and even potentially “millions” in the future."}