{"id": "Pitching a $99 tax advisory service for the masses, Visor has raised $9 million", "paragraph": "The only sure things in this life, according to Ben Franklin, are death and taxes. And a new startup called Visor has just raised $9 million in financing to make one of them as painless as possible.Unlike Nectome, Visor isn’t “100% fatal“*, but it may ring the death knell for the high-end tax advisors that most Americans can’t even access to get help filing and paying their taxes. It’s like having a personalized accountant for the cost of a high-end do-it-yourself tax-prep service.The $9 million Visor raised came from the venture capital firm Defy, with participation from Unusual Ventures, SVB Capital and existing investors like Obvious Ventures, Fika Ventures and Boxgroup, which had put a previous $6.5 million into the company. The idea for the company had been percolating for co-founder and chief executive Gernot Zacke since he settled in the U.S. Growing up in Sweden, Zacke was exposed to a much different process for paying taxes. “The experience of filing taxes in Sweden is that you receive a message from the government that stated how much you made and how much you were withholding. That’s it,” said Zacke. “Taxes should be as easy as ordering a cab.”That’s the service that Visor aims to provide.“If you think about the market there are two ways to get your taxes done. There’s the DIY space and then there are other online services but it requires the tax payer to fill out the forms and it leaves the tax payer with a little bit of anxiety,” said Zacke. “We’re delivering the CPA experience through the convenience of a web app and a mobile app.”On average, Americans spend about 13 hours each year dealing with taxes, and the average American doesn’t have the benefits of a professional advisor who can help optimize the process. That’s what Visor wants to provide.“You provide the same amount of information you provide to a CPA or TurboTax… we make sure that that information is filed securely on AWS and shared between the docs and the backend,” said Zacke. The target customers for Zacke’s services are folks who have had a change to their tax situation — whether moving, buying a home or any other life event; or folks who have had a CPA and don’t want to pay the higher fees, he said.Visor currently has an operations team of around 34 people split between San Francisco and Atlanta.For Zacke, the pain point he’s solving with the Visor service is very real. A former employee of the European investment firm Atomico,  Zacke bounced between the U.S. and Europe — eventually running U.S. investments for the firm before leaving to launch Visor.Other co-founders and senior executives hail from the tax advisory world, and from employee benefits outsourcing services company Zenefits,  along with former Venmo  and Square developers.“Taxpayers spend $20 billion a year to get their taxes prepared and are stuck between spending hours filling out DIY tax software and hiring an expensive CPA,” said Zacke, in a statement. “*After a lengthy conversation with Nectome’s public relations rep, it’s worth noting that the company is apparently not working with human subjects (or is no longer working with human subjects?). It has taken deposits totaling $200,000 from people who want to use its services, according to multiple reports."}