{"id": "Facebook to let French regulators investigate on moderation processes", "paragraph": "Facebook  and the French government are going to cooperate to look at Facebook’s efforts when it comes to moderation. At the start of 2019, French regulators will launch an informal investigation on algorithm-powered and human moderation. Facebook is willing to cooperate and give unprecedented access to its internal processes.This announcement is the result of informal talks between Facebook’s top executives and the French government that started with the Tech for Good Summit back in May. Former British Deputy Prime Minister and Facebook Vice President for Global Affairs and Communications Nick Clegg unveiled the program during a lunch reception at the Élysée.“It is in that context significant and welcome that the French government and Facebook are going to announce a new initiative,” Clegg said. “That model of co-regulation of the public tech sector is absolutely key.”French President Emmanuel Macron’s  vision of tech regulation can be summed up in three words: inclusion, trust and cooperation. In his closing remarks at lunch, he once again said that there needs to be a third way to regulate tech — not the Chinese one, not the American one. President Macron also mentioned the program during a speech at the Internet Governance Forum in Paris.Regulators will look at multiple steps: how flagging works, how Facebook identifies problematic content, how Facebook decides if it’s problematic or not and what happens when Facebook takes down a post, a video or an image.This type of investigation is reminiscent of banking and nuclear regulation. It involves deep cooperation so that regulators can certify that a company is doing everything right.According to a source close to Macron, current internet regulation is broken. Governments are asking for results and social networks have to deal with moderation issues on their own — regulators aren’t doing enough.It’s still unclear who’s going to be in charge of this investigation. There could be regulators from France’s telecom regulator (ARCEP), from the government’s tech team (DINSIC), from the TV and radio regulator (CSA)… There’s one thing for sure, the French government wants to focus on hate speech for now, so don’t expect anyone from the privacy regulator (CNIL).The investigation isn’t going to be limited to talking with the moderation teams and looking at their guidelines. The French government wants to find algorithmic bias and test data sets against Facebook’s automated moderation tools.By focusing on a small scope and starting with an informal investigation, the French government managed to convince Facebook to collaborate. But it could still lead to new regulations down the road.According to a source close to the French president, this is also in Facebook’s interest. Regulators could introduce widespread regulation without consulting the company. But this process should lead to fine-grained regulation."}