{"id": "What’s next? The top media executives on the job market", "paragraph": "Keep an eye out for the next moves by these entrepreneurs and executives. A number of the biggest names in media left their jobs over the last year (or announced they will be leaving soon), including a handful of now-billionaires who have resources, ambition, and time on their hands to explore something new.We are experimenting with new content forms at TechCrunch. This is a rough draft of something new —provide feedback directly to the author, Eric Peckham (@epeckham), our columnist focused on the intersection of media and technology.Most notably, there are Instagram co-founders Kevin Systrom and Mike Krieger, 21st Century Fox CEO James Murdoch (with rumored plans to launch a VC firm), Beats co-founder Jimmy Iovine, VICE founder/CEO Shane Smith (who transitioned to a Chairman role), Oculus co-founder Brendan Iribe, and Oath’s CEO Tim Armstrong.There’s also a long list of other names you may not recognize but should keep on your radar in the months ahead as they found new startups or take key leadership roles at top media/tech companies.Today, Snap’s VP of Content Nick Bell announced he will be leaving the company by the end of the year. He oversaw all media partnerships and content operations for the Snapchat Discover section over the last 5 years. The 34-year old sold his first company, Teenfront.com, at age 16 and started multiple ventures afterward until joining global media conglomerate News Corp (where he became SVP of Digital Product). As a serial entrepreneur and one of the most sought-after experts in digital video, expect Bell’s next move to be noteworthy.Nick Bell was one of the smartest, most in-tune people when it came to the future of content. His exit bodes poorly for Snapchat fixing Discover & winning at original content. Bet Instagram wouldn't mind having him run IGTV https://t.co/JBlAx6E7xr— Josh Constine (@JoshConstine) November 12, 2018Here are 12 other leaders at the intersection of media and technology who are currently available (publicly, at least) and plotting their next endeavor:Joanna Coles, Photo by Amanda Voisard for The Washington Post via Getty Images.Joanna Coles,  former Chief Content Officer at Hearst\nJoanna Coles, who oversaw all editorial operations for the 300-title global publishing group Hearst since September 2016, announced with a fun video on August 6 that she would be stepping down. The former editor-in-chief of Cosmopolitan and Marie Claire (as they shifted into a digital-first era) said she would announce her next adventure sometime this fall after taking a break. Coles has been a board member of Snap since 2015 and was appointed as an Officer of the Order of the British Empire.Rich Battista, former CEO of Time Inc\nTime Inc’s CEO left the helm of the publishing group upon its $2.8 billion acquisition by Meredith Corp in the spring. Battista held a range of major publishing, TV, and digital media roles before then, from leading Fox’s cable networks to running Mandalay Sports Media to turning around Gemstar-TV Guide and selling it for $2.3 billion. At various points in his career Battista has been a big company executive, an investor, and an entrepreneur.Joel Stillerman, former Chief Content Officer at Hulu\nStillerman was one of several executives who departed Hulu in May in a leadership reshuffle by the company’s new CEO. Stillerman was previously President of Original Programming and Development for AMC and SundanceTV. At a time when nearly every major TV company is vying to compete with Netflix through another streaming video platform (on their own or in partnership with others), there’s a lot of expertise to be had from the executive to oversaw all content for Netflix’s top competitor.George Strompolos, Founder and former CEO of Fullscreen\nAfter AT&T acquired The Chernin Group’s remaining stake in Otter Media (Fullscreen’s parent company) in September, Fullscreen’s George Strompolos stepped down as CEO of the multi-channel network he founded in 2011. According to his LinkedIn profile, LA-based Strompolos in advising and investing in startups for the time being.Erik Huggers,  former CEO of VEVO\nHuggers stepped down from VEVO in April after 3 years. He was previously an SVP at Verizon and President of Intel Media (which Verizon acquired). As a supervisory board member of Germany’s largest broadcasting group, ProSiebenSat.1, Huggers has also recently joined the board of ProSiebenSat.1’s streaming TV service 7TV, which is a joint venture with Discovery Inc.Photo courtesy of Sophie Watts.Sophie Watts, former President of STX Entertainment\nSophie Watts joined investor Robert Simonds in 2011 to develop a new film/TV studio with backing from TPG Growth. According to the WSJ, STX Entertainment has been planning a $500 million IPO in Hong Kong. As president, she primarily oversaw unscripted TV, digital, and VR operations. She left in January to explore new opportunities. Watts—who started her career in London producing videos for Beyoncé, Elton John, Madonna, Mariah Carey, and others—was named to Fortune’s 40 Under 40 in 2016 and is still just 33.Jonathan Carson, former President of Mic\nCarson founded 3 startups (music social network Outer Sound, interactive media consultancy Intercities, and social media intelligence company BuzzMetrics) before becoming the “CEO of Digital” at Nielsen and then the Chief Revenue Officer at VEVO. In July, he stepped down from VC-backed news startup Mic after one year as President. Expect his next move to be within the same realm of video, social, mobile, and data that he’s worked in thus far.Colin Carrier, former Chief Strategy Officer at Twitch\nCarrier joined Twitch in 2013, leaving the Eversport Media startup he co-founded to become General Manager of Justin.TV which operated independently from the rest of Twitch. He transitioned to become Twitch’s Chief Strategy Officer in 2014 upon Amazon’s $1 billion acquisition of the live-streaming platform. While CSO, he oversaw the acquisition of CurseMedia and ClipMine and developed a personal angel investment portfolio of over 30 startups (including Cruise, which GM acquired for over $1B). He departed Twitch over the summer.Troy Carter speaks onstage during TechCrunch Disrupt SF 2015 (Photo by Steve Jennings/Getty Images for TechCrunch)Troy Carter,  former Global Head of Creator Services at Spotify\nA career talent manager in the music industry who worked with artists like Lady Gaga, John Legend, and Meghan Trainor, Carter joined Spotify in June 2016 as the face of the streaming service within the music industry. Having stepped down in September, he is among several top executives who have left Spotify in 2018 before and after it listed on the NYSE. Carter—who also built an angel investing portfolio of over 40 startups—hasn’t announced his next endeavor but appears to still be making investments through the VC fund he co-founded, Cross Culture Ventures.Stefan Blom,  former Chief Content Officer of Spotify\nBlom left Spotify early this year just before the music streaming service went public with a $29 billion market cap. He had been Chief Strategy Officer and Chief Content Officer over the prior 4 years, working in part on Spotify’s early steps into original video (which it retreated from). Before Spotify, he was CEO of the Nordic division at EMI (a notable record label group). Matthew Ball, former Head of Strategy at Amazon Studios\nBall joined Amazon Studios as Head of Strategy in 2016 after working within The Chernin Group as Director of Strategy & Business Development for Otter Media (which is now fully owned by AT&T). Since leaving Amazon earlier this year, he has continued to publish widely-read blog posts about the future of media for MediaREDEF—which he has been doing since 2014—and, according to his Twitter bio, is currently “tinkering away on a small idea that could be more”.Matt Pincus, Founder and former CEO of SONGS Music Publishing\nLast December, Pincus sold his innovative music publishing firm SONGS Music Publishing, which had become the largest independent publishing of contemporary music in the US, to Kobalt for a rumored $150 million. He departed in March and has since become a Special Advisor to Snap Inc and taken an Entrepreneur-in-Residence title at leading digital media merchant bank LionTree.Who are other top executives at the intersection of media + tech who are launching new companies or available to fill open CEO roles? Let me know on Twitter at @epeckham."}