{"id": "Facebook launches ‘Hunt for False News’ debunk blog as fakery drops 50%", "paragraph": "Facebook  hopes detailing concrete examples of fake news it’s caught — or missed — could improve news literacy, or at least prove it’s attacking the misinformation problem. Today Facebook launched “The Hunt for False News,” in which it examines viral B.S., relays the decisions of its third-party fact-checkers and explains how the story was tracked down. The first edition reveals cases where false captions were put on old videos, people were wrongfully identified as perpetrators of crimes or real facts were massively exaggerated.The blog’s launch comes after three recent studies showed the volume of misinformation on Facebook has dropped by half since the 2016 election, while Twitter’s volume hasn’t declined as drastically. Unfortunately, the remaining 50 percent still threatens elections, civil discourse, dissident safety and political unity across the globe.In one of The Hunt’s first examples, it debunks that a man who posed for a photo with one of Brazil’s senators had stabbed the presidential candidate. Facebook explains that its machine learning models identified the photo, it was proven false by Brazilian fact-checker Aos Fatos, and Facebook now automatically detects and demotes uploads of the image. In a case where it missed the mark, a false story touting NASA would pay you $100,000 to study you staying in bed for 60 days “racked up millions of views on Facebook” before fact-checkers found NASA had paid out $10,000 to $17,000 in limited instances for studies in the past.While the educational “Hunt” series is useful, it merely cherry-picks random false news stories from over a wide time period. What’s more urgent, and would be more useful, would be for Facebook to apply this method to currently circulating misinformation about the most important news stories. The New York Times’ Kevin Roose recently began using Facebook’s CrowdTangle tool to highlight the top 10 recent stories by engagement about topics like the Brett Kavanaugh hearings.Top performing Kavanaugh-related posts on Facebook over the last 24 hours (per @crowdtangle) come from:1. Trump2. Fox News3. Franklin Graham4. Fox News5. CNN6. NRA Institute for Legislative Action7. GOP8. Ben Shapiro9. The Sage Page10. FreedomWorks11. NRA12. Breitbart— Kevin Roose (@kevinroose) October 7, 2018If Facebook wanted to be more transparent about its successes and failures around fake news, it’d publish lists of the false stories with the highest circulation each month and then apply the Hunt’s format explaining how they were debunked. This could help dispel myths in society’s understanding that may be propagated by the mere abundance of fake news headlines, even if users don’t click through to read them.The red line represents the decline of Facebook engagement with “unreliable or dubious” sitesBut at least all of Facebook’s efforts around information security — including doubling its security staff from 10,000 to 20,000 workers, fact checks and using News Feed algorithm changes to demote suspicious content — are paying off:Of course, given Twitter’s  seeming paralysis on addressing misinformation and trolling, they’re not a great benchmark for Facebook to judge by. While it’s useful that Facebook is outlining ways to spot fake news, the public will have to internalize these strategies for society to make progress. That may be difficult when the truth has become incompatible with many peoples’ and politicians’ staunchly held beliefs.In the past, Facebook has surfaced fake news-spotting tips atop the News Feed and bought full-page newspaper ads trying to disseminate them. The Hunt for Fake News would surely benefit from being embedded where the social network’s users look everyday instead of buried in its corporate blog."}