{"id": "GM is getting into the electric bike business", "paragraph": "General Motors said it plans to bring two new electric bikes to market next year — one folding and one compact — as the automaker makes a broader push into electrification and other ideas that try to move beyond its traditional business model of producing and selling gas-power vehicles.The automaker didn’t have a lot of information to share about the e-bikes or its ultimate plans. For instance, Hannah Parish, director of General Motors Urban Mobility Solutions, wouldn’t say if GM plans to launch a bike-sharing service as a result of these two new products.  “I can’t say anything is on or off the table at this point,” she added.Here’s what is on the menu. The bikes will be “smart” and “connected” and somehow inspired by GM’s OnStar, the company’s subscription-based communications, in-vehicle security and emergency services feature found in cars. Parish wouldn’t elaborate what that might look like. We’ll have to wait until next year.The bikes are also equipped with safety features including rechargeable front and rear LED lights. And the electric propulsion on the bikes were designed by GM engineers who created a proprietary drive system. “We know that people who live in urban areas, like myself in downtown Toronto need different opportunities to use different types of transportation when they going and doing different things. We know that congestion in cities is a problem and the e-bikes feed right into our efforts,” Parish, director of General Motors Urban Mobility Solutions told TechCrunch. GM revealed two eBikes – one folding and one compact.For now, GM is focused on naming the e-bikes. And it’s turning to the public to help. The company launched a brand-naming campaign Friday as part of its broader e-bike announcement. Folks who want to name the e-bikes can go to www.eBikeBrandChallenge.com. The participant with the winning selection will receive $10,000. Nine other runners-up will each receive $1,000.Entries will be accepted until November 26. The winning submissions will be announced January 31, 2019."}