{"id": "These antique phones are precious, private Alexa vessels", "paragraph": "Amazon’s  Alexa may be in ten thousand different devices now, but they all have one other thing in common: they’re new. So for those of us that prefer old things but still want to be able to set timers and do metric-imperial conversions without pulling out our phones, Grain Design is retrofitting these fabulous old telephones to provide Alexa access with no other hints of modernity. There’s even a privacy angle!The phones themselves (spotted by a BoingBoing tipster) are genuine antiques, and not even the mass-produced Bell sets you see so often. I personally love the copper-plated model, though I certainly wouldn’t say no to the candlestick.Dick Whitney, who runs the company, modifies the hardware to make room for an Echo Dot inside. Pick up the phone and speak, and Alexa answers, just like the operators of yore! Except you can ask Alexa anything and it won’t be irritated. Some of the Alexaphones, as he calls them, will include the original audio hardware so you can experience the cognitive dissonance of talking to a virtual assistant and having them answer using a century-old speaker. (I bet it sounds terrible and brilliant.)I’m also delighted to say that the microphone physically disconnects when the phone is on the hook, though — so Amazon won’t be listening in to your conversations and emailing them to random people.“The Echo microphones have their connections severed or are removed completely, and the microphone in the handset is connected via the original switches in the base, so it’s only in contact when the handset is picked up,” explained Whitney in an email.The modifications to the phones don’t end there: in the rear of each will be a 1/8″ audio port so you can plug in a real speaker. No one wants to sit at their telephone table (remember those?) and listen to a few songs in mono through vintage hardware. Although having written that sentence I do have to say I’d try it once. Right now all the audio would have to go out that way, but Whitney says he may have a trick to switch it back and forth in the future (you can always just unplug the audio for privacy).There’s also an LED hidden on the front so you have that basic feedback of whether the device is on, listening and such. The rotary dial isn’t used, unfortunately, though more because it’s hard to apply its principles to a voice-operated device.“It’s funny,” he wrote when I asked about the latter, “I’d actually built an installation for Android at MWC [Mobile World Congress] a few years ago that used a rotary dialer, so I know how to do it and have the hardware around (it’s very simple), but both couldn’t figure out a function that seemed interesting enough (dial 1 to increase the volume? Certainly open to suggestions) and didn’t want to add more complexity inside the telephones. Maybe in the future!”No soldering or weird old tech stuff required on your part — the device will run on USB power and set up just like any other Alexa gadget. Of course, these things also cost $1,500. Yeah, kind of out of my price range, too. Still, they’re lovely and a great subversion of the “smart home” idea."}