{"id": "Tesla is rolling out a cheaper, mid-range Model 3", "paragraph": "Tesla  is now offering a new, cheaper mid-range battery version of the Model 3 that starts at $45,000 before federal tax incentives.CEO Elon Musk  announced the new variant, which has an estimated battery range of 260 miles, via Twitter. The company’s website has already been updated. Customers in the U.S. can order the mid-range version as of today and it will soon be offered in Canada as well. Musk tweeted that the mid-range Tesla Model 3 costs $35,000 after federal and state tax rebates in California.However, for customers to realize the full $7,500 federal tax incentive, they must take delivery of the electric vehicle by December 31, 2018. The delivery estimate for the mid-range version is 6 to 10 weeks, which means customers who order the vehicle by late October or early November should still be able to get the full tax credit.Earlier this year, Tesla delivered its 200,000th electric vehicle. The achievement activated a countdown for the $7,500 federal tax credit offered to consumers who buy new electric vehicles. The tax credit begins to phase out once a manufacturer has sold 200,000 qualifying vehicles in the U.S. Under these rules, Tesla customers must take delivery of their new Model S, Model X or Model 3 by December 31.Costs $35k after federal & state tax rebates in California, but true cost of ownership is closer to $31k after gas savings— Elon Musk (@elonmusk) October 18, 2018Musk explained in a subsequent tweet that the mid-range vehicle is outfitted with a long-range battery that has fewer cells. “Non-cell portion of the pack is disproportionately high, but we can get it done now instead of February,” he wrote.It should be noted that while this mid-range battery model is cheaper than the long-range dual motor Model 3 and the performance versions, it’s still not the $35,000 base-spec Model 3 (before incentives) that was originally promised. That low-cost model, which will feature a standard battery with a different architecture, won’t be available for 4 to 6 months.“As Model 3 production and sales continue to grow rapidly, we’ve achieved a steady volume in manufacturing capacity, allowing us to diversify our product offering to even more customers,” a Tesla spokesperson said in an emailed statement. “Our new Mid-Range Battery is being introduced this week in the U.S. and Canada to better meet the varying range needs of the many customers eager to own Model 3, and our delivery estimate for customers who have ordered the Standard Battery is 4-6 months.”"}