{"id": "Enterprise shopping season starts early with almost $50B in recent deals", "paragraph": "Black Friday may still be 10 days away, but shopping season started early in the enterprise this year. We have seen acquisitions totaling almost $50 billion in the last couple of months alone, topped by the mega $34 billion IBM-Red Hat deal two weeks ago. What exactly is going on here?While not every deal has been for that kind of money, we are seeing an unusually large number of mega deals this year, something that some folks were predicting would happen when the big tech companies were allowed to repatriate their money as part of last year’s tax deal.Let’s look at some of the multi-billion deals we have seen so far this year:Big companies are opening their checkbooks in a big way right now, buying everything from marketing to analytics to security companies. They are grabbing open source and proprietary. They are looking at ways to bridge the cloud and on-prem. There is a whole host of software and not much rhyme or reason across the deals.What they have in common is that they are enormous offers that are simply too huge to refuse. These companies flush with cash see opportunities to fill holes, and they are going for one piece after another.One of the reasons the prices are going so high is that there is a limited number of companies available to buy, and that is driving up the price, says Ray Wang, founder and principal analyst at Constellation Research. As he sees it, there are only 3-5 decent players per category right now. He compares that with 10 years ago when we were seeing 10-15 players per category. With a limited number of viable startups, companies seem to be going after these companies harder. Combine that with fat wallets full of cash, and you suddenly have this wave of super-sized deals.The companies being acquired by large organizations can justify selling in the usual ways. They can reward shareholders and investors. These larger organizations allow them to push their product roadmaps much more quickly than they could on their own. They give them access to international markets and mega sales teams.Still, companies have been spending unusually large sums for relatively small amounts of revenue. In deals over the last three weeks, we have seen IBM pay $34 billion for a company with around $3 billion in revenue. We saw SAP paying $8 billion for a mere $400 million in revenue.This certainly seems on its face to be a massive overpay, but Constellation’s Wang says ultimately this often comes down to a classic build versus buy decision. SAP could build a similar product to Qualtrics, or they could simply buy it and put the massive SAP salesforce to bear on it. “SAP can sell into 100,000 customers. They only have a 10 percent overlap with Qualtrics. The numbers work, and it beats taking a new product to market,” Wang told TechCrunch.Wang believes this could be the strategy behind many of these acquisitions, while admitting that the numbers sound a bit crazy. As he says, the formula used to be three times, three years trailing revenues. Now it’s 15-20 times. While those may be hard numbers to justify, he believes it’s a win-win for buyer and acquired — and investors win big too, of course.In many instances like Red Hat, GitHub and Qualtrics, the companies will likely remain separate, independent units inside the larger organization, at least for the time being, while looking for meaningful crossover inside the larger company when it makes sense.But Tony Byrne, founder and principal analyst at Real Story Group, says these large companies tend to listen to Wall Street, and customers should be wary of what they hear when it comes to their favorite products and services. “You cannot trust the initial pleasantries about continuity that come out of the first press release. These are huge vendors that listen first and foremost to Wall Street. If there’s an offering that doesn’t totally align with their story to investors, it is not going to get much love and is at risk for getting eliminated or calved off,” Byrne explained.It’s also hard to know how well two companies are going to fit together until the deal actually closes. Sometimes the acquiring company doesn’t know what they have or how to sell it. Sometimes the two companies don’t fit well together or the founders or key executives don’t fit smoothly into the new hierarchy. They try to figure this all out beforehand, but it’s not always easy to know how it will play out in reality.Regardless, we are seeing an unusually high level of massive acquisitions, and chances are, there are more coming."}