{"id": "Feeling left out of a hot market? This new outfit has a fund with shares of 30 top ‘unicorns’ to sell you", "paragraph": "When Equidate, a venture-backed secondaries marketplace based in San Francisco, closed its most recent round of funding with $50 million four months ago, it was hardly a surprising bet on the part of its backers. As startups linger ever longer as private companies, more people are looking to lock up shares wherever they can find them.Investors have plenty of platforms from which to choose. In addition to Equidate,  other companies that match investors with “pre-IPO” company shares include EquityZen, SharesPost and Seedrs. Still, individual investors have mostly been relegated to choosing this or that company on a piecemeal basis as shares have become available. Among few exceptions to this rule include investors in venture funds like 137 Ventures, whose express aim is creating a portfolio of secondary shares that have been acquired from earlier investors, founders, and employees, or in Industry Ventures, which has been buying up later-stage secondary shares since its founding in 2000. (Investing in SoftBank’s Vision Fund, which is piecing together a portfolio of unicorn companies, might be another option for people with enough access, though it comes with certain strings attached.)No wonder Equidate thinks there’s a better way. And with the financial wind at its back, it just began testing out its theory. How? By spinning off a new asset management business whose sole purpose is to acquire shares in the “top” companies that are currently valued at more than a billion dollars but that still trade privately.It isn’t going to buy five or 20 or 100 stakes. Instead, the portfolio will maintain positions in exactly 30 companies, and these will be adjusted on a quarterly basis, led by the person leading this new spin-off: Ziad Makkawi, a longtime investment advisor who recently spent two years as CEO of Qatar First Bank.As Equidate founder and president Sohail Prasad sees it, his company is already spending time learning an awful lot about Palantir and Stripe and WeWork and Pinterest. It tracks bid and ask activity, along with how pricing and valuations are reflected by both new transactions and time decay. To underscore how much data is coursing through Equidate, he says that company now sees $1 billion in transaction volume on its platform annually.After a point, he and the rest of Equidate’s management concluded that it made sense to create an index to track the health of these companies in a way that makes it easier to understand their performance relative to their peers (it rolled this out yesterday). It also decided to create a product around the index. Enter its new fund and accompanying asset management firm.“We’re excited,” says Prasad. “This is going to let people buy for the first time a basket of all of these companies, which are vetted and that are already in their growth stages and in, really, in previous years, would have been public already.”It’s easy to see other investors getting excited about a kind of exchange-traded fund filled with unicorns, too. But first things first. The new fund is still being raised, sounds like. It’s looking to close with between $50 million and $100 million in capital. It’s also worth noting that although SEC Chairman Jay Clayton has said he’d like the agency to allow more retail investors a shot at companies that have been out of their reach, Equidate’s new spin-off, Equiam, will still only accept checks from accredited investors, and they need to invest at least $250,000.There’s also the prickly question of whether the companies that investors want most are accessible to Equiam. Unsurprisingly, Prasad, argues that it’s not an issue. “Because we’ll be a larger fund, we’ll be able to buy blocks of preferred stock where traditionally a person might not have access. We do have access at this scale.”Well, if it’s able to raise its fund, maybe.As for what Equiam is charging in management fees, the fund is “incredibly low cost,” says Prasad. Investors will have to decide whether they agree, but those who write the fund a $1 million or bigger check will pay a 1.5 percent management fee. Investors who come in at between $250,000 and $1 million will pay a 2.5 percent management fee.If you’re curious, you can learn more by checking out Equiam’s site here."}