{"id": "With the Paris Call, Macron wants to limit cyberattacks", "paragraph": "French President Emmanuel Macron  gave a speech at the Internet Governance Forum at UNESCO in Paris. While the IGF has been around for a while, it hasn’t been as active as some would have hoped.That’s why the French government is issuing the Paris Call, a three-page document on cybersecurity. President Macron hopes to foster the IGF and create a subgroup of countries (and companies) that can agree on cybersecurity issues.“First, internet works and is here. And even though news bulletins are riddled with cyber incidents, we blindly trust tech tools,” Macron said.And yet, according to him, if the global community can’t agree on appropriate regulation, there’s a risk for the integrity of democratic processes. He thinks that there are currently two sides. Authoritarian governments already filter internet requests to restrict the web to a subset of the internet, while democratic countries let anyone browse a (mostly) unfiltered web.“Today’s cyberattacks can compromise health services. And if we don’t know for sure that the system is secure at all times, the system is going to fragment into multiple spaces.”In other words, cyberattacks could lead democratic countries to imitate China and block many web services in order to protect the network.“That’s why I came today to suggest a new collegiate method. This forum should produce more than debates and talks. It should become something new to support concrete decisions,” Macron said.He’s suggesting that the IGF should report to the Secretary-General of the United Nations directly. And he’s also supporting the Paris Call, an agreement between countries, companies and NGOs.Hundreds of organizations have already signed the Paris Call, such as most European countries, Microsoft, Cisco, Samsung, Siemens, Facebook, Google, the ICANN, the Internet Society, etc. But China and the U.S. have yet to sign the Paris Call.You can read the full text of the Paris Call here. Members of the Paris Call mostly agree to prevent cyberattacks of all sorts — it’s a peace offer.When it comes to content, Macron didn’t want to say that he was against the web. He mentioned that the web enabled the Democratic Spring, greater mobilization against climate change and women’s rights. But he also said that extremists are now leveraging the web for hate speech.“Giant platforms could become not just gateways but also gatekeepers,” Macron said.There have been efforts in the past when it comes to removing terrorist content and hate speech. But Macron now thinks that it should go further.That’s why Facebook and the French government are going to cooperate to look at Facebook’s efforts when it comes to moderation.Facebook to let French regulators investigate on moderation processesFinally, Macron used this opportunity to talk once again about France’s digital efforts. The French government has been working hard on a new way to tax tech giants in Europe so that they’re taxed more fairly. Macron framed it as a way to protect smaller companies from unfair competition. But negotiations are stuck for now.Macron also defended a third way when it comes to artificial intelligence investments and innovation."}