{"id": "Google’s Gboard now lets you create a set of emoji that look like you", "paragraph": "Last summer, Google  introduced its own take on Bitmoji with the launch of “Mini” stickers in its keyboard app, Gboard, which leverage machine learning to create illustrated stickers based on your selfie. Today, Google is expanding the Mini Stickers with the launch of what it calls “Emoji Minis” – meaning, emoji-sized stickers that look like you.Similar to the initial launch of Mini stickers, the new emoji are also created using machine learning techniques, Google says.The company said the idea is to give people a way to use emoji they feel better represent who they really are.“Emoji Minis are designed for those who may have stared into the eyes of emoji and not seen yourself staring back,” explained Google, in a blog post. “These sticker versions of the emoji you use every day are customizable so you can make them look just like you.”That means your emoji can have differently colored hair – like green or blue or gray, for example – or piercings. It can be wearing a hat, head covering, or glasses.Google says it uses neural networks to suggest skin tones, hairstyles, and accessories that you can then fine tune. You can choose a color for your hair, facial hair, or select different types of head covering and eyewear. You can also add freckles or wrinkles, if you want.The result is a not just a single emoji, but a selection of options. For example, you can use your custom emoji as a zombie, mage, heart eyes, crying eyes, shruggie, and all the others.This the third style of Mini stickers, first introduced last year. Already, these stickers come in two other styles – a more expressive “bold” and a nicer “sweet.”While it may seem like a minor thing, creative emoji – and specifically, personalized emoji – can be a big draw for messaging apps. Apple advertises its clever Animoji and personalized Memoji as flagship features of its newer Face ID-powered phones. Snapchat bought Bitmoji (Bitstrips) to give its users access to more tools for creative expression. Samsung lets you make your own AR emoji that look like you. And people celebrated when the Unicode Consortium diversified to include more skin tones, and added, at long last, redheads.Gboard, whose app has been downloaded over a billion times on Google Play, has a similar draw, thanks to its selfie-based stickers.The company says the new Emoji Minis are available in all Gboard languages and countries, on both iOS and Android, starting today."}