{"id": "Democrats won the House — now the hard part is deciding what to do with their new power", "paragraph": "\n\n\n\n            var postLoadFunctions = {};\n            var foresee_enabled = 1\n            var dynamic_yield_enabled = 1\n                    \n\n\n\n\tCNBC_Comscore = 'Politics';\n\n\n\n\t\tvar mpscall = {\n\t\t\t\t\t\t'node_brand' : '2'  ,  \n\n\t\t\t\t\t'site' : 'cnbc.com-relaunch'  ,  \n\n\t\t\t\t\t'content_id' : '105574458'  ,  \n\n\t\t\t\t\t'path' : '/id/105574458'  ,  \n\n\t\t\t\t\t'is_content' : '1'  ,  \n\n\t\t\t\t\t'is_sponsored' : '0'  ,  \n\n\t\t\t\t\t'adunits' : 'Top Banner|Badge A|Badge B|Badge C|Badge D|Flex Ad First|Box Ad 1|Non Iframe Custom|Inline Custom|Movable Box Ad|Responsive Rectangle'  ,  \n\n\t\t\t\t\t'keywords' : '~'  ,  \n\n\t\t\t\t\t'cat' : 'Politics'  ,  \n\n\t\t\t\t\t'cag[configuration_franchise]' : 'Politics'  ,  \n\n\t\t\t\t\t'cag[attribution_source]' : 'CNBC US Source'  ,  \n\n\t\t\t\t\t'cag[attribution_author]' : 'Jacob Pramuk'  ,  \n\n\t\t\t\t\t'cag[related_primary]' : 'Nancy Pelosi|Donald Trump|Senate elections|US Senate|House elections|United States House of Representatives|Patient Protection and Affordable Care Act|Congress|Elections|Politics|White House|US: News|Obamacare'  ,  \n\n\t\t\t\t\t'cag[type_franchise]' : 'Politics|Politics|US: News|Obamacare|Congress|Elections'  ,  \n\n\t\t\t\t\t'cag[type_source]' : 'CNBC US Source'  ,  \n\n\t\t\t\t\t'cag[type_creator]' : 'Jacob Pramuk'  ,  \n\n\t\t\t\t\t'cag[type_person]' : 'Nancy Pelosi|Donald Trump'  ,  \n\n\t\t\t\t\t'cag[type_tag]' : 'Senate elections|House elections|Patient Protection and Affordable Care Act|Elections|Politics'  ,  \n\n\t\t\t\t\t'cag[type_organization]' : 'US Senate|United States House of Representatives|Congress'  ,  \n\n\t\t\t\t\t'cag[type_place]' : 'White House'  ,  \n\n\t\t\t\t\t'cag[brand]' : 'none'  ,  \n\n\t\t\t\t\t'cag[template]' : 'story_simple'  ,  \n\n\t\t\t\t\t'cag[device]' : 'web'  ,  \n\n\t\t\t\t\t'hline' : 'Politics'  ,  \n\n\t\t\t\t\t'type' : 'cnbcnewsstory'  ,  \n\n\t\t\t\t\t'template' : 'story_simple'  ,  \n\n\t\t\t\t\t'title' : 'Democrats won the House &amp;mdash; now the hard part is deciding what to do with their new power'  ,  \n\n\t\t\t\t\t'pubdate' : '1542492122'  ,  \n\n\t\t\t\t\t'stitle' : 'Dem winners Pramuk 181115 EC'  ,  \n\n\t\t\t\t\t'byline' : 'Jacob Pramuk'  ,  \n\n\t\t\t\t\t'subtype' : 'section'  ,  \n\n\t\t\t\t\t'id' : '105574458'  ,  \n\n\t\t\t\t\t'nid' : '105574458'  \n\n\t\t\n\t\t}, mpsopts = {\n\t\t  \n\t\t\"host\" : 'mps.cnbc.com',\n\t\t\"updatecorrelator\" : true\n\n\t\t};\n\n\t\tvar mps = mps || {};\n\t\tmps._ext = mps._ext || {};\n\t\tmps._adsheld = [];\n\t\tmps._queue = mps._queue || {};\n\t\tmps._queue.mpsloaded = mps._queue.mpsloaded || [];\n\t\tmps._queue.mpsinit = mps._queue.mpsinit || [];\n\t\tmps._queue.gptloaded = mps._queue.gptloaded || [];\n\t\tmps._queue.adload = mps._queue.adload || [];\n\t\tmps._queue.adclone = mps._queue.adclone || [];\n\t\tmps._queue.adview = mps._queue.adview || [];\n\t\tmps._queue.refreshads = mps._queue.refreshads || [];\n\t\tmps.__timer = Date.now ? Date.now() : (function() { return +new Date })();\n\t\tmps.__intcode = \"v2\";\n\t\tif (typeof mps.getAd != \"function\") mps.getAd = function(adunit) {\n\t\t    if (typeof adunit != \"string\") return false;\n\t\t    var slotid = \"mps-getad-\" + adunit.replace(/\\W/g, \"\");\n\t\t    if (!mps._ext || !mps._ext.loaded) {\n\t\t        mps._queue.gptloaded.push(function() {\n\t\t            typeof mps._gptfirst == \"function\" && mps._gptfirst(adunit, slotid);\n\t\t            mps.insertAd(\"#\" + slotid, adunit)\n\t\t        });\n\t\t        mps._adsheld.push(adunit)\n\t\t    }\n\t\t    return '<div id=\"' + slotid + '\" class=\"mps-wrapper\" data-mps-fill-slot=\"' + adunit + '\"></div>'\n\t\t};\n\t\t(function() {\n\t\t    head = document.head || document.getElementsByTagName(\"head\")[0], mpsload = document.createElement(\"script\");\n\t\t    mpsload.src = \"//\" + mpsopts.host + \"/fetch/ext/load-\" + mpscall.site + \".js?nowrite=2\";\n\t\t    mpsload.id = \"mps-load\";\n\t\t    head.insertBefore(mpsload, head.firstChild)\n\t\t})();\n\n\t\n\n\n\n\n  \n\n\nvar cnbcDY = {};\nif (mpscall.template.indexOf(\"story\") != -1 || mpscall.template.indexOf(\"slideshow\") != -1) {\n  cnbcDY.type = 'POST';\n  cnbcDY.data = mpscall.id;\n} else if (mpscall.template == \"home_page_ng\") {\n  cnbcDY.type = 'HOMEPAGE';\n  cnbcDY.data = '';\n} else if (mpscall.type == \"franchise\" && mpscall.template != \"video_gallery\") {\n  cnbcDY.type = 'CATEGORY';\n  cnbcDY.data = mpscall.cat.toLowerCase().split(\"|\");\n} else {\n  cnbcDY.type = '';\n  cnbcDY.data = '';\n}\n\n\n\nDY = {scsec : 8765304 ,API: function(){(DY.API.actions = DY.API.actions || []).push(arguments)}};\nDY.recommendationContext = {type: cnbcDY.type, data: cnbcDY.data};\n\n\n\n\n                (function() {\n                                var s = document.createElement('script'),\n                                t = document.getElementsByTagName('script')[0];\n                                s.async = false;\n                                s.src=('https:'==document.location.protocol?'http://st.dynamicyield.com'.replace('http:','https:') : 'http://st.dynamicyield.com' ) + '/ast?sec='+DY.scsec + '&head=true';\n                                t.parentNode.insertBefore(s, t);\n                })();\n\n\n\n\n\n\r\ndocument.addEventListener(\"DOMContentLoaded\", function(event) {\r\n  mps._queue.mpsloaded.push(function(){\r\n    mps._log('**** LOADED: cnbc-cms-header-insert');\r\n    if (window.mps) {\r\n        if (window.CNBC_Premium && CNBC_Premium.isPremium && document.cookie.indexOf('ispro=true') == -1 && (mps.pagevars.type!=\"franchise\")) {\r\n          mps.nlformtypes = mps.nlformtypes || [];\r\n          mps.nlformtypes.push('paywall');\r\n        }\r\n\r\n        //<!-- Omniture s_code path -->\r\n        mps.scodePath=\"//fm.cnbc.com/applications/cnbc.com/staticcontent/scripts/omniture/s_code.js?v=1.6.4.1\";\r\n        //<!-- end: Omniture s_code path -->\r\n\r\n        //<!-- Google PII Fix BEGIN -->\r\n        mps._queue.mpsinit.push(function() {\r\n          (function(){\r\n            mps._urlContainsEmail = function() {\r\n              var _qs = window.location.href;\r\n              if (!_qs) {\r\n                return false;\r\n              }\r\n              var _regex = /([^=&/<>()[].,;:s@\"]+(.[^=&/<>()[].,;:s@\"]+)*)@(([[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}])|(([a-zA-Z-0-9]+.)+[a-zA-Z]{2,}))/;\r\n              return _regex.test(_qs);\r\n            };\r\n            if (mps._urlContainsEmail()) {\r\n              mps._debug('[MPS]: email address detected in url, bypass gpt.');\r\n              if (mps.response && mps.response.dart && typeof(mps.response.dart.adunits) === 'object') {\r\n                if (typeof(window._mpspixZ) != 'string') {\r\n                  window._mpspixZ = (function(a){var b=\"abcdefghiklmnopqrstuvwxyz\".split(\"\");a||(a=Math.floor(Math.random()*b.length));for(var c=\"\",d=0;d<a;d++)c+=b[Math.floor(Math.random()*b.length)];return c})(12)\r\n                }\r\n                for (var i in mps.response.dart.adunits) {\r\n                  var pixelurl = ((document.location.protocol === 'https') ? 'https' : 'http') + '://pix.nbcuni.com/a-pii.gif?X=piiblock&S=' + mps.pagevars.instance + '&P=' + mps.pagevars.mpsid + '&A=' + i + '&U=' + encodeURIComponent(window.location.href) + '&_=' + window._mpspixZ;\r\n                  mps.response.dart.adunits[i].data = '<img id=\"div-gpt-x-0\" class=\"mps-slot\" data-mps-slot=\"x\" data-mps-loadset=\"0\" style=\"width:0;height:0;margin:0;padding:0;border:0;display:none;\" src=\"' + pixelurl + '\"/>';\r\n                }\r\n              }\r\n              mps.cloneAd = function() { return false; }\r\n              return true;\r\n            } else {\r\n              return false;\r\n            }\r\n          })();\r\n        });\r\n        //<!-- Google PII Fix END -->\r\n   }\r\n });\r\n});\r\n\n\n\r\n    var setAdblockerCookie = function(adblocker) {\r\n        var d = new Date();\r\n        d.setTime(d.getTime() + 60 * 60 * 24 * 30 * 1000);\r\n        document.cookie = \"__adblocker=\" + (adblocker ? \"true\" : \"false\") + \"; expires=\" + d.toUTCString() + \"; path=/\";\r\n    }\r\n    var script = document.createElement(\"script\");\r\n    script.setAttribute(\"async\", true);\r\n    script.setAttribute(\"src\", \"//www.npttech.com/advertising.js\");\r\n    script.setAttribute(\"onerror\", \"setAdblockerCookie(true);\");\r\n    script.setAttribute(\"onload\", \"setAdblockerCookie(false);\");\r\n    document.getElementsByTagName(\"head\")[0].appendChild(script);\r\n\n\n\n\r\n  if(typeof window.MediaSource !== 'function') {\r\n    if(typeof document.getElementsByTagName('meta')['tp:PreferredRuntimes'] === 'object') {\r\n        document.getElementsByTagName('meta')['tp:PreferredRuntimes'].setAttribute(\"content\", \"flash,html5\");\r\n    }\r\n}\r\n\n\n\n\n\n\nKeep Me Logged InDuring the start of new House member orientation Tuesday, Alexandria Ocasio-Cortez once again stole the spotlight.The 29-year-old representative-elect and architect of one of the most shocking primary election upsets ever joined protesters in the office of House Minority Leader Nancy Pelosi to demand action on climate change. The self-proclaimed Democratic Socialist railed against Amazon after the corporate titan announced plans to open offices near her deep blue Queens, N.Y., district. Fox News plastered her face on segments warning about the dangers of a \"radical\" agenda.At the same time, a less well-known group of freshman Democrats descended on Washington after the party won a House majority in last week's midterm elections. The candidates who flipped at least 35 GOP-held districts include women who spent time in the military and CIA and a former NFL player. Many of those candidates adopted some liberal positions, but ran as pragmatists committed to working across the aisle, if necessary, to reduce health care costs, protect the social safety net and boost wages, among other priorities.When the group of fresh faces takes office in January, it will set up another debate about just what the party should do with its power — and what voters want in the era of President Donald Trump.Unabashed liberals including Ocasio-Cortez grabbed headlines across the country by winning a handful of blue House districts and running neck and neck with the GOP in statewide races in Florida, Georgia and Texas. Activists cheered progress by candidates who endorsed some form of free public college, expanded access to Medicare or a minimum wage increase. Republicans led by Trump, in turn, used these candidates to try to stoke alarm that Democrats would lead the country to socialism and ruin.\"Remember, [Pelosi] also has a new group coming in that is much more left, that many have identified as socialism. One of the newest members went to [Pelosi's] office not to sit down and meet with her, but to join the protesters,\" incoming House Minority Leader Kevin McCarthy told CNBC's \"Squawk Box\" on Thursday morning, referencing Ocasio-Cortez. \"That is a little crazy.\"But despite their clear progress this year, self-proclaimed progressives did not take a stranglehold on the House as Republicans contend. Nearly all Democrats who flipped GOP-held seats were more mainstream candidates — ones who House Democrats' campaign arm would say \"fit\" their ideologically split districts.It likely means that — with some exceptions — House Democrats will pursue incremental rather than radical change ahead of a 2020 election in which they do not want to alienate moderate voters who helped them to win the House. They also have to deal with Republican control of both the Senate and the White House, which makes some of their priorities politically impossible for at least the next two years.Pelosi addressed this reality when she called for Democrats to focus on health care costs, aging infrastructure and corruption in government after the election. She is the frontrunner to become House speaker in January despite facing opposition within her caucus.\"We will strive for bipartisanship. We believe that we have a responsibility to seek common ground where we can,\" she said at a news conference last week. \"Where we cannot, we must stand our ground, but we must try.\"By digging in, Democrats will have to balance a desire to reshape policy with a reluctance to push voters back toward Trump. Groups who have cheered the midterm results as a triumph for pragmatism worry about the party moving too far, too quickly on issues such as health care and investigating the Trump administration.Democrats have already flipped a net 35 Republican-held House districts, with six races still undecided and more pickups possible. The party will easily top the net gain of 23 seats it needed to take a House majority.The vast majority of candidates preferred by the Democratic Congressional Campaign Committee — the Democrats the party felt were best equipped to win in battleground districts — prevailed in primaries this year. The trend mostly carried over to the House elections last week.Very few Democrats who flipped House seats or lead in undecided races could be considered unabashed liberals. The most notable exception is Katie Porter, an acolyte of Sen. Elizabeth Warren who apparently beat GOP Rep. Mimi Walters in California's 45th District, according to NBC News. She has pushed for a Medicare for all system, stricter banking rules and debt-free public college.Still, groups that support a more center-left approach to policy see the broader election results as an endorsement of what they call pragmatism. They viewed the slate of fresh faces — many of whom had military, national security or executive branch policy experience — as best suited to win over independents and ideologically moderate voters.\"What Democrats succeeded in doing was getting candidates who were well matched to their districts culturally\" and \"weren't running on uber progressive lines or leaning with ideology,\" said Will Marshall, president and founder of the Progressive Policy Institute. The organization advocates for center-left economic policy.Further, self-proclaimed progressive candidates who beat more centrist primary opponents such as Kara Eastman and Dana Balter failed to beat House incumbents in Nebraska's 2nd District and New York's 24th District, respectively. But it does not mean the party's left flank lacked victories this year.Ocasio-Cortez knocked out the third-ranking House Democrat, Rep. Joe Crowley, who many party activists felt was too beholden to corporate interests. Young, self-described progressive women such as Ilhan Omar, Rashida Tlaib and Ayanna Pressley won in other blue House districts. In January, Omar and Tlaib will become the first Muslim women in Congress.Some groups on the Democrats' left flank saw victories even in largely mainstream representatives-elect from swing districts. Across the country, many Democratic candidates swore off corporate political action committee money, noted Waleed Shahid, communications director for Justice Democrats, a liberal organization which backed candidates such as Ocasio-Cortez.\"We are starting to see a much more diverse and progressive Democratic Party than the corporate, centrist Blue Dogs of 2006 and earlier,\" Shahid said in an email. \"Democrats who are pro-life, pro-NRA, 'tough on crime,' and supporting trickle down economics are all but gone.\"Democrats see rejecting that campaign cash as a key part of their anti-special interest messaging. They hope to further that agenda with legislation meant to root out corruption after they take power.Shahid also noted that multiple representatives-elect who carried battleground districts endorsed Medicare for all. Those Democrats include Porter, Josh Harder in California's 10th District, Sean Casten in Illinois' 6th District and Colin Allred in Texas' 32nd District. Others such as Antonio Delgado in New York's 19th District endorsed a public option to allow people to opt into Medicare.The divergence in views within the Democratic Party leads to a range of opinions on what the party should do with its power. For example, pockets of the political left would seek varying solutions on health care: from protecting and shoring up the Affordable Care Act to allowing a Medicare public option to Medicare for all.As of now, it appears Democrats will largely push for incremental, broadly popular changes while fighting against parts of Trump's agenda. They will aim to pass legislation to stabilize Obamacare costs and trim Medicare drug prices, according to Pelosi. They will push for legal protections and a potential path to citizenship for young immigrants brought to the U.S. as children, and seek tighter background checks for gun purchases.Democrats look set to push back against Trump's effort to cut regulations on businesses. For instance, Rep. Maxine Waters — who is set to take over the House Financial Services Committee in January — said this week that weakening regulations on banks will \"come to an end\" when Democrats take power. The party could also try to make tweaks to the Republican tax plan passed last year, which Democrats have criticized as too beneficial for corporations and not helpful enough to working class Americans.They also appear set to launch various investigations into the president and his Cabinet. And although a handful of House Democrats such as Waters have pushed for Trump's impeachment, Pelosi and other leaders of the caucus have dismissed that prospect. They worry a push to remove the president from office could galvanize Republicans and alienate moderate voters.The party's liberal wing has already started agitating for more drastic steps. Ocasio-Cortez and other Democrats are pushing for a plan to move to 100 percent renewable energy in the coming years, on top of Pelosi's pledge to resurrect a select committee on global warming.The effort echoes a call for more dramatic action from Justice Democrats and other liberal groups. Shahid said Democrats need to use their power to hold Trump accountable and also seek \"bold solutions\" to address inequality, racism and climate change.\"This means policies like Medicare For All, free college, dismantling mass incarceration and mass deportation, and a WW2-scale green jobs program to rapidly transition toward 100 percent renewable energy,\" he said.Indivisible, a group that helped to give Democrats grassroots support in this year's elections, released a new version of its guide for activists after the midterms. It includes one potential approach for how the party can use its power.The group has pushed for Democrats to use a two-part approach in the House, passing so-called messaging bills for priorities that will not gain Republican support, and using important legislation such as funding bills to extract concessions from the GOP. Indivisible has also supported Pelosi's bid for the speaker's gavel, and called on her to put freshmen representatives such as Tlaib on key committees.Pelosi, who represents San Francisco, casts herself as a progressive despite the demands of leadership that require cooperation with Republicans.For groups such as the Progressive Policy Institute, the election was a nod of approval for center-left solutions. Marshall said he is \"not sure there's a public appetite for the highly federalized expansions of federal power.\"He added that Democrats have to find a balance of appeasing liberal activists and the type of centrist voters who helped the party to win swing districts. He thinks that, if Democrats would lose the House or presidential election, it would be because of overreach.\"We just caution Democrats not to fall into the trap that thinks bold is big government initiatives that are likely to repel the kind of voters that brought Democrats to victory,\" he said.PlayingShare this video...Watch Next...Got a confidential news tip? We want to hear from you.Sign up for free newsletters and get more CNBC delivered to your inboxGet this delivered to your inbox, and more info about our products and services. Privacy Policy.© 2018 CNBC LLC. All Rights Reserved. A Division of NBCUniversalData is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis.Data also provided by "}