{"id": "Netflix's biggest daredevil move: Making blockbuster comic book movies for theaters", "paragraph": "\n\n\n\n            var postLoadFunctions = {};\n            var foresee_enabled = 1\n            var dynamic_yield_enabled = 1\n                    \n\n\n\n\tCNBC_Comscore = 'Business_News';\n\n\n\n\t\tvar mpscall = {\n\t\t\t\t\t\t'node_brand' : '2'  ,  \n\n\t\t\t\t\t'site' : 'cnbc.com-relaunch'  ,  \n\n\t\t\t\t\t'content_id' : '105510367'  ,  \n\n\t\t\t\t\t'path' : '/id/105510367'  ,  \n\n\t\t\t\t\t'is_content' : '1'  ,  \n\n\t\t\t\t\t'is_sponsored' : '0'  ,  \n\n\t\t\t\t\t'adunits' : 'Top Banner|Badge A|Badge B|Badge C|Badge D|Flex Ad First|Box Ad 1|Non Iframe Custom|Inline Custom|Movable Box Ad|Responsive Rectangle'  ,  \n\n\t\t\t\t\t'keywords' : '~'  ,  \n\n\t\t\t\t\t'cat' : 'Business News|Life|Entertainment|Movies and Entertainment'  ,  \n\n\t\t\t\t\t'cag[attribution_source]' : 'CNBC US Source'  ,  \n\n\t\t\t\t\t'cag[related_primary]' : 'AT&amp;T Inc|Disney|Sony Corp|Walt Disney Co|Hollywood|Action and adventure movies|Netflix Inc|Netflix|Video renting and streaming services|Streaming services|Media|Movies|US: News|Technology: Companies|Alternative Investing: Entertainment|Movies and Entertainment'  ,  \n\n\t\t\t\t\t'cag[configuration_franchise]' : 'Movies and Entertainment'  ,  \n\n\t\t\t\t\t'cag[type_source]' : 'CNBC US Source'  ,  \n\n\t\t\t\t\t'cag[type_franchise]' : 'US: News|Media|Technology: Companies|Alternative Investing: Entertainment|Movies and Entertainment|Movies and Entertainment'  ,  \n\n\t\t\t\t\t'cag[type_company]' : 'AT&amp;T Inc|Sony Corp|Walt Disney Co|Netflix Inc'  ,  \n\n\t\t\t\t\t'cag[type_organization]' : 'Disney|Netflix'  ,  \n\n\t\t\t\t\t'cag[type_place]' : 'Hollywood'  ,  \n\n\t\t\t\t\t'cag[type_tag]' : 'Action and adventure movies|Video renting and streaming services|Streaming services|Media|Movies'  ,  \n\n\t\t\t\t\t'cag[brand]' : 'none'  ,  \n\n\t\t\t\t\t'cag[template]' : 'story_simple'  ,  \n\n\t\t\t\t\t'cag[device]' : 'web'  ,  \n\n\t\t\t\t\t'hline' : 'Movies and Entertainment'  ,  \n\n\t\t\t\t\t'type' : 'cnbcnewsstory'  ,  \n\n\t\t\t\t\t'template' : 'story_simple'  ,  \n\n\t\t\t\t\t'title' : 'Netflix&amp;#039;s biggest daredevil move:&amp;nbsp;Making blockbuster comic book movies for theaters'  ,  \n\n\t\t\t\t\t'pubdate' : '1540040514'  ,  \n\n\t\t\t\t\t'stitle' : 'Russo netflix&#039;s biggest daredevil move 181016'  ,  \n\n\t\t\t\t\t'subtype' : 'section'  ,  \n\n\t\t\t\t\t'id' : '105510367'  ,  \n\n\t\t\t\t\t'nid' : '105510367'  \n\n\t\t\n\t\t}, mpsopts = {\n\t\t  \n\t\t\"host\" : 'mps.cnbc.com',\n\t\t\"updatecorrelator\" : true\n\n\t\t};\n\n\t\tvar mps = mps || {};\n\t\tmps._ext = mps._ext || {};\n\t\tmps._adsheld = [];\n\t\tmps._queue = mps._queue || {};\n\t\tmps._queue.mpsloaded = mps._queue.mpsloaded || [];\n\t\tmps._queue.mpsinit = mps._queue.mpsinit || [];\n\t\tmps._queue.gptloaded = mps._queue.gptloaded || [];\n\t\tmps._queue.adload = mps._queue.adload || [];\n\t\tmps._queue.adclone = mps._queue.adclone || [];\n\t\tmps._queue.adview = mps._queue.adview || [];\n\t\tmps._queue.refreshads = mps._queue.refreshads || [];\n\t\tmps.__timer = Date.now ? Date.now() : (function() { return +new Date })();\n\t\tmps.__intcode = \"v2\";\n\t\tif (typeof mps.getAd != \"function\") mps.getAd = function(adunit) {\n\t\t    if (typeof adunit != \"string\") return false;\n\t\t    var slotid = \"mps-getad-\" + adunit.replace(/\\W/g, \"\");\n\t\t    if (!mps._ext || !mps._ext.loaded) {\n\t\t        mps._queue.gptloaded.push(function() {\n\t\t            typeof mps._gptfirst == \"function\" && mps._gptfirst(adunit, slotid);\n\t\t            mps.insertAd(\"#\" + slotid, adunit)\n\t\t        });\n\t\t        mps._adsheld.push(adunit)\n\t\t    }\n\t\t    return '<div id=\"' + slotid + '\" class=\"mps-wrapper\" data-mps-fill-slot=\"' + adunit + '\"></div>'\n\t\t};\n\t\t(function() {\n\t\t    head = document.head || document.getElementsByTagName(\"head\")[0], mpsload = document.createElement(\"script\");\n\t\t    mpsload.src = \"//\" + mpsopts.host + \"/fetch/ext/load-\" + mpscall.site + \".js?nowrite=2\";\n\t\t    mpsload.id = \"mps-load\";\n\t\t    head.insertBefore(mpsload, head.firstChild)\n\t\t})();\n\n\t\n\n\n\n\n  \n\n\nvar cnbcDY = {};\nif (mpscall.template.indexOf(\"story\") != -1 || mpscall.template.indexOf(\"slideshow\") != -1) {\n  cnbcDY.type = 'POST';\n  cnbcDY.data = mpscall.id;\n} else if (mpscall.template == \"home_page_ng\") {\n  cnbcDY.type = 'HOMEPAGE';\n  cnbcDY.data = '';\n} else if (mpscall.type == \"franchise\" && mpscall.template != \"video_gallery\") {\n  cnbcDY.type = 'CATEGORY';\n  cnbcDY.data = mpscall.cat.toLowerCase().split(\"|\");\n} else {\n  cnbcDY.type = '';\n  cnbcDY.data = '';\n}\n\n\n\nDY = {scsec : 8765304 ,API: function(){(DY.API.actions = DY.API.actions || []).push(arguments)}};\nDY.recommendationContext = {type: cnbcDY.type, data: cnbcDY.data};\n\n\n\n\n                (function() {\n                                var s = document.createElement('script'),\n                                t = document.getElementsByTagName('script')[0];\n                                s.async = false;\n                                s.src=('https:'==document.location.protocol?'http://st.dynamicyield.com'.replace('http:','https:') : 'http://st.dynamicyield.com' ) + '/ast?sec='+DY.scsec + '&head=true';\n                                t.parentNode.insertBefore(s, t);\n                })();\n\n\n\n\n\n\r\ndocument.addEventListener(\"DOMContentLoaded\", function(event) {\r\n  mps._queue.mpsloaded.push(function(){\r\n    mps._log('**** LOADED: cnbc-cms-header-insert');\r\n    if (window.mps) {\r\n        if (window.CNBC_Premium && CNBC_Premium.isPremium && document.cookie.indexOf('ispro=true') == -1 && (mps.pagevars.type!=\"franchise\")) {\r\n          mps.nlformtypes = mps.nlformtypes || [];\r\n          mps.nlformtypes.push('paywall');\r\n        }\r\n\r\n        //<!-- Omniture s_code path -->\r\n        mps.scodePath=\"//fm.cnbc.com/applications/cnbc.com/staticcontent/scripts/omniture/s_code.js?v=1.6.4.1\";\r\n        //<!-- end: Omniture s_code path -->\r\n\r\n        //<!-- Google PII Fix BEGIN -->\r\n        mps._queue.mpsinit.push(function() {\r\n          (function(){\r\n            mps._urlContainsEmail = function() {\r\n              var _qs = window.location.href;\r\n              if (!_qs) {\r\n                return false;\r\n              }\r\n              var _regex = /([^=&/<>()[].,;:s@\"]+(.[^=&/<>()[].,;:s@\"]+)*)@(([[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}])|(([a-zA-Z-0-9]+.)+[a-zA-Z]{2,}))/;\r\n              return _regex.test(_qs);\r\n            };\r\n            if (mps._urlContainsEmail()) {\r\n              mps._debug('[MPS]: email address detected in url, bypass gpt.');\r\n              if (mps.response && mps.response.dart && typeof(mps.response.dart.adunits) === 'object') {\r\n                if (typeof(window._mpspixZ) != 'string') {\r\n                  window._mpspixZ = (function(a){var b=\"abcdefghiklmnopqrstuvwxyz\".split(\"\");a||(a=Math.floor(Math.random()*b.length));for(var c=\"\",d=0;d<a;d++)c+=b[Math.floor(Math.random()*b.length)];return c})(12)\r\n                }\r\n                for (var i in mps.response.dart.adunits) {\r\n                  var pixelurl = ((document.location.protocol === 'https') ? 'https' : 'http') + '://pix.nbcuni.com/a-pii.gif?X=piiblock&S=' + mps.pagevars.instance + '&P=' + mps.pagevars.mpsid + '&A=' + i + '&U=' + encodeURIComponent(window.location.href) + '&_=' + window._mpspixZ;\r\n                  mps.response.dart.adunits[i].data = '<img id=\"div-gpt-x-0\" class=\"mps-slot\" data-mps-slot=\"x\" data-mps-loadset=\"0\" style=\"width:0;height:0;margin:0;padding:0;border:0;display:none;\" src=\"' + pixelurl + '\"/>';\r\n                }\r\n              }\r\n              mps.cloneAd = function() { return false; }\r\n              return true;\r\n            } else {\r\n              return false;\r\n            }\r\n          })();\r\n        });\r\n        //<!-- Google PII Fix END -->\r\n   }\r\n });\r\n});\r\n\n\n\r\n    var setAdblockerCookie = function(adblocker) {\r\n        var d = new Date();\r\n        d.setTime(d.getTime() + 60 * 60 * 24 * 30 * 1000);\r\n        document.cookie = \"__adblocker=\" + (adblocker ? \"true\" : \"false\") + \"; expires=\" + d.toUTCString() + \"; path=/\";\r\n    }\r\n    var script = document.createElement(\"script\");\r\n    script.setAttribute(\"async\", true);\r\n    script.setAttribute(\"src\", \"//www.npttech.com/advertising.js\");\r\n    script.setAttribute(\"onerror\", \"setAdblockerCookie(true);\");\r\n    script.setAttribute(\"onload\", \"setAdblockerCookie(false);\");\r\n    document.getElementsByTagName(\"head\")[0].appendChild(script);\r\n\n\n\n\r\n  if(typeof window.MediaSource !== 'function') {\r\n    if(typeof document.getElementsByTagName('meta')['tp:PreferredRuntimes'] === 'object') {\r\n        document.getElementsByTagName('meta')['tp:PreferredRuntimes'].setAttribute(\"content\", \"flash,html5\");\r\n    }\r\n}\r\n\n\n\n\n\n\nKeep Me Logged InNetflix released the third season of \"Daredevil\" on Friday, which stars Charlie Cox as the title character and perhaps the most popular \"Defender\" in an era of Marvel crossover television shows. \"Daredevil\" is the latest big original launch from Netflix, which is spending billions this year on original productions. But last week the streaming video company started spending in a new way that further reflects its ambitions to match Hollywood studio-level production. Netflix announced the purchase of a production studio in New Mexico, where portions of the Wolverine film \"Logan\" and \"Avengers\" movies have been shot.As Marvel comic-book-crossover characters, including Daredevil, have become a big part of the Netflix original production appeal, a question that's yet to be answered is whether Netflix might ever cross over with its superhero characters to the big screen.As the Marvel Studios' Cinematic Universe expands across media platforms, consumers eagerly are awaiting the day where Marvel's Netflix characters hit the big screen, especially in conjunction with other icons from the Marvel cinematic universe, such as Spider-Man and Iron Man.Cox is among the actors playing a Netflix-produced superhero who has mentioned his desire to collaborate with other Marvel characters, like the Avengers.\"I mean, I'm sure I can say this. And I'll just preface it by saying that I can't see how this would happen. Maybe it will, maybe it won't. But I have no information to suggest that this would ever happen. But it'd be really cool to see. ... I'd love to do something with Spider-Man\", Cox said on a Las Vegas Comic Con panel last July via Collider Videos and Comicbook.com.\"There's always potential for a popular character like Daredevil to show up in a movie if a storyline calls for it and if the film meshes well with the tone of his own character,\" said Shawn Robbins, chief analyst for BoxOffice.com. \"As we've seen in recent years, the look and feel of a Marvel film has a very wide, ever-expanding definition.\"\"It would be really awesome to team up with Iron Man,\" said Krysten Ritter, star of Netflix's \"Jessica Jones\" at Wizard World, according to a report from Comicbookmovie.com. \"Obviously, it'd be really exciting to be a part of those giant, huge movies with those great characters who are already established, so it'd be awesome,\" Ritter said.Netflix and Marvel declined to comment on any future plans for characters.\"Daredevil\" already appeared on the big screen once but wasn't a huge hit. The 2003 \"Daredevil,\" which starred Ben Affleck as the title character, cost $78 million to make and grossed $179 million worldwide, according to Box Office Mojo, but has a Rotten Tomatoes audience score of 35 percent — critics were not much kinder.With high audience scores for both shows — \"Daredevil\" earns a 95 percent audience score and \"Jessica Jones\" an audience score of 85 percent — there is box-office potential in making the move from the small screen to the cinema screen, and for the major studios, including Disney, Marvel, Netflix and Sony, to find ways for content and characters to converge.BoxOffice.com's Robbins said there is potential upside in converging cinematic storylines and bringing together characters from the deep bench available to writers, but it would need to be done carefully to make sure the crossover storytelling is organic rather than coming across as a forced marketing ploy.To date, the different narratives for \"Daredevil,\" \"The Defenders\" and the other Marvel spin-off content has kept the narrative world coherent. Big-screen migrations for these characters could make sense after the next \"Avengers\" and \"Guardians of the Galaxy\" films are released. But Marvel and its partners will do so in a way that is less in line with the theory of transmedia — the concept of developing an integrated and synchronized narrative across media platforms — and more about rebooting in a new medium, said Kia Afra, Chapman University professor and film industry expert. \"The current format allows for series development, which is basically untenable in a motion-picture franchise. Every film has to add something truly significant, whereas a series can build its characters and conflicts over numerous episodes, as 'Daredevil' and 'Jessica Jones' both demonstrate,\" Afra said.A compromise solution might be to feature one of these characters in a smaller, standalone film that receives limited distribution so as to test the waters for a full-blown ensemble blockbuster, such as \"Avengers: Infinity War,\" which costs $320 million to produce and an estimated $150 million to advertise. \"That could also preserve and build on the narrative world they have already established, without risking the several hundred million required to sustain the modern Hollywood blockbuster,\" Afra said.YouTube star and film critic Jeremy Jahns does not think that converging these cinematic storylines in an organic storytelling way would be easy. He said the idea comes down to a struggle between two seemingly contradictory bits of fortune-cookie wisdom: \"If it ain't broke, don't fix it\" and \"It's important to try new things.\"\"Marvel has done well for themselves in conquering the comic book movie market, as well as making strong content for the streaming market of Netflix,\" said Jahns. \"I couldn't imagine a two-hour movie with Daredevil being as enjoyable as a weekend binge consisting of a dozen hours of character development, twists, reveals, and conflict.\"Hollywood studios, meanwhile, derive what revenue they do from Netflix today in what may end up only being a temporary \"means to an end\" business approach, according to Afra. Convergence of characters is one thing, but the whole idea of distribution through Netflix is not the ideal way to monetize a franchise, as far as Marvel is concerned.\"While the risks are also lower than theatrical distribution or TV, there just isn't much revenue for Hollywood studios on Netflix. This is exactly why the studios are developing their own streaming services,\" Afra said. \"The Marvel-Netflix partnership simply allows the studio to pursue an available avenue and build an audience that was not yet there for the Daredevil film franchise. Once the audience is established, Marvel will simply move on, especially with Disney having invested so much in its own rival streaming service.\"Disney's new streaming service is scheduled to launch in late 2019, and it has been speculated that two spin-off shows centered on popular Marvel characters will be included, such as Tom Hiddleston's Loki or Elizabeth Olsen's Scarlet Witch. The Disney streaming service is being run by Ricky Strauss, who served as president of marketing for Walt Disney Studios for the past six years, helping promote critically acclaimed films such as \"Black Panther\" and \"Star Wars: The Force Awakens.\"\"There's a big, big opportunity for storytellers inside and outside of Disney to help us,\" Strauss, now president of content and marketing for Disney Streaming Service, told The New York Times. \"I do believe that this is the future, which is one reason I wanted the job.\"Netflix has considered buying movie theaters in attempt to win more Academy Awards, according to The LA Times, but no deal has been made. Netflix already has produced some theatrical releases that were also streamed, including \"Beasts of No Nation\" and \"Mudbound,\" but these films are smaller-budget, more artistic fare for the theaters rather than blockbuster-level pictures. \"Mudbound\" received four Oscar nominations; \"Beasts\" received none, though some critics considered that a notable 2016 Oscar \"snub.\"Netflix's \"22 July\" was just released simultaneously on the streaming service and in theaters. The indie drama directed by Paul Greengrass had a budget of $20 million, much less than your typical superhero film.The streaming service faces a tricky customer issue if it pushes further into theatrical releases and does not offer those films as part of a streaming subscription at the same time.\"They shouldn't make their content available in theaters unless it is also available simultaneously on Netflix, or that could damage the brand with those aforementioned customers that are using Netflix for original content,\" said Carol Roth, founder of Future File, a system that provides assistance for legacy planning, and former investment banker.This past Tuesday, Netflix reported earnings that blew out Wall Street expectations for subscriber additions and is on pace to add as many subscribers in one year as AT&T's recent acquisition HBO amassed over four decades, but it is burning cash at a record pace.Marvel's corporate leadership hasn't ruled out the idea of further collaboration.\"So much of what we're doing is set, but I just — I never say never, but I'm not sure when that would be,\" Marvel Studios' president Kevin Feige told Screen Rant during the \"Avengers: Infinity War\" press junket, addressing the possibility of a future crossover with Netflix characters.\"This is a tricky situation and is filled with unknowns. I think everyone in Hollywood will be watching to see how the model evolves and plays out,\" said Karie Bible, a box-office analyst for Exhibitor Relations. She said the acquisition by Netflix of the New Mexico production site is more of a financial move in the near term to take advantage of tax credits, but in the end may become part of a movie-making effort. \"I think they're going to cross over to theaters. It's kind of a wait-and-see game.\"Jahns said some television legacies are better left that way, even given the appeal — and potential box-office take — of a big-budget comic book movie.\"'Iron Man' and the Marvel Cinematic Universe changed the game. Now there is an expectation for comic book movies to take a big-screen adaptation seriously,\" he said. \"I think a Defender character having their own movie could be a fun test run, but the legacy of the story should stay as a series. After all, I thought the first 'X-Files' movie was enjoyable enough, but when I think of the legacy of 'The X-Files' and the joy I felt watching it, I think of the show, not the movies.\"—By Donovan Russo, special to CNBC.comPlayingShare this video...Watch Next...Got a confidential news tip? We want to hear from you.Sign up for free newsletters and get more CNBC delivered to your inboxGet this delivered to your inbox, and more info about our products and services. Privacy Policy.© 2018 CNBC LLC. All Rights Reserved. A Division of NBCUniversalData is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis.Data also provided by "}