{"id": "Putting the genie back in the bottle: How a new breed of media companies is convincing people to pay for news again", "paragraph": "\n\n\n\n            var postLoadFunctions = {};\n            var foresee_enabled = 1\n            var dynamic_yield_enabled = 1\n                    \n\n\n\n\tCNBC_Comscore = 'Technology';\n\n\n\n\t\tvar mpscall = {\n\t\t\t\t\t\t'node_brand' : '2'  ,  \n\n\t\t\t\t\t'site' : 'cnbc.com-relaunch'  ,  \n\n\t\t\t\t\t'content_id' : '105568916'  ,  \n\n\t\t\t\t\t'path' : '/id/105568916'  ,  \n\n\t\t\t\t\t'is_content' : '1'  ,  \n\n\t\t\t\t\t'is_sponsored' : '0'  ,  \n\n\t\t\t\t\t'adunits' : 'Top Banner|Badge A|Badge B|Badge C|Badge D|Flex Ad First|Box Ad 1|Non Iframe Custom|Inline Custom|Movable Box Ad|Responsive Rectangle'  ,  \n\n\t\t\t\t\t'keywords' : '~'  ,  \n\n\t\t\t\t\t'cat' : 'Technology|CNBC Upstart'  ,  \n\n\t\t\t\t\t'cag[attribution_author]' : 'Alex Sherman'  ,  \n\n\t\t\t\t\t'cag[attribution_source]' : 'CNBC US Source'  ,  \n\n\t\t\t\t\t'cag[related_primary]' : 'Walt Disney Co|Comcast Corp|Amazon.com Inc|CNBC Upstart 25|Alphabet Class A|Facebook|New York Times Co|News Corp Class A|Verizon Communications Inc|Finance|Stocks|Investing|Telecom|Wall Street|Media|Technology'  ,  \n\n\t\t\t\t\t'cag[configuration_franchise]' : 'CNBC Upstart'  ,  \n\n\t\t\t\t\t'cag[type_creator]' : 'Alex Sherman'  ,  \n\n\t\t\t\t\t'cag[type_source]' : 'CNBC US Source'  ,  \n\n\t\t\t\t\t'cag[type_franchise]' : 'Finance|Stocks|Investing|Telecom|Wall Street|Media|Technology|CNBC Upstart'  ,  \n\n\t\t\t\t\t'cag[type_company]' : 'Walt Disney Co|Comcast Corp|Amazon.com Inc|Alphabet Class A|Facebook|New York Times Co|News Corp Class A|Verizon Communications Inc'  ,  \n\n\t\t\t\t\t'cag[type_tag]' : 'CNBC Upstart 25'  ,  \n\n\t\t\t\t\t'cag[brand]' : 'none'  ,  \n\n\t\t\t\t\t'cag[template]' : 'story_simple'  ,  \n\n\t\t\t\t\t'cag[device]' : 'web'  ,  \n\n\t\t\t\t\t'hline' : 'CNBC Upstart'  ,  \n\n\t\t\t\t\t'type' : 'cnbcnewsstory'  ,  \n\n\t\t\t\t\t'template' : 'story_simple'  ,  \n\n\t\t\t\t\t'title' : 'Putting the genie back in the bottle: How a new breed of media companies is convincing people to pay for news again'  ,  \n\n\t\t\t\t\t'pubdate' : '1542477503'  ,  \n\n\t\t\t\t\t'stitle' : 'The battle of the business model: Axios vs. The Athletic'  ,  \n\n\t\t\t\t\t'byline' : 'Alex Sherman'  ,  \n\n\t\t\t\t\t'subtype' : 'special_report'  ,  \n\n\t\t\t\t\t'id' : '105568916'  ,  \n\n\t\t\t\t\t'nid' : '105568916'  \n\n\t\t\n\t\t}, mpsopts = {\n\t\t  \n\t\t\"host\" : 'mps.cnbc.com',\n\t\t\"updatecorrelator\" : true\n\n\t\t};\n\n\t\tvar mps = mps || {};\n\t\tmps._ext = mps._ext || {};\n\t\tmps._adsheld = [];\n\t\tmps._queue = mps._queue || {};\n\t\tmps._queue.mpsloaded = mps._queue.mpsloaded || [];\n\t\tmps._queue.mpsinit = mps._queue.mpsinit || [];\n\t\tmps._queue.gptloaded = mps._queue.gptloaded || [];\n\t\tmps._queue.adload = mps._queue.adload || [];\n\t\tmps._queue.adclone = mps._queue.adclone || [];\n\t\tmps._queue.adview = mps._queue.adview || [];\n\t\tmps._queue.refreshads = mps._queue.refreshads || [];\n\t\tmps.__timer = Date.now ? Date.now() : (function() { return +new Date })();\n\t\tmps.__intcode = \"v2\";\n\t\tif (typeof mps.getAd != \"function\") mps.getAd = function(adunit) {\n\t\t    if (typeof adunit != \"string\") return false;\n\t\t    var slotid = \"mps-getad-\" + adunit.replace(/\\W/g, \"\");\n\t\t    if (!mps._ext || !mps._ext.loaded) {\n\t\t        mps._queue.gptloaded.push(function() {\n\t\t            typeof mps._gptfirst == \"function\" && mps._gptfirst(adunit, slotid);\n\t\t            mps.insertAd(\"#\" + slotid, adunit)\n\t\t        });\n\t\t        mps._adsheld.push(adunit)\n\t\t    }\n\t\t    return '<div id=\"' + slotid + '\" class=\"mps-wrapper\" data-mps-fill-slot=\"' + adunit + '\"></div>'\n\t\t};\n\t\t(function() {\n\t\t    head = document.head || document.getElementsByTagName(\"head\")[0], mpsload = document.createElement(\"script\");\n\t\t    mpsload.src = \"//\" + mpsopts.host + \"/fetch/ext/load-\" + mpscall.site + \".js?nowrite=2\";\n\t\t    mpsload.id = \"mps-load\";\n\t\t    head.insertBefore(mpsload, head.firstChild)\n\t\t})();\n\n\t\n\n\n\n\n  \n\n\nvar cnbcDY = {};\nif (mpscall.template.indexOf(\"story\") != -1 || mpscall.template.indexOf(\"slideshow\") != -1) {\n  cnbcDY.type = 'POST';\n  cnbcDY.data = mpscall.id;\n} else if (mpscall.template == \"home_page_ng\") {\n  cnbcDY.type = 'HOMEPAGE';\n  cnbcDY.data = '';\n} else if (mpscall.type == \"franchise\" && mpscall.template != \"video_gallery\") {\n  cnbcDY.type = 'CATEGORY';\n  cnbcDY.data = mpscall.cat.toLowerCase().split(\"|\");\n} else {\n  cnbcDY.type = '';\n  cnbcDY.data = '';\n}\n\n\n\nDY = {scsec : 8765304 ,API: function(){(DY.API.actions = DY.API.actions || []).push(arguments)}};\nDY.recommendationContext = {type: cnbcDY.type, data: cnbcDY.data};\n\n\n\n\n                (function() {\n                                var s = document.createElement('script'),\n                                t = document.getElementsByTagName('script')[0];\n                                s.async = false;\n                                s.src=('https:'==document.location.protocol?'http://st.dynamicyield.com'.replace('http:','https:') : 'http://st.dynamicyield.com' ) + '/ast?sec='+DY.scsec + '&head=true';\n                                t.parentNode.insertBefore(s, t);\n                })();\n\n\n\n\n\n\r\ndocument.addEventListener(\"DOMContentLoaded\", function(event) {\r\n  mps._queue.mpsloaded.push(function(){\r\n    mps._log('**** LOADED: cnbc-cms-header-insert');\r\n    if (window.mps) {\r\n        if (window.CNBC_Premium && CNBC_Premium.isPremium && document.cookie.indexOf('ispro=true') == -1 && (mps.pagevars.type!=\"franchise\")) {\r\n          mps.nlformtypes = mps.nlformtypes || [];\r\n          mps.nlformtypes.push('paywall');\r\n        }\r\n\r\n        //<!-- Omniture s_code path -->\r\n        mps.scodePath=\"//fm.cnbc.com/applications/cnbc.com/staticcontent/scripts/omniture/s_code.js?v=1.6.4.1\";\r\n        //<!-- end: Omniture s_code path -->\r\n\r\n        //<!-- Google PII Fix BEGIN -->\r\n        mps._queue.mpsinit.push(function() {\r\n          (function(){\r\n            mps._urlContainsEmail = function() {\r\n              var _qs = window.location.href;\r\n              if (!_qs) {\r\n                return false;\r\n              }\r\n              var _regex = /([^=&/<>()[].,;:s@\"]+(.[^=&/<>()[].,;:s@\"]+)*)@(([[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}])|(([a-zA-Z-0-9]+.)+[a-zA-Z]{2,}))/;\r\n              return _regex.test(_qs);\r\n            };\r\n            if (mps._urlContainsEmail()) {\r\n              mps._debug('[MPS]: email address detected in url, bypass gpt.');\r\n              if (mps.response && mps.response.dart && typeof(mps.response.dart.adunits) === 'object') {\r\n                if (typeof(window._mpspixZ) != 'string') {\r\n                  window._mpspixZ = (function(a){var b=\"abcdefghiklmnopqrstuvwxyz\".split(\"\");a||(a=Math.floor(Math.random()*b.length));for(var c=\"\",d=0;d<a;d++)c+=b[Math.floor(Math.random()*b.length)];return c})(12)\r\n                }\r\n                for (var i in mps.response.dart.adunits) {\r\n                  var pixelurl = ((document.location.protocol === 'https') ? 'https' : 'http') + '://pix.nbcuni.com/a-pii.gif?X=piiblock&S=' + mps.pagevars.instance + '&P=' + mps.pagevars.mpsid + '&A=' + i + '&U=' + encodeURIComponent(window.location.href) + '&_=' + window._mpspixZ;\r\n                  mps.response.dart.adunits[i].data = '<img id=\"div-gpt-x-0\" class=\"mps-slot\" data-mps-slot=\"x\" data-mps-loadset=\"0\" style=\"width:0;height:0;margin:0;padding:0;border:0;display:none;\" src=\"' + pixelurl + '\"/>';\r\n                }\r\n              }\r\n              mps.cloneAd = function() { return false; }\r\n              return true;\r\n            } else {\r\n              return false;\r\n            }\r\n          })();\r\n        });\r\n        //<!-- Google PII Fix END -->\r\n   }\r\n });\r\n});\r\n\n\n\r\n    var setAdblockerCookie = function(adblocker) {\r\n        var d = new Date();\r\n        d.setTime(d.getTime() + 60 * 60 * 24 * 30 * 1000);\r\n        document.cookie = \"__adblocker=\" + (adblocker ? \"true\" : \"false\") + \"; expires=\" + d.toUTCString() + \"; path=/\";\r\n    }\r\n    var script = document.createElement(\"script\");\r\n    script.setAttribute(\"async\", true);\r\n    script.setAttribute(\"src\", \"//www.npttech.com/advertising.js\");\r\n    script.setAttribute(\"onerror\", \"setAdblockerCookie(true);\");\r\n    script.setAttribute(\"onload\", \"setAdblockerCookie(false);\");\r\n    document.getElementsByTagName(\"head\")[0].appendChild(script);\r\n\n\n\n\r\n  if(typeof window.MediaSource !== 'function') {\r\n    if(typeof document.getElementsByTagName('meta')['tp:PreferredRuntimes'] === 'object') {\r\n        document.getElementsByTagName('meta')['tp:PreferredRuntimes'].setAttribute(\"content\", \"flash,html5\");\r\n    }\r\n}\r\n\n\n\n\n\n\nKeep Me Logged InComcast Ventures had seen enough. Years of researching business models, seeing their own portfolio's performance and watching digital media startups struggle had made an impression. For 2018, the venture capital firm made a decision: it would no longer put seed money behind advertising-driven media companies.\"Starting an ad-supported business is really, really tough,\" said Daniel Gulati, a Comcast Ventures partner, in an interview. \"As a general thesis, we are not actively looking to invest in seed companies that have an advertising-based business model.\"It's a shift in thinking for Comcast Ventures, which has put money behind advertising-based models before, including 2009 and 2010 investments in Vox Media and a small 2016 funding of finance news network Cheddar. (Comcast Ventures is owned by Comcast, which also owns CNBC parent company NBCUniversal.)The reason for the shift comes down to two tech giants: Facebook and Google. The duopoly has dominated digital advertising and both companies are only increasing in scale and market share.Their targeting capabilities, given all of their data, is \"second to none,\" Gulati said. \"As their growth accelerates, the opportunity for new companies diminish.\"As a result, subscription fees are hot -- a return to how most media (newspapers, magazines, cable TV) prospered for decades.This week alone, New York Media, the owner of New York Magazine, announced its sites would be paywalled. That was soon followed by paywall announcements by Verizon's Yahoo Finance and Atlantic Media's Quartz. Bloomberg, Axel Springer's Business Insider, Conde Nast's Vanity Fair and Wired, and a bunch of other online magazines introduced or hardened their paywalls this year. The New York Times, Wall Street Journal (owned by News Corp), The Financial Times (owned by Nikkei) and The Washington Post (owned by Amazon CEO Jeff Bezos) made that decision even earlier.\"For many years, the popular narrative has been that readers simply weren't willing to pay for content online,\" said Eric Stromberg, a venture capitalist at Bedrock Capital.\"The only way to win was to build an engine of free articles that were monetized through ads and shared on social networks. Paywalls wouldn't scale. You were destined to have a niche audience if you had a paywall. We're starting to see a shift. I expect we'll see it more powerfully over the next few years.\"The biggest opposition to subscription services has been the idea that you can't charge for content that can be aggregated or summarized by free online services. \"You can't put the genie back in the bottle,\" media executives would lament. People can't be re-trained to pay for what they're already getting for free.With that thought in mind, investors poured billions into ad-driven media companies in the 2000s, and a couple have gone on to become worth billions.But the successes have come with caveats. Vice Media has been the gold standard, earning a valuation of $5.7 billion in June 2017. Yet earlier this month, Disney wrote down its investment in Vice by 40 percent, suggesting a declining overall valuation.Buzzfeed has built itself into a company that tops $1 billion in value. Still, Buzzfeed missed its 2017 revenue forecast by up to 20 percent, the Wall Street Journal reported last year, pushing back hopes of an initial public offering indefinitely. Vox Media, the owner of sites including SBNation, Eater and The Verge, also missed internal revenue forecasts and is not planning to go public any time soon, said people familiar with the matter, who asked not to be named because the company's financials are private.Among smaller companies, virtually everyone is desperate to sell, said Ben Lerer, CEO of Group Nine Media, a digital media holding company that owns brands including Thrillist, NowThis and The Dodo.The difficulties of surviving on advertising and the recent success of high-profile paywalls has led entrepreneurs interested in news to return to subscription-based models.Many media companies reliant on advertising lost touch with their audience, said Jessica Lessin, the founder of subscription-based technology website The Information, which in five years has grown from a start-up of two reporters to a company of 36 employees.Lessin believes reliance on advertising led to extreme and outrageous headlines and other editorial decisions that put advertisers before readers.\"It's insidious,\" Lessin said. \"When I talk to brands and advertisers, they want to sponsor a video series and determine who is being interviewed. Publications are dong shadier and shadier things. I know of a publication that had a brand that bought substantial advertising in magazines, and the publication gave them the right to veto coverage of a competitive brand. People have to think that through.\"While it's possible that existing businesses can make the dual revenue streams of advertising and subscription work, it's not smart for a brand new business to try both, said Gulati.\"If you're starting today, you have to ask yourself, do I want to be running two businesses in parallel?\" Gulati said. \"They're very different models. With subscription, you've got significant skin in the game. You've got to be best in class to keep an audience. On the advertising front, you have a whole different set of priorities. You need a sales force. There are different variables for how to drive revenue. If you're going to start a business from scratch, I'm not sure you can do both well from the get go.\"The Athletic has become a force in sports journalism in less than three years, hiring beat writers from newspapers across the country and acclaimed national reporters, including baseball writer Ken Rosenthal and basketball reporter Shams Charania.Founders Alex Mather and Adam Hansmann knew from the first day that they didn't want to be an ad-supported business. They'd come from a subscription-based business, the fitness company Strava, and saw how forcing customers to pay for a product increased its quality.Creating a subscription-only sports website, when so much sports content is free, seemed counter-intuitive. But they decided they could stand out by focusing on in-depth, local stories with an emphasis on analytics and film breakdown from previous games. Generating revenue from advertising, they realized, actually worked against their idea.\"Advertising at its core is looking for breadth, not depth,\" Mather said in an interview. \"Behaviors that lead to more eyeballs tend to be stories that apply to as many people as possible. That means, for a sports site, you over-index on LeBron (James), the Dallas Cowboys, the New York Yankees. You want eyeballs. Over time, that really affects your editorial team. They start asking, 'how can I turn this story into more eyeballs?' That's wrong for the long-term success of our product.\"Mather and Hansmann had to convince investors that their business could scale as subscription-only. Focusing on sports was key to convincing VC firms, including Comcast Ventures and Bedrock Capital, to be early investors. After draining their bank accounts and putting in about $100,000 of their own money (\"Our wives are very wonderful women,\" Mather noted), The Athletic kicked off in Chicago in 2016. The pair hired veteran reporters, some who had recently been laid off, and soon earrned the trust of enough readers to become profitable. A few hundred subscribers turned into a thousand. When the Cubs won the World Series in November of that year, the site saw a surge of new customers.The data suggested readers would keep paying to read coverage of the National Hockey League's Chicago Blackhawks, the National Basketball Association's Chicago Bulls, and the Cubs. The argument for how to scale the business became straightforward -- repeat the Chicago playbook in markets across the country.Nearly three years later, The Athletic is now in 47 markets with 300 employees, 275 of which are reporters. The last time the company shared subscriber numbers, at \"more than 100,000,\" it was only in 15 markets. While Mather wouldn't disclose new customer metrics, he said the growth in subscribers was roughly concordant with growth in markets, suggesting more than 300,000 subscribers.The Athletic currently charges $45 for an annual subscription ($3.75/month -- a 25% limited time promotion rate) and $9.99/month for a monthly subscription.As a purely speculative thought experiment, one could imagine that the average revenue per annual user is $60. Multiply that by 300,000 subscribers, and that's about $18 million in annual revenue. That would only cover the cost of 300 employees if the average employee earned $60,000 a year in salary and benefits.Mather admits The Athletic is not breaking even yet, but says it's profitable in early markets. Mather says the next phase for the Athletic is to transition into creating more audio and video content, which could generate new revenue streams, including potential sponsorship and advertising opportunities.\"We're not religious about subscription,\" said Mather. \"It's what we believe will lead to the best content we can create.\"The pricing strategy of $9.99 a month is not an accident. It's a buck less than what Netflix charges for its most popular streaming subscription in the U.S.\"Netflix serves as a bar in users' minds,\" said Mather. \"A subscriber knows how much they pay for Netflix, and everything else is in relation to that.\"A sports-only website gave a customer less utility than all of Netflix, Mather said, but the site's personalized coverage (a subscriber gets to choose what sports and teams to see on the site or mobile app) and mix of professional and collegiate reporting led to the pricing decision after months of early experimentation.The metrics around The Athletic were \"best in class,\" said Bedrock Capital's Stromberg, whose firm co-led a $40 million Series C financing in the company last month. The Athletic's subscriber retention rate is around 90 percent, the company said.The key to subscription media businesses becoming profitable is to create a \"positive flywheel,\" Stromberg said.\"With these models, as you increase your subscriber bases, you increase revenue, which leads to more writers, better writers, more content, and that brings in more subscribers, which brings in more revenue,\" Stromberg said. \"It's a virtuous cycle.\"The Athletic's writers know when an article they've written entices new subscribers from internal data, Mather said. Instead of sharing readership numbers, which aren't important to the business model because there's no advertising, the editorial staff pays attention to metrics around engagement — especially those that lead to new subscriptions, he said.Not everyone agrees that subscriptions are the only way to success.Group Nine's Lerer, who is also a partner at VC-firm Lerer Hippeau, said there's still way too much money being pumped into TV advertising compared to online. That displacement should right itself over the next few years, giving many digital media entities a piece of a growing pie beyond just Google and Facebook.Blindly shutting off advertising for subscriptions is a long-term mistake, Lerer said. Having a dual revenue stream ultimately leads to a healthier business, he said.\"Our belief is we're still in early innings of what business models look like in digital,\" Lerer said. \"If we find smart people with editorial approaches that are differentiated, those will be interesting businesses for us to invest in, regardless of the business model.\"Lerer Hippeau believed it found one in 2016 in Axios, the politics-heavy news website co-founded by Jim VandeHei, Mike Allen and Roy Schwartz. Axios is one of CNBC's Upstart 100 companies for 2018.Axios had $12.5 million in advertising revenue in its first year and is on track to double that amount in year two, VandeHei said. The company says it's also expecting a big jump in year three that could double revenue again, from $25 million to $50 million.The Axios co-founders all came from Politico, the political website that VandeHei co-founded. Politico found success creating free content, building a brand and an audience, and surviving on advertising revenue.VandeHei knew it could work, and that was his pitch to VCs including Lerer Hippeau and NBC News, who were both part of a Series A funding round. (NBC News is part of NBCUniversal, CNBC's parent company.)VandeHei said his concern with starting a subscription-only business was that it could have difficulty scaling. Instead, he hoped to build the largest audience possible by making Axios's reporting available to everyone. Then, when the ad growth looked as it was dying down, Axios could add in a subscription option as a new revenue stream.While VandeHei was keenly aware that Facebook and Google were gobbling up the majority of digital ad dollars, he believed Axios could thrive by targeting advertising from companies looking to promote their brands rather than get customers to buy a particular product. For instance, Axios allows advertisers to write sponsored posts that appear in its newsletters.\"That space has done even better than we would have thought,\" VandeHei said in an interview. \"That's the space for us, The Atlantic, Quartz, The New York Times — it's been a growth business for quite a long time.\"Like The Atlantic, Axios isn't dogmatic about its business model.\"What we're looking for is a signal that we see that our doubling of year-over-year ad revenue is starting to slow,\" VandeHei said. \"Once you see it, then about 18 months before it happens, you want to begin an additive subscription business.\"In other words, the longer Axios stays free, the longer you'll know its advertising business is flourishing. Its eventual subscription business won't eliminate the free product, VandeHei said. Rather, it will be a premium package designed \"to go above and beyond what you've already trained customers to expect for free.\" This is similar to Politico Pro, the subscription service that launched about four years after the free version of Politico.\"When we invested in Axios, it wasn't like 'we like this business because they'll build an ad business,' it was 'we like this business because they have talent running the organization and the kind of audience that will be really valuable,'\" Lerer said. \"What that will mean from a business model perspective will figure itself out. The assumption will be they will find multiple ways to monetize.\"Axios has already found another revenue stream, with an HBO show it launched earlier this month.When any company takes venture capital money, it must have an exit plan in mind. Investors need to be able to get a return on their money. So far, in the world of digital news startups, there haven't been too many home runs. Axel Springer acquired Business Insider for about $450 million in 2015, but it's hard to tempt a lot of venture firms when successful exits are below $500 million. There haven't been any IPOs worth more than $1 billion in the industry.Investors haven't given up. Deriving sales from both subscriptions and advertising, like cable TV networks, is likely still the ideal for news.Yet, The Information's Lessin believes that the temptations associated with advertising in the end create worse journalism.\"I've had this argument with Jim VandeHei,\" Lessin said. \"You have to be really honest about how your product and priorities change when you add new revenue streams. If you slap on advertising on the site, all of a sudden when you're writing an article, the headline might not get a lot of clicks. Maybe you change it because advertisers need to see clicks. And maybe you say, 'this is an accurate headline, but here's this other headline that might get someone else to click.' Which headline do you do?\"PlayingShare this video...Watch Next...Got a confidential news tip? We want to hear from you.Sign up for free newsletters and get more CNBC delivered to your inboxGet this delivered to your inbox, and more info about our products and services. Privacy Policy.© 2018 CNBC LLC. All Rights Reserved. A Division of NBCUniversalData is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis.Data also provided by "}