{"id": "Beyond Stan Lee: Big decisions for Marvel superhero stories and films in the future", "paragraph": "\n\n\n\n            var postLoadFunctions = {};\n            var foresee_enabled = 1\n            var dynamic_yield_enabled = 1\n                    \n\n\n\n\tCNBC_Comscore = 'Business_News';\n\n\n\n\t\tvar mpscall = {\n\t\t\t\t\t\t'node_brand' : '2'  ,  \n\n\t\t\t\t\t'site' : 'cnbc.com-relaunch'  ,  \n\n\t\t\t\t\t'content_id' : '105579653'  ,  \n\n\t\t\t\t\t'path' : '/id/105579653'  ,  \n\n\t\t\t\t\t'is_content' : '1'  ,  \n\n\t\t\t\t\t'is_sponsored' : '0'  ,  \n\n\t\t\t\t\t'adunits' : 'Top Banner|Badge A|Badge B|Badge C|Badge D|Flex Ad First|Box Ad 1|Non Iframe Custom|Inline Custom|Movable Box Ad|Responsive Rectangle'  ,  \n\n\t\t\t\t\t'keywords' : '~'  ,  \n\n\t\t\t\t\t'cat' : 'Business News|Life|Entertainment|Movies and Entertainment'  ,  \n\n\t\t\t\t\t'cag[attribution_source]' : 'CNBC US Source'  ,  \n\n\t\t\t\t\t'cag[related_primary]' : 'Stan Lee|Walt Disney Co|Hollywood|Animation and comics|Comic books and graphic novels|Comic book|Media|Entertainment|Movies|US: News|Movies and Entertainment'  ,  \n\n\t\t\t\t\t'cag[configuration_franchise]' : 'Movies and Entertainment'  ,  \n\n\t\t\t\t\t'cag[type_source]' : 'CNBC US Source'  ,  \n\n\t\t\t\t\t'cag[type_franchise]' : 'US: News|Media|Entertainment|Movies and Entertainment|Movies and Entertainment'  ,  \n\n\t\t\t\t\t'cag[type_person]' : 'Stan Lee'  ,  \n\n\t\t\t\t\t'cag[type_company]' : 'Walt Disney Co'  ,  \n\n\t\t\t\t\t'cag[type_place]' : 'Hollywood'  ,  \n\n\t\t\t\t\t'cag[type_tag]' : 'Animation and comics|Comic books and graphic novels|Comic book|Media|Entertainment|Movies'  ,  \n\n\t\t\t\t\t'cag[brand]' : 'none'  ,  \n\n\t\t\t\t\t'cag[template]' : 'story_simple'  ,  \n\n\t\t\t\t\t'cag[device]' : 'web'  ,  \n\n\t\t\t\t\t'hline' : 'Movies and Entertainment'  ,  \n\n\t\t\t\t\t'type' : 'cnbcnewsstory'  ,  \n\n\t\t\t\t\t'template' : 'story_simple'  ,  \n\n\t\t\t\t\t'title' : 'Beyond Stan Lee: Big decisions for Marvel superhero stories and films in the future'  ,  \n\n\t\t\t\t\t'pubdate' : '1542459646'  ,  \n\n\t\t\t\t\t'stitle' : 'Russo Marvels&#039; big decisions in post-Stan Lee era 181117'  ,  \n\n\t\t\t\t\t'subtype' : 'section'  ,  \n\n\t\t\t\t\t'id' : '105579653'  ,  \n\n\t\t\t\t\t'nid' : '105579653'  \n\n\t\t\n\t\t}, mpsopts = {\n\t\t  \n\t\t\"host\" : 'mps.cnbc.com',\n\t\t\"updatecorrelator\" : true\n\n\t\t};\n\n\t\tvar mps = mps || {};\n\t\tmps._ext = mps._ext || {};\n\t\tmps._adsheld = [];\n\t\tmps._queue = mps._queue || {};\n\t\tmps._queue.mpsloaded = mps._queue.mpsloaded || [];\n\t\tmps._queue.mpsinit = mps._queue.mpsinit || [];\n\t\tmps._queue.gptloaded = mps._queue.gptloaded || [];\n\t\tmps._queue.adload = mps._queue.adload || [];\n\t\tmps._queue.adclone = mps._queue.adclone || [];\n\t\tmps._queue.adview = mps._queue.adview || [];\n\t\tmps._queue.refreshads = mps._queue.refreshads || [];\n\t\tmps.__timer = Date.now ? Date.now() : (function() { return +new Date })();\n\t\tmps.__intcode = \"v2\";\n\t\tif (typeof mps.getAd != \"function\") mps.getAd = function(adunit) {\n\t\t    if (typeof adunit != \"string\") return false;\n\t\t    var slotid = \"mps-getad-\" + adunit.replace(/\\W/g, \"\");\n\t\t    if (!mps._ext || !mps._ext.loaded) {\n\t\t        mps._queue.gptloaded.push(function() {\n\t\t            typeof mps._gptfirst == \"function\" && mps._gptfirst(adunit, slotid);\n\t\t            mps.insertAd(\"#\" + slotid, adunit)\n\t\t        });\n\t\t        mps._adsheld.push(adunit)\n\t\t    }\n\t\t    return '<div id=\"' + slotid + '\" class=\"mps-wrapper\" data-mps-fill-slot=\"' + adunit + '\"></div>'\n\t\t};\n\t\t(function() {\n\t\t    head = document.head || document.getElementsByTagName(\"head\")[0], mpsload = document.createElement(\"script\");\n\t\t    mpsload.src = \"//\" + mpsopts.host + \"/fetch/ext/load-\" + mpscall.site + \".js?nowrite=2\";\n\t\t    mpsload.id = \"mps-load\";\n\t\t    head.insertBefore(mpsload, head.firstChild)\n\t\t})();\n\n\t\n\n\n\n\n  \n\n\nvar cnbcDY = {};\nif (mpscall.template.indexOf(\"story\") != -1 || mpscall.template.indexOf(\"slideshow\") != -1) {\n  cnbcDY.type = 'POST';\n  cnbcDY.data = mpscall.id;\n} else if (mpscall.template == \"home_page_ng\") {\n  cnbcDY.type = 'HOMEPAGE';\n  cnbcDY.data = '';\n} else if (mpscall.type == \"franchise\" && mpscall.template != \"video_gallery\") {\n  cnbcDY.type = 'CATEGORY';\n  cnbcDY.data = mpscall.cat.toLowerCase().split(\"|\");\n} else {\n  cnbcDY.type = '';\n  cnbcDY.data = '';\n}\n\n\n\nDY = {scsec : 8765304 ,API: function(){(DY.API.actions = DY.API.actions || []).push(arguments)}};\nDY.recommendationContext = {type: cnbcDY.type, data: cnbcDY.data};\n\n\n\n\n                (function() {\n                                var s = document.createElement('script'),\n                                t = document.getElementsByTagName('script')[0];\n                                s.async = false;\n                                s.src=('https:'==document.location.protocol?'http://st.dynamicyield.com'.replace('http:','https:') : 'http://st.dynamicyield.com' ) + '/ast?sec='+DY.scsec + '&head=true';\n                                t.parentNode.insertBefore(s, t);\n                })();\n\n\n\n\n\n\r\ndocument.addEventListener(\"DOMContentLoaded\", function(event) {\r\n  mps._queue.mpsloaded.push(function(){\r\n    mps._log('**** LOADED: cnbc-cms-header-insert');\r\n    if (window.mps) {\r\n        if (window.CNBC_Premium && CNBC_Premium.isPremium && document.cookie.indexOf('ispro=true') == -1 && (mps.pagevars.type!=\"franchise\")) {\r\n          mps.nlformtypes = mps.nlformtypes || [];\r\n          mps.nlformtypes.push('paywall');\r\n        }\r\n\r\n        //<!-- Omniture s_code path -->\r\n        mps.scodePath=\"//fm.cnbc.com/applications/cnbc.com/staticcontent/scripts/omniture/s_code.js?v=1.6.4.1\";\r\n        //<!-- end: Omniture s_code path -->\r\n\r\n        //<!-- Google PII Fix BEGIN -->\r\n        mps._queue.mpsinit.push(function() {\r\n          (function(){\r\n            mps._urlContainsEmail = function() {\r\n              var _qs = window.location.href;\r\n              if (!_qs) {\r\n                return false;\r\n              }\r\n              var _regex = /([^=&/<>()[].,;:s@\"]+(.[^=&/<>()[].,;:s@\"]+)*)@(([[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}])|(([a-zA-Z-0-9]+.)+[a-zA-Z]{2,}))/;\r\n              return _regex.test(_qs);\r\n            };\r\n            if (mps._urlContainsEmail()) {\r\n              mps._debug('[MPS]: email address detected in url, bypass gpt.');\r\n              if (mps.response && mps.response.dart && typeof(mps.response.dart.adunits) === 'object') {\r\n                if (typeof(window._mpspixZ) != 'string') {\r\n                  window._mpspixZ = (function(a){var b=\"abcdefghiklmnopqrstuvwxyz\".split(\"\");a||(a=Math.floor(Math.random()*b.length));for(var c=\"\",d=0;d<a;d++)c+=b[Math.floor(Math.random()*b.length)];return c})(12)\r\n                }\r\n                for (var i in mps.response.dart.adunits) {\r\n                  var pixelurl = ((document.location.protocol === 'https') ? 'https' : 'http') + '://pix.nbcuni.com/a-pii.gif?X=piiblock&S=' + mps.pagevars.instance + '&P=' + mps.pagevars.mpsid + '&A=' + i + '&U=' + encodeURIComponent(window.location.href) + '&_=' + window._mpspixZ;\r\n                  mps.response.dart.adunits[i].data = '<img id=\"div-gpt-x-0\" class=\"mps-slot\" data-mps-slot=\"x\" data-mps-loadset=\"0\" style=\"width:0;height:0;margin:0;padding:0;border:0;display:none;\" src=\"' + pixelurl + '\"/>';\r\n                }\r\n              }\r\n              mps.cloneAd = function() { return false; }\r\n              return true;\r\n            } else {\r\n              return false;\r\n            }\r\n          })();\r\n        });\r\n        //<!-- Google PII Fix END -->\r\n   }\r\n });\r\n});\r\n\n\n\r\n    var setAdblockerCookie = function(adblocker) {\r\n        var d = new Date();\r\n        d.setTime(d.getTime() + 60 * 60 * 24 * 30 * 1000);\r\n        document.cookie = \"__adblocker=\" + (adblocker ? \"true\" : \"false\") + \"; expires=\" + d.toUTCString() + \"; path=/\";\r\n    }\r\n    var script = document.createElement(\"script\");\r\n    script.setAttribute(\"async\", true);\r\n    script.setAttribute(\"src\", \"//www.npttech.com/advertising.js\");\r\n    script.setAttribute(\"onerror\", \"setAdblockerCookie(true);\");\r\n    script.setAttribute(\"onload\", \"setAdblockerCookie(false);\");\r\n    document.getElementsByTagName(\"head\")[0].appendChild(script);\r\n\n\n\n\r\n  if(typeof window.MediaSource !== 'function') {\r\n    if(typeof document.getElementsByTagName('meta')['tp:PreferredRuntimes'] === 'object') {\r\n        document.getElementsByTagName('meta')['tp:PreferredRuntimes'].setAttribute(\"content\", \"flash,html5\");\r\n    }\r\n}\r\n\n\n\n\n\n\nKeep Me Logged InStan Lee was more humble than the public might believe, according to Marvel Studios president Kevin Feige, but he did encourage Marvel executives to follow his lead. One way in which that directive will continue for the comic book media company after Lee's death this week: more diversity in character and storytelling.\"People would talk about the importance of the movie [Black Panther] and what a brave thing it was for Walt Disney Studios to spend this kind of money on an almost entirely African-American cast — which is entirely true,\" Feige recently told Variety. \"But look at what Stan Lee and Jack Kirby did in the 1960s, creating that character in the center of the Civil Rights movement.\"Feige recently said the comic book movie studio's films are better when they are more diverse, and the box office returns from \"Black Panther\" — as well as from DC Entertainment's \"Wonder Woman\" — back that up, not just in terms of audience approval, but measured in huge box office grosses.\"Black Panther\" grossed over $1.3 billion, according to Box Office Mojo; \"Wonder Woman\" grossed over $800 million worldwide. Marvel's next slated film, \"Captain Marvel,\" will feature \"the most powerful\" superhero in the Marvel Cinematic Universe, according to Feige.Marvel's most-profitable superhero blockbuster franchise is still Avengers, and it will reach its conclusion this summer and after that is expected to be shelved, at least for some time, by Disney and Marvel Studios, leaving some big decisions to be made about the next stage in Marvel's brand identity. The Avenger films have grossed a combined total of over $4.9 billion worldwide for Disney and Marvel, according to Box Office Mojo, representing about 28 percent of the Marvel Cinematic Universe's global box office success. Overall, the Marvel Cinematic Universe of characters is still majority white, but Marvel Studios has been expanding its representation.\"If you're in a position of power and you're the one doing the hiring, we have learned — on our last number of movies and a number of movies that haven't come out or haven't been announced — that the more diverse the group of people around the table, the better the movie,\" Feige recently said.Actor Frank Grillo, who has appeared in Captain America and Avengers films, suggested that the next Captain America can be a different race or gender.\"I don't know, but there have been rumors that Captain America could be African American. It could be a woman. You know? So they're looking,\" said Grillo, who played the Captain America villain Crossbones in 2016's \"Captain America: Civil War\" on Larry King Live.There has been some speculation that Anthony Mackie, who plays Falcon, could eventually become the new Captain America after \"Avengers 4\", which would pick up a story line that was tried out in the comic book form, according to Screen Rant.But there are risks associated with changing the race and identity of iconic characters, according to Brian Schutzer, owner of Sparkle City Comics.\"People don't want Captain America to be anyone but Steve Rogers. They don't want Thanos to be anyone but Thanos,\" said Schutzer. \"Just like Falcon (Anthony Mackie). In the comics, when Falcon became Captain America sales plummeted after the initial issue. So there is the evidence that it would not benefit Marvel.\"It has proven difficult for Marvel to establish new characters and turn them into valuable film franchises.\"Deadpool and Venom are the only two Marvel characters created in the last 40 years to have been featured in a Marvel movie. That should illustrate how hard it is to create a character,\" Schutzer said.Feige said last summer that more characters from the LGBT community are on the way. \"Both ones you've seen and ones you haven't seen,\" Feige told The Playlist, according to ScreenRant.\"Thor: Ragnarok\" actress Tessa Thompson confirmed on Twitter last year that her character Valkyrie is bisexual. \"Thor: Ragnarok\" grossed over $850 million, but a scene that confirmed Valkyrie's sexuality was cut from the film.\"Most fans are absolutely onboard with the idea of more representation among Marvel's leading characters, and I think the studio is of the same mind,\" said Shawn Robbins, chief box office analyst for boxoffice.com.Karie Bible, box office analyst for Exhibitor Relations, said diversity remains a problem and the words are still coming faster than the deeds to back them up.\"I would love to see an LGBT character in a Marvel film. Representation matters and Kevin Feige has said that it will happen. That said, studios are still reluctant to do it, as they don't want to risk alienating audiences or get shut out of key foreign markets like China or Russia,\" Bible said. \"These films are costly to make, market and distribute, so they have to deliver. I hope someday in the future that films will be so diverse and inclusive that it will no longer be an issue. Unfortunately we aren't there yet.\"Marvel Studios and Disney declined to comment.Schultzer noted that Marvel already has successfully established LGBTQ characters in comic books, but not films, and often through supporting characters rather than leads.\"They have introduced LGBTQ characters, popular ones too like Angela, formerly of Spawn and Ms America. Angela is a fun character who was dating a 'being' who can switch between male female and other. It was entertaining, but like most characters in comics, not everyone is a star,\" he said. But Schultzer added that creating new characters in comic books and seeing which catch on with readers is an important step. \"Seeing what sells high and low in comics is like seeing the future in movies.\"Comic book sales have experienced recent ups and downs. According to a report by Comichron, a website that tracks sales figures for comic books and graphic novels, 2017 brought a record three-month stretch in declining sales for the industry. This year has seen an increase in sales, but the best-selling comic books were in the core \"Fantastic Four\" and \"Infinity Wars\" story lines, which include several popular Marvel characters, such as Dr. Strange, and Captain Marvel.Marvel's Fantastic Four characters were created in 1961 and have had three films since 2005, making a combined total of over $786 million worldwide, according to Box Office Mojo. Last year's \"Avengers: Infinity War\" grossed over $2 billion.Marvel is dealing with some tensions in the market as it attempts to broaden the Marvel Cinematic Universe. The moviegoing public has shown through recent successes like \"Black Panther\" that it wants more diverse characters featured, but within the traditional comic book fandom there are worries about how straying too far from core characters may influence sales.David Gabriel, Marvel's senior vice president of print, sales and marketing was criticized for comments he made last year regarding declining comic sales in relation to diversity.\"We saw the sales of any character that was diverse, any character that was new, our female characters, anything that was not a core Marvel character, people were turning their nose up against,\" Gabriel said in an interview with iCv2, a trade publication that bills itself as covering \"the business of geek culture.\"Gabriel later explained that his comments reflected what Marvel was hearing from some retailers in the comic book marketplace and complaints about the \"false abandonment\" of core characters. The Marvel executive stressed that the company was sticking with the new characters, and said another reason for the sales slump could simply have been that there was too much product.\"Contrary to what some said about characters 'not working,' the sticking factor and popularity for a majority of these new titles and characters like Squirrel Girl, Ms. Marvel, The Mighty Thor, Spider-Gwen, Miles Morales, and Moon Girl continue to prove that our fans and retailers ARE excited about these new heroes,\" Gabriel said. \"And let me be clear, our new heroes are not going anywhere!\"Marvel Studios has to move in new directions after the Avengers era ends, said Doug Stone, president of Box Office Analyst, or it will face an even bigger risk: bored moviegoers. \"The risks of moving in new directions are the same as with any series. It depends on how interesting the plot and characters are. If Marvel doesn't move in new directions they would almost certainly face familiarity fatigue. As with all in the cinema world, new and fresh is needed.\"—By Donovan Russo, special to CNBC.comGot a confidential news tip? We want to hear from you.Sign up for free newsletters and get more CNBC delivered to your inboxGet this delivered to your inbox, and more info about our products and services. Privacy Policy.© 2018 CNBC LLC. All Rights Reserved. A Division of NBCUniversalData is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis.Data also provided by "}