{"id": "How Turkey gains from the grisly drama over the killing of journalist Jamal Khashoggi", "paragraph": "\n\n\n\n            var postLoadFunctions = {};\n            var foresee_enabled = 1\n            var dynamic_yield_enabled = 1\n                    \n\n\n\n\tCNBC_Comscore = 'Politics';\n\n\n\n\t\tvar mpscall = {\n\t\t\t\t\t\t'node_brand' : '2'  ,  \n\n\t\t\t\t\t'site' : 'cnbc.com-relaunch'  ,  \n\n\t\t\t\t\t'content_id' : '105518375'  ,  \n\n\t\t\t\t\t'path' : '/id/105518375'  ,  \n\n\t\t\t\t\t'is_content' : '1'  ,  \n\n\t\t\t\t\t'is_sponsored' : '0'  ,  \n\n\t\t\t\t\t'adunits' : 'Top Banner|Badge A|Badge B|Badge C|Badge D|Flex Ad First|Box Ad 1|Non Iframe Custom|Inline Custom|Movable Box Ad|Responsive Rectangle'  ,  \n\n\t\t\t\t\t'keywords' : '~'  ,  \n\n\t\t\t\t\t'cat' : 'Politics'  ,  \n\n\t\t\t\t\t'cag[attribution_source]' : 'CNBC US Source'  ,  \n\n\t\t\t\t\t'cag[related_primary]' : 'Agatha Christie|Donald Trump|Jamal Khashoggi|New York Times Co|Recep Tayyip Erdogan|Laws|Crime|Apple Inc|White House|Elections|Politics|Commentary|Law|International Homepage'  ,  \n\n\t\t\t\t\t'cag[configuration_franchise]' : 'Politics'  ,  \n\n\t\t\t\t\t'cag[attribution_author]' : 'Fred Kempe'  ,  \n\n\t\t\t\t\t'cag[type_source]' : 'CNBC US Source'  ,  \n\n\t\t\t\t\t'cag[type_franchise]' : 'Commentary|Law|Crime|International Homepage|White House|Elections|Politics|Politics'  ,  \n\n\t\t\t\t\t'cag[type_person]' : 'Agatha Christie|Donald Trump|Jamal Khashoggi|Recep Tayyip Erdogan'  ,  \n\n\t\t\t\t\t'cag[type_company]' : 'New York Times Co|Apple Inc'  ,  \n\n\t\t\t\t\t'cag[type_tag]' : 'Laws|Crime|Elections|Politics'  ,  \n\n\t\t\t\t\t'cag[type_place]' : 'White House'  ,  \n\n\t\t\t\t\t'cag[type_creator]' : 'Fred Kempe'  ,  \n\n\t\t\t\t\t'cag[brand]' : 'none'  ,  \n\n\t\t\t\t\t'cag[template]' : 'story_simple'  ,  \n\n\t\t\t\t\t'cag[device]' : 'web'  ,  \n\n\t\t\t\t\t'hline' : 'Politics'  ,  \n\n\t\t\t\t\t'type' : 'cnbcnewsstory'  ,  \n\n\t\t\t\t\t'template' : 'story_simple'  ,  \n\n\t\t\t\t\t'title' : 'How Turkey gains from the grisly drama over the killing of journalist Jamal Khashoggi'  ,  \n\n\t\t\t\t\t'pubdate' : '1540004604'  ,  \n\n\t\t\t\t\t'stitle' : 'Fred Kempe: Turkey gains from Khashoggi drama'  ,  \n\n\t\t\t\t\t'byline' : 'Fred Kempe'  ,  \n\n\t\t\t\t\t'subtype' : 'section'  ,  \n\n\t\t\t\t\t'id' : '105518375'  ,  \n\n\t\t\t\t\t'nid' : '105518375'  \n\n\t\t\n\t\t}, mpsopts = {\n\t\t  \n\t\t\"host\" : 'mps.cnbc.com',\n\t\t\"updatecorrelator\" : true\n\n\t\t};\n\n\t\tvar mps = mps || {};\n\t\tmps._ext = mps._ext || {};\n\t\tmps._adsheld = [];\n\t\tmps._queue = mps._queue || {};\n\t\tmps._queue.mpsloaded = mps._queue.mpsloaded || [];\n\t\tmps._queue.mpsinit = mps._queue.mpsinit || [];\n\t\tmps._queue.gptloaded = mps._queue.gptloaded || [];\n\t\tmps._queue.adload = mps._queue.adload || [];\n\t\tmps._queue.adclone = mps._queue.adclone || [];\n\t\tmps._queue.adview = mps._queue.adview || [];\n\t\tmps._queue.refreshads = mps._queue.refreshads || [];\n\t\tmps.__timer = Date.now ? Date.now() : (function() { return +new Date })();\n\t\tmps.__intcode = \"v2\";\n\t\tif (typeof mps.getAd != \"function\") mps.getAd = function(adunit) {\n\t\t    if (typeof adunit != \"string\") return false;\n\t\t    var slotid = \"mps-getad-\" + adunit.replace(/\\W/g, \"\");\n\t\t    if (!mps._ext || !mps._ext.loaded) {\n\t\t        mps._queue.gptloaded.push(function() {\n\t\t            typeof mps._gptfirst == \"function\" && mps._gptfirst(adunit, slotid);\n\t\t            mps.insertAd(\"#\" + slotid, adunit)\n\t\t        });\n\t\t        mps._adsheld.push(adunit)\n\t\t    }\n\t\t    return '<div id=\"' + slotid + '\" class=\"mps-wrapper\" data-mps-fill-slot=\"' + adunit + '\"></div>'\n\t\t};\n\t\t(function() {\n\t\t    head = document.head || document.getElementsByTagName(\"head\")[0], mpsload = document.createElement(\"script\");\n\t\t    mpsload.src = \"//\" + mpsopts.host + \"/fetch/ext/load-\" + mpscall.site + \".js?nowrite=2\";\n\t\t    mpsload.id = \"mps-load\";\n\t\t    head.insertBefore(mpsload, head.firstChild)\n\t\t})();\n\n\t\n\n\n\n\n  \n\n\nvar cnbcDY = {};\nif (mpscall.template.indexOf(\"story\") != -1 || mpscall.template.indexOf(\"slideshow\") != -1) {\n  cnbcDY.type = 'POST';\n  cnbcDY.data = mpscall.id;\n} else if (mpscall.template == \"home_page_ng\") {\n  cnbcDY.type = 'HOMEPAGE';\n  cnbcDY.data = '';\n} else if (mpscall.type == \"franchise\" && mpscall.template != \"video_gallery\") {\n  cnbcDY.type = 'CATEGORY';\n  cnbcDY.data = mpscall.cat.toLowerCase().split(\"|\");\n} else {\n  cnbcDY.type = '';\n  cnbcDY.data = '';\n}\n\n\n\nDY = {scsec : 8765304 ,API: function(){(DY.API.actions = DY.API.actions || []).push(arguments)}};\nDY.recommendationContext = {type: cnbcDY.type, data: cnbcDY.data};\n\n\n\n\n                (function() {\n                                var s = document.createElement('script'),\n                                t = document.getElementsByTagName('script')[0];\n                                s.async = false;\n                                s.src=('https:'==document.location.protocol?'http://st.dynamicyield.com'.replace('http:','https:') : 'http://st.dynamicyield.com' ) + '/ast?sec='+DY.scsec + '&head=true';\n                                t.parentNode.insertBefore(s, t);\n                })();\n\n\n\n\n\n\r\ndocument.addEventListener(\"DOMContentLoaded\", function(event) {\r\n  mps._queue.mpsloaded.push(function(){\r\n    mps._log('**** LOADED: cnbc-cms-header-insert');\r\n    if (window.mps) {\r\n        if (window.CNBC_Premium && CNBC_Premium.isPremium && document.cookie.indexOf('ispro=true') == -1 && (mps.pagevars.type!=\"franchise\")) {\r\n          mps.nlformtypes = mps.nlformtypes || [];\r\n          mps.nlformtypes.push('paywall');\r\n        }\r\n\r\n        //<!-- Omniture s_code path -->\r\n        mps.scodePath=\"//fm.cnbc.com/applications/cnbc.com/staticcontent/scripts/omniture/s_code.js?v=1.6.4.1\";\r\n        //<!-- end: Omniture s_code path -->\r\n\r\n        //<!-- Google PII Fix BEGIN -->\r\n        mps._queue.mpsinit.push(function() {\r\n          (function(){\r\n            mps._urlContainsEmail = function() {\r\n              var _qs = window.location.href;\r\n              if (!_qs) {\r\n                return false;\r\n              }\r\n              var _regex = /([^=&/<>()[].,;:s@\"]+(.[^=&/<>()[].,;:s@\"]+)*)@(([[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}])|(([a-zA-Z-0-9]+.)+[a-zA-Z]{2,}))/;\r\n              return _regex.test(_qs);\r\n            };\r\n            if (mps._urlContainsEmail()) {\r\n              mps._debug('[MPS]: email address detected in url, bypass gpt.');\r\n              if (mps.response && mps.response.dart && typeof(mps.response.dart.adunits) === 'object') {\r\n                if (typeof(window._mpspixZ) != 'string') {\r\n                  window._mpspixZ = (function(a){var b=\"abcdefghiklmnopqrstuvwxyz\".split(\"\");a||(a=Math.floor(Math.random()*b.length));for(var c=\"\",d=0;d<a;d++)c+=b[Math.floor(Math.random()*b.length)];return c})(12)\r\n                }\r\n                for (var i in mps.response.dart.adunits) {\r\n                  var pixelurl = ((document.location.protocol === 'https') ? 'https' : 'http') + '://pix.nbcuni.com/a-pii.gif?X=piiblock&S=' + mps.pagevars.instance + '&P=' + mps.pagevars.mpsid + '&A=' + i + '&U=' + encodeURIComponent(window.location.href) + '&_=' + window._mpspixZ;\r\n                  mps.response.dart.adunits[i].data = '<img id=\"div-gpt-x-0\" class=\"mps-slot\" data-mps-slot=\"x\" data-mps-loadset=\"0\" style=\"width:0;height:0;margin:0;padding:0;border:0;display:none;\" src=\"' + pixelurl + '\"/>';\r\n                }\r\n              }\r\n              mps.cloneAd = function() { return false; }\r\n              return true;\r\n            } else {\r\n              return false;\r\n            }\r\n          })();\r\n        });\r\n        //<!-- Google PII Fix END -->\r\n   }\r\n });\r\n});\r\n\n\n\r\n    var setAdblockerCookie = function(adblocker) {\r\n        var d = new Date();\r\n        d.setTime(d.getTime() + 60 * 60 * 24 * 30 * 1000);\r\n        document.cookie = \"__adblocker=\" + (adblocker ? \"true\" : \"false\") + \"; expires=\" + d.toUTCString() + \"; path=/\";\r\n    }\r\n    var script = document.createElement(\"script\");\r\n    script.setAttribute(\"async\", true);\r\n    script.setAttribute(\"src\", \"//www.npttech.com/advertising.js\");\r\n    script.setAttribute(\"onerror\", \"setAdblockerCookie(true);\");\r\n    script.setAttribute(\"onload\", \"setAdblockerCookie(false);\");\r\n    document.getElementsByTagName(\"head\")[0].appendChild(script);\r\n\n\n\n\r\n  if(typeof window.MediaSource !== 'function') {\r\n    if(typeof document.getElementsByTagName('meta')['tp:PreferredRuntimes'] === 'object') {\r\n        document.getElementsByTagName('meta')['tp:PreferredRuntimes'].setAttribute(\"content\", \"flash,html5\");\r\n    }\r\n}\r\n\n\n\n\n\n\nKeep Me Logged InISTANBUL – When Turkish investigators entered the alleged murder scene inside the Saudi consulate, they were met by the tell-tale aroma of industrial-strength cleanser and fresh paint. However, they were not surprised, having been alerted by Turkish security services that the Saudis had sent an expert team inside to conceal as best as possible their likely crime of two weeks earlier.The notion that Saudi journalist Jamal Khashoggi had himself relayed to the world via his Apple Watch evidence of his own torture, killing and dismemberment was quickly replaced by a more compelling story line.Turkish intelligence services – through embedded devices that had evaded detection – had captured audio and, one well-informed source insists, also video files of the Khashoggi killing. Even more significant, Turkish President Recep Tayyip Erdogan was deciding personally, through close advisers, what details to release to the world and at what moment.The most dramatic fruit of President Erdogan's efforts came late Friday, when the Saudi government said it had fired five senior officials and arrested 18 other Saudis as a result of the investigation that the Turkish leader forced to happen. It was a dramatic turnabout from initial Saudi insistence that Khashoggi had left the consulate unharmed, while still protecting Crown Prince Mohammed bin Salman through the narrative of a fistfight gone wrong.Most damning was news that those fired included Saud al-Quahtani, the crown prince's ever-present adviser, who was reported to be at the scene, and deputy intelligence chief Maj. Gen Ahmed al-Assiri. President Donald Trump called the Saudi moves \"a good start,\" leaving the world to wonder what might be the next Saudi shoes to drop in a story more gripping than the best fiction.This once-Ottoman and now-Turkish capital has been the setting for some of history's richest plots, from Eric Ambler's Constantinople to Agatha Christie's Istanbul. Yet what has unfolded in real time over nearly three weeks, let's call it \"Murder on the Bosporus,\" is far more gruesome in its details and endlessly richer in its geopolitical complexity than any novelist's best-spun scheme.It is equal parts murder mystery and geopolitical thriller, with historic stakes that could shake an Arab monarchy, shape regional security, influence global Islam and even impact crucial midterm elections in the United States, the world's most powerful democracy. A senior Trump administration official calls the situation \"the biggest foreign policy challenge we've faced.\" A Mideast ally sums it up in more graphic terms as \"a freaking mess.\"The most worrisome aspect of the Khashoggi affair and its aftermath, says one well-informed Western diplomat in Turkey, is the glimpse it provides into an unraveling world order constructed by the U.S. and its allies, and the jungle that appears to be growing in its place.By this diplomat's account, the story begins with a monarchy's violation of the Vienna convention through the use of a protected diplomatic mission for a murder. This all-too-true story is then \"weaponized\" against that kingdom's crown prince by a Turkish rival whose own record for muzzling free speech is a matter of public record. Both the Turks and Saudis then turn to the individual most able to influence outcomes, a U.S. president who is more transactional than traditional in his vision of values-driven U.S. global leadership.One of the least appreciated aspects of this drama is the influence of Turkish President Erdogan, who has shown the ability, through the well-timed release of crucial details, to fuel the global outrage against Saudi Arabia or tamp it down, driven by his unique mix of outrage and calculus.Western diplomats believe the Turkish leader's rapid response was driven by a mixture of regional rivalry, religiously motivated disgust and diplomatic cunning. By these accounts, he was outraged that his Saudi neighbors would so brazenly act on Turkish soil and was further inflamed that the victim, Jamal Khashoggi was \"a brother\" – a long-time friend of the Muslim Brotherhood, the sworn enemies of Crown Prince Mohammed bin Salman.Beyond that, Erdogan used the opportunity to weaken Saudi Arabia's rising Crown Prince Mohammed bin Salman. He at the same time further burnished his image with U.S. President Donald Trump, as U.S.-Turkish relations emerge from a low point.The timing of the Khashoggi death on Oct. 2 and the Turkish release of American Pastor Andrew Brunson 10 days later from house arrest likely was coincidental. However, Turks hope that their intelligence sharing around the murder, and U.S. distancing from Riyadh, will contribute to their own efforts to further improve relations.Though Erdogan would never have wished for such a tragedy, Western diplomats say he has thus far he has managed the situation skillfully.They believe he slowed the release of damning details after it seemed Trump might throw the Saudi crown prince under a bus and following the Saudi king's intervention to repair relations with Turkey. When both Trump and the Saudis appeared to veer from this more cooperative course, the Turkish revelations again accelerated.Reports primarily in the Washington Post, the New York Times and Sabah, a newspaper close to the Erdogan regime, included details of the two private planes' arrival and departure from Istanbul, and now as well have included the names and ages of their 15 passengers, a dozen of whom have links to Saudi security services. One is now said to be Maher Abdulaziz Mutreb, a frequent travel companion on Crown Prince Mohammed bin Salman's diplomatic missions.Details from the audio – according to the Sabah newspaper and a Turkish official -- have the consul general, Mohammed al-Otaibi, saying to the killers, \"Do this outside. You will put me in trouble.\"To which one of the agents replied, \"If you want to live when you come back to Arabia, shut up.\"Turkish officials, reporting on the audio, focus on what they say is the voice of a Saudi doctor, who had come along to help with the dismemberment and disposal of the body, which Turkish officials cite as evidence of pre-meditated murder. As agents cut off Khashoggi's head and limbs, the doctor provided advice that they listen to music, as he would then do himself, to ease the tension.If this were a novel, this would be grist for a page-turner. As reality, it couldn't be more disturbing. There appears to be only one reason the tapes haven't yet been released for international inspection yet – that President Erdogan is holding them for even greater leverage. For all the damning evidence, he also hasn't pointed his own finger or that of other Turkish officials at Crown Prince Mohammed bin Salman.No one can predict where this story ends for Saudi leadership, U.S.-Saudi and Turkish relations and President Erdogan's regional role. What's safe to predict is that Erdogan is likely to provide a few more plot twists before this is all over. He's retained the most powerful leverage of all, if it exists: the actual video, or possibly audio, that could still undermine the latest Saudi narrative.The final chapter of this drama has yet to be written.Frederick Kempe is a best-selling author, prize-winning journalist and president & CEO of the Atlantic Council, one of the United States' most influential think tanks on global affairs. He worked at The Wall Street Journal for more than 25 years as a foreign correspondent, assistant managing editor and as the longest-serving editor of the paper's European edition. His latest book – \"Berlin 1961: Kennedy, Khrushchev, and the Most Dangerous Place on Earth\" – was a New York Times best-seller and has been published in more than a dozen languages. Follow him on Twitter \n@FredKempe\nand subscribe here to Inflection Points, his look each Saturday at the past week's top stories and trends.For more insight from CNBC contributors, follow \n\n@CNBCopinion\n\n on Twitter.PlayingShare this video...Watch Next...Got a confidential news tip? We want to hear from you.Sign up for free newsletters and get more CNBC delivered to your inboxGet this delivered to your inbox, and more info about our products and services. Privacy Policy.© 2018 CNBC LLC. All Rights Reserved. A Division of NBCUniversalData is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis.Data also provided by "}