{"id": "How to seriously make a difference through your work", "paragraph": "Sherri Franklin was running a successful San Francisco hair salon when she realized something: Work just wasn't as satisfying as it used to be.What was rewarding, though, was volunteering at the local animal shelter. \"I just go mad for the dogs,\" she says, particularly the old ones with gray or white faces. \"Normal people have a reaction to puppies,\" she says. \"Old dogs are my calling.\" She spent hours walking an old basset-beagle mix named Heidi — and was heartbroken to arrive at the shelter one day and learn that her furry friend had been euthanized.More from The Story Exchange:Muttville's startup story5 Sources of Money for Your StartupGood on the GroundResearch shows that old dogs over 7 are often considered \"unadoptable\" and put down even if they are in good health with friendly personalities. Motivated by grief, Franklin became committed to changing that statistic, even though her job experience entailed managing salons, cutting hair and (generally speaking) dealing with humans. \"It was a leap of faith,\" she says. But, \"I had a burning feeling that I had to try.\"Today, Franklin is the founder of Muttville, a 19-employee social enterprise whose mission is to change the way the world thinks about and treats older dogs. The $4 million nonprofit organization rescues about 1,000 senior dogs each year and finds them foster or \"forever\" homes, working out of a 10,000-square-foot cage-free facility. In 2016, she was recognized as a CNN Hero for her work saving senior dogs from euthanasia.Here's Franklin's advice to anyone thinking about making an impact in the world by starting a social enterprise:That's good advice for anyone starting a small business, but it's all the more critical when you're starting a socially conscious venture that might require a good chunk of your time, money and emotional capacity. \"You must have a passion for what you are doing,\" she says. \"It's way too much work if you're not feeling it.\"In Franklin's case, she first learned about issues related to unwanted pets by volunteering at the shelter. She got to know veterinarians and fellow animal activists, and eventually applied for a position on San Francisco's Animal Control and Welfare Commission (she was appointed, and served for 6 years).\"I've seen things that have taken my breath away and made me have nightmares and feel despair,\" she says. But she also helped write the city's backyard dog ordinance, which mandates minimum care for pets kept in backyards. The experience putting solutions in place gave the hairstylist new standing in the animal rescue world.Before she launched Muttville in 2007, Franklin continued to operate a hair salon and started taking dogs home that were slated for euthanasia. She matched many of her salon clients to furry companions. She learned about what it would take to run an animal-rescue organization, all while continuing to support herself by cutting hair.\"If you've got millions of dollars saved, then jump in wholeheartedly,\" she says. \"If you still have to pay a mortgage or rent, you do have to start slower, like I did.\" She continued to cut hair on the side after starting Muttville, as it took many years — and much fundraising — to pay herself a salary.Franklin had owned two salons — one in San Francisco, and one in Aspen, Colo. — before launching Muttville, so she had more experience than most newbie business owners. But launching a mission-driven business is another matter. She took classes about how to start a 501(c)(3) nonprofit through national organizations like the Foundation Center, CompassPointand even Craigslist Foundation, which ran a nonprofit bootcamp program. (That work is now being done by Social Media for Nonprofits). She attended conferences, enrolled in seminars, watched YouTube videos and \"asked for a lot of help,\" which also helped build her network.This is especially critical if your social enterprise does not generate revenue by selling products or services. \"I remember being told before I started Muttville that 'you will never stop fundraising, you're always going to be asking for money,'\" Franklin says. \"The truth is, that's exactly right.\" She says it's easier to do if you focus on your social mission when raising funds. \"When I'm asking for money, I am not asking for me,\" she says. \"I am asking for the dogs.\"During her first year, she recalls getting a $5,000 donation \"and calling everybody I knew\" in excitement, she says. Today, 80 percent of Muttville's $4 million operating budget comes from individuals, and she has donors who give as much as $1 million a person to support Muttville.This is a particular challenge for social entrepreneurs, who by definition are trying to make the world a better place by tackling a variety of environmental or societal problems such as addiction, poverty and homelessness. \"You have to keep your eye on the fact that you're helping the problem,\" Franklin says, even if that only means \"making the problem a little bit less.\" Before Muttville, she used to volunteer to take a dog for its last walk before euthanasia because \"I wanted to make sure it had a final last joy.\"She doesn't even like to visit places like India, because she knows she can't fix the animal-rights issues there. But at home at least, \"no dog in San Francisco has to face euthanasia anymore,\" she says, thanks to Muttville's efforts. \"Doing something rather than nothing [is] sometimes not the easiest path to take, but it is the most rewarding.\"This article was originally published by The Story ExchangeDon't miss: \n3 affordable features that can increase the value of your home\nLike this story? Subscribe to CNBC Make It on YouTube!PlayingShare this video...Watch Next...Data is a real-time snapshot *Data is delayed at least 15 minutesGlobal Business and Financial News, Stock Quotes, and Market Data and AnalysisData also provided by© 2018 CNBC LLC.  All Rights Reserved. A Division of NBCUniversal "}