{"id": "If you're planning to retire in 2019, here's how to make sure you're prepared", "paragraph": "\n\n\n\n            var postLoadFunctions = {};\n            var foresee_enabled = 1\n            var dynamic_yield_enabled = 1\n                    \n\n\n\n\tCNBC_Comscore = 'Investing';\n\n\n\n\t\tvar mpscall = {\n\t\t\t\t\t\t'node_brand' : '2'  ,  \n\n\t\t\t\t\t'site' : 'cnbc.com-relaunch'  ,  \n\n\t\t\t\t\t'content_id' : '105543243'  ,  \n\n\t\t\t\t\t'path' : '/id/105543243'  ,  \n\n\t\t\t\t\t'is_content' : '1'  ,  \n\n\t\t\t\t\t'is_sponsored' : '0'  ,  \n\n\t\t\t\t\t'adunits' : 'Top Banner|Badge A|Badge B|Badge C|Badge D|Flex Ad First|Box Ad 1|Non Iframe Custom|Inline Custom|Movable Box Ad|Responsive Rectangle'  ,  \n\n\t\t\t\t\t'keywords' : '~'  ,  \n\n\t\t\t\t\t'cat' : 'Investing|Personal Finance'  ,  \n\n\t\t\t\t\t'cag[configuration_franchise]' : 'Personal Finance'  ,  \n\n\t\t\t\t\t'cag[attribution_source]' : 'CNBC US Source'  ,  \n\n\t\t\t\t\t'cag[related_primary]' : 'U.S. Economy|Stock markets|Patient Protection and Affordable Care Act|401(k) plans|Individual retirement accounts|Medicare|Individual health insurance|Life|Government taxation and revenue|Tax planning|Social Security|Retirement planning|Investment strategy|Personal finance|Personal Finance|Retire Well|US Economy|401(k)|IRA|Roth IRA'  ,  \n\n\t\t\t\t\t'cag[related_related]' : 'Retirement|College|Savings|Debt|Careers'  ,  \n\n\t\t\t\t\t'cag[attribution_author]' : 'Sarah O&#039;Brien'  ,  \n\n\t\t\t\t\t'cag[type_franchise]' : 'Personal Finance|Personal Finance|Retire Well|US Economy|Life|Medicare|401(k)|IRA|Roth IRA|Stocks|Taxes|Retirement|Tax Planning|College|Social Security|Retirement|Savings|Investing|Debt|Careers'  ,  \n\n\t\t\t\t\t'cag[type_source]' : 'CNBC US Source'  ,  \n\n\t\t\t\t\t'cag[type_tag]' : 'U.S. Economy|Stock markets|Patient Protection and Affordable Care Act|401(k) plans|Individual retirement accounts|Medicare|Individual health insurance|Life|Government taxation and revenue|Tax planning|Social Security|Retirement planning|Investment strategy|Personal finance'  ,  \n\n\t\t\t\t\t'cag[type_creator]' : 'Sarah O&#039;Brien'  ,  \n\n\t\t\t\t\t'cag[brand]' : 'none'  ,  \n\n\t\t\t\t\t'cag[template]' : 'story_simple'  ,  \n\n\t\t\t\t\t'cag[device]' : 'web'  ,  \n\n\t\t\t\t\t'hline' : 'Personal Finance'  ,  \n\n\t\t\t\t\t'type' : 'cnbcnewsstory'  ,  \n\n\t\t\t\t\t'template' : 'story_simple'  ,  \n\n\t\t\t\t\t'title' : 'If you&amp;#039;re planning to retire in 2019, here&amp;#039;s how to make sure you&amp;#039;re prepared'  ,  \n\n\t\t\t\t\t'pubdate' : '1541347362'  ,  \n\n\t\t\t\t\t'stitle' : 'If you&#039;re retiring in 2019, here&#039;s how to make sure you&#039;re prepared'  ,  \n\n\t\t\t\t\t'byline' : 'Sarah O&amp;#039;Brien'  ,  \n\n\t\t\t\t\t'subtype' : 'section'  ,  \n\n\t\t\t\t\t'id' : '105543243'  ,  \n\n\t\t\t\t\t'nid' : '105543243'  \n\n\t\t\n\t\t}, mpsopts = {\n\t\t  \n\t\t\"host\" : 'mps.cnbc.com',\n\t\t\"updatecorrelator\" : true\n\n\t\t};\n\n\t\tvar mps = mps || {};\n\t\tmps._ext = mps._ext || {};\n\t\tmps._adsheld = [];\n\t\tmps._queue = mps._queue || {};\n\t\tmps._queue.mpsloaded = mps._queue.mpsloaded || [];\n\t\tmps._queue.mpsinit = mps._queue.mpsinit || [];\n\t\tmps._queue.gptloaded = mps._queue.gptloaded || [];\n\t\tmps._queue.adload = mps._queue.adload || [];\n\t\tmps._queue.adclone = mps._queue.adclone || [];\n\t\tmps._queue.adview = mps._queue.adview || [];\n\t\tmps._queue.refreshads = mps._queue.refreshads || [];\n\t\tmps.__timer = Date.now ? Date.now() : (function() { return +new Date })();\n\t\tmps.__intcode = \"v2\";\n\t\tif (typeof mps.getAd != \"function\") mps.getAd = function(adunit) {\n\t\t    if (typeof adunit != \"string\") return false;\n\t\t    var slotid = \"mps-getad-\" + adunit.replace(/\\W/g, \"\");\n\t\t    if (!mps._ext || !mps._ext.loaded) {\n\t\t        mps._queue.gptloaded.push(function() {\n\t\t            typeof mps._gptfirst == \"function\" && mps._gptfirst(adunit, slotid);\n\t\t            mps.insertAd(\"#\" + slotid, adunit)\n\t\t        });\n\t\t        mps._adsheld.push(adunit)\n\t\t    }\n\t\t    return '<div id=\"' + slotid + '\" class=\"mps-wrapper\" data-mps-fill-slot=\"' + adunit + '\"></div>'\n\t\t};\n\t\t(function() {\n\t\t    head = document.head || document.getElementsByTagName(\"head\")[0], mpsload = document.createElement(\"script\");\n\t\t    mpsload.src = \"//\" + mpsopts.host + \"/fetch/ext/load-\" + mpscall.site + \".js?nowrite=2\";\n\t\t    mpsload.id = \"mps-load\";\n\t\t    head.insertBefore(mpsload, head.firstChild)\n\t\t})();\n\n\t\n\n\n\n\n  \n\n\nvar cnbcDY = {};\nif (mpscall.template.indexOf(\"story\") != -1 || mpscall.template.indexOf(\"slideshow\") != -1) {\n  cnbcDY.type = 'POST';\n  cnbcDY.data = mpscall.id;\n} else if (mpscall.template == \"home_page_ng\") {\n  cnbcDY.type = 'HOMEPAGE';\n  cnbcDY.data = '';\n} else if (mpscall.type == \"franchise\" && mpscall.template != \"video_gallery\") {\n  cnbcDY.type = 'CATEGORY';\n  cnbcDY.data = mpscall.cat.toLowerCase().split(\"|\");\n} else {\n  cnbcDY.type = '';\n  cnbcDY.data = '';\n}\n\n\n\nDY = {scsec : 8765304 ,API: function(){(DY.API.actions = DY.API.actions || []).push(arguments)}};\nDY.recommendationContext = {type: cnbcDY.type, data: cnbcDY.data};\n\n\n\n\n                (function() {\n                                var s = document.createElement('script'),\n                                t = document.getElementsByTagName('script')[0];\n                                s.async = false;\n                                s.src=('https:'==document.location.protocol?'http://st.dynamicyield.com'.replace('http:','https:') : 'http://st.dynamicyield.com' ) + '/ast?sec='+DY.scsec + '&head=true';\n                                t.parentNode.insertBefore(s, t);\n                })();\n\n\n\n\n\n\r\ndocument.addEventListener(\"DOMContentLoaded\", function(event) {\r\n  mps._queue.mpsloaded.push(function(){\r\n    mps._log('**** LOADED: cnbc-cms-header-insert');\r\n    if (window.mps) {\r\n        if (window.CNBC_Premium && CNBC_Premium.isPremium && document.cookie.indexOf('ispro=true') == -1 && (mps.pagevars.type!=\"franchise\")) {\r\n          mps.nlformtypes = mps.nlformtypes || [];\r\n          mps.nlformtypes.push('paywall');\r\n        }\r\n\r\n        //<!-- Omniture s_code path -->\r\n        mps.scodePath=\"//fm.cnbc.com/applications/cnbc.com/staticcontent/scripts/omniture/s_code.js?v=1.6.4.1\";\r\n        //<!-- end: Omniture s_code path -->\r\n\r\n        //<!-- Google PII Fix BEGIN -->\r\n        mps._queue.mpsinit.push(function() {\r\n          (function(){\r\n            mps._urlContainsEmail = function() {\r\n              var _qs = window.location.href;\r\n              if (!_qs) {\r\n                return false;\r\n              }\r\n              var _regex = /([^=&/<>()[].,;:s@\"]+(.[^=&/<>()[].,;:s@\"]+)*)@(([[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}])|(([a-zA-Z-0-9]+.)+[a-zA-Z]{2,}))/;\r\n              return _regex.test(_qs);\r\n            };\r\n            if (mps._urlContainsEmail()) {\r\n              mps._debug('[MPS]: email address detected in url, bypass gpt.');\r\n              if (mps.response && mps.response.dart && typeof(mps.response.dart.adunits) === 'object') {\r\n                if (typeof(window._mpspixZ) != 'string') {\r\n                  window._mpspixZ = (function(a){var b=\"abcdefghiklmnopqrstuvwxyz\".split(\"\");a||(a=Math.floor(Math.random()*b.length));for(var c=\"\",d=0;d<a;d++)c+=b[Math.floor(Math.random()*b.length)];return c})(12)\r\n                }\r\n                for (var i in mps.response.dart.adunits) {\r\n                  var pixelurl = ((document.location.protocol === 'https') ? 'https' : 'http') + '://pix.nbcuni.com/a-pii.gif?X=piiblock&S=' + mps.pagevars.instance + '&P=' + mps.pagevars.mpsid + '&A=' + i + '&U=' + encodeURIComponent(window.location.href) + '&_=' + window._mpspixZ;\r\n                  mps.response.dart.adunits[i].data = '<img id=\"div-gpt-x-0\" class=\"mps-slot\" data-mps-slot=\"x\" data-mps-loadset=\"0\" style=\"width:0;height:0;margin:0;padding:0;border:0;display:none;\" src=\"' + pixelurl + '\"/>';\r\n                }\r\n              }\r\n              mps.cloneAd = function() { return false; }\r\n              return true;\r\n            } else {\r\n              return false;\r\n            }\r\n          })();\r\n        });\r\n        //<!-- Google PII Fix END -->\r\n   }\r\n });\r\n});\r\n\n\n\r\n    var setAdblockerCookie = function(adblocker) {\r\n        var d = new Date();\r\n        d.setTime(d.getTime() + 60 * 60 * 24 * 30 * 1000);\r\n        document.cookie = \"__adblocker=\" + (adblocker ? \"true\" : \"false\") + \"; expires=\" + d.toUTCString() + \"; path=/\";\r\n    }\r\n    var script = document.createElement(\"script\");\r\n    script.setAttribute(\"async\", true);\r\n    script.setAttribute(\"src\", \"//www.npttech.com/advertising.js\");\r\n    script.setAttribute(\"onerror\", \"setAdblockerCookie(true);\");\r\n    script.setAttribute(\"onload\", \"setAdblockerCookie(false);\");\r\n    document.getElementsByTagName(\"head\")[0].appendChild(script);\r\n\n\n\n\r\n  if(typeof window.MediaSource !== 'function') {\r\n    if(typeof document.getElementsByTagName('meta')['tp:PreferredRuntimes'] === 'object') {\r\n        document.getElementsByTagName('meta')['tp:PreferredRuntimes'].setAttribute(\"content\", \"flash,html5\");\r\n    }\r\n}\r\n\n\n\n\n\n\nKeep Me Logged InIf you're among the millions of older U.S. workers who will say farewell to full-time work in 2019, now's a good time to make sure you're truly prepared.Whether you're viewing the next phase of life as retirement, semi-retirement or an unknown adventure, experts say the transition should get more than just a passing once-over.Roughly 10,000 baby boomers turn 65 every day, the age most often associated with retirement. Of course, not everyone hangs up their working hat at exactly that age, which means your own situation could be very different from that of someone else on the verge of retiring.For instance, roughly 60 percent of workers had to stop working before they intended due to reasons such as layoffs or health issues, according to a 2015 study by Voya Financial. Still others have continued working beyond the age they once thought would mark the end of their careers.And while some people might have been saving and planning for decades for retirement, others might be crossing their fingers or have yet to give real thought to their transition away from 40-hour (or more) work weeks.Regardless of where you fall on that spectrum, experts recommend taking time to make sure you've covered all your financial bases.\"More often than not, I find that people are a bit apprehensive about retirement,\" said certified financial planner Terrence Herr, managing partner at Herr Capital Management in Chicago.Here are some things to consider as you prepare to say farewell to your coworkers next year and embark on the next leg of life's journey.You might have a general idea of what you spend, but you should have a clear picture of your expenses and how that might change in retirement.For example, while you may not have to deal with the costs of commuting or office attire, you might plan to spend more on entertainment, travel or other pursuits when your days are no longer consumed by work.\"Track your spending for the next couple of months if you're not sure,\" said Linda Rogers, a  CFP and owner of Planning Within Reach in Memphis, Tennessee.Many people also aim to have their debt (i.e., credit cards, mortgages) paid off before they make the leap to retirement. While that might not be realistic for everyone, the less debt you have, the better.Once you reach age 65, you're eligible for Medicare. So if you retire at or past that age, the government program generally is there for you. However, it doesn't cover everything; for example, dental, vision and long-term care (e.g., help with daily living, such as bathing and dressing) are not included.The amount you pay for Medicare depends on a number of factors, including your income (higher earners pay more), whether you pay any late-enrollment fees (if you didn't sign up when you were first eligible and don't meet an exclusion) and whether you opt for additional coverage and to what degree.However, if you're younger than 65, you'll need to find coverage on your own.\"A lot of people forget that, don't factor it in or find out they way underestimated the cost,\" Rogers said. \"If you're 65, so you can get on Medicare, retiring is much more doable.\"For people who face a gap in coverage, federal law known as COBRA requires employers with at least 20 workers to allow ex-employees (including retirees) to remain in an employer-sponsored health plan — if the ex-worker wants to pay the full cost of the premiums. Many employers pay a share of the premiums for current employees and typically won't do that for COBRA coverage.There are potentially other options, including an Affordable Care Act plan (a.k.a., Obamacare). Depending on your income, you could receive a subsidy if you go that route. Other options also might be available, including short-term plans — which come with skimpier coverage and typically only are a viable option for healthy people with no pre-existing conditions.Additionally, keep in mind that health-care expenses typically rise as you age. In fact, the average 65-year-old couple will spend $280,000 on health care over the remainder of their lives, research from Fidelity Investments shows.Although you can start taking Social Security at age 62, your monthly checks will be larger the longer you can delay. In fact, your benefit will increase by 6 percent to 8 percent yearly until you reach age 70, if you can hold off.However, most people don't wait that long. And with the growing number of 60-somethings still working either full- or part-time, it's important to know how wage income affects your Social Security benefits.More than half (54.7 percent) of people ages 60 to 64 were working at least part time in 2017, according to the Bureau of Labor Statistics. In the 65-to-69 crowd, nearly a third (31.2 percent) were in the workforce last year.If you start taking Social Security before your government-determined full retirement age of about 66 or 67 — the exact number depends on your birth year — there's a limit to how much you can earn from working without your benefits being affected.In 2019, that cap will be $17,640. If you earn above that, your benefits will be reduced by $1 for every $2 you earn over that threshold.Then, when you reach your full retirement age, the money comes back to you in the form of a higher monthly check. (And remember, depending on your overall income, up to 85 percent of your Social Security benefit is subject to federal income tax.)At that point, you also can earn as much as you want from working without it affecting your Social Security benefits.Also, if you are one of those early takers who is working and you reach full retirement age during 2019, then $1 gets deducted from your benefits for every $3 you earn above $46,920.In retirement, sources of income can vary from person to person and might involve a pension, retirement savings such as a 401(k) or individual retirement account, Social Security, taxable savings and investment accounts, health savings accounts, or business and trust income.\"Many people have a few different types of assets, so they want to be smart about which they tap into,\" Rogers said.For instance, not all sources of income are taxed the same. Withdrawals from traditional IRAs or 401(k) plans are taxed as ordinary income, but for Roth IRAs or Roth 401(k) plans, the withdrawals are tax-free. If you have a taxable investment account, you could have to pay capital gains taxes on some of the withdrawals.You also will face taking required minimum distributions — the annual amount that must be withdrawn — at age 70½ from your traditional IRA or 401(k). Roth IRAs do not have RMDs, although Roth 401(k) plans do. Depending on your income, those required withdrawals could push you into a higher tax bracket.If that's a possibility, it might make sense to roll the assets into a Roth IRA before you reach that point, or to tap those funds before the RMDs kick in so you don't face a sudden jump in taxes.Additionally, your annual income can affect what you pay for Medicare. With higher earners paying more, it's important to know how your income could affect what you pay for coverage.If you have a 401(k) or IRA, make sure your investment mix makes sense for your retirement income plan.Exactly how much of your portfolio should be dedicated to stocks — which are riskier but typically deliver the best returns — will depend on how much you need to generate in income during retirement and how much risk you're able to stomach.\"We've had people come in who have been in the same investments since they were 24,\" Rogers said. \"You want to evaluate the allocation of your entire portfolio to make sure the stock and bond composition is appropriate.\"More from Personal Finance:The big, nasty retirement surprise you probably didn't think aboutHeard the buzz about opportunity zone funds? Here's the skinny18 state tax measures could have a big impact on your walletFinancial advisors typically recommend that you keep several years' worth of income away from the stock market, in money markets, cash or other less risky investments.\"Don't risk the money you need in the next two or three years,\" said Herr, of Herr Capital. \"You can stomach volatility in the market if you have three years of income that is safe and not subject to those ups and downs.\"If the market is down, it would mean not having to sell investments at a lower price to generate the annual income you need to live.Many financial advisors caution that for people whose job was a big part of their self-identity, the transition to retirement can be trickier.\"Often, for the first couple of years they're happy, but then some people can get depressed,\" Rogers said.Volunteering, having a strong social network and developing varied interests can help ward off feelings of loneliness or questions of self-worth. For some retirees, sharing their knowledge through teaching delivers satisfaction, Rogers said.Also get used to the idea of watching your assets get smaller instead of grow.\"One of the hardest things that retirees face is the notion that their retirement account, which has been growing while they worked, will be going down in value over the course of retirement as they make withdrawals,\" Herr said. \"People can get really uncomfortable with that.\"PlayingShare this video...Watch Next...Got a confidential news tip? We want to hear from you.Sign up for free newsletters and get more CNBC delivered to your inboxGet this delivered to your inbox, and more info about our products and services. Privacy Policy.© 2018 CNBC LLC. All Rights Reserved. A Division of NBCUniversalData is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis.Data also provided by "}