{"id": "Firms like Morgan Stanley are using artificial intelligence to manage clients' moneySign Up for Our Newsletter Your Wealth ", "paragraph": "\n\n\n\n            var postLoadFunctions = {};\n            var foresee_enabled = 1\n            var dynamic_yield_enabled = 1\n                    \n\n\n\n\tCNBC_Comscore = 'Investing';\n\n\n\n\t\tvar mpscall = {\n\t\t\t\t\t\t'node_brand' : '2'  ,  \n\n\t\t\t\t\t'site' : 'cnbc.com-relaunch'  ,  \n\n\t\t\t\t\t'content_id' : '105515958'  ,  \n\n\t\t\t\t\t'path' : '/id/105515958'  ,  \n\n\t\t\t\t\t'is_content' : '1'  ,  \n\n\t\t\t\t\t'is_sponsored' : '0'  ,  \n\n\t\t\t\t\t'adunits' : 'Top Banner|Badge A|Badge B|Badge C|Badge D|Flex Ad First|Box Ad 1|Non Iframe Custom|Inline Custom|Movable Box Ad|Responsive Rectangle'  ,  \n\n\t\t\t\t\t'keywords' : '~'  ,  \n\n\t\t\t\t\t'cat' : 'Investing|Financial Advisors|FA Playbook'  ,  \n\n\t\t\t\t\t'cag[project_management_project]' : 'Special Reports Project'  ,  \n\n\t\t\t\t\t'cag[attribution_source]' : 'CNBC US Source'  ,  \n\n\t\t\t\t\t'cag[related_primary]' : 'Banks|Personal finance|Dow Industrials|Financial consulting|Technology|Personal investing|Wealth|Silicon Valley|Financial planning|Data mining|Artificial intelligence|Morgan Stanley|Bonds|Investment strategy|Retirement planning|Fixed Income|Financial Advisors|Retirement|Investing|Personal Finance'  ,  \n\n\t\t\t\t\t'cag[configuration_franchise]' : 'FA Playbook'  ,  \n\n\t\t\t\t\t'cag[attribution_author]' : 'Lorie Konish'  ,  \n\n\t\t\t\t\t'cag[type_franchise]' : 'Fixed Income|Financial Advisors|Retirement|Investing|Bonds|Banks|Personal Finance|FA Playbook|FA Playbook'  ,  \n\n\t\t\t\t\t'cag[type_cnbcproject]' : 'Special Reports Project'  ,  \n\n\t\t\t\t\t'cag[type_source]' : 'CNBC US Source'  ,  \n\n\t\t\t\t\t'cag[type_tag]' : 'Banks|Personal finance|Financial consulting|Technology|Personal investing|Wealth|Financial planning|Data mining|Artificial intelligence|Bonds|Investment strategy|Retirement planning'  ,  \n\n\t\t\t\t\t'cag[type_security]' : 'Dow Industrials'  ,  \n\n\t\t\t\t\t'cag[type_place]' : 'Silicon Valley'  ,  \n\n\t\t\t\t\t'cag[type_company]' : 'Morgan Stanley'  ,  \n\n\t\t\t\t\t'cag[type_creator]' : 'Lorie Konish'  ,  \n\n\t\t\t\t\t'cag[brand]' : 'none'  ,  \n\n\t\t\t\t\t'cag[template]' : 'story'  ,  \n\n\t\t\t\t\t'cag[device]' : 'web'  ,  \n\n\t\t\t\t\t'hline' : 'FA Playbook'  ,  \n\n\t\t\t\t\t'type' : 'cnbcnewsstory'  ,  \n\n\t\t\t\t\t'template' : 'story'  ,  \n\n\t\t\t\t\t'title' : 'Firms like Morgan Stanley are using artificial intelligence to manage clients&amp;#039; money'  ,  \n\n\t\t\t\t\t'pubdate' : '1540065668'  ,  \n\n\t\t\t\t\t'stitle' : 'Artificial intelligence is already changing how you manage your money'  ,  \n\n\t\t\t\t\t'byline' : 'Lorie Konish'  ,  \n\n\t\t\t\t\t'subtype' : 'special_report'  ,  \n\n\t\t\t\t\t'id' : '105515958'  ,  \n\n\t\t\t\t\t'nid' : '105515958'  \n\n\t\t\n\t\t}, mpsopts = {\n\t\t  \n\t\t\"host\" : 'mps.cnbc.com',\n\t\t\"updatecorrelator\" : true\n\n\t\t};\n\n\t\tvar mps = mps || {};\n\t\tmps._ext = mps._ext || {};\n\t\tmps._adsheld = [];\n\t\tmps._queue = mps._queue || {};\n\t\tmps._queue.mpsloaded = mps._queue.mpsloaded || [];\n\t\tmps._queue.mpsinit = mps._queue.mpsinit || [];\n\t\tmps._queue.gptloaded = mps._queue.gptloaded || [];\n\t\tmps._queue.adload = mps._queue.adload || [];\n\t\tmps._queue.adclone = mps._queue.adclone || [];\n\t\tmps._queue.adview = mps._queue.adview || [];\n\t\tmps._queue.refreshads = mps._queue.refreshads || [];\n\t\tmps.__timer = Date.now ? Date.now() : (function() { return +new Date })();\n\t\tmps.__intcode = \"v2\";\n\t\tif (typeof mps.getAd != \"function\") mps.getAd = function(adunit) {\n\t\t    if (typeof adunit != \"string\") return false;\n\t\t    var slotid = \"mps-getad-\" + adunit.replace(/\\W/g, \"\");\n\t\t    if (!mps._ext || !mps._ext.loaded) {\n\t\t        mps._queue.gptloaded.push(function() {\n\t\t            typeof mps._gptfirst == \"function\" && mps._gptfirst(adunit, slotid);\n\t\t            mps.insertAd(\"#\" + slotid, adunit)\n\t\t        });\n\t\t        mps._adsheld.push(adunit)\n\t\t    }\n\t\t    return '<div id=\"' + slotid + '\" class=\"mps-wrapper\" data-mps-fill-slot=\"' + adunit + '\"></div>'\n\t\t};\n\t\t(function() {\n\t\t    head = document.head || document.getElementsByTagName(\"head\")[0], mpsload = document.createElement(\"script\");\n\t\t    mpsload.src = \"//\" + mpsopts.host + \"/fetch/ext/load-\" + mpscall.site + \".js?nowrite=2\";\n\t\t    mpsload.id = \"mps-load\";\n\t\t    head.insertBefore(mpsload, head.firstChild)\n\t\t})();\n\n\t\n\n\n\n\n  \n\n\nvar cnbcDY = {};\nif (mpscall.template.indexOf(\"story\") != -1 || mpscall.template.indexOf(\"slideshow\") != -1) {\n  cnbcDY.type = 'POST';\n  cnbcDY.data = mpscall.id;\n} else if (mpscall.template == \"home_page_ng\") {\n  cnbcDY.type = 'HOMEPAGE';\n  cnbcDY.data = '';\n} else if (mpscall.type == \"franchise\" && mpscall.template != \"video_gallery\") {\n  cnbcDY.type = 'CATEGORY';\n  cnbcDY.data = mpscall.cat.toLowerCase().split(\"|\");\n} else {\n  cnbcDY.type = '';\n  cnbcDY.data = '';\n}\n\n\n\nDY = {scsec : 8765304 ,API: function(){(DY.API.actions = DY.API.actions || []).push(arguments)}};\nDY.recommendationContext = {type: cnbcDY.type, data: cnbcDY.data};\n\n\n\n\n                (function() {\n                                var s = document.createElement('script'),\n                                t = document.getElementsByTagName('script')[0];\n                                s.async = false;\n                                s.src=('https:'==document.location.protocol?'http://st.dynamicyield.com'.replace('http:','https:') : 'http://st.dynamicyield.com' ) + '/ast?sec='+DY.scsec + '&head=true';\n                                t.parentNode.insertBefore(s, t);\n                })();\n\n\n\n\n\n\r\ndocument.addEventListener(\"DOMContentLoaded\", function(event) {\r\n  mps._queue.mpsloaded.push(function(){\r\n    mps._log('**** LOADED: cnbc-cms-header-insert');\r\n    if (window.mps) {\r\n        if (window.CNBC_Premium && CNBC_Premium.isPremium && document.cookie.indexOf('ispro=true') == -1 && (mps.pagevars.type!=\"franchise\")) {\r\n          mps.nlformtypes = mps.nlformtypes || [];\r\n          mps.nlformtypes.push('paywall');\r\n        }\r\n\r\n        //<!-- Omniture s_code path -->\r\n        mps.scodePath=\"//fm.cnbc.com/applications/cnbc.com/staticcontent/scripts/omniture/s_code.js?v=1.6.4.1\";\r\n        //<!-- end: Omniture s_code path -->\r\n\r\n        //<!-- Google PII Fix BEGIN -->\r\n        mps._queue.mpsinit.push(function() {\r\n          (function(){\r\n            mps._urlContainsEmail = function() {\r\n              var _qs = window.location.href;\r\n              if (!_qs) {\r\n                return false;\r\n              }\r\n              var _regex = /([^=&/<>()[].,;:s@\"]+(.[^=&/<>()[].,;:s@\"]+)*)@(([[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}])|(([a-zA-Z-0-9]+.)+[a-zA-Z]{2,}))/;\r\n              return _regex.test(_qs);\r\n            };\r\n            if (mps._urlContainsEmail()) {\r\n              mps._debug('[MPS]: email address detected in url, bypass gpt.');\r\n              if (mps.response && mps.response.dart && typeof(mps.response.dart.adunits) === 'object') {\r\n                if (typeof(window._mpspixZ) != 'string') {\r\n                  window._mpspixZ = (function(a){var b=\"abcdefghiklmnopqrstuvwxyz\".split(\"\");a||(a=Math.floor(Math.random()*b.length));for(var c=\"\",d=0;d<a;d++)c+=b[Math.floor(Math.random()*b.length)];return c})(12)\r\n                }\r\n                for (var i in mps.response.dart.adunits) {\r\n                  var pixelurl = ((document.location.protocol === 'https') ? 'https' : 'http') + '://pix.nbcuni.com/a-pii.gif?X=piiblock&S=' + mps.pagevars.instance + '&P=' + mps.pagevars.mpsid + '&A=' + i + '&U=' + encodeURIComponent(window.location.href) + '&_=' + window._mpspixZ;\r\n                  mps.response.dart.adunits[i].data = '<img id=\"div-gpt-x-0\" class=\"mps-slot\" data-mps-slot=\"x\" data-mps-loadset=\"0\" style=\"width:0;height:0;margin:0;padding:0;border:0;display:none;\" src=\"' + pixelurl + '\"/>';\r\n                }\r\n              }\r\n              mps.cloneAd = function() { return false; }\r\n              return true;\r\n            } else {\r\n              return false;\r\n            }\r\n          })();\r\n        });\r\n        //<!-- Google PII Fix END -->\r\n   }\r\n });\r\n});\r\n\n\n\r\n    var setAdblockerCookie = function(adblocker) {\r\n        var d = new Date();\r\n        d.setTime(d.getTime() + 60 * 60 * 24 * 30 * 1000);\r\n        document.cookie = \"__adblocker=\" + (adblocker ? \"true\" : \"false\") + \"; expires=\" + d.toUTCString() + \"; path=/\";\r\n    }\r\n    var script = document.createElement(\"script\");\r\n    script.setAttribute(\"async\", true);\r\n    script.setAttribute(\"src\", \"//www.npttech.com/advertising.js\");\r\n    script.setAttribute(\"onerror\", \"setAdblockerCookie(true);\");\r\n    script.setAttribute(\"onload\", \"setAdblockerCookie(false);\");\r\n    document.getElementsByTagName(\"head\")[0].appendChild(script);\r\n\n\n\n\r\n  if(typeof window.MediaSource !== 'function') {\r\n    if(typeof document.getElementsByTagName('meta')['tp:PreferredRuntimes'] === 'object') {\r\n        document.getElementsByTagName('meta')['tp:PreferredRuntimes'].setAttribute(\"content\", \"flash,html5\");\r\n    }\r\n}\r\n\n\n\n\n\n\nKeep Me Logged InThe Dow Jones Industrial Average shed more than 1,300 points earlier this month in the most dramatic drop since February.If you are a client of Morgan Stanley Wealth Management, you may have received a message from your financial advisor.The purpose of the message would be to tell you exactly what happened in the market and what the firm's investment professionals are saying about it. It would also tell you your portfolio's current probability of success in light of recent events.The email would come from your financial advisor. But behind the scenes, they are getting help from a source you might not expect: artificial intelligence.Morgan Stanley is one firm experimenting with how these new technologies can be applied to better manage clients' money.Artificial intelligence refers to the ability for computer science to be applied in ways that replace human intelligence. Financial firms — ranging from big Wall Street names like Morgan Stanley to robo-advisors and start-ups — are all taking a look at how tools such as algorithms, data mining and natural-language processing can help you become wealthier.Morgan Stanley formally launched its initiative — called Next Best Action — to its more than 15,000 financial advisors earlier this year. Including the firm's service employees, more than 20,000 have access to the tools.The technology works by evaluating communications with clients by emails, texts and other notes. It then applies machine learning to evaluate other ideas that can be suggested to the client.The tool could prompt your advisor to send a message when a stock you have a significant position in has been downgraded by the firm. Or if you live in the path of a coming storm — as with hurricanes Florence and Michael recently — it can send you a note with a list of helpful resources, information on your insurance rights and tips for protecting your pets.\"The machine serves up those ideas to the financial advisor, and then they decide what makes sense based on their practice and the needs of the clients,\" said Jeff McMillan, chief analytics and data officer at Morgan Stanley Wealth Management.Natural-language technology is one way that artificial intelligence is being put to the test to handle human requests.This started hitting the mainstream a few years ago with Apple's Siri, which could answer task-based requests, such as \"Play Taylor Swift\" or \"What is the weather in New York?\" according Ram Menon, founder and CEO of Silicon Valley start-up Avaamo, which is providing conversational artificial intelligence to financial services firms.Now the technology is advancing to more complex questions to replace human interaction.For wealth management clients, that means the possibility of getting a more immediate response via mobile apps, websites or voice for routine requests, such as to rebalance your portfolio or sell a stock.\"While there is a lot of talk about AI is going to change the world, and it is, a lot of the changes that are happening in the wealth management, retirement-planning market is tangible, is practical and is just making the whole velocity of interactions more efficient,\" Menon said.Some companies are also experimenting with machine learning, where data is used to make predictions for the client.Robo-advisor Wealthfront has introduced a feature named Path, which uses third-party data and machine-learning techniques to provide answers on everything from when you can retire, how much home you can afford and which neighborhoods you can afford to live in.\"If you tell [Path] that you're going to buy that $1.3 million condo in the East Village in five years, it can actually tell you, 'That's great. If you want to do that, it looks like you might have to retire a couple of years later or you could just save more,\" said Kate Wauck, vice president of communications at Wealthfront. \"It's not siloed advice. This is the power of automation.\"At Morgan Stanley the prompts advisors can send are aimed at helping to augment — not replace — their work.\"The most powerful driver of client satisfaction are in-person meetings and phone calls with our clients,\" McMillan said.Those in-person conversations often involve discussing everything from investment options to more complex situations, such as handling parents who have early stage dementia or a child who has been diagnosed with a severe disability.The technology the firm is using solves two problems, McMillan said. First, it frees up more time for financial advisors to have more of those in-depth conversations. Second, it allows them to reach more people faster. So when the Dow has a precipitous drop, the machine allows advisors to message hundreds of clients at once — more than they could possibly reach individually.More from FA Playbook:  Is your broker switching firms? Weigh your options An enjoyable mini retirement requires serious planning  Putting retirement plans on hold? What that means for MedicareOther companies cite examples where clients are showing a preference for automated systems over human interaction.When Avaamo worked with one undisclosed financial services firm in Asia to deploy a virtual assistant to provide life insurance quotes, the clients actually preferred that contact, Menon said.\"The feedback was, 'Hey, we like the virtual assistant because it doesn't lie. It's not trying to sell me something. It's very factual,'\" Menon said.Likewise, robo-advisor Wealthfront is also betting that its clients — whose average age is 32 — prefer nonhuman contact.\"We don't call someone to really do anything anymore,\" Wauck said. \"That's just an ingrained consumer preference.\"Whether artificial intelligence will actually replace human financial advice — and how fast it does — depends on who you ask.\"I think the technology is already there to replace the human,\" Menon said. \"It's a question of adoption, as well as the seeming reluctance of the industry to let go.\"Betterment, another robo-advisor, is using artificial intelligence in a limited capacity to back-office tasks such as check processing.The company does not use the technology to generate financial advice or manage portfolios, said Dan Egan, director of behavioral finance and investing at Betterment.\"Generally speaking, machine intelligence is kind of like an autistic savant, in that it will be very good at a very narrow, well-defined set of problems,\" Egan said. \"It is not good at very open ended vague things with lots of different branches you can proceed down.\"Financial advisor Ric Edelman, executive chairman of Edelman Financial Services, is also not sure the technology is there yet.\"When it comes to personality issues and the soft side of money, the algorithms, the AI, is nowhere near ready yet to be able to help you deal with the complexities and nuances of personal finance decisions,\" Edelman said.But that could change in 10, 20 or 30 years, Edelman said, or whenever we reach the point when human and machine intelligence are indistinguishable.\"It's widely considered that that is targeted for somewhere in the 2030s,\" Edelman said. \"In other words, the financial-planning profession remains a really good career for a while to come.\"Avoid buying investments that have risen too much, and when markets go down, don't sell investments that are not doing well.  Why? Because we tend to overreact. Here's how to conduct yourself during anxiety-inducing market gyrations.Large companies such as IBM, Microsoft and Facebook are investing heavily in the development of blockchain — a new, decentralized, digital-ledger technology that threatens their traditional business models.Get the best of CNBC in your inboxLouis Barajas is founder and CEO of Wealth Management LAB, a fee-only firm specializing in the entertainment industry.Sophia Bera, founder of Gen Y Planning, has been named one of '10 Young Advisors to Watch.' Douglas Boneparth is president of Bone Fide Wealth, a Manhattan-based wealth management firm focusing on millennials, young professionals and entrepreneurs.Featuring top lawmakers, CEOs and administration officials, Capital Exchange focuses on how business and government can better collaborate to create jobs and economic growth.\r\nA look at 50 private companies set to reshape the business landscape.Frontline insights and unique views on key issues and challenges facing today’s CFOs.Avoid buying investments that have risen too much, and when markets go down, don't sell investments that are not doing well.  Why? Because we tend to overreact. Here's how to conduct yourself during anxiety-inducing market gyrations.Large companies such as IBM, Microsoft and Facebook are investing heavily in the development of blockchain — a new, decentralized, digital-ledger technology that threatens their traditional business models.Last year, investors in local currency emerging market debt benefited as the MSCI EM currency index rose 3.5 percent against the dollar. This year, it's reversed and with a risk-off mentality in global markets, local currency returns are negative.PlayingShare this video...Watch Next...Got a confidential news tip? We want to hear from you.Sign up for free newsletters and get more CNBC delivered to your inboxGet this delivered to your inbox, and more info about our products and services. Privacy Policy.© 2018 CNBC LLC. All Rights Reserved. A Division of NBCUniversalData is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis.Data also provided by "}