{"id": "Zero-waste stores pop up in the US, targeting shoppers tired of all the waste", "paragraph": "\n\n\n\n            var postLoadFunctions = {};\n            var foresee_enabled = 1\n            var dynamic_yield_enabled = 1\n                    \n\n\n\n\tCNBC_Comscore = 'Business_News';\n\n\n\n\t\tvar mpscall = {\n\t\t\t\t\t\t'node_brand' : '2'  ,  \n\n\t\t\t\t\t'site' : 'cnbc.com-relaunch'  ,  \n\n\t\t\t\t\t'content_id' : '105490817'  ,  \n\n\t\t\t\t\t'path' : '/id/105490817'  ,  \n\n\t\t\t\t\t'is_content' : '1'  ,  \n\n\t\t\t\t\t'is_sponsored' : '0'  ,  \n\n\t\t\t\t\t'adunits' : 'Top Banner|Badge A|Badge B|Badge C|Badge D|Flex Ad First|Box Ad 1|Non Iframe Custom|Inline Custom|Movable Box Ad|Responsive Rectangle'  ,  \n\n\t\t\t\t\t'keywords' : '~'  ,  \n\n\t\t\t\t\t'cat' : 'Business News|Retail|Business of Design'  ,  \n\n\t\t\t\t\t'cag[related_primary]' : 'Shopping|Consumerism|Waste management|Grocery store operators|The Kroger Co|Environment|Retail industry|Business of Design|Packaged Food and Meats|Consumer Staples|Food Distributors|Food Products|Food Retail|Retail'  ,  \n\n\t\t\t\t\t'cag[configuration_franchise]' : 'Business of Design'  ,  \n\n\t\t\t\t\t'cag[project_management_team]' : 'CNBC US Team'  ,  \n\n\t\t\t\t\t'cag[related_related]' : 'Special Reports'  ,  \n\n\t\t\t\t\t'cag[attribution_source]' : 'CNBC US Source'  ,  \n\n\t\t\t\t\t'cag[type_franchise]' : 'Business of Design|Packaged Food and Meats|Consumer Staples|Environment|Food Distributors|Food Products|Food Retail|Retail|Business of Design|Special Reports'  ,  \n\n\t\t\t\t\t'cag[type_tag]' : 'Shopping|Consumerism|Waste management|Grocery store operators|Environment|Retail industry'  ,  \n\n\t\t\t\t\t'cag[type_company]' : 'The Kroger Co'  ,  \n\n\t\t\t\t\t'cag[type_cnbcteam]' : 'CNBC US Team'  ,  \n\n\t\t\t\t\t'cag[type_source]' : 'CNBC US Source'  ,  \n\n\t\t\t\t\t'cag[brand]' : 'none'  ,  \n\n\t\t\t\t\t'cag[template]' : 'story_simple'  ,  \n\n\t\t\t\t\t'cag[device]' : 'web'  ,  \n\n\t\t\t\t\t'hline' : 'Business of Design'  ,  \n\n\t\t\t\t\t'type' : 'cnbcnewsstory'  ,  \n\n\t\t\t\t\t'template' : 'story_simple'  ,  \n\n\t\t\t\t\t'title' : 'Zero-waste stores pop up in the US, targeting shoppers tired of all the waste'  ,  \n\n\t\t\t\t\t'pubdate' : '1540054853'  ,  \n\n\t\t\t\t\t'stitle' : 'The first zero-waste supermarket in the US failed, but that isn&#039;t stopping no-package grocery stores'  ,  \n\n\t\t\t\t\t'subtype' : 'special_report'  ,  \n\n\t\t\t\t\t'id' : '105490817'  ,  \n\n\t\t\t\t\t'nid' : '105490817'  \n\n\t\t\n\t\t}, mpsopts = {\n\t\t  \n\t\t\"host\" : 'mps.cnbc.com',\n\t\t\"updatecorrelator\" : true\n\n\t\t};\n\n\t\tvar mps = mps || {};\n\t\tmps._ext = mps._ext || {};\n\t\tmps._adsheld = [];\n\t\tmps._queue = mps._queue || {};\n\t\tmps._queue.mpsloaded = mps._queue.mpsloaded || [];\n\t\tmps._queue.mpsinit = mps._queue.mpsinit || [];\n\t\tmps._queue.gptloaded = mps._queue.gptloaded || [];\n\t\tmps._queue.adload = mps._queue.adload || [];\n\t\tmps._queue.adclone = mps._queue.adclone || [];\n\t\tmps._queue.adview = mps._queue.adview || [];\n\t\tmps._queue.refreshads = mps._queue.refreshads || [];\n\t\tmps.__timer = Date.now ? Date.now() : (function() { return +new Date })();\n\t\tmps.__intcode = \"v2\";\n\t\tif (typeof mps.getAd != \"function\") mps.getAd = function(adunit) {\n\t\t    if (typeof adunit != \"string\") return false;\n\t\t    var slotid = \"mps-getad-\" + adunit.replace(/\\W/g, \"\");\n\t\t    if (!mps._ext || !mps._ext.loaded) {\n\t\t        mps._queue.gptloaded.push(function() {\n\t\t            typeof mps._gptfirst == \"function\" && mps._gptfirst(adunit, slotid);\n\t\t            mps.insertAd(\"#\" + slotid, adunit)\n\t\t        });\n\t\t        mps._adsheld.push(adunit)\n\t\t    }\n\t\t    return '<div id=\"' + slotid + '\" class=\"mps-wrapper\" data-mps-fill-slot=\"' + adunit + '\"></div>'\n\t\t};\n\t\t(function() {\n\t\t    head = document.head || document.getElementsByTagName(\"head\")[0], mpsload = document.createElement(\"script\");\n\t\t    mpsload.src = \"//\" + mpsopts.host + \"/fetch/ext/load-\" + mpscall.site + \".js?nowrite=2\";\n\t\t    mpsload.id = \"mps-load\";\n\t\t    head.insertBefore(mpsload, head.firstChild)\n\t\t})();\n\n\t\n\n\n\n\n  \n\n\nvar cnbcDY = {};\nif (mpscall.template.indexOf(\"story\") != -1 || mpscall.template.indexOf(\"slideshow\") != -1) {\n  cnbcDY.type = 'POST';\n  cnbcDY.data = mpscall.id;\n} else if (mpscall.template == \"home_page_ng\") {\n  cnbcDY.type = 'HOMEPAGE';\n  cnbcDY.data = '';\n} else if (mpscall.type == \"franchise\" && mpscall.template != \"video_gallery\") {\n  cnbcDY.type = 'CATEGORY';\n  cnbcDY.data = mpscall.cat.toLowerCase().split(\"|\");\n} else {\n  cnbcDY.type = '';\n  cnbcDY.data = '';\n}\n\n\n\nDY = {scsec : 8765304 ,API: function(){(DY.API.actions = DY.API.actions || []).push(arguments)}};\nDY.recommendationContext = {type: cnbcDY.type, data: cnbcDY.data};\n\n\n\n\n                (function() {\n                                var s = document.createElement('script'),\n                                t = document.getElementsByTagName('script')[0];\n                                s.async = false;\n                                s.src=('https:'==document.location.protocol?'http://st.dynamicyield.com'.replace('http:','https:') : 'http://st.dynamicyield.com' ) + '/ast?sec='+DY.scsec + '&head=true';\n                                t.parentNode.insertBefore(s, t);\n                })();\n\n\n\n\n\n\r\ndocument.addEventListener(\"DOMContentLoaded\", function(event) {\r\n  mps._queue.mpsloaded.push(function(){\r\n    mps._log('**** LOADED: cnbc-cms-header-insert');\r\n    if (window.mps) {\r\n        if (window.CNBC_Premium && CNBC_Premium.isPremium && document.cookie.indexOf('ispro=true') == -1 && (mps.pagevars.type!=\"franchise\")) {\r\n          mps.nlformtypes = mps.nlformtypes || [];\r\n          mps.nlformtypes.push('paywall');\r\n        }\r\n\r\n        //<!-- Omniture s_code path -->\r\n        mps.scodePath=\"//fm.cnbc.com/applications/cnbc.com/staticcontent/scripts/omniture/s_code.js?v=1.6.4.1\";\r\n        //<!-- end: Omniture s_code path -->\r\n\r\n        //<!-- Google PII Fix BEGIN -->\r\n        mps._queue.mpsinit.push(function() {\r\n          (function(){\r\n            mps._urlContainsEmail = function() {\r\n              var _qs = window.location.href;\r\n              if (!_qs) {\r\n                return false;\r\n              }\r\n              var _regex = /([^=&/<>()[].,;:s@\"]+(.[^=&/<>()[].,;:s@\"]+)*)@(([[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}])|(([a-zA-Z-0-9]+.)+[a-zA-Z]{2,}))/;\r\n              return _regex.test(_qs);\r\n            };\r\n            if (mps._urlContainsEmail()) {\r\n              mps._debug('[MPS]: email address detected in url, bypass gpt.');\r\n              if (mps.response && mps.response.dart && typeof(mps.response.dart.adunits) === 'object') {\r\n                if (typeof(window._mpspixZ) != 'string') {\r\n                  window._mpspixZ = (function(a){var b=\"abcdefghiklmnopqrstuvwxyz\".split(\"\");a||(a=Math.floor(Math.random()*b.length));for(var c=\"\",d=0;d<a;d++)c+=b[Math.floor(Math.random()*b.length)];return c})(12)\r\n                }\r\n                for (var i in mps.response.dart.adunits) {\r\n                  var pixelurl = ((document.location.protocol === 'https') ? 'https' : 'http') + '://pix.nbcuni.com/a-pii.gif?X=piiblock&S=' + mps.pagevars.instance + '&P=' + mps.pagevars.mpsid + '&A=' + i + '&U=' + encodeURIComponent(window.location.href) + '&_=' + window._mpspixZ;\r\n                  mps.response.dart.adunits[i].data = '<img id=\"div-gpt-x-0\" class=\"mps-slot\" data-mps-slot=\"x\" data-mps-loadset=\"0\" style=\"width:0;height:0;margin:0;padding:0;border:0;display:none;\" src=\"' + pixelurl + '\"/>';\r\n                }\r\n              }\r\n              mps.cloneAd = function() { return false; }\r\n              return true;\r\n            } else {\r\n              return false;\r\n            }\r\n          })();\r\n        });\r\n        //<!-- Google PII Fix END -->\r\n   }\r\n });\r\n});\r\n\n\n\r\n    var setAdblockerCookie = function(adblocker) {\r\n        var d = new Date();\r\n        d.setTime(d.getTime() + 60 * 60 * 24 * 30 * 1000);\r\n        document.cookie = \"__adblocker=\" + (adblocker ? \"true\" : \"false\") + \"; expires=\" + d.toUTCString() + \"; path=/\";\r\n    }\r\n    var script = document.createElement(\"script\");\r\n    script.setAttribute(\"async\", true);\r\n    script.setAttribute(\"src\", \"//www.npttech.com/advertising.js\");\r\n    script.setAttribute(\"onerror\", \"setAdblockerCookie(true);\");\r\n    script.setAttribute(\"onload\", \"setAdblockerCookie(false);\");\r\n    document.getElementsByTagName(\"head\")[0].appendChild(script);\r\n\n\n\n\r\n  if(typeof window.MediaSource !== 'function') {\r\n    if(typeof document.getElementsByTagName('meta')['tp:PreferredRuntimes'] === 'object') {\r\n        document.getElementsByTagName('meta')['tp:PreferredRuntimes'].setAttribute(\"content\", \"flash,html5\");\r\n    }\r\n}\r\n\n\n\n\n\n\nKeep Me Logged InWhile a trip to the grocery store may conjure up images of colorful produce, grab-and-go meals and must-have packaged snacks, another image less likely to come to mind is tons of waste.According to Refed, a nonprofit organization dedicated to fighting food waste in the United States, the retail food sector generates 8 million tons of food waste a year. Additionally, there is a great deal of packaging waste. Food is shipped in boxes. It sits on the grocery shelf often wrapped in plastic or cellophane. Consumers then carry the food home in plastic or paper bags.The Environmental Protection Agency estimates that containers and packaging make up 23 percent of landfill waste, and plastic pollution is literally strangling the life out of the ocean.Grocers are increasingly under pressure to reduce their waste footprint. Refed calculates the amount of food wasted by the retail sector represents $18.2 billion a year in lost value.\"In the past this was considered the cost of doing business when sales were easy,\" said Chris Cochran, executive director of ReFed. He said as competition increased in the sector — Amazon put the entire retail sector under tremendous margin pressure even before its purchase of Whole Foods Market — retailers started looking for ways to cut cost and create value.The backlash against packaging waste, specifically plastic, also is intensifying. The state of California banned plastic bags in 2016 and this past April, New York's Gov. Andrew Cuomo introduced a bill to ban plastic bags across New York State. Numerous cities and counties around the country have bans or fees on plastic bags. As a result, grocers are being forced to reevaluate packaging choices.Some market entrepreneurs see a solution in the biggest store change imaginable: designing waste out of grocery stores altogether by creating what are known as zero-waste grocery stores. Over the last decade, some retailers also started rethinking their waste footprint and designed stores that encourage customers to bring their own containers. The Refill Shoppe in Ventura California is one such store. The self-described \"eco-conscious\" shop sells bath, body and household liquids in bulk. In the food category some retailers, including The Filling Station In New York, have dedicated their entire store to selling just a few items in bulk. The Filling Station sells olive oil, vinegar, salt and beer that customers purchase using refillable containers.While this refill model, which emphasizes reducing packaging waste, has worked for specialty shops, larger grocery stores are trying to figure out how to successfully apply this model to a zero-waste design. At the grocery retail level, a commitment to zero waste means aggressively reducing food and/or packaging waste.The nation's first zero-waste grocery store, In.gredients, opened in 2012 in Austin, Texas. It was a small grocery store, just 1,400 square feet, with a big mission: no waste.\"The original idea was to be as package-free as possible while providing a grocery experience,\" explained Erica Howard Cormier, the store's former general manager. Most of the food was sold in bulk and housed in gravity bins. Items for purchase included dry goods like grains and nuts, locally sourced produce and liquids such as soap, soda, oil and vinegar. Customers used their own packaging for almost all of the products including eggs. Cormier said the store had a 70 percent package-free rate with a goal to increase the percentage every year.But the store's packaging goals came at a significant cost.\"We realized after 18 months we weren't changing shoppers habits,\" Cormier said. \"You have to plan a lot to go to the grocery store with your own containers and people would go to the store across the street because they forgot their container.\"Another reason customers shopped elsewhere was to buy must-have items which were not available at In.gredients, like a six-pack of beer, potato chips and turkey for Thanksgiving dinner. The store was losing business and decided to shift its focus. It dropped the package-free mission but maintained a commitment to zero waste by aggressively focusing on food. \"We did not send food waste to the landfill,\" Cormier said. But despite its best efforts, In.gredients closed in April as a result of low sales.In.gredients co-founder Christian Lane still believes in the business model and says it could work if taken to scale. \"Convenience stores aren't very big, but if you can get a number of those going and centralize buying, marketing, accounting and human resources and all those kinds of things, you can get economies of scale to make it work.\"Lane said In.gredients was close to making the model work — it was open for five years, supported local growers, and provided some vendors with their first retail exposure, which led them to subsequent success— but when the lease came up for renewal the founders decided to close the doors, given the low sales and lack of profitability. Lane is currently focused on another entrepreneurial endeavor — a technology consulting business that existed before the store.Zero-waste grocery stores have fared better around the world. Singapore opened its first store in April and several zero-waste stores have been open for several years across Europe, including in London, Berlin, Vienna and Barcelona. The success and spread of these stores has given American entrepreneurs hope that the concept can work stateside. A few think now is the perfect time to try.In Denver, Lyndsey Manderson co-founded the retail stop Zero Market. The store, which opened a year ago, sells mostly bulk home and body-care products, such as shampoo, body oils, detergent and household cleaners. \"Our goal is to only offer products that don't end up in a landfill. We want to make it easier for consumers to make more sustainable choices,\" said Manderson. She says customers have responded positively to the store, and by the end of the year, Manderson plans to open a second location that will be bigger and food-based.Meanwhile, budding food entrepreneur Sarah Metz is hoping to open up the first zero-waste grocery store in Brooklyn, New York. It will be called The Fillery and carry items including grains, spices and liquids, along with cooking and home-care tools.\"Customers will shop from bulk-style bins and dispensers and be able to buy the quantities they need,\" Metz said. She plans to adhere to strict packaging policies. Metz has two personal investors who gave her just over $100,000, and she raised an additional $17,000 on Kickstarter for The Fillery.But since the Kickstarter campaign in 2016, progress has been slow. Metz, an occupational therapist who works for the New York City Board of Education, does not have a business background. While she has been learning the entrepreneurial ropes for the last four years and competed in business-plan competitions, once winning $5,000, she lacks a concrete timeline for completing the mission outlined on Kickstarter back in 2016: opening a physical zero-waste grocery store in Brooklyn.She has found vendors, created a product list and spent the last two years trying to secure a retail location but still has not found one. Even if she does, she said it might require a small-business loan, which will be difficult to secure lacking a partner with existing business experience. Metz is set to launch The Fillery as an e-commerce store at the end of this month.Consumer guides exist online to highlight grocery stores where zero-waste shopping is possible, but the options tend to be stores that have large bulk-food sections rather than true zero-waste stores.The zero-waste concept is not confined to small independent shops.Last September, Kroger, the largest supermarket chain in the United States, with $122 billion in sales in 2017, announced a plan to eliminate all food waste in its stores and across the company by 2025. It spent the past year conducting a comprehensive waste analysis to help the company better understand and measure the problem and devise an action plan.\"Our priority is eliminating avoidable food loss within our operations,\" said Jessica Adelman, Kroger's group vice president of corporate affairs. The company is considering automating its in-store ordering systems across key departments to reduce over ordering of highly perishable items. \"As we get more technology in stores that allow ordering in real time, it will be a huge help for a company of our size,\" Adelman said.Kroger's food waste efforts are focused on high-impact areas like the produce, meat and seafood departments where most of the waste occurs. One food waste prevention step Kroger has taken since launching its initiative is to expand it imperfect produce program to all stores. This program dedicates space to sell discounted imperfect produce, more commonly known as ugly fruit and vegetables.Adelman said once Kroger gets a handle on reducing loss internally, the company will then turn its focus to the supply chain and take steps to influence suppliers and customers. To help achieve its goal, the company established a $10 million innovation fund to support food-waste solutions. Kroger's commitment also extends to packaging waste. In August, the company announced it was eliminating plastic bags from its stores by 2025.Zero-waste tactics may look different for small start-up grocers compared to large supermarket chains, however, the industry commitment to reducing waste is occurring at all levels. Zero-waste saves businesses money by reducing disposal, labor and energy costs. The concept is better for the environment because it avoids wasting water, oil and other natural resources used to grow and deliver food, and it helps keep oceans free of plastic pollution and reduces greenhouse gas emissions.\"Food waste has now emerged among the top priorities at the CFO level,\" ReFed's Cochran said.— By Rene Brinkley, special to CNBC.comWATCH: How takeout took over AmericaPlayingShare this video...Watch Next...Got a confidential news tip? We want to hear from you.Sign up for free newsletters and get more CNBC delivered to your inboxGet this delivered to your inbox, and more info about our products and services. Privacy Policy.© 2018 CNBC LLC. All Rights Reserved. A Division of NBCUniversalData is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis.Data also provided by "}