{"id": "Too Rich to Jail", "paragraph": "Supported byBy Maureen DowdOpinion ColumnistWASHINGTON — When I was in Reykjavik in August, Icelanders were bragging about putting the corrupt bankers who ravaged their economy in prison. In America, it works somewhat differently.We let the corrupt bankers who ravaged our economy roam free with bigger bonuses, more lavish Hamptons houses and fresh risky schemes. The big banks are bigger than ever and prosecution of white-collar crimes is at a 20-year low. And, cherry on the gilded cake, we put white-collar criminals in charge of the country — elevating epic grifters to the presidency and powerful cabinet posts.Reading all the recent stories about the 10th anniversary of the financial crisis, it’s easy to see the neon line leading from Barack Obama’s failure to punish Wall Street scammers to the fact that Republican scammers are now infecting the entire infrastructure of government.“The Tea Party and Occupy Wall Street rose up as opposite expressions of anti-establishment rage, nourished by the sense that colluding elites in government and business had got away with a crime,” George Packer wrote in The New Yorker. “The game was rigged — that became the consensus of the alienated.”President Obama and his Attorney General Eric Holder Jr. made a terrible mistake by letting the miscreant bankers off the hook rather than saying, as F.D.R. did, “I welcome their hatred.”Some saw it as the end of the Democratic Party. Democrats were the party of workers, charged with protecting people from big money, big banks and big fraud. Obama, the great hope to revitalize the left, immediately folded. Some analogized that the failure to send bankers to jail or even on perp walks made the party’s white blood cell count drop to the point that G.O.P. infections could run wild.In his 2016 book, “Listen, Liberal,” Thomas Frank wrote that “the hope drained out of the Obama movement” at the meeting between the fledgling president and Wall Street C.E.O.s in March 2009: “After warning them about ‘the pitchforks’ of an angry public, Obama reassured the frightened bankers that they could count on him to protect them; that he had no intention of restructuring their industry or changing the economic direction of the nation.” (After he left the White House, Obama followed Hillary’s lead, buckraking on Wall Street.)David Axelrod, the Obama counselor who fought during the crisis to “kick the offenders harder,” as he puts it, says he still feels “very conflicted.” “We feared that if you took a brick out of the wall then the whole damn wall might fall down,” he said. “But it wasn’t helpful, as far as Trump. To the extent that people felt the deal was rigged against them and in favor of the powerful, it gave him fodder.”Donald Trump scooped up “the forgotten,” promising to punish Wall Street for “getting away with murder,” and pledging to break up the big banks and force bankers to pay higher taxes.But it was just another Trump con. His administration, The Times reported, “has presided over a sharp decline in financial penalties against banks and big companies accused of malfeasance,” sparing corporate wrongdoers billions in fines.Asked about The Times’s scorching investigation last month on how “self-made” Trump received at least $413 million in today’s dollars from his father’s real estate empire, much of it through tax dodges, Kellyanne Conway shrugged it off, saying, “Haven’t they learned that the president always gets the last laugh?”Trump’s White House started off like a branch office of Goldman Sachs, as Elizabeth Warren noted. Gary Cohn, Trump’s former economic adviser from Goldman, showed that Wall Street’s arrogance shines bright when he recently told Reuters that borrowers were just as responsible for the 2008 crisis as lenders.“Who broke the law?” Cohn asked, adding: “Was the waitress in Las Vegas who had six houses leveraged at 100 percent with no income, was she reckless and stupid? Or was the banker reckless and stupid?”Binyamin Appelbaum, The Times’s economics wiz, riposted on Twitter: “A more accurate characterization of the housing bubble is that it was one of the largest orgies of white collar criminality in American history.”Speaking of orgies, Tim Leissner, the former Goldman Sachs banker whose guilty plea in the company’s $600 million international fraud case was unsealed this month, told the judge that his conspiracy was “very much in line” with the culture of Goldman Sachs “to conceal facts from certain compliance and legal employees of Goldman Sachs.”If you thought Trump’s flimflam about his namesake university was bad, if you cringe that Commerce and Interior are run by men accused of grifting, check out our acting attorney general. His very appointment could be illegal.Like his new boss, Matthew Whitaker has a pattern of thuggishness, threats, scams and abusing the power of his office to wage partisan feuds. Our new top cop was on the board of a shady patent company that has claimed Bigfoot exists and time travel could be coming. It also touted a “masculine toilet” to give well-endowed men “peace of mind” by ensuring that their genitals would not touch porcelain.Now, after trashing the idea of the Mueller investigation in 2017, Whitaker — flush with power — is the oddball sycophant charged with ensuring that Robert Mueller can finish his report.I’m sure we have nothing to worry about, though. As Sarah Huckabee Sanders noted Friday, “There must be decorum at the White House.”I invite you to follow me on Twitter (@MaureenDowd) and join me on Facebook.Follow The New York Times Opinion section on Facebook and Twitter (@NYTopinion), and sign up for the Opinion Today newsletter. Advertisement"}