{"id": "Doctors Should Tell Their Patients to Vote ", "paragraph": "Supported byThis may sound like a radical extension of our mandate. But sometimes civic engagement is the best medicine. By Danielle OfriDr. Ofri practices at Bellevue Hospital in New York.In the winter of 1847-48, a typhus epidemic raged through Upper Silesia. The Prussian king dispatched a young Dr. Rudolf Virchow to investigate the outbreak. Dr. Virchow would later achieve scientific sainthood for disposing of Hippocrates’ idea that humors caused disease, solidifying the idea that cells were the basis of biology and coining terms like leukemia, spina bifida, thrombosis and embolism. But in 1848, he was a 26-year-old lecturer in pathology at the Charité hospital in Berlin — a disposable junior faculty member who could be banished to the hinterlands.What Dr. Virchow found in Upper Silesia was a district ravaged by famine and economic depression. The germ theory of disease hadn’t yet been fully accepted, so Dr. Virchow couldn’t pinpoint a bacterium as the agent of the outbreak. He was, however, able to identify the conditions that promulgated the disease — poor sanitation, terrible working conditions, inadequate housing, meager education and unhealthy diet. In other words, all the concerns of modern public health.In his report, Dr. Virchow cited exploitation and lack of self-governance as the sources of those disease-promoting conditions. He excoriated the aristocrats who “expropriated great wealth from the Upper Silesian mines” but regarded the workers “not as human beings,” the government functionaries who served “the interests of the state” instead of the people, and the church that demonstrated “contemptible selfishness and lust for power.” “There cannot be any doubt,” Dr. Virchow concluded, that the epidemic was a result of “the poverty and underdevelopment of Upper Silesia.” The prescription, he stated, should be “free and unlimited democracy.”A prescription for democracy — not something you get at your average doctor’s visit — is increasingly on the minds of medical professionals these days.The goal of doctors and nurses is, of course, to improve the health of our patients. We treat the immediacies of illness — antibiotics for pneumonia, inhalers for asthma — but good health requires much more than medications. We have to think about lifestyle: what our patients eat and how much they exercise. But a healthy lifestyle requires adequate housing, so some health centers are now helping homeless patients find a place to live and asthmatic patients rid their homes of mold. And in a country like ours, without universal health care, helping our patients stay healthy means that we have to be concerned about whether they have health insurance.Suddenly, like Dr. Virchow, we are recognizing that our purview extends to the entire structure of our society and that politics is, as he put it, “nothing else but medicine on a large scale.” Political decisions that affect insurance coverage, access to medical care, housing, minimum wage, immigration law, water sources — just to name a few examples — exert medical effects that are comparable with those of major diseases. Just ask the people of Flint, Mich. Like many doctors and nurses, I became politically active for the first time during the summer of 2017, when Congress tried to repeal the Affordable Care Act. I could see the direct risk to my patients — all of whom, inconveniently, had pre-existing conditions — and realized that protecting health care coverage was as critical as prescribing insulin.Now, as our society feels increasingly fractured, the health threats seem even more alarming. Growing income inequality, disregard of environmental hazards and the undermining of social safety nets all stand to harm our patients’ health. Dr. Virchow’s words from 170 years ago about the creep of religion into state affairs, the outsize power of the wealthy and the autocratic impulses of government feel unsettlingly contemporary. So is it time for doctors to pull out our prescription pads and, like Dr. Virchow, start prescribing democracy?This may seem like a radical extension of the medical mandate, but the poorer and the sicker our patients are, the more likely they are to be disenfranchised. Those with the most to lose are least likely to have their voices heard.Of course no one should be advocating political viewpoints in the exam room — patients need a neutral, nonjudgmental atmosphere to feel secure. But civic engagement is nonpartisan.When patients say they can’t afford their medicine, fear being bankrupted by medical bills or struggle to find treatment for an addiction, we typically offer sympathy for these heartbreaking and seemingly intractable issues.But might it be our responsibility to point out that these problems are not just bad luck but also the result of political decisions? Instead of giving a kindly pat on the shoulder, perhaps we should inform our patients that they can call their elected officials to get answers. In addition to our medical counsel, perhaps we should also encourage them to vote.When patients are admitted to the hospital, they are asked about their tobacco use and their flu shots, their employment status and their religious affiliation. Why not ask if they are registered to vote? Just as hospitals and clinics help the uninsured obtain coverage, they should also help eligible voters register. Waiting rooms are filled with brochures — there’s no reason voter registration materials can’t be in the mix.In 2014, two clinics in the Bronx conducted a nonpartisan voter registration effort. Many of the volunteers were doctors, nurses or medical students, but the outreach took place outside the exam room. The efforts paid off; 90 percent of patients who were eligible to vote but had not yet registered did so. More than half of them were first-time voters.And we medical professionals must ourselves vote in all elections. We cannot sit them out — our votes directly affect our patients’ health. Groups like On Call for Democracy and Med Out the Vote offer resources and help identify candidates with strong health care platforms. Dr. Virchow wrote, “If you want to achieve anything, you have to be radical.” Many of our now-standard medical treatments seemed radical at the time (even handwashing). He also said, “You must start by inciting the population.” He returned to Berlin just in time for the March Revolution of 1848. He joined in and even helped construct street barricades.Doctors today don’t necessarily have to be stacking gurneys in the streets, but we do have to recognize that the health of the community is part of our medical mission. Civic engagement is integral to that. When our patients ask what they can do to improve their health, in addition to sunscreen, exercise and five servings of fruits and vegetables, we should advise voting.This is one prescription that doesn’t require prior authorization from the insurance company.Danielle Ofri is a physician at Bellevue Hospital and the author of “What Patients Say, What Doctors Hear.”Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.Advertisement"}