{"id": "As California Burns, Trump Threatens to Withhold Aid", "paragraph": "Supported bylettersReaders are stunned by the president’s tweet blaming the state for the wildfires. One says his “lack of humanity” is “profoundly disturbing.”To the Editor:Re “Ruthless California Wildfires Leave a Trail of Death and Despair” (news article, Nov. 11):President Trump tweeted this statement after innocent people died and thousands of structures were destroyed in the Camp Fire in Northern California:“There is no reason for these massive, deadly and costly forest fires in California except that forest management is so poor. Billions of dollars are given each year, with so many lives lost, all because of gross mismanagement of the forests. Remedy now, or no more Fed payments!”Mr. Trump, the fire started in the Plumas National Forest, and many of the state’s worst fires have been on federal lands. Who administers and runs the national forests in the United States? The Department of Agriculture, which as I recollect is a federal agency that you as president oversee and is run by a cabinet member you appointed. So on behalf of California and the victims of this terrible fire, alive and dead, I say, please, just shut up for once and send help to the communities devastated by this tragedy. I have a really good idea: How about sending some of the 5,600 American troops that you have sitting around our southern border right now, waiting to stop your mythical caravan of terrorists and murderers, to the town of Paradise in Northern California?Oh, never mind. I just remembered that would be what a real American president would do. Just keep tweeting.David HerzbergTrabuco Canyon, Calif.To the Editor:A reasonable not to mention sensitive man would express support and sympathy for California in the midst of its latest calamitous wildfires, and only after the danger had passed question its forest management. Not the man in the White House. His first reaction is to pile on to a state he sees as his enemy, rebuke its policies and threaten to withhold federal funding. President Trump’s inability to feel sympathy has clear clinical underpinnings but is nevertheless profoundly disturbing to a public still not completely inured to his lack of humanity.Tom GoodmanPhiladelphiaTo the Editor:The growing fire menace in California and several other states makes it obvious that more needs to be done to combat this menace. Lives, property and natural resources are at stake.I propose that we allocate a significant portion of our massive military budget to improving early detection of fires and building up resources to confront these fires once detected. And it should go without saying that much more needs to be done to confront global warming.Can we have a national discussion on this issue?David AtwoodHoustonAdvertisement"}