{"id": "Trump Wagers That Voters Will Shrug at a Saudi Storm", "paragraph": "Supported byNews AnalysisBy Mark LandlerWASHINGTON — His Democratic opponents do not believe it. His Republican allies don’t buy it. Even President Trump has ample reason, based on the intelligence reports he has seen, to doubt Saudi Arabia’s account of what happened to Jamal Khashoggi.But Mr. Trump’s ready acceptance of the Saudi explanation that Mr. Khashoggi was killed accidentally in a fistfight — rather than in an orchestrated hit ordered by the Saudi royal court — suggests how he plans to ride out the most acute foreign policy crisis of his presidency.With the midterm elections less than three weeks away and a political base more focused on jobs and the confirmation of Justice Brett M. Kavanaugh, Mr. Trump is betting he can stand by his Saudi allies and not suffer any significant damage with voters, allies and analysts said.“I think we’re getting close to solving a big problem,” Mr. Trump said Friday when he was asked about the Saudi confirmation of Mr. Khashoggi’s death and a shake-up of its intelligence services, to be carried out by Crown Prince Mohammed bin Salman.For Mr. Trump, it will be another test of his well-documented ability to brush off inconvenient facts — whether it was his unfounded allegations of pervasive voter fraud in the 2016 election or his dismissal of an investigation by The New York Times into the dubious tax schemes he used to enlarge the fortune he inherited from his father.In the Saudi case, there are still factors that could complicate his calculation that he can navigate through the furor over Mr. Khashoggi, a dissident Saudi journalist. Turkish officials claim to have audio and video of Mr. Khashoggi’s torture and killing in the Saudi Consulate in Istanbul — footage that, were it to surface, would make Mr. Trump’s acceptance of the Saudi account all but untenable.Mr. Trump appears to recognize that danger. He moved quickly to discredit reports that the Turks had shown the footage to one of his top aides during a visit there last week. “Secretary of State Mike Pompeo was never given or shown a Transcript or Video of the Saudi Consulate event,” Mr. Trump said in a Twitter post. “FAKE NEWS!”But absent such indisputable evidence, the circumstances of the killing could remain murky enough to allow the president to stick with the Saudis, especially Prince Mohammed, whom his son-in-law and senior adviser, Jared Kushner, has cultivated assiduously.Mr. Trump has cast the Khashoggi case as more a public relations problem than a human rights atrocity. “This has caught the imagination of the world, unfortunately,” Mr. Trump said in an interview with The Times on Thursday.What matters most to Mr. Trump politically, however, is whether Mr. Khashoggi’s death has caught the imagination of voters. Political analysts from both parties said that the answer was almost certainly no — and that even if they were following the news from Saudi Arabia, they were not likely to vote based on it.“People listen to a lot of things and they consider them important, but is it enough to offset the factors that drive their vote?” said David Winston, a Republican political analyst. “Probably not.”Mr. Winston pointed to the midterm elections in 2010. The fierce debate over President Barack Obama’s health care law commanded the headlines for months leading up to the ballot. But exit polls suggested that the economy drove voters more than health care.David Axelrod, a Democratic political analyst who advised Mr. Obama, said: “Trump’s calculation is, for the voters he’s trying to motivate, this is of little consequence. He’s placed a bet on the Saudis, and he’s not going to let their behavior interfere with that bet.”On Friday, hours after his favorable reception of the Saudi announcement, the president spoke at a “Make America Great Again” rally in Mesa, Ariz. He pounded the theme of immigration, even reviving the phrase “bad hombres” from the 2016 campaign. But he did not utter a single word about the killing of Mr. Khashoggi, even though the issue has consumed the White House in recent days.Mr. Trump does face a potential collision with Congress, where Democrats and Republicans alike dismissed the Saudi explanation, offered more than two weeks after Mr. Khashoggi’s death, as preposterous and demanded that Congress hold the kingdom to account.Representative Peter T. King, a New York Republican on the House Intelligence Committee, said in a telephone interview on Saturday, “Nothing adds up except that they murdered him.”Mr. King said the Saudi account raised several unanswered questions, like how Mr. Khashoggi, who was 59, would have ended up in a fistfight with a team of trained Saudi security personnel. “You really need 15 guys to get this guy?” he asked. “It’s not like he’s Mike Tyson.”On Saturday, 55 lawmakers announced that they were preparing a letter to the director of national intelligence, Dan Coats, asking to see American intercepts of communications in which Saudi officials discussed a plan to capture Mr. Khashoggi, who lived in Virginia and was a columnist for The Washington Post. They also asked Mr. Coats whether the United States had warned Mr. Khashoggi.“The Saudi explanation just doesn’t pass the smell test,” said Representative Mark Pocan, Democrat of Wisconsin, who helped organize the letter. “Our concern is we are still not getting the truth.”For the next few weeks, however, lawmakers will be scattered in their states and districts, putting off any action against Saudi Arabia until after the midterm elections. Mr. Trump broached the possibility of sanctions against Saudis, but he said he hoped that any punishment would not take the form of blocking billions of dollars in arms sales to Saudi Arabia.Privately, Mr. Trump has told colleagues that he shares the skepticism that Mr. Khashoggi could have been killed without any high-level Saudi involvement. In the interview on Thursday, he expressed confidence about the intelligence he was getting about the episode — intelligence that makes a strong, if circumstantial, case that Prince Mohammed played a role.“We’re working with the intelligence from numerous countries,” he said. “This is the best intelligence we could have.”The intelligence agencies presented their assessment of Mr. Khashoggi’s killing to Mr. Trump, as well as lawmakers, in recent days, laying out an account that is at odds with the Saudi narrative. The agencies have accepted at least elements of the Turkish claim that Mr. Khashoggi was tortured and killed, according to an American official.Senator Mark Warner of Virginia, the top Democrat on the Senate Intelligence Committee, has concluded, after being briefed on the American intelligence, that the Saudi account is not credible, according to his spokeswoman, Rachel Cohen.That echoes what Representative Adam B. Schiff of California, the senior Democrat on the House Intelligence Committee, said a day earlier.Mr. Trump’s ability to ignore difficult situations, however, is longstanding. And in his mind, according to long-serving advisers, he has learned that he is not penalized politically for them.Last week, for example, he was reminded that he had promised to donate $1 million to charity if Senator Elizabeth Warren, Democrat of Massachusetts, produced proof that she had Native American heritage. Ms. Warren released a DNA test showing a small amount of such ancestry.Mr. Trump responded by calling the DNA test “bogus” and returned to mocking her as “Pocahontas.”Allies of Mr. Trump said they expected most of his voters to view the furor over Mr. Khashoggi’s killing as a case of journalists taking care of one of their own.Even after acknowledging Thursday that Mr. Khashoggi was probably dead, Mr. Trump joked at a rally in Montana that evening about a Republican congressman, Greg Gianforte, who assaulted a reporter covering his campaign in May 2016.When he was asked the next day about the propriety of saying that in the context of Mr. Khashoggi’s disappearance, Mr. Trump replied, “That was a different league and a different world.”Eric Schmitt and Julian E. Barnes contributed reporting from Washington, and Maggie Haberman from New York.Advertisement"}