{"id": "Mary Keitany Earns 4th New York Marathon Title, 3 Minutes Ahead of Pack", "paragraph": "Supported byBy Lindsay CrouseMary Keitany was back where she prefers to be Sunday in the New York City Marathon — far, far ahead of everyone else. Keitany, an Olympian from Kenya, took off alone in the race’s second half and finished more than three minutes ahead of her challengers, with a time of 2 hours 22 minutes 48 seconds. It was her fourth victory here, and the second fastest race any woman has run on this course.It started out typically enough. For the first half of the race, Keitany, 36, tucked into a pack of about 24 women, including some of the top talent in this event. Keeping her stride loose, Keitany looked like just another jogger — albeit, a pretty fast one — as she made her way through the early stages.Once she reached Manhattan, though, there was a race to run.Soon out of view of her closest opponent, Keitany tore through the second half of the marathon in 1:06:58, a time few women in the field had achieved. It was about nine minutes faster than her first half, and she never wavered as she ground toward the finish.But by now, Keitany is used to running like this. After all, she has the second-fastest time of any woman in the marathon, behind only Paula Radcliffe.“Nothing was special today,” she said afterward. “I was just ready for the race.”[Lelisa Desisa won the men’s race in today’s New York City Marathon.]Her expression was casual, as though she could have headed back to Staten Island and do it all over again.Manuela Schär of Switzerland won the title in the women’s wheelchair division for the second straight year, with a time of 1:50:27.When Keitany is at the top of her game, she is notoriously difficult to touch. She is known for taking off early in the race and challenging her rivals to follow — which she did in 2014, 2015, and again in 2016. And then Sunday, as her pace dipped below five minutes per mile, none of those rivals had an answer.They included another woman from Kenya, Vivian Cheruiyot, 35, who took second place in 2:26:02.And then there was a chasing pack of American women, who collectively finished the best they had since 1978.The Americans were led by the defending champion Shalane Flanagan, 37, who took third in 2:26:22.Even though Flanagan did not retain her title, her satisfaction was just as high, and her time — with the ideal conditions of 46 degrees, calm and sunny — was better. Last year, as she closed in on the victory tape at New York, breaking Keitany’s winning streak, Flanagan was yelling expletives in a euphoria.This year, her finish was similarly emotional. But this time, she yelled to the crowds cheering her on, “I love you.”“I was just overcome with emotion, in that stretch, as everyone is,” Flanagan said. “It was like, yeah, I love this community, I love the running community and I love New Yorkers. I’ve had an unbelievable time performing here.”It may be Flanagan’s final professional race. She used her looming retirement as motivation to showcase the speed that helped her outkick Keitany last year and that has earned her a silver medal in the 10,000 meters in the 2008 Olympics.As any hope of catching Keitany and repeating her victory from last year dissipated Sunday, Flanagan closed in on Rahma Tusa of Ethiopia, who was fading in the final miles, and sprinted away to secure a podium finish.“As I was racing and kind of feeling sorry for myself, you have to find motivation, things to rally and to focus on,” Flanagan said. “When I got dropped by Mary and a bunch of other women, I kept thinking, ‘Keep fighting.’ You never know what’s going to happen in front of you, and just put your head down, keep working and fight for that podium spot.”Flanagan’s performance rounded out a collection of medals from her appearances in the New York Marathon, adding a bronze to last year’s gold and a silver in 2010.It was a breakout day for American distance runners overall. Four of them finished in the top seven; in comparison, the top American to finish in the men’s race was Jared Ward, in sixth place. The American record-holder in the half marathon, Molly Huddle, finished behind Flanagan in fourth. The defending Boston Marathon champion, Desiree Linden, finished sixth. And Allie Kieffer, who as a self-coached unknown last year finished fifth place, took seventh today behind Linden.“Americans right now are a great group of runners,” Linden said.She added: “We’re continually pushing the bar for each other. Now you can win a major one year and not even be the top American at the next race, which is insane.”Advertisement"}