{"id": "A ‘Time Capsule’ for Scientists, Courtesy of Peter the Great ", "paragraph": "A Russian zoological museum filled with centuries-old specimens finds renewed relevance in the age of genetics.A pair of Amur tigers, a gift from a German merchant to Czar Alexander II, on display at the Zoological Museum in St. Petersburg.CreditCreditPhotographs by James Hill for The New York TimesSupported byPhotographs and Text by James HillST. PETERSBURG, Russia — Standing alone, a few minutes before the doors were to open at the Zoological Museum of the Zoological Institute of the Russian Academy of Sciences, Alexei Tikhonov gazed at Masha, a 30,000-year-old baby mammoth that he brought here from a Siberian riverbank thirty years ago.Masha, one of the museum’s star attractions, rests with hundreds of other encased exhibits in one of the largest public collections of zoological specimens in the world. The cabinets, conceived in Frankfurt at the end of the 19th century, and the Czarist hunting trophies here exude an old-fashioned, even romantic air. But Dr. Tikhonov, director of the museum, is not too concerned.Sometimes he yearns for plasma panels and the modern gadgetry that many other museums use to inform visitors. But he has limited funds to modernize the museum, and prefers to spend that money buying new collections and supporting scientific fieldwork.This collection, first formed from acquisitions made by Peter the Great three centuries ago, is nonetheless taking on a new, more vital role. As the animal world becomes increasingly threatened, these exhibits are helping to unlock genetic information and precious clues to aid species survival.The museum, like other great natural history museums, is “a time capsule for organisms,” said Ross MacPhee, curator of mammals at the American Museum of Natural History in New York.“For certain kinds of studies, such as species endangerment and the loss of genetic diversity, this is turning out to be increasingly important,” he added. “Natural history museums are literally the only places where you will find good quality remains.”[Like the Science Times page on Facebook. | Sign up for the Science Times newsletter.]Down the hall from Masha, in a cabinet holding birds of prey, are two California condors. Probably the oldest specimens in the world, they were brought to St. Petersburg by a collector in 1851 from Fort Ross, originally a Russian outpost in California.When researchers at Penn State began searching for genetic information on the scarce population of California condors in the United States — currently there are less than 500 birds — the university reached out to St. Petersburg for help. A few months later, a feather from each bird was dispatched to university scientists for study.Genetic material is increasingly stored by zoological museums and institutions in frozen samples. But the information to be gathered from dry specimens is also useful, said Mikhail Kalyakin, an ornithologist and the director of the Zoological Museum at Lomonosov State University in Moscow. To ascertain the fate of the slender billed curlew, for example, ornithologists analyzed DNA clues found in the skin and intestines of museum specimens to pinpoint the species’ traditional habitats, helping to guide the search for remaining birds.“As species come under threat,” Dr. Tikhonov said, “we hope that in the future, due to these genetic efforts and new methods, it will be possible to restore these species.”But restoring the woolly mammoth, an oft-cited possibility, is another proposition altogether. The notion is that the mammoth genome could be recovered, at least in part, and introduced somehow into an elephant embryo. But the science behind such a “de-extinction” would be bogglingly complex. Dr. Tikhonov, one of the world’s leading experts on mammoths, is quick to point out the complications.“We cannot, for the moment, reconstruct a mammoth without making hundreds or thousands of mistakes,” he said.For one thing, ancient DNA is heavily fragmented, noted Dr. Daniel C. Fisher, director of the University of Michigan’s Museum of Paleontology. “For these and other reasons, the whole notion of simply recovering ancient DNA and plugging it into living cells to generate zygotes is profoundly impractical,” he said.The creation of hybrid mammoths is not only a technical issue. Where would these giant mammals live in a modern world, save perhaps the Siberian tundra? How would they affect existing ecosystems?For the moment, this debate remains hypothetical, but few doubt that the technology to create hybrid mammoths will be realized at some point. “It is a case of human ingenuity outskating ethical concerns,” said Dr. MacPhee.Back in the halls of the museum, Dr. Tikhonov soon found himself happily swamped by schoolchildren. “The first role of the museum is educational,” he shouted over the heads of the crowd.The Zoological Museum has 300,000 visitors per year, and he was expecting as many as 7,000 visitors that day. By early afternoon, the guides were already exhausted, but one of them, Polina Kenunnen, managed a smile when asked to take yet another group of young children for a tour.“On the internet, there is often silliness,” she said while marching up the stairs toward the skeleton of a blue whale and the bust of Charles Darwin. “But here we can really show and tell things as they are.”Advertisement"}