{"id": "Champions League: Barcelona Tops Inter Milan Without Messi", "paragraph": "Supported byRoundupBy The Associated PressRafinha filled in for the injured Lionel Messi by scoring the opening goal to lead Barcelona to a 2-0 victory over visiting Inter Milan in the Champions League on Wednesday.Chosen by Manager Ernesto Valverde to take Messi’s place in the starting lineup, Rafinha recovered the ball to start an attack in the 32nd minute, then finished it off by scoring from a pass by Luis Suarez.Jordi Alba provided a second goal with seven minutes remaining.Messi cheered the goals from the stands at Camp Nou, his right arm in a sling after fracturing it in a win over Sevilla last weekend.“We all had to step up given that everyone, my players, our fans, our adversaries, we all had Messi’s absence on our minds,” Valverde said. “We always play as a team, and we have a recognizable playing style, but Messi gives us that touch of brilliance. We hope he recovers quickly. I think everyone at the stadium missed him.”Indeed, before kickoff Barcelona fans chanted “Messi! Messi!” when images of the club’s all-time leading scorer appeared on stadium screens.Barcelona controls Group B with nine points after its third win in as many matches. It was the first loss for Inter, which was left with six points.PARIS SAINT-GERMAIN 2, NAPOLI 2 Angel Di Maria rescued Paris Saint-Germain with a superb equalizer in stoppage time to salvage a draw with visiting Napoli.Di Maria curled the ball past goalkeeper David Ospina into the top left corner to spare P.S.G. a second loss in Group C.Despite the 93rd-minute equalizer, the P.S.G. star Neymar seemed frustrated with the result, marching straight off the field without shaking anybody’s hands and kicking a plastic object.Forward Lorenzo Insigne put Napoli ahead in the 29th minute with a cool finish, and P.S.G. tied it in the 61st when Napoli defender Mario Rui scored an own goal.The Belgian forward Dries Mertens scored from close range in the 77th after a sloppy mistake from P.S.G.’s Marquinhos, who failed to deal with a looping ball into the penalty area.LIVERPOOL 4, RED STAR BELGRADE 0 Mohamed Salah scored in each half to lead Liverpool past Red Star Belgrade, giving the Egyptian winger 50 goals in just 65 appearances for the English club.Roberto Firmino and Sadio Mane also netted at Anfield, as the attacking trio that fueled Liverpool’s march to the Champions League final last season combined to hand Red Star another heavy loss, after its 6-1 thrashing at Paris Saint-Germain in their last match in the competition.Xherdan Shaqiri played a key role in the win — helping to set up two of the goals — on a night he was whistled and booed whenever he received the ball. The jeers came from a few sections of the crowd and were presumably from Red Star fans who, officially at least, were supposed to be banned from attending the game as a punishment for causing trouble during the Serbian team’s playoff at Salzburg in August.Shaqiri was born in Kosovo, the former Serbian province that declared independence in 2008, but plays for Switzerland’s national team. Serbia does not recognize Kosovo’s independence, and relations between the two countries remain tense.IN OTHER GAMES Thierry Henry’s first Champions League match as Monaco manager ended in a 1-1 draw with host Club Brugge … Luuk de Jong scored an 87th-minute equalizer for PSV Eindhoven in a 2-2 draw with visiting Tottenham … Borussia Dortmund thrashed visiting Atlético Madrid, 4-0 … Porto defeated Lokomotiv Moscow, 3-1 … Schalke was held to a scoreless draw by host Galatasaray.Advertisement"}