{"id": "Defense Contractor Accused of Slighting Reservists in Hiring", "paragraph": "Supported byBy Noam ScheiberIn October 2014, Nathan Kay applied for a job as a pilot at L3 Technologies, a Pentagon contractor that helps conduct surveillance and reconnaissance missions around the world.Mr. Kay had spent more than 10 years in the Washington Air National Guard, and had flown similar missions in Iraq and Afghanistan. A friend at L3, then known as L-3 Communications, indicated that a chief pilot was interested in his résumé. But when months went by without even a rejection — and after consulting with his friend — Mr. Kay concluded that L3 was discriminating against him because he was an active guard member.On Tuesday, he got a measure of vindication: A motion to settle a class-action lawsuit he brought against the company was filed in a federal court in Washington State. As part of the proposed deal, the company has agreed to pay a total of $1.35 million to Mr. Kay and up to about 250 qualified reservists who have applied for jobs since 2011 but weren’t hired.L3, which had more than $6 billion in sales to the Defense Department last year, denied liability and any allegations of discrimination. But it agreed to several changes, including no longer asking about military status before extending job offers, training workers on the employment rights of reservists and making it easier for employees to schedule work around their military obligations.“There are so many cases out there that don’t get looked at — the reservists shrug their shoulders, move on, take the hit, don’t talk about it,” Mr. Kay said. “To me, this means military members are going to be treated better going forward.”In a statement, the company said: “We are pleased that we have reached a settlement in this matter. L3 is a proud employer to more than 7,700 veterans of the U.S. military.”The settlement still requires court approval.Kathryn Piscitelli, an employment lawyer, said the settlement was the first she had encountered in a class-action case that challenged hiring practices for reservists under the Uniformed Services Employment and Re-employment Rights Act.Ms. Piscitelli, who is a co-author of a manual on the law but was not involved in litigating the case, said it could be very difficult to prove hiring discrimination because applicants receive little indication of why they weren’t offered a job. To that end, she highlighted the importance of the statistical evidence the plaintiffs collected, which showed that reservists had been hired at a lower rate than veterans with no ongoing military obligations, though at a higher rate than civilians with no military experience, since 2011.Over all, the plaintiffs estimated that during the period they examined, L3 made offers to about 1,000 pilots for the job Mr. Kay sought, but that only about 100 were reservists, out of several hundred who applied.“To me the statistics are very, very convincing,” Ms. Piscitelli said.According to the proposed settlement, L3 disagreed with the plaintiffs’ analysis on methodological grounds, such as which applicants should have been classified as reservists, and said the gap in hiring was attributable to other factors, like disparities in experience.The case shines a light on two related trends that followed the terrorist attacks on Sept. 11, 2001. The first is the military’s increased reliance on reservists to meet the rising demand for personnel. The second is discrimination against those workers by employers either unaware of or unmoved by the law’s requirements.“In the wake of 9/11, employers have experienced disruptions due to the amazing rate of call-ups of people — their employees,” Ms. Piscitelli said. Many employers dislike the law at issue, she said, and “there is widespread discrimination.”Although the military has relied on contractors for decades, its needs since 2001 have also made it far more reliant on personnel provided by companies like L3, said Nora Bensahel, a visiting professor at the Johns Hopkins School of Advanced International Studies.“Once you’re fighting two wars, the volume of work goes up,” Ms. Bensahel said. “There is more pressure to have as many of the people in uniform as possible doing combat-related things, and contract out all of the other things.”But even though this shift has benefited their bottom lines, contractors are often no less likely to discriminate against reservists than employers in other industries, said one of Mr. Kay’s lawyers, Matthew Crotty. In certain respects, he said, they may be even more hostile to these workers.Mr. Crotty has litigated several cases against defense companies in recent years, including one involving a certified medical assistant who worked for a contractor at a Navy medical facility. The assistant asserted that she had been fired for taking too much leave to fulfill her Navy Reserve obligations. That case was settled in 2017.Mr. Crotty, who was an intelligence officer in the Army’s Ranger Regiment and then served in the Washington Army National Guard, said contractors frequently hire former active military personnel in senior positions, and these veterans often harbor a bias against reservists.“To put it in the high school sports analogy of varsity and junior varsity, there is the same stereotype,” Mr. Crotty said. “The thought process on the active-duty side is, ‘We go all the way and do it.’”Another factor, Mr. Crotty said, is that defense contactors active in war zones typically have to navigate complicated logistical and scheduling considerations to move employees in and out of the theaters where they operate.“They have someone come over from the U.S., get on a plane, land in Iraq, Afghanistan, wherever, and a contractor wants them there for a certain amount of months,” he said. When the military subsequently calls up that reservist, “that messes up the rotation.”Mr. Kay’s lawyers presented evidence that L3 hiring officials frequently made a point of inquiring about and noting a pilot’s military status — such as “reserves” or “retired” — early in the hiring process, and that reservists were often sifted out at this stage rather than after interviews.The plaintiffs also presented statements by company officials suggesting they harbored bias against reservists.Some of those statements concerned J. Mitch Hall, an Air Force veteran whom L3 hired as a pilot in 2013.When applying, Mr. Hall did not clarify whether he planned to continue his active status in the Air National Guard. But when he attended orientation with L3 and told the chief scheduler for his program that he would periodically need time off to fulfill his guard commitment, she remarked about it angrily, according to Mr. Kay’s complaint. (Mr. Hall’s case was included in the broader complaint but will be resolved separately.)In January 2015, the company turned down his request to return to work soon after a National Guard deployment.“Mitch went on military orders when we needed him around for the holidays,” a lead pilot for Mr. Hall’s program told a colleague, according to the complaint. “Just because Mitch gets off orders doesn’t mean he can come back to work here just because he wants to.”In fact, Mr. Hall was entitled to do precisely that. The regulations enacted under the law require employers to put service members who have been away on a deployment back to work “as soon as practicable under the circumstances,” which the rules define as generally within two weeks of receiving a request to do so.L3 denied Mr. Hall’s specific allegations in its response to the lawsuit, and a spokeswoman said she was unable to comment on pending litigation.Follow Noam Scheiber on Twitter: @noamscheiberAdvertisement"}