{"id": "Democrats, Don’t Procrastinate on America’s Health", "paragraph": "Supported byIf lawmakers hope to build on the Affordable Care Act and fix its flaws, they have to get to work now.By Harold PollackProfessor Pollack is an expert on public health and social services.In nearly 800 days, a Democratic president and Congress may take office.This is not as far away as it sounds. If Democrats want the chance to pass health reforms that will build on the Affordable Care Act and fix its defects, they need to start planning now.The Democrats’ House victories in the midterms are an important step in that direction. Medicaid will expand in Idaho, Nebraska and Utah, thanks to ballot initiatives, and could expand in Kansas, Maine and Wisconsin, thanks to those states’ new Democratic governors-elect. Although Republicans picked up Senate seats, the 2020 and 2022 Senate maps still allow the possibility of a workable Democratic majority. Democrats must be ready. The process of writing the A.C.A. began years before it passed. Democratic legislators, activists and policy experts should be talking right now about how to build on it.We already know a few things about what workable and worthy legislation will look like. First, it will be a straight Democratic bill. As Republicans did in 2017 on health care and taxes, Democrats will proceed unilaterally. Unlike Republicans, Democrats should put in the hard work to create a smart bill they actually intend to pass, one that commands broad public support.Many Americans would prefer greater bipartisanship. So would I. But Democrats tried that, and look what happened. The A.C.A. was a good-faith effort to create a fiscally disciplined, ideologically moderate, market-based path to near-universal coverage. Max Baucus and other Democratic senators spent months fruitlessly negotiating with Republicans, who, it is obvious in retrospect, were cynically stalling. Republicans’ scorched-earth opposition to President Barack Obama and health care reform — not to mention the Trump presidency — have weakened the possibility that Democrats will do the same next time around.The bill should go beyond simply fixing the A.C.A., though much certainly needs fixing. The insurance marketplaces are a godsend for 12 million people, particularly those with low incomes or chronic illnesses. Yet in many ways, the marketplaces proved disappointing. Middle-class families face high premiums and punishing out-of-pocket costs. It wouldn’t be hard to change this. Similar structures work well in Western Europe. The Urban Institute’s Linda Blumberg and John Holahan have proposed an excellent and economical set of improvements, including providing more generous subsidies to middle-class families and to people with high out-of-pocket costs. If our political system worked properly, such fixes would already have been made. But Republicans in Washington see greater advantage in undermining and disparaging the marketplaces than in bolstering them.Millions of Americans — many of whom don’t consider themselves particularly liberal — want more radical change. Republicans’ efforts to bring down the A.C.A. ended up solidifying the public consensus behind it, behind Medicaid and behind the idea that every American deserves affordable, effective health coverage. Among Republican voters, large majorities favor greater federal health care spending. As we saw in the midterms, Medicaid expansion is popular even in deep Trump country.One thing we won’t see: a leap to a single-payer system. Many Democrats have embraced Medicare for All. I’m sympathetic to that. A single-payer health system would be more functional, more economical and fairer than what we have. America may someday have a single-payer system, but we won’t get there in a single bill that phases out private health insurance, rewires our byzantine health care delivery and finance systems and markedly cuts payments to hospitals and other providers. Although a single-payer system would reduce overall health spending, it would require major tax increases as we moved private expenditures onto the federal tab. There is zero chance that any Congress taking office in 2021 would do all that — let alone that Democrats could do all that alone within the parliamentary confines of what would probably be a razor-thin party-line vote in the budget reconciliation process.So what can Democrats do, when tweaking the Affordable Care Act is insufficient, and when leaping to Medicare for All is unrealistic?Here’s one strong approach: Medicare Available to All. Three Senate bills introduced by Democrats would allow people to buy into Medicare or Medicaid, while maintaining a private insurance market. Millions of Americans want these public options, because they are fed up with private insurance. This is especially true in rural areas, and in uncompetitive markets with exorbitant marketplace plans.Private experts propose other worthy plans. Paul Starr’s “Midlife Medicare” would expand the program to otherwise-uninsured Americans over age 50. Jacob Hacker’s “Medicare Part E” would be available to everyone, including within the menu of employer-sponsored coverage.The Center for American Progress’s “Medicare Extra for All” provides another ambitious model, which would improve public and private coverage without requiring huge new federal tax revenues or smashing the private insurance system. Medicare Extra would be free to those with incomes below 150 percent of the federal poverty line. That’s about $31,000 for a family of three. In one stroke, this would insure millions of Americans who were shut out when their state rejected Medicaid expansion. Premiums and patient cost-sharing would gradually rise with income, but would be capped at an affordable level for everyone.Employers could provide Medicare Extra for their workers alongside their private offerings. Compared with single-payer, these plans appear reasonable and realistic. By providing competition and better options for near-retirees and those with costly conditions, such an approach could also improve private marketplace coverage. It would include valuable disability components, too.Whatever Democrats decide to do, they should start now, anticipating everything from the Congressional Budget Office’s deficit projections to the Senate parliamentarian’s reconciliation rules. Anyone who doubts the difficulty of this work might ponder Republicans’ rushed A.C.A. repeal effort, whose design was so shoddy that it alienated every patient and provider constituency around.Much of the work that produced Obamacare was done well before President Obama took office. Between 2006 and 2009, groups like the Service Employees International Union and grass-roots activists began laying the groundwork for the A.C.A.’s passage. Activists, legislators, congressional staff members and constituency groups quietly met in forums such as Ted Kennedy’s “workhorse group” to make difficult political and policy decisions. Had a different Democrat been elected president, EdwardsCare or ClintonCare would have strongly resembled the A.C.A.The next round will be different. Given all that’s happened, Democrats have an angrier, more partisan edge than they did then. The Democratic Party is also more unambiguously progressive. Ten years ago, conservative Democrats insisted on protracted negotiations and opposed the public option. For better and worse, these bridge figures are almost all gone. Progressive voters will be demanding a single-payer bill, and will be disappointed when they don’t get it. They are entitled to a feasible alternative they can genuinely be proud of.Democrats must combine an ambitious progressive vision with sound policy and political realism. Their first opportunity, January 2021, is little more than two years away. There’s no time to waste.Harold Pollack is a professor of social service administration and public health science at the University of Chicago.Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.Advertisement"}