{"id": "Trump’s New Pledge to Cut Taxes May Follow a Familiar Path", "paragraph": "Supported byThe president says he will cut middle-class taxes. It won’t be easy, and he will need Republicans to keep control of Congress to even give it a try.By Jim TankersleyTen months before President Trump began making promises of a 10 percent tax cut for the middle class, he signed a sweeping bill that included a 10 percent tax cut for the middle class. That cut was included in a $1.5 trillion package that immediately became Mr. Trump’s signature piece of legislation on economic policy. But middle-class Americans say they have not felt much of an effect, in part because three-quarters of the tax cuts went to corporations and high-income earners. As a result, middle-class Americans have not rallied around the Trump tax cuts in the way the president and congressional Republicans had hoped. So Mr. Trump found another way to get the tax cuts back in the news before the midterm elections in November by pledging to deliver another round very soon.Mr. Trump began talking about this next tax cut last weekend, telling supporters that he was preparing another middle-class cut, on top of the ones already in place, and that Congress would pass it imminently. Congress will do no such thing; it is not in session until after the elections, and no one on Capitol Hill expects a tax cut of any kind to pass in the lame-duck session at the end of the year. Instead, the White House and congressional Republicans are scrambling — after Mr. Trump’s apparently off-the-cuff declarations — to lay the tracks for another tax cut if Republicans hold onto control of both the House and the Senate in November.In that case, a senior administration said, the tentative plan would be for another round of tax cuts, following a process similar to the one Mr. Trump used to get the tax overhaul that he signed into law in December. The pattern would most likely involve Mr. Trump outlining broad goals for the cuts — for example, a 10 percent tax reduction for households earning less than $75,000 a year, offset by other tax increases or spending cuts, in order to avoid adding to the federal budget deficit. He would leave it to congressional leaders to work out the details but, like the last round, would not shy away from publicly telling lawmakers what he expected to see in the final bill.$10,000 = $28$20,000 = $37$30,000 = $94$40,000 = $243$50,000 = $425$75,000 = $709Source: Tax Policy CenterThe president has suggested a more aggressive and certain timetable in public. He has promised that the cuts would be “put in place” in the next week. He told interviewers from The Wall Street Journal on Tuesday that “we can make it revenue neutral,” meaning that the lost revenues from the tax cut would be offset by either spending cuts or tax increases. He has said repeatedly that the cut would be for the middle class only.It has been an unorthodox chain of events, particularly since Mr. Trump could be spending his time promoting the middle-class benefits of the law he signed last year. The law signed in December will provide a roughly 10 percent cut in tax liability, on average, in 2019 for households earning $30,000 to $75,000 a year, according to the congressional Joint Committee on Taxation. (Median household income was just over $61,000 last year, according to the Census Bureau.) The independent Tax Policy Center in Washington estimates that households in the middle quintile of taxpayers will see, on average, a $930 tax cut from the law this year. The cut for higher earners is larger as a share of income, and overwhelmingly larger in dollar terms: Households earning $100,000 or more will combine to see $219 billion in tax cuts next year, the joint committee estimates, compared with about $40 billion for those earning $75,000 or less.But with the tax cut consistently failing to attract support from a majority of Americans, Mr. Trump has taken to talking about new cuts, which could mean, eventually, that congressional Republicans will try to turn them into a bill. “This administration, the president has an idea, he gives voice to it,” said Rohit Kumar, a former adviser to Senator Mitch McConnell of Kentucky, the majority leader, who now leads the Tax Policy Services group for PwC. Often, he said, the result is, “If it sells, eh, we’ll pursue it.”That pursuit could be particularly tricky next year. For one, Republicans have to hold the House and the Senate. Next, they would need to write a bill that specifically targets the middle class without adding to the deficit. It’s not as simple as cutting tax rates at the bottom of the progressive income tax scale — those rate cuts would help higher earners as well because income is taxed at varying rates. If Mr. Trump is set on rate cuts, Tax Policy Center researchers noted, those writing the bill could neutralize their benefits for high earners by inserting what is called a “bubble” rate higher on the income scale, which is intended for just that purpose. Republicans could also expand the earned-income tax credit, or invent a new credit just for the middle class, Mr. Kumar said.Democrats might prefer to go further — if they were, hypothetically, writing a bill to Mr. Trump’s specifications — by extending the benefits of the cuts to households that currently have no federal income tax liability. “I’d definitely go with a significant expansion of refundable tax credits,” said Jared Bernstein, a former adviser to President Barack Obama and now an economist at the Center on Budget and Policy Priorities. “That’s the best, most direct way to reach the large number of working households who were essentially left out of last year’s tax cuts.”As for the offsets, they are even harder. Data from the Tax Policy Center suggests that a true 10 percent cut in tax liability for households earning $75,000 or less would reduce revenues by more than $300 billion over the course of a decade. A broader definition of “middle class” would escalate the cost considerably. Republicans could offset some — but not all — of the $300 billion cut by completely eliminating the state and local tax deduction, or SALT, which last year’s cuts capped at $10,000 per household. They could raise taxes on high earners. They could reduce spending on programs such as Medicaid. None would be a breeze to get through Congress. “I don’t know what the easy offsets are,” Mr. Kumar said. “There was never anything easy to make anything like a 10 percent middle-class tax cut revenue neutral.”Jim Tankersley covers economic and tax policy. Over more than a decade covering politics and economics in Washington, he has written extensively about the stagnation of the American middle class and the decline of economic opportunity.  @jimtankersley Advertisement"}