{"id": "One Killing, Two Accounts: What We Know About Jamal Khashoggi’s Death", "paragraph": "Supported byBy Ben HubbardBEIRUT, Lebanon — Eighteen days after the dissident Saudi journalist Jamal Khashoggi was killed inside the Saudi Consulate in Istanbul, his government has finally laid out its narrative of what happened.President Trump appears to be giving the Saudis the benefit of the doubt, but many others, including friends of Mr. Khashoggi’s and Turkish and American officials, aren’t buying it. What happened to Mr. Khashoggi on Oct. 2 remains open for debate in part because of how details have become public. Turkey’s leaders have largely refrained from publicly accusing the Saudis, but the country’s security officials have leaked a stream of details that reflect a grisly murder. In their telling, doled out in anonymous statements to the news media, Mr. Khashoggi was killed and dismembered inside the consulate by a 15-man team sent from Riyadh for that very purpose.Saudi Arabia’s new account suggests that those men sought to bring Mr. Khashoggi back to his home country, but that when he resisted, a fight broke out and he was put in a deadly chokehold. Many of the details in the Saudi story were also provided anonymously.So how do the competing narratives stack up? Here are some of the questions the story lines raise.Nobody seems to know.The Turks have said that Mr. Khashoggi’s body was cut up by an autopsy specialist with a bone saw before being carried out of the consulate in large suitcases and disposed of in an unknown location, perhaps a forest.A Saudi official, however, said the team handed over Mr. Khashoggi’s body to a local “collaborator” to dispose. The official, who spoke on condition of anonymity, did not disclose the person’s nationality, a detail the team could seemingly provide easily. Some have speculated that the introduction of this unknown person could allow the Saudis to duck responsibility for the state of Mr. Khashoggi’s corpse if and when it is found. The Saudis could argue they weren’t involved. Turkish officials said Saturday that they expected to find the body soon.Little concrete evidence has been made public by either side, although the Turks have provided much more detail to back up their narrative than the Saudis have.The Turkish information included names of the members of the Saudi team and photos of them at the airport, in their hotels and near the consulate. Many of the men have ties to the Saudi military and security services. The New York Times was able to corroborate the identities of most of the men on the team and to establish that at least four had frequently traveled abroad with the country’s de facto ruler, Crown Prince Mohammed bin Salman, as part of his security detail.They included Gen. Maher Abdulaziz Mutreb, an intelligence officer who had been photographed near the crown prince during visits to Paris, Madrid, Houston, Boston and the United Nations.Another suspect, Salah al-Tubaigy, is a renowned Saudi autopsy specialist with ties to the security forces.The Saudi official confirmed that both were part of the 15-man team, but said that Dr. Tubaigy was tapped not for his expertise in dealing with dead bodies, but rather for his experience in forensics and his skill in removing evidence from crime scenes. The Saudi official said the Turks had mostly succeeded in identifying the members of the team, although there had been some mistakes that he attributed to name spellings. He did not provide the identities of the rest of the team.In the 18 days after Mr. Khashoggi went missing, Saudi officials repeatedly denied any knowledge of his whereabouts and said that he had left the consulate. A summary of the timeline: Oct. 5: Crown Prince Mohammed told journalists from Bloomberg that Mr. Khashoggi had left the consulate after “a few minutes or one hour.”Oct. 6: The Saudi consul walked reporters from Reuters around the consulate, letting them peek in cupboards, air conditioning units and toilets to show that Mr. Khashoggi was not there. “We are worried about this case,” the consul said.Oct. 9: The Saudi ambassador to the United States, Khalid bin Salman, wrote that reports of Mr. Khashoggi being detained or killed were “absolutely false, and baseless.”It was not until Saturday — 18 days after Mr. Khashoggi went missing — that the Saudis acknowledged that he had been killed inside the consulate by Saudi agents.Seeking to explain the delay, the Saudi official said the team members had tried to cover up Mr. Khashoggi’s killing for fear they would get in trouble. It was only after Turkish officials suggested he had been killed that their superiors investigated and learned of the killing.Why the team had not been required to report the mission’s outcome to its superiors remains unclear.Before Dr. Tubaigy was publicly identified, Turkish officials said that someone with his expertise was part of the Saudi team and that the person had entered the country with a bone saw, a common implement in autopsies. Dr. Tubaigy used the saw to dismember Mr. Khashoggi’s corpse while listening to music and encouraging his colleagues to do the same, Turkish officials said when they released details from a purported audio recording. Not true, said the Saudis.“There was absolutely no bone saw,” the Saudi official said. Dr. Tubaigy had been on hand in case evidence like fingerprints needed to be removed, the official said.It is still unclear.Turkish officials have suggested at various points that they had both video and audio of Mr. Khashoggi’s killing. Now, the Turks say they have audio, the source of some of the more lurid details they have given about the killing. But they have not made the audio public nor shared it with the intelligence agencies of other countries, like the United States. That could be for a variety of reasons: because it doesn’t exist; because the Turks consider it the ultimate trump card to quash the Saudi narrative; or because they don’t want to acknowledge they had bugged the Saudi Consulate. That would be a violation of diplomatic protocol and could embarrass Turkey.Saudi Arabia denies that its leaders ordered the operation against Mr. Khashoggi or even knew that it had taken place until days later. The kingdom’s intelligence service had a general order to bring dissidents home, according to the Saudi official, but the directive in Mr. Khashoggi’s case grew more aggressive as it made its way down the chain of command.But many Turkish and American officials doubt that such an elaborate operation could have been orchestrated without the knowledge of Prince Mohammed, who has consolidated considerable power. The operation involved two private jets from a company linked to the Saudi royal family and a number of the 15 men named as suspects had close ties to the crown prince.“It’s impossible that a crime would take place in any country’s consulate — especially, according to allegations, one committed by public workers — without the knowledge of that country’s officials,” said Numan Kurtulmuş, the acting chairman of Turkey’s governing Justice and Development Party.Both Turkey and Saudi Arabia have vowed to keep searching until the truth is revealed, although it is unclear how long that will take and if their dueling narratives will eventually converge. “We will not allow things to remain covered,” said Omer Celik, a spokesman for Turkey’s governing party. “We will use all the opportunities that we have to reveal what happened, and this is the intention of our president.”Saudi Arabia’s public prosecutor said Saturday that the kingdom’s inquiry would continue in order to “uncover and announce all the facts and to hold accountable all those involved in this case and bring them to justice.” But there are few examples of Saudi Arabian authorities investigating themselves and holding leaders from the powerful royal family accountable.Ben Hubbard is a Beirut-based Middle East correspondent who has spent more than a decade in the Arab world, including Syria, Iraq, Lebanon, Saudi Arabia, Egypt and Yemen.  @NYTBen • Facebook Advertisement"}