{"id": "Photo of More Than 60 Students Giving Apparent Nazi Salute Is Being Investigated", "paragraph": "Supported byBy Adeel HassanPolice and school officials in a small town in Wisconsin are investigating a photograph taken last spring of about 60 male high school students, many of them making what appears to be a Nazi salute.The photograph, taken on the steps of a local courthouse before the Baraboo High School junior prom, was available for purchase on the photographer Peter Gust’s website, Wheel Memories, until Monday morning, when it apparently was deleted.The image went viral after it was posted on Twitter Sunday night.In a letter sent to parents on Monday, the school district superintendent, Lori Mueller, said that administrators were “extremely troubled by the image.”“Clearly, we have a lot of work to do to ensure that our schools remain positive and safe environments for all students, staff and community,” Ms. Mueller wrote. “If the gesture is what it appears to be, the district will pursue any and all available and appropriate actions, including legal, to address the issue.”Not all the students in the photograph participated in making the salute. One student, wearing a red bow tie, stands stoically in the far upper right corner with his hands at his sides. Another student in the front row is making the O.K. sign with his right forefinger and thumb, a hand gesture that has been adopted by white nationalists.There is one black student in the group, who is partly obscured. When an anonymous Twitter account, which is believed to be run by two members of the school’s senior class, shared the photo on Armistice Day, the message said, “We even got the black kid to throw it up.”Baraboo is a town of 12,000 people 40 miles northwest of Madison, and the seat of Sauk County. The population is 94 percent white, according to the 2010 census.Each year, members of the junior class at Baraboo High School pose on the courthouse steps for parents and other residents. More than one professional photographer usually attends the event, according to Alisyn Amant, 19, a freshman at the University of Wisconsin-Madison who graduated from Baraboo High last year. The junior prom is held each year in the school gymnasium; there is no senior prom.[For more coverage of race, sign up here to have our Race/Related newsletter delivered weekly to your inbox.]Some of the students in the picture have since graduated, Ms. Amant said, but most are now seniors at the school. Ms. Amant said she knows several of the students in the photograph but would not give their names.She said that there was a clique of boys at the school who often made offensive remarks. “I’m not surprised by them doing this,” she said, “but I’m surprised that there’s so many of them doing this. Photographers were there; the parents were there; community members were there.”She added that she was disappointed that the photograph had been taken months ago and that no one seemed to mind until now, or seek punishment for those involved. She said that many of her high school classmates and current students she had spoken to had told her they thought some disciplinary action should still be taken.Ms. Amant’s mother is a reading specialist with an office on the high school campus. “A lot of teachers in the school have been role models and instilled the values that I have,” Ms. Amant added. “I know that my mother is outraged about this, too.”The student in the red bow tie has been identified as Jordan Blue. In a statement posted on Facebook, Mr. Blue wrote that the salute was the photographer’s idea, and that he was unable to get away from the shot before the picture was taken.“I knew what my morals were, and it was not to salute something I firmly didn’t believe in,” Mr. Blue wrote.On Twitter, the Auschwitz-Birkenau Memorial and Museum in Poland responded to the controversy by directing the school district’s attention to its online lesson plans, which include resources on the consequences of normalizing symbols of hate.“We need to explain what is the danger of hateful ideology rising,” the museum’s post said. “Auschwitz with its gas chambers was at the very end of the long process of normalizing and accommodating hatred.”Another small-town school was rocked recently when teachers and staff members at an elementary school in Idaho wore Halloween costumes depicting Mexican stereotypes and a border wall adorned with President Trump’s slogan “Make America Great Again.”The teachers and staff members were suspended.Follow Adeel Hassan on Twitter @adeelnyt.Advertisement"}