{"id": "‘Tell Your Boss’: Recording Is Seen to Link Saudi Crown Prince More Strongly to Khashoggi Killing", "paragraph": "Supported byBy Julian E. Barnes, Eric Schmitt and David D. KirkpatrickWASHINGTON — Shortly after the journalist Jamal Khashoggi was assassinated last month, a member of the kill team instructed a superior over the phone to “tell your boss,” believed to be Crown Prince Mohammed bin Salman of Saudi Arabia, that the operatives had carried out their mission, according to three people familiar with a recording of Mr. Khashoggi’s killing collected by Turkish intelligence.The recording, shared last month with the C.I.A. director, Gina Haspel, is seen by intelligence officials as some of the strongest evidence linking Prince Mohammed to the killing of Mr. Khashoggi, a Virginia resident and Washington Post columnist whose death prompted an international outcry.While the prince was not mentioned by name, American intelligence officials believe “your boss” was a reference to Prince Mohammed. Maher Abdulaziz Mutreb, one of 15 Saudis dispatched to Istanbul to confront Mr. Khashoggi at the Saudi Consulate there, made the phone call and spoke in Arabic, the people said.Turkish intelligence officers have told American officials they believe that Mr. Mutreb, a security officer who frequently traveled with Prince Mohammed, was speaking to one of the prince’s aides. While translations of the Arabic may differ, the people briefed on the call said Mr. Mutreb also said to the aide words to the effect of “the deed was done.”“A phone call like that is about as close to a smoking gun as you are going to get,” said Bruce O. Riedel, a former C.I.A. officer now at the Brookings Institution. “It is pretty incriminating evidence.”Turkish officials have said that the audio does not conclusively implicate Prince Mohammed, and American intelligence and other government officials have cautioned that however compelling the recording may be, it is still not irrefutable evidence of his involvement in the death of Mr. Khashoggi.John R. Bolton, the White House national security adviser, said that while he had not listened to the tape, he had been told it did not directly implicate Prince Mohammed. “That’s not the conclusion that I think the people who heard it have come to,” Mr. Bolton told reporters on Wednesday at a briefing in Singapore.Even if Mr. Mutreb believed the killing was ordered by the crown prince, for example, he may have had an inaccurate understanding of the origins of the order. Prince Mohammed is not specifically named on the recording, and intelligence officials do not have ironclad certainty that Mr. Mutreb was referring to him.In a statement on Monday, Saudi officials denied that the crown prince “had any knowledge whatsoever” of Mr. Khashoggi’s killing. Referring to Mr. Mutreb’s instructions to “tell your boss,” the Saudi statement said that Turkey had “allowed our intelligence services to hear recordings, and at no moment was there any reference to the mentioned phrase” in the recordings.The Turks may possess multiple recordings, including surveillance of telephone calls, and the Turkish authorities may have shared the audio only selectively.A C.I.A. spokesman declined to comment.The call was part of a recording that Turkish officials played for Ms. Haspel during her visit in October to Ankara, Turkey’s capital, but they did not allow her to bring it back to the United States. On Saturday, President Recep Tayyip Erdogan of Turkey announced that his government had shared the audio with Saudi Arabia, the United States and other Western allies.But while Turkish officials have played the recording for American and other intelligence agencies and provided transcripts, the Turks have not handed over the recording for independent analysis, according to Turkish officials.Turkey shared evidence from the case with “a large number of friendly nations,” a spokesman for Mr. Erdogan, Fahrettin Altun, said on Monday. Reacting to French criticism of Turkey’s handling of the case, Mr. Altun said that the Turkish government had played an audio recording for French intelligence officials and given them transcripts.“Let us not forget that this case would have been already covered up had it not been for Turkey’s determined efforts,” Mr. Altun said.The growing evidence that Prince Mohammed was involved in the killing of Mr. Khashoggi is certain to intensify pressure on the White House, which appeared intent on relying on a lack of concrete proof of his involvement to preserve its relationship with the crown prince. Prince Mohammed has fostered a close relationship with the president’s son-in-law and senior adviser, Jared Kushner, and the Trump administration has turned Saudi Arabia into Washington’s most crucial Arab partner.Some Trump advisers have argued that they would need indisputable evidence of Prince Mohammed’s involvement in Mr. Khashoggi’s killing before they would punish him or the kingdom more harshly. Turkish officials have said the recording contains evidence of a premeditated killing, in which Saudi agents quickly strangled Mr. Khashoggi and methodically dismembered his body with a bone saw.The administration, according to current and former officials, is hoping that making some modest moves on sanctions and curtailing support for the Saudi war effort in Yemen will satisfy critics, including those on Capitol Hill.But the shift in power in Congress, where Democrats take control of the House in January, is also increasing pressure on the administration to take more punitive action. The C.I.A. and other intelligence officials were set to brief Congress this week, and congressional leaders will press Ms. Haspel for her assessment of Prince Mohammed’s culpability.Mr. Trump himself has suggested more information would be coming out. “I’ll have a much stronger opinion on that subject over the next week,” he told reporters on Wednesday at the White House. “I am forming a very strong opinion.”Signs of a hardening stance within the administration are emerging. The State Department issued a tough statement on Sunday saying that Secretary of State Mike Pompeo had told Prince Mohammed in a phone call that “the United States will hold all of those involved in the killing of Jamal Khashoggi accountable.”Saudi officials planned to release their own inquiry in the coming days, but Turkey’s revelation that they and Western officials also have the transcripts of the recordings could force the Saudis to scramble before any presentation they planned to make.Even without definitive proof, intelligence agencies had already concluded that only Prince Mohammed could have ordered the operation to kill Mr. Khashoggi, given the personal character of his governance and the depth of his control over the kingdom. Evidence from the tape also showed that Mr. Khashoggi was killed soon after he entered the room of the Saudi Consulate in Istanbul where the security team was waiting for him, further proof that the killing was planned, according to people briefed on the intelligence.Current and former intelligence officials insisted that it is rare that all of the pieces of a complex puzzle like Mr. Khashoggi’s killing would ever be available. Intelligence, according to a former official, simply does not work like a spy thriller or television cop show where a case turns on a crystal-clear recording.Investigators were unlikely to collect a piece of evidence that incontrovertibly links the crown prince to the killing, said Representative Adam B. Schiff, Democrat of California, who is set to lead the House Intelligence Committee next year.“You are not going to have any of the people who carried out the murder speak openly about who they got their orders from or who is in the loop on it,” Mr. Schiff said in an interview. “That is not realistic to expect.”The absence of direct evidence does not prevent the intelligence community from laying responsibility at Prince Mohammed’s feet. An intelligence assessment includes an agency’s best judgment on what happened based on the available facts and experience of officials.Mr. Schiff promised that when he takes charge of the Intelligence Committee, he will investigate Mr. Khashoggi’s killing and examine Saudi Arabia’s actions more broadly in the Middle East, including its military campaign in Yemen, which has prompted a humanitarian crisis.“We need to do our own due diligence, we need to make sure we are getting good intelligence, and we need to make sure the administration doesn’t misrepresent to the country what foreign actors are doing,” Mr. Schiff said.Nonetheless, current and former officials said they do not expect Mr. Trump to drop his support for Prince Mohammed.“The Trump family and the president have built up such an overwhelming reliance on the crown prince that the relationship is now, in their view, too big to fail,” Mr. Schiff said.Policymakers — not Ms. Haspel or Dan Coats, the director of national intelligence — will decide what sort of relationship to have with Prince Mohammed and what punishment Saudi Arabia should face for Mr. Khashoggi’s killing, current and former officials said.Julian E. Barnes and Eric Schmitt reported from Washington, and David D. Kirkpatrick from London.Get politics and Washington news updates via Facebook, Twitter and the Morning Briefing newsletter.Advertisement"}