{"id": "You ‘Approved This Message’? Seriously?", "paragraph": "Supported byMediatorBy Jim RutenbergDELRAY BEACH, Fla. — Let me take you back to a time when Democrats and Republicans could breathe the same air without choking on it.It was in 2002 that they worked together to make the ads that flood the airwaves every election season a little less nasty.That year, the “Stand By Your Ad” provision was passed as part of the Bipartisan Campaign Reform Act. Ever since, anyone running for federal office has had to utter this brief refrain as part of every commercial: “I’m so-and-so and I approve this message.”The lawmakers’ idea was simple. A mix of shame and self-preservation would make candidates less inclined to put out ads that were false or just plain ugly.Adorable.Flash forward to 2018. In the final week of the midterm campaigns, President Trump tweeted a 53-second video that interspersed footage of the caravan with a courtroom scene featuring Luis Bracamontes, an undocumented immigrant and convicted murderer. After Mr. Bracamontes boasts of killing two police officers, these words appear onscreen: “Democrats let him into our country. Democrats let him stay.”As numerous fact checkers have pointed out, the ad is false. Mr. Bracamontes was deported after entering the United States during Bill Clinton’s presidency and came back during the years George W. Bush was president. He was deported once again, only to return and kill two sheriff’s deputies in California in 2014. He had even passed through the infamous Maricopa, Ariz., jail system of Sheriff Joe Arpaio, a Republican, before being released on drug charges that were never resolved.The video was so demonizing of Latino migrants and so defamatory of Democrats that it took a place alongside the infamous Willie Horton ad that helped George Bush defeat his Democratic opponent, Michael Dukakis, in the 1988 presidential election.The Horton ad was a race-based attack centered on the rape of a white woman by Mr. Horton, who is black, while he was free via a Massachusetts weekend furlough program that Mr. Dukakis had supported as the state’s governor.The ad had many creators, none of whom was  eager to be named. Mr. Trump, on the other hand, didn’t merely post the video that falsely equated a cop killer and the slow-moving caravan of asylum seekers; he featured it as a “pinned tweet” atop his Twitter page. Through the president’s tweet, the video has more than six million views.Mr. Trump’s tactic wasn’t unusual in a year of new lows in politics and media.The Republican Senate candidate Don Blankenship in West Virginia happily stood by — and in — a primary-season ad alleging that the Senate majority leader, Mitch McConnell, had created “millions of jobs for China people” and had received many millions from his “China family.” Mr. McConnell’s wife, Elaine Chao, the transportation secretary, is Chinese-American.Representative Duncan Hunter, Republican of California, who is running for re-election while facing a 57-count campaign finance law indictment, chirpily approved a false advertisement accusing his Palestinian-Mexican-American opponent, Ammar Campa-Najjar, of trying to “infiltrate” Congress with help from the Muslim Brotherhood.Representative Chris Collins, Republican of New York, who is under indictment on insider trading charges, has not backed off a xenophobic spot showing his opponent, Nate McMurray — who is married to a naturalized South Korean citizen — speaking Korean. The commercial went on to claim falsely that Mr. McMurray wanted “fewer jobs for us” and more “for China and Korea.”Here in Florida, white supremacists, who have long been content to deliver their hateful messages via obscure chat boards and fliers placed beneath windshield wipers, are getting into the act. An Idaho-based Nazi group dutifully followed legal disclosure requirements in its vile robocalls against the Democratic candidate for governor, Andrew Gillum.In this environment, Representative French Hill and his fellow Republicans in Arkansas brought to mind the touching idealism of Jimmy Stewart’s Jefferson Smith when they disavowed a supportive super PAC’s racist radio advertisement warning that “white Democrats” would “take us back to bad old days of race verdicts, life sentences and lynchings when a white a girl screams rape.”It’s enough to make a political slasher of yore feel irrelevant.“Guys like me are anachronisms now — the candidates can curse themselves,” said Floyd G. Brown, one of the political operatives involved in the infamous Horton ad. That ad was produced by an “independent” group to insulate Mr. Bush from any backlash.“In the context of today, George Bush might say, ‘I love that Willie Horton ad,’” said Mr. Brown, who is now co-chairman of the pro-Trump America Fights Back political action committee. “Instead, he said, ‘Who’s the crazy guy over there running that ad?’”Sixteen years after “I approve this message” became part of the lexicon, negative political ads seem to be everywhere, increasing by 61 percent since the last midterm season, according to a recent report from the Wesleyan Media Project.In less than two weeks, the three-word phrase expanded from corners of the right-wing internet onto some of the most prominent political stages in the country, days before the midterm elections.None of this even accounts for social media, which has gone unregulated because Facebook and other platforms managed to get themselves exempted from the advertising disclosure requirements of television and radio.The drafters of the “Stand By Your Ad” rule thought they would bring about a more civil brand of campaign discourse. But perhaps naïvely they did not foresee a time when candidates, following the lead of a self-described “nationalist” president for whom insults and falsehoods are political weapons of choice, would see no downside in attaching their names to racially incendiary messages.One of the architects of the “I approve this message” provision, the longtime Representative David E. Price, Democrat of North Carolina, told me he still believes in it enough to propose something similar for social media ads. The challenge now, he said, is that the crudest tactics are being rewarded with votes.“It’s not only beyond shame, it’s also seeing this as a political asset in some quarters,” Mr. Price said. “It’s about the general coarsening of the political discussion, and the calculation that ‘I’m the baddest, meanest, most politically incorrect guy in town and will say whatever pops into my head and I regard that as a political virtue.’”The tenor this year was “most obviously about Trump,” he added.From the first day of his presidential campaign, during which he referred to Mexicans as “rapists,” Mr. Trump has often pushed a message of racially tinged nationalism. Now, he and his allies are employing the same strategy in the midterms, only with more confidence.Take a look at the Twitter feed of his eldest son, Donald Trump Jr., which featured a message this weekend that Senator Angus King of Maine would “repopulate” the state with Syrian and Somalian refugees.Will this kind of thing work in 2018? I put the question to Carter Wrenn, a Republican strategist from North Carolina. He helped make an infamous commercial in 1990 for that state’s long-serving Republican senator, Jesse Helms, that featured a pair of white hands crumpling the application form for a job that went “to a minority, because of a racial quota,” as the narrator put it.Mr. Wrenn, who has since repudiated the ad, said that while hyperpartisans “eat up all that stuff,” the most incendiary ads don’t “have any credibility with most voters, and especially with swing voters.”Mr. Wrenn is not alone in saying that key voters will reject this year’s ugly tactics. I wish I could say I approved that prediction.An earlier version of this article misstated the first name of the Democratic candidate for governor in Florida. He is Andrew Gillum, not Terry.Advertisement"}