{"id": "If You’re Sure You Know What’s Going to Happen on Tuesday, You’re Wrong", "paragraph": "Supported byThe rise of Trumpism has changed the shape of the electorate. We are working our way toward a new political dispensation.By Christopher BuskirkMr. Buskirk is editor and publisher of the journal American Greatness and a contributing opinion writer.With Election Day at hand, we know one thing for sure: Voter turnout is huge. In fact, it looks like we will have the highest midterm turnout since 1966. The rationale for a gigantic blue wave that would represent a repudiation of the 2016 election has been that millions of Americans are so turned off by President Trump and his agenda that they will come out en masse and hand Congress to Democrats with large majorities, proving what has been an article of faith among Trump-haters, that his election was an anomaly and that American politics would quickly revert to the mean.But that’s not going to happen — because it relies on a false premise. Republicans don’t want to go back to the Bush-McCain-Romney era any more than Democrats want to go back to Clintonism. And since the Kavanaugh hearings, Republicans are just as energized and united as Democrats. That means everything is up for grabs. This election, in other words, is part of a process in which the electorate is working toward a new political dispensation that will replace the one that prevailed from the end of World War II until sometime during the Obama administration.What seems most likely is that we will get a split decision. As of now, Republicans are set up to increase their majority in the Senate, while Democrats have some advantages in the House. Though things are moving quickly and Democrats have had to spend money to defend incumbents in what should be safe seats. Senator Bob Menendez in New Jersey and Representative Jim Costa in California’s San Joaquin Valley both have Republicans nipping at their heels. Democrats remain likely to win both races, but if this were really a wave election they wouldn’t be close.Savvy Democrats who have worked elections — and not just keyboards — realized early-on that they over-promised and began to lower expectations for a wave election. The wholesale rejection of Mr. Trump that has been confidently predicted since the Women’s March that took place the day after his inauguration is not in the cards. It never was. His opponents should remember that whatever they think of the man or his policies, he won more votes than any Republican ever, remains very popular with his own party and is presiding over an economic boom. We have robust economic growth, the lowest unemployment rate since 1969 and — finally — somewhat higher wages. What’s more, the country is at peace, having largely wound down its ill-advised wars in Afghanistan and the Middle East while still pursuing a policy that has degraded Isis as a threat. A lot of voters who are not deeply ideological will look at that, or simply experience it in their own lives, and wonder why they should make a change. Things are going well.The former Obama aides who co-host Pod Save America have stood out as voices of political maturity. They predicted that Democrats’ chances of taking over the House are no better than 50-50 and even worried that Democrats could “lose everything.” But really, this should be no surprise and suggests that Democrats should temper their expectations, if not their hopes. Even if they win the House, it would be a normal course correction, not a repudiation. On average, the party in power has lost 24 House seats in the midterm elections in the postwar era, just one more than Democrats need to make Nancy Pelosi Speaker again. And the presidents who did not lose House seats in their first midterm election were Lyndon Johnson and George Bush in 2002, the year after 9/11.With millions of ballots already cast — in more than a dozen states, it’s already more than the total number of ballots in the 2014 midterm — control of the United States Senate is probably already out of reach for the Democrats. More likely is that Republicans will expand their majority by 2-4 seats. A number of critical races will likely be very tight and things could change. In my home state of Arizona, voters have slowly discovered that Kyrsten Sinema is not really the centrist she has pretended to be and are turning toward the Republican candidate, Martha McSally, a former fighter pilot. Ms. Sinema is still the same person who said in 2006 that stay-at-home mothers are “leeching off their husbands” and that conservatives are “Neanderthals.” Yet, it’s still close and Ms. Sinema could still win. The enormous size of this year’s electorate makes polling even more difficult than usual.In Texas, Beto O’Rourke, has raised far more money than Senator Ted Cruz and has captured the imagination of the political press, but has not led in a single poll and is currently far behind. Across the country, Democrats have consistently out-raised Republicans, but one of the lessons of this cycle may be that you can’t buy a wave election.With Mr. Trump more popular than Mr. Obama just before the 2010 midterms, Republicans just might retain a House majority too, but if they do it, it will be close. Even if they don’t and Democratic gains there are balanced by Republican gains in the Senate, it is simply not a blue wave and is just a typical midterm adjustment by voters. What this would suggest is that Mr. Trump, or at least his policies, are much more popular than his media detractors believe.This cycle was always going to be more difficult for Democrats than they thought. Even though the progressive agenda is embraced with almost religious totality by electoral supermajorities on the coasts and in many cities it is deplored almost everywhere else. That conflict is the basis for the sharp division in our politics. Democrats made a strategic error with the failed character assassination of Brett Kavanaugh. The viciousness of the choreographed, late-in-the-process attacks and Democrats’ rush to jettison the presumption of innocence disgusted many people who might otherwise have been more open to the Democrats’ message. And it did what Republicans had been unable to do for themselves: galvanize their base.In Minnesota in September, Mr. Trump told supporters at a rally that the “rage-fueled resistance” to Kavanaugh “is starting to backfire at a level nobody has ever seen before.” He was right. It reminds me of the 2002 memorial service for Senator Paul Wellstone. It took place a week before the election and when it turned into an anti-Republican political mosh pit, it swung the race and elected Republican Norm Coleman. Something similar may have happened this year.Two of the most telling data points of the entire election cycle are that support for Justice Kavanaugh increased among Republican women after the hearing and a poll by Morning Consult that showed that 58 percent of Republican women believed that Justice Kavanaugh’s accuser, Christine Blasey Ford, was “being opportunistic.” By alienating Republican women, Democrats hurt their chances in many suburban and exurban House districts and made life much harder for their Senate candidates here in Arizona and in states like Nevada, Missouri and Indiana. They might also have killed Heidi Heitkamp’s re-election bid in North Dakota.Democratic hubris seems to have convinced some wavering voters that it really is a binary choice: Chuck Schumer and Nancy Pelosi or Donald Trump and Mike Pence. If Democrats don’t do as well as they had hoped this year, they can trace much of it back to the Kavanaugh hearings. That’s when Republicans found their voice and when Democrats alienated a large group of persuadable voters they needed to win. After the 2012 election, Harry Reid was confronted with his lies about Mitt Romney’s tax returns during the 2012 presidential campaign. His reply was pure political cynicism: “Romney didn’t win, did he?” And he’s right: Sometimes it works. But this year it may well keep Republicans in power and destroy two years of work by Democratic candidates.Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.Christopher Buskirk is editor and publisher of the journal American Greatness, a co-author of “American Greatness: How Conservatism, Inc. Missed the 2016 Election and What the D.C. Establishment Needs to Learn,” and a contributing opinion writer.  @thechrisbuskirk Advertisement"}