{"id": "Microsoft’s Earnings Surge, as Cloud Bet Continues to Pay Off", "paragraph": "Supported byBy Karen WeiseSEATTLE — Apple has its cash cow, the iPhone, which has made it the world’s largest public company. Amazon transformed an array of industries, from logistics to the way consumers buy, to become the second largest. For Microsoft, which is gaining ground on Amazon, growth runs straight through the cloud.In the past several quarters, Microsoft’s commercial cloud offerings have grown by big leaps, helping push the company’s market cap to about $785 billion. On Wednesday, the company reported that the fast growth had continued in the latest quarter, as part of an earnings statement that beat analyst expectations and the company’s own guidance across every segment of its business.Microsoft’s first-quarter revenue was up 19 percent over the previous year, to $29.1 billion. Net income rose 34 percent, to $8.8 billion.“We are seeing larger and longer-term customer commitments to the cloud,” said Amy Hood, the company’s chief financial officer.Shares in the company rose as much as 4.6 percent in aftermarket trading, in response to the earnings. During market hours, shares had fallen more than 5 percent in a marketwide sell-off.“If you told an investor a few years ago that Microsoft is on the cusp of a $1 trillion market capitalization and could surpass Amazon, they’d think you were crazy,” said Dan Ives, a managing director at Wedbush Securities. “It speaks to how significant this cloud shift is, and what a strong hold Microsoft has on the cloud.”Amazon all but created the idea of cloud computing after it first built out remote data centers to store information and run advanced tools on its own data. But Microsoft has been gaining ground fast in recent years, establishing itself as the second-strongest provider.When Satya Nadella became chief executive in 2014, Microsoft largely depended on selling its Windows operating system on personal computers, even as smartphones were ascendant. He shifted the company to focus much more on its cloud computing business.The breakneck growth of Azure, Microsoft’s core cloud offering, slowed more in the most recent quarter than some analysts had expected. It was up 76 percent, after several quarters of being up from 85 to 98 percent. And Azure may not even be profitable, said Karl Keirstead, an analyst at Deutsche Bank, as the company heavily invests engineering resources in new products and the construction of new data centers around the globe.But analysts and investors say the company is well positioned for the increasingly popular approach called “hybrid cloud,” which lets enterprises, like companies or government agencies, use one set of tools to manage what they store both on their own servers and on shared space in the cloud.“Microsoft is unique in the sense that it has the ability to play in both environments,” said Sid Parakh, a portfolio manager in Seattle at Becker Capital, which invests in Microsoft. “Legacy customers are already working on Microsoft products, and it provides a level of continuity to transition to the cloud.”In a call with analysts, Mr. Nadella said that “we don’t think of hybrid as some stopgap to move to the cloud,” and that Microsoft was investing in building out its hybrid offerings.“This is a place where we are leading,” he said.The company’s year-over-year growth in server products and cloud services was 28 percent, which Ms. Hood said was a sign that the company was meeting customer demand. That makes it “not a challenging decision” to invest heavily in the cloud business, she said. And the company has money to spend in part because the legacy Windows business is still lucrative.“They have been telegraphing that Azure’s profitability is improving, and that is enough,” Mr. Keirstead said. “It is probably the most amazing growth engine we have seen inside Microsoft since basically the origins of the Windows business.”Another key part of the cloud transition is how Microsoft moved its suite of Office programs from software to the cloud, called Office 365. The product’s revenue was up 36 percent in the first quarter.“It’s not as sexy Azure, but it’s really important,” said Keith Weiss, a Morgan Stanley analyst. “It drives a lot of your profit.”Mr. Weiss said that once companies moved Office to the cloud, it was easier for Microsoft to sell them additional services, like video calls on Skype for Business or group chats on Microsoft Teams, a tool similar to the Slack messaging system.“If you can get someone to pay you 20 percent more by just switching on some functionality, that’s great for you,” Mr. Weiss said.Aside from the core cloud business, Ms. Hood said, gaming revenue increased 44 percent, outperforming expectations as Microsoft expands its gaming platform.“Fortnite is a key component of that, but it’s not the only contributor,” she said, referring to a popular game.LinkedIn revenue also had higher-than-expected revenue, up 33 percent over the previous year, as engagement increased.“Right now, it's like they are firing on all cylinders,” Mr. Ives of Wedbush said. \"The biggest risk to the name is that expectations have increased.”An earlier version of this article misspelled the name of a popular video game. It is Fortnite, not Fortnight.Follow Karen Weise on Twitter: @kyweise.Advertisement"}