{"id": "The Secret Lives of Central Bankers", "paragraph": "Supported byThese architects of the global economy pride themselves on being brilliant, aloof and rational. And then they wonder why they’re not more popular.By Annelise RilesMs. Riles, a professor of law and anthropology, is the author of “Financial Citizenship: Experts, Publics, and the Politics of Central Banking.”A few years ago, a senior Japanese central banker let me in on a secret side of his life: Like some others in his rarefied world, he is a passionate devotee of Sherlock Holmes. After formal meetings in capitals around the world, he joins the other Sherlock Holmes buffs over drinks or dinner for trivia competitions, to test their knowledge of obscure plot details, or to share amateur historical research into Victorian London. It is all very casual, but the camaraderie is important to him. Through this informal fan club, the banker told me, he had made his closest professional friendships. “I feel closer to many of these people than to many of my countrymen,” he said.As an anthropologist, I have spent 20 years studying the customs, beliefs and rituals of central bankers around the world. They see themselves as jacks-of-all-financial-trades who solve complex financial crises before they can damage the unsuspecting public. They are as clever as the extraordinarily wealthy banking executives whom they regulate, but motivated by higher ideals. So it made sense that the aloof and justifiably arrogant Sherlock Holmes might represent for them an ideal of masculine brilliance (they are mostly still men), rationality and self-control. Like Holmes, central bankers consider their detachment an asset. But in the real world, this high-mindedness has come at a cost. In the United States, President Trump has suggested that the Federal Reserve is not doing “what’s good for the country,” and on Tuesday he told Fox Business that the Fed was his “biggest threat.” He said that it was “raising rates too fast, and it’s too independent.” So far, the Fed chairman has remained above the political fray. But if the president persuades enough Americans that the Fed’s decisions to raise interest rates, which would make their credit cards and mortgages more expensive, are to blame for their financial troubles, principled silence may not be enough.The acculturation process for central bankers begins early. Most of them attend a handful of elite universities — the University of Chicago, Harvard, Yale, Oxford, Cambridge — to study neoclassical economics, and their early training often involves a secondment to the central banking institutions of another country. In Tokyo or Frankfurt or New York, they operate within a closed set.There are norms of dress: sharp, conservative suits and dark ties, but never fancy shoes. (Janet Yellen’s decision to remove her jacket at a summertime meeting once caused a stir.) And many central bankers date their lives according to memories of certain key international banking agreements: Basel I and Basel II are, for them, like the fall of the Berlin Wall or the Sept. 11 attacks.This world is beginning to feel like an anachronism, especially after the financial crisis of 2008. When markets fail to respond to monetary policy as the science says that they should, the public loses faith in experts. And it may not be possible for the informal and secretive craft of central banking to continue its traditions in a world that demands greater transparency and accountability. This tradition of the apolitical central banker isn’t even very well established. It goes back only to the late 1980s and early 1990s, when a flurry of academic research suggested that independent central banks were correlated with lower inflation — a priority at the time for the United States. In response to criticism, many central banks are trying to diversify their work forces and share more details about the deliberations of their monetary policy committees.But these steps have been far too modest. Central banks should think more boldly about diversity, by welcoming not just more women and people of color, but also more people with real-world economic and business expertise, rather than only Ph.D.s. Central bankers already meet regularly with academics and financial institutions such as Goldman Sachs. Why not also meet with civil society groups that critique their work?Central bankers should also consider the divisions in their own elite world. At one closed-door meeting that I organized, a central banker from South Asia complained to the ones from the United States and Europe, in essence: You guys meet the night before at your private club, and then you show up here, and the decisions have already been made.The man he was challenging wasn’t embarrassed. Instead, he said, in effect: Well, if you could just learn to play by the rules, then you could be part of that club. Look at the Japanese. They’ve learned all the rules, and now look where they are.This arrogance, toward the public and even toward one another, undermines central banks’ effectiveness. One of the goals of monetary policy is to shape people’s behavior. When a central bank says it anticipates that prices are going to rise, it expects the public to take that advice seriously. If people do, and they buy things now before prices rise, then perhaps prices won’t rise as much. But central banks need credibility for this stabilizing mechanism to work.Some countries do have this level of public trust, built carefully over decades. In Denmark, for example, central bank officials make a concerted effort, in speeches and other public comments, to tell the story of how their work contributes to the egalitarian society that Danes value. Danes love their central bank.There are still, of course, central bankers who argue that they should preserve their mystique or people won’t respect them. Others believe that close ties among central bank officials benefit everyone: The 2008 crisis, for example, might have been much worse if they did not have such open lines of communications. One central banker I know, from one of the Group of 7 countries, spoke movingly about how much he valued his deep personal relationships with leaders at the People’s Bank of China. He said both sides shared quite sensitive information and did whatever they could, within the boundaries of their professional obligations, to support one another.In an era of increasing economic nationalism, this cosmopolitan culture may be difficult to maintain.Holmes never worried about this sort of thing. In “A Study in Scarlet,” upon being told that the earth in fact revolves around the sun, Holmes declares, “What the deuce is it to me?” Dr. Watson is shocked, but Holmes insists, “If we went round the moon it would not make a pennyworth of difference to me or my work.” His central banking acolytes may not be so lucky.Annelise Riles, a professor of law and anthropology, is the executive director of the Roberta Buffett Institute for Global Studies at Northwestern and the author of “Financial Citizenship: Experts, Publics, and the Politics of Central Banking.”Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram, and sign up for the Opinion Today newsletter. Advertisement"}