{"id": "Desperately Seeking Principled Republicans ", "paragraph": "Supported byThe party has lost its way, and it’s time to start over.By Nicholas KristofOpinion ColumnistJust as deer populations need wolves or cougars to keep them healthy, Democrats benefit from predatory Republicans.America needs a robust center-right party to hold progressives like me accountable. Cities and states run by a single party slide toward poor governance, and conservatives are essential to push back at flabby thinking on the left — like California’s Proposition 10, a populist rent control proposal that might backfire and magnify homelessness.Unfortunately, the principled version of the Republican Party in Congress has virtually collapsed, a crisis compounded by the death of Senator John McCain. Republican leaders in Congress actively resist providing congressional oversight and are no more than the president’s poodles.Sure, there are still many principled individuals within the party, but as a national institution the Republican Party is hollow. It is no longer about an ideology; it’s about shining President Trump’s shoes. And that is the fundamental issue hanging over the midterm elections.“The Republican Party must suffer repeated and devastating defeats,” Max Boot, a lifelong Republican until Trump’s election, writes in his new book, “The Corrosion of Conservatism: Why I Left the Right.”“It must pay a heavy price for its embrace of white nationalism and know-nothingism,” Boot continues. “Only if the G.O.P. as currently constituted is burned to the ground will there be any chance to build a reasonable center-right political party out of the ashes.”Then there’s Andrew Sullivan, the conservative writer, who dismisses today’s Republican Party as “the party of corruption, propaganda, vote suppression, and barely masked bigotry.” He adds, “I despise it because I am conservative.”I don’t know that such rumbling matters much to the electorate: For voters who back Trump partly because they see him as anti-elitist, fussing by effete intellectual snobs is less a demerit than a credential. But the point remains that we need a principled Republican caucus in Congress — and we don’t have one.Though I have often disagreed with past Republican leaders, I also noted some great accomplishments, from the superb diplomacy of George H.W. Bush after the Cold War to the lifesaving AIDS program of George W. Bush in the 2000s.Historically, Republicans were associated with fiscal conservatism, free trade and standing up militarily to autocrats in Moscow. But what does the party stand for today?Until recently, one might have said that Republicans stood for repealing the Affordable Care Act. But now that it is popular with voters, at least 20 Republican members of Congress have scrubbed or softened their denunciations of the law, according to the Daily Beast.The most odious pirouette may involve deficit spending. During the height of the 2008-9 recession, not a single Republican House member voted for the American Recovery and Reinvestment Act to stimulate the economy.It’s difficult to explain the G.O.P.’s resistance to a stimulus during the recession except as a willingness to let millions of Americans lose their jobs in hopes that President Barack Obama would get blamed. It can’t have been about deficits, because Republicans then passed a tax cut for rich Americans that adds $1.4 trillion to deficits.The Republican turnabout on Russia is similar. Just a few years ago, Republicans denounced Democrats for being too trusting of Vladimir Putin — and they had a point — yet now they line up behind a president who gushes about Putin.The Republican Party boldly challenged Obama over scandals that dishonored the White House. Um, like, his once wearing a tan suit. Or holding a latte while saluting a Marine.But congressional Republicans have been spineless about a president who tears immigrant children from parents, declares his “love” for a North Korean leader who is still adding to his nuclear arsenal, and accepts large sums from the Saudi government in his hotel empire even as he downplays its torture-murder of a Washington Post journalist.Granted, a certain amount of hypocrisy is human. Democrats rage at evangelical Christians who embrace a philanderer, but they themselves denounce corruption while still supporting Senator Robert Menendez of New Jersey.Yet if we’re all tribal to some degree, congressional Republicans now seem to care only about tribe. The indifference to Russian interference in the 2016 election and to democratic norms is particularly sad. The party of Lincoln has today embraced white nationalists and undertaken systematic efforts to suppress voting by African-Americans and Native Americans. Consider the effort in Georgia to close polling places used by black voters on the ground that the toilets aren’t accessible to the disabled.George Will, one of the best-known conservative thinkers in America, is no fan of Democrats but bluntly urged readers: “Vote against the G.O.P. this November.” When a political party stands for nothing larger than itself, it is time to rebuild it — and that requires voters first to engage in demolition.You can sign up for Nicholas Kristof’s free, twice-weekly email newsletter, and also join him on Facebook and follow him on Twitter (@NickKristof) and Instagram.Nicholas Kristof has been a columnist for The Times since 2001, and was a longtime foreign correspondent before that. He has won two Pulitzer Prizes, for his coverage of China and of the genocide in Darfur.  @NickKristof • Facebook Advertisement"}