{"id": "Bernie Sanders: We Must Stop Helping Saudi Arabia in Yemen ", "paragraph": "Supported byCongress needs to step in to end our complicity in the kingdom’s human rights abuses. By Bernie SandersMr. Sanders is a United States senator from Vermont. The likely assassination of the Saudi critic and Washington Post journalist Jamal Khashoggi underscores how urgent it has become for the United States to redefine our relationship with Saudi Arabia, and to show that the Saudis do not have a blank check to continue violating human rights.One place we can start is by ending United States support for the war in Yemen. Not only has this war created a humanitarian disaster in one of the world’s poorest countries, but also American involvement in this war has not been authorized by Congress and is therefore unconstitutional.In March 2015, a coalition of Arab states led by Saudi Arabia and the United Arab Emirates started a war against Yemen’s Houthi rebels. Since then, many thousands of civilians have been killed and many more have lost their homes. Millions are now at the risk of the most severe famine in more than 100 years, according to the United Nations. The chaos in Yemen has also provided fertile ground for extremist groups like Al Qaeda and the Islamic State, and created new opportunities for intervention by Iran.The United States is deeply engaged in this war. We are providing bombs the Saudi-led coalition is using, we are refueling their planes before they drop those bombs, and we are assisting with intelligence. In far too many cases, the bomb’s targets have been civilian ones. In one of the more horrible recent instances, an American-made bomb obliterated a school bus full of young boys, killing dozens and wounding many more. A CNN report found evidence that American weapons have been used in a string of such deadly attacks on civilians since the war began.Yet last month, responding to congressional concerns, Secretary of State Mike Pompeo officially certified to Congress — and Secretary of Defense James Mattis affirmed — that the Saudis and Emiratis are making “every effort to reduce the risk of civilian casualties.”The data refute these claims. According to the independent monitoring group Yemen Data Project, between March 2015 and March 2018, more than 30 percent of the Saudi-led coalition’s targets have been nonmilitary. According to the Armed Conflict Location and Event Data project, civilian deaths in one region increased by more than 160 percent over the summer from earlier in the year. People inside the administration understand these facts. Several days after Mr. Pompeo issued the certification, The Wall Street Journal reported that he had overruled the State Department’s own regional and military experts, siding instead with members of his legislative affairs staff who argued that not certifying could endanger United States arms sales to the Saudis and Emiratis. President Trump himself echoed this logic when asked about the murder of Mr. Khashoggi, claiming that the Saudis are spending “$110 billion” on military equipment.It gets worse. The Intercept reported that a former lobbyist for the arms manufacturer Raytheon, which stands to make billions of dollars from those sales, leads Mr. Pompeo’s legislative affairs staff. The administration defends our engagement in Yemen by overstating Iranian support for the Houthi rebels. But the fact is that the relationship between Iran and the Houthis has only strengthened with the intensification of the war. The war is creating the very problem the administration claims to want to solve.The war is also undermining the broader effort against violent extremists. A 2016 State Department report found that the conflict between Saudi-led forces and the Houthi insurgents had helped Al Qaeda and the Islamic State’s Yemen branch “deepen their inroads across much of the country.” As the head of the International Rescue Committee, David Miliband, said in a recent interview, “The winners are the extremist groups like Al Qaeda and ISIS.” Above and beyond the catastrophe that this war has created, there is the fact that American engagement there has not been authorized by Congress, and is therefore unconstitutional. Article I of the Constitution clearly states that it is Congress, not the president, that has the power to declare war. Over many years, Congress has allowed that power to ebb. That must change.In February, along with two of my colleagues, Mike Lee, Republican of Utah, and Chris Murphy, Democrat of Connecticut, I introduced Senate Joint Resolution 54, calling on the president to withdraw from the Saudi-led war in Yemen. We did this for two reasons. The first is that the war is a strategic and moral disaster for the United States. The second is that the time is long overdue for Congress to reassert authority over matters of war. The Senate voted 55 to 44 to delay consideration of the resolution. Since then, this crisis has only worsened and our complicity become even greater.Next month, I intend to bring that resolution back to the floor. We will be adding more co-sponsors, and colleagues in the House have offered a similar measure.  The brutal murder of Mr. Khashoggi demands that we make clear that United States support for Saudi Arabia is not unconditional. I very much hope that Congress will act, that we will finally take seriously our congressional duty, end our support for the carnage in Yemen, and send the message that human lives are worth more than profits for arms manufacturers.Bernie Sanders, an independent, is a United States senator from Vermont. Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.Advertisement"}