{"id": "Standing ‘Against White Supremacy,’ G.O.P. Campaign Chief Rebukes Steve King", "paragraph": "Supported byBy Catie EdmondsonWASHINGTON — As Pittsburgh began burying the victims of Saturday’s synagogue massacre, the head of the House Republican campaign arm all but jettisoned Representative Steve King of Iowa from the House Republican Conference, declaring, “We must stand up against white supremacy and hate in all forms.”The highly unusual rebuke by Representative Steve Stivers of Ohio, the chairman of the National Republican Congressional Committee, came a week before the midterm elections — but after years of incendiary and racially charged comments by Mr. King, capped in recent days by his endorsement of a white nationalist running for mayor of Toronto and a meeting with Austrian white nationalists, which he funded through a trip to visit concentration camps.Mr. King is also locked in the toughest re-election fight of his eight-term House career.“Congressman Steve King’s recent comments, actions, and retweets are completely inappropriate,” Mr. Stivers wrote on Twitter. “We must stand up against white supremacy and hate in all forms, and I strongly condemn this behavior.”Mr. King fired back with a statement of his own, affirming that Americans of all races and “national origins-legal immigrants & natural born citizens” are created equal. He blamed attacks on him as “orchestrated by nasty, desperate, and dishonest fake news,” aided by complicit “Establishment Never Trumpers.”The public censure is the latest downturn for Mr. King, whose lengthy history of making racially charged remarks has been subjected to closer scrutiny after the synagogue shooting in Pittsburgh. After liberal activists on social media lobbied some of Mr. King’s corporate donors to cut ties with the representative, the Midwestern dairy giant Land O’Lakes withdrew its support, saying in a statement that it wants its “contributions to be a positive force for good.”The math currently favors the Democrats in the House and the Republicans in the Senate.New polling from Iowa’s Fourth Congressional District indicates that he is in a statistical tie with his Democratic opponent, J. D. Scholten, a former baseball player and a first-time candidate, who has significantly outraised him. Iowa Republicans are already at risk of losing two other House seats.Over nearly 16 years, Mr. King has evolved from a stalwart conservative to a vocal opponent of immigration to the edge of white supremacy. He compared immigrants to dogs and said young migrants had “calves the size of cantaloupes” because they were hauling in bales of marijuana. He once tweeted a political cartoon depicting President Barack Obama wearing a turban.Two weeks ago, he endorsed Faith Goldy, who has previously recited the 14-word manifesto used by neo-Nazis, in her race for Toronto mayor. And in the spring, he retweeted an anti-immigration message from a prominent Nazi sympathizer who has described himself as an admirer of Hitler. (Mr. King defended that decision, adding, “I will retweet the devil if the devil tweets, ‘I Love Jesus.’ It’s the message, not the messenger.”)But the tipping point may have come last week when news reports revealed that Mr. King had met in August with members of an Austrian political party associated with neo-Nazi movements while he was on a trip to Holocaust sites that was funded by a Holocaust memorial charity, From the Depths.His local newspaper, The Sioux City Journal, which had endorsed Mr. King in previous races, instead endorsed Mr. Scholten.“Each time King immerses himself in controversy, he holds up this district to ridicule and marginalizes himself within the legislative body he serves,” the newspaper’s editorial board wrote, “neither of which provides benefit to Iowans who live and work here.”Advertisement"}