{"id": "My Year as a Trump Ambassador", "paragraph": "Supported bySome disorder is normal at the start of an administration. But it was extreme under Mr. Trump. By Roberta S. JacobsonMs. Jacobson was the United States ambassador to Mexico until May. President Trump has triumphantly declared his replacement for the North American Free Trade Agreement to be a major improvement over the original. I have my doubts, as do many experts, including some Republicans. But even the skeptics are relieved that the heart of the 25-year-old trade pact remains intact.The back story of Mr. Trump’s campaign to dismantle Nafta is not just about his obsession with one agreement. It is also a window into a chaotic decision-making style that has undermined America’s diplomacy and national interests across the globe. I observed this disarray up close for more than a year as the ambassador to Mexico. It wasn’t pretty.The first time White House officials told reporters that the president intended to rip up Nafta, in the spring of 2017, I was about to attend the Mexican air show, one of the most important commercial events involving Mexico and the United States.Billions of dollars in trade between the two countries are at stake during the show, where a host of American aerospace suppliers demonstrate their wares. As the ambassador to Mexico, I would have expected to have been told what the president intended to do about the most vital part of our relationship with Mexico.But this is not how things work in the Trump era.I learned about the draft one-page notification of our plan to exit Nafta from countless emails and phone calls from reporters and Mexican officials. Now I was going to spend a hot April afternoon with the Mexican president, Enrique Peña Nieto, without warning or instructions from Washington. What was I supposed to tell him?I had been a diplomat for over 30 years, serving under five presidents, with stints in Argentina and Peru, and as assistant secretary for Western Hemisphere Affairs. I had visited nearly every country in the Americas, mastered the bureaucratic skills needed to get things done and served on crisis task forces for hurricanes, earthquakes and coups. I had always relied on guidance from my State Department superiors, and the White House via the National Security Council. Such guidance was rare after Mr. Trump assumed office.Some chaos is normal at the start of an administration. But it has been extreme under Mr. Trump. About 30 ambassadorships remain vacant, including in vitally important countries like Saudi Arabia and Pakistan. Moreover, the disconnect between the State Department and the White House seems intentional, leaving ambassadors in impossible positions and our allies across the globe infuriated, alienated and bewildered.Mexico is one of the countries most important to American interests. For 27 states, Mexico is the largest or second-largest destination for their exports, and $1.7 billion in trade crosses our shared border every day. Many millions of good jobs in the United States, especially in the auto industry, depend on our highly integrated economies.But the importance of competent diplomacy with Mexico is about more than jobs and trade. The opioid crisis makes cooperation on stemming the flow of illegal drugs across the border essential. More than 72,000 Americans died from overdoses in 2017, and nearly 30,000 of those deaths were most likely because of fentanyl or other synthetic opioids, much of them passing through Mexico. Mexican security forces have raided dozens of so-called methamphetamine superlabs and begun taking down critical drug networks, working with United States agencies and taking enormous risks by doing so.Despite Mr. Trump’s campaign rhetoric vilifying Mexicans and focusing on a border wall, embassy officials and our Mexican partners felt after his inauguration that we would be able to continue working well together. But it quickly became impossible to know how to influence the mess in Washington.On that April afternoon in 2017, I knew that Rex Tillerson, the secretary of state, didn’t want to get involved in Nafta talks and rarely took calls from even a senior ambassador. So I talked to senior career colleagues from the Office of the United States Trade Representative and the Commerce Department, but they knew little more than I did.As President Peña Nieto joined diplomats and government and military officials on the reviewing stand, he paused to greet me and emphasized that it was imperative that we talk later. When we finally sat down alone, the president, unfailingly polite, was blunt: What the hell was going on? “Your president is going to pull out of Nafta before we’ve even had a chance to sit down and work on this?” he said to me. “This would be a disaster — economically, politically.”He was right. Nafta, while never a panacea, had helped trade nearly quadruple among the United States, Mexico and Canada; made countless American industries more competitive; and perhaps most important, cemented a shift in our relations with Mexico to the benefit of the United States. Mexicans opened up to the world with Nafta, not just in trade but also politically, with democracy advancing, albeit in fits and starts. Mexican governments became our partners on security, migration and foreign policy, including on terrorism. Pulling out would threaten more than just a productive trade relationship.All I could tell him was that I was continuing to speak with the White House and hoped cooler heads would prevail. I noted that this was coming just after a spate of negative articles about the first 100 days of the Trump administration. I was learning that critical news reports almost inevitably led the president to fall back on his standard refrains: Build the wall, or Nafta is the worst deal ever.The draft document to pull out of Nafta was never sent. Why? We’re not really sure. Perhaps because the Mexican foreign minister, Luis Videgaray, engineered a phone call between Presidents Trump and Peña Nieto. Perhaps Mr. Trump’s secretary of agriculture showed him evidence that his rural, agricultural base would be hurt. Or because powerful Republicans in Congress weighed in against ruining an important trading relationship. We now have a new trade deal that actually keeps much of the original agreement intact. But it also includes provisions intended to keep more auto manufacturing jobs in the United States and to increase American dairy exports into Canada. The agreement seems to have dropped some of the most onerous demands on Mexico and Canada, and perhaps reflects the administration’s realization that it needs to focus on China. I can only hope that the president and his team are beginning to recognize that we need our allies, most importantly Canada and Mexico, if we are to tackle some of our most difficult domestic problems. But I am not confident of that.I left Mexico on May 5 — Cinco de Mayo — exactly two years after I had been sworn in as ambassador, and retired from government service at the end of May. Believing deeply in the United States-Mexico relationship, I cannot pretend anything less than relief at no longer having to defend the indefensible. But I also feel glad to escape the disorder I witnessed for more than a year.On July 1, Mexicans elected a new president, Andrés Manuel López Obrador. There is little that all Mexicans agree on, but a steadfast rejection of President Trump’s bashing of Mexico is one point of consensus. Mr. López Obrador’s rise may have been mainly a rejection of corruption within the Peña Nieto government — but it was aided by the constant drumbeat of negativity from the White House. Public opinion polls in Mexico showed a drop of more than 30 points in positive views of the United States from 2015 to 2017.Over the past three decades, successive American administrations have worked diligently to vanquish the anti-American DNA in Mexico. We were overcoming the suspicions that a history of invasion, territorial loss and imperial intent had bequeathed. That kind of trust is slow to build, and remarkably easy to destroy. It is being destroyed now.Roberta S. Jacobson, a Pritzker Fellow at the Institute of Politics at the University of Chicago, resigned as the United States ambassador to Mexico in May after more than 30 years at the State Department.Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram, and sign up for the Opinion Today newsletter. Advertisement"}