{"id": "Truth and Virtue in the Age of Trump", "paragraph": "Supported byYou’re a hero if and only if you serve The Leader’s interests.By Paul KrugmanOpinion ColumnistRemember when freedom was just another word for nothing left to lose? These days it’s just another word for giving lots of money to Donald Trump.What with the midterm elections — and the baseless Republican cries of voting fraud — I don’t know how many people heard about Trump’s decision to award the Presidential Medal of Freedom to Miriam Adelson, wife of casino owner and Trump megadonor Sheldon Adelson. The medal is normally an acknowledgment of extraordinary achievement or public service; on rare occasions this includes philanthropy. But does anyone think the Adelsons’ charitable activities were responsible for this honor?Now, this may seem like a trivial story. But it’s a reminder that the Trumpian attitude toward truth — which is that it’s defined by what benefits Trump and his friends, not by verifiable facts — also applies to virtue. There is no heroism, there are no good works, except those that serve Trump.About truth: Trump, of course, lies a lot — in the run-up to the midterms he was lying in public more than 100 times each week. But his assault on truth goes deeper than the frequency of his lies, because Trump and his allies don’t accept the very notion of objective facts. “Fake news” doesn’t mean actual false reporting; it means any report that hurts Trump, no matter how solidly verified. And conversely, any assertion that helps Trump, whether it’s about job creation or votes, is true precisely because it helps him.The attempt by Trump and his party to shut down the legally mandated Florida recount with claims, based on no evidence, of large-scale voting fraud fits right into this partisan epistemology. Do Republicans really believe that there were vast numbers of fraudulent or forged ballots? Even asking that question is a category error. They don’t “really believe” anything, except that they should get what they want. Any vote count that might favor a Democrat is bad for them; therefore it’s fraudulent, no evidence needed.The same worldview explains Republicans’ addiction to conspiracy theories. After all, if people keep insisting on the truth of something that hurts their party, it can’t be out of respect for the facts — because in their world, there are no neutral facts. So the people making inconvenient assertions must be in the pay of sinister forces. In Arizona, Democrat Kyrsten Sinema won a Senate seat on the strength of late-counted ballots. Did you know that the state G.O.P. has filed a freedom of information request for information on interactions between election officials and, you guessed it, George Soros?It’s worth pointing out, by the way, that this rejection of objective facts and insistence that anyone insisting on inconvenient truths must be part of a left-wing conspiracy dominated the Republican psyche long before Trump. Most notably, the claim that the overwhelming evidence for global warming is a giant hoax, the product of a vast plot involving thousands of scientists around the world, has been G.O.P. orthodoxy for years.True, the party’s presidential candidates used to be mealy-mouthed about rejecting facts and endorsing conspiracy theories, rather than being full-throated crazy. But Trump is only going where many of his party’s senior figures have been for a long time.Anyway, my point is that the rejection of any standard besides whether it helps or hurts Trump extends beyond true or false to basic values. In TrumpWorld, which is now indistinguishable from G.O.P.World, good and bad are defined solely by whether the interests of The Leader are served. Thus, Trump attacks and insults our closest allies while praising brutal dictators who flatter him (and declares neo-Nazis “very fine people”).And the same goes for heroism and cowardice. A genuine hero like John McCain, who was critical of Trump, gets dismissed as a failure: “He’s not a war hero. … I like people who weren’t captured.” Meanwhile, Miriam Adelson, whose service to the nation basically consists of giving Trump campaign contributions, gets the Presidential Medal of Freedom.Oh, and this, too, predates Trump. Remember how Republicans denigrated John Kerry’s war record?As with so much about the current political scene, it’s essential to realize and acknowledge that this is not a symmetric, both-sides-do-it situation. If you say something along the lines of “truth and virtue are now defined by partisanship,” you’re actually enabling the bad guys, because only one party thinks that way. Democrats, being human, sometimes have biased views and engage in motivated reasoning. But they haven’t abandoned the whole notion of objective facts and nonpolitical goodness; Republicans have.What all of this means is that what’s going on in America right now isn’t politics as usual. It’s much more existential than that. You have to be truly delusional to see the Republicans’ response to their party’s midterm setback as anything but an attempted power grab by a would-be authoritarian movement, which rejects any opposition or even criticism as illegitimate. Our democracy is still very much in danger.Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram, and sign up for the Opinion Today newsletter. Paul Krugman has been an Opinion columnist since 2000 and is also a Distinguished Professor at the City University of New York Graduate Center. He won the 2008 Nobel Memorial Prize in Economic Sciences for his work on international trade and economic geography.  @PaulKrugman Advertisement"}