{"id": "2 Dead After Gunman Opens Fire at Kentucky Kroger, Police Say", "paragraph": "Supported byBy Matt Stevens and Andrew R. ChowA gunman fatally shot two people at a supermarket in Kentucky on Wednesday afternoon before an armed onlooker fired at him, prompting him to flee, the police said.The authorities identified the gunman on Thursday as Gregory Bush, 51. He was arrested a short time after the shooting near the Kroger where it happened in Jeffersontown, a suburb of Louisville, Chief Sam Rogers of the Jeffersontown police said at a news conference on Wednesday night.Mr. Bush was charged with two counts of murder and 10 counts of endangerment in the first degree, and was being held at the Louisville Metro Department of Corrections, the authorities said.The victims were identified as Vicki Lee Jones, 67, and Maurice E. Stallard, 69, who was the father of a prominent city official in Louisville. They were both black, the police said, and Mr. Bush is white; while the police said they did not know of a motive, the son of a witness said his father heard the gunman making a racist remark.“I am just sick and heartbroken and quite angry,” Mayor Greg Fischer of Louisville said on Thursday. “This one is especially painful.”Mr. Stallard’s daughter, Kellie Watson, works for the mayor as the chief equity officer in Louisville, he said.“I’m angry because it seems like none of these murders or massacres hit close enough for anyone in a position to do something about this madness,” Mr. Fischer said.At a court hearing on Thursday morning, a judge ordered Mr. Bush to be held on $5 million bond. Mr. Bush told the judge that he was unemployed and could not afford a lawyer.Steve Zinninger told Wave 3 News that his father confronted the gunman at one point during the encounter, brandishing a gun of his own and telling him that he would not shoot if the gunman did not shoot. Mr. Zinninger said the gunman told his father, “Whites don’t kill whites,” and moved on.In a statement, Kroger said it was “shocked and saddened by the shooting.”“Thanks to the quick response of the local Police Department, the suspect was apprehended and our store is secure,” the company said. “We are cooperating with law enforcement and assisting with their investigation. Our store is closed and will reopen after the investigation concludes.”The police in Jeffersontown said they received reports of shots fired at the supermarket around 3 p.m. Wednesday and quickly sent officers to the scene.Investigators said that after Mr. Bush entered the supermarket, he fired multiple rounds at a male victim; he then exited and fired multiple rounds at a female victim, whom he encountered in the parking lot. Both shooting victims were declared dead at the scene, Chief Rogers said.Mr. Bush then encountered “an armed citizen,” who “engaged the suspect with gunfire in the parking lot,” the chief said. He did not provide any additional information about that man. The gunman then ran, but he was soon caught by the police on a main thoroughfare nearby.Chief Rogers said multiple law enforcement agencies, including federal authorities, were assisting with the investigation.“At this point we’re looking into all factors related to this shooting,” he said.Mitch McConnell, the Senate majority leader and one of Kentucky’s senators, said Wednesday that he and his staff were “closely monitoring the situation.”“As we continue to learn more about the events that took place, Elaine and I ask the entire Louisville community to join us in praying for the victims and their families,” he said in a statement, referring to his wife, Elaine Chao.In an interview with the local television station WDRB, Kathy Mayhall said that she was at the store’s checkout when she heard “‘bang, bang, bang, bang’ really, really loud.” Everyone looked at each other, she said, and then the gunfire continued.Ms. Mayhall said the shooting inside the store occurred in its “back right corner” and she was “maybe eight aisles away.”“We knew it was a loud noise, but the way it echoed in that building — I didn’t really realize” a shooting had taken place, she said. She noted that one is not usually “thinking you’re going to hear a gun in a grocery store.”At least one eyewitness’s account differed from that of the police.Eric Deacon, who was also shopping on Wednesday, told Wave 3 News that he heard gunfire and took cover on the ground. A man ran past him and out the door of the Kroger, he said, as another man chased him.Mr. Deacon told The Courier Journal of Louisville that the gunman had a “blank stare” on his face as he came around the corner.The pair of armed men then began firing at each other in the parking lot, which is when the female victim was hit, Mr. Deacon said.“She was right up in the front of the parking lot,” he told the station. “I hollered out and I said, ‘Look, I’m an E.M.T. Let me get out here and try to help this woman.’ They ushered me out, and I’m getting ready to start C.P.R. on this lady. And I looked at her and I was like, ‘Fellas, she’s gone. There’s nothing I can do.’”In a statement issued Wednesday night, the Jeffersontown Police Department said that the crime scene had been cleared, but that the supermarket would remain closed until Friday morning.Sandra E. Garcia and Matthew Haag contributed reporting.Advertisement"}