{"id": "Trump Is Beginning to Lose His Grip", "paragraph": "Supported byIt isn’t just white suburban women who switched to Democrats. Parts of rural and white working class America peeled off too. By Stanley B. GreenbergMr. Greenberg is a Democratic pollster.America’s polarized citizenry took a break from intense partisan bickering to produce the highest off-year turnout in a midterm election in 50 years on Nov. 6. Is it possible that all that effort actually nudged us forward a bit?Because the votes were counted so slowly across the country, we were also slow to realize that Democrats had won the national congressional vote by a margin greater than that of the Tea Party Republicans in 2010. In fact, Democrats overcame huge structural hurdles to win nearly 40 seats.At first, the results looked like something of a stalemate. The Republican Party retained and even strengthened its hold on the Senate. President Trump’s approval rating was at 45 percent, one percentage point below his percentage of the popular vote in the 2016 election. Analysts said that Mr. Trump still knew how to get Republicans “excited, interested and turn them out” and that he had “deepened his hold on rural areas.”In the days that followed, though, it became clear that Democrats had made substantial gains. Analysts I trusted concluded that this was because suburban and college-educated women issued “a sharp rebuke to President Trump” that set off a “blue wave through the urban and suburban House districts.” At first, I also believed that was the main story line.But the 2018 election was much bigger than that. It was transformative, knocking down what we assumed were Electoral College certainties. We didn’t immediately see this transformation because we assumed that Mr. Trump and the polarization in his wake still governed as before.First of all, Democrats did not win simply because white women with college degrees rebelled against Mr. Trump’s misogyny, sexism and disrespect for women. Nearly every category of women rebelled.Change in women’s vote, by party, from 2016 (vote for president) to 2018 (vote in House races).AllwomenWhite unmarriedwomen5960%5454%DEMOCRATIC5048REPUBLICAN46404341%4030Shift toward Democrats, in percentage points:20+6+1010’16’18'16’18White women witha college degreeWhite working-class women6159565144423934Shift toward Democrats, in percentage points:+13+13’16’18'16’18AllwomenWhite unmarriedwomenWhite women witha college degreeWhite working-class women61595960%565454%51DEMOCRATIC5048REPUBLICAN464044434241%4039303420Shift by these groups toward the Democrats, in percentage points:+6+10+13+1310’16’18’16’18’16’18’16’18By The New York Times | Source: Greenberg Research; women with degrees have at least four years of collegeThese conclusions are based on Democracy Corps’ election night survey for Women’s Voice Women’s Vote Action Fund and a study of the exit polls conducted for Edison and Catalist.Yes, House Democrats increased their vote margin nationally among white women with at least a four-year degree by 13 points compared with the Clinton-Trump margin in 2016. But Democrats also won 71 percent of millennial women and 54 percent of unmarried white women (who split their votes two years earlier). In 2018, unmarried white women pushed up their vote margin for Democrats by 10 points. In fact, white women without a four-year degree (pollster shorthand for the white working class) raised their vote margin for Democrats by 13 points. Overall, white women split their vote between Democrats and Republicans, but it is clear which way they are moving. Interestingly, the white college women who were supposed to be the “fuel for this Democratic wave” played a smaller role in the Democrats’ increased 2018 margin than white working class women, because the former were 15 percent of midterm voters and the latter 25 percent. Will this shift of white women be durable? Mr. Trump is the leader of the Republican Party as it heads toward 2020. Like Mr. Trump, Senate and House Republicans were animated about white males being victimized by the P.C. police. The new Republican House caucus is 90 percent white men; nearly half of the new Democratic members will be women.Second, Mr. Trump and his party maintained their principal base with white working class voters, the shift among women notwithstanding, and Democrats still need to do better. Nonetheless, Democrats got their wave in part because a significant portion of male and female white working class voters abandoned Mr. Trump and his Republican allies.In 2016, the white working class men that Mr. Trump spoke most forcefully to as the “forgotten Americans” gave him 71 percent of their votes and gave only 23 percent to Hillary Clinton. This year, the Republicans won their votes with a still-impressive margin of 66 to 32 percent. But what was essentially a three-to-one margin was deflated to two-to-one, which affected a lot of races.Change in men’s vote, by party, from 2016 (vote for president) to 2018 (vote in House races).All menWhite working-class men7170%666052%51REPUBLICAN504041%47DEMOCRATIC30322023Shift toward Democrats, in percentage points:10+7+14'16'18'16'18By The New York Times | Source: Greenberg ResearchWorking people are not fools, and Mr. Trump promised them a Republican president who would never cut Social Security, Medicare, or Medicaid; who would repeal Obamacare but provide “insurance for everybody”; who would get rid of bad trade deals and “drain the swamp,” as he never tired of saying. Instead, had Mr. Trump’s effort to replace Obamacare passed, it would have imposed vast cuts in retirement programs and driven up health insurance costs. His tax reforms were heavily weighted to large corporations and the top 1 percent. So it is no surprise that more than half of white working class men now believe that Mr. Trump is “self-dealing” and corrupt.The Democratic Senate candidates in Michigan, Wisconsin, Ohio and Pennsylvania called out the president on these issues and won by more than double digits.There is a long way to go, but 10 percent of 2016 Trump voters supported Democrats this year, and 40 percent of moderate Republicans either voted Democratic or stayed home. For Mr. Trump, this setback will be corrosive, unless he decides to acknowledge the “shellacking” and starts to actually “drain the swamp.” Don’t hold your breath.Third, Democrats made big gains because Mr. Trump declared war on immigrants — and on multicultural America — and lost. His ugly campaign succeeded in making immigration and the border a voting issue for the Republican base, according to the postelection survey I did with Democracy Corps, which asked those voting Republican why they did. “Open borders” was the top reason given for voting against a Democratic candidate. But it backfired among other voters.On Election Day, a stunning 54 percent of those who voted said immigrants “strengthen our country.” Mr. Trump’s party lost the national popular vote by seven points, but he lost the debate over whether immigrants are a strength or a burden by 20 points. Mr. Trump got more than half of Republicans to believe immigrants were a burden, but three quarters of Democrats and a large majority of independents concluded that America gains from immigration.For their part, the Democrats embraced their diversity. They supported comprehensive immigration reform and the Dreamers, opposed Mr. Trump’s border wall and opposed the separation of children from their families. They nominated African-American candidates for governor in Georgia and Florida and fought the suppression of minority voters. When it was over, the Democrats got more votes and created a new House majority that is nearly half women, and a third people of color. It also has more LBGTQ members than ever before.In short, the Republicans lost badly in the House by running as an anti-immigrant party, while the Democrats made major gains as a self-confident multicultural party.Fourth, Democrats could not have picked up as many House seats as they did in 2018 without raising their share of the vote by four points in the suburbs, which have grown to encompass 50 percent of voters. Mrs. Clinton won many of these districts in 2016, so it was clear that any further shift in the Democrats’ direction would prove consequential. But Democrats made their biggest gains not there, but in the rural parts of the country. That was the shocker.Democrats cut the Republicans’ margin in rural areas by 13 points, according to the Edison exit poll and by seven points in one by Catalist. Democrats still lost rural America by somewhere between 14 and 18 points so that left Democrats in a pickle there. That had implications for the Senate, but it shouldn’t conceal the fact that Democrats actually made progress in rural areas.In the senate races, Mr. Trump looked like a giant killer because he took out at least three incumbent Democrats. But he mainly campaigned in states that he won by large margins in 2016. The Democratic wave exposed Mr. Trump’s vulnerability and suggests a less polarized country. In the face of his divisive campaign, parts of rural and working class America peeled off.I thought it would take Mr. Trump’s defeat in 2020 for America to be liberated from this suffocating polarization, but it may have already begun.Stanley B. Greenberg (@StanGreenberg), the author of “America Ascendant,” is a founding partner of Greenberg Research and Democracy Corps. His latest book, “R.I.P. G. O. P.: How the New America is Dooming the Republican Party” will be published next year.Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.Advertisement"}