{"id": "Are Jared and Ivanka Good for the Jews?", "paragraph": "Supported byJewish communities stand more divided than ever on whether to embrace or denounce Jared Kushner and Ivanka Trump.By Amy Chozick and Hannah SeligsonOn election night in Beverly Hills, Jason Blum, the hot shot horror-movie producer, was accepting an award at the Israel Film Festival. The polls in a string of midterm contests were closing, and Mr. Blum, a vocal critic of President Trump, was talking about how much was at stake.“The past two years have been hard for all of us who cherish the freedoms we enjoy as citizens of this country,” Mr. Blum said.That’s when the crowd of mostly Jewish producers and power brokers started to chant, “We like Trump!” An Israeli man stepped onto the stage to try to pull Mr. Blum away from the microphone as the crowd at the Saban Theater Steve Tisch Cinema Center cheered.“As you can see from this auditorium, it’s the end of civil discourse,” Mr. Blum said, as security rushed the stage to help him. “Thanks to our president, anti-Semitism is on the rise.”In the weeks after a gunman killed 11 people at the Tree of Life Synagogue in Pittsburgh, in one of the most horrific acts of anti-Semitism in years, debates about the president’s role in stoking extremism have roiled American Jews — and forced an uncomfortable reckoning between Mr. Trump’s rhetoric and his daughter and son-in-law’s Jewish faith.Rabbis and Jewish leaders have raged on Twitter and in op-eds, in sermons and over shabbat dinners, over how to reconcile the paradox of Jared Kushner, the descendant of Holocaust survivors, and Ivanka Trump, who converted to Judaism to marry Mr. Kushner.To some Jews, the couple serves as a bulwark pushing the Trump administration toward pro-Israel policies, most notably the decision to move the U.S. embassy from Tel Aviv to Jerusalem. To many others, they are the wolves in sheep’s clothing, allowing Mr. Trump to brush aside criticism that his words have fueled the uptick in violent attacks against Jews.“For Jews who are deeply opposed to Donald Trump and truly believe he is an anti-Semite, it’s deeply problematic that he’s got a Jewish son-in-law and daughter. How can that be?” said Dr. Jonathan D. Sarna, a professor of American Jewish history at Brandeis University.Mr. Kushner and Ms. Trump serve as senior advisers in the White House. At a time when Judaism is under assault — the F.B.I. said this week that anti-Semitic attacks have increased in each of the last three years — they are unabashedly Orthodox, observing shabbat each week, walking to an Orthodox Chabad shul near their Kalorama home in Washington, D.C., dropping their children off at Jewish day school and hanging mezuzas on the doors of their West Wing offices.After the Pittsburgh attack, Mr. Kushner played a key role in Mr. Trump (eventually) decrying “the scourge of anti-Semitism.” And Mr. Kushner helped arrange the president’s visit to the Squirrel Hill synagogue, including inviting Ron Dermer, the Israeli ambassador to the United States to accompany them. There, in Pittsburgh, thousands marched to protest what one organizer described as the insult of the Mr. Trump’s visit.The White House has referenced Mr. Kushner and Ms. Trump’s religion to dismiss accusations that Mr. Trump’s rhetoric has emboldened anti-Semites. “The president is the grandfather of several Jewish grandchildren,” the White House press secretary, Sarah Huckabee Sanders, told reporters.Using the couple in this way has unnerved many Jews who oppose the president and say Mr. Kushner and Ms. Trump violated the sacred, if sometimes unspoken, communal code that mandates Jews take care of each other during times of struggle. “I’m more offended by Jared than I am by President Trump,” said Eric Reimer, a lawyer in New York who was on Mr. Kushner’s trivia team at The Frisch School, a modern Orthodox yeshiva in New Jersey that they both attended.“We, as Jews, are forced to grapple with the fact that Jared and his wife are Jewish, but Jared is participating in acts of Chillul Hashem,” said Mr. Reimer, using the Hebrew term for when a Jew behaves immorally while in the presence of others.For Mr. Reimer, who hasn’t spoken to Mr. Kushner since high school, one of those incidents was the administration’s Muslim ban, which prompted members of the Frisch community to sign an open letter to Mr. Kushner imploring him “to exercise the influence and access you have to annals of power to ensure others don’t suffer the same fate as millions of our co-religionists.”Leah Pisar, president of the Aladdin Project, a Paris-based group that works to counter Holocaust denial, and whose late father, Samuel Pisar, escaped Auschwitz and advised John F. Kennedy, said she found it “inconceivable that Jared could stay affiliated with the administration after Pittsburgh” and called Mr. Kushner the president’s “fig leaf.”Those kinds of accusations are anathema to other Jews, particularly a subset of Orthodox Jews who accused liberal Jews of politicizing the Pittsburgh attack and who say that any policies that would weaken Israel are the ultimate act of anti-Semitism.“Jared and Ivanka are one of us as traditional Jews who care deeply about Israel,” said Ronn Torossian, a New York publicist whose children attend the Ramaz School, the same Upper East Side yeshiva where Mr. Kushner’s eldest daughter Arabella was once enrolled. “I look at them as part of our extended family.”Even some Jews who dislike Mr. Trump’s policies and recoil at his political style may feel a reluctance to criticize the country’s most prominent Orthodox Jewish couple, grappling with the age-old question that has haunted the Jewish psyche for generations: Yes, but is it good for the Jews?To that end, even as liberal New York Jews suggest the couple would be snubbed when they eventually return to the city, many in the Orthodox community would likely embrace them. “They certainly won’t be banned, but I don’t think most synagogues would give them an aliyah,” said Ethan Tucker, a rabbi and president of the Hadar yeshiva in New York, referring to the relatively limited honor of being called to make a blessing before and after the reading of the Torah. (Mr. Tucker is also the stepson of Joe Lieberman, the first Jewish candidate to run on a major party ticket in the U.S.) “I don't think people generally honor people they feel were accomplices to politics and policies they abhor,” Mr. Tucker said.Haskel Lookstein, who serves as rabbi emeritus of the Congregation Kehilath Jeshurun, the modern Orthodox synagogue on the Upper East Side that Mr. Kushner and Ms. Trump attended, wrote in an open letter to Mr. Trump that he was “deeply troubled” by the president saying “You also had people that were very fine people, on both sides,” in response to the white nationalist riots in Charlottesville, Va.When reached last week to comment about the president’s daughter and son-in-law days after the Pittsburgh attack, Mr. Lookstein said simply, “I love them and that’s one of the reasons I don’t talk about them.”Talk to enough Jews about Mr. Kushner and Ms. Trump, and you begin to realize that the couple has become a sort of Rorschach test, with defenders and detractors seeing what they want to see as it relates to larger rifts about Jewish identity.“It’s not about Jared and Ivanka,” said Matthew Brooks, the executive director of the Republican Jewish Coalition. “People look at them through the prism of their own worldviews.”Those worldviews are rapidly changing. One in five American Jews now describes themselves as having no religion and identifying as Jews based only on ancestry, ethnicity or culture, according to Pew. By contrast, in the 1950s, 93 percent of American Jews identified as Jews based on religion.As Jews retreat from membership to reform synagogues, historically made up of political liberals who were at the forefront of the fight for Civil Rights and other progressive issues, Chabad-Lubavitch, the Orthodox Hasidic group with which Mr. Kushner is affiliated, has become a rapidly-growing Jewish movement. The growth of Chabad correlates with fierce divisions about the Israeli-Palestinian conflict and a small but growing contingent of American Jews who prioritize Israel above any other political or social issue.Mr. Kushner, in particular, has become a sort of proxy for these larger schisms about faith and Israel, according to Jewish experts. “There is a great deal of anxiety around the coming of the Orthodox,” said Dr. Sarna, the Brandeis professor. “Jared in every way — his Orthodoxy, his Chabad ties, his views on Israel — symbolizes those changes.”Mr. Kushner is the scion of wealthy real-estate developers and his family has donated millions of dollars to the Jewish community, including through a foundation that gives to settlements in the West Bank. Mr. Kushner influenced the Trump administration’s decision to move the U.S. Embassy, to withdraw from the Iran nuclear deal, and to shutter a Palestine Liberation Organization office in Washington.“You’d be hard pressed to find a better supporter of Israel than Donald Trump and Jared plays a role in that,” said Ari Fleischer, a former White House press secretary under President George W. Bush. Mr. Kushner is currently working on a Middle East peace plan expected to be rolled out in the coming months. Haim Saban, an entertainment magnate and pro-Israel Democrat, is optimistic about Mr. Kushner’s efforts. He said in an interview from his hotel in Israel that although he disagrees with some of Mr. Trump’s policies, “Jared and by extension the president understand the importance of the relationship between the U.S. and Israel on multiple levels — security, intelligence, but most of all, shared values.” That embrace has only exacerbated tensions with secular Jews who overwhelmingly vote Democratic and oppose Mr. Trump. According to a 2018 survey by the American Jewish Committee, 41 percent of Jews said they strongly disagree with Mr. Trump’s handling of U.S.-Israeli relations and 71 percent had an overall unfavorable opinion of Mr. Trump. (In response to questions for this story, a White House press aide referred reporters to an Ami magazine poll of 263 Orthodox Jews in the tristate area published in August. Eighty-two percent said they would vote for President Trump in 2020.)“To wave a flag and say ‘Oh, he’s obviously pro-Jewish because he moved the embassy’ just absolutely ignores what we know to be a deeply alarming rise of anti-Semitism and all sorts of dog-whistling and enabling of the alt-right,” said Andy Bachman, a prominent progressive rabbi in New York.In September, Mr. Kushner and his top advisers, Jason D. Greenblatt and Avi Berkowitz, hosted a private dinner at the Pierre Hotel on the Upper East Side. Over a kosher meal, Mr. Kushner, aware of concerns within the Jewish community that Israel policy had become an overly partisan issue, fielded the advice of a range of Jewish leaders, including hedge-fund billionaire and Republican donor Paul Singer and Mr. Saban, to craft his Middle East peace plan. “He called and said 'I'll bring 10 Republicans and you bring 10 Democrats,’” Mr. Saban said. The undertaking will only bring more kvetching about Mr. Kushner. Indeed, some of Mr. Trump’s most ardent Jewish supporters have already expressed their displeasure at any deal that would require Israel to give up land.“I’m not happy with Jared promoting a peace deal that’s sending a message that we’re ready to ignore the horrors of the Palestinian regime,” said Morton A. Klein, the president of the Zionist Organization of America and a friend of Republican megadonor Sheldon G. Adelson.“But …” Mr. Klein added, as if self-aware of how other Jews will view his position, “I am a fanatical, pro-Israel Zionist.”Amy Chozick is a New York-based writer-at-large and a frequent contributor to The New York Times Magazine, writing about the personalities and power struggles in business, politics and media.   @amychozick • Facebook Advertisement"}