{"id": "When Trump Phones Friends, the Chinese and the Russians Listen and Learn", "paragraph": "Supported byBy Matthew Rosenberg and Maggie HabermanWASHINGTON — When President Trump calls old friends on one of his iPhones to gossip, gripe or solicit their latest take on how he is doing, American intelligence reports indicate that Chinese spies are often listening — and putting to use invaluable insights into how to best work the president and affect administration policy, current and former American officials said.Mr. Trump’s aides have repeatedly warned him that his cellphone calls are not secure, and they have told him that Russian spies are routinely eavesdropping on the calls, as well. But aides say the voluble president, who has been pressured into using his secure White House landline more often these days, has still refused to give up his iPhones. White House officials say they can only hope he refrains from discussing classified information when he is on them.Mr. Trump’s use of his iPhones was detailed by several current and former officials, who spoke on the condition of anonymity so they could discuss classified intelligence and sensitive security arrangements. The officials said they were doing so not to undermine Mr. Trump, but out of frustration with what they considered the president’s casual approach to electronic security.American spy agencies, the officials said, had learned that China and Russia were eavesdropping on the president’s cellphone calls from human sources inside foreign governments and intercepting communications between foreign officials.On Thursday morning, Mr. Trump said this article was “soooo wrong!” and asserted that he used only government phones and “only one seldom used government cell phone.” He did not claim there were other factual errors in The New York Times’ reporting.The current and former officials said they have also determined that China is seeking to use what it is learning from the calls — how Mr. Trump thinks, what arguments tend to sway him and to whom he is inclined to listen — to keep a trade war with the United States from escalating further. In what amounts to a marriage of lobbying and espionage, the Chinese have pieced together a list of the people with whom Mr. Trump regularly speaks in hopes of using them to influence the president, the officials said.Among those on the list are Stephen A. Schwarzman, the Blackstone Group chief executive who has endowed a master’s program at Tsinghua University in Beijing, and Steve Wynn, the former Las Vegas casino magnate who used to own a lucrative property in Macau.The Chinese have identified friends of both men and others among the president’s regulars, and are now relying on Chinese businessmen and others with ties to Beijing to feed arguments to the friends of the Trump friends. The strategy is that those people will pass on what they are hearing, and that Beijing’s views will eventually be delivered to the president by trusted voices, the officials said. They added that the Trump friends were most likely unaware of any Chinese effort.L. Lin Wood, a lawyer for Mr. Wynn, said his client was retired and had no comment. A spokeswoman for Blackstone, Christine Anderson, declined to comment on Chinese efforts to influence Mr. Schwarzman, but said that he “has been happy to serve as an intermediary on certain critical matters between the two countries at the request of both heads of state.”Russia is not believed to be running as sophisticated an influence effort as China because of Mr. Trump’s apparent affinity for President Vladimir V. Putin, a former official said.China’s effort is a 21st-century version of what officials there have been doing for many decades, which is trying to influence American leaders by cultivating an informal network of prominent businesspeople and academics who can be sold on ideas and policy prescriptions and then carry them to the White House. The difference now is that China, through its eavesdropping on Mr. Trump’s calls, has a far clearer idea of who carries the most influence with the president, and what arguments tend to work.The Chinese and the Russians “would look for any little thing — how easily was he talked out of something, what was the argument that was used,” said John Sipher, a 28-year veteran of the Central Intelligence Agency who served in Moscow in the 1990s and later ran the agency’s Russia program.Trump friends like Mr. Schwarzman, who figured prominently in the first meeting between President Xi Jinping of China and Mr. Trump at Mar-a-Lago, the president’s Florida resort, already hold pro-China and pro-trade views, and thus are ideal targets in the eyes of the Chinese, the officials said. Targeting the friends of Mr. Schwarzman and Mr. Wynn can reinforce the views of the two, the officials said. The friends are also most likely to be more accessible.One official said the Chinese were pushing for the friends to persuade Mr. Trump to sit down with Mr. Xi as often as possible. The Chinese, the official said, correctly perceive that Mr. Trump places tremendous value on personal relationships, and that one-on-one meetings yield breakthroughs far more often than regular contacts between Chinese and American officials.Whether the friends can stop Mr. Trump from pursuing a trade war with China is another question.Officials said the president has two official iPhones that have been altered by the National Security Agency to limit their abilities — and vulnerabilities — and a third personal phone that is no different from hundreds of millions of iPhones in use around the world. Mr. Trump keeps the personal phone, White House officials said, because unlike his other two phones, he can store his contacts in it.Apple declined to comment on the president’s iPhones. None of them are completely secure and are vulnerable to hackers who could remotely break into the phones themselves.But the calls made from the phones are intercepted as they travel through the cell towers, cables and switches that make up national and international cellphone networks. Calls made from any cellphone — iPhone, Android, an old-school Samsung flip phone — are vulnerable.The issue of secure communications is fraught for Mr. Trump. As a presidential candidate, he regularly attacked his Democratic opponent, Hillary Clinton, during the 2016 campaign for her use of an unsecured email server while she was secretary of state, and he basked in chants of “lock her up” at his rallies.Intercepting calls is a relatively easy skill for governments. American intelligence agencies consider it an essential tool of spycraft, and they routinely try to tap the phones of important foreign leaders. In a diplomatic blowup during the Obama administration, documents leaked by Edward J. Snowden, a former contractor for the National Security Agency, showed that the American government had tapped the phone of Chancellor Angela Merkel of Germany.Foreign governments are well aware of the risk, and so leaders like Mr. Xi and Mr. Putin avoid using cellphones when possible.President Barack Obama was careful with cellphones, too. He used an iPhone in his second term, but it could not make calls and could receive email only from a special address that was given to a select group of staff members and intimates. It had no camera or microphone, and it could not be used to download apps at will. Texting was forbidden because there was no way to collect and store the messages, as required by the Presidential Records Act.“It is a great phone, state of the art, but it doesn’t take pictures, you can’t text. The phone doesn’t work, you know, you can’t play your music on it,” Mr. Obama said on “The Tonight Show Starring Jimmy Fallon” in June 2016. “So basically, it’s like — does your 3-year-old have one of those play phones?”When Mr. Obama needed a cellphone, the officials said, he used one of those of his aides.Mr. Trump has insisted on more capable devices. He did agree during the transition to give up his Android phone (the Google operating system is considered more vulnerable than Apple’s). And since becoming president, Mr. Trump has agreed to a slightly cumbersome arrangement of having two official phones: one for Twitter and other apps, and one for calls.Mr. Trump typically relies on his cellphones when he does not want a call going through the White House switchboard and logged for senior aides to see, his aides said. Many of those Mr. Trump speaks with most often on one of his cellphones, such as hosts at Fox News, share the president’s political views, or simply enable his sense of grievance about any number of subjects.Administration officials said Mr. Trump’s longtime paranoia about surveillance — well before coming to the White House he believed that his phone conversations were often being recorded — gave them some comfort that he was not disclosing classified information on the calls. They said they had further confidence he was not spilling secrets because he rarely digs into the details of the intelligence he is shown and is not well versed in the operational specifics of military or covert activities.In an interview this week with The Wall Street Journal, Mr. Trump quipped about his phones being insecure. When asked what American officials in Turkey had learned about the killing of the journalist Jamal Khashoggi in the Saudi Consulate in Istanbul, he replied, “I actually said don’t give it to me on the phone. I don’t want it on the phone. As good as these phones are supposed to be.”But Mr. Trump is also famously indiscreet. In a May 2017 meeting in the Oval Office with Russian officials, he shared highly sensitive intelligence passed to the United States by Israel. He also told the Russians that James B. Comey, the former F.B.I. director, was “a real nut job” and that firing him had relieved “great pressure.”Still, Mr. Trump’s lack of tech savvy has alleviated some other security concerns. He does not use email, so the risk of a phishing attack like those used by Russian intelligence to gain access to Democratic Party emails is close to nil. The same goes for texts, which are disabled on his official phones.His Twitter phone can connect to the internet only over a Wi-Fi connection, and he rarely, if ever, has access to unsecured wireless networks, officials said. But the security of the device ultimately depends on the user, and protecting the president’s phones has sometimes proved difficult.Last year, Mr. Trump’s cellphone was left behind in a golf cart at his club in Bedminster, N.J., causing a scramble to locate it, according to two people familiar with what took place.Mr. Trump is supposed to swap out his two official phones every 30 days for new ones but rarely does, bristling at the inconvenience. White House staff members are supposed to set up the new phones exactly like the old ones, but the new iPhones cannot be restored from backups of his old phones because doing so would transfer over any malware.New phone or old, though, the Chinese and the Russians are listening, and learning.Follow Matthew Rosenberg and Maggie Haberman on Twitter: @AllMattNYT and @maggieNYT.Julian E. Barnes contributed reporting.Get politics and Washington news updates via Facebook, Twitter and the Morning Briefing newsletter.Advertisement"}