{"id": "G.O.P. Candidates Struggling in Key Battlegrounds, With House at Stake", "paragraph": "Supported byBy Jonathan MartinANN ARBOR, Mich. — Republican leaders are increasingly worried that their candidates for governor and Senate are in political trouble across Michigan, Pennsylvania, Minnesota and other states that the party prizes, and that the difficulties could spill into House races that the G.O.P. needs to win in November to keep control of the chamber.Their concerns also extend to Democratic-leaning states like California, Illinois and Virginia, where top-of-the-ticket Republicans are running well behind in polls — allowing Democrats to focus millions of dollars of spending as well as campaign time and turnout efforts in hotly contested House districts in hopes of knocking off G.O.P. incumbents.The Republican troubles in these states reflect a confluence of factors: outgoing governors with  baggage and nominees with limited charisma and  appeal; Democratic advantages in fund-raising and on the key issue of health care; voter intensity fueled by opposition to President Trump; and a rival slate of Democratic candidates, particularly for governor, who are closing the fall race in a strong position.With polls showing the top Democratic candidates leading in these states, the favorable conditions are important to the party given the Republican edge at the top of the ticket in places like Arizona, Maryland and Massachusetts and their strong chances at winning Democratic-held Senate seats in Missouri and North Dakota, which could enable them to retain or even expand their majority in the Senate.Republicans are also focusing on winning battlegrounds like Wisconsin, Florida and Ohio, where their nominees for governor are running more evenly against Democrats. But even in Wisconsin, where Gov. Scott Walker, the G.O.P. incumbent, is battling for a third term, President Trump is coming Wednesday to try to shore up the party’s ticket, including its struggling Senate candidate, Leah Vukmir.“Governor’s races lead the off-year ticket so they work like a big snowplow, clearing the way for the party offices below them,” said Mike Murphy, a Republican strategist. “If you have a weak snowplow, a lot less gets through behind you”As the G.O.P. struggles particularly in the Midwest, which President Trump sees as perhaps the most crucial part of his base, Michigan offers a vivid illustration of a crucial political dynamic: While control of Congress and the midterm implications for Mr. Trump consume attention, it is the coattails of Democrats at the top of state tickets that could dramatically reshape American politics after 2018.In Michigan, which the president narrowly carried in 2016, the Democratic nominee for governor, Gretchen Whitmer, has become one of the year’s breakout sensations after cruising in an easier-than-expected primary and establishing a commanding general election lead. On Friday night, she campaigned in this college town with Senator Bernie Sanders to rally young voters — not because she needed help, but because Michigan Democrats now think they could flip as many as four House seats in the state and win other races to loosen the Republicans’ grip on power here.Polling by The New York Times Upshot and Siena College found that the Democratic nominee had a lead in one of those House races, while another was effectively tied.With a landslide vote, Democrats could also flip the state legislature; restock their bench with up-and-coming politicians; lock in congressional gains by undoing Republican-led gerrymandering; and pass an initiative making it significantly easier to vote by 2020 in a state that broke Democratic hearts two years ago.“I’m trying to pull every Democrat I can across the finish line,” said Ms. Whitmer, noting that she includes a plug for all her ticketmates in her stump speech. “I don’t want anyone to think that in 18 days they can go and vote for governor and their job is done.”Ms. Whitmer is facing the state attorney general, Bill Schuette, a Republican who has been weighed down by his party’s unpopular outgoing governor, Rick Snyder. Mr. Snyder has pointedly refused to endorse his would-be G.O.P. successor.Lt. Gov. Gavin Newsom of California, who is the Democratic candidate for governor there, spoke with voters after a campaign event in Huntington Beach in September.Beyond Michigan, a Democratic chain reaction down the ticket would be a significant boost in their effort to win the House, but also bolster their chances in a number of state legislative contests that — combined with the governors’ races — could cement their gains for a decade after the next round of redistricting.“The top of the ticket, whether it be governor or senator, gets the most attention and most money, and most voters to come out to vote,” said Corry Bliss, who runs the main House Republican super PAC and is deeply concerned about the drag on his candidates in states like Illinois and Michigan. “So if you’re running at the bottom of the ticket and the top is losing by double-digits, it’s very hard to make that up.”Democrats are increasingly optimistic that the difficulties of Republican candidates will dry up fund-raising and demoralize conservatives in critical battleground states like Pennsylvania and California, undermining turnout efforts on the right in an election when there are several competitive House races in those states.“When you don’t have a presidential race on the ballot, the energy at the top matters to everyone on the ticket,” said Senator Amy Klobuchar of Minnesota, a Democrat who is expected to win with ease next month, as is her party’s nominee for governor there, Representative Tim Walz.With victory close at hand — many of these top Democrats have polling leads that are beyond the margin of error — the candidates are sharing more of their time and money with House candidates and other downballot nominees to make the most of what appears to be their best midterm campaign since 2006.In Illinois, J.B. Pritzker, the billionaire Hyatt hotel heir — who leads Gov. Bruce Rauner, the embattled Republican incumbent, by double-digits — has spent $20 million on a statewide field effort that has already lifted early voting turnout in the state’s most hotly contested House districts. In Virginia, Senator Tim Kaine, who is rolling to re-election, has already done over 50 events with his state’s House candidates and is sending mail featuring Mr. Kaine and his Democratic ticketmates.And in California, Lt. Gov. Gavin Newsom, who is expected to romp in his race for governor, has focused his voter contact efforts on the nine most competitive House races and plans to return to a group of historically Republican Orange County districts for a bus tour in the final stretch of the campaign.“That’s not a traditional place where Democrats usually end their campaigns,” said Mr. Newsom, but “Orange is the new blue.”Even in states where Republican candidates for governor are competitive, down-ballot Democrats are still seeing benefits from the soaring enthusiasm on the left this year.In Georgia and Florida, House Democrats believe that the nomination of Stacey Abrams and Andrew Gillum, African-American candidates for governor, could lift turnout in a handful of Republican-held districts with significant black populations.In Kansas, the controversial secretary of state, Kris Kobach, may still win the governorship because of a third-party candidate in the race. But his polarizing candidacy, along with the lingering anger toward former Gov. Sam Brownback, has imperiled a pair of Republican-held House seats, according to The Times’s Upshot/Siena polls.The G.O.P.’s difficulties in Pennsylvania are even more acute. In addition to nominating lackluster candidates who are polling poorly against Gov. Tom Wolf and Senator Bob. Casey Jr., the party also suffered a series of House retirements and resignations and is having to run on a less favorable, court-drawn congressional map.And because Senate Democrats like Mr. Casey, Sherrod Brown of Ohio, Debbie Stabenow of Michigan and Tammy Baldwin of Wisconsin are facing easier-than-expected re-elections, according to polls, it has freed them up to raise money for coordinated committee efforts and campaign with a variety of down-ballot candidates.Hey, I’m Alex Burns, a politics correspondent for The Times. Send me your questions using the NYT app. I’ll give you the latest intel from the campaign trail.Indeed, the larger problem this year for Republicans, particularly in the industrial Midwest, is that in a series of states Mr. Trump carried or nearly won, the party failed to recruit top-tier candidates and was left with standard-bearers who aligned themselves with a president whose popularity has sagged with women and suburban voters.“The Trump effect in Republican primaries produced Republican candidates who aren’t necessarily great election candidates,” said Ed Rendell, the Democratic former Pennsylvania governor.There are some coattails for Republican candidates this year. While Representative Beto O’Rourke has electrified many Texas Democrats in his bid to unseat Senator Ted Cruz, national Republicans are hopeful that the well-funded and organized campaign of Gov. Greg Abbott can help pull some of their vulnerable House incumbents to victory.And in Utah, Mitt Romney, who is expected to win a Senate seat in a landslide, has recorded an ad to help rescue Representative Mia Love, who’s facing a stiff challenge.Yet no state may see the sort of lasting political impact from a Democratic rebound than Michigan.Mr. Trump won here with a margin of just over 10,000 votes, but his divisive presidency is clearly fueling a backlash.“I feel like I’m living in a parallel universe, I can’t believe that this country is ethically this debased,” said Cathie Longan, an activist who was making phone calls Friday in a suburban Detroit field office filled with blue-hued pamphlets for the Democratic ticket and decorated with a “Hop On The Blue Wave” banner.“I woke up the morning after the election and I actually screamed out loud,” she said.Women dominate the ranks of Democratic candidates in Michigan: in addition to Ms. Whitmer and Ms. Stabenow, the nominees for attorney general, secretary of state, the candidates in three of the four competitive House seats and over half the targeted state legislative seats are women.“The perfect response to Hillary having lost in 2016 is this all-female ticket coming back and showing that we’re not O.K. with the way women are treated in this state, we’re not O.K. with the way women are being treated nationally,” said Dana Nessel, the attorney general nominee.What also makes this year in Michigan so consequential are a pair of ballot questions that are widely expected to pass in part because of the Republican disarray.Proposal Three would restore Michigan’s straight-party ballot, enact no-fault absentee voting and allow voters to register and vote on Election Day, among other measures to make it easier to cast a ballot. Broadening voter access would be a boon to the Democrats’ presidential hopes here in 2020.Proposal Two would create an independent redistricting commission, which would take reapportionment out of the hands of the legislature.“We would have at least two more seats in the House were it not for gerrymandering,” said Representative Debbie Dingell of Michigan, who expressed surprise at how much enthusiasm there is for the measure. “People see it as a way they can take their government back.”And Democrats here see redemption this year, not just for the 2016 presidential loss but for the election that brought Republicans to power in Michigan and in much of the country.“Hopefully it’s the bookend to 2010,” said Brandon Dillon, the state party chair. “In 2010 we got our asses kicked because of health care and an unpopular president. It would be very nice to see us come back and take control again on health care and an unpopular president.”Advertisement"}