{"id": "Rhetoric, Mobs and Terror", "paragraph": "Supported byThe explosive devices were released into a toxic atmosphere created by Trump. By Charles M. BlowOpinion ColumnistThere is no way to consider the explosive devices sent to prominent Democrats and the CNN offices and not recall that Donald Trump himself has created a toxic environment by openly targeting many of these very people and entities in his overheated, overwrought rhetoric.This is not to say that there is an explicit link between the president’s rhetoric and the bombs. There is no way to know that at this point. We don’t even know yet who’s responsible for the bombs.But we can say without equivocation that Trump’s stoking of fear and riling of anger is deeply problematic and indeed dangerous.Trump doesn’t operate on an intellectual plane, but an emotional one, and the emotions he has learned to manipulate in politics are the darker ones.He learned that if you tap into people’s anger — if you can articulate it and vent it, repackage it and glamorize it — their gratitude and appreciation will be expressed as loyalty and adulation.They will forsake their morals and principles.They will forgive your foibles.They will defend you to the death.Trump said to these people that their enemies were his enemies. Everyone they saw as a threat to their cultural heritage, societal dominance and personal privilege — Muslims, Mexicans, immigrants, liberals in general — he would attack on their behalf.Ever the projectionist, Trump repeatedly encouraged violence at his campaign rallies and has recently taken to casting Democrats as a mob. In fact, his supporters are the mob.In the movie “Gladiator,” a senator says of the new emperor:“I think he knows what Rome is. Rome is the mob. Conjure magic for them and they’ll be distracted. Take away their freedom and still they’ll roar. The beating heart of Rome is not the marble of the Senate, it’s the sand of the Colosseum. He’ll bring them death — and they will love him for it.”Trump understands this, intuitively. He is not a grand strategist, but an irrational man who rose in an era of irrationality. Politics is not always about the elevation of the best candidate. Indeed, I would argue that it rarely elevates the best. But it always rewards the person who is best suited and positioned for the moment.In that way, Trump’s hatred, racism, insecurity, anti-intellectualism and grudge against the elite society that had always disdained him was perfectly suited for conservatives who were entertaining the same notions but had no one to openly champion their intolerance with effrontery.On Monday in Houston, Trump was again whipping a rally crowd into a fear frenzy with his dystopian vision of America. He said:“Democrat immigration policies allow poisonous drugs and MS-13 to pour into our country. And Democrat sanctuary cities release violent criminals from jail and straight into your neighborhoods.”[The Opinion section is now on Instagram. Follow us at @nytopinion.]As the audience chanted, “CNN sucks,” he said, “Don’t worry. I don’t like them either, O.K.?” He added:“Do you know how the caravan started? Does everybody know what this means? I think the Democrats had something to do with it.”There is no proof that the caravan of Honduran migrants traveling through Mexico toward the United States was instigated by the Democrats, and the claim is ridiculous on its face. He continued:“So as the caravan — and, look, that is an assault on our country. That’s an assault. And in that caravan you have some very bad people. You have some very bad people. And we can’t let that happen to our country.”There is no proof that there are “very bad people” in the caravan, and it is more than a thousand miles away from our border.He said: “The Democrats have launched an assault on the sovereignty of our country, the security of our nation, and the safety of every single American.”He said:“The Democrats want to replace freedom with socialism. They want to replace Texas values with Nancy Pelosi values. And they want to replace the rule of law with the rule of the mob. That’s what is happening. And the Democrats would rather destroy American communities than defend America’s borders.”He also said: “A future under Democratic mob rule would be a total catastrophe.”As ever, there were chants of “lock her up” with respect to Hillary Clinton.And he said this:“You know what I am? I’m a nationalist, O.K.? I’m a nationalist. Nationalist. Nothing — use that word. Use that word.”This is all from just one rally. He has held scores of them.This is the language in the air. This is the rhetorical backdrop as we await an investigation and answers about who sent bombs to Democrats and the CNN offices.This is the madness, fear-mongering and mendacity that must end. But it won’t. This is all Trump has. It is who he is. Without it, he doesn’t really exist.Follow The New York Times Opinion section on Facebook and Twitter (@NYTopinion), and Instagram. Charles Blow joined The Times in 1994 and became an Opinion columnist in 2008. He is also a television commentator and writes often about politics, social justice and vulnerable communities.  @CharlesMBlow • Facebook Advertisement"}