{"id": "How to Be Grateful Without Rolling Your Eyes", "paragraph": "Supported bySure, telling dinner guests what you’re thankful for can feel contrived. Do it anyway. By A.J. JacobsMr. Jacobs is the author of a recent book on gratitude.In our house, it has always been the most dreaded part of Thanksgiving. More painful than hand-scrubbing the casserole pan. More excruciating than listening to our libertarian cousin. I speak of the custom of forced gratitude — of going around the table and telling everyone what we’re thankful for.For years, the Jacobs family responses, mine included, were almost always disappointingly bland (“I’m thankful for my family”) or relentlessly inane (“I’m thankful for my Nintendo Switch.”)Still, I believed it was a ritual worth saving. Not because I am particularly sentimental. But because there are so few moments in life when we battle our brain’s built-in negativity bias.There are scientific and health benefits to gratitude, too. I’ve discovered those in the past couple of years, as I’ve been working on a book about gratitude. So I’ve been on a campaign to update the gratitude ritual, to rescue it. My strategies:Embrace six degrees of gratitude. Our meals — along with every other thing in our lives — are dependent on hundreds of people that many of us take for granted.At Thanksgiving last year, we held a family competition to see who could come up with the most obscure person on our dinner’s supply chain. My 12-year-old son thanked the farmer who grew the cranberries for the sauce (Not bad). Another relative thanked the trucker who drove the cranberries to the factory (Decent). Someone thanked the designer of the logo on the stop sign so the truck didn’t get in an accident (Getting there). My nephew thanked the miner in South America who got the copper for the wiring in the traffic lights. (Pretty good).Obscurity, and unrecognized genius, surrounds us. You know that steel can of pumpkin pie filling? Someone designed the ribbing on that can — those horizontal ridges — because it makes the can more durable and resistant to dents. Those metal clips my sister-in-law uses to keep the tablecloth in place? There’s no gravy in my lap, and I have the inventor to thank.I recently asked one of my smartest friends — a philosophy professor at Oxford — what he’s grateful for. I expected something like “the capacity for human progress” or “the fugues of Joseph Haydn.” His actual answer? “Sometimes I’m just grateful I have arms.”It’s an odd response. But I love it. Arms are, in fact, something to be grateful for. And his response points out how important it is to be thankful for things so omnipresent that they can escape our notice.I encourage my family to thank the most basic but necessary things. One of my sons thanked the laws of physics, which kept him — and our gluten-free stuffing — from floating into space. Reading the apocalyptic news, it can seem sometimes as though there isn’t much to be thankful for, current events-wise.But the good old days were not good at all. They were violent, disease-ridden, smellier — and people were more sexist, racist and homophobic. Whenever I start to mythologize the past, I repeat a three-word mantra I made up: “Surgery without anesthesia.” Be thankful for what humans have accomplished. Be thankful that President Theodore Roosevelt passed food safety laws so that we most likely won’t be poisoned by our turkey. Be thankful that you weren’t at that harvest celebration in 1621, which was far from the warm and fuzzy meal you might see in elementary-school pageants and was an event inseparable from colonialism and mass death. And for fun and games, those 17th-century revelers didn’t play Balderdash or touch football. A popular party game of the day was Kick the Shins, which is pretty much what it sounds like. You kick one another’s shins till one of you falls down. Even “Call of Duty: Black Ops 4” seems preferable.Go around the table, thanking A to Z. The first person must think of something to be thankful for that begins with the letter “A” (e.g., animal videos on YouTube featuring interspecies cuddling). The second with “B” (e.g., the “Barry” producers for casting Henry Winkler). You still may get inanities (“E is for electronics, which I hope to be playing soon”), but it will require some creativity.Sometimes, when I’m feeling down, I browse the website of the Centers for Disease Control and Prevention. While I’m still relatively healthy (despite the usual middle-age woes), I can give thanks I don’t have dengue fever or lockjaw. Warning: This strategy can backfire if you have any hypochondriac tendencies.With some discipline, you can tap into gratitude every day. There are a mountain of studies that show gratitude’s benefits: It makes you healthier, more generous, better at sleeping and less stressed. One study found that keeping a gratitude journal reduced stress an average of 28 percent for health care workers. So be thankful that gratitude is so effective.I’m well aware there are serious problems in the world. I also know my mostly healthy family is on the lucky side. But I’m still hopeful these gratitude reforms might catch on with others. After a couple of years of tinkering with this ritual, my family doesn’t dread it. Some even like it. At worst, it’s moderately painless, like cleaning a nonstick pan.A.J. Jacobs is the author, most recently, of “Thanks a Thousand.”Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.Advertisement"}