{"id": "Fear of a Black Continent", "paragraph": "Supported byWhy European elites are worrying about African babies.By Ross DouthatOpinion ColumnistEmmanuel Macron, the youthful and ambitious president of the French, likes to talk about African birthrates. In the summer of 2017, he answered a question about why there couldn’t be a Marshall Plan for Africa by calling the continent’s problems “civilizational,” and lamenting that African countries “have seven or eight children per woman.”This was attacked by some as racist, defended by others as hardheaded realism about development economics. Macron obviously felt comfortable with what he’d said, because he returned to the idea last month at a Gates Foundation conference. (Bill Gates himself has also been talking a lot lately about population control and development in Africa.) “I always say,” Macron told the assembled do-gooders, “‘present me the woman who decided, being perfectly educated, to have seven, eight or nine children.’”This time there was a specifically female response: A Catholic University of America professor, Catherine Pakaluk, posted a photo of six of her eight children under the Twitter hashtag #postcardsforMacron, and soon there was a flood of female Ph.Ds posting pictures of their broods.[Listen to “The Argument” podcast every Thursday morning, with Ross Douthat, Michelle Goldberg and David Leonhardt.]As a pro-natalist, I am in full sympathy with the Macron-tweaking mothers, but as a descriptive matter the French president is basically correct. It’s a law of modern Western and East Asian history (we’ll call it Macron’s Law hereafter) that with wealth and education birthrates fall — and fall, and fall. The existence of occasional exceptions only highlights how exceptional they are.This plunge has happened without population-control interventions as well as with them, and because Western-supported population control efforts in the developing world tended to be inhumane and not-so-mildly racist, over the last couple of decades they have fallen somewhat out of fashion, with Gatesian philanthropists and politicians alike. So why are they creeping back into the discussion? For three reasons: Because African birthrates haven’t slowed as fast as Western experts once expected, because European demographics are following Macron’s Law toward the grave, and because European leaders are no longer nearly so optimistic about assimilating immigrants as even a few short years ago.In 2004, the U.N. projected that Africa’s population would level off by 2100 around two billion. Today it projects that it will reach 4.5 billion instead. This change in the expected trend is more likely a result of sluggish economic growth than proof of an African exception to Macron’s Law — though it holds open the possibility that Africa could be such an exception. But whatever the explanation, by century’s end two in five human beings could be African.This trend would have revived a certain kind of population-bomb anxiety no matter what, but the anxiety in Europe is a little more specific than that — because over the same period, Europe’s population is likely to drop by about one hundred million. (Western Europe’s leaders are a vanguard here: Neither Macron nor Angela Merkel nor Theresa May have any biological children.) In the late 1990s Europe and Africa had about the same population; a hundred years later there could be seven Africans for every European. And the experience of recent refugee crises has demonstrated to European leaders both how easily populations can move northward, and how much harder assimilation may be than they once hoped.So Macron is not likely to be alone in his fixation on large African families. An Afrophobia that a decade ago was confined to white-identitarians is likely to become an obsession of Europe’s technocratic center as well as its nationalist parties. The fixation will be genteel and diplomatic and couched in the language of development but the upshot will be clear: We must find a way to convince African women to stop having so many babies.However, in addition to being cruel, past population control campaigns were often ineffective, so it’s likely that Macron and his successors will mostly fail in their anti-natal efforts. And even the thing that might lead to the falling birthrate they desire, rapid African economic growth, might also accelerate migration in the short term — because poor people who suddenly get richer also gain the means and opportunity to move to somewhere richer still.Which is why anyone who hopes for something other than destabilization and disaster from the Eurafrican encounter should hope for a countervailing trend, in which Europeans themselves begin to have more children. This would not forestall the near-inevitable northward migration, but it would make it easier to assimilate immigrants once they arrived — European economies would be stronger, ethnic polarization would not fall so dramatically along generational lines, and in politics youthful optimism and ambition might help counteract the fear and pessimism of white Europeans growing old alone.Of course government efforts to raise the Western birthrate, France’s included, have been no more obviously successful than Western-sponsored efforts to cut birthrates elsewhere in the world.But focusing on European fertility has at least one moral advantage over Macron’s finger-wagging at African babymaking: It’s the part of the future that Europeans actually deserve to control.Follow The New York Times Opinion section on Facebook and Twitter (@NYTopinion), join the Facebook political discussion group, Voting While Female, and sign up for the Opinion Today newsletter. Ross Douthat has been an Opinion columnist for The Times since 2009. He is the author of several books, most recently, “To Change the Church: Pope Francis and the Future of Catholicism.”\r\nYou can follow him on Twitter:  @DouthatNYT Advertisement"}