{"id": "How The Times Makes Those Addictive Election Maps", "paragraph": "Supported byunderstanding the timesEditors in our graphics department discuss how they turn vast troves of voting data into dynamic maps that help readers understand and explore election results.By Lara TakenagaIn an effort to shed more light on how we work, The Times is running a series of short posts explaining some of our journalistic practices. Read more of this series here.Your vote continues to count long after the ballots have been tallied. Databases that track election results ensure that it lives on indefinitely. What use is this raw data to the average citizen? That’s where The Times’s graphics department comes in. The team has built incredibly popular interactive maps to visualize and interpret complex voting data. In a recent interview, Archie Tse, The Times’s deputy graphics editor, and Matthew Bloch and Jasmine Lee, two other graphics editors, explain how they create interactive maps, their approach to design and their push to expand election maps to countries beyond the United States.What makes a map interactive?ARCHIE TSE Most of the maps that we create are static: You don’t zoom in; you don’t click any buttons to change them; we present the data the way it is.Interactive maps mean a different level of reader engagement. It’s a situation where the reader benefits from interacting with the page, whether that means zooming in and out of the data or selecting options to see different views of it. Do you consider the live election-results maps interactive?JASMINE LEE They’re a good example of a higher level of interactivity because you hover over the maps to see more information. A step below that would be something where you are swiping or scrolling and at each point we highlight something different on the map. We take you through these steps to make sure you see each piece of information. Who makes The Times’s interactive maps, and what skills do you need?TSE We have a core group of about 10 people in our department who have the ability to make interactive maps. Making interactive maps requires a combination of cartographic knowledge and programming and design skills. What tools and programs does your work require?MATTHEW BLOCH Interactive web maps are software programs. On The Times’s website that means using JavaScript, which has become the dominant technology for making interactive maps. In addition to writing our own JavaScript code, we use software libraries. That way we’re not building everything from scratch.TSE The bulk of what you see on our website is the product of code that we’ve written. We use some open-source libraries created by other developers around the world, and we’ve created libraries ourselves that we’ve contributed to the open-source community. What is the biggest challenge of working with interactive maps?TSE Making interactions on your phone or computer feel seamless and natural is incredibly complex, particularly because of the many types of devices and platforms that people see our content on. We spend a lot of time figuring out why a map is working on, say, the desktop and the iPhone 6 but not on the iPhone 7 Plus and Android. What obstacles does working with election-related data present?BLOCH Much of the data relating to voting precincts is controlled by local governments. When we’re trying to do a map of a particular state, it’s sometimes a challenge just to get the data.LEE One big part is getting the shapes of precincts. You can sometimes go to a county’s website and find an open data or geography section, where you can download the shapes. But that’s not always the case. You may have to contact the counties and ask them to send the information. A couple of places wanted to mail maps to us because they didn’t have them electronically. The next step is matching the precinct maps with the data.How has The Times’s approach to interactive election maps evolved?BLOCH The first election I worked on was the presidential one in 2008. One of the models for designing an interactive map then involved pretty complex interactions, like using buttons to see different views of the data. Whenever possible, we’ve tried to pare away interactions that readers may not understand by just looking at a map. Simplicity is one of our guiding principles. We also had more stand-alone interactives in the past. Along with making our graphics simpler, we now combine them with blocks of text.We’ve turned against the kind of map that just shows a lot of data and puts the burden of analyzing it on the user — though our election results maps show a bit more data because we feel it’s important to display the full outcome of elections.LEE We’ve also made space for people to explore the data. We want to give you the necessary information when you first get to the page so that, if you find that interesting, you can dig deeper.How do you come up with ideas for new interactive maps?TSE They come from a lot of different places in the newsroom, from within our department and from The Upshot, with which we collaborate very frequently. We’re always thinking about what could help readers understand the world better. What maps have been most popular with readers?TSE The “Extremely Detailed Map of the 2016 Election” was very well received. Readers really enjoyed seeing how their block voted, how their neighborhood voted. We generally try not to throw a large data set at users. But there are times when readers do want to explore, like when the data is about something very personal. Election results are a case where you see yourself in your community and you see how your community is reflected. Are there plans for the midterms or the general election in 2020 that you can share?BLOCH Our designs are largely driven by the data. We’ll see what happens on election night and then decide how to communicate that information. There’s a limit to what we can plan in advance.Are you planning to cover more international elections in the future?TSE We will do more internationally. We are heavily invested in having the most comprehensive American election maps possible. Our core audience is in the United States, but we also want to make sure that readers have an understanding of what’s happening around the world. We’re also gaining more and more international readers, so we want to make election maps for different countries and help readers in those areas understand what’s going on.A note to readers who are not subscribers: This article from the Reader Center does not count toward your monthly free article limit.Follow the @ReaderCenter on Twitter for more coverage highlighting your perspectives and experiences and for insight into how we work.Advertisement"}