{"id": "Zuckerberg Defends Company in Friday Meeting With Employees", "paragraph": "Supported byBy Mike IsaacSAN FRANCISCO — Mark Zuckerberg fiercely defended Facebook in a question-and-answer session with employees on Friday afternoon, pushing back against criticism of the company in the wake of a New York Times investigation into how it reacted to Russian influence operations.In an hourlong videoconference broadcast to Facebook offices around the world, Mr. Zuckerberg responded to questions from employees on a range of topics, from Facebook’s behavior over the past 18 months to how it should handle leaks to the media, according to three people familiar with the discussion but not willing to discuss it publicly because it was a private meeting.The idea that Facebook tried to “cover up anything” was dead wrong, an impassioned Mr. Zuckerberg said, using an expletive in his response, according to these people. Some employees responded with muted applause and cheers.The session came at a fraught time for the social network, as executives mobilized to deal with a torrent of criticism of the company. A Facebook spokeswoman declined to comment on the Friday meeting.On Wednesday, The Times reported about a struggle at the top ranks of Facebook with how to respond to Russian disinformation operations and revelations of weak data privacy protections. In particular, there was considerable tension between Sheryl Sandberg, Facebook’s chief operating officer, and Alex Stamos, the company’s former chief security officer.“Yup, Sheryl Sandberg yelled at me,” Mr. Stamos said in an opinion piece published in The Washington Post on Saturday. “I had no confidence that we’d found out everything the Russians were up to, and it was quite possible that things would get worse before we built the teams and invented the technology necessary to stop it. Sheryl — as reported in this past week’s New York Times investigation — felt blindsided by this. (She later apologized.)”The company had also hired Definers Public Affairs, a Washington, D.C. consulting firm, to seed opposition research on Facebook critics. Definers also linked George Soros, the liberal financier, to anti-Facebook groups. Facebook cut ties with the firm after The Times investigation was published.In a conference call with reporters on Thursday, Mr. Zuckerberg criticized what Definers had done on behalf of his company and said he and Ms. Sandberg were not aware of the specific work the outside firm was doing. He added that someone on the company’s communications staff probably hired Definers, although he later complimented the communications staff for their “hard work.”“In general, we need to go through all of our relationships and evaluate what might be more typical D.C. relationships and decide if we want to continue with them,” Mr. Zuckerberg said on the call.Mr. Zuckerberg said much of the criticism of his company over the past 18 months — specifically regarding election security, content moderation and disinformation — had been fair and important.Ms. Sandberg, who also attended the session, added that “I fully accept responsibility for Definers,” according to two people familiar with the conversation. “That was on me.”But Mr. Zuckerberg and Ms. Sandberg said The Times’s investigation was “completely unfair” and at times “simply not true.”Much of the discussion centered on boosting employee morale. Elliot Schrage, Facebook’s former vice president of global communications and public policy, returned to the company for the meeting on Friday.Mr. Schrage said that Facebook was in a difficult news cycle, and that things would eventually calm down, and he urged workers to keep trying to do their best and work on the company’s tough problems.Some Facebook employees indicated that they believe The Times and other news outlets are unfairly targeting the company because of its outsize influence — a sentiment shared in the session on Friday when employees asked executives what would happen to employees who leak information to the press.Mr. Zuckerberg made it clear that Facebook would not hesitate to fire employees who spoke to The New York Times or other publications. But after an employee asked whether the company should issue a report about how many leakers Facebook had found and fired, Mr. Zuckerberg played down the idea.Leaks, he said, are usually caused by “issues with morale.”Follow Mike Isaac on Twitter: @MikeIsaacSheera Frenkel contributed reporting from Los Angeles and Cecilia Kang from Washington.Advertisement"}