{"id": "‘Bohemian Rhapsody’ Tops Box Office, Overcoming Lackluster Reviews", "paragraph": "Supported byBy Gabe CohnIn the end, the words “Freddie Mercury biopic” were all prospective ticket buyers needed to hear.Fox’s “Bohemian Rhapsody,” about Mercury’s rise to fame as the lead singer of Queen, opened this weekend to an estimated $50 million in domestic ticket sales, a great figure for a film that cost about $52 million to make. The movie also brought in about $72.5 million internationally, according to Fox, for a global total of about $122.5 million.The film received a somewhat lackluster reception from critics. It holds a 60 percent fresh rating on Rotten Tomatoes, and in his review for The New York Times, A. O. Scott called it a “plodding, literal-minded, conventional affair.” The release of “Bohemian Rhapsody” also came after a long and troubled production: Sacha Baron Cohen was originally slated to play Mercury before dropping out in 2013, and the movie’s credited director, Bryan Singer, was replaced by Dexter Fletcher late in the production.But audiences interested in Mercury’s story — and perhaps in hearing Queen in theaters — were unfazed by the critical reception. A large number seem happy with their decision: The film received an A rating on CinemaScore, which polls moviegoers on opening nights.[Mama mia: Read A. O. Scott’s “Bohemian Rhapsody” review]“Bohemian Rhapsody” had no trouble beating out the No. 2 finisher, Disney’s “The Nutcracker and the Four Realms.” That PG-rated holiday film, a riff on the E.T.A. Hoffmann story, also opened this weekend and made an estimated $20 million, according to Comscore, which compiles box-office data. The young actress Mackenzie Foy stars alongside Keira Knightley, Morgan Freeman and Helen Mirren, a celebrity cast that likely helped convince some families to see a holiday movie on the first weekend of November. But the initial results were disappointing for Disney, which spent well over $100 million to make the movie.The only other newcomer in the top five was Paramount’s R-rated comedy “Nobody’s Fool,” the latest from the director Tyler Perry, which stars the comedian Tiffany Haddish. That film sold about $14 million in tickets this weekend.Advertisement"}