{"id": "As Merkel Eyes Exit, Nervous E.U. Wonders Who’ll Take the Stage", "paragraph": "Supported byBy Steven ErlangerBRUSSELS — The European stage Angela Merkel commanded for so long and so effectively may be cracking, if not collapsing. She has been the poster woman for Europe’s democratic center, but the center is imploding. She and Germany have been a symbol of stability, but now even Germany is seen as politically unstable.But the prospect of her departure — she announced this week that she will not run for another term as the German chancellor — has nonetheless created a degree of panic at the core of the European Union.Ms. Merkel may be becoming more unpopular at home, and her influence over others may be waning. But to those who believed — and worked for — the dream of an ever-closer union, Ms. Merkel was considered fundamentally reliable, decent and committed to Europe and its values. She stood as a bulwark against the strutting populists who now run countries as varied as Italy, Hungary and Poland.What Europe will do without Ms. Merkel is no small question, especially when nationalism is rising and Europe’s politics seem to be reorganized not along the usual left-right spectrum, but rather around who is for Europe, and who is against it.“She provided the sense that someone was in control and could be counted on,” said Jan Techau, the Berlin-based director of the Europe program for the German Marshall Fund. “She gave the assurance that Germany was the reserve power in Europe on which you could depend. While she made mistakes, you could rely on Merkel even if you didn’t like her.”Who can act as a counterbalance to the forces tearing at the bloc’s unity in her eventual absence — Ms. Merkel has said she would finish her term that ends in 2021, though that seems doubtful — is suddenly an urgent discussion.Tomas Valasek, the director of Carnegie Europe, said that Ms. Merkel “created European consensus out of nothing,” and everyone wonders, “My God, who will do the job for her?”Emmanuel Macron, the young president of France, is “now the default leader of Europe, the big hope,” Mr. Techau said. “He’s the last one with a strong mandate and an instinct for the right thing.”But for now at least, before European parliamentary elections in May, Mr. Macron, unpopular at home, has no representatives in the European Parliament. And his ideas for reform of the bloc and the eurozone, laid out with such fanfare in September 2017, have gotten little if any traction.The problem for Mr. Macron was, and remains, that he is not strong enough on his own to push through his ambitious vision of ‘‘more Europe.’’ He needs German support.On paper Ms. Merkel has committed to support some of Mr. Macron’s ideas for eurozone reform and his call for a new start in Europe. If she was lukewarm to some of his other proposals — like the idea of empowering a European finance minister — Ms. Merkel did at least provide a reasonably like-minded partner at the core of Europe.Any Merkel successor is unlikely to be any more supportive of Mr. Macron’s ideas, and will have a lot less stature in Brussels than the chancellor has earned after what have been some 102 European summit meetings since she took power in 2005.In any case, the rest of this year will see little progress, notes Josef Janning of the European Council on Foreign Relations in Berlin, because “she’s a very lame duck until a new party leader is elected, without carte blanche to move in Europe.”All of that portends badly for buttressing European Union machinery that could help the bloc head off another financial crisis, or at least weather one. “2018 was supposed to be the year of reform,” Mr. Janning said. “But nothing much has happened except trying to solve one crisis after another.”Ms. Merkel’s failure to do more in all these years to secure the institutional future of the euro will be a lasting mark against her, Mr. Techau believes.But her consensus-minded pragmatism was crucial to the passing of the Lisbon Treaty that governs bloc relations, to the decision to keep Greece inside the eurozone against strong opposition, and to the Western response to the Russian annexation of Crimea and the sanctions that followed.While a reluctant leader, Ms. Merkel has provided a dignified but firm response to both President Vladimir V. Putin of Russia and to President Trump, who have both tried to provoke her.Some European leaders, of course, will be glad to see her go. Ms. Merkel’s critics note that her hard line on enforcing austerity during the financial crisis and her decision to let a million migrants into Germany may have helped fuel the populist backlash that is now Europe’s biggest challenge.The Polish politician Jaroslaw Kaczynski has demonized the German chancellor over the migration issue and her support for the Nordstream II pipeline from Russia, and the Greeks blamed her for all but strangling their country financially.Hungary’s prime minister, Viktor Orban, has set himself up as the anti-Merkel for European elections in May, and along with the new Italian populist leaders, has been critical of the sanctions on Russia but has so far not blocked their renewal.All the countries of Central Europe were opposed to Ms. Merkel’s initial welcome of refugees and migrants and her efforts to spread them around. But as Mr. Valasek, the Carnegie Europe director, points out, the Czechs and Slovaks appreciate her financial rigor, and German investment in Central Europe has been crucial to the region’s economy.Mr. Trump and Mr. Putin may be glad when she goes, as well.Mr. Trump has always had issues with Germany, especially over trade and the German devotion to multilateralism. “But with Merkel it seems to be worse, almost personal, the way she avoids open confrontation and sticks to her principles,” Mr. Valasek said.‘Mr. Trump,” he said, “will be relieved, but the fundamentals of the relationship won’t change. And I think Putin will be delighted. The staying power of the sanctions against Russia were her personal triumph.”There will be continuing uncertainty as to how long Ms. Merkel will be able to continue as chancellor, despite her strong wish, as Mr. Janning said, “to hand over the job to someone who has won it in an election.” Ms. Merkel, who ran only reluctantly for a fourth term after the election of Mr. Trump, “will hand it over in dignity to an elected successor and not be pushed out by her party,” he said.But new elections could come faster than she now expects.Writing in the Süddeutsche Zeitung, Mattias Kolb said that given all the challenges facing the European Union, “one can only hope that Chancellor Merkel and her new partner who heads the conservative party are able to work together and make clear what is at stake for Germany” in next year’s European election.“With her departure,” he wrote, “a politician is leaving who had the ability to speak at eye level with Presidents Xi, Trump and Putin, and always represented the position of the E.U. It will take time before her successor reaches such standing.”There are worries about Ms. Merkel’s position, somewhat thrust upon her, as the defender of Western values and the international order, especially in the face of the challenges from Mr. Trump, Mr. Putin and the Chinese leader, Xi Jinping. Those were expressed in a Twitter message by Richard N. Haass, head of the American Council on Foreign Relations.“The Merkel era is close to ending, leaving the West and the post-WW2 int’l order w/o a leader,” he wrote. “The US of @realDonaldTrump has abdicated. The UK is distracted. Canada lacks means. Macron is too weak. Bodes poorly for stability, prosperity, freedom.”But Ms. Merkel has been badly weakened, too. And as Mr. Valasek suggests, her leaving office “may in fact take some steam out of the populist wave.”“The zeitgeist is getting someone else in place,” he said. “So it’s possible when the leader leaves who looms largest, since 2005, and represents the largest E.U. country, this might have salutary effect on the restlessness of the masses in getting out the elite no matter what.”But one thing seems sure. Ms. Merkel will not then take on a leading European role, Mr. Janning said.“She knows how ugly that game is and how little respect current presidents and prime ministers have for former leaders,” he said. “She has no interest in being the assistant to self-seeking leaders.”Advertisement"}