{"id": "The Bearded Seal My Son May Never Hunt", "paragraph": "Supported byInupiat have sustained themselves with these seals for thousands of years in the Bering Sea. Climate change threatens this tradition.By Laureli IvanoffMs. Ivanoff is a writer. UNALAKLEET, Alaska — It’s October and we haven’t yet had a frost. The ground is still soft. When my grandpa was little, ice anchored to the shore would begin to form at this time of year. But last year that didn’t happen until around March and it melted soon after. We are Inupiat, northern indigenous people with communities from Alaska to Greenland. I had always thought the cold was necessary for the ways we relate to this earth. But we may have to learn to live without it. Last winter, there was less ice in the Bering Sea than any winter since the start of record-keeping in 1850.Scientists from the National Oceanic and Atmospheric Administration conducted a bottom-trawl survey in the summer and found that a large cold pool of water that has historically formed southwest of the fishing community I call home was gone. Sandwiched between Russia and Alaska, the cold-water pool, or curtain, is created when the sea ice melts during the summer, making a natural barrier in the Bering Sea. The creatures in the part of the sea north of the barrier are usually cold-water fish like small cod and the mammals that eat them. Larger Pacific cod and pollock and creatures like sea lions typically remain in the south. Without the cold-water barrier, these southern fish appear to be moving farther and farther north. When a scientist told me this news, my stomach got heavy. We need the northeastern Bering Sea to stay cold so the creatures the Inupiat traditionally rely on can thrive. We couldn’t go hunting last spring because there wasn’t enough ice cover in the Norton Sound, an inlet of the Bering Sea. Every May, when the ocean ice begins to melt and break up, my husband, my daughter and I look forward to a call from my dad or my brother: “Can you be ready in an hour?” We excitedly make snacks and fill a thermos, grab guns and knives, put on our snow pants, parkas and boots, and meet at the boat.We head out to the Norton Sound in search of solid ice pans where the large bearded seals we call ugruk rest, molt, give birth and nurse pups. According to archaeologists, Inupiat have hunted marine mammals here for more than 2,500 years.Some years, those large bearded seals lie less than a mile from town. In other years, we travel more than 20 miles. No matter the distance, my dad and brother have studied the winds and can tell whether it’s safe to take the 20-foot boats out in the open ocean.And we love it. The water glistens the air is clear and so are our senses as we scan for gray masses on the ice pans.Ringed seals, small Arctic seals with circles scattered on their back hair, pop their heads out of the water, studying their surroundings and smelling the air. Sometimes they bob right back under. They’re like friends, enjoying the ocean with us. It feels good to see their expectant faces, their big, round, watery eyes. Sometimes small flocks of snow geese stand on ice pans. We boat up, Dad ready with the shotgun. He shoots and we retrieve the geese that fall. Later, while we picnic on the beach, one of us will pluck them and white feathers will blow against the black, rocky shore.Always, the auklets fly. They’re black, round birds that don’t seem to care about our presence. The ocean is theirs; they fly with purpose, so naturally, so confident and effortless. Now and then we see the long neck of a cormorant, or the colorful beak of a puffin. We continue our search for ugruk, grateful to share the moments on the ocean with these quiet, confident and beautiful creatures.And then we see it, a big mammal lazing on the ice. Someone grabs the binoculars to look for its characteristic orange face. We slowly get closer, but the animal is spooked. It wakes — its head lifts up and the back flipper moves. My brother fires. The head drops. The seal lies there, inert. And we feel gratitude to it. The guys begin to cut the flippers and the tail. They remove the blubber that will be used for oil. They remove the organs, the ribs, they rinse the qiaq, or intestines, in the salty ocean water. When only the head remains, we open its mouth and pour water between its sharp teeth as a thank you. An act done for millenniums, it ensures the spirit of the animal is healthy in its afterlife. It signals that we respect the animal and its spirit. It ensures the animal will return.In the spring, while I was seven months pregnant with our son, Inuqtaq, my husband asked me, “What do we want him to know?” I appreciated his question — forward-thinking, intentional. He’ll be a good dad. “I want him to learn how to boat out in the ice,” I said with a smile in my belly and on my face. “I want him to know how to read the wind, the current and movement of the ice like his grandpa and uncle. I want him to be able to bring us out ugruk hunting when he’s older.” Teaching Inuqtaq how to hunt would ensure we’d eat the food that feeds more than our bodies.Because the indigenous experience is one of loss. My community, like others around the world, has lost a lot: Language. Ceremonies. Dances. Songs. Ways of connecting to the earth, and to one another. We lost ways of nourishing ourselves. Inuqtaq hunting ugruk was going to be a life-giving act of intentional decolonization, our way of keeping alive a simple custom that’s become sacred. It was going to be his way of connecting to his uncle, his grandpa. His way of appreciating the waters. His way of grounding himself, connecting to the Inupiat who hunted the waters of the Norton Sound for millenniums. His way of knowing where he comes from. Instead, he has inherited a warming ocean with encroaching cod and pollock, species not previously seen in large numbers by our hunters and fishers. An ocean changing so rapidly that the auklets, puffins and other seabirds are dying and washing up on Alaska shores in alarming numbers. He has inherited a Norton Sound that, I fear, is becoming too warm for ice to form and ugruk to inhabit.Inuqtaq was supposed to learn how to approach the ice pans. He was going to watch the currents, gauge the winds and ice movement so the boat and its passengers aren’t trapped by the ever-moving floes. He was going to shoot, to butcher, to clean and braid the intestines. I looked forward seeing him give water to an ugruk and slip its head and spirit back to the ocean.I hurt for him. And for my family and our stomachs and spirits.My son, not yet crawling, may never harvest an ugruk for his family. His experience is already one of loss. But I remember our values. Our ways of being. Though the earth changes, it is still giving. Providing. Nurturing. Inuqtaq will still learn respect for what gives life. I hope the rest of the world quickly adapts and also respects the earth — as we have for millenniums and will continue to do. Laureli Ivanoff (@laureliivanoff) is a writer.Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.Advertisement"}