{"id": "Douglas Rain, 90, Shakespearean and Voice of Computer Named HAL, Dies", "paragraph": "Supported byBy Neil GenzlingerDouglas Rain, who performed for 32 seasons with the Stratford Festival in Ontario but was perhaps most famous for one faceless movie role — the voice of the HAL 9000 computer in Stanley Kubrick’s landmark 1968 film, “2001: A Space Odyssey” — died on Sunday in St. Marys, Ontario. He was 90.The Stratford Festival announced his death.“Douglas shared many of the same qualities as Kubrick’s iconic creation,” Antoni Cimolino, the festival’s artistic director, said. “Precision, strength of steel, enigma and infinite intelligence, as well as a wicked sense of humor. But those of us lucky enough to have worked with Douglas soon solved his riddle and discovered that at the center of his mystery lay warmth and humanity.”Mr. Rain was well known to audiences at the Stratford Festival, where he appeared in its inaugural production, “Richard III,” in 1953, playing the Marquess of Dorset and Tyrrell and serving as understudy to Alec Guinness in the title role.What turned out to be, in a sense, a career-making job came along in 1960, when Mr. Rain narrated a Canadian documentary about astronomy and space called “Universe.” It caught Mr. Kubrick’s attention; he is said to have watched it scores of times. And when he was having trouble finding a voice that he liked for HAL 9000 — the onboard computer on a spaceship carrying astronauts on a mysterious mission — he thought of the documentary’s narration.“2001” had already been shot, and various concepts for the voice of HAL had been tried. At one point the computer was envisioned as female. The actor Martin Balsam recorded HAL’s lines but was deemed not quite right. During filming, the British actor Nigel Davenport read the lines off-camera for a time for the benefit of Keir Dullea and Gary Lockwood, who played the astronauts, and then Mr. Kubrick had an assistant director, also British, do it.Mr. Kubrick, not satisfied with any of those, sought out Mr. Rain. They met at a recording studio outside London. Mr. Rain recorded his lines in a day and a half, with Mr. Kubrick, who died in 1999, explaining the scenes to him and giving him only the sparsest of directorial notes.Mr. Rain’s rendition of the lines (“I’m sorry, Dave, I’m afraid I can’t do that”) was dispassionate in a way that was both soothing and unsettling. His readings were cool to the point of being chilling, especially as the story moved along and HAL became malevolent.Gerry Flahive, a former documentary producer for the National Film Board of Canada who interviewed Mr. Rain in 2014, and who has written several articles about how the HAL voice has influenced the sound of artificial intelligence in the age of Siri, said Mr. Rain was not starry-eyed about his involvement with “2001.”“Rain loved to immerse himself in the development of the roles he played, so the quick recording session with Stanley Kubrick, which gave him no context for the character of HAL and no collaboration with other actors, along with the director’s seemingly flip decision to cast him at almost the last minute, left him unimpressed with the whole experience,” Mr. Flahive said by email.“He said to me in 2014, ‘If you could have been a ghost at the recording you would have thought it was a load of rubbish.’ Despite its notoriety and his famous connection to it, Rain never saw ‘2001: A Space Odyssey.’ ”A memorial to those who lost their lives in 2018Douglas James Rain was born on May 9, 1928, in Winnipeg, Manitoba. His father, James, was a railroad switchman, and his mother, Mary Crichton McIntyre, was a nurse.He studied at the University of Manitoba, from which he received a bachelor’s degree in 1950, and the Banff Center for the Arts. He also spent a year at the Old Vic School in London before returning to Canada to join the fledgling Stratford Festival.Within a few years he was playing major roles there, including Iago in “Othello” in 1959, the title role in “King John” in 1960 and Edgar in “King Lear” in 1964.Howard Taubman, reviewing “Henry IV, Part 1” at Stratford in 1965 for The New York Times, said that Mr. Rain, in the role of Henry, Prince of Wales, “performs with a youthful dash in the early scenes and then turns gallant in the later ones with equal fervor.”Mr. Rain appeared several times on Broadway. His performance in “Vivat! Vivat Regina!” in 1972 earned him a Tony Award nomination as best featured actor in a play.He was also seen in numerous television shows and several other movies, including “2010: The Year We Made Contact,” a sequel to “2001” in which he reprised the role of HAL. His was also the voice of the computer in Woody Allen’s “Sleeper” in 1973.Mr. Rain’s marriages to Lois Shaw and Martha Henry ended in divorce. He is survived by two sons, David and Adam; a daughter, Emma Rain; and a granddaughter.In a 1981 interview with the Canadian newspaper The Globe and Mail, Mr. Rain recalled “Universe,” the documentary that led to his “2001” fame.“It was a very low-budget affair with Ping-Pong balls, and the sun, as I recall, was played by a tomato,” he said. “Actually, it came off as very impressive on the screen.”His appeal to Mr. Kubrick was often attributed to the dialect his voice generally fell into, something called Standard Canadian English.A University of Toronto linguistics professor, Jack Chambers, once explained the appeal.“You have to have a computer that sounds like he’s from nowhere, or, rather, from no specific place,” he once said. “Standard Canadian English sounds ‘normal’ — that’s why Canadians are well received in the United States as anchormen and reporters, because the vowels don’t give away the region they come from.”The American Film Institute once listed the 50 greatest movie villains. HAL came in at No. 13.Advertisement"}