{"id": "Another Trump Scoop, a Giddy Reaction and a Reporter Under Fire", "paragraph": "Supported byBy Michael M. GrynbaumWASHINGTON — Jonathan Swan could not sleep.It was 4 a.m. last Wednesday, and Mr. Swan, the star White House correspondent for the upstart news outlet Axios, was tapping out a Slack message to his colleagues.“I wish I could redo that moment,” Mr. Swan wrote, according to a copy obtained by The New York Times. “I’m sorry, because you all have to work at Axios and bear whatever reputational damage I do to the company.”Hours earlier, Mr. Swan, 33, had done what he usually does, the thing that turned him from an obscure Australian striver into a uniquely Washington figure of envy, fascination and contempt: he landed a big story. In an interview posted Tuesday, Mr. Swan had cajoled President Trump into acknowledging that he wants to end automatic citizenship for immigrant children born in the United States.Like other Swan scoops — Nikki Haley leaving her job; the withdrawal from the Paris climate accord; “executive time” — this one sent newsrooms scrambling. But online, disgust among liberals at the president’s policy plans quickly morphed into disgust with Mr. Swan.Why did a video clip of the interview show him smiling so gleefully as Mr. Trump confirmed his reporting? Why was he “excited to share” the news as a preview of Axios’s new HBO show, rather than a policy with real-world, possibly devastating impact? Why didn’t he challenge Mr. Trump’s bogus claim that no other country offers birthright citizenship? (At least 30 others do.) One columnist called him a “bootlicker”; another went with “the ne plus ultra of media toadying.”To cover Mr. Trump’s White House is to play in a treacherous arena. But Mr. Swan has struck a bigger nerve than most.He has scaled journalism’s most competitive beat with brute force (competitors say his calendar is booked weeks ahead); a TV-ready persona (he is a regular on the cable circuit); and a truffle-pig’s nose for news. “He’s probably the most plugged-in person in Washington,” said Sally Quinn, the Washington journalism doyenne and a friend.Still, his rise has come with accusations of coziness: that he favors access over accountability; that he irritates the White House, but rarely infuriates it. Many journalists here have lucrative TV deals (including at The New York Times), but some grumble about Mr. Swan’s gigs as a paid corporate speaker, including a roughly $20,000 appearance at Goldman Sachs that other news organizations would prohibit for their reporters.That Mr. Swan works for Axios, the rapid-fire news site founded by the Politico creators Mike Allen and Jim VandeHei, brings its own complications. Its stripped-down version of journalism (motto: “smart brevity”) means its articles are presented as bullet points that can negate nuance, with headlines that can hype.All of which places Mr. Swan at a sticky nexus of journalistic ethics and best practices in an era when the audience for White House reporting has never been bigger — and the judgments never harsher. Ratings and subscriptions are up, and reporters become household names, but they are often denounced as “fake news” by the right and as brown-nosers by the left.“How do you practice insider journalism with an administration that a large share of the country is rooting for, regardless of the truth of the president’s claims, and that another large part thinks is morally repugnant?” said Ben Smith, editor in chief of BuzzFeed News (and a former employee of Mr. VandeHei’s). “That is a really hard challenge.”For all the slings and arrows sent his way, Mr. Swan, who declined to comment for this article in the wake of last week’s dust-up, has lived his own American dream.The son of Norman Swan, a prominent television journalist in Australia, he arrived here in 2014 after a promising career in the Canberra trenches, where among other scoops he discovered video of an Australian senator hurling the feces of a kangaroo.On a visa for a congressional fellowship, he spent nearly a year being rejected for reporting positions until landing a job at The Hill. “I probably interviewed five or six hundred people in my life, and I just knew right away that he was going to be a great reporter,” said Bob Cusack, the editor in chief.Sources and competitors of Mr. Swan, many of whom spoke on the condition of anonymity because, well, it’s Washington, described a hustler and charmer with a herculean work ethic, often squeezing in four source meetings a day. “He seemed drawn to me,” recalled Ms. Quinn, who met him at an Axios party at Nobu. “He asked me to dinner.”Over an Italian meal, Ms. Quinn said, she discovered “a special, exceptional person.” She added, “When he’s talking to you, he never looks bored or distracted in any way. He wants to know everything, but he’s also genuine in talking about himself and his life and his hopes and dreams.”Sometimes, his eagerness can backfire.On Sept. 24, political journalists were thrown into a tizzy when Mr. Swan reported that Rod Rosenstein, the deputy attorney general, had verbally resigned. The fate of the special counsel’s Russia investigation seemed at stake. Networks broke in with special reports as their journalists tried to match the news.Six weeks later, Mr. Rosenstein is still in his post. It emerged that while Mr. Rosenstein had indeed offered his resignation, nobody had accepted it. Mr. Swan later wrote that he “screwed up by giving it a certainty it didn’t warrant,” and Axios clarified its article.In a hair-trigger news environment, the episode revealed the power and peril of Mr. Swan’s position. It also renewed questions about Axios’s approach to news.Introduced in 2017 and pronounced “ACKS-ee-ohs” (its founders wanted “ack-see-US,” until eventually realizing that nobody else said it that way), the site says it strips away the flab and filler of traditional journalism for busy readers.But critics say it presents articles with little context — political, ethical or otherwise — an approach that can ring hollow for some readers who are in the grips of an existential moment for the country.Mr. VandeHei, who faced similar criticism when he started Politico, rejected that notion.“Journalists have a bad, bad habit of equating length with substance and depth,” he said in an interview. “If you look at the architecture of our site, the whole idea is to tell you what’s new, why does it matter, and give you the power to go deeper.” Politico alumni work at a host of prestigious publications, including The Times. “Three to five years from now, there will be a lot more people writing the way we do than the old way,” Mr. VandeHei said.Mr. Swan is the piston of the Axios engine; Mr. Allen likes to call him “bionic.” But that has made him a target for critics of his employer. His Goldman Sachs appearance, though cleared with management, was considered unseemly by rivals, and it echoed past criticisms that Mr. Allen at Politico was too cozy with advertisers. “We’ve got lots of people who have true subject matter expertise and we want to share that,” Mr. VandeHei said.The HBO series on Axios, set to begin Sunday night, brings a new level of exposure for Mr. Swan, and it was the peg for the 70-second clip on Tuesday featuring his newsmaking moment with the president. “Jonathan, I’m impressed,” Mr. Trump says in the clip, after Mr. Swan raised the issue of birthright citizenship. “Good guess,” the reporter replied, tapping his head.The exchange was skewered online, though it was the kind of byplay that, off-camera, is typical in interviews. Reporters want sources, even a president, to feel comfortable and keep talking. In his late-night Slack message last week, Mr. Swan, who wrote that he had been trying to confirm the immigration news for weeks, told colleagues that “my brain popped.”“I’m not used to having my facial expression recorded,” he wrote, adding, “I shouldn’t have been surprised given it’s an inflammatory immigration question and we’re a few days out from the midterms, but what you saw was authentic surprise.”Three current and former Trump White House officials praised Mr. Swan’s fairness, even as they acknowledged his coverage was often unfriendly. One person said that the White House canceled a presidential interview with Axios after Mr. Swan published a tough piece on the commerce secretary, Wilbur Ross, and his penchant for snoozing in meetings.Mr. Swan’s foreign origins have also been wielded against him. Stephen K. Bannon, the former White House chief strategist, recalled Mr. Swan once calling him for comment on a negative story. “O.K., killer, remind me again of your visa status?” Mr. Bannon replied.Peter Hartcher, Mr. Swan’s former editor at The Sydney Morning Herald, called him “a naturally exuberant human being,” saying in an interview: “At first blush you think, ‘Who does this guy think he’s kidding?’ But it’s completely natural.”“From kangaroo turds to Donald Trump,” Mr. Hartcher added. “He’s come quite a long distance, hasn’t he?”Friends say that Mr. Swan has ambitions to write long-form pieces. For now, though, he is happy at his station: He recently renewed his contract at Axios through mid-2021. He also has equity in the company, which has raised roughly $30 million from major investors like NBC, Jeffrey Katzenberg and Laurene Powell Jobs.As for Mr. Swan’s tough week, his friends are standing by him. “I’d like to have Swan with me for the rest of my life,” Mr. VandeHei said. And Ms. Quinn said that she “didn’t quite understand the backlash.”“He’s very sweet, I think he’s genuine,” Ms. Quinn said. “And of course he’s ambitious. Tell me who isn’t, you know?”Advertisement"}