{"id": "Synagogue Suspect’s Guns Were All Purchased Legally, Inquiry Finds", "paragraph": "Supported byBy Richard A. Oppel Jr.The man accused of the Pittsburgh synagogue shooting, Robert Bowers, legally purchased the guns he used to kill 11 people in what is believed to be the deadliest attack against the Jewish community in the United States, according to the federal authorities.Officials have said Mr. Bowers used four guns — an AR-15 assault rifle and three Glock .357 handguns — in his shooting spree at the Tree of Life synagogue in Pittsburgh on Saturday morning.An investigation has concluded that the guns were “acquired and possessed legally by Bowers,” the Philadelphia office of the Bureau of Alcohol, Tobacco, Firearms and Explosives said on Tuesday.Mr. Bowers did not fall into any category barred from gun ownership under federal law, including felons, convicted domestic abusers, dishonorably discharged veterans, or people adjudicated to be mentally ill or subject to certain restraining orders.He also had a handgun license, an A.T.F. spokeswoman, Charlene Hennessy, said.Ms. Hennessy said the A.T.F.’s investigation found that Mr. Bowers owned 10 guns in total, all purchased and possessed legally: the four found at the synagogue; three handguns and two rifles recovered from his residence; and a shotgun recovered from his car outside the synagogue.[Read: How variants of the AK-47 and its American response, the AR-15, became the weapons of choice for mass shootings.]The shooting in Pittsburgh has prompted gun-control proponents to question whether someone so boiling with rage and religious hatred should have been able to acquire a small arsenal that included a civilian version of the military’s primary combat rifle.Among other inflammatory statements he made online, Mr. Bowers, 46, referred to someone who had criticized neo-Nazis as an “oven dodger,” and he said that “Jews are the children of Satan.”Hours after the shooting, former President Barack Obama exhorted people to fight the rise of anti-Semitism and tweeted: “We have to stop making it so easy for those who want to harm the innocent to get their hands on a gun.”There are no laws in Pennsylvania that would have prevented Mr. Bowers from owning the guns, including the powerful assault weapon that confronted the police who first responded to the shooting.In 1993, the city councils of both Pittsburgh and Philadelphia banned assault weapons within their city limits. But the state Legislature responded by passing a law that effectively repealed the ordinances.A major push was also made this year in Pennsylvania to pass a so-called red flag law that would allow the police or relatives to petition a judge to temporarily take weapons away from people who appear to be a threat to themselves or others, even if they have not been adjudicated mentally ill.A dozen states have enacted such laws, most of them after the mass shooting at Marjory Stoneman Douglas High School in Parkland, Fla. that killed 17 people in February. But an effort to do so this year in Pennsylvania stalled after resistance from the National Rifle Association.It is unclear whether any family members or law enforcement were aware of Mr. Bowers’s anti-Semitic screeds on social media or his weapons. But gun-safety advocates say the nature of some recent acts of violence underscores the need for tighter firearms restrictions.“When you combine heated, divisive political rhetoric with easy access to lethal weaponry, the possibility of these kinds of incidents happening is even more troubling,” said Adam Skaggs, the chief counsel of the Giffords Law Center to Prevent Gun Violence.The weapons, ready amplifiers of rage, allow a few people to kill scores and menace hundreds, and fight head-to-head against modern soldiers and police forces.President Trump said he believed the nation’s gun laws had “little to do” with the shooting in Pittsburgh and suggested that placing armed guards inside the synagogue might have prevented the massacre.While the authorities have not provided other details of Mr. Bowers’s rifle, the AR-15 is a civilian version of the military’s M16 and the M4 carbine, the primary combat weapons carried by soldiers and Marines.The difference is that an AR-15 cannot fire in “burst” mode — which discharges three rounds with one trigger pull — or in full automatic mode, where the weapon fires until the trigger is released or the ammunition runs out. It fires one bullet at a time.But it is a powerful weapon: light, easy to hold and to fire, with limited recoil, its bullets shooting out of the muzzle more than twice as fast as most handgun rounds. The standard AR-15 magazine holds 30 bullets and can be swapped out quickly, allowing a shooter to fire more than a hundred rounds in minutes.The AR-15 and its variants have become the gun of choice in the deadliest mass shootings in recent years. Congress outlawed the manufacture of assault weapons in 1994, but lawmakers allowed the ban to expire in 2004.The power of the rifle used in Saturday’s massacre was chillingly revealed in frantic calls over police radio as the killing unfolded.“We’re under fire, we’re under fire. He’s got an automatic weapon. He’s firing out of the front of the synagogue,” came one call over the police radio. “We are pinned down by gunfire.”Many shots were discharged inside, the authorities said.“There were casings everywhere,” said Dr. Karl Williams, the chief medical examiner of Allegheny County.Advertisement"}