{"id": "An Armistice Trip Marked by Controversy ", "paragraph": "Supported bylettersReaders criticize the president’s failure to attend a ceremony in France because of a light rain and lament the elusiveness of a lasting peace.To the Editor:Re “‘America First’ Draws Rebuke at Ceremony” (news analysis, front page, Nov. 12):This Veterans Day, as we celebrated memories of those who served, suffered and died for freedom, my disappointment in a president who would not attend an international commemoration of soldiers who died in World War I because of a light rain could not be greater.President Trump was scheduled to pay tribute at a ceremony at the Aisne-Marne American Cemetery in Belleau, France, but the White House indicated the trip was canceled because of “scheduling and logistical difficulties caused by the weather.”Soldiers in that war, particularly those on the front line in the trenches, were surrounded by overflowing latrines, rotting food, rats, flies and maggots. The spread of disease was rampant. The winter of 1916-17 was extremely cold, and trenches were flooded, sometimes waist-high. Men suffered from exposure and frostbite.Donald Trump could not make it to a ceremony honoring these men because of a light drizzle. Shameful!Kathryn KleekampSandwich, Mass.To the Editor:It comes as no surprise that during his trip to Europe, President Trump — so ignorant of the history of his country, so indifferent to the exertions and sacrifices of its soldiers, so oblivious to the costs of war and the blessings of peace, so padded, pomaded and pampered — could not be bothered to attend a memorial service at the Aisne-Marne American Cemetery or the subsequent Paris Peace Forum.And it was just as well: He would have had nothing thoughtful to offer at a conference on peace, and the presence of someone to whom self-sacrifice is so utterly alien would have mocked the patriotism, devotion and suffering of the men who died fighting for their country in France.S.R. SturmBrusselsThe writer is a retired Air Force colonel.To the Editor: This Veterans Day should remind us of the horror of war and rededicate ourselves to finding peace. My own great-uncle, Ira Pitzer, was killed just eight days before the armistice in 1918.World War I should have been the last one. Surely the soldiers who fought so valiantly deserved a lasting peace. But it never came, as so many wars have taken place since.It is the Lost Peace. The best way to honor their sacrifice is to find that peace and freedom for all people.As we mark the 100th anniversary of the armistice, there is still immense suffering from war. The civil conflict in Yemen has led to the worst humanitarian crisis on the globe. The United Nations World Food Program says about two-thirds of the population lives in hunger.We must all start with recognizing the futility and destructive nature of war. On this 100th anniversary of the armistice, let’s remember what they fought for, a lasting peace. We must never give up on that dream.William LambersCincinnatiThe writer is co-author, with the World Food Program, of “Ending World Hunger.”Advertisement"}