{"id": "They’re Trained for War. Now American Troops Are Headed to the U.S. Border.", "paragraph": "Supported byBy Helene Cooper and Thomas Gibbons-NeffWASHINGTON — Already, President Trump has sent 1,000 military forces to the southwest border in a decision he said will protect Americans from a caravan of migrants coming from Central America. He has pledged to deploy at least 4,000 more troops by week’s end, as part of a last-ditch effort to galvanize the Republican base before the midterm elections on Tuesday.The troops, the president said, will be “waiting” for the caravan of unarmed men, women and children fleeing violence in Central America. Mr. Trump has also said the caravan may include Islamic terrorists, though he has shown no evidence to back up the claim.“This is an invasion of our Country and our Military is waiting for you!” Mr. Trump tweeted Monday.But using the world’s most powerful military to stop some 3,000 unarmed migrants who may or may not make it to the United States border might not be the best use of taxpayer dollars at the Defense Department. Here’s why.Defense Department officials say the border deployment is set to last until Dec. 15. It is not clear how much it will cost to send active-duty military troops to the border for the 45-day deployment, and neither the Pentagon nor the White House has provided a price estimate.But in June 2006, President George W. Bush spent $1.2 billion to deploy National Guard troops to border states to deal with drug violence over two years. The Government Accountability Office, which is the investigative arm of Congress, estimated it cost $120 per person per day for operations and maintenance costs during that deployment.Had the 2006 operation lasted 45 days, it would have cost $28 million to support 5,200 troops — or $35 million in today’s dollars.That would finance action against a threat that Defense Secretary Jim Mattis did not mention in January when he unveiled the  National Defense Strategy, which focuses the United States’ military power on countering China and Russia.The document itself does reference a need to build a border wall to stop illegal immigration. But at the time, Mr. Mattis said nothing of terrorism threatening the American homeland by way of a caravan of migrants from El Salvador, Honduras and Nicaragua.Administration officials said Mr. Mattis was against the border mission, but he was overruled by Mr. Trump, the commander in chief.Multiple Pentagon officials have privately said deploying troops to the southwest border will hurt “readiness” — military jargon for having enough forces trained and ready to fight. It also runs contrary to the Pentagon’s renewed emphasis on “lethality,” a military buzzword that refers to the ability to quickly overpower enemies.“You’ve got 5,000 troops that are trained and ready, and we’re using them for something other than their intended mission,” said Todd Harrison, the director of defense budget analysis with the Center for Strategic and International Studies in Washington, and a close watcher of the Pentagon’s budget.“And when they get back,” Mr. Harrison said, “they will have not been doing their normal training, and won’t be ready if something happens.”Committing troops to one operation means fewer forces for another. Compared with how many troops the United States has stationed in Syria (2,000), in Afghanistan (14,000) and in Iraq (5,000), the number of soldiers sent to Texas, Arizona and California will be a significant slice of all troops deployed worldwide.It is true that the border mission would require only a fraction of the roughly 1.3 million active-duty troops in the American military. But assigning engineers, medical staff and logistic personnel to the border will also deplete those limited number of specialized troops if they are needed for a national disaster or to deploy to a war zone.Quickly sending more than 5,200 troops, their vehicles and equipment to the southwest border is no easy task and will require a small fleet of aircraft to accomplish effectively. That means transportation jets and other aircraft will have to be repurposed from other assignments.The troops will come from bases across the country and be sent to ones near border towns in Brownsville, Tex.; in Nogales, Ariz.; and in Southern California. There, troops will need to be housed and fed. That means they will need temporary eating facilities and tents if permanent facilities are overwhelmed — or if they are sent to more austere locations.One reason Mr. Mattis initially sought to send only 800 troops is because they will have little to do beyond providing logistical support unless Mr. Trump declares martial law.At least as of yet, military troops at the southwest border  will largely be tasked with duties like building tents, transporting border officials on helicopters and shoveling manure from Border Patrol horses.Defense officials said the troops will not be enforcing United States immigration law. Using the American military to enforce immigration or criminal laws at the border, or in other law enforcement capacities, would run afoul of the Posse Comitatus Act of 1878, unless a special exception is made.Four years ago, the country was in a furor over another purported enemy approaching its borders: Ebola.The deadly epidemic took hold in three West African countries — but not in the United States, where only two people died. Both were West Africans.That did not stop Mr. Trump, then a businessman and critic of the Obama administration, from calling for the United States to shut its borders — even to American citizens.“The U.S. cannot allow EBOLA infected people back,” Mr. Trump tweeted on Aug. 1, 2014. “People that go to far away places to help out are great-but must suffer the consequences!”On the eve of the 2014 midterm elections, with control of the Senate at stake, Republicans and many Democrats took up Mr. Trump’s call. They criticized President Barack Obama for refusing to close American airports to people who had traveled to Liberia, Sierra Leone or Guinea.At the time, public health experts and the Centers for Disease Control and Prevention said a shutdown would do more harm than help.Once Election Day had passed, the scare suddenly quieted. Politicians stopped demanding a travel ban. Television news programs stopped round-the-clock coverage. And Media Matters, a watchdog group, reported that evening broadcast and cable news programs aired close to 1,000 segments on Ebola in the four weeks before the midterm elections and only 49 in the two weeks after.The migrant caravan is around 900 miles away, and most of the people in it are walking. Even if they managed to walk 20 miles a day, they most likely would not arrive until after Dec. 15.Put another way, the caravan is at least 45 days from the southwest border. As of Tuesday, American troops were scheduled to end their border deployment in 46 days.“None of this practically is going to amount to anything,” said Jon Soltz, an Iraq war veteran and a founder of VoteVets.org, a progressive veterans advocacy group.An earlier version of this article misspelled the last name of the co-founder of a veterans advocacy group. He is Jon Soltz, not Stoltz.Advertisement"}