{"id": "Andrew Gillum Concedes to Ron DeSantis in Florida Governor’s Race", "paragraph": "Supported byBy Glenn Thrush and Liam StackTALLAHASSEE, Fla. — Andrew Gillum, the Democratic nominee and mayor of Tallahassee, conceded the Florida governor’s race on Saturday to Ron DeSantis, a former Republican congressman closely allied to President Trump, saying he was satisfied with a recount that had him trailing by about 34,000 votes.Mr. DeSantis declared victory on election night this month, and Mr. Gillum, 39, announced he was conceding the race at the time. But he re-entered the race a week ago, under pressure from staff members and allies in organized labor, after the Florida secretary of state’s office declared an automatic recount.“We promised to fight until every vote was counted, and obviously we are now closing out the hand recount phase,” Mr. Gillum said in an announcement broadcast over Facebook Live on Saturday, standing next to his wife. “R. Jai and I wanted to take a moment to congratulate Mr. DeSantis on becoming the next governor of the great state of Florida. This has been the journey of our lives.”Mr. Gillum has not yet called the governor-elect, a spokesman for Mr. DeSantis said. But Mr. DeSantis responded to Mr. Gillum on Twitter, accepting his concession anew.“This was a hard-fought campaign,” Mr. DeSantis wrote. “Now it’s time to bring Florida together.”Even Mr. Trump, who days before the election referred to Mr. Gillum on Twitter as a “thief,” complimented the Democrat hours before his concession, congratulating him for his “really tough and competitive race.”“He will be a strong Democrat warrior long into the future — a force to reckon with!” the president wrote.Two statewide recounts still underway, after a vote-counting process that was assailed by Republicans, without evidence, as a possible smoke screen for election fraud, are for the state agriculture commissioner race and the United States Senate race between the Democratic incumbent, Bill Nelson, and Rick Scott, the Republican governor. In Palm Beach County, an extremely tight state legislative seat was also being recounted.In a nod to the stressful 11 days after Election Day, Mr. Gillum said the state would have to look at how it conducts elections.“We need to update Florida’s elections system and bring it into the 21st century,” he said.Broward County’s elections supervisor, Brenda C. Snipes, again had to defend her office’s work when a small batch of ballots from the Senate race appeared Saturday during the recount for the agriculture commissioner race.René D. Harrod, a deputy county attorney, said 47 manila envelopes containing ballots for the Senate race had been inadvertently assembled for manual counting alongside envelopes for the agriculture commissioner race. “Somebody took the wrong box off the shelf,” Ms. Harrod said, adding that the mistake was caught right away.“No harm, no foul,” she said.In Palm Beach County, elections officials planned to take the day off Sunday, because they had no chance of making the noon deadline for submitting a new tally in the agriculture commissioner race.The governor’s race between two young and energetic politicians — Mr. DeSantis, a Trump acolyte who adopted elements of the president’s white-hot style, and Mr. Gillum, a liberal darling running to be Florida’s first black governor — was widely seen as a proxy battle between competing ideological visions of the country’s future, one diverse and progressive, the other conservative and quick to defend Mr. Trump’s nationalist policies.It was also an unexpected matchup. Neither Mr. Gillum nor Mr. DeSantis was viewed as his party’s likely nominee when the primary season began. Mr. Gillum defeated a field of rivals that included a former House member and the mayor of Miami Beach. Mr. DeSantis, after gaining the endorsement of Mr. Trump, easily turned back the state agricultural commissioner, Adam Putnam, who had been viewed as the likely nominee.Mr. DeSantis, a Harvard- and Yale-educated former Navy legal officer at Guantánamo Bay, had represented the Sixth District, centered on Daytona Beach, since 2012. He ran for the Senate in 2016 but dropped out after Marco Rubio, the Republican incumbent, decided to run for re-election.But he rose to national prominence as an energetic advocate for the president on Fox News, where he has appeared dozens of times since Mr. Trump was elected, defending him from critics and directing barbs at liberals, the news media and the special counsel Robert S. Mueller III.In Mr. Gillum, voters were presented in many ways with Mr. DeSantis’s opposite. As an elected official in Tallahassee since 23, he embraced liberal positions — like higher corporate tax rates, legalization of marijuana, tighter gun control and Medicare for all — that thrilled the Democratic Party’s activist base. But they also gave Mr. DeSantis more than enough material to portray him as a radical leftist out of step with a quintessential swing state.But Mr. DeSantis struggled to gain momentum, and he trailed in the polls for much of the campaign after telling Fox News that Florida voters should not “monkey this up” by voting for Mr. Gillum. Critics saw the remark as a racist dog whistle, but Mr. DeSantis, who is white, said he had not intended it as a racial jab.That was not the only racial episode during the campaign. In August, an Idaho-based white supremacist group placed racist robocalls to Florida voters in which a man claiming to be Mr. Gillum spoke in the exaggerated accent of a minstrel performer while monkeys screamed in the background. Both campaigns denounced the calls, which drew attention to Mr. DeSantis’s earlier gaffe.The negative attention on Mr. DeSantis’s campaign lifted in the weeks before the election, when he named Susie Wiles, a veteran Republican operative, as his new campaign manager. He worked furiously to define Mr. Gillum as a proponent of “ideological radicalism” and a “George Soros left-wing agenda” who was out of step with the average Floridian.And he campaigned on a promise to support military veterans, defend a scholarship program that pays private school tuition for low-income students and appoint “constitutionalist” judges to the State Supreme Court, a promise that echoed a similar one made on the campaign trail in 2016 by Mr. Trump.Mr. Gillum said on Saturday that he remained committed to pushing for societal change — if not as the next governor, then as an advocate.“Although nobody wanted to be governor more than me, this was not just about an election cycle,” he said. “This was about creating the kind of change in this state that really allows the voices of everyday people to show up again in our government. We know that this fight continues in spite of the outcome of this election.”At 39, he remains young enough to run again, for the governorship or some other office.“Stay tuned,” he said. “There will be more to come.”Glenn Thrush reported from Tallahassee, Fla., and Liam Stack from New York. Reporting was contributed by Patricia Mazzei and Frances Robles in Miami, Jane Smith in Riviera Beach, Fla., and Nick Madigan in Lauderhill, Fla.Advertisement"}