{"id": "Let’s Agree Not to Kill One Another", "paragraph": "Supported by I was used to social media abuse. Then someone suggested shooting me.By Bill McKibbenMr. McKibben is a founder of the environmental activism group 350.org.MIDDLEBURY, Vt. — In a world where the president goes on Twitter to call a woman “horseface” it seems pointless to call for “civility.” So let me suggest that we start with a lower bar, maybe one we could still hope to achieve: Let’s stop threatening to kill one another.One morning last week I had to write to a young colleague in the environmental movement. He works in South America, he’d been getting death threats over social media and he was rightly alarmed. I could counsel him a little because I myself have been getting them, sporadically, for a long time. But I couldn’t counsel him much, because what is there to say beyond “Be careful, know that it’s a tribute to your effectiveness and don’t hesitate to take some time off”? I was his age when I first started getting such threats, in the 1990s, and they’ve escalated over the years as campaigns I’ve helped organize against pipelines or for fossil fuel divestment have gained traction. I remember one police officer telling me that “the ones who write you aren’t the ones who shoot you,” which I found comforting for about 15 seconds till I thought through its implications. My practice has been just to delete threats from my email — I find that if I don’t, I keep looking at them, and I imagine (I hope) the main goal of their authors is to distract me. If you’re going to be a lightning rod, some sparks are probably the price.An hour after I’d written to that young man, though, something happened that moved me to think about this more thoroughly. It began last week when The Los Angeles Times published an op-ed article of mine describing a trial in Minnesota where some protesters — acting peacefully, threatening no one and informing the company they were protesting against — engaged the emergency shut-off valves on two pipelines and forced the company to temporarily shut off the flow of oil from Canada’s tar sands into the United States. The case against the protesters had been dismissed on the grounds that they’d done no damage; I was trying in my essay to explain why nonviolent civil disobedience helped in the fight for a workable climate.Not everyone agreed. Indeed, a few hours after my essay appeared, a website called Watts Up With That? published an attack on my article. This enterprise — which bills itself as the most widely read website about the climate, and claims about three million to four million visitors a month — is devoted to proving we have nothing to fear from climate change. The author of the blog post, David Middleton, called me a misfit and made reference to my “sunken chest.” Sure, whatever. Sadly, this just seems to be how politics unfolds in the age of Trump. But then the commenters went at it. One said: “Anybody got Bill McKibben’s home address? Let’s see how he really feels about ‘civil disobedience’ if it shows up at his front door.” Another added, “Give him a smack for me.” One or two tried to calm people down. But there was also this comment, from someone named “gnomish:” “There is a protocol worth observing: S.S.S. It stands for shoot, shovel and S.T.F.U. Hope that saves you some trouble.” This “protocol” was left over from the right-wing fight against endangered species laws. If, say, a protected woodpecker was on your land, the “Three S’s” doctrine held that you should kill it, bury it and keep your mouth shut about it. It was, in this case, a public call for someone to murder me, and not long afterward another commenter, “Carbon Bigfoot,” supplied my home address.All of which stopped me cold.I thought I was inured to social media abuse. But this was something new: a calm public discussion about how to find me and what to do to me. No one deleted the comment by “gnomish.” The conversation just kept spiraling along.I know that this is much worse for women; I shudder to think what Christine Blasey Ford’s email has been like lately. I know enough American history to understand that for people of color the deed has followed the threat with chilling regularity. I know that it’s worse in other places — 207 environmentalists or defenders were killed last year around the world. I have no idea if these people actually wish to murder me, though it’s disconcerting to imagine who among those millions of visitors to the site will read the comments and decide to drive to my house.But aside from my own fear — and I’m now installing surveillance cameras, because it turns out that public death threats slash through some of the psychic insulation privilege provides — what really bothered me was the matter-of-factness of it all. What does it say about a society when people just routinely call for the killing of those they disagree with? You’ll note that “gnomish” abbreviated his profane phrase, because curse words are banned on this website. But its moderators apparently just read right past the death threat.Threatening to kill or rape someone shouldn’t be banal. It should shock everyone who comes across such a threat. And that should go without saying, except that increasingly it doesn’t, not in a world where the president has said that he longed for the days when disruptive protesters were carried away from the scene “on a stretcher.” It’s perversely heartening to see that the apparent murder of the Saudi journalist Jamal Khashoggi seems to have temporarily interrupted business as usual. Such shock and outrage is crucial, because in a world where dissenters are dismembered, there’s no hope for change. The prospect that you’ll be killed for what you say makes discussion essentially impossible. A society in which critics fear death is a society with fewer critics, and hence with fewer chances for change.I count nonviolence as perhaps the greatest invention of the 20th century, above all because it opens up the possibility for conversion, not domination. That was the point of my op-ed essay, the one that garnered me the death threat. But we should practice nonviolence in ways small as well as large, prosaic as well as dramatic. In the case of Watts Up With That, I’d made the effort at de-escalation myself. A few years ago, I was scheduled to give an organizing talk in the small California town where the website’s proprietor, Anthony Watts, lived. So I contacted him and invited him out for a beer. I knew I wouldn’t change his mind on climate change, and he knew I would continue to think his work involved wrecking the planet. But it always seems like a human idea to reach out. And it was fine. We had a couple of beers, he wrote up an account of our conversation for his website, and even most of the commenters saluted us for sitting down and talking. (It was odd enough that it even got covered in The Times). But given the political world in which we live, a world in which tribes divide up and then beat their chests, it wasn’t long before things were back to new ugly normal.I don’t want this website shut down; I don’t want the people who write on it prosecuted. I definitely don’t want them murdered. I just want — as the very beginning of some kind of return to the gentler old normalcy — for people to stop making death threats. That seems to me the least we can ask of one another.Bill McKibben, a founder of 350.org, teaches environmental studies at Middlebury College and is the author of the forthcoming book “Falter: Has the Human Game Begun to Play Itself Out?”Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.Advertisement"}