{"id": "Trump’s Misleading Claims About California’s Fire ‘Mismanagement’", "paragraph": "Supported byFact CheckOn Twitter, the president claimed that the state’s wildfire woes are a result of poor forest management. The truth is more complicated.By Kendra Pierre-LouisWant climate news in your inbox? Sign up here for Climate Fwd:, our email newsletter.As Californians were fleeing the huge wildfires that have left both ends of the state ablaze, President Trump took to Twitter over the weekend, blaming the infernos on forest management and threatening to withhold federal payments from the state.His statements, which drew outrage from local leaders and firefighters, oversimplified the causes of California’s wildfires.There is no reason for these massive, deadly and costly forest fires in California except that forest management is so poor. Billions of dollars are given each year, with so many lives lost, all because of gross mismanagement of the forests. Remedy now, or no more Fed payments!What Trump saidThere is no reason for these massive, deadly and costly forest fires in California except that forest management is so poor.Mr. Trump is suggesting that forest management played a role, but California’s current wildfires aren’t forest fires.“These fires aren’t even in forests,” said Max Moritz, a wildfire specialist at the University of California, Santa Barbara.Rather, the Camp and Woolsey fires, which are ripping through Northern and Southern California, began in areas known as the wildland-urban interface: places where communities are close to undeveloped areas, making it easier for fire to move from forests or grasslands into neighborhoods.[Why does California have so many wildfires? There are four key ingredients.]A 2015 report by the United States Department of Agriculture found that between 2000 and 2010 (the last year for which data was available), the number of people moving into the wildland-urban interface had increased by 5 percent. According to the report, 44 million houses, equivalent to one in every three houses in the country, are in the wildland-urban interface. The highest concentrations are in Florida, Texas and, yes, California.It is true that California wildfires are getting larger and that most of the state’s largest wildfires have happened this century. The Mendocino Complex Fire, earlier this year, was the biggest California fire on record, as measured by acres burned. The Camp Fire is already the most destructive in state history, having razed more than 6,000 homes.Wildfires burned in California near the Sierra Nevada foothills and the Los Angeles shoreline, engulfing about 240,000 acres.The fires aren’t just getting bigger; they’re becoming more unpredictable, too. They are often burning hot through the night (when they used to cool), racing faster up hillsides and torching neighborhoods that were once relatively safe.Researchers are attributing at least part of the difference to climate change, because in a warming world vegetation dries out faster and burns more easily.And the most “deadly and costly” fires happen at the wildland-urban interface, because they damage houses, towns and lives. The Camp Fire has already matched the deadliest fire in state history, killing at least 29 people, and the death toll may rise.“We have vulnerable housing stock already out there on the landscape. These are structures that were often built to building codes from earlier decades and they’re not as fire resistant as  they could be,” Dr. Moritz said. “This issue of where and how we built our homes has left us very exposed to home losses and fatalities like these.”What Trump saidBillions of dollars are given each year, with so many lives lost, all because of gross mismanagement of the forests. Remedy now, or no more Fed payments!The statement suggests that California’s forest-management problems are at fault. But the majority of California’s forests are federally held.Of the state’s 33 million acres of forest, federal agencies, including the Forest Service and the Interior Department, own and manage 57 percent. Forty percent are owned by families, Native American tribes or companies, including industrial timber companies; just 3 percent are owned and managed by state and local agencies.The president did not specify which federal payments might be withheld. But California itself allocated $256 million this year toward lowering wildfire risk.In recent years the Forest Service has tried to rectify its past forest-management practices by conducting more prescribed or “controlled” burns to get rid of dead vegetation that could fuel future wildfires. But its budget has been overwhelmed by firefighting costs.Congress passed a budget this year designed to fix some of those problems (and create a dedicated firefighting fund), but it will not take effect until next year.Mr. Trump may also be referencing a debate put forward by logging interests, which argue that selective cutting would reduce California’s wildfire problem. A century of fire suppression allowed flammable material — twigs and brush — to build up in forests nationwide.As fires have gotten bigger and more destructive, the administration and Republicans in Congress have supported calls by the timber industry to clear out potential fuel by letting the land be logged.In an opinion piece published this year in USA Today, Interior Secretary Ryan Zinke blamed California’s wildfires on environmentalists who oppose logging. He wrote: Every year we watch our forests burn, and every year there is a call for action. Yet, when action comes, and we try to thin forests of dead and dying timber, or we try to sustainably harvest timber from dense and fire-prone areas, we are attacked with frivolous litigation from radical environmentalists who would rather see forests and communities burn than see a logger in the woods.It is true that California has a lot of dead timber — 129 million trees spread across 8.9 million acres, according to a Forest Service estimate.But the dead trees themselves do not catch fire easily, because they are too big, said Chad T. Hanson, the principal ecologist at the John Muir Project of the nonprofit Earth Island Institute.“It’s like starting a campfire,” he said. “You don’t put a big log on the fire and put a match to it and expect it to burn — it’s not going to happen. Fires are driven by kindle.”Logging gets rid of trees, but it does not get rid of the kindling — brush, bushes and twigs. Logging does, however, enable the spread of cheatgrass, a highly combustible weed, which makes a forest more likely to burn.In fact, the wooded land that abuts Paradise, Calif., the community so badly damaged by the Camp Fire, underwent the kind of post-fire logging that Mr. Trump’s tweet and Mr. Zinke’s article suggested. That was just under a decade ago, Dr. Hanson said, but the city is now in ashes.For more news on climate and the environment, follow @NYTClimate on Twitter.Kendra Pierre-Louis is a reporter on the climate team. Before joining The Times in 2017, she covered science and the environment for Popular Science.  @kendrawrites Advertisement"}