{"id": "Explosives, Midterms, Markets: Your Wednesday Evening Briefing", "paragraph": "Supported byBy Jean Rutter and Marcus Payadue(Want to get this briefing by email? Here’s the sign-up.)Good evening. Here’s the latest.1. Pipe bombs were sent to several prominent Democrats and to CNN’s New York offices, above, prompting an evacuation.Investigators are looking for links and trying to determine whether a bomber is going after political figures vilified by the right wing.New York’s mayor, Bill de Blasio, called the Manhattan episode “an act of terror.” Other devices were addressed to former President Barack Obama and former Secretary of State Hillary Clinton, among others. A similar bomb was found Monday at the New York home of George Soros, a major contributor to Democratic causes.None of the devices harmed anyone, and it was not immediately clear whether any of them could have exploded. One law enforcement official said investigators were examining the possibility that they were hoax devices.President Trump denounced the attempted attacks as “despicable acts” and called for national unity, despite months of using highly divisive rhetoric at campaign rallies ahead of the coming midterm elections._____2. Today in U.S. politics, we’re zeroing in on a couple midterm races.In Tennessee, the former governor Phil Bredesen, above, is running for Senate as a centrist Democrat, hoping to continue a moderate tradition. His Republican opponent, Rep. Marsha Blackburn, is running as a hard-line conservative, betting on a rightward shift that helped Donald Trump carry the state by 26 points. Whoever wins, the political identity of Tennessee could be on the line.And in Florida’s 26th Congressional district, stretching from the Miami suburbs to Key West, the Republican incumbent Carlos Curbelo is in a tight race. A loss could signal a blue wave rolling across the biggest presidential swing state. A victory would validate the unique appeal of a Latino conservative who evangelizes for climate science in a Democratic-leaning district.Want to know where things stand in the most-watched races? We’ve updated The Tip Sheet.3. Fear of death. Fear of being left behind. Fear of being deported.Thousands of migrants crossing Mexico in a leaderless caravan heading for the U.S. are beset by danger, hunger, hardship and a lack of reliable information. Despite the hardship, migrants say it is better than the poverty and violence they left behind. Above, a vigil for a migrant who died after a fall from a truck.Our reporters are chronicling their daily struggles. “This is straight-up biblical,” said a Guatemalan man traveling with his wife, their 1-year-old son and a cousin. They spent part of the night on sheets of cardboard._____4. Markets stumbled yet again, with the benchmark S.&P. 500-stock index losing more than 3 percent and slipping into negative territory for 2018.As recently as Sept. 20, investors were sitting on a respectable 9.6 percent gain for the year. Not anymore.A panoply of concerns — from rising interest rates, to uncertainty over the impact of the trade war with China, to worries that the nearly 10-year bull market may be ending — set off a binge of selling. Above, the New York Stock Exchange.Stocks have fallen for 13 of the past 15 trading days. At market close, the S.&P. is down more than 0.6 percent for the year._____5. Scientists want to scrub carbon from the air. A leading scientific body urged the U.S. government to begin research on technologies that would remove vast quantities of carbon dioxide from the atmosphere, in an effort to slow climate change.Until now, scientists said large temperature increases could be prevented mainly by reducing fossil fuel use and switching to other energy sources.But, according to a dire U.N. study released this month, time is running out. Experts now believe that taking carbon out of the air might be necessary — and they haven’t yet figured out how to do that economically or at a big enough scale._____6. And New York’s attorney general sued Exxon Mobil, for deceiving investors about the effects of climate change on its business.It’s the most significant legal effort yet to hold a fossil fuel company responsible for misleading the public on the issue.The suit doesn’t charge the company with causing climate change, though fossil fuel emissions are a major contributor to human-driven global warming.Instead, it says the company engaged in a “longstanding fraudulent scheme” to downplay the risks posed to its business by climate change regulation.An Exxon spokesman called the lawsuit “baseless allegations.”_____7. Crown Prince Mohammed bin Salman called the killing of the Saudi journalist Jamal Khashoggi a “heinous crime” and insisted that Saudi Arabia and Turkey were working together to bring the perpetrators to justice.The statement, made during an investor conference in Riyadh, above, was the crown prince’s most public attempt to separate himself from the men suspected in the killing, including some of his own aides.It came after President Trump, a close ally, denounced Saudi explanations of what happened as a cover-up, and his administration announced it would revoke the visas of 21 Saudi suspects._____8. Gesundheit.An internet-connected thermometer that’s in a half-million U.S. homes is collecting “illness data” about where fevers are spiking — and selling it to advertisers.If you have a Kinsa thermometer, you can track your family members’ temperatures on a mobile app. But the company also uses the data to pinpoint areas where cold and flu season is peaking, down to the ZIP code.Clorox has used it to target ads for its disinfecting products.The practice has raised ethical questions “on what we think is acceptable for targeting people who are ill and what safeguards we want,” one privacy advocate said._____9. World Series, Game 2. The Red Sox are halfway to a World Series title after defeating the Los Angeles Dodgers, 4-2, on Wednesday night at Fenway Park._____10. Finally, it began with a spiritual journey.Kacey Musgraves, one of country music’s top singer-songwriters, dissects the origin of “Slow Burn,” a song with deeply personal lyrics inspired by an acid trip.A Neil Young-esque chord progression captures the mood, framing vivid, autobiographical slices of her life.It’s the latest installment of Diary of a Song, where we tell the story behind the track with video interviews, studio audio and early drafts — doodles and all. For more, subscribe to our YouTube channel.Have a harmonious evening.Your Evening Briefing is posted at 6 p.m. Eastern.And don’t miss Your Morning Briefing. Sign up here to get it by email in the Australian, Asian, European or American morning.Want to catch up on past briefings? You can browse them here.What did you like? What do you want to see here? Let us know at briefing@nytimes.com.Advertisement"}