{"id": "Sheep Without Shepherds", "paragraph": "Supported byFor ordinary Catholics, the failures of their leaders have created a two-decade test of faith.By Ross DouthatOpinion ColumnistHere is a striking fact about the Roman Catholic Church in the United States. The sex abuse crisis in the early 2000s, the horrid revelations of predation that began in Boston in 2001, did not have an obvious long-term effect on the practice of the faith.Yes, American Catholicism has lost millions of its baptized flock over the last 50 years. But that decline was steepest in the 1960s and 1970s; by the turn of the millennium, some trends (attendance at Mass, for instance) had stabilized, and the number of Catholics marrying in the Church and baptizing their children had settled into a slower decline.After the 2001 scandals Gallup showed a temporary plunge in reported attendance at Mass — but then a swift rebound. Other data showed no clear effect on attendance at all. Neither ordinations nor adult conversions dramatically declined. There were local collapses and individual crises of faith, and the moral authority of the bishops was dramatically weakened. But as an institution, the Roman Catholic Church seemed to weather the storm better than might have been expected. The Catholic belief that the sacraments are more important than the sins of the men responsible for offering them was tested — and seemingly endured.[Listen to “The Argument” podcast every Thursday morning, with Ross Douthat, Michelle Goldberg and David Leonhardt.]The question hanging over American Catholicism today, as it endures a second purgatorial experience with scandal, is whether this time is different, whether the Church’s peculiar post-1970s mix of resilience, stagnation and decay can survive a second agony.The question was sharpened by last week’s fiasco in Baltimore, at the General Assembly of the National Conference of Catholic Bishops, where the American Church’s shepherds were supposed to vote on some kind of plan to handle malfeasance within their ranks — only to have their intentions swatted down, at the last minute, by the Vatican’s insistence that any accountability measures be hashed out in Rome some months hence. The fiasco was not surprising — the tone-deafness and self-protectiveness of the Roman intervention, the bafflement and internal divisions of the American bishops, and the liberal-versus-conservative arguments that followed were all characteristic of Catholicism’s crisis under Pope Francis.But in being unsurprising the fiasco was still revelatory. When the sex abuse scandals broke in 2001 it was possible to imagine that they were just about sex abuse — that the church could simply stop treating predatory priests with therapy, start defrocking them, and move forward chastened and renewed.Seventeen years later, with neither the American bishops nor Pope Francis able to muster an adequate response to the revelation that a famous cardinal was a predator whose sins were known even as he rose, it’s clear that this was wrong. The Church has done much better since 2001 in the most basic task of keeping children safe. But in everything else connected to the scandal there is little progress because Catholicism’s leaders cannot agree on what progress means.It is clear that there is festering sexual and financial corruption in the hierarchy; it is clear that there are problems in the way the Church trains priests and selects bishops. But the Church’s theological factions are sufficiently far apart that each would rather do nothing than let the other side lead reform — because the liberals think the conservatives want an inquisition, the conservatives think the liberals want Episcopalianism, and there is some truth in both caricatures.Thus all proposals for reform are evaluated through an ideological lens, and neither side has enough confidence to learn something from the other, or to conduct a full purification of its own ranks.The result, as in secular politics these days, is stalemate and confusion, with a Church increasingly unsure of what it teaches, led by men who can’t agree on how it might be cleansed. Which in turn leaves the Catholic faithful with less hope than in 2001 that their bishops can achieve competence and decency, let alone Christian holiness.Recently two Catholic journalists I know, Damon Linker and Melinda Henneberger — one a convert drawn to the church despite his doubts, the other “a true-believing, rosary- and novena-praying graduate” of Catholic schools — have written pieces about how the new scandals are pushing them from practicing to lapsed, Catholic to “ex-Catholic.”Someday soon (maybe for Advent or Christmas) I will write a column about why this leave-taking is a terrible mistake. But for today it’s enough to raise the possibility that Henneberger and Linker are representative of many wavering Catholics who stayed with a compromised leadership in 2001 but won’t stay with a hierarchy that seems bankrupt in 2018 … or for however long the Church’s internal stalemate obstructs justice and forestalls reform. I think the bishops meeting in Baltimore know that this is a possibility, that they may be responsible for the loss of churchgoers, the loss of souls. I think many have genuinely good intentions, a genuine desperation to figure out what must be done.And I think their impotence is a lesson, all too literal, in the road that good intentions often pave.Follow The New York Times Opinion section on Facebook, Twitter (@NYTOpinion) and Instagram, join the Facebook political discussion group, Voting While Female, and sign up for the Opinion Today newsletter. Ross Douthat has been an Opinion columnist for The Times since 2009. He is the author of several books, most recently, “To Change the Church: Pope Francis and the Future of Catholicism.”\r\nYou can follow him on Twitter:  @DouthatNYT Advertisement"}