{"id": "Federer Falls Short of a 100th Title. But He Does Get an Apology.", "paragraph": "Supported byBy The Associated PressLONDON — After pulling off one of the biggest victories of his career, Alexander Zverev felt he had no choice but to apologize to the player he had just defeated, who happened to be none other than Roger Federer.Zverev denied Federer a shot at a 100th career title by beating him, 7-5, 7-6 (5), on Saturday to advance to the championship match at the ATP Finals. But that was not why Zverev felt the need to say he was sorry.Instead, his apology stemmed from a quirky moment in the second-set tiebreaker. Federer was leading the tiebreaker, 4-3, and seemed to have the edge on a Zverev service point when a ball boy at the back of the court dropped a ball. Zverev immediately signaled for the point to be stopped, and the umpire then ordered it to be replayed.Zverev proceeded to serve an ace before going on to close out the match moments later.“I want to apologize for the situation in the tiebreak,” Zverev said in his on-court interview after the match, which was punctuated with some boos from the crowd. “The ball boy dropped the ball, so it’s in the rules that we have to replay the point.“I’m a little bit upset about the whole situation because this is not how I wanted it to end,’’ Zverev added.At one point, his on-court interviewer, Annabelle Croft, came to Zverev’s defense, telling the crowd: “I’m not sure why you are booing; he is telling the truth.’’At 21, Zverev is the youngest player to reach the championship match of the event since 2009 and the first from Germany to do so since 1996. He will next face Novak Djokovic, who defeated Kevin Anderson, 6-2, 6-2, in the other semifinal on Saturday.Federer, 37, was seeking a record-extending seventh title in this event, but he was unable to cope with the pressure created by Zverev’s power and precision at the O2 Arena.“He apologized to me at the net,” Federer said of Zverev after the match ended. “I was like, ‘Buddy, shut up. You don’t need to apologize to me here. Congratulations on a great match and a great tournament so far. All the best for the finals.’ And you move on.”When Zverev signaled for play to stop during the tiebreaker, Federer appeared perplexed, and he approached the umpire, Carlos Bernardes, for an explanation. He said afterward that he never at any point felt Zverev was engaging in gamesmanship.As for the ball boy, Federer said he hoped he didn’t have a sleepless night after his mishap. “It’s not a big deal at the end of the day,’’ he said.An inspired series of shots had earned Zverev the first break points of the match in the 12th game of the first set, and Federer then sent a forehand wide to fall behind.Federer willed himself to a break for a 2-1 lead in the second set, but Zverev quickly composed himself to capture the following game.Zverev then followed up the unusual interruption caused by the ball boy to establish a 5-4 lead in the second-set tiebreaker, and Federer then netted the simplest of forehand volleys to summon match point.Federer won the next point, but Zverev then put away a backhand volley to win the match and leave Federer waiting until next season for his 100th title.“Over all, I’m happy how the season went,” said Federer, who picked up his 20th Grand Slam title early in the year at the Australian Open. “There’s many positives. So I’m excited for next season.”When, presumably, he will win his 100th title in somewhat orderly fashion, without any balls being dropped during play.Advertisement"}