{"id": "James Karen, Veteran Actor and ‘Pathmark Man,’ Dies at 94", "paragraph": "Supported byBy Neil GenzlingerJames Karen, an actor with some 200 television and film credits and one particularly memorable job as a supermarket pitchman that led many to call him simply the Pathmark Man, died on Tuesday at his home in Los Angeles. He was 94.The cause was cardiac arrest caused by respiratory difficulties, the film historian Bruce Goldstein, a longtime friend, said.A classic character actor, Mr. Karen worked steadily onstage and on the large and small screens for more than a half-century. Over the years his face, if not his name, became familiar.He played the boss of Jane Fonda’s character in “The China Syndrome” (1979) and a real estate agent in the original “Poltergeist” (1982). He was in “The Return of the Living Dead” in 1985 and its sequel in 1988.On television he played several different doctors during the eight-season run of “Quincy, M.E.” in the 1970s and ’80s, a minister on “Beverly Hills 90210” in the 1990s and a Supreme Court justice in the short-lived series “First Monday” in 2002, among scores of other roles.In the Northeast, though, he was probably better known for his TV commercials for Pathmark supermarkets, which were ubiquitous on local television from the late 1960s into the ’80s. He made hundreds of spots for the store over the years, although for much of that time he lived on the West Coast, becoming “the Pathmark Man” or “Mr. Pathmark” to countless viewers.“I go to New York every two weeks and run off 20 30-second commercials at a time,” he told United Press International in 1984. “This is the best job an actor can have,” he added. “It pays very well, and it’s steady.”Mr. Goldstein said that Mr. Karen did the commercials for 28 years, and that Pathmark “even made him a vice president.”James Karen was born Jacob Karnofsky on Nov. 28, 1923, in Wilkes-Barre, Pa. His father, Joseph, was a saloonkeeper who went into the produce business. His mother, Mae (Fried) Karnofsky, was a homemaker.He left home in 1940 and went to New York with a newly adopted stage name. A cousin, the actor Morris Carnovsky, steered him to the acting teacher Sanford Meisner. When the United States entered World War II in 1941, Mr. Karen joined the Army Air Forces; he spent part of the war as a cryptographer in Alaska, Mr. Goldstein said.After the war ended in 1945, Mr. Karen returned to New York and spent time at the Actors Studio, including as an understudy for various roles in Elia Kazan’s 1947 Broadway production of “A Streetcar Named Desire,” starring Marlon Brando and Jessica Tandy. He worked on Broadway in small roles or as an understudy into the mid-1970s and also appeared in regional theaters.By 1970 he was getting regular TV work, and in the middle of that decade he moved to Los Angeles. He was already doing the Pathmark spots, though, and kept that job even though the nearest Pathmark was thousands of miles away.Mr. Karen found out in 1984 that some television viewers did not grasp the difference between him and the roles he played. In “Little House: The Last Farewell,” a TV movie that was essentially the finale of the beloved series “Little House on the Prairie,” he played a development tycoon named Nathan Lassiter who wants to take over the town of Walnut Grove.“Hundreds of letters came in to Pathmark asking the store to do something about me,” Mr. Karen told U.P.I. “The customer relations department couldn’t believe it. For some reason they never objected to other heavies I played. But the evilness of Nathan Lassiter blew their minds. I guess they realized they’d never see Walnut Grove again, and it created a great sense of loss.”He took it upon himself to call or write to the people who had voiced complaints.“They were astounded to be hearing from me,” the Pathmark Man said. “At first they were floored. Then they laughed.”Mr. Karen married Susan Reed in 1950; that marriage ended in divorce. In 1986 he married Alba Francesca, who survives him, as do a son from his first marriage, Reed, and two grandchildren.When George Clooney accepted the American Film Institute’s lifetime achievement award this year, he tried to convey what the ceremony felt like to him by recalling that several years ago Mr. Karen, a friend, had asked him to write his obituary because he was near death. Weeks and then months went by; no death. Finally Mr. Clooney called Mr. Karen’s wife.“Yeah, Jimmy’s doing fine,” Mr. Clooney said she told him. “He just wanted to know what everybody thought about him while he was still around. He got a bunch of people to do it.”Advertisement"}