{"id": "Step Away From the Orb", "paragraph": "Supported byBy Maureen DowdOpinion ColumnistWASHINGTON — I was having dinner here once with a Saudi muck-a-muck. Midway through the interview, he passed an oblong velvet box across the table. Inside I found an expensive piece of jewelry.I began laughing and explained that I was a reporter and could not take such baubles. The Saudi said he understood.About 10 minutes later, I felt a knocking against my knee under the table. It was the oblong box, offered more covertly.The Saudis are experts on emoluments. If you don’t take their favors one way, they find another way to try to co-opt you.Hollywood, Silicon Valley, presidential libraries and foundations, politically connected private equity groups, P.R. firms, think tanks, universities and Trump family enterprises are awash in Arab money. The Saudis satisfy American greed, deftly playing their role as dollar signs in robes.Donald Trump, who may be the only person more fond of lavish displays of arriviste gilt than the Saudis, is bedazzled by a Saudi pledge to buy billions worth of American weapons, just as he was flattered by the Saudi sword dance and weird luminescent orb séance on his visit to the kingdom.Even before the bloodcurdling execution of Jamal Khashoggi for his just criticism of Crown Prince Mohammed bin Salman, it was clear that the chump Trump and jejune Jared had bet their entire Middle East strategy on a chillingly autocratic and reckless person.The prince was easing up on the draconian restrictions on women to get a gloss as a liberal visionary. But he was simultaneously jailing women activists, imprisoning and torturing royals and top businessmen and making America an accomplice in a grotesque war in Yemen, dropping bombs supplied by the U.S. with little care about whether civilians died, including in an attack on a school bus, killing dozens of children. This, as the self-styled children’s advocate Ivanka was out on the town, talking about the fabulous “deliverables” she and Jared were bringing to their BFFs in Riyadh.The Saudis blithely assume abhorrence at their inhumane behavior — from beheadings to forcing teenage girls without head scarves back into a burning school to die, as the religious police did in Mecca in 2002, to the brazen murder of Khashoggi, a Washington Post columnist — can be lubricated away with oil and money.And why shouldn’t they?Our alliance with the Saudis has always been poisoned by cynical bargains.After the oil boom of the late ’70s, Islamic clerics were enraged at the hedonistic behavior of the royals. In order to continue with their hypocritical lifestyle, the royals offered cultural freedom and women’s rights as a sop to the fundamentalists, allowing anti-Western clerics and madrasas to flourish and giving a free pass to those who bankrolled terrorism.Even as we hailed the Saudis as our partners in fighting terrorism, they were nurturing the monsters who would come for us. Seventeen years before the psychotic Saudi hit squad traveled to Istanbul to dismember Khashoggi while he was still alive, another psychotic Saudi hit squad traveled to America to turn planes packed with passengers into bombs.Osama bin Laden and 15 of the 19 hijackers on 9/11 were Saudis. The Saudi royals repeatedly stymied American efforts to crack down on Al Qaeda in the years before 9/11.But they remained our dear friends. W.’s White House allowed Prince Bandar — the dean of the Washington diplomatic corps was so close to the Bush family that his nickname was “Bandar Bush” — to spirit Bin Laden’s family members and other wealthy Saudis out of America on jets after the twin towers fell. Bandar entertained and influenced pols and journalists with cigars and cognac in the reassembled British pub he had transported to his $135 million Aspen mansion, and with hunting jaunts at his estate in England’s Wychwood.Even Barack Obama, who had no love lost for the Saudis, refused for eight years to release a classified document from 2002 detailing contacts between Saudi officials and some of the 9/11 hijackers, including checks from Saudi royals to operatives in contact with the hijackers and a connection between a Bandar employee and a Qaeda militant. (Bandar’s wife, Princess Haifa, wrote charitable checks that ended up in the hands of two hijackers.)Our Faustian deal was this: As long as the Saudis kept our oil prices low, bought our fighter jets, housed our fleets and drones and gave us cover in the region, they could keep their country proudly medieval.It was accepted wisdom that it was futile to press the Saudis on the feudal, the degradation of women and human rights atrocities, because it would just make them dig in their heels. Even Hillary Clinton, as secretary of state, never made an impassioned Beijing-style speech about women in Saudi Arabia being obliterated under a black tarp.During the first gulf war, fought in part to protect the Saudis from an encroaching Saddam, a group of Saudi women — artists and academics — got excited by the presence of American female soldiers and went for a joy ride. The clerics branded the drivers “whores” and “harlots.” They received death threats and lost their jobs. Driving by women, banned by custom, was made illegal.America was mute. Our government did not even fight for the right of its women soldiers protecting Saudi Arabia to refuse the Saudi directive to wear an abaya and head scarf when off the base.The Saudis need us more than we need them. We now produce more oil than they do. And yet we continue to coddle them and shield them from responsibility for their barbaric ways.Because, after all, the press is the Enemy of the People, deserving a body slam. And the Saudis are our dear friends, deserving bows, hugs and kisses.I invite you to follow me on Twitter (@MaureenDowd) and join me on Facebook.Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram, and sign up for the Opinion Today newsletter. Advertisement"}