{"id": "Variety: Puns and Anagrams", "paragraph": "Supported byVariety CROSSWORD COLUMNBabies, what are we doing? Erik Agard’s first Puns and Anagrams puzzle!By Caitlin LovingerSUNDAY VARIETY PUZZLE COLUMN —  It looks like Erik Agard is further branching out — although I could definitely be missing efforts made elsewhere, this is his first variety grid for The Times. I somewhat paled at the thought of trying to keep up with his cool sense of humor, which is already on display in our straightforward grids, but this was a very nice, mellow undertaking. There were many unadorned anagrams to work on today. One of my favorite examples was 9A, “Latest Starbucks creations”: For some reason I got stuck on “latest” almost rearranging to Seattle (it was just that last E!), and totally missed LATTES, which are, indeed, delicious coffee creations. 1A: On the face of it, this clue looks a little impossible, but numbers in clues are hints themselves. Try thinking of “100” as C; “100 in total,” then, becomes C OVERALL, COVERALL.18A: Likewise, directions are usually hints in cryptic clues. In this case, “dumpier rec center”: Look in the center of “dumpier rec” for PIERRE, which is a “state capital.” 25A does this with “middle” instead; 7D does it with “Remain in.” 19A: Here’s another hidden hint that appears in puns: Even and odd. In this case, “Not even!” at the end of the clue wasn’t idiomatic — it meant that if you simply wrote the odd letters down, at the first, third, fifth, seventh and ninth position of “stagnation,” you’d have your answer: SANTO, a male saint.28A: “Quipped” cream and “Quedding” gowns have a letter substitution in common — “Qu” for “Wh” — that would make “white,” which describes both things, QUITE.29A: A clever little sound substitution combined with an anagram, “Eyes” in this case meant “i’s” — plus “that,” scrambled, gets you the “Polynesian island” of TAHITI. Let’s go!35A: Here we have the hint of omission; what letters are in this sequence? NOT E. (A similar tactic will help you solve 49D.) 44A: And here we have something else left out. “Reduced salt,” or sodium, becomes ODIUM.48A: Ah, here’s the “e” we were missing in 35A. It’s little and there’s a period in front of it — DOTE, in other words. This same thought pops up with 5D, that red O.51A: Here’s a fill-in-the-blanks; if you deduce the three missing letters as CPU, that’s your “computer guts” right there. This trick pops up at 9D and 32D.53A: An “I” atop an “IC?” That’s IONIC.59A: If an undercover agent gets her mission in a letter from the agency, does a cyberspy get her EMISSION via email?3D: This clue strikes me as highly original (Agardian?). If a magician makes the lady disappear with a poof, then “proof!” could conceivably make something VARNISH, right? 8D: This was another clever bit. Think of L.A. for Hollywood — thugs from there would be LAGOONS.11D: This is one of those unfathomable-to-anyone-else-but-us little things. The 3rd, 4th and 6th letters in October? That would spell TOE.28D: My least understood clue of the day, I think. I see the “Q&A” on the sailor, or “tar,” to get QATAR; I don’t quite know where “home” fits in. 41D: A big hill, i.e., is a MOUNTIE.52D: Tricky combo, Mr. Agard! The next letter after “nu, xi, omicron …” is PI; there are eight more characters in the Greek alphabet, and you’re to put those in the postscript, or P.S., to get PIPS.57D: Almost done! If you’re carnivorous, go get yourself a nice grass-fed steak — a RIB-eye, perhaps.What did you think?Advertisement"}