{"id": "The Rhine, a Lifeline of Germany, Is Crippled by Drought", "paragraph": "Supported byBy Christopher F. SchuetzeKAUB, Germany — Just after sunrise, Capt. Frank Sep turned to his ship’s radio for the defining news of his day: the water level in Kaub, the shallowest part of the middle section of the Rhine, Germany’s most important shipping route.The news was bad, as it so often is these days.One of the longest dry spells on record has left parts of the Rhine at record-low levels for months, forcing freighters to reduce their cargo or stop plying the river altogether.Parts of the Danube and the Elbe — Germany’s other major rivers for transport — are also drying up. Some inland ports are idle, and it is estimated that millions of tons of goods are having to be transported by rail or road.With castles and vineyards dominating the river banks near Kaub, just five miles from the Lorelei rock, named for a siren who was said to lure sailors to their deaths, it would be easy to forget how important the area is to German commerce. It is roughly halfway between the inland ports of Koblenz and Mainz, and virtually all freight shipped from seaports in the Netherlands and Belgium to the industrial southwest of Germany passes through here.On a day in late October, Captain Sep learned that the river was just 10 inches deep. That meant the water in the man-made shipping channel dredged near the center of the river was about five feet deep, down from an average of about 11 feet. Even with cargo at one-third of its usual weight, his 282-foot freighter Rex-Rheni — the King Rhine — would have only inches of water under its hull.“I’ve never experienced so little water here,” said Captain Sep, who has been working on the river since 1982, the last 22 years on the Rex-Rheni. “It’s becoming so low that it’s very difficult for ships to pass.”An exceptionally dry summer has caused havoc across Europe. A trade group in Germany put farmers’ losses at several billion dollars. The German chemical giant BASF had to decrease production at one of its plants over the summer because the Rhine, whose water it uses to cool production, was too low.Gas stations in the region that rely on tankers to deliver fuel from refineries in the Netherlands have run out. And the wreck of De Hoop, a Dutch freighter that sank after an explosion in 1895 and is normally submerged, now lies exposed on the Rhine’s banks.About half of Germany’s river ferries have stopped running, according to the Federal Waterways and Shipping Administration, and river cruise ships are having to transport their passengers by bus for parts of their journey. Thousands of fish in the Swiss section of the river died because of the heat and low oxygen levels.There are reasons to believe such weather will become more frequent with a warming climate.“Our research shows an increase in instability,” said Hagen Koch, who studies rivers at the Potsdam Institute for Climate Impact Research. “The extremes are going to happen more often.”It’s difficult to overstate the importance of the Rhine to life and commerce in the region.“It’s simply the most important river in Germany,” said Martin Mauermann, head of the hydrology and water management section of the federal body responsible for waterways. “It’s like the thick branch in the middle of the tree.”Roughly 80 percent of the 223 million tons of cargo transported by ship in Germany each year travels the Rhine, which links the country’s industrial heartland to Belgium, the Netherlands and the North Sea. An exact tally of how much is being diverted to rail and road is not yet available, but “it is a significant number,” said Martyn Douglas of the German Federal Environment Agency.While most freight can simply — albeit often more expensively — be put on rails or wheels, some cannot. A shipping company, Kübler Spedition, specializes in heavy and oversize freight that cannot be carried for more than a couple of miles on roads. Because ships carrying the heavy components of a wind farm can no longer reach the company’s terminal in Mannheim, Kübler’s storage area lies empty.“It’s effectively stopped the building of the wind farm entirely,” said Robert Mutlu, who runs the terminal.Just before reaching Kaub, Captain Sep slowed his ship to a crawl. The forward thrust generated by a propeller drives a ship deeper, so a slower ship is slightly higher in water. The reduced speed would also make pulling the boat off rocks easier, if the worst were to happen.The number on the Rex-Rheni’s digital depth meter dropped, and dropped some more, eventually showing only about 25 centimeters, or 10 inches, of water below the ship.It passed the Pfalzgrafenstein Castle, which resembles a large, stationary boat in the river. Built in the 14th century to collect tolls, it has a windowless foundation to withstand the Rhine’s high water levels. Today, the foot of the building is at least five feet above water.The Rhine’s flow relies not just on annual rainfall, but also on enormous long-term reserves of water in the Alps. Melting snow and glaciers, as well as Lake Constance, feed the upper parts of the river, but with climate change, those reserves are lower, Dr. Koch said.The shipping lane could be made deeper, but that would take years, if not decades, and would cost millions. And even if that were to succeed, it would remove only one bottleneck on a river that is just starting to show how many trouble spots it has.“Low water events will be more frequent,” said Mr. Douglas of the Federal Environment Agency, “and at the same time the Rhine fleet is becoming bigger and heavier.”When the Rex-Rheni was built in 1966, it would have been considered a big ship. Today, at least under normal conditions, it would be one of the smaller ones on the Rhine, where it is not unusual to see a 600-foot freighter capable of hauling 6,000 tons — when there is at least 12 feet of water.A clause in German shipping contracts that allows ships to set their own prices when the water level is below about 32 inches at Kaub makes such trips worthwhile for smaller boats, even if their holds aren’t full. But the clause cannot make the river deeper.“We need the level in the Bodensee to rise,” said Martin Deymann, using the German name for Lake Constance. His 35 ships stopped transporting goods along the middle section of the Rhine last month. “We need rain, and hopefully it will come before it becomes cold and it comes down as snow.”Follow Christopher F. Schuetze on Twitter: @CFSchuetze.Advertisement"}