{"id": "Trade War and Censors Blow Chill Wind Through China's Giant Tech Scene", "paragraph": "Supported byBy ReutersBEIJING — Wang Miaoyi's small one-bedroom apartment, which doubles as her design studio, is overflowing with game magazines, figurines and boxes of sci-fi novels.The 30-year old game developer is a child of the county's tech boom: she studied at one of China's top universities and her company hit it big with an award-winning game that was published on Nintendo's Switch console and the PC gaming platform Steam, with plans for roll-out on other game platforms. Now her ambitions - and those of many others across China's giant tech industry - are facing a reckoning, amid rising state control over the sector, tightening regulation and a biting trade war with the United States stymieing growth.\"(In 2015) doing a start-up was popular. So many young people set up small businesses, like developing games, and dreamed of making big money as well as being free,\" she said. \"But they found out now it's really unrealistic.\"Wang says she has had to abandon for now hopes of releasing the game on new platforms in China, closing the original studio that developed it and working instead on updates with a skeleton crew of freelancers. She has moved from the Beijing tech hub of Zhongguancun to the city's cheaper far-west outskirts to cut costs.She is not alone. Reuters interviewed a dozen tech industry insiders, from gig economy workers to investors, who said that the boom days of easy returns looked to be over.Until last year, China's tech industry had enjoyed years of breakneck growth. Firms including Alibaba Group Holding Ltd and Tencent Holdings Ltd almost doubled in value in 2017 alone, making big-ticket investments as part of a multi-billion dollar expansion into cloud, offline retail and finance.But now the market is feeling the pinch. Hiring numbers are down, company margins are thinner and tumbling technology stocks have wiped nearly half a trillion dollars this year from the value of China's top listed tech firms.The biggest names in tech have flagged concerns, including Alibaba and Baidu Inc, who revised down their full-year sales forecasts in recent weeks on the weaker outlook.\"Investments into the tech space have definitely cooled down, measured by almost every metric: number of deals, deal size or fund raising,\" said Zhang Chenhao, Shanghai-based Managing Partner at technology-focused Prometheus Fund.\"I think this year is the first time over the last 30 years when greed yields to the fear.\"HAND OF THE STATEThe technology sector is facing challenges on all sides.A broader economic slowdown saw China's third quarter GDP slow to its weakest pace since the global financial crisis. The currency has slid against the dollar and domestic markets are down sharply. Alongside a series of tit-for-tat trade tariffs, the United States has accused China of stealing technology, barring tech acquisitions by Chinese firms and blacklisting others.At home, tech companies from social media to gaming and fintech have seen tightening regulation and a heavier hand from the ruling Communist Party.Gaming and social media giant Tencent has seen its stock price dive by more than 25 percent this year amid a temporary ban on licenses for games, its top revenue driver.At the country's top internet forum in Wuzhen this week, officials signaled they would look to rein in the country's tech giants. \"They can be big but we should also be well-regulated,\" said Gao Xiang, vice minister of China's Ministry of Industry and Information Technology on Thursday.China's regulators have already cracked down on everything from rude joke apps to livestream bloggers disrespecting national anthem - sending a chill through the free-wheeling and innovative online arena. \"The people who worry about technology is first older people, second government and third successful people, they hate it and worry about it,\" Alibaba's billionaire executive chairman Jack Ma said at an event in Shanghai last week.\"Normally businesses do innovation and governments talk innovation. In order to protect yesterday's interests... they will say please don't do it.\"This year Alibaba has lowered its revenue forecast for the first time since listing in 2014.Meanwhile, local ride-sharing giant Didi Chuxing, backed by Japan's SoftBank Group Corp, has cut the subsidies it pays to drivers after being forced to shutter its car-pooling services under a plan agreed with regulators following criticism over the murders of two young female passengers in separate incidents.\"(In 2015) I bought my first vehicle because you could earn almost 800 yuan a day with the subsidies,\" says Huang Sun, who used to drive full-time for the company but now says he only takes rides when he is bored. \"Now maybe you can't even earn 200 yuan if you drive all day.\"HIRING FREEZEThe chill across the tech industry is reflected in hiring data.According to statistics released by leading local job website Zhaopin.com, job demand in the IT and internet sector has dropped by 51 percent as of September compared with a year earlier.Companies have slowed hiring in certain fields, including sales and software development, recruiters and human resources staff at Alibaba and Tencent said, asking not to be named because they were not authorized to speak to press.Tencent did not respond to a request for comment. Alibaba had no immediate comment.\"In general, they are all reducing headcount, or they're not preparing a very big budget for headhunting,\" said Mocca Wang, who is the director of the IT industry unit at international recruitment firm Spring Professional, which works with companies like Alibaba, Tencent and Baidu. Smaller start-ups, a key driver of growth in the sector, are also being squeezed by tighter access to credit.\"These companies can't get capital and can't invest,\" said Wang. \"They're going bankrupt.\"China's tech firms are, to be sure, still posting sales growth rates above overseas peers.Tencent chief Pony Ma told state television in a recent interview that there was still \"tremendous potential\" in the market, though admitted \"there are challenges of various kinds right now\".But the numbers suggest tougher times lie ahead - a worry for China's steeply-valued private tech start-ups and newly-listed firms such as smartphone maker Xiaomi Corp and Tencent-backed food deliver giant Meituan Dianping.\"Before the feeling was that anyone can get funding, that if you throw out words like blockchain, AI, big data and machine learning that would get you funding,\" said Benjamin Speyer, managing director at Hangzhou-based consultancy Serica.\"Now everyone is a bit more nervous about potentially making a mistake with their money.\"Alibaba, whose China commerce sales growth dropped to its lowest rate since 2015 in the last quarter, said it would take less income from its platforms for the near future, effectively subsidizing merchants, in an effort to retain brands on its platform. Competitor JD.com Inc, which posted a loss last quarter, is seeking to revive profits by outsourcing some of its 2.5 million square meters of warehouse space.The country's upstart technology workforce are even more keenly aware of the slowdown.Even as property and living costs continue to rise sharply in major cities such as Beijing and Shanghai, tech workers say salaries can't keep up. Beijing-based Liu Wangwei works as a software engineer at one of the country's highest-valued start-ups and rents a two-bedroom apartment because his partially-disabled mother often stays with him.He said his rent has risen by almost 50 percent since they moved to the area in 2014 and says he is considering moving to another of the company's offices in a smaller city where the government subsidizes housing for technology workers.\"I always thought I could join the well-known tech companies and never worry about money,\" said Liu. \"When I was in university our teachers gave us encouragement to be like (Steve) Jobs and Jack Ma. It's not the same as we were promised.\" (Reporting by Cate Cadell; Editing by Adam Jourdan and Alex Richardson)Advertisement"}