{"id": "What if Holidays Could Save the Planet?", "paragraph": "Supported byBy Laura M. HolsonIt didn’t take long after Hurricane Sandy swept through New York in late 2012 for holiday shoppers to return to downtown boutiques and Fifth Avenue stores. I, on the other hand, stayed home.Maybe it was the waiter I met who lost his apartment when a wave roared through his living room. Or perhaps it was seeing trees in Central Park ripped from the ground and toppled by fierce winds. Indulging in the excesses of the season didn’t seem right. So, aside from sending cash and clothes to those in immediate need, I took a more earth-friendly approach to holiday gift-giving that year. I made a donation in the name of my family to the Central Park Conservancy, which used the money to plant hundreds of tulips and daffodils everyone could enjoy in the spring.As they did then, Americans have taken an environmental hit this year. This week, California was ablaze from Malibu to Chico. Homeowners in Florida and Georgia continue to reel from Hurricane Michael. And the evidence for human-caused climate change continues to mount, with reports of the polar ice shelf melting and extreme weather shifts.So it is no surprise, perhaps, that some people are preparing for the coming holidays with Mother Earth in mind. Indeed, many are giving directly to charities that help victims of the fires and people uprooted by hurricanes. And donors have already given money to the annual New York Times Neediest Cases Fund.They, too, are exploring less wasteful ways to decorate and entertain. And companies are touting eco-friendly presents. Neiman Marcus, for example, which each year publishes a look book of extravagant gifts, is selling a solar-powered yacht for $7.1 million. (Environmentally friendly, clearly, doesn’t equal cheap.) If a yacht busts your budget, Oprah Winfrey is recommending a $20 set of reusable straws on her holiday list this year (although there’s evidence the straw menace is exaggerated).And then there are those who are opting for familial experiences and helping local charities over conspicuous consumption. “All of us feel the onslaught from the world,” said Ken Fulk, the founder of St. Joseph’s Arts Society and a cultural curator based in San Francisco. “There is the craziness of climate change, the continued presence of natural disasters. And then, of course, there is the state of public discourse today.”Even gift-wrapping is getting a second look. It wasn’t long ago that Martha Stewart offered improbable recommendations like wrapping presents in birch bark and fresh leaves, or using air-popped popcorn and unsalted peanuts to pack boxes. (Merry Christmas, mice!)Instead, David Stark, an event designer who has planned soirees for the Metropolitan Opera and the Whitney Museum, said he uses leftover fabric swatches to wrap presents, or a dish towel to swaddle a cookbook before placing it under the tree.“And have you seen how the French wrap gifts?” he asked in a phone interview this week. “They wrap without tape!” That’s a boon for gift-getters who want to make sure once-used Hanukkah and Christmas wrapping doesn’t go to waste. “It’s the tape that destroys the paper,” Mr. Stark said knowingly.Kwanzaa seems tailor-made for the eco-friendly movement. Celebrated in December for seven days, the holiday was created in 1966 to celebrate African values and culture. Gifts are traditionally handmade, to show respect for family ancestors.Eco-friendly merrymaking has been embraced for decades. It just happens to go in and out of public consciousness. In 2009, Barack and Michelle Obama decorated their 18½-foot tree at the White House with LED lights that consume less energy than traditional bulbs. They also used 800 recycled ornaments from previous administrations, which were refurbished and hung on the tree.LED lights remain quite popular. And ornaments, which can be reused for decades, have their own appeal. Mr. Fulk said he spends two weeks in Montana at Christmas and buys a live tree that later gets planted. “It only stays fresh for about 10 days inside,” he said. “But if you don’t mind not having a tree up for a month, it’s fine.”Mr. Fulk plans events for Silicon Valley’s wealthy technorati, and many of his wealthy clients still want sumptuous flower displays at holiday parties. That sometimes gives him pause. “You don’t want this stuff to just end up in the garbage,” he said, So Mr. Fulk whisks bouquets away after the last guests leave and distributes them to local charities.He said mistletoe, a parasitic plant that has benefited from smart marketing, grows on the oak trees at his ranch in Napa Valley and is used for holiday decorations. “We forage when we go on hikes,” he said.[If you want to measure your impact on the environment, you can do so using a carbon footprint calculator.]Susan MacTavish Best, the founder of Living MacTavish, a lifestyle brand, said she forgoes buying holiday presents altogether, preferring to welcomes large groups of friends to her home year round. “I give them my time, my thought — and it is expensive to entertain, even though I love it,” she said. “Besides, do we need more things?”Mr. Stark concurred. “I definitely think that the desire to help other people instead of buying token, disposable stuff is more important now,” he said.I recently called Laura Hall, a development executive for the Central Park Conservancy, to see if she had seen an increase in donations to its tulip and daffodil planting program. Last year gifts jumped nearly one-third to $110,000, its largest year ever, from 2016. “People feel like they are doing something good for a lot of people,” she said.The conservancy is taking a cue from online retailers. She said it was having a sale on Cyber Monday: It will plant 50 bulbs for a $40 donation, a 20 percent discount.I know what I’m giving my family for Christmas this year.Advertisement"}