{"id": "Lelisa Desisa Wins the New York City Marathon in the Last Miles", "paragraph": "Supported byBy Ken BelsonAs Lelisa Desisa of Ethiopia raced through Central Park in the closing miles of the New York City Marathon on Sunday, all eyes were on Geoffrey Kamworor of Kenya, the winner of last year’s race, who was just ahead of him.Kamworor looked in control, his legs pumping smoothly, his face calm. Desisa, by contrast, had a pained look in his eyes, and his arms were swinging widely.But as the two sprinted downhill, Desisa ripped off his running cap as if he had had enough of their miles-long dogfight. Kamworor took off his cap, too, as if to meet the challenge. But in an instant, Desisa overtook Kamworor, turned right onto Central Park South and never looked back over the final mile.Desisa crossed the finish line in 2 hours 5 minutes 59 seconds, the second-fastest time in the race’s 48-year history. It was his first victory in New York after three previous tries.“Today is my day,” Desisa, 28, said on the podium, only the third Ethiopian to win the race. “I’m very, very happy.”[Mary Keitany won the women’s race in today’s New York City Marathon.]Desisa, who has also won the Boston Marathon twice, held off not only Kamworor, but also Shura Kitata, who had led most of the race but fell behind as the leaders ran down Fifth Avenue. Kitata, also Ethiopian, re-emerged in the final mile to pass Kamworor as he tried to catch Desisa.“Because I led from the beginning, I really felt the effort in my legs, and therefore I had fallen back,” Kitata said. “As that effort started to fade, I began to move up, and once my legs were starting to feel better, I was confident that I could be second.”Desisa, who finished third last year in New York, said he noticed Kitata catching up to him with about a half mile to go, and knew Kitata had a good kick. But he held off his countryman by two seconds, in the second-closest finish in the New York City Marathon.Kitata, 22, finished in a time of 2:06:01, while Kamworor crossed the line in 2:06:26. They ran the second-, third- and fourth-fastest times in race history. The course record is held by Geoffrey Mutai, who ran 2:05:06 in 2011.The 26.2-mile race took place in near-perfect conditions, with little wind and temperatures in the low 50s, and started as many marathons here do, with a large pack of elite runners bunched at the front as they glided over the Verrazzano-Narrows Bridge, the highest point on the course.Unlike major marathons in Berlin and Chicago that are run on flat courses and use pacesetters to induce world records, New York City’s course has many hills and sharp turns that tend to produce tactical races favoring those who have run the course before and who finish fast. Desisa and Kitata, for instance, have each run more than a full minute faster on other courses.Kitata was making his debut in New York and appeared to make a rookie mistake by jumping in front early and pushing the pace. The runner-up in the London Marathon this year, Kitata was unable to shake a pack of runners that included Kamworor, Desisa and Daniel Wanjiru of Kenya, who won the London Marathon in 2017.Kitata held his ground as the pack caught up to him coming off the Queensboro Bridge, the second-highest point in the race, around Mile 16. At that point, the lead runners were on pace to run about 2:07, a very fast time for New York. As the group headed up First Avenue, Kamworor started to assert himself. He let Kitata push the pace, but a couple of times, he motioned to other runners to help box in Kitata.But the lead pack was down to Kitata, Desisa and Kamworor as they passed quickly through the Bronx, down the Madison Avenue Bridge and back into Manhattan. Heading down Fifth Avenue, Kamworor took off his gloves and threw them to the ground, as if to taunt Desisa and Kitata.Kitata slowed and appeared spent, but Desisa stuck with Kamworor as they entered Central Park with about two miles to go. The race was turning into a replay of last year, when Kamworor held off Wilson Kipsang in a sprint to the finish.But this time, Desisa flipped the script with his own bit of theatrics and a punishing last mile. For his efforts, Desisa will receive $100,000 for winning the race and $45,000 for finishing faster than 2:06. (Many elite runners also receive appearance fees and have their expenses covered by the marathon organizers.)The men’s wheelchair race also went down to the wire as Daniel Romanchuk of the United States held off Marcel Hug of Switzerland, who was trying to win the event for the third consecutive year. Romanchuk, who at 20 is a dozen years younger than Hug, became the first American to win in the 18-year history of that division in New York.They were joined by David Weir of Britain, and the three were never more than a few seconds apart as they sped through the course in near-record time. Romanchuk, who trains at the University of Illinois, shook Hug in the final sprint, crossing the line just over one second ahead in a time of 1:36:21.Asked how he felt crossing the finish line, Romanchuk spoke for many athletes on Sunday. “I need air,” he said, “and I’m in pain.”Advertisement"}