{"id": "The Internet Will Be the Death of Us", "paragraph": "Supported byIt casts rogue grievances as legitimate obsessions and gives prejudices the shimmer of ideals. By Frank BruniOpinion ColumnistNora Ephron once wrote a brilliant essay about the trajectory of her and many other people’s infatuations with email, from the thrill of discovering this speedy new way of keeping in touch to the hell of not being able to turn it off.I’ve come to feel that way about the whole of the internet.What a glittering dream of expanded knowledge and enhanced connection it was at the start. What a nightmare of manipulated biases and metastasized hate it has turned into.Before he allegedly began mailing pipe bombs to Barack Obama, Hillary Clinton and others, Cesar Sayoc found encouragement online — maybe not in the form of explosives instructions, but in the sense that he could scream his resentments in a theater that did the opposite of repudiating them. It echoed them back. It validated and cultivated them. It took something dark and colored it darker still.“By the time he was arrested in Florida on Friday,” The Times reported, “Sayoc appeared to fit the all-too-familiar profile of a modern extremist, radicalized online and sucked into a vortex of partisan furor.”Robert Bowers, accused of murdering 11 Jewish Americans in Pittsburgh the morning after Sayoc’s arrest, stoked his madness and nurtured his bloody fantasies in that same online vortex. While Sayoc carved out ugly niches on Facebook and Twitter, Bowers found even safer harbor for his racist, xenophobic and anti-Semitic passions on Gab, a two-year-old social network that has served as a nursery for white nationalists. There they congregated, commiserated and riled up one another with an unfiltered efficiency that simply doesn’t exist offline.It was on the internet, with its privacy and anonymity, that Dylann Roof researched white supremacy and formulated his evil conviction that violence was necessary. He then went into a historic church in Charleston, S.C., and fatally shot nine African-American parishioners in June 2015.It was on the internet — on Facebook, to be exact — that Alek Minassian posted a pledge of allegiance to the “incel rebellion,” which refers to the resentments of “involuntarily celibate” men who can’t interest the women around them in sex. He then used a van to mow down and kill 10 people in Toronto in April.Enclaves of the internet warped the worldviews of all of these men, convincing them of the primacy and purity of their rage. Most of us had never heard the term “incel” before the Toronto massacre. But it was the indelible centerpiece of Minassian’s life.Most of us were unfamiliar with HIAS, the shorthand for a Jewish group that resettles refugees. But those initials dominated Bowers’s anti-Semitic conspiracy theories. And that reflects the internet’s power to cast rogue grievances as legitimate obsessions and give prejudices the shimmer of ideals.Technology has always been a coin with two sides: potential and peril. That’s what Mary Shelley explored in “Frankenstein,” which is celebrating its 200th birthday this year, and it has been the main theme of science fiction ever since.The internet is the technology paradox writ more monstrous than ever. It’s a nonpareil tool for learning, roving and constructive community-building. But it’s unrivaled, too, in the spread of lies, narrowing of interests and erosion of common cause. It’s a glorious buffet, but it pushes individual users toward only the red meat or just the kale. We’re ridiculously overfed and ruinously undernourished.It creates terrorists. But well shy of that, it sows enmity by jumbling together information and misinformation to a point where there’s no discerning the real from the Russian.Don’t take it from me. Take it from a Silicon Valley giant whose wares depend on our internet addiction. Speaking at a conference in Brussels, Tim Cook, the chief executive of Apple, warned, “Platforms and algorithms that promised to improve our lives can actually magnify our worst human tendencies.”“Rogue actors and even governments have taken advantage of user trust to deepen divisions, incite violence and even undermine our shared sense of what is true and what is false,” he added.This was a week ago — before Sayoc’s arrest, before Bowers’s rampage, before Jair Bolsonaro, a far-right populist, won Brazil’s presidential election. As The Times reported, pro-Bolsonaro forces apparently tried to hurt his opponents and help him by flooding WhatsApp, the messaging application owned by Facebook, “with a deluge of political content that gave wrong information on voting locations and times.” That same Times article noted that a search for the word “Jews” on the photo-sharing site Instagram on Monday led to 11,696 posts with the hashtag “#jewsdid911,” insanely blaming them for the attacks that brought down the World Trade Center, along with similarly grotesque images and videos that demonized Jews. Anti-Semitism may be ancient, but this delivery system for it is entirely modern.And utterly terrifying. I don’t know exactly how we square free speech and free expression — which are paramount — with a better policing of the internet, but I’m certain that we need to approach that challenge with more urgency than we have mustered so far. Democracy is at stake. So are lives.I invite you to sign up for my free weekly email newsletter. You can follow me on Twitter (@FrankBruni). Frank Bruni has been with The Times since 1995 and held a variety of jobs — including White House reporter, Rome bureau chief and chief restaurant critic — before becoming a columnist in 2011. He is the author of three best-selling books.   @FrankBruni • Facebook Advertisement"}