{"id": "Subway Fare That Stinks: Nachos, Meat ... Crab Legs?", "paragraph": "Supported byBy Emma G. FitzsimmonsIt is an unspoken compact among subway riders in New York City: If you are going to eat on the train, keep it simple. But sometimes, there are messy scofflaws.The subway’s leader, Andy Byford, drew a line in the sand this week, urging riders not to eat roast chicken on the train.“I don’t mind someone having a snack,” Mr. Byford said at a board meeting of the Metropolitan Transportation Authority on Monday. “A full-on subway meal or a roast chicken, leaving the bones all over the place, isn’t acceptable.”Mr. Byford, the president of New York City Transit, weighed in on the long-running debate about whether food should be banned on the subway during a board discussion about track fires. The current subway rules permit eating, though they prohibit carrying liquids in an open container — a provision that is rarely enforced. Carelessly tossed out food containers can cause fires.On Wednesday, Mr. Byford doubled down on his comments, telling reporters that the person he witnessed eating roast chicken had gone too far.“It’s impossible to come up with a definitive list,” Mr. Byford said, in reference to foods that are rude. “But I think it’s not considerate.”Last year, the authority’s chairman, Joseph J. Lhota, said he would consider banning food, as Washington’s Metro system does. Mr. Lhota cited a rider eating Chinese food that fell on the floor.Mr. Lhota said on Wednesday that food should not be banned, but that New Yorkers need to learn to be more polite about it.“I’m equally as offended as Andy is about seeing people drop the remains on the floor,” Mr. Lhota said. “It’s not necessary.”So in the absence of any official prohibition where exactly is the line when it comes to food on the subway? Riders voiced their opinions on Twitter this week, with reports of cheesy nachos, a carton of Ben & Jerry’s ice cream, King Crab legs and edamame pods spit on the ground. (All of which presumably would make it on Mr. Byford’s list.)One subway rider, Paul Brady, saw “a guy eating roast pork and fried rice with chopsticks out of a Styrofoam clamshell this very morning on the F.”It is an unofficial law that you “don’t eat anything with an aroma that exceeds your physical space, except pizza, but only if it’s obvious you’re eating it as fast as you possibly can,” Dan Rivoli, The New York Daily News transit reporter, posted on Twitter.Some foods, riders agreed, were fair game — and maybe even necessary if riders never know how long they will be stuck on a train. Others suggested that the authority had bigger problems, like the subway service. “I am offended by trains that don’t work,” one rider posted on Twitter.Mr. Byford, a respected transit leader who previously worked in London and Toronto, said he had never seen roast chicken on the subway in those cities. But he had seen other delicacies.“You see often in London, particularly on a Friday or Saturday night, you do see people eating burgers,” Mr. Byford said. “Eating a burger, I get it on a Friday night, you get the munchies. But don’t then drop half of your order on the floor and smear your hands on the seat.”Even Charles G. Moerdler, the M.T.A. board member who asked Mr. Byford about food, seemed to know he was raising a thorny issue.“To add kerosene to the fire, have you given thought to removing the right to sell food on the subway or to eat on the subway as a way to avoid rubbish accumulated on the tracks?” Mr. Moerdler said.For some, Mr. Byford’s comments ignore the reality that New Yorkers who juggle several jobs or have long commutes may be more pressed for time and their subway ride is the only chance they have to eat.In 2012, Mr. Lhota struck a more compassionate tone. He said he did not want to ban eating on the subway because it could hurt some communities. He said he had watched too many children eating breakfast on-the-go, like bagels or muffins.“I don’t want to deny the kid,’’ Mr. Lhota said, “the only time that day he’s going to get food.”Advertisement"}