{"id": "With Migrant Caravan, Trump Stokes a Familiar Fire: Immigration", "paragraph": "Supported byBy Jeremy W. Peters and Julie Hirschfeld DavisOMAHA — The guests at the Republican Business and Professional Women’s candidate forum were halfway through dessert when Representative Don Bacon offered to take their questions.“There’s a thousand immigrants coming to our border again. From Honduras,” one woman called out. “And we’re unable to stop them without giving them asylum.”Then a second woman asked about immigration. And a third. And a fourth. And a fifth.Mr. Bacon, a centrist Republican seeking re-election in the only district in Nebraska that voted for Barack Obama in 2008 and sent a Democrat to Congress as recently as 2014, struggled to move the conversation along, alluding to “a breakdown in the rule of law” and his support for immigration measures that Democrats had blocked.But soon the banquet room, filled with a few dozen people who appeared mostly white and in their 60s and 70s, broke into chants of “Build the wall! Build the wall!”Barely two weeks away from an election that threatens to sweep Republicans from power in the House of Representatives and dash any lingering hope of conservative immigration reform, the party, led by President Trump, is leaning more aggressively into dark portrayals of undocumented immigrants in a bid to galvanize voters.Mr. Trump, whose political appeal among his core voters has largely been rooted in warnings about illegal immigration as a threat to American security, sovereignty and identity, has stepped up his hard-line, inflammatory attacks on Latin American migrants as he travels the country campaigning to save Republicans’ majorities in the House and Senate.[Read a Times fact check about the caravan.]His renewed emphasis on the issue reflects the belief by strategists in both parties that Republican candidates often benefit if they can link illegal immigration to crime, economic insecurity and terrorism — all resonant concerns with swing voters, especially women — and portray Democrats as too spineless to tackle the problem.Mr. Trump is also trying to link the issue to another powerful factor in the midterms: himself. With his legislative agenda’s fate on the line, Mr. Trump, without offering any evidence, is accusing political opponents of orchestrating an invasion of foreigners so he and the Republicans will lose in November.On Twitter, he called a traveling band of migrants making its way north from Latin America “Democrat Party-led” and an “assault on our country.” Later, at a rally in Montana for Matt Rosedale, the Republican candidate for Senate there, he accused his enemies of funding the caravan.“A lot of money has been passing to people to come up and try and get to the border by Election Day, because they think that’s a negative for us,” he told the crowd. (How this would be a negative, he left unexplained, though he has falsely blamed his loss in the popular vote in 2016 on illegal voting by undocumented immigrants.)In a Twitter post on Saturday, Mr. Trump hammered Democrats for being “obstructionists” on immigration reform. “Look at the needless pain and suffering that they are causing,” he wrote, imploring the Democratic leaders in the House and Senate, Nancy Pelosi and Chuck Schumer, “Call me!”It did not appear that call would be coming. Democrats, in what amounts to a tacit acknowledgment of the power of Mr. Trump’s rhetoric, have mostly refrained from responding directly to his unfounded charges. In a joint statement on Saturday, Ms. Pelosi and Mr. Schumer said the president was “desperate to change the subject from health care to immigration.”Immigration has become a “threshold issue” that motivates voters almost as a proxy for how they feel about the president, said Sam Nunberg, a former aide to Mr. Trump’s presidential campaign who has been studying how to galvanize base voters with immigration hawks in the party like Stephen K. Bannon, the former White House chief strategist.Explaining how Trump supporters were likely to view illegal immigration, Mr. Nunberg said, “Once again, we believe that Donald Trump is under attack, and that the Democrats are orchestrating it.”Across the country — from states with small foreign-born populations like Montana to ones where immigrants are a major political constituency like Florida — Republicans have borrowed from Mr. Trump’s playbook. In Indiana they are attacking Senator Joe Donnelly, a vulnerable Democrat, as “Mexico Joe,” a reference to a questionable accusation that he profited after his brother’s business outsourced jobs. In Missouri, Josh Hawley has repeatedly accused his opponent, Senator Claire McCaskill, of favoring “open borders,” a misleading term the president often deploys against Democrats to falsely assert that they oppose enhancing border security.Hey, I’m Alex Burns, a politics correspondent for The Times. Send me your questions using the NYT app. I’ll give you the latest intel from the campaign trail.As he rails against Democrats for blocking his immigration reforms, Mr. Trump has found an eager and receptive audience in Republican voters who have been primed by months of television ads from conservative political groups. These warn that Democratic control of Congress would mean lawless “sanctuary cities” where immigrants murder and sell drugs with impunity; a dangerous liberal effort to “abolish I.C.E.,” the border security agency; emboldened MS-13 gangs; and “open borders.”Some strategists who have been advising Democrats on immigration issues have instructed them not to get drawn into a detailed debate by Republicans seeking to attack their positions, but to quickly pivot to friendlier terrain such as health care and wages.“They’re not going to fall for his race-baiting divisiveness; they’re going to promise to bring people together to address everyday challenges,” said Frank Sharry, the executive director of America’s Voice, an immigration advocacy group.The story of “the caravan,” a long chain of Latin American migrants that makes its way north each year seeking refuge, became a sensation on the right in April after a smaller group made its way through Mexico and garnered widespread media attention for the first time, catching the president’s eye.The caravan has the components that make it a blockbuster in conservative media — and irresistible for Mr. Trump. It features striking visual elements: images of thousands of Latin American men, women and children in a procession so large it sometimes fills the width of a city street. Though reports often suggest that the migrants are headed to the United States to declare asylum, many remain in Mexico.The migrants cite various reasons for their journey. Some say they are fleeing gangs that terrorize their neighborhoods. Others cite searching for work and more stability for their families. Advocacy groups have, in the past, used caravans to draw attention to the desperate situation in countries like Honduras and push the United States to relax its immigration laws.Coverage of the caravan has become a vehicle for other conspiratorial story lines that are popular on the right. Sometimes they spread with the help of the president.Last week, for example, Mr. Trump posted video of a large crowd of Spanish-speaking people in lines being handed cash — presumably the payments he was referring to in Montana.“Can you believe this, and what Democrats are allowing to be done to our Country?” the president said on Twitter.But before Mr. Trump sent out his tweet, Representative Matt Gaetz, a Florida Republican who is an outspoken ally of the president’s, circulated the video, hinting that it revealed a Democratic plot funded by George Soros, the billionaire progressive philanthropist and donor, to overrun the country with immigrants weeks before the elections. In right-wing media outlets, Mr. Soros is often the caravan’s hidden architect. There is no evidence he has played any role in financing the caravans.Most Republicans are not unhappy with legal immigration, polling shows. An independent Grinnell College survey conducted in late August and early September found that just 21 percent of Republicans said the country had too many legal immigrants, compared with 12 percent of Democrats.The Grinnell poll also found Republicans were more likely to be worried about illegal immigration. Fifty-two percent incorrectly believed that undocumented immigrants committed more violent crimes than the general population, compared with 28 percent of Americans who believed that.In polling conducted for Mr. Bannon, the issue of illegal immigration substantially affected voters’ perceptions of the two parties, helping to shrink a 9-point advantage for Democrats to 2 points.Democrats have noticed a similar dynamic. Polls conducted over the summer by the progressive Center for American Progress and centrist Third Way found that, particularly in states and districts Mr. Trump won in 2016, voters were concerned about the idea of sanctuary cities — jurisdictions that limit their cooperation with federal immigration authorities. The findings indicated these voters were prone to be persuaded by misleading attacks that portrayed sanctuary cities as lawless places where undocumented immigrants could commit crimes without consequences. The attacks fell flat with college-educated voters, researchers found, but appealed to white voters without a college education, older women and Independents.The issue is often powerful in the most competitive races, like Mr. Bacon’s.In Nebraska, polling conducted by the Congressional Leadership Fund, a Republican super PAC, consistently found that the top two issues for voters were immigration and health care.Mr. Bacon’s district, which covers most of Omaha and its suburbs, is 1,100 miles from the Mexican border and 73 percent white. Like many Republicans who have tried to spend their time with voters talking up the growing economy and lower tax rates, he is finding that immigration keeps coming up. In an interview after his remarks to the Republican businesswomen’s club, Mr. Bacon described an exchange he had just had with a constituent. “She goes, ‘Don, we don’t care if they separate families,’” to which the congressman said he replied, “Well, you’re in the minority.”“I said I can’t do that,” Mr. Bacon added. “I have to be honest.”Jeremy W. Peters reported from Omaha and Julie Hirschfeld Davis from Washington.Advertisement"}