{"id": "Why So Many Kentuckians Are Barred From Voting on Tuesday, and for Life", "paragraph": "Supported byBy Michael WinesLOUISVILLE — Stephon Harbin leans Democratic but says he resents being pigeonholed in one party. House Speaker Paul Ryan, for instance, strikes an intellectual chord with him despite being a Republican. For Mr. Harbin, following politics is part of a civic duty to make his city a better place.“The only way it’s going to change is if you’re instrumental in the change. It has to be a team effort,” Mr. Harbin said recently as he sat in the living room of his bungalow in Louisville’s California neighborhood, southwest of downtown. “I’d run for office, if I could.”But Mr. Harbin, who is 47, cannot run for office. Twenty-nine years ago, he was arrested for selling cocaine — a scheme, he said, to pay for his freshman year in engineering school at the University of Louisville. The ensuing felony conviction, and another that followed two years later, stripped him of his political rights for life.His first arrest came when he was 18, and he was convicted barely two weeks before Election Day. “I never had the opportunity to vote,” he said.Nationwide, some 6.2 million citizens cannot vote or hold office because they have felony records. But only Kentucky, Iowa and Florida impose lifetime bans, and polls indicate that Floridians are poised to approve a constitutional amendment on Tuesday that would restore rights to 1.4 million residents who have completed their sentences.Since 1990, changing attitudes have led many other states to ease bans on political participation by those with felony records.Kentucky is an outlier. Nearly one in 10 of the state’s adults, and one in four African-Americans, has a felony record that bans them from voting for life, according to The Sentencing Project, a criminal justice advocacy group. It is the nation’s highest rate of black disenfranchisement, the group says, and among African-American males like Mr. Harbin, the rate is considered even higher: an estimated one in three.Those astounding rates are the product of the tough-on-crime ethos of the 1980s and 1990s, when crushing penalties were imposed for nonviolent violations like low-volume drug sales and failure to pay alimony.The share of voting-age Kentuckians with felony records rose nearly fourfold from 1980 to 2010. Among the state’s black residents, it grew nearly sevenfold. Despite changes to criminal sentencing guidelines seven years ago and a declining crime rate, the state’s prison population continues to rise, with well over half the 24,000-plus prisoners warehoused in overcrowded county jails.But politicians have been whipsawed between the progressive impulses of the state’s cities and its traditional culture. In 2015, Kentucky’s departing Democratic governor issued an executive order restoring voting rights to 140,000 residents with nonviolent felony records, only to see his Republican successor reverse the edict shortly after taking office. The state legislature voted in 2016 to erase records of the least serious felonies, but only after a costly and sometimes arduous expungement process. In two years, the state has granted expungements in only 1,663 cases, and denied them in another 171.Senator Mitch McConnell, the Senate majority leader, staked out an unequivocal position on voting rights for those with felony records earlier this year. His political rise is rooted in Louisville, the state’s largest city and a Democratic bastion.“Voting is a privilege,” he said. “Those who break our laws should not dilute the vote of law-abiding citizens.”Political scientists suggest that Mr. McConnell might never have attained the Senate had those with felony records been allowed to vote when he first sought the seat in 1984. An analysis of that campaign in 2002 concluded that Mr. McConnell’s 5,200-vote victory in that razor-thin race would have been converted to a narrow loss had felons been allowed to cast ballots.Supporters of restoring voting rights argue that banning those with felony records from casting ballots removes an important incentive for them to rebuild their lives.“How can we take scores of thousands of people out of our democracy and put them on the shelves?” said Edward C. Monahan, who was the state’s chief public defender until 2017. “We should be tripping over ourselves to get these people back into the community. Instead, we’re putting handcuffs and leg irons on people for the rest of their lives, even after they’ve completed their sentences.”Removing the political rights of one in four African-American voters cannot help but have an impact on a neighborhood and its people, said State Senator Gerald A. Neal, who represents part of Louisville’s largely African-American West End. The smaller a community’s voice, the harder it is to get streets paved and trash collected, and the more its citizens feel powerless, he said.“This is all about power within a democracy,” he said.Louisville’s California neighborhood — so called, it is said, because it seemed like the city’s remote west at its founding in the 1840s — is among the city’s poorest. By the 1970s, the area and the nearby Southwick housing project became centers for marijuana deals, followed by cocaine and crack trafficking.“We were looked on as a gang, but on the inside it was one big family trying to get through hard times,” said Norman Parker, 35, who grew up in the neighborhood in a family of five children. “As a kid, all I saw was hanging and drug dealing. Just by natural instinct, that’s what I grew into.”Mr. Parker was found guilty in 2002 of selling an ounce of cocaine, possessing drugs and a firearm, resisting arrest and tampering with evidence. The charges together earned him seven years in prison. He struggled nine years to find a steady job and support his three children.“It’s devastating,” he said. His felony record follows him everywhere. His loss of political rights, he said, is a constant reminder of his second-class status and his powerlessness.“They don’t take away your right to pay taxes,” he said. “They’re taking money from me, but not giving me the right to say what my money is used for. It makes all the difference, because you feel as if your voice don’t matter, know what I’m saying? And that’s the mind-set of a lot of people. They feel their voice doesn’t matter.”Political leaders “think none of them is going to vote, and they write this neighborhood off,” he said. “And what you see is the response: A lot of vacant housing, a lot of children running around that look lost.”The thirst for rebirth here — for a fresh start, with no encumbrances — is strong. On a snowy morning last February, a group of volunteer lawyers gathered in the West End to offer help in filling out applications to expunge low-level felonies from state records. Between 500 and 1,000 people sought help. The lawyers did not finish their work until 11 that evening.“It put a lot of human faces on a story that for many of us had been a data point,” said Stephen Reily, one of the lawyers. “We were not only seeing the scale of the challenge faced by people who paid their debt to society a long time ago, but also their hunger to become more fully integrated in society — to get good-paying jobs, buy decent apartments and houses, take their children on school trips.”And cast ballots.Mr. Reily said when he ran for Metro Council a few years ago, he met several people who were fully informed about the election.“When I asked them for their vote, they said they couldn’t give it to me,” he said. “Not because they were voting for my opponents in a crowded primary. Because they couldn’t vote, period.”Mr. Harbin said has been trying for nearly three years to expunge his convictions, so far without success. “I’m sure it’ll happen after this election,” he said. Then he added, dryly, “Hopefully, before the next one.”“I believe the system can work,” he said. “But you have to be in the system to change the system. Standing outside, throwing rocks at it — who’s going to keep rolling the dice and hope someone does it for them?”Mr. Parker has given up on expungement, convinced that he will never win forgiveness. But he has another plan, tied to his effort to revive a California neighborhood association. “Once we get it off the ground,” he said, “we’re going to make sure everybody in the community who can vote is registered to vote. That’s a priority.“They can take away my voice, but at the same time we empower all these other voices. You lose one, but you gain 300.”Advertisement"}