{"id": "Down With the Year of the Woman", "paragraph": "Supported bynews analysisWe need to normalize female politicians, not act as though they’re unicorns. And if someone says “pink wave” again, I’m going to dry heave.By Amy ChozickMs. Chozick is a writer at large for The Times covering business, politics and media.I know that when I hear 2018 called the Year of the Woman, I am supposed to huddle with my girlfriends, preferably over rosé, and celebrate the historic number of female candidates in the midterm elections. And yet, I have to confess that the term bums me out.Really? I think whenever I hear it. We only get a year?The way we talk about all of these female candidates as they try to drag that cave man known as Congress a bit closer to gender parity leaves me discouraged about how little progress we’ve made. After all, it was Senator Barbara Mikulski who, after she was re-elected in the first Year of the Woman in 1992, said that the term “makes it sound like the Year of the Caribou or the Year of the Asparagus.”Are female candidates still unicorns, magical woodland creatures that rear their sparkly horns every couple of decades, and only when provoked, as they were after Anita Hill’s testimony in 1991 and Christine Blasey Ford’s agonizing account of sexual assault last month?Democratic Senators Elizabeth Warren, Kirsten Gillibrand and Kamala Harris have signaled they may run for president in 2020, which would make that election the most female ever (The Year of the Woman on Steroids, to borrow The Washington Post’s phrase). So it’s all the more urgent that we find a less archaic way of talking about women in politics, preferably one that doesn’t make them seem like a stop in the Chinese zodiac.I was curious about whether other women felt the same way I did — encouraged by the uptick in female candidates yet exasperated that the phenomenon is still characterized as some chromosomal anomaly that couldn’t have happened without a man. If President Trump hadn’t bragged about sexual assault and called a gorgeous porn star a horseface, would we still be getting our year?I started to ask around, a bit sheepishly. It turned out I wasn’t a traitor to my gender after all. Almost every woman I talked to also chafed at the Year of the Woman framework. “It makes us seem like the outliers, we’re still not the norm,” said Debbie Walsh, director of the Center for American Women and Politics at Rutgers University.The phrase “pink wave” is even worse. CNN’s Kate Bolduan spoke for women everywhere (or at least for me) when she cut off a Democratic strategist with: “Can we not call it a pink wave? Like, c’mon.”Pink is tender and sweet … exactly the opposite of the red-hot rage fueling many women this election cycle.Nita Chaudhary, a co-founder of UltraViolet, a women’s advocacy group, said this election is about “anger, women being so fed up” with Mr. Trump and his agenda. She said about the candidates, “A lot of them didn’t want to put themselves in this position and expose their families and their entire lives, but damn it, if women won’t save us, no one else will.”The fact that we’re wrestling with what to call this female-infused election year speaks to the underrepresentation of women not just in politics but also in media, said Jessica Knoll, a Los Angeles-based novelist and screenwriter. There was a reason it was Ms. Bolduan who put a stop to the “pink wave” talk.“It minimizes it, it cutesies it up, and you needed a woman to say, ‘Don’t call it that,’” Ms. Knoll said. “On a macro level, that’s why we need more women at the table everywhere.”When I covered Hillary Clinton’s 2016 presidential campaign, I’d often study how Maureen Dowd expertly wrote about Geraldine Ferraro after she ran as the first female vice-presidential nominee of a major party in 1984. Back then, the nation grappled with some pretty basic questions of decorum: What should she do with her purse? (“You caught yourself thinking incongruously: A vice president with a purse?” Dowd wrote.) Should she be referred to as a “running person,” that way avoiding the romantic overtones of “running mate”? Then there was the memorable advice from a Democratic pollster: “Mondale cannot, whatever he does, kiss her.”We’ve settled on “running mate” (thank you, Sarah Palin), but 34 years and a woman at the top of the presidential ticket later, so many questions remain.How does Mikie Sherrill, a Democrat candidate for Congress in New Jersey, balance raising young children with campaigning? Could Zephyr Teachout handle the rigors of running for the Democratic nominee for attorney general of New York while pregnant? How will the divorce of Susan Wild, a Democratic candidate for Congress in Pennsylvania, play?“They’re often treated like they’re exceptional, miraculous,” said Celinda Lake, a Democratic pollster who has advised female candidates. “It’s great to celebrate and energize people around women running, but we need to normalize, not exceptionalize it.”Studies show that voters want to know their elected officials (especially if they’re women) in more personal terms. I, for one, devour any story about a candidate’s diet or workout routine and might even have bought Alexandria Ocasio-Cortez’s tricycle-red lipstick ($22 at Sephora, if you’re wondering).But there is also a fear that for every story about juggling politics with play dates, we aren’t hearing about the candidate’s agenda.“It obviates some of the larger policy questions these candidates want to talk about and recenters their candidacies around identity and more specifically gender,” said Anne Helen Petersen, the author of “Too Fat, Too Slutty, Too Loud: The Rise and Reign of the Unruly Woman.”In other words, when a man runs for office, why is he just a candidate, but when a woman runs, she is a female candidate?Even campaigns that don’t plan to emphasize the candidate’s gender find themselves defined by it. Cynthia Nixon, who recently lost her Democratic primary contest to Gov. Andrew Cuomo of New York, ended up in a fight about how cool the temperature should be in the debate hall at Hofstra University on Long Island. The Nixon campaign accused Mr. Cuomo, who prefers Arctic conditions, of being “notoriously sexist when it comes to room temperature.” Ms. Nixon, who like many women shivers at the sight of an office air-conditioner, fought for a balmy 76 degrees.We might as well have been talking about where Ms. Ferraro should plop down her purse. That’s when I realized that as much as I recoil at the Year of the Woman (and dry heave at the “pink wave”), the bigger problem with treating female candidates like novelties is that, sadly, they are.The Democratic Party gave itself a 25-year-long pat on the back when it ushered in the original Year of the Woman in 1992, an election that nearly doubled the number of women in Congress to … 10 percent. This year, women, roughly 51 percent of the nation’s population, make up 29 percent of Democratic and Republican candidates for the House and 32 percent of Democratic and Republican candidates for the Senate, according to the Center for American Women and Politics at Rutgers.That’s progress, but not exactly a tsunami, or even a wave. It’s more like “a pleasant ripple that gets us closer to 50 percent,” Ms. Knoll said.As Jennifer L. Lawless, a professor at the University of Virginia who has written extensively about women in politics, put it, “It will be the ‘Year of the Woman’ when we’re not talking about it.”Amy Chozick, a writer at large for The Times covering business, politics and media, is the author of the memoir “Chasing Hillary.”Follow The New York Times Opinion section on Facebook and Twitter (@NYTopinion). Amy Chozick is a New York-based writer-at-large and a frequent contributor to The New York Times Magazine, writing about the personalities and power struggles in business, politics and media.   @amychozick • Facebook Advertisement"}