{"id": "Parts of America Are Still Struggling Economically. They Don’t Matter Much in the Midterms. ", "paragraph": "Supported byThe most competitive districts in the race for control of the House are disproportionately prosperous — and their economies aren’t doing much to lift Republicans.By Jim Tankersley and Ben CasselmanWith just days to go before the midterm elections, President Trump is making an economic appeal to well-off suburban voters: Elect Republicans, the president warns in tweets and a new national ad, or kiss the good economic times goodbye.That appears to be the right audience for a closing pitch, but it may not pay off as the president hopes. The competitive districts that will decide control of the House are richer and more economically vibrant than the country as a whole. But there is little evidence that the thriving economies in those districts are buoying Republican candidates enough to guarantee victories against well-funded Democratic challengers.The concentration of battlegrounds in prosperous areas could have important policy implications for the next Congress, with swing-district representatives more concerned with preserving their region’s own good fortunes than with helping large parts of the country that continue to lag economically.And it does not appear to be helping Republicans in their quest to retain control of the House, defying the hopes that party leaders expressed when they passed a $1.5 trillion tax cut last year without a single Democratic vote. Consider three Republican-held districts that the Cook Political Report ranks among the 73 most competitive races this fall: In California’s 49th District, the typical household earned nearly $90,000 last year, a 9 percent jump from the year before. In Minnesota’s Third District, the poverty rate is down to half the national average. In Virginia’s 10th District, unemployment is at a rock bottom 2.6 percent, well below the national jobless rate of 3.7 percent.Republican candidates are trailing in all three races, with their Democratic rivals running at or near 50 percent, according to polls conducted by The New York Times and Siena College. To flip control of the chamber, Democrats must win 23 seats now held by Republicans. The most recent polls shows Democrats favored to win control of the House.Democrats have tried to use the economy against Mr. Trump, even though job creation and economic growth are strong. In competitive contests in well-off districts, Democratic candidates criticize Mr. Trump and Republicans about the rising costs of housing and health care as well as the inequity and long-term costs of the tax cuts.“I see a lot of people who, if they vote with their pocketbook, and they’ve maybe sided with Republicans because of that, they’re taking another look” this year, said Mike Levin, the Democratic candidate in California’s 49th District, which includes a strip of coastline running from north of San Diego to the southern suburbs of Los Angeles. “Today, I feel like, to the extent we’ve seen gains, we’re on a sugar high. And I have young kids — I know a lot about that.”It is possible, of course, that Republicans in tight races would be in even worse shape were it not for the strong economy. An analysis of polling data suggests Republican candidates are performing modestly better, relative to expectations based on their performances in past elections, in districts where the unemployment rate is lower or has fallen faster than in other districts. On a national level, the economy may be helping lift Mr. Trump's approval ratings, which, if historical patterns hold, could help Republicans avoid steeper losses in the midterm elections.But those effects are not nearly large enough to help Republicans avoid costly and contentious races in some of the most vibrant parts of the country, particularly in suburbs of high-performing metropolitan areas. “Those are the places where the president is the most toxic, outside of urban areas,” said Amy Walter, the national political editor of the Cook Report. “It’s not about their pocketbook. It’s about partisanship, and it’s also about cultural issues.”Moreover, many swing voters appear skeptical of Republican claims on the economy. Surveys have consistently found that independent voters are less sanguine about the economy than Republicans, and Mr. Trump’s signature economic policies, such as last year’s tax cut, poll poorly with that group. And women — including the suburban white women who are the target of recent Republican ads — report feeling significantly less positive about the economy than men, according to a recent survey conducted for The Times by the online research platform SurveyMonkey.A study to be released this week by the Economic Innovation Group, a think tank in Washington that advocates policies to help economically distressed parts of the country, finds that 28 of the 70 most competitive House districts this year rank as “prosperous” — the highest quintile — on the group’s distressed communities index. Another 15 districts rank in the next quintile, “comfortable.” Those districts have higher incomes and faster job and business growth than other areas.Only six of the most competitive districts rank as “distressed,” the lowest quintile in the index.As a group, the 70 most competitive districts have not seen their incomes grow more, or their unemployment rates drop faster, than the rest of the country since Mr. Trump took office. But they began the Trump era in better shape than the rest of the country.In 2017, the median household income in a typical competitive district was just over $66,000, according to the Census Bureau. For the typical noncompetitive district, it was just under $57,000. The median income for a “prosperous” competitive district was more than $73,000. Those districts frequently run through the suburbs of large cities in high-income states. The “prosperous” and “comfortable” list includes four districts in California and three each in New Jersey, Minnesota, Florida and Texas. It also includes Colorado’s Sixth District, one of the most prosperous in the nation according to the Economic Innovation Group rankings, where the incumbent, Representative Mike Coffman, a Republican, is trailing badly in the polls.The broad universe of competitive seats is wealthier and whiter than the nation as a whole, the Economic Innovation Group analysis finds. But in a narrower group of seats that could hand Democrats control of the House by themselves — those that Cook ranks as “toss up” or “lean Democratic” — the relatively high-earning population includes a larger share of immigrants than the typical district. The toss-up districts “are by and large pretty dynamic places, where the status quo is working rather well,” John Lettieri, the president of the Economic Innovation Group, said in an interview. “Things like globalization and immigration aren’t things to be feared there. They’re woven into the fabric.”That is certainly the case in west Houston and its suburbs, where the incumbent, Representative John Culberson, a Republican, is running neck and neck with Lizzie Pannill Fletcher, a Democrat, in the toss-up Seventh Congressional District. More than a quarter of the population was born abroad. More than half is nonwhite. Mr. Culberson is leaning into the economy in his campaign. He said in an interview that his constituents, no matter where they were born, wanted a fiscal conservative to continue “the obviously successful economic policies” that have contributed to the growth of the area and its oil and gas companies.“Voters in my district understand that I’m the right person in the right place at the right time to keep the economy growing,” Mr. Culberson said, “because I always support tax cuts, I always support lightening the regulatory load, I always support the oil and gas industry.”In television advertisements, Ms. Fletcher has attacked Mr. Culberson largely on health care. Her first ad promoted Houston’s innovative economy and her work with businesses there. Those issues — and the nature of the House battlegrounds — stand in stark contrast to Mr. Trump’s focus in the weeks before the midterm elections, which has lingered on warnings about immigrants, particularly those in a caravan heading north from Central America. The warnings may do more to help rally conservatives in Mr. Trump’s base in many conservative states that are home to contentious Senate races, including North Dakota and Missouri. Mr. Trump’s new $6 million national television ad appears targeted more to the suburban voters who will decide control of the House. It features a woman in a leafy home, watching her young daughter play violin and remembering the aftermath of the recession. The woman votes Republican; her daughter appears to grow up to be a concert violinist. “Things are getting better,” the ad reads in closing. “We can’t go back.”Ms. Walter of the Cook Report said the ad might struggle to break through — against Mr. Trump’s own messaging.“O.K., that’s a nice ad, but he’s spending all day talking about birthright citizenship and sending troops to the border,” she said. “Which one should we be watching?”Jim Tankersley covers economic and tax policy. Over more than a decade covering politics and economics in Washington, he has written extensively about the stagnation of the American middle class and the decline of economic opportunity.  @jimtankersley Ben Casselman writes about economics, with a particular focus on stories involving data. He previously reported for FiveThirtyEight and The Wall Street Journal.  @bencasselman • Facebook Advertisement"}