{"id": "Hundreds of Thousands in France Protest Taxes by Blocking Roads", "paragraph": "Supported byBy Alissa J. RubinÉRAGNY, France — More than a quarter-million people across France joined protests on Saturday against planned hikes in gas taxes. Drivers blocked roundabouts, highway access roads and intersections.The demonstrations have harnessed a broader discontent with high taxes and, for some, with the policies of President Emmanuel Macron.Most of the 2,000 demonstrations were in the suburbs, exurbs and rural areas of France where people rely on their cars to go to work, visit the doctor and do their grocery shopping. Some protesters also blocked access to border crossings.Most of the protests were orderly, though one person was killed and more than 200 were injured in accidents or altercations around the country, according to the Interior Minister, Christophe Castaner.In Paris, some 1,200 demonstrators almost reached the Elysée, the presidential residence, where they shouted, “Macron quit,” and blocked the Champs-Élysées.That hostile tone, though, was not evident in most small towns and suburban areas.“We are not political people; we do not belong to a union, we are citizens,” said Didier Lacombe, a retiree who lives on a fixed income near Éragny, a small town about an hour west of Paris.“The taxes are rising on everything. They put taxes on top of taxes,” said Mr. Lacombe, as he and his wife prepared to join what has come to be known as the “Yellow Vests” protest after the vests that are required in French cars and that were worn by the demonstrators.“It is not the tax on gas, it’s everything. The injustice is greater and greater,” he said.The protesters, whose movement coalesced rapidly over the last six to eight weeks through social media, have grown quickly in numbers. While the demonstrations were no larger than those organized by unions who object to labor reforms, they were strikingly consistent, given the distance between gatherings, which reached from the Mediterranean coast to the northern industrial areas of the country.The demonstrations are unlike some past protests that pressed for higher salaries. Now, people are seeking a reduction in the gas tax as well as expressing frustration with payroll taxes, which are used for social services like health care and social security, said Alexis Spire, a senior researcher in sociology at the National Center for Scientific Research, a government research agency.The French taxes, known as social charges, can top 40 percent of paychecks and are used to cover health care, unemployment insurance and other services.“It’s a big difference with movements such as the Tea Party in the United States,” Mr. Spire said, because the French want government involvement. “The French are very attached to their model of social protection and they are also very attached to government services.”For those living outside of cities, it is often hard to feel they are getting their money’s worth. Unemployment has remained stubbornly high at nearly 10 percent. Rural hospitals have closed, making it more difficult for those in need to access health care despite the country’s universal health insurance. Mayor's budgets are shrinking in some localities, which means city hall might be open for fewer hours or the administrative jobs that used to be done there have moved to another town. That means more driving for those left without services.Over the past few days the government has become increasingly alarmed by the movement. Though it began last May with a online petition about gas prices, it gained traction in October when a call went out for a national demonstration to block key roads in an effort to get the government’s attention.With no central organization or coordination, the movement came together almost entirely on social media.“It is a very large front that brings together people who are angry about different things, and it is drawn from a number of different segments of French society that has coalesced around outrage about taxes and the increase in gas prices,” said Jérôme Fourquet, the head of opinion polling for IFOP, a leading public opinion research firm.IFOP surveys recently found that about a third of French people are “very dependent” on their car in their daily lives and another third “somewhat dependent,” so the price of gas has become a key element in the majority of French citizens’ budgets.“The price of fuel is as politically and sociologically sensitive as the price of wheat in the ancient regime,” said Mr. Fourquet, referring to the 18th century when it was in part revolts over the price of flour that led to the French Revolution.The government, recognizing in recent days that the movement was snowballing, has offered an array of benefits for low-income earners. They include subsidies for switching to more fuel- efficient cars, subsidies for gas purchases and rebates for changing to clean fuel for home heating.So far, those offers have done little to calm the anger.While some protesters said they would spend the night pulled off the road and return to their positions in the morning, there were relatively few planning to stay overnight. More likely is that the protests will be renewed in the coming days, as the government is unlikely to reduce fuel taxes.The caravan of about 100 cars that Mr. Lacombe joined blocked gas stations and lanes on main highways, and remained in place all day near the outskirts of Éragny. By midafternoon another 150 to 200 cars had joined them in the small community, built in the 1960s and made up mostly of small one-family homes.The other members of that group said they were politically in the center; some had voted for Mr. Macron in the last election and were now disillusioned; others supported center-right candidates.Many were self-employed, like Muriel Gautherin, 52, a chiropodist who lives in a suburban town near Éragny.“We are simple citizens whose anger is simmering, simmering,” Ms. Gautherin said, pulling her red beanie cap over her ears to ward off the morning chill. “Among us are the retired people who feel they were fooled, the youth whose future is so uncertain and all those who feel like politicians are showing no respect for their struggles.”Elian Peltier contributed reporting.Advertisement"}