{"id": "Amazon’s HQ2 Will Benefit From New York City. But What Does New York Get?", "paragraph": "Supported byCritic’s NotebookBy Michael KimmelmanThe innovation myth used to involve the back of a suburban garage or an office park in Silicon Valley. The tech industry was incubated not on the mean streets of the big city, but in sleepy hamlets like Murray Hill, N.J., and Mountain View, Calif.So with Amazon splitting HQ2, its second headquarters, between Crystal City, a part of Arlington, Va., and Long Island City, in Queens, what are we to make of tech’s steady migration to marquee cities?Amazon is hardly alone, after all. Google and Facebook already have headquarters here (established, not incidentally, without state subsidies). Google intends to double its work force in the city to nearly 20,000. Twitter’s second-largest office is in Manhattan. Its largest is in downtown San Francisco.On one level, this all seems inevitable. A handful of the wealthiest American cities today have a magnetic attraction. Today’s biggest tech platforms seek them out to recruit top talent and gain access, at scale, to housing, schools and transit. The process means the rich get richer, the biggest companies, bigger. And the gulf widens between the country’s haves and have-nots.On another level, the tech industry isn’t culturally urban. Its insularity, secrecy, its bedrock libertarianism and algorithmic notions about progress, land use and corporate independence have never easily meshed with the slow, open-society, regulatory-heavy, greater-good mission that defines city living. Disruption is a virtue and instrument of efficiency in tech circles. But it isn’t necessarily welcome where protections and a focus on collective welfare remain abiding democratic ideals.You may not have noticed, but New York now lags behind only San Francisco and San Jose, Calif., in tech patents. Last fall the campus of Cornell Tech, modeled after Stanford University as an innovation incubator, opened on Roosevelt Island. Negotiating that deal may very well end up being one of the most transformative moves made by Michael R. Bloomberg, the city’s former mayor.That said, New York City is not Seattle or San Francisco. Here, tech is one sector in a megalopolis, sharing the limelight with finance, media, fashion, advertising and art. It’s absorbed into the immensity.In contrast, San Franciscans famously rebelled against the private buses and corporate fortresses tech set up. Public officials there have proposed a ban on employee cafeterias in new office buildings because engineers and coders apparently never leave work to patronize local restaurants. Last week, San Franciscans voted in favor of a proposition to help the city’s homeless that Marc Benioff, the Salesforce chief executive and now Time magazine owner, had backed, but that Twitter’s chief executive, Jack Dorsey, vehemently opposed.And Mr. Dorsey wasn’t alone. In Seattle, Amazon raised a ruckus when officials proposed a tax on large employers to help pay for services to the homeless. The company threatened to halt construction on a new high-rise.So the city dropped the plan.Amazon also insisted on nondisclosure agreements from the 238 cities bidding for HQ2. Scandalously, American cities and states now spend some $90 billion a year in cash and tax incentives to attract companies, money that could go for infrastructure, schools and police, and that usually doesn’t pay off, as Derek Thompson pointed out this week in The Atlantic. Amazon’s nondisclosure clause set up a process that allowed it, in effect, to crowdsource vast swaths of information about cities while preventing their citizens from knowing what their elected officials were doing to entice the $860 billion company.This is certainly not how New Yorkers like to operate.If New York hadn’t landed Amazon, it would not have been a surprise if Dallas had. Jeff Bezos, Amazon’s chief executive, apparently has a home in Texas, too. Scott Galloway, the business analyst and Amazon expert, tweeted a funny-but-true image showing the proximity between Mr. Bezos’ homes and the company’s current and prospective headquarters.Silly as it sounds, where bosses live turns out to be as good a predictor as any of where tech companies will settle.For years, suburbia has offered these companies acres of disposable, cheap, anonymous office parks: mostly one- or two-story concrete structures surrounded by loads of surface parking. These sites minimized costs, maximized security and allowed companies to scale up, contract or split into different units quickly — at the same time they promoted sprawl and traffic jams and transformed once-quaint bedroom communities south of San Francisco into phenomenally expensive places to live.Not that young tech workers, more and more of them immigrants, wanted to live in suburbia, anyway. Increasingly they demanded the diversity and benefits of city life. And so did successful innovation companies, following the lead of workers.Another way to put it is that companies like Google, Facebook and Amazon became attracted to cities like New York, Los Angeles, Seattle and Washington because these cities had already made transformative public investments in assets like culture, parks, universities and transit.The question for city residents is what these companies give back. I’m not saying companies move, or should be expected to move, for any reason other than to make money. Amazon promises tens of thousands of new jobs in New York, with all sorts of ripple effects beyond employing more coders, sales executives, baristas, nannies and yoga instructors. In one fell swoop, it bids to make good on 20 years of the whole post-Manhattan, cool-outer-borough narrative.But that isn’t the only balance sheet. “Urban life is built around a social compact,” said Vishaan Chakrabarti, a Columbia professor and founder of the architecture firm PAU. Economic value creation in superstar cities like New York fuels a feedback loop that companies and cities both want to lean into.What does this mean? For starters, it means that the city and state now have even more reason to funnel money into subways, buses and a new tunnel under the Hudson River, and to pony up for the stalled BQX streetcar project linking Brooklyn and Queens, all of which would serve Amazon.In turn, Amazon, which dominates the book market, could, up front, make self-interested commitments in local school programs and, as Eric Klinenberg, a sociologist at New York University, advocates, in public libraries, our most vibrant, multipurpose community hubs.As for housing, the city’s regulatory and zoning policies are more responsible for driving up costs than tech companies. But, in an ideal world, Amazon would reverse what it did in Seattle and commit resources to affordable housing in areas where its workers are moving; and it would pitch in for homeless services, which, by extension, would improve the daily lives of Amazon employees.Mr. Chakrabarti has a modest proposal, as well: The company could extend a hand toward Long Island City neighbors like LaGuardia Community College and Queensbridge, the largest public housing development in North America.There’s no reason to presume Amazon will do any of this, of course.New York’s abundance of resources, talent and ideas derives from its exceptional diversity and social infrastructure — urban virtues. Amazon could profit from its enhancement of New York as much as New York could profit from Amazon’s presence. It’s not how tech tends to work.But it’s how this city works.OpinionBryce CovertAdvertisement"}