{"id": "Counting Every Vote", "paragraph": "Supported byOn Politics With Lisa LererBy Lisa LererHi. Welcome to On Politics, your guide to the day in national politics. I’m Lisa Lerer, your host.[Get On Politics delivered to your inbox.]Why, oh why, does it always come down to Florida?Nearly a week after Election Day, here we are again, still waiting for results in five statewide elections. Three of them are in Florida, of course, the result of a state law mandating the recount of races with tight margins. That’s prompted a flurry of withdrawn concessions, competing lawsuits and fraud accusations.Even the president weighed in this morning, urging officials to “go with Election Night!” President Trump’s motive is obvious: Two of his favorites, the Republicans Rick Scott and Ron DeSantis, were ahead in the vote count after that first day. Why play nine innings, his thinking goes, when you’re up in the sixth?But there does seem to be this thing with elections in the country’s biggest battleground state; the words “Broward County” alone make election officials across the country shudder. The county has a long history of slow and convoluted vote counting, including during the 2000 presidential recount — or, as our intrepid Florida correspondent Patricia Mazzei calls it, “the election that must not be named.”But does that mean the voters, or their votes, are illegitimate? No.The Florida Department of Law Enforcement and the secretary of state’s office have found no evidence of fraud, despite repeated claims over the weekend from Mr. Scott, the outgoing governor and Republican nominee for Senate. Meanwhile, Senator Bill Nelson, the Democrat who’s running for re-election, called on Mr. Scott to recuse himself from “any role” in the recount process.The strange thing about all this is that if history is any guide, the recounts are unlikely to change the final results. Between 2000 and 2016, there were 4,687 statewide general elections and just 26 statewide recounts. Only three — a total of .06 percent of all statewide elections — reversed the initial result, according to an analysis by the nonpartisan group FairVote.That study argues that winning candidates should welcome recounts as a way to enhance their legitimacy. “To recount the vote is to verify its accuracy,” wrote Maya Efrati, the author of the study.That’s not exactly how the president and Florida Republicans see it. On Monday, the Broward circuit chief judge begged the lawyers involved in the recount to “ramp down the rhetoric.”“We need to be careful what we say,” said the judge, Jack Tuter, rejecting a request by Mr. Scott to impound unused voting machines and ballots. “These words mean things these days, as everybody in the room knows.”It was a busy weekend for undecided elections in Florida and elsewhere. Here’s a recap of where things stand today:• The first full, statewide vote recount in Florida history started on Saturday for races for governor, Senate and agriculture secretary. The deadline for the recount, which is being performed by machines, is Thursday at 3 p.m. But if the machine recount comes back with a margin of .25 percentage points or less, the state will begin a manual recount.Most of the attention is focused on the Senate race, where unofficial election results show Mr. Scott leading Mr. Nelson by just .14 percentage points. A big question is why the Democratic bastion of Broward County saw about 25,000 fewer votes counted for Senate than governor, a number way out of whack with other counties. Poor ballot design may be a reason. There are also overseas and provisional ballots still to be counted.• In Arizona’s Senate race, Kyrsten Sinema, the Democrat, was declared the winner late on Monday. The race was close, but the tallying was also slow by design — a majority of voters in the state cast early ballots and vote by mail, and counting all their votes can take time.•In Georgia, Democrats are trying to push Brian Kemp, the Republican nominee for governor, below 50 percent of the vote, triggering a runoff election later this year. The campaign of Stacey Abrams, the Democrat, says an additional 25,632 votes would push the race into a runoff; Mr. Kemp’s office says there are only about 25,000 votes outstanding. His share dropped slightly over the weekend, to 50.28 from 50.33 . Ms. Abrams’s lawyers filed a lawsuit on Sunday to force the counting of more provisional ballots and to push back the state’s certification of election results until at least Wednesday.•In the House, Democrats keep expanding their margin as results roll in. Currently, the party has claimed at least 32 seats — up from 26 on election night. Results in 10 races are outstanding.[Sign up here to get On Politics in your inbox every evening.]____________________California is experiencing the most destructive wildfires in its history, which have destroyed entire towns and killed more than two dozen people. A tweet from President Trump over the weekend left some victims angry and others puzzled. Today, Kendra Pierre-Louis, a reporter on The Times’s Climate team, sent us this, on the message behind the tweet:Over the weekend, President Trump wrote a tweet blaming California’s recent wildfires on the state’s poor “forest management.” It was an unfamiliar phrase to most people. But experts said its intent was clear — to boost the logging industry.“The narrative that Donald Trump is promoting is that the more logging you do, the more it’s going to stop fires,” said Chad Hanson, an ecologist with the John Muir Project, a nonprofit environmental organization. In fact, the president’s interior secretary, Ryan Zinke, said as much in August, in an opinion piece published in USA Today.Paradoxically, increasing logging on forests can actually increase forest fires. (Read more on that in my story today.)The tweet also belied the fact that the fires — the Camp Fire in Northern California and the Woolsey Fire in Southern California — did not begin on forested land, but rather on what’s known as the wildland-urban interface, the edges between communities and wildland.But even if it had begun there, California only controls a tiny portion of its own forested land — 3 percent. It’s a fact that Brian Rice, president of the California Professional Firefighters union, was quick to point out in a statement responding to Mr. Trump’s tweet. The vast majority of California’s forests, 57 percent, are under federal control.Read Kendra’s story: Fact Check: Trump’s Misleading Claims About California’s Fire ‘Mismanagement’____________________• The freshman House Democrats arrive in Washington for orientation this week. They’re the most diverse, most female class in history.•  President Trump says the nuclear threat from North Korea is over. New satellite images suggest that it has only gotten worse.•  First came the influencers. Then the microinfluencers. Now, get ready for the nanoinfluencers — Instagram accounts posting #sponsored content to their 1,000 followers.____________________Liev Schreiber as our own Michael Barbaro on this weekend’s SNL. The resemblance is uncanny!_____________________Were you forwarded this newsletter? Subscribe here to get it delivered to your inbox.Thanks for reading. Politics is more than what goes on inside the White House. On Politics brings you the people, issues and ideas reshaping our world.Is there anything you think we’re missing? Anything you want to see more of? We’d love to hear from you. Email us at onpolitics@nytimes.com.Advertisement"}