{"id": "At Mile 20, the Bronx Cheers Are All Supportive", "paragraph": "Supported byBy Kevin ArmstrongCowbells rang, Matracas rattled and Elvia Negron-Perez, who has completed 12 New York City Marathons, offered runners in Sunday’s race relief at her folding table along 135th Street in the Bronx.Dressed as “Super Boricua,” Negron-Perez stood a few feet north of the Mile 20 marker wearing a Puerto Rican flag draped over her shoulders and wristbands emblazoned with its image. In plastic bags, she assembled care packages of bananas, oranges and pretzels for friends on the course. She reached into a container to pull out a muscle-roller massage stick, and tried to ensure that anyone thinking of surrendering to physical pain or mental exhaustion did not do it on her block.“No wall!” she said. “We’re here for everybody!”While the marathon’s annual visit to the Bronx is brief — just over a mile — it has often brought out the best in the borough. The Mott Haven neighborhood in particular has become synonymous with moral support and muscle sticks on race day. Positioned at the foot of the Willis Avenue Bridge, where runners and wheelchair racers cross into their fifth borough of the route, residents come to the course equipped to assist those whose bodies may be breaking down.Neil Heckman, who ran in 2014 and 2015, said he never forgot cramping the first time he reached Mile 20. On the sideline on Sunday, he wore a black headband, offered bagged snacks and kept a roller at the ready. As morning burned into afternoon, he held up a white sign to alert the participants that he had relief available for the asking.“Oranges, Pretzels, Stick,” his sign read, with images to accompany the words.At other points, local runners volunteered their services from behind a white fence that now keeps marathon fans at bay. Justin Mashia carried two sticks, along with pickle juice — another option some choose to combat cramps — with his group, Bronx Sole, a running club. They were positioned next to the Bronx Nomads, another clique. Mashia and another volunteer, Nova Church, remembered watching a man struggle to shake a cramp last year.“A guy was dying, in so much pain, and Nova yelled out, ‘You need a roller?’” Mashia said. “He was hurting by the fence. He saw that he had the roller and moseyed across. He struggled. He was like, ‘You saved my life!’ So Nova kept saying, ‘I’m out here saving lives.’”The Bronx has long been considered the race’s forgotten borough. The end of Mile 19 brings racers onto the Willis Avenue Bridge before taking a left turn onto 135th Street.The course’s foray into the Bronx also includes a downhill stretch before turning right onto Alexander Avenue, where, for each of the last 15 years, Samuel Brooks, the president of the Mott Haven Historic Districts Association, has stood sentinel. By 8 a.m. Sunday, Brooks wore a bathrobe, striped pants and a gray fur hat. Positioning himself atop a stepladder, high above the elite women and men as they came around a bend, he served Bloody Marys to guests from all over. Born in Honduras, Brooks has lived in the area for 46 years.“We’ve been here for the bad, the ugly and now the good is coming in,” he said. “It is sort of watching it before your eyes. I want everyone to see what the Bronx has become. This is such a critical mile for everyone.”Few amateurs have run as many miles in the Bronx as Negron-Perez, a dental hygienist. She has completed marathons in 47 states, and needs only Iowa, Utah and Hawaii to complete her United States set. She grew up by the Bronx Zoo, lives in East Tremont and runs daily through the New York Botanical Garden.Typically well prepared, her marathon day commenced with a misstep this year. She woke up an hour early because she forgot to account for daylight saving time, and told friends about a dream she had about Peter Ciaccia, the marathon’s race director, who was set to retire after the race.“I dreamed that they changed the course,” she said. “And that they were at my house on Oakland Place. I had a dream that Peter Ciaccia, who was wearing elevated boots, came all the way to the fourth floor. I’m not joking. I woke up and was like, ‘What the heck?’”Ciaccia, a Bronx native who grew up by West 233rd Street and Broadway, has talked about bringing more of the course into the Bronx, but he said he knew that it was not going to happen before he concluded his tenure.“Maybe my dream was a premonition,” Negron-Perez said. “Finish in the Bronx. Finish in the Bronx! Maybe they will come all the way to the Bronx Zoo. Wouldn’t that be nice?”Advertisement"}