{"id": "If U.S. Missiles Are Deployed, Putin Says, Europe at Risk of ‘Counterstrike’", "paragraph": "Supported byBy Andrew E. KramerMOSCOW — President Vladimir V. Putin warned on Wednesday that if the United States deploys new intermediate-range missiles in Europe after withdrawing from a nuclear treaty prohibiting these weapons, European nations will be at risk of “a possible counterstrike.”President Trump said over the weekend that the United States intends to pull out of a 1987 agreement banning short- and intermediate-range missiles that are launched from land. He said Russia was cheating on the deal and said it was flawed because China is not a signatory.The United States, Mr. Trump said, will develop weapons now prohibited by the treaty, prompting Russian warnings of a new arms race.On Wednesday, speaking at a news conference in Moscow, Mr. Putin said European countries would bear the risk of Mr. Trump’s decision if new missiles wound up in Europe.“The main question is, if the United States does withdraw from this treaty, what will it do with these newly emerging missiles?” Mr. Putin said. Any European nation that accepts the new missiles, he said, “will have to understand that they put their own territory under the threat of a possible counterstrike.”“I don’t understand whether Europe should be put in a situation of such a high level of danger,” he said. “In fact, I don’t see any reasons for that.”On Tuesday, speaking in Moscow, the United States national security adviser, John R. Bolton, said the risk in fact sprang from Russian noncompliance. He asserted that Moscow had already deployed banned missiles.The United States says the Russians have deployed ground-launched missiles known in the West as the SSC-8. They have a range banned by the treaty and are capable of hitting European targets, the Americans say.The issue has proved divisive among members of the North Atlantic Treaty Organization. Whatever threat the new Russian missiles may pose, many European leaders have objected to Mr. Trump’s plan to scrap the treaty.On Wednesday, the NATO secretary general, Jens Stoltenberg, said European members were unlikely to deploy new weapons.“We don’t want a new Cold War,” he said. “I don’t foresee that allies will deploy more nuclear weapons in Europe as a response to the new Russian missile.”Mr. Putin said Russia would be able to quickly deploy intermediate-range missiles if the United States withdraws from the agreement, which is known as the I.N.F. Treaty.“This will be very rapid and effective,” he said. “Indeed, what was the formal pretext of our partners withdrawing from the I.N.F. agreement? It was the accusation against us that we have ostensibly violated it.”Advertisement"}