{"id": "The Dangerous Naïveté of Trump and Xi ", "paragraph": "Supported byThe United States and China may be on a collision course yet their presidents each underestimate the pain the other could inflict. By Nicholas KristofOpinion ColumnistPresidents Donald Trump and Xi Jinping are a bit alike, and that presents a danger to the global order.The American and Chinese leaders are both impetuous, authoritarian and overconfident nationalists, and each appears to underestimate the other side’s capacity to inflict pain. This dangerous symmetry leaves the two sides hurtling toward each other.The 10 percent tariffs already imposed in the trade war are scheduled to rise to 25 percent in January, but there’s also a broader confrontation emerging.Trump and Xi may well be able to reach a cease-fire in their trade war when they meet for the Group of 20 in two weeks. Even if a deal is reached, though, it may be only a temporary respite that doesn’t alter the dynamic of two great nations increasingly on a collision course.Each side miscalculates by seeing the other as likely to give in. China perceives a wild man in the White House who talks big but who ultimately climbed down off his high horse on trade with Europe. Beijing doesn’t seem to realize that Trump’s challenge to China arises from core beliefs and reflects a broad disillusionment with China in the United States.I’m an example of that. I studied Chinese and lived for five years in China; my wife and I wrote a largely upbeat book about the country’s prospects called “China Wakes.” But Xi has damaged China’s brand just as Trump has damaged America’s, and today it’s hard to find either Democrats or Republicans eager to speak up for China.For its part, Washington misjudges as well. It sees China’s economy as vulnerable and doesn’t appreciate that China can wage a trade war with weapons other than tariffs. It can play a nationalism card so that it becomes unpatriotic for Chinese citizens to buy McDonald’s burgers, drink Coke or wear Nike shoes. Safety inspections can close American hotels; tax investigations can tie American firms in knots; and customs delays can hold up parts and idle American-owned factories.Chinese tourism to the U.S. can slow, students can be directed to Australian universities over American ones and rare earth minerals needed by American companies may develop shortages. China can further ease sanctions on North Korea, buy more oil from Iran or become more aggressive in the South China Sea. It can cancel Chinese trademarks owned by Ivanka Trump — that might get the president’s attention — and it can dump U.S. Treasury bonds.Trump is right (I can’t believe I just wrote those three words!) that China has not played fair. The best response would have been to work with allies to pressure China simultaneously from all sides; instead, Trump antagonized allies so that we are fighting this battle alone.Why have I and so many others soured on China?This is larger than Trump and Xi. China’s admission to the World Trade Organization in 2001 was meant to integrate the country into the global trading system as an increasingly responsible world power. But after moving mostly in the right direction under Deng Xiaoping and Jiang Zemin, China stalled under Hu Jintao and has moved backward under Xi.China has stolen technology and intellectual property even as it has become more aggressive militarily in the South China Sea and curbed freedom at home. Xi offends global values by detaining more than one million Muslims in the Xinjiang region, arresting lawyers and Christians, and steadily squeezing out space for free thought. I used to report from China each year but now find the limits on a journalist visa so onerous that it’s not worthwhile. And I’m supposed to be the lao pengyou, or old friend, of China.There are other grounds for American concern about China’s irresponsibility that haven’t received much attention: I estimate that around 20,000 Americans die each year from overdoses of drugs originating from traffickers in China. In particular, two-thirds or more of America's fentanyl, a synthetic opioid far more lethal than heroin, appears to come from China.In fairness, China has made some efforts to crack down on the drug trade, but this hasn’t been a priority so long as the traffickers mostly export their fentanyl rather than sell it at home. If the Chinese government pursued drug smugglers the way it crushes dissident Christians, labor activists, lawyers or feminists, those drug exports would end.America’s business executives used to be strong supporters of a pro-China policy, but they, too, have cooled. Hank Paulson, the former Treasury secretary, has long been a vigorous advocate of close ties with China, so I was struck by a sober warning he gave to the Asia Society in New York the other day.“Economic tensions are reaching a breaking point,” Paulson cautioned in his speech. He concluded, and I think he’s right, that if the U.S. and China don’t resolve their problems, the world will face “a systemic risk of monumental proportions.”Nicholas Kristof has been a columnist for The Times since 2001. He has won two Pulitzer Prizes, for his coverage of China and of the genocide in Darfur. You can sign up for his free, twice-weekly email newsletter and follow him on Instagram.  @NickKristof • Facebook Advertisement"}