{"id": "Wanda Ferragamo, 96, Dies; Reigned Over Family’s Luxury Goods Empire", "paragraph": "Supported byBy Rachel SymeWanda Ferragamo, who stepped in to run her husband Salvatore Ferragamo’s shoemaking business after his death in 1960 and then oversaw its expansion into a global luxury goods brand, died on Friday in her hilltop villa near Florence. She was 96.An internal company memo signed by her surviving children confirmed her death.When Salvatore Ferragamo died of cancer in 1960 at 62, Mrs. Ferragamo, then 38, decided to take over the business herself, despite having no experience working in the industry — or working outside the home at all.“I had never worked in my life before my husband died,” she told Time magazine in 2007. “I was a very young girl when I met him. At that time, women were taught only to play the piano and paint and learn about culture. That’s all.”The couple had six children, the youngest being only 2 years old. But she felt that she had to carry out her husband’s vision — to push the company beyond footwear. And she insisted that it be known by his full name, Salvatore Ferragamo.Over five decades, first as president and then as chairwoman, Mrs. Ferragamo oversaw the growth of the company from a small shoe-design and manufacturing concern in Florence into a leading luxury goods house that ranged beyond shoes to sell leather wallets, silk scarves, crystal flacons of perfume and much more.When she had inherited the business, it made 800 pairs of shoes a month. By 1981, it was making 60,000 a month in addition to selling handbags and men’s wear. She introduced eyewear in the 1990s, and she opened stores in New York, Hong Kong, Mumbai and Mexico City.Mrs. Ferragamo would arrive at the office every morning at 10:30. In the hallways of the company’s headquarters, in the Palazzo Spini Feroni, a magnificent Medieval palace on Via de’ Tornabuoni in Florence, she was known as “Signora,” always wearing elegant clothing and her trademark seven-centimeter high heels.One of her first and boldest decisions was to make her daughter Fiamma the company’s creative force. Fiamma Ferragamo was 19 when her father died, and she had already been designing shoes under his tutelage.The decision paid off: Fiamma invented the Vara shoe, a round-toed pump with a grosgrain ribbon and gold medallion that remains the company’s most popular item. Another daughter, Fulvia, oversaw the company’s expansion into silks.Her four other children — Giovanna, Leonardo, Massimo and Ferruccio — were also given prominent roles in the company, as were grandchildren later on.Insisting that the business should remain in the family, Mrs. Ferragamo rejected several offers over the years to sell it, and she navigated its first public stock offering in 2011. According to Bloomberg News, Salvatore Ferragamo now reports an annual revenue of over $1.6 billion.In 2004 Mrs. Ferragamo was awarded the Cavaliere di Gran Croce, or grand cross, a top honor in Italy. She stepped down as chairwoman in 2006 and took the title of honorary chairwoman. She remained as head of the Ferragamo Foundation, an educational initiative begun in 2013 that supports young Italian artisans with funding and training courses.Wanda Miletti was born on Dec. 18, 1921, in Bonito, a hilly village in southern Italy about 55 miles east of Naples. Her father was a medical doctor and the town’s mayor; her mother was a homemaker.It was in Bonito that she met Salvatore, who was 24 years her senior. He had been born there in 1898, the 11th of 14 children of a poor farmer and his wife, who grew wheat and olives. But it was a circuitous path that had led him to Wanda.Mr. Ferragamo had left school at 9 to work as an apprentice to a local cobbler. By age 11 he was working in the trade in Naples. When he was 16, he traveled to the United States, first to work at a shoe factory in Boston, and then to Santa Barbara, Calif., where he joined his brothers. He wound up in Hollywood, where he set up a business making shoes for the studios during the silent film era.There he made Egyptian sandals and Western boots for Cecil B. de Mille’s large-scale epics, and became a sought-after heel-maker for screen sirens like Joan Crawford, Anna May Wong, Greta Garbo and Lillian Gish.He returned to Italy in 1927 and set up a shoe shop in Florence. The financial crash of 1929 had him declaring bankruptcy, but by the late 1930s he had been able to pay off his debts and purchase the Palazzo Spini Feroni.When he moved in, Mr. Ferragamo wanted to fill the building not only with footwear but also with family. So he went on a tour of Italy — to go “shopping for a wife,” as he wrote in his autobiography. He found her in his hometown, Bonito, where he had become a local benefactor.There, Dr. Miletti invited Mr. Ferragamo to his home and, according to Mr. Ferragamo’s memoirs, the two men entered into a conversation about the contours of the foot. Mr. Ferragamo asked Dr. Miletti’s daughter, Wanda, if he could use her for a shoe-fitting demonstration. He fell in love with her the moment he saw that she “had one toe peeping out of her stocking,” he wrote.Two weeks later, Mr. Ferragamo sent her a pair of custom black suede oxfords. “I had never worn anything so comfortable,” Mrs. Ferragamo later recalled. “I thought I could fly.”They married in a church in Naples in the fall of 1940 — she was 18, he was 42 — and as Mr. Ferragamo told it, they spent their first married night watching Allied planes attack the city.They and their family later lived in a 30-room villa in Fiesole, a hilltop town four miles northeast of Florence.The Ferragamo headquarters in Florence is also the site of the Museo Salvatore Ferragamo, an archival museum that Mrs. Ferragamo helped found in 1995 to chronicle and celebrate her husband’s footwear innovations, including the first cork wedge sandals and the architectural cage heel, a hollow metal cylinder that was strong enough to support body weight.Mrs. Ferragamo is survived by her son Ferruccio, who is now president and chairman; her daughter Giovanna Gentile Ferragamo, who is vice chairwoman; her son Massimo, who is chairman of Ferragamo USA; her son Leonardo, who is also a senior executive; 23 grandchildren; and many great-grandchildren. The family says she leaves “more than 70” descendants.Fiamma di San Giuliano Ferragamo died of breast cancer in 1998 at age 57. Fulvia Visconti Ferragamo died, also of cancer, in March at 67.Even after stepping into an honorary role, Mrs. Ferragamo continued to advise her children. Internally, she was known as the company’s “second pioneer.”“When my husband died his dream was a House of Ferragamo where you could buy shoes and everything else for elegant dressing,” Mrs. Ferragamo told The Times in 1981. “So little by little we followed that dream.”An earlier version of this obituary misstated Salvatore Ferragamo’s age when he died in 1960. He was 62, not 63. It also misstated the location of Fiesole, the village where Mr. and Mrs. Ferragamo had a villa. It is on a hilltop, not on the banks of the Arno River. The earlier version misspelled in one instance the name of one of Mrs. Ferragamo’s sons. He is Ferruccio, not Ferrucio. It also misspelled in one instance part of the name of the palace in Florence that is the company’s headquarters. It is the Palazzo Spini Feroni, not Spina.Advertisement"}