{"id": "Donald Trump’s Perverse Advantage", "paragraph": "Supported byWhen you’ve sunk this low, there’s nowhere to go but sideways.By Frank BruniOpinion Columnist Elizabeth Warren screwed up. That’s clear. Her big confirmation of Native American blood offended some Native Americans, did nothing to muffle or muzzle Donald Trump and left many journalists — me included — questioning her tactical smarts.But the media focus on her misjudgment, her character and whether she had the right stuff for the White House underscores the absurdity of our current politics, in terms of the advantage it confers on the president. We expect much of anyone stepping forward to challenge him. We expect absolutely nothing of him.Consider his role and behavior in the Warren saga. Her ancestry test followed his incessant mocking of her as “Pocahontas,” a schoolyard gibe from a puerile mind.She was specifically provoked by his recent statement that if he ever debated her, he’d insist that she submit to such an analysis and, if it showed any Native American blood, he’d donate $1 million to the charity of her choice. But when she presented such evidence last week, he immediately backpedaled, suggesting that he’d pledged nothing of the kind.Was there much attention to that? Nah. It was expected, familiar, another artless evasion atop an ever-growing Matterhorn of lies. Political observers wondered more about how her bungle squared with her presidential ambitions than about how his bogusness squared with the presidency itself. They fretted over her flaws because they — and more crucially, many American voters — long ago resigned themselves to his. Hers are quantifiable, definable. His have no bounds.That’s Trump’s edge over everybody. That’s his gift. He can do no wrong because he’s all wrong. He never really shocks because he’s a perpetual shock.When someone frolics at the nadir for as long as he has, there’s nowhere to go but sideways.He reminds me of a long-held fantasy of mine: that someday, to head the media off at the pass, a candidate would begin his or her campaign by holding a news conference and telling reporters: “Let me save you a lot of time and me a lot of grief. I hereby introduce all the skeletons in my closet: this drug, that dalliance, some naked greed here, several suspicious tax maneuvers there and, oh, I once adopted a dog from the pound and returned it the next day. Decide if I’m disqualified. Then we can move on to a conversation about how to slow the warming of the globe.”Except for the global-warming part, Trump essentially did that — not when he glided down that escalator in Trump Tower but by living the life that he had lived, under the glare that he had invited, until then. He hadn’t concealed his sexual infidelity; he’d crowed about it. He couldn’t pantomime Puritanism; he’d emblazoned his name on casinos and the Miss Universe pageant.It was clear that he had amassed his fortune through convenient bankruptcies, unsavory alliances and stiffed creditors. His racial demagogy had been well established in his insistence that Barack Obama was an illegitimate president born outside the United States.And his misogyny? Megyn Kelly was able to ask that famous question at the first 2016 Republican primary debate — the one with a litany of his gross physical put-downs of women — because they had all been chronicled, recorded, transcribed. There was no running from his boorishness. Boorishness was his brand.So when alienated, cynical and rebellious voters chose Trump as the loudest expression of their grievances, they knew exactly what they were getting. When evangelicals joined them, they understood what kind of church they were in. And when Republican holdouts submitted, they didn’t convince themselves that they had judged him too harshly on testimony too scant. They just decided that a pardon was in their self-interests, and they bit their tongues until they lost the ability to speak.The “Access Hollywood” tape didn’t ruin Trump because it didn’t reveal anything about him that wasn’t suspected or assumed. The exposure of his fraudulent philanthropy? Ditto. His rampant tax evasion? Scales fell from exactly nobody’s eyes.Trump enjoys a kind and degree of immunity that few if any politicians in my lifetime have been given. His own exhaustively established indecency inoculates him. As a result, all manner of ugliness slips by — unnoticed, barely noticed or noticed and accepted as Trump being Trump.His interview last week with The Associated Press was a doozy that didn’t get its due. His bragging was off the charts: He said that no president had ever exerted the kind of positive effect on his party’s midterm prospects that he was exerting. He called the current economy the best in the country’s entire history.And we once got worked up about Al Gore’s exaggerations?In that A.P. interview, Trump also cast himself as an expert on climate change by noting that an uncle of his was an M.I.T. professor. So, he explained, “I have a natural instinct for science.”And we’re worried about Warren’s ancestral assertions?Part of what protects Trump is a dynamic that I and many other writers have described before. The sheer volume of his offenses, not to mention the velocity with which one follows another, renders each of them less potent, not more. From bone spurs to bone saws, it’s one numbing blur.But there’s more to it than that. There’s the realization — and too often the acceptance — that he’ll never do much better and can’t get any worse. He’s already made light of John McCain’s torture by the North Vietnamese, defended the neo-Nazis who marched in Charlottesville, Va., and chosen air kisses from Vladimir Putin over hard truths from American intelligence officials. There’s simply no encore to that.We in the media certainly note all the new stuff: the “horseface” slur; the “rogue killers” escape hatch for Saudi butchers; the ill-timed, repugnant congratulations to a Montana lawmaker for body-slamming a journalist. But we’ve served this stew so many times before that a big audience beyond the die-hards has lost its appetite. We need to document all or most of the tweets and bleats — he’s the president of the most powerful nation on earth, after all — but there’s so much that we invariably come across as obsessed. Trump puts us in a trap.The way out isn’t clear, but a few necessary adjustments are. We in the media should do less “horseface” and more ballooning deficits, dysfunctional federal agencies, disgraceful cabinet members and reckless judicial appointments. Too often the substantial sinks beneath the saucier stuff, yet another factor that favors the president and lets him off the hook.We should also re-examine how we discuss whether Warren or some other challenger has the particular chops to handle Trump’s falsehoods and slurs. It’s as if we accept his strategy as legitimate, even ingenious, and locate weakness and fault in the person who can’t counter it.He’s the sad, bad actor. We can’t let his relentless spectacle obscure that.I invite you to sign up for my free weekly email newsletter. You can follow me on Twitter (@FrankBruni). Frank Bruni has been with The Times since 1995 and held a variety of jobs — including White House reporter, Rome bureau chief and chief restaurant critic — before becoming a columnist in 2011. He is the author of three best-selling books.   @FrankBruni • Facebook Advertisement"}