{"id": "Booksellers Protest Amazon Site’s Move to Drop Stores From Certain Countries", "paragraph": "Supported byBy David StreitfeldSAN FRANCISCO — More than 450 antiquarian book dealers in at least 26 countries pulled their books off an Amazon subsidiary on Monday, an impromptu protest after the site abruptly said it would drop all sellers from several nations.The flash strike against AbeBooks, which removed over 2.5 million books from the marketplace, is a rare concerted action by vendors against Amazon, which depends on third-party sellers for much of its merchandise and revenue. The protest arrives as increasing attention is being paid to the extensive power that Amazon wields as a retailer — a power that is greatest in books.The stores are calling their action Banned Booksellers Week. The protest got its start after AbeBooks sent emails last month to booksellers in countries including South Korea, Hungary, the Czech Republic and Russia to say that it would no longer “support” them. “We apologize for this inconvenience,” the company said.As the news spread, even unaffected dealers were surprised and angered. AbeBooks, together with Amazon itself, is by far the biggest international marketplace for secondhand and rare books.AbeBooks lists millions of books and manages the payments. The booksellers mail the books directly from their shops. The platform was founded in 1995 and was bought by Amazon in 2008. It continues to operate independently, and many of its customers never even realize who the owner is. AbeBooks is based in Victoria, British Columbia, where it started.The Amazon subsidiary told the International League of Antiquarian Booksellers that it was scaling back because “it is no longer viable for us to operate in these countries due to increasing costs and complexities.”The reaction was fierce. “AbeBooks is saying, ‘We’re cutting you and your country off. It’s nothing you did, we just decided we don’t want to deal with you anymore,’” said Scott Brown, a bookseller in Eureka, Calif. “It’s infuriating.”One of the affected booksellers was Antikvariat Valentinska, a large antiquarian store in the center of Prague. “The decision to close our account on such short notice has come as a complete shock, especially since no reason was given, not even upon request,” the store said in a statement. “Just our company alone will almost certainly have to dismiss at least five employees.”Peter Harrington, a leading London antiquarian dealer, said AbeBooks’ “high-handed manner” was at the root of the protest, with the platform taking the affected booksellers and “destroying their livelihoods in just a couple of impersonal sentences.”Last week, the Antiquarian Booksellers’ Association, based in London, responded by saying it would drop AbeBooks as a sponsor of its 2019 book fair. “Our mission is to champion the highest standards of rare bookselling across the world, irrespective of location,” the association said. “Sadly we feel that AbeBooks is not a suitable fair sponsor for us at this time.”Simon Beattie, a British bookseller, set in motion the impromptu strike on Thursday afternoon. “I have decided to put my books on (permanent) vacation on ABE in solidarity with fellow booksellers in the Czech Republic, Hungary, South Korea and Russia,” he wrote to colleagues. “I hope you might like to follow suit.”In the tight-knit, if loosely organized, antiquarian community, the idea quickly spread.On Saturday night, in response to a query from a reporter, AbeBooks issued a statement saying it was dropping the countries because “our third-party payment service provider is closing at the end of the year.” It added that, “We regret that we cannot continue to serve all sellers.”Asked how many booksellers and countries were affected, Richard Davies, an AbeBooks spokesman, said, “I am not adding anything else to that statement.”Mr. Brown, one of the dealers organizing the protests, said that for many of the booksellers, AbeBooks’ actions underlined both Amazon’s power and its refusal to be accountable for it.“The biggest e-commerce giant in the world apparently finds it too complicated to do business in Prague,” he said. “You have to wonder who’s next. We’re all vulnerable to Amazon’s capricious actions.”Underlying the mystifying nature of the action, Amazon itself is still selling merchandise from the banned countries, including books.Since Abebooks controls its storefront, the only recourse the protesting booksellers have is to tell it that they are “on vacation.” The marketplace then puts a message next to their name saying, “This member’s inventory is temporarily offline. Please check back later.” There was no acknowledgment that this was not business as usual.An earlier version of this article misspelled the surname of the British bookseller who set in motion a strike against AbeBooks. He is Simon Beattie, not Beattle.Advertisement"}