{"id": "New York Times Endorses Antonio Delgado, Liuba Grechen Shirley, Perry Gershon, Anthony Brindisi, Tom Malinowski and Mikie Sherrill", "paragraph": "Supported byDemocrats in six races in New York and New Jersey can see their party restore good sense in Congress. By The Editorial BoardThe editorial board represents the opinions of the board, its editor and the publisher. It is separate from the newsroom and the Op-Ed section.So that a president with little respect for democracy won’t be freed of all constraints, even some lifelong members of his own party have called for Democratic victory in the midterm elections, to deny Republicans continued control of all three branches of government and both houses of Congress.It is a frightening moment. A foreign government methodically exploits divisions that President Trump deepens, stirring fear of immigrants and Muslims, resentment of women and hatred against African-Americans. Thrilled by the spoils of a right-wing agenda for which their donors have paid good money, Republican politicians turn a blind eye as Mr. Trump undermines a special counsel’s investigation into his suspicious activities. They welcome Trump-loving fanatics they would have once shunned.With that in mind, it would be easy to say “Vote Democratic” when considering congressional campaigns in New York and New Jersey. But in six races that may help determine control of the House, we can enthusiastically support candidates not simply because of their partisan affiliation but because of their stands on issues that matter in the districts that they hope to represent come January. New York’s 19th District, the Hudson Valley and the Catskills.Antonio Delgado, an energetic Democratic lawyer and Rhodes scholar, has made health care the central theme of his campaign to unseat Representative John Faso, the Republican. Though Mr. Delgado and his family recently relocated to the district from New Jersey, he grew up in Schenectady, just outside the district’s northern border. Mr. Delgado backs a public option to allow people under age 65 to opt into Medicare, and legislation to lower premiums and deductibles. He supports abortion rights and common-sense gun safety reforms like expanded background checks. In a district in which Democrats and Republicans roughly balance out, he’s gotten some Republican support, including the endorsement of former State Senator John Dunne, a leading New York Republican for decades.Mr. Delgado’s opponent has largely supported the Trump agenda, including voting to repeal the Affordable Care Act. Just as troubling, Mr. Faso has failed to condemn race-baiting attack ads against Mr. Delgado, run on the incumbent’s behalf by congressional leadership political action committees. Those ads highlight Mr. Delgado’s brief career as a rapper, in which he tackled issues from poverty and inequality to racism and the war in Iraq. Their purpose is clearly to suggest to white voters that, because Mr. Delgado is black, he is dangerous. Even Mr. Faso’s popular Republican predecessor, Chris Gibson, has called the ads unfortunate. Voters in the 19th Congressional District deserve better. They deserve Mr. Delgado.New York’s Second District, Long Island. Liuba Grechen Shirley, a Democratic activist challenging a longtime Republican incumbent, Representative Peter King, is among the wave of women inspired to run by the election of Donald Trump. She previously helped galvanize Democrats and women in the district by starting an organization to oppose the Trump agenda, particularly the attempted repeal of the Affordable Care Act. When Mr. King voted to end that law, she first protested as a constituent, then decided to run against him.Ms. Grechen Shirley has a professional background in global development, working for the United Nations Foundation. That she is also a mother of two young children won her national attention this year when she persuaded the Federal Election Commission to let her spend campaign funds on child care, making her the first woman to do so.She supports Medicare for All, a federal minimum wage of $15 per hour and expanded funding for prekindergarten programs. She would also extend Temporary Protected Status to immigrants who fled disaster at home. That more welcoming approach would be a much needed change from Mr. King, who supported Mr. Trump’s so-called Muslim travel ban. Mr. King has also stirred anti-immigrant sentiment more generally, in his district and nationally. Asked about the separation of children from parents at the border, he told one news outlet: “Americans care more about Americans.”Mr. King has served in Congress since 1993, but, with Democrats energized, Ms. Grechen Shirley has a path to victory. New York’s First District, Long Island. Like most campaigns this fall, this one has focused on what Congress can do, not what the White House has done. Perry Gershon, the Democrat, supports Medicare for All and has backed the Affordable Care Act, which the Republican incumbent, Representative Lee Zeldin, voted to gut. Mr. Gershon, who wants to discuss sensible restrictions on immigration, has backed protection for Dreamers without other stipulations, unlike Mr. Zeldin. Mr. Zeldin supports withdrawal from the Paris climate agreement, which could have dire consequences for district with miles of coastline. But the president has had a cameo part in the race. Mr. Gershon has provocatively said he was inspired to run by seeing parallels between Hitler’s rise and Mr. Trump’s rise while visiting the United States Holocaust Memorial Museum in Washington. Mr. Zeldin, who has enthusiastically backed Mr. Trump, kicked off his re-election campaign at an event with Sebastian Gorka, a far-right former Trump aide who has worn a pin from a Hungarian group founded by Nazis. That group has claimed Mr. Gorka as a member, although he denies it. Mr. Zeldin has also had a fund-raiser with Steve Bannon, another former Trump aide, who has been connected with some of the most extreme right-wing groups in Europe and the United States. For his legislative good sense and opposition to Trumpian excess, Mr. Gershon is worthy of voters’ support.New York’s 22nd District, central New York.Anthony Brindisi, a Democratic state assemblyman hoping to oust Representative Claudia Tenney, a Republican, is hard-working, refreshingly earnest and moderate — exactly the kind of Democrat to represent a district that voted for Barack Obama twice and Donald Trump once.Mr. Brindisi supports abortion rights but voted against Gov. Andrew Cuomo’s gun control legislation — there are many gun rights supporters in the district, which is home to Remington Arms. But Mr. Brindisi also supports expanded background checks and other gun safety legislation. He says it was Ms. Tenney’s vote to repeal the Affordable Care Act that persuaded him to run this year.His measured approach is a stark contrast to that of Ms. Tenney, who has wrapped herself around Trump-style politics. In the wake of the Parkland, Fla., school shooting this year, Ms. Tenney said in a radio interview that “so many of these people that commit the mass murders end up being Democrats.”Richard Hanna, a Republican who held the seat from 2011 to 2017, has endorsed Mr. Brindisi. Anthony Brindisi has earned that kind of bipartisan support, from politicians and voters. New Jersey’s Seventh District, northwestern New Jersey. Tom Malinowski, a former Washington director for Human Rights Watch and assistant secretary of state for Barack Obama, is running against the incumbent Republican, Leonard Lance.For decades, in and out of government, Mr. Malinowski has fought against torture and lobbied for protections for women, L.G.B.T.Q. people and vulnerable minorities around the world. He was a leading proponent of the bipartisan Magnitsky Act, passed in 2012 to freeze assets of Russian officials who abuse human rights and since expanded to apply to foreign officials anywhere.Mr. Lance is no right-wing ideologue. He sponsored legislation to prevent President Trump from firing Special Counsel Robert Mueller, and Gabby Giffords’s organization endorsed his re-election in August, citing his reasonable stances on gun safety. The Times endorsed his candidacy the first time he sought this seat, in 2008, saying, “Mr. Lance’s leadership qualities and his voice of moderation are needed now in Congress and in the Republican Party.” Since then, though, he has been more conservative than we expected, fighting the Affordable Care Act during the Obama administration, though ultimately opposing its repeal under Mr. Trump. He has also voted for Trump-backed legislation to harm labor protections, consumer rights, pollution controls and abortion freedom. While Mr. Lance makes a case for being a moderate bridge between the parties, Mr. Malinowski makes a better case for bipartisanship that can get results with Democratic leadership. He deserves voters’ support.New Jersey’s 11th District, the northern suburbs.Mikie Sherrill, a former Navy helicopter pilot and federal prosecutor, is the Democrat vying for the seat against State Assemblyman Jay Webber, a Republican endorsed by President Trump who has opposed state funding for Planned Parenthood. Ms. Sherrill has said her top priorities would be passing legislation to create universal background checks for gun purchases and drumming up support for the Gateway project to build a new rail tunnel under the Hudson River to New York, a key issue for the region. Representative Rodney Frelinghuysen, one of several House Republicans who chose to retire this year, represented the district for 24 years. Ms. Sherrill offers a centrist campaign that should appeal to voters who elected Mr. Frelinghuysen every two years for more than two decades. For example, she has not come out in favor of a full repeal of the Republicans’ 2017 tax bill, nor does she support initiatives like free community college or a single-payer health care system because they’d require tax hikes. The nation needs representatives in Congress who will act against corruption in the Trump administration and work for legislation to provide health care, public services and jobs to Americans, as opposed to tax breaks for millionaires. These six in New York and New Jersey will be among the best. Follow The New York Times Opinion section on Facebook and Twitter (@NYTOpinion).Advertisement"}