{"id": "How a Garden for the Poor Became a Playground for the RichHow a Garden for the Poor Became a Playground for the Rich", "paragraph": "\n\n      By NIKITA STEWART and \n    \nSERGIO PEÇANHA\n\nOCT. 18, 2018\n\n\n        By NIKITA STEWART, SARAH BLESENER and SERGIO PEÇANHA. Produced by JEFFREY FURTICELLA and JOSH WILLIAMS\nThe backyard disappeared four years ago. At its grandest, the backyard was beautiful, a place that turned into castles and faraway lands in the mind of a child.Monkey bars, a sandbox, a slide, a track for riding bikes, a garden for adults who competed over who grew the best vegetables.It was meager, nothing fancy, but it was an escape right outside the backdoor.The children could hear their mother calling out from the second-floor window.They looked up, and there was Po Lan Ko telling them to stop roughhousing or to come inside for dinner.Here is what’s in place of the backyard now — a boutique hotel.For 30 years, the backyard behind the Thelma Burdick building on Manhattan’s Lower East Side was an oasis of open space for the low-income tenants who lived there.Today there’s the chic, 28-story hotel, with luxury condos at the top. One condo sold for about $20 million.“It says, ‘Hey, gentrification’s here. This used to be our playground,” Robinson Ko, 34, said. He is the oldest child pictured in the backyard.But gentrification is about displacement. This was even deeper.This was about disenchantment, that feeling of belonging and then loss that has gripped pockets of New York City as waves of wealth stream through communities, moving poorer people to the fringes.Ian Schrager, a famed curator of night life best known for Studio 54, and his partners bought the backyard land for $50 million in 2012 as he expanded his footprint in the boutique hotel industry.The hotel, called Public, is “the best thing we’ve ever done,” Mr. Schrager said in a promotional video. “It’s based upon a simple but very important, revolutionary idea: luxury for all. Just think about it. It means that everybody is entitled to participate in a luxury experience, giving them everything they need and everything they want.”The modern design included floor-to-ceiling windows, with beds placed right next to them. That sometimes creates a peep show for Burdick tenants, who call the police to complain about the noise and sex.Mr. Schrager declined to talk to us about the Burdick.Alysha Lewis-Coleman, shown here with her son in their living room, was raised on the Lower East Side.Ms. Lewis-Coleman works as a cook. She is also the president of the local community board.One floor below lives Deborah Gonzalez, 64. She is worried that she is going to lose her apartment.Until earlier this year, she had been the longtime president of the Burdick’s tenants’ association. She believes that the building management is trying to pressure her to leave because she stands up for residents’ rights.Over the decades, the tenants — a mix of mostly Asian, Hispanic, black and a few white families — have become a tight-knit community that shares the need for safe, affordable housing.They fondly remember “our” backyard, “our” garden, “our” playground.When tenants learned that the backyard was being sold, Ms. Gonzalez, Ms. Lewis-Coleman, Ms. Ko and another longtime resident named Cheryl Freeman went up against representatives of their building’s owner and of the hotel.The tenants hoped they could benefit in some way. What was owed to them?“We sat down,” Ms. Freeman, 60, said. “The fantastic four. We sat down for seven months negotiating. We knew we couldn’t beat them, so we figured get something from them.”Ms. Gonzalez chimed in, “They found out we were a force to be reckoned with.”The Burdick is a Section 8 building, where tenants receive rent subsidies from the federal government.By promising to not mount a legal fight over the backyard, tenants were guaranteed that the landlord would maintain the building as Section 8.The landlord also agreed to make renovations, and every restoration has become a reason to celebrate. In August, tenants held a party to commemorate four new benches in a courtyard.Tenants also received new air-conditioners, and modern washers and dryers replaced old ones in the laundry room.Some common areas of the building were restored, reviving the simple yet elegant touches of art that helped elevate the Burdick as a model of low-income housing.But now there is a behemoth next door. As current president of the tenants’ association, Angie Torres, on the right, must meet with management sometimes in the hotel. She turns down cups of coffee.“I don’t want to party with the enemy,” Ms. Torres, who works as a bookkeeper, said. “That’s what it feels like, but it’s a really nice establishment.”“Sometimes I do want to go have breakfast there, and I wish I could see what the food is like, but I feel right now it’s weird,” she added.“New York has always had extreme differences between the rich and poor,” said Kenneth T. Jackson, a history professor at Columbia University.A century ago, the city was teeming with heavily populated slums and home to half of the rich people in the United States.“They lived in relative closeness because the city was jammed,” Mr. Jackson said. “But I don’t think as much as right now.”Thelma Burdick, for whom the building was named, was instrumental to the Lower East Side’s fight for affordable housing.In the 1950s, she helped to lead a victory against Robert Moses, a legendarily powerful official in the 20th century who was the mastermind behind many of the New York area’s parks, highways and bridges.The protesters won a commitment from the city to develop affordable housing like the Burdick.These days, 43.5 percent of New York City’s population lives below or near poverty, defined as a family of four with an income of $32,402.The contrast between rich and poor is extreme in the yellow spots on the map below, where at least 40 percent of the families make less than $30,000 a year and at least 5 percent of the households have an annual income above $200,000.BRONXMANHATTANQUEENSBurdickbuildingBROOKLYNSTATEN ISLANDBRONXMANHATTANQUEENSBurdickbuildingBROOKLYNSTATEN ISLANDBRONXQUEENSMANHATTANBurdickbuildingBROOKLYNSTATEN ISLANDBRONXMANHATTANQUEENSBurdickbuildingBROOKLYNSTATEN ISLANDAt the Burdick, partying means balloons in the community room and sheet cake, maybe some wine and liquor in plastic cups.On a regular day on the hotel’s rooftop, guests sometimes have to wait for a seat to enjoy cocktails, like a Public Pimm’s Cup or a Royale, for $17 each.Simply sitting at a table can cost $500.Residents of the Burdick expected their new neighbors to be wealthier, but living in the shadow was harder than many imagined.Residents can still see some green space, but now it belongs to the hotel.The grass is so manicured that it looks like artificial turf.Tenants are trying to hang on to some semblance of a garden, putting fruits, vegetables and plants in pots in the paved courtyard that now has the benches.Nearly six years after tenants agreed to the deal that paved the way for the hotel, they are still waiting on a playground.The differences between the Burdick building and the Public hotel are not all black and white. Hotel guests and patrons of various races and ethnicities said they feel the hotel fills a void and is welcoming.Ron Myers, a jet-setting crisis management consultant, was born and raised in Brooklyn and now lives in Harlem. “Literally 200 languages being spoken right now,” he said at the hotel one night.“It was such a moving experience just coming up in the elevator.”Ms. Ko has never been inside. “First, I’m not their class. I’m not the class,” she said. “It’s like their life but not my life.”Source: Satellite photographs by Google.Advertisement"}