{"id": "Cleveland Orchestra Fires Two Musicians for Sexual Misconduct", "paragraph": "Supported byBy Michael CooperThe Cleveland Orchestra, considered among the finest symphonic ensembles in the world, announced Wednesday that it had fired two prominent players for sexual misconduct and harassment.The orchestra fired the violinist William Preucil, its concertmaster of more than two decades, and Massimo La Rosa, its principal trombonist, after an investigation concluded that they had engaged in sexual misconduct and sexually harassing behavior with multiple women over a period of years. The investigation, commissioned by the ensemble, also faulted its former management for not doing more to look into allegations against the musicians after they were reported in the press years ago.“The evidence shows that both Preucil and La Rosa abused their positions as leaders and educators to entice female musicians into one-on-one situations in which they engaged in sexual misconduct,” said a report of the investigation, which was conducted by the law firm of Debevoise & Plimpton. “Both men also relied on their positions of prominence in the small classical music community to ensure that those women remained silent.”[Read the report accusing the musicians of misconduct.]The orchestra suspended Mr. Preucil, a star in the orchestra world, in July, after a report in The Washington Post included details of a female violinist’s accusations that he had assaulted her after a lesson in Miami in 1998. The orchestra then opened an investigation into accusations of misconduct throughout the ensemble, and suspended Mr. La Rosa in September.The investigation concluded that Mr. Preucil engaged in sexual misconduct or sexually harassing behavior with at least a dozen female musicians between 1996 and 2007.“Preucil used one-on-one opportunities with female musicians to engage in actions ranging from serious sexual misconduct to sexually harassing behavior, including engaging in sexual activity with a junior female colleague who was too afraid to stop the encounter due to Preucil’s forcible conduct and position of authority, requesting payment for lessons in the form of sexual favors, exposing himself, and making aggressive, unsolicited, and unwanted sexual advances,” the report stated. It said that his youngest victim was 17.The report said investigators had spoken with seven women who said Mr. La Rosa had engaged in sexual misconduct or sexually harassing behavior from 2010 to 2012. The report said that in one-on-one lessons, Mr. La Rosa “often told female students that they were ‘tense,’ instructed them to lie on the floor, and then touched them inappropriately both over and under their clothes under the guise of instructing them in breathing exercises.”The report added that he “also partially removed students’ clothing or his own clothing during lessons” and that investigators had received “one report that he engaged in aggressive, unwanted sexual contact with a female colleague.”Efforts to reach the two musicians were not immediately successful. Gary Hanson, who was the orchestra’s executive director from 2004 to 2015, said that the accusations reported in the press during his tenure reflected conduct at schools where the musicians taught, not within the orchestra.“It’s important to understand that the allegations were not judged then as they would be today,” he wrote in an email. “Nevertheless, it is not correct to intimate that management ignored the issues. We addressed them according to the best practice of the time, relying on the educational institutions to take the lead in any investigation, as they were the musicians’ direct employers in the reported cases.”The report said that Mr. Preucil had admitted to engaging in sexual contact with three female students, which he acknowledged was wrong, and that he had admitted to telling a sexually explicit story to a female violinist, but that he denied other acts of misconduct.And it said that Mr. La Rosa admitted that he had tried to kiss a student during a lesson at the University of Iowa, but said that he had thought that the student was attracted to him. The report said that he admitted “that he sometimes touched students during breathing exercises, although he claimed he did so only for nonsexual, pedagogical reasons.”The accusations first surfaced in 2007, when the newspaper Cleveland Scene published a story that said Mr. Preucil had made unwanted advances toward a student at the Cleveland Institute of Music, where he taught, accusing him of “rubbing himself against her and making a lewd advance.”The Debevoise investigation said it had “received multiple reports that two then-members of the executive committee of the board were separately approached by members of the orchestra” who were concerned about the report and that one musician “reported that Preucil had made unwanted verbal sexual advances to a female player in the orchestra.”The report concluded that “former orchestra leadership should have done more to investigate the reports about Preucil’s behavior following the Cleveland Scene article.”And a 2013 article on the website Inside Higher Ed reported that a trombone student had accused Mr. La Rosa of asking her to lie on the floor during a lesson, putting his hand up her skirt and kissing her. After that, the Debevoise report said, two universities, not named in the report, had asked the Cleveland Orchestra not to permit him to engage in one-on-one contact with its students. The report noted that the universities’ requests were not documented or placed in his file.In releasing the investigation’s findings, the orchestra said that its board had revised its anti-harassment policy, adopted a set of ethical principles for members of the orchestra community, and established a confidential hotline for people who wish to make anonymous reports.“Our community is rightfully proud of the worldwide reputation the Cleveland Orchestra has for its musical excellence,” André Gremillet, the ensemble’s executive director, said in a statement. “We want to be equally known for the caliber of the environment in which that music is created.”Advertisement"}