{"id": "What Business Casual Really Means", "paragraph": "Supported byDifferent people, different companies and different parts of the world have different ideas of appropriate apparel for work. Here’s how to cut through the confusion and pick a simple, versatile wardrobe.By Lizz SchumerWhether you are entering the work force for the first time, starting a new job or changing fields, choosing what to wear to work has never been more complicated. What constitutes “business casual” varies among companies, industries and parts of the world.Angie Cox, a Seattle-based stylist, fashion consultant and founder of YouLookFab.com, has watched the field evolve over her 13 years in it. “The whole concept of business casual has just changed dramatically, even within the change in dress codes,” she said.Before you grab your wallet and go clothes shopping, though, it pays to gather some intel. We asked stylists and experts from across the country to weigh in on what business casual really means, and how men and women new to a job or to the job market can dress for success.If you’re starting at a new company, use the internet to your advantage. Alison Gary, a stylist and founder of the Washington-based style website Wardrobe Oxygen, suggests Googling your future co-workers before your first interview. “In 2018, it’s a lot easier to find images of people working at the company,” she said. “You can get a better sense of what their office culture is like.”Once you step foot in the office, look at what others are wearing, both in your department and across the board. “I go by the whole old-school term of ‘dress not for the job you have, but the job you want,’” Mrs. Gary said. “Look at people who are in positions higher than you and see how they dress.”Kat Griffin, the founder of the fashion advice site Corporette, said it was important to take seniority into account when looking at what your managers wear. “Senior people have a huge bank of credibility — they’ve earned the right to dress how they please,” she said. “I advise readers to a) know generally what might not be acceptable, and b) to not wear any of those items until you see a midlevel person wear them, someone three to five years ahead of you.”All of the stylists we consulted suggested erring on the dressier, more conservative side for an interview, but that does not necessarily mean a full suit. You’ll generally be safe with coordinating separates, for women, or shirts and slacks for men.Diane Gottsman, an etiquette expert, author and founder of the Protocol School of Texas, advised taking stock of how an outfit makes you feel. “When choosing an outfit for the interview, remember, when you look good, you feel good,” she said. “Use your wardrobe choices to give an extra boost of self-confidence.”Keep fit and grooming in mind, too. “You don’t need to wear neutrals, you don’t need to worry about being conservative,” Ms. Cox said. “You do need to be covered; you mustn’t wear anything too tight.” Avoid perfume, as many people are sensitive to scent. She also suggested taking a jacket, for versatility. If your interviewer has on a blazer, now you do too. If not, take it off.Ms. Cox added that jingly jewelry could get distracting. “Even if it’s your signature to wear a lot of arm candy, don’t go in with a lot of bangles that are going to be noisy,” she said. The same goes for flip-flops or loud shoes: You don’t want the whole floor to hear you coming. If you have tattoos, Ms. Cox also does not recommend covering them for the interview. “If you aren’t going to cover up your tattoos to come to work, you’re not going to cover them for the interview,” she said.Most important, remember that most industries are not going to judge you too harshly for what you wear to your first meeting. As long as your outfit does not distract from how you present yourself, you’re probably in good shape.Once you have signed your offer letter, it’s time to get your first-day outfit ready. But resist the urge to go on a shopping spree right away. All of the stylists we consulted recommend stocking a few relatively neutral outfits for your first week. Take that time to watch what your new co-workers wear and follow their lead.Mrs. Gary, who specializes in capsule wardrobes, likes hitting the sales rack and avoiding statement pieces, which you can’t be reworn as often. “There’s no need to have 30 pairs of pants in your wardrobe, if you can find a good pair,” she said. “No one is going to know if you’re wearing the same pair of pants two or three times in a week if you’re styling them in different ways.” The office, she said, “is not the runway.” Start with a classic blazer, a pair of well-fitting pants, a blouse or button-down shirt, and a sweater that can all mix and match.Ms. Cox recommends asking the human resources manager to clue you in to the dress code. And whatever you choose, watch your silhouette. “When wearing extremely fitted pieces, the focus is on the body instead of the work,” she said. “I think the body is great, but the job is supposed to be about the job.”When deciding what is office-appropriate, the location of your office and your industry are important. In general, Silicon Valley tech, nonprofit and start-up culture skew more casual than New York City finance and business, which are different from what Nashville lawyers might wear. Look around for clues, and when in doubt, ask.“I know that being in D.C., our version of business casual is drastically different from say, Silicon Valley business casual,” Mrs. Gary said. “Theirs is, ‘Don’t wear flip-flops,’ where ours is, ‘Don’t wear denim except on Friday.’”Ms. Cox and Ms. Gottsman also recommend dressing for your audience. If you are working in a farming community, starched denim and a polo shirt may be more appropriate than a suit. Conversely, if you are in the medical or legal profession, you want to dress a level up from your clients or patients. “You have to look at the environment in addition to the corporate policy,” Ms. Gottsman advised. Your attire “should say, ‘I care.’ I think that that’s really what it boils down to,” she added. “Having respect for the people that you’re with, and having respect for yourself, as well.”Bottom line? You want your attire to inspire confidence in your colleagues, managers, and clients. “People make judgments based on what they see, and that perception becomes their version of the truth,” Ms. Gottsman said. “Dressing in a professional manner shows you pay attention to detail and take pride in yourself, which also translates into your work.”Advertisement"}