{"id": "Wells Fargo Suspends 2 Executives Amid Regulatory Review", "paragraph": "Supported byBy Emily FlitterWells Fargo said it had suspended two senior executives as part of a continuing regulatory review of its sales practices, the latest blow to a bank that has spent years reeling from scandals.The bank said on Wednesday that it had placed its chief auditor, David Julian, and its chief administrative officer, Hope A. Hardison, on immediate leave and removed them from the company’s operating committee of senior executives.Ms. Hardison had been one of the executives in charge of a broad effort to clean up the beleaguered bank. It has been repeatedly punished by federal and state regulators for its deceptive sales practices. American Banker, a trade newspaper, last month ranked her No. 10 on a list of women to watch in banking.Wells Fargo suspended Ms. Hardison and Mr. Julian at the request of regulators at the federal Office of the Comptroller of the Currency, according to a person briefed on the decision but not authorized to discuss it publicly.“These leaves relate to previously disclosed ongoing reviews by regulatory agencies in connection with historical retail banking sales practices,” the bank said in a statement on Wednesday. Wells Fargo said the moves had nothing to do with the bank’s reported financial results or internal financial controls.Ms. Hardison didn’t respond to requests for comment. Mr. Julian declined to comment, his son said.In February, the Federal Reserve imposed restrictions that prevent Wells Fargo from growing and opened the bank up to a wide review designed to stop its misconduct. The Office of the Comptroller of the Currency is also digging into the bank’s operations and requesting changes that regulators believe will eliminate the potential for more customer abuses.Wells Fargo once enjoyed a sterling reputation in the banking industry. But it has been rocked by years of trouble. Many of the problems involved employees opening phantom bank accounts in unwitting customers’ names, inappropriately signing them up for auto insurance and modifying their mortgages without authorization.When the Fed announced the heightened scrutiny, Wells Fargo executives said they expected it to last until September. But Timothy J. Sloan, the bank’s chief executive, said this month that the regulatory actions would last longer than initially envisioned.“We are still planning on operating under the asset cap through the first part of next year,” Mr. Sloan said during an Oct. 12 conference call with bank analysts.“During the past two years, we have become more customer-focused, made significant leadership and board changes, strengthened risk management and controls, simplified the organization, and invested in our team members,” Mr. Sloan said in the statement. “We remain steadfast in our focus on making things right for customers and building a better Wells Fargo.”Stacy Cowley contributed reporting.Advertisement"}