{"id": "Inquiry Into Ryan Zinke Land Deal Is Said to Escalate", "paragraph": "Supported byBy Coral DavenportWant climate news in your inbox? Sign up here for Climate Fwd:, our email newsletter.WASHINGTON — The Interior Department’s top watchdog has referred an investigation into a possible conflict of interest by Interior Secretary Ryan Zinke to the Justice Department, according to a person familiar with the matter, a sign that the federal government is considering a criminal investigation of Mr. Zinke’s actions.It is not known which investigation was referred to the Justice Department. Mr. Zinke is the subject of at least six known federal investigations into allegations of ethical misconduct or other policy violations. However, the person familiar with the matter, who was not authorized to speak publicly, said it was highly likely that the investigation now being examined by the Justice Department was one involving a Montana land deal involving Mr. Zinke and the chairman of the energy giant Halliburton. The Interior secretary has come under heightened scrutiny since the resignation in July of the Environmental Protection Agency administrator, Scott Pruitt, who stepped down after investigations revealed multiple violations of ethics rules and possibly of the law.Experts say that the ethics allegations concerning Mr. Zinke, which are growing in number and seriousness, are starting to resemble those that brought down the former E.P.A. chief. “It’s similar to Pruitt,” said Patrick A. Parenteau, an expert in energy and environment law at Vermont Law School. “It suggests someone who doesn’t really have a deep respect for law and procedure, who likes to cut corners and go right up to the edge of the law.”The interior watchdog, Mary J. Kendall, the department’s acting inspector general, opened an investigation this summer into the Montana real estate deal, which included a foundation that Mr. Zinke established and a development group backed by David J. Lesar, the chairman of Halliburton.The inquiry, opened at the request of congressional Democrats, was intended to examine “involvement in and use of taxpayer resources to advance land developments,” Ms. Kendall wrote this summer in a letter to members of Congress.It focuses on a deal in Whitefish, Mont., Mr. Zinke’s hometown, between a charitable group run by his wife, Lolita Zinke, and the development group backed by Mr. Lesar. The deal included a hotel, retail shops, a gallery and a microbrewery.Mr. Zinke’s personal lawyer, Stephen M. Ryan, said in an emailed statement that the interior secretary was not aware of any Department of Justice action in the matter. “The Secretary has not been contacted or notified of any D.O.J. investigation or Inspector General referral,” Mr. Ryan said. “It is disappointing that unsubstantiated and anonymous sources have described an I.G. office referral to members of the media, as this violates D.O.J. and I.G. policy direction. The Secretary has done nothing wrong.”Heather Swift, a spokeswoman for Mr. Zinke, has said in the past that the secretary did nothing improper and that he resigned from his charitable foundation’s board of directors before the deal was made.The Justice Department did not respond to an emailed request for comment.If confirmed, the referral would be the second recent move by Ms. Kendall’s office to advance investigations into Mr. Zinke’s conduct. This month, a report by Ms. Kendall’s office concluded that Mr. Zinke violated his agency’s travel policy by having his wife travel with him in government vehicles. That report also found that Mr. Zinke considered requesting that his wife become an Interior Department volunteer in order to legitimize her travel. In addition, Mr. Zinke on one occasion asked his security detail to drive a person who was not a government employee to an airport, also in violation of agency policy, the report found.Environmental activists have criticized Mr. Zinke as he has sought to scale back protections on public lands and open up vast new areas to oil and gas drilling.Representative Raul Grijalva of Arizona, the ranking Democrat on the House Natural Resources Committee, who is poised to become chairman of the committee should Democrats gain a majority in the House in the midterm elections, said he was prepared to increase attention on the investigations into Mr. Zinke.“If Democrats are given the opportunity to hold a congressional majority next year, Secretary Zinke will be called to testify in February on why his conduct in office merited referral to the Justice Department, whether that referral was related to the recent attempted firing of his inspector general, and his many other failures and scandals,” Mr. Grijalva said in a statement.Mr. Grijalva was referring to reports that on Oct. 12, Ben Carson, the housing and urban development secretary, sent an email to employees announcing that Suzanne Tufts, a political appointee in his agency, would be moved to the Interior Department to replace Ms. Kendall, a career official, in the watchdog role. In the end, Ms. Kendall remained in the job. Lisa Friedman contributed reporting.For more news on climate and the environment, follow @NYTClimate on Twitter.An earlier version of this article misstated the number of federal investigations that Interior Secretary Ryan Zinke is facing. Mr. Zinke is the subject of at least six current ethics inquiries related to his leadership at the Interior Department, and at least nine inquiries linked to him have been closed. He is not currently the subject of at least 18 known federal investigations.Coral Davenport covers energy and environmental policy, with a focus on climate change, from the Washington bureau. She joined The Times in 2013 and previously worked at Congressional Quarterly, Politico and National Journal.  @CoralMDavenport • Facebook Advertisement"}