{"id": "Morningside Heights: More Space for the Money", "paragraph": "Supported byLiving inThe area is known for its parks and historic buildings, but it has another draw: larger homes for less than New Yorkers might pay elsewhere. 12 PhotosView Slide Show ›By Aileen JacobsonJill Shapiro was skeptical. She was taking the subway to look at an apartment on West 110th Street in Morningside Heights, which seemed very far north, she said, compared to the West 86th Street address where she was living with her husband and two daughters.“But when I got off the train, on that corner, I instantly knew,” said Ms. Shapiro, 51, an office administrator. “If the apartment was O.K., this would be the neighborhood. It felt right.”Among the attractions were a 24-hour supermarket on one corner, an adequate number of small shops and restaurants, and a “little less hustle and bustle” on the streets than in her previous neighborhood, she said. And then there was the three-bedroom, two-and-a-half-bathroom apartment that she and her husband, Evan, a television producer who is also 51, bought 14 years ago, for about $1.2 million. MorningsideHeightsHENRY HUDSON PKWY.1HarlemW. 125TH ST. SAKURA ParkRiverside ChurchMorningsideHeightsHudson R.MORNINGSIDE Ave.BROADWAYRIVERSIDEParkColumbiaUniversityRIVERSIDE DR.W. 120TH ST. BroadwayPresbyterianChurchAMSTERDAM AVE.MORNINGSIDEParkW. 110TH ST. W. 116TH ST. Cathedral ofSaint John the DivineManhattan1/4 mileBy The New York TimesThat amount of space for a reasonable price is a major reason many people move to Morningside Heights; so are the low-rise historic buildings and the extensive parkland. For Ms. Shapiro, another reason was the students at Columbia University and other nearby schools. “The Columbia kids bring a lot of energy to the neighborhood,” she said. She even likes the tourists she encounters when she walks her dogs in the gardens around the Cathedral of Saint John the Divine, in an 11.3-acre complex called the Close, where peacocks roam the grounds. “The dogs like to look at them,” she said. (So do the humans.)Her daughters, 20 and 23, live elsewhere now, but want to return, she said: “They have forbidden us to sell the apartment.”Edward Fortier, 56, a lawyer, was also looking for more space at an affordable price earlier this year, when he and his husband bought a three-bedroom apartment near West 125th Street, at the northern end of the neighborhood, for less than $1 million — a relative bargain, although it required a complete renovation. “It was hard to find that size apartment any other place, especially to the south, except in the several-million-dollar range,” he said.For the previous 21 years, he’d lived at 110th Street and Central Park West, but he always liked the area around Columbia. “It has a nice open feel to it,” he said. “And it has a lively vibe.” Some residential construction nearby has been spurred in part by Columbia’s new 17-acre Manhattanville campus, starting north of West 125th Street and already partly open. And while the additional housing is not welcomed by all residents, Mr. Fortier is optimistic, believing “it will bring more life to the neighborhood.”Morningside Heights is both an old neighborhood — much of it was given historic landmark status by New York City last year — and a changing one, with several buildings recently completed or going up.It stretches from West 110th Street (called Cathedral Parkway in some parts) to West 125th Street (known in parts as Dr. Martin Luther King Jr. Boulevard), and from the Hudson River to Morningside Avenue. It includes the 13-block-long Morningside Park, which has playgrounds, walking paths and a duck pond; the smaller Sakura Park, dotted with Japanese cherry trees; and broad areas of Riverside Park, with tennis courts at West 119th Street. Riverside Church, around West 122nd Street, has a soaring Gothic spire that can be seen from many blocks around.Columbia University is the behemoth in the neighborhood. The main campus has an entrance at Broadway and West 116th Street, but satellite buildings are scattered all around, including Barnard College across the street, ancillary academic centers and residential buildings. Bookstores, bars, food trucks and cafes line some sidewalks, while residential side streets tend to be peaceful.“It’s like a little village,” said Laura Friedman, 65, a retired community organizer who has lived in the neighborhood for 42 years with her husband, Paul Shneyer, 66, an attorney, and raised two daughters there. But she and others believe that the area — which she said has already become too upscale for some writers and artists who once rented there — is in danger of becoming overdeveloped, mostly on land owned by institutions in need of funds. Ms. Friedman is president of the Morningside Heights Community Coalition and of the Morningside Heights Historic District Committee, both of which “speak to how deeply people care about the neighborhood they live in,” she said.Enclave, a 15-story, 428-unit modern rental building completed in 2016, rises next to the ornate Cathedral of Saint John the Divine on West 113th Street. Across the street, four former nurses’ residences that are part of the Mount Sinai St. Luke’s hospital complex are being converted into rental apartments, with construction scheduled to conclude in 2020. Union Theological Seminary, on Broadway near 121st Street, has sold the rights to build a condominium on its campus, as has the Jewish Theological Seminary, across the street, where a 32-story building called the Vandewater is going up.The historic district committee is working to extend the district’s boundaries, and the coalition has promoted affordable housing, Ms. Friedman said, but “we have not yet been successful in stopping anything.”The average sales price for a co-op this year, through the end of September, was $895,958, while the average sales price for a condo was $772,640, according to NeighborhoodX, a real estate data and analytics company.“Prices have held pretty firm,” said Steven O. Goldschmidt, a senior vice president at Warburg Realty, and in some cases have risen in recent years. Part of the reason for the increase, which has also been seen in luxury rentals, he said, is Columbia’s new Manhattanville campus.Renovated buildings and a few new developments have made the neighborhood more desirable, especially for people looking for larger spaces, said Adrian Noriega, a broker with CORE Real Estate. And while the neighborhood has become somewhat pricier, it still offers good value, he said: “It has changed for the better.”In mid-October, 45 homes were listed for sale on StreetEasy. The least expensive, at $399,000, was a junior one-bedroom, one-bathroom co-op near the northern end of Broadway. The costliest, at $2.95 million, was a three-bedroom, two-and-a-half-bathroom co-op on Riverside Drive with park and river views.Of the 66 apartments for rent in late October, prices ranged from $1,989 for a studio south of the Columbia campus to $9,500 for a four-bedroom, three-bathroom furnished condo unit with four balconies, available for only seven months.Chris Shelton, pastor of the Broadway Presbyterian Church on West 114th Street, said there is a lot of “community warmth” in the neighborhood, as well as “a sense of social justice and a passion for doing good.” Mr. Shelton’s church operates a shelter and a soup kitchen, and he has instituted a series of chamber-music concerts that are open to the public, he said. Columbia University offers many arts programs, and the Manhattan School of Music, on Claremont Avenue and 122nd Street, presents student performances, many of them free.“There’s a cultural vibe,” said Mr. Goldschmidt of Warburg Realty, who has lived in the neighborhood since 2004. Largely because of the students, he said, it is also a “24/7 neighborhood that is constantly vibrating.” On Amsterdam Avenue, across from the Cathedral, one can find the venerable Hungarian Pastry Shop, filled with students and older people reading, writing or chatting, and V & T Pizzeria and Restaurant, a popular student hangout, both of which have sidewalk seating.On the west side of Broadway, between West 112th and 113th, a string of restaurants with sidewalk seating includes Community Food & Juice and Le Monde, a more sedate French restaurant. On the opposite corner is Tom’s Restaurant, where Jerry Seinfeld and pals ate on “Seinfeld” (though only the exterior was used on the show). On the northern end of Broadway, in an area sometimes identified as part of Harlem, Dinosaur Bar-B-Que and Harlem’s Floridita are popular. Morningside Park hosts the Down to Earth farmers’ market on Saturdays. And on Broadway along the Columbia campus, from West 114th to West 116th Street, Columbia Greenmarket operates year-round on Thursdays (Tuesday on Thanksgiving week) and Sundays.Students living below West 116th Street are zoned for P.S. 165 Robert E. Simon, which has about 730 students in prekindergarten through eighth grade. According to the 2016-17 School Quality Snapshot, 35 percent of students there met state standards in English, versus 41 percent citywide; 36 percent met state standards in math, compared with 38 percent citywide. Students north of West 116th Street are zoned for two schools. P.S. 125 Ralph Bunche has about 260 students in prekindergarten through fifth grade. On 2016-2017 state tests, 54 percent of students there met standards in English, versus 40 percent citywide; 54 percent met standards in math, compared with 42 percent citywide. At P.S. 36 Margaret Douglas, which has about 439 students in prekindergarten through fifth grade, 21 percent met standards in English on 2016-2017 state tests and 21 percent met standards in math. The 1 subway train stops on Broadway at West 110th, West 116th and West 125th Streets. A commute to Midtown can take 30 to 45 minutes. Buses include the M4, M5, M11, M104 and M60-SBS to and from La Guardia Airport.A bronze relief sculpture at Columbia University, facing Broadway between West 117th and 118th Streets, commemorates “the Battle of Harlem Heights, won by Washington’s troops on this site, September 16, 1776.” George Washington later wrote of the skirmish, “This little advantage has inspired our troops prodigiously.” A gift of the Sons of the Revolution in the State of New York, the plaque was installed in 1897, the year the campus was inaugurated.For weekly email updates on residential real estate news, sign up here. Follow us on Twitter: @nytrealestate.Advertisement"}