{"id": "E Tu Jim Mattis?", "paragraph": "Supported byThe defense secretary is the best of this administration. But even the best stumbles.By Frank BruniOpinion ColumnistIf almost any other member of President Trump’s cabinet had sought to justify his deployment of thousands of troops to the border by talking about the threat of Mexican revolutionaries more than a century ago, it probably would have sailed right past me. Hyperbole, hysteria and convenient invocations of history are the native tongue of this administration, whose members were either fluent in it beforehand or picked it up quickly.But Defense Secretary Jim Mattis, who recently evoked that specter, was supposed to speak a better language. He was known to be a saner sort — not just the proverbial adult in the room but the conscience amid the corruption and the barricade against disaster. I like to think that millions of American parents instructed their children to expand their bedtime prayers. Watch over Mommy. Protect Daddy. And don’t let anything bad happen to General Mattis.Well, something bad happened to General Mattis.On Wednesday he traveled to southernmost Texas to visit those troops. The trip was a good and necessary thing. President Trump, for all his lip service to venerating the military, doesn’t go out of his way to mingle with or pay tribute to servicemen and servicewomen; somebody has to make them feel appreciated and important. That was Mattis’s noble goal. He was trying to assure them that if they missed Thanksgiving, it wouldn’t be for naught.But that wasn’t doable without dabbling in deception, because the propping up of this president requires it.In Mattis’s case, it required Pancho Villa.Pancho Villa was a Mexican revolutionary who, along with hundreds of armed followers, attacked an American border town, burning houses and killing people, before retreating back into Mexico, where President Woodrow Wilson ordered him pursued. Mattis revisited that episode in remarks to reporters on his way to Texas.“I think many of you are aware that President Wilson 100 years ago — a little over 100 years ago — deployed the U.S. Army to the southwest border,” he said. “The threat then was Pancho Villa’s troops, a revolutionary, raiding across the border into the United States — New Mexico — in 1916.”Interesting. Also irrelevant. There’s no Pancho Villa in the caravan of migrants proceeding north through Mexico. Trump has admitted as much. He didn’t say so explicitly, but it’s beyond obvious in his near-total silence about the situation since the midterms.Before Election Day, the caravan was a Trojan Horse for jihadists. It was an “invasion” of such menace that soldiers might have to respond to any rocks thrown by the invaders with bullets. Trump used such overheated imagery in an effort to activate his base. To lend credibility to this scaremongering, he dispatched the troops.Now they’re laying concertina wire when they’re not twiddling their thumbs, and Trump has pretty much stopped mentioning the supposed enemy heading their way. Just like that — poof! — the caravan ceased to be an emergency. Apart from a rare, terse reappearance on Friday night, it exited his tweets.Many journalists have noted that, correctly deeming it proof that the deployment was a baldly, cynically political move. So Mattis told the troops on the border to ignore them. “There’s all sorts of stuff in the news,” he said. “If you read all that stuff, you know, you’ll go nuts.” Yes, because it’s true. And to hint otherwise is to bolster Trump’s dangerous demonization of the media and his branding of reporters as the “enemy of the people.”Mattis knows better. According to Bob Woodward’s book “Fear,” he sees Trump clearly because he has seen Trump in private situations where his ignorance and recklessness were bare. Mattis had to explain to Trump that the American military presence in South Korea was a deterrent to North Korea. He had to ignore Trump’s suggestion that American officials set in motion the assassination of Syria’s president, Bashar al-Assad. He compared Trump’s comprehension and acuity to those of “a fifth or sixth grader.”And then he felt Trump’s lash, which confirmed for him what a petty creature the president is. On “60 Minutes” last month, Lesley Stahl asked Trump about Mattis’s future in the administration, and Trump answered dismissively. “I think he’s sort of a Democrat, if you want to know the truth,” he said, as if that designation discredited any opinion — especially of him — that Mattis held. “He may leave. I mean, at some point, everybody leaves.” Que sera sera. He’s only the defense secretary. Only the most seasoned, qualified member of a cabinet whose average talent level is raised exponentially by his presence.Mattis, who subsequently told reporters that he doesn’t belong to either political party, has stuck with Trump for what seem to be the best reasons. More than his predecessors, the president needs competent, even-keeled people around him, and there’s no surfeit of A-list takers for even the administration’s highest-ranking jobs. The working environment leaves something to be desired. So does the boss.But there’s a fine line between taming the president and enabling him — between tempering the way he governs and implicitly validating it. To stand beside him is to signal assent. To gloss over his motives is to launder them. And that’s what Mattis did during his visit to the troops, who no doubt yearned to hear that their presence made sense but could be told that only if Mattis lied for the president and to all of us.Or fibbed, at least. Misdirected. Blabbered. He suggested to the troops that they were really there at the behest of Kirstjen Nielsen, the secretary of homeland security, to support the Border Patrol. “What does that mean?” he said. “It means that her people do all the work, but we’re standing behind them as a confidence builder, and that sort of thing.”A confidence builder? That sort of thing? He couldn’t hide the dubiousness of their charge even as he tried to sell it. “A moral and ethical mission” was how he described it to the journalists who accompanied him. If that were so, Pancho Villa wouldn’t have had to ride in.Mattis didn’t lurch anywhere near as far into fiction as others in the administration routinely do. But the spectacle was somehow sadder for its subtlety, which underscored the bind that even the most cautious and conscientious administration official is in, the impossibility of finding some honorable balance of principle and obeisance, prudence and deference.It’s not true, as the Republican strategist Rick Wilson wrote, that everything Trump touches dies. But everything wilts, at least if it’s in his employ long enough. That’s why Nikki Haley announced that she’d leave her post as ambassador to the United Nations around the two-year mark. Miraculously, she has managed to fill a big hole in her résumé without putting a big dent in her reputation, and she knows that the longer she stays, the more she tempts fate.Mattis just proved her right.I invite you to sign up for my free weekly email newsletter. You can follow me on Twitter (@FrankBruni). Frank Bruni has been with The Times since 1995 and held a variety of jobs — including White House reporter, Rome bureau chief and chief restaurant critic — before becoming a columnist in 2011. He is the author of three best-selling books.   @FrankBruni • Facebook Advertisement"}