{"id": "Dorcas Reilly, Creator of the Classic American Green-Bean Casserole, Dies at 92", "paragraph": "Supported byBy Karen ZraickIt takes just minutes to whip up, and contains a mere six ingredients. But more than six decades after Dorcas B. Reilly invented the classic American dish of green-bean casserole when she worked in the Campbell Soup Company test kitchen, it remains a staple at Thanksgiving Day dinners across the country.Mrs. Reilly, who died on Oct. 15 at a hospital in Camden, was among the first full-time employees of the Campbell’s home economics department, where she helped to create recipes printed on the labels of its products. Her husband, Thomas H. Reilly, confirmed her death. She was 92.“We worked in the kitchen with things that were most likely to be in most homes,” Mrs. Reilly once said. “It’s so easy. And it’s not an expensive thing to make, too.”Her recipe calls for mixing a can of cream of mushroom soup, cooked green beans, a bit of milk, soy sauce and pepper. Pop it in the oven, toss some crunchy fried onions on top, and voilà.The dish epitomizes the easy recipes that became popular in the 1950s, when companies promoted them to increase demand for their products.“It was convenience with a touch of glamour,” said Laura Shapiro, a culinary historian and author of “Something From the Oven,” a book about American cuisine in the 1950s.She added that the French’s crispy fried onions that the recipe called for were the “touch of genius” in the dish.Mrs. Reilly was a supervisor in 1955 when she first put together the recipe, originally called the “Green Bean Bake,” for an article by The Associated Press. It was among hundreds she had created, including a tuna-noodle casserole and Sloppy Joe “souperburgers.”But none became quite as famous as the Green Bean Bake. The company says that more than 20 million American homes will serve the dish this Thanksgiving.“She took a lot of pride in it,” Mr. Reilly said. “She was delighted when anybody said they liked it, and most everybody liked it.”In interviews over the years, Mrs. Reilly noted that the casserole’s appeal was in its simplicity. It employed the popular Midwestern technique of using a creamy soup to bind a casserole, but mixed in some new ingredients. It took off when Campbell’s began printing the recipe on its cans of cream of mushroom soup.Dorcas Lillian Bates was born on July 22, 1926, in Woodbury, N.J. Her mother, Dorcas Lillian Webb, was a homemaker, and her father, Frederick Bates, was an electrician at the Drexel Institute of Technology, now known as Drexel University.She and her brother, Linwood Tomlinson Bates, grew up in Glassboro, N.J., and Camden. She attended Camden High School, along with Thomas H. Reilly, whom she would marry in 1959.In a phone interview, Mr. Reilly said Wednesday that he fell in love with her in the fall of 1940, “but it took awhile” to get together. He served in World War II and the Korean War after high school, while she studied home economics at Drexel. After graduation, she went to work at the Campbell’s test kitchen in Camden.Mr. Reilly said his wife had grown up in a family of cooks, which spurred her love of food. Even after spending all day in a test kitchen, she would cook at home as well, experimenting and using fresh ingredients. She did make a lot of soup, Mr. Reilly said.The couple settled in Haddonfield, N.J., where Mr. Reilly got a job as a high school English teacher. The couple had one son, Thomas B. Reilly, and a daughter, Dorcas Tarbell.In addition to her husband and children, Mrs. Reilly is also survived by four grandchildren and one great-granddaughter.Mrs. Reilly left Campbell’s in 1961 to raise her children, but returned years later as a manager, a position she held until she retired in 1988.In 2002, Campbell’s donated the original recipe card for the green-bean casserole, written by Mrs. Reilly, to the National Inventors Hall of Fame.These days, fresh ingredients and complicated recipes are all the rage, and the creamy casseroles of the 1950s are decidedly out of fashion, and sometimes derided. But because it became so ubiquitous at holidays, the green-bean casserole endures, evoking powerful nostalgia for many Americans.“If you have the love and memory of this, you will never think it’s gross,” Ms. Shapiro said. “You will think of it as the food of your past and you will cherish it.”Advertisement"}