{"id": "These Americans Are Done With Politics", "paragraph": "Supported bynews analysisThe Exhausted Majority needs a break. By Sabrina TaverniseMs. Tavernise is a national correspondent for The Times.As the country catches its breath after one of the most acrimonious midterm elections in years, it would be easy to conclude that all of America is hopelessly divided — a land where two angry tribes are at each other’s throats and everybody thinks about politics all the time.But the reality is far less extreme.A deep new study of the American electorate, “Hidden Tribes,” concludes that two out of three Americans are far more practical than that narrative suggests. Most do not see their lives through a political lens, and when they have political views the views are far less rigid than those of the highly politically engaged, ideologically orthodox tribes.The study, an effort to understand the forces that drive political polarization, surveyed a representative group of 8,000 Americans. The nonpartisan organization that did it, More in Common, paints a picture of a society that is far more disengaged — and despairing over divisions — than it is divided. At its heart is a vast and often overlooked political middle that feels forgotten in the vitriol, as if the country has gone on without it. It calls that group the Exhausted Majority, a group that represented two-thirds of the survey.“It feels very lonely out here,” said Jamie McDaniel, a 36-year-old home health care worker in Topeka, Kan., one of several people in the study who was interviewed for this article. “Everybody is so right or left, and you’re just kind of standing there in the middle saying, “What happened?’”For Ms. McDaniel, who works full time and is raising a young daughter, politics is not a hobby but an obligation to be endured — more dental appointment than ballgame. She does not know her friends’ political persuasions, nor they hers, because it is not part of how they see themselves. Ms. McDaniel voted on Nov. 6, mostly for Democrats, in a church. But in an interview three days later, she said she had not checked to see who won.“I prefer to be in the dark because of all of the hostility going on,” she said.The study found that nearly half of the Exhausted Majority say they have not been politically active in the past year, compared with just 1 percent of the Progressive Activists and Devoted Conservatives, the two least flexible and most ideological of the seven political tribes identified in the study. Forty-one percent said they did not vote in 2016.The ugliness of politics has turned some people off.“I’m so upset, I feel physically ill,” Marsha Newman, 66, a school counselor in Chapmanville, W.Va., said on a rainy Election Day morning. “Just the ugliness of it all. It’s so heartbreaking that all we can do is bring each other down and cut into each other. I feel like I’m going to cry.”The highly politically engaged tribes may have seized on the midterm elections as a victory, but for the Exhausted Majority it merely perpetuated a hopeless stalemate.“It’s like World War I, where you’re pushing each other back and forth over the same quarter-mile of ground and nothing happens,” said Christopher Kershaw, 39, a logistics manager in rural New Jersey. The study found that members of the Exhausted Majority are more likely than those on the far ends of the political spectrum to be women, less likely to have a college or graduate degree, less likely to be white and more likely to be young. It concluded that four in five Americans believe that the country has a problem with “political correctness,” which many said made them feel bad but also bewildered — a set of rules they had not learned to decode.It also found that many in the Exhausted Majority tend to see both sides.“My husband would tell you I’m a devil’s advocate,” said Mary Linda Vetter, 71, a retired teaching assistant in Woodhull, N.Y. “I’m always looking at the other side of the coin.”During the 2016 campaign, Ms. Vetter’s husband would watch the conservative pundit Glenn Beck and then accuse her of not caring because she had little interest. In fact, she cares a lot. Her whole life, she has voted and volunteered — at her church and at a local nursing home, visiting residents who did not have families. But she is uncomfortable with the culture of outrage and ideological conformity.“I guess I would have to say that I’m completely confused as to who is lying and who is telling the truth,” Ms. Vetter said. “I just feel helpless.”Partisanship may be at a modern high, but that doesn’t mean people are happy with their political choices. The study shows that most Americans have political tastes that are not uniform: They may lean toward one party, but they see things they like in both. Its findings suggest a deep hunger for political leaders who are practical and not tribal — who do not cast the world in starkly moral terms, but in bread-and-butter policy terms.The approval of several ballot initiatives long supported by Democrats but opposed by Republicans in Republican or Republican-leaning states last week might have signaled the power of the Exhausted Majority to break partisan gridlock. Those included a measure in Florida that re-enfranchised former felons; measures in Idaho, Nebraska and Utah that expanded Medicaid; and minimum-wage measures in Arkansas and Missouri.Yascha Mounk, a political scientist at Harvard University, said the influence of the Exhausted Majority might play out in 2020 in another way: Fatigue with the noise of politics is so deep, he said, that it might strengthen the chances of candidates offering to be less nakedly partisan.“For the last two years it’s been impossible to go to a bar on a Monday night and not have to talk about politics,” he said. “Most Americans are sick of that. I think you can win in 2020 by promising that if you become president, people can go back to talking about football.”The study describes a Democratic base that looks far less like the progressive left and more like the American mainstream. Elizabeth Damon, 54, a veterinarian in Eagle Point, Ore., is a registered Democrat because “I really don’t think anybody should be able to tell me what to do with my own body.” But she also thinks the party has drifted too far left, and in 2016 she voted for Donald Trump.“More than anything, they just want to pick fights,” Dr. Damon said of Democrats. The Senate confirmation of Brett Kavanaugh was one example, she said. William Baltimore, 55, a mail clerk in a bank in Overland Park, Kan., who usually votes Democrat, said Mr. Trump repels him.But on immigration, Mr. Baltimore prefers Mr. Trump. The Democrats “are just willing to accept anything, anybody and anyone, and that doesn’t fly good with me,” he said.Bruce Bell, 32, of Whitmore Lake, Mich., voted Democratic his whole life, including twice for Barack Obama, but has drifted from the party, tired of what he said was progressive contempt.“The progressives, they just shut you down,” said Mr. Bell, who works on electrical systems of semitrucks. “You are a complete idiot, you don’t know what you’re talking about. You don’t have a college degree to even have an opinion on the matter.”Mr. Bell, who voted third-party in 2016, badly wants compromise, but he thinks the political system is uniquely unfit to give it. The effect is a souring on democracy itself.“It makes you feel that you are just not represented in government,” he said, adding, “like the actual interests of the people are almost irrelevant.”More than three in four Americans believe that our differences aren’t so great that we can’t work together. Mr. Bell is among them. The anger he sees is mostly on screens — not in his daily life.He still trick-or-treats with his neighbors and their children. They still wave to one another in the morning before work.“People in my life, we can easily disagree on some controversial topic,” Mr. Bell said, “but we are not at each other’s throats, calling each other evil.”Sabrina Tavernise is a national correspondent for The Times.Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram,Advertisement"}