{"id": "In Echo of Flint, Mich., Water Crisis Now Hits Newark", "paragraph": "Supported byBy Liz LeydenNEWARK — For nearly a year and a half, top officials in Newark denied that their water system had a widespread lead problem, despite ample evidence that the city was facing a public health crisis that had echoes of the one in Flint, Mich.Even as the risk persisted in the spring, the officials in Newark, New Jersey’s most populous city, took few precautionary measures, instead declaring on their website, “NEWARK’S WATER IS ABSOLUTELY SAFE TO DRINK.”But this month, facing results from a new study, the officials abruptly changed course, beginning an urgent giveaway of 40,000 water filters across the city of 285,000 people, targeting tens of thousands of residences.The revelation that Newark is facing a potentially widening public health crisis over tap water has angered many residents and raised questions about whether the city’s negligence has placed young children at risk.Officials were finally compelled to act after an engineering study commissioned by the city found that measures to prevent lead from leaching into drinking water were failing at one of Newark’s two treatment plants.State officials are warning that children under 6 in homes with lead pipes served by the plant should not drink unfiltered tap water.Concerns over lead in tap water have been heightened since the crisis in Flint, where dangerous levels of lead in improperly treated water led to criminal indictments against local and state officials and left residents relying on free bottled water. Like Flint, Newark has a large black population and a high poverty rate.“The parallels to Flint are fairly clear: The city was denying a problem even though its own data was showing problems,” said Erik Olson, a top official at the Natural Resources Defense Council, which filed a lawsuit against Newark in the summer, accusing it of violating federal safe drinking water laws. “Newark is not as extreme as Flint but still a serious problem.”But Newark’s mayor, Ras Baraka, has defended the city’s response even as the issue of lead in the water has attracted intense local media attention. “When you make a statement that the drinking water is not safe, it is yelling fire in a crowded room,” he told reporters at a recent news conference. “In fact, Newark has some of the best drinking water. The problem is that our infrastructure is not safe.”Some residents are frustrated at how long it took the city to admit the problem. “I applaud the city for now, finally, acknowledging the issue, but they first denied it,” said Bishop Jethro C. James Jr., the senior pastor at Paradise Baptist Church. “The denial was an insult to the citizenry.”Candice Grant, 25, an administrative assistant, did not even know there was a lead issue until she got an alert on her cellphone about the filter giveaway.“Whoa, there’s lead in the water?” Ms. Grant remembered thinking.Her mind flashed to her 7-month-old son, and she immediately called her husband. “I said, ‘Get more bottled water because we’re not giving the baby any more from the house.’”No amount of lead exposure is known to be safe for children, whose mental and physical development can be impaired, according to the Centers for Disease Control and Prevention. In adults, lead can increase risks of high blood pressure and kidney disease; it can cause complications, including miscarriage, for pregnant women.In Newark, about a quarter of the more than 14,000 children under 6 who were tested in 2016 had measurable levels of lead in their blood, according to an analysis by Advocates for Children of New Jersey of the most recent publicly available state data.“This suggests a pervasive problem throughout the city coming from a variety of sources, and water could easily be one of them,” said Peter Chen, policy counsel at A.C.N.J.In 2016, months after lead was discovered in the city’s schools and with the water crisis in Flint in the spotlight, the state announced that large water systems, including Newark’s, would have to test drinking water for lead every six months.For Newark, the results were poor. In 2017, more than 22 percent of the samples from its water system tested during the first half of the year exceeded 15 parts per billion of lead, the federal threshold requiring action. Elevated levels have remained in the system for each of the ensuing six-month monitoring periods.This summer, the tap water at one house tested at 250 parts per billion.The city relies on two reservoirs for its water, but only one of its two treatment plants was found to have problems with its treatment methods.When the state first alerted Newark about its high lead levels, city officials said the cause was about 15,000 lead service lines — pipes that connect the city’s water main to plumbing systems in houses and buildings.The city said it was helping residents replace such lines, a process that could take as long as eight years.Even after the city announced the filter giveaway, some officials continued to play down the problem.“The city’s water coming out of the reservoir is safe,” said Kareem Adeem, the assistant director of Newark’s Department of Water and Sewer Utilities. “The city’s water leaving the treatment plant is safe; the city’s water entering the city’s distribution system, the city’s water main, is safe. The only problem is when the city’s water enters into those lead lines.”But the Natural Resources Defense Council argued that Newark failed to properly treat its water with chemical additives that prevent lead from leaching into the water once it enters the pipes. The city said it would now change how it treats water at the plant where the problem was identified.“If we don’t have corrosion control measures that effectively reduce the amount of lead that’s going into people’s water before we change their lead service lines, we need to act,” Mr. Baraka told reporters.Even as the city is mobilizing, community leaders and residents remain skeptical about its performance. Once the city’s water exceeded the federal limit for lead, officials were required to notify the public. While the city mailed letters and held a town-hall-style event on Facebook, officials kept minimizing the problem.A robocall in April promoting the city’s pipe replacement program claimed that the water was “safe” and that the issue was “confined to a limited number of homes.”“The robocall incensed me,” said Yvette Jordan, a Newark teacher and a member of the Newark Education Workers Caucus, which joined the Natural Resources Defense Council in suing the city. “The gist of it was that everything was fine.”Ms. Jordan said she waited weeks for the Water Department to test the water at her home, which was found to have lead levels of 42.2 parts per billion — nearly three times the federal action threshold.Residents are left making the best of the situation. Before the city took action, the Natural Resources Defense Council donated filters to community groups for distribution. Rashell Walker took advantage of a giveaway at Paradise Baptist Church after hearing about it from a neighbor in her building.Her apartment has mold, and recently, she said, the water has smelled funky, too. So, she stopped letting her three young children drink it.She did not know if her building’s water has lead, but planned to install the filter anyway.“We already have mold, we don’t need lead,” she said. “I’m afraid we’re getting sick. Nobody seems to care about us out here.”Ms. Grant had used only bottled water for her son’s formula until his most recent checkup, when the doctor said he needed fluoride, which is often added to tap water.So, she started mixing a small amount with the formula.She said that she never received any notification by mail or phone about lead levels in the water, and that it was never mentioned during visits to a health clinic over the past year. After the city announced the filter giveaway, she picked one up.As she kissed the top of her son’s head, Ms. Grant expressed relief that she had not used the tap for long before learning her water might have lead.“Luckily, it was only three weeks,” she said.Advertisement"}