{"id": "Horacio Cardo, Illustrator With a Political Edge, Is Dead at 74", "paragraph": "Supported byBy Richard SandomirHoracio Cardo, an Argentine artist whose phantasmagorical paintings and collages were known for their compelling commentary about politics, war, social issues and Freudian psychoanalysis, died on Oct. 22 in Pinamar, a resort city on the eastern coast of Buenos Aires Province. He was 74.His son, Iara, said the cause was complications of a stroke.Mr. Cardo’s evocative work appeared in many publications, including Clarín, Argentina’s largest newspaper, and The New York Times, where he and artists like Ralph Steadman, Eugene Mihaesco and Brad Holland turned the Op-Ed page into a showcase for idiosyncratic graphic viewpoints in the 1970s and ’80s.“He was one of the illustrators who drew people to the Op-Ed page with unusually strong commentary,” Steven Heller, co-chairman of the design department at the School of Visual Arts in Manhattan and a former senior art director of The New York Times Book Review, said in an interview. “He took the complex, made it personal and turned it into something universal.”Mr. Cardo’s illustration of a hammer crushing rocks inside a political prisoner’s head accompanied A. M. Rosenthal’s column about a Soviet prison camp in the Ural Mountains. His ratty-looking “Trojan pig” illustrated a piece about the “demanding, ceaseless and pivotal” toll of campaign fund-raising written by John Frederick Martin, who managed Senator Al Gore’s bid for the 1988 Democratic presidential nomination.Not everything he created fot The Times was used. In 1988, he was asked to illustrate an Op-Ed article about how few Medals of Honor had been awarded to black soldiers who fought heroically in the Korean War. He produced a bracing black-and-white sketch of a Ku Klux Klansman pointing outward, mimicking Uncle Sam’s pose in the “I Want You” recruiting poster from World War I, as a reflection of racist attitudes in the armed forces.That illustration was turned down, said Jerelle Kraus, a former Times Op-Ed page art director who was married to Mr. Cardo from 1990 to 1998.Mr. Cardo balanced his black-and-white illustrations for The Times with more elaborate and more colorful ones that appeared elsewhere.To depict the toll of air pollution for Institutional Investor magazine, he painted the Earth in faded green and blue hues, wrapped in a gas mask. As a tribute to the Argentine citizens who had been “disappeared” by the country’s military dictatorship in the 1970s and ’80s, he painted a poster of a malevolent-looking Army figure with a chest full of colorful decorative ribbons upon which tiny skulls dangled.For Time magazine, he created a Statue of Liberty whose crown was arrayed with warheads.And recently, for Clarín, he dressed President Trump in a sombrero through which a raging fire can be seen.“In Cardo’s work, nothing is naïve,” Mercedes Perez Bergliaffa, an art critic for Clarín, wrote in 2009 when an exhibition of Mr. Cardo’s work was shown at Teatro Argentino de La Plata in Buenos Aires. She added that he “makes up works with shrewd insight and synthesis, forming a junction area, both at a conceptual and formal level.”Some of Mr. Cardo’s earlier works were painted in oils, to which he added fabric, lace and plaster of Paris to create various textures. Later on, he created dramatic illustrations with ink and acrylic paint that he altered with digital tools like Photoshop.“Photoshop has allowed me to get closer to what I consider reality: the permanent transit (mutation, imbrication) of the images within the psyche,” he said in an interview with Artefacto magazine in 2010. “I would like to capture that permanently changing reality in my work, where past and present are interconnected.”Horacio Fidel Cardo was born on May 20, 1944, in Temperley, in the province of Buenos Aires. His father, Juan, was a railroad executive, and his mother, Blanca Esther (Badde) de Cardo, was a homemaker. When he was 7, he asked his parents if he could study painting.“Some years later, I began to make newspapers for my schoolmates,” he said in an interview on his website. “I used to create the headlines out of bottle cork cuttings (which I also used as stamps), I used to type the text with my father’s typewriter, and I drew the images.”He never went to college, but at 21 he was hired by the book publisher Compañia General Fabril Editora, where one of his first assignments was to illustrate a new edition of the book “El Compadrito,” by the Argentine writers Jorge Luis Borges and Silvina Bullrich.A memorial to those who lost their lives in 2018He later worked as a humorist for a newspaper, the art director for a direct sales company, and a freelance artist, before being hired in 1979 by Clarín, which served as his base for decades.In addition to his son, he is survived by his daughters, Nuria, Ivana, Samanta and Sabrina Cardo; two grandchildren; and his sister, Edith Dodds. His marriage to Silvia Arenales, like his marriage to Ms. Kraus, ended in divorce.Mr. Cardo was also a serious chess player who wrote books on the game’s strategy under a pseudonym and wrote and illustrated, under his own name, “The Story of Chess” (1998), a fairy tale for children that The Orlando Sentinel called “an original way of introducing a provocative game to young readers.”And his distaste for Sigmund Freud, whom he described as greedy and dangerous, led him to create a series of critical and sometimes grotesque paintings and illustrations, one of which shows Freud as a switch preparing to send electroshock to the helmeted heads of four faceless patients. His anti-Freud work was exhibited at the Recoleta Cultural Center in Buenos Aires in 2009 and adapted into a companion book, “Sigmund Fraud and Psychoanalysis.”“I am psychoanalyzing Freud and psychoanalysis,” Mr. Cardo said in “Psychomigrations,” a film by Tzachi Schiff about the exhibition. “If he could psychoanalyze the world and art, art could psychoanalyze him and his theories with equal authority.”Advertisement"}