{"id": "City Commissioner in Florida Is Charged With Murder as ‘Stand Your Ground’ Defense Is Rejected", "paragraph": "Supported byBy Julia JacobsA city commissioner in Florida was charged on Friday with second-degree murder after fatally shooting a man he suspected of stealing a hatchet from his shop.The grand jury indictment came about two weeks after the commissioner, Michael Dunn, 47, of Lakeland, Fla., confronted a man and then shot him with a handgun as the man was leaving the store. The man, Christobal Lopez, 50, died at the scene.Brian Haas, the state attorney for the 10th Judicial Circuit, said in a statement that Mr. Dunn’s actions fell outside the protection of Florida’s Stand Your Ground law, which can make it challenging to prosecute people who maintain they killed someone in self-defense.Mr. Dunn is a co-owner of an Army-Navy surplus store, which carries a selection of firearms, military surplus and public safety supplies. He began serving a four-year term as an elected city commissioner in January in Lakeland, which is about 35 miles east of Tampa, Fla.John Tupps, a spokesman for Gov. Rick Scott, said the office would move to suspend Mr. Dunn from his position after it receives charging documents from officials.On Oct. 3, at about 2:30 p.m., Mr. Dunn said he saw Mr. Lopez, who entered the shop with his father, try to steal a hatchet, the Lakeland Police Department said.Video surveillance showed Mr. Lopez removing the hatchet from the display rack and hiding it in the front of his pants, according to a police affidavit. Mr. Dunn observed Mr. Lopez from his store office, then exited with his gun concealed in his waistband.When Mr. Dunn confronted Mr. Lopez about the hatchet, it fell down Mr. Lopez’s pant leg and onto the floor, according to the affidavit. Mr. Dunn told the police that Mr. Lopez then said, “I will pay, I will pay,” while walking over to the counter. Mr. Lopez then tried to flee the shop with the hatchet in his hand, the affidavit said.Video footage showed Mr. Dunn grabbing the sleeve of Mr. Lopez’s shirt as he tried to exit. The police said Mr. Dunn shot Mr. Lopez twice as he tried to pull away. Mr. Dunn kept the handgun pointed at Mr. Lopez for several seconds as he was on the ground.“At no time did the victim appear to have made any threatening movements toward the subject,” the affidavit said.When the police arrived at the store, they said Mr. Dunn was pointing the gun at Mr. Lopez and said, “I think he expired!”Mr. Lopez and his father were both homeless and had been living in Wauchula, Fla., the affidavit said. Both father and son had recently found places to live in Lakeland through a Christian organization that helps poor people.According to the indictment, Mr. Dunn shot and killed Mr. Lopez but did so without “premeditated design” to murder him, indicating the reason for the second-degree charge, which carries a maximum penalty of life in prison.Mr. Dunn’s lawyer, James Franklin, declined to comment on Saturday.Mr. Haas, the state attorney, said on Friday that Mr. Dunn was being held in county jail.According to Mr. Dunn’s biography as a city commissioner, he graduated from the Lakeland Citizens Police Academy, which includes practice shooting at a firing range. When Mr. Dunn was 19, he accidentally shot another man while practicing his aim with a pistol inside his home. The man survived.The Lakeland Ledger, a local newspaper, reported that Mr. Dunn said at the time he thought the gun was unloaded. The police called that shooting accidental and cleared him of any wrongdoing.Advertisement"}