{"id": "The Psychology of Political Polarization", "paragraph": "Supported byOur country is divided, but science suggests the rift is less severe than it seems.By Daniel YudkinDr. Yudkin is a psychologist.Many stories can be told about the 2018 midterm elections, but their mixed results make one thing clear: We are a country divided. Pundits have attributed our historically high levels of polarization to a variety of sources, including the isolating effects of social media, the corrupting influence of dark money and special interests, and news outlets that give more time to outraged rants than to reasoned debate.But while each of these factors undoubtedly plays a role, a new report produced by me and my colleagues at More in Common, a nonprofit research organization devoted to bridging political divides, suggests there is more to the story. In the past few weeks, publications have highlighted findings from our study like the presence of an “exhausted majority” (the roughly two-thirds of Americans who do not identify with either political extreme) and the fact that both political extremes are less diverse and more affluent than the middle is.Just as important, however, is that our report identifies a powerful explanation for political polarization. It shows how discrepancies in people’s “core beliefs” (their moral values, parenting philosophy, feelings about personal responsibility and so on) explain differences in their political views. We recruited a representative sample of 8,000 Americans and, through interviews and online surveys, asked them about both their core beliefs and their opinions on policy issues like gun control, abortion and immigration. We then identified groups of people with similar core beliefs and examined how these beliefs correlated with their political views.Our analysis revealed seven groups in the American population, which we categorized as progressive activists, traditional liberals, passive liberals, politically disengaged, moderates, traditional conservatives and devoted conservatives. (Curious which group you belong to? Take our quiz to find out.) We found stark differences in attitudes across groups: For example, only 1 percent of progressive activists, but 97 percent of devoted conservatives, approve of Donald Trump’s performance as president.Furthermore, our results discovered a connection between core beliefs and political views. Consider the core belief of how safe or threatening you feel the world to be. Forty-seven percent of devoted conservatives strongly believed that the world was becoming an increasingly dangerous place. By contrast, only 19 percent of progressive activists held this view.In turn, those who viewed the world as a dangerous place were three times more likely to strongly support the building of a border wall between the United States and Mexico, and twice as likely to view Islam as a national threat. By contrast, those who did not see the world as dangerous were 50 percent more likely to believe that people were too worried about terrorism and 50 percent more likely to believe that immigration was good for America.Another significant finding concerned people’s views on personal responsibility. It may come as no surprise that 86 percent of progressive activists believed that “people’s outcomes in life are determined largely by forces outside of their control,” whereas 98 percent of devoted conservatives believed “people are largely responsible for their own outcomes in life.” But what is notable is that those who believe the former were twice as likely to favor increasing the government safety net, 25 percent more likely to believe that America had a moral obligation to accept refugees and about 35 percent more likely to believe that gender-based differences in pay were a result of sexism.A third core belief dividing liberals and conservatives was parenting philosophy. We asked participants a series of questions on this topic, including whether they believed it was better for children to have “curiosity” versus “good manners” and “independence” versus “respect for elders.” Once again, striking differences emerged: While 75 percent of devoted conservatives leaned toward the more strict values, 77 percent of progressive activists leaned toward the more permissive.Responses on this issue were also strongly correlated with political views. For example, Americans who fully endorsed strict values were six times as likely to oppose gay marriage, twice as likely to believe that men and women have different roles in society and more than three times as likely to believe that a person’s sex is fixed at birth.Overall, these data offer a new perspective on a claim long made by social scientists: that differences in political belief are manifestations of deeply opposing visions — not just about what makes good policy, but also about what makes a good person.Conservatives tend to see the world as a hostile place where personal success is realized through disciplined adherence to a strict set of ethical rules. In their view, humility is achieved by submitting one’s preferences to the established wisdom of authority and tradition.In contrast, liberals tend to view the world as a place where success is achieved by casting off the strictures of society and allowing individuals to achieve their true potential through self-expression. They believe that humility is achieved by acknowledging the degree to which success in life is a result of circumstances beyond one’s control.These differing notions of virtue shape the way people think and talk about social issues. Conservatives may frame political topics in the language of respect and discipline, while liberals may frame such topics in the language of values like compassion and equality.This, in turn, may lead people to misunderstand others’ motives, making political rifts appear deeper than they really are. Conservatives look at liberals’ emphasis on self-expression and see weakness and self-indulgence. Liberals look at conservatives’ emphasis on personal responsibility and see chauvinism and victim-blaming.This distortion renders thoughtful dialogue difficult at a time when it is most necessary. Americans are far more aligned on many critical issues than you might think. For example, our data show that 75 percent of Americans support stricter gun laws, 82 percent believe that racism is at least a somewhat serious problem in America and 79 percent favor providing a pathway to citizenship for illegal immigrants brought here as children. In addition, 77 percent of Americans agree that our differences are not so great that we cannot come together.While core beliefs lead people to have different political opinions, they also obscure areas of agreement because they lead people to couch their arguments in different moral languages. Understanding how these beliefs shape our political views can improve our chances of achieving our shared goals.Daniel Yudkin (@dyudkin) is an associate director of research at the nonprofit organization More in Common and a postdoctoral researcher in psychology at Yale.Advertisement"}