{"id": "California Wildfires, Elections, Nafta: Your Monday Evening Briefing", "paragraph": "Supported byBy Jean Rutter and Hiroko Masuike(Want to get this briefing by email? Here’s the sign-up.)Good evening. Here’s the latest.1. Powerful wildfires raged in Northern and Southern California, pushed by strong winds.The inferno that ravaged the wooded town of Paradise in northern California became the deadliest wildfire in the state’s modern history on Monday when officials said they had discovered the remains of 13 more people, bringing the death toll to 42.The Butte County sheriff, Kory L. Honea, has said more than 200 people remain missing in and around the town, which sits in the foothills of the Sierra Nevada and was popular with retirees.The Woolsey Fire, west of Los Angeles, has killed two and charred 90,000 acres around Malibu and Thousand Oaks.Forecasters predicted continuing winds, no rain and low humidity, which could worsen conditions. Our reporters are chronicling the fire and talking with victims, some of whom barely escaped with their lives._____2. Voting may get easier in states across the U.S., thanks to ballot measures passed on Election Day.Florida restored the voting rights of 1.4 million people with felony convictions. Maryland will allow voter registration up to Election Day. Michigan, Colorado and Missouri limited politicians’ ability to directly draw — and gerrymander — district lines. Utah, where votes are still being counted, appears poised to do the same.Some states also put new restrictions on voting, with North Carolina and Arkansas approving voter ID rules. Nationwide, the moves are part of a battle between Democrats, who tend to gain with a larger electorate, and Republicans, whose policies often push in the opposite direction.Separately, a judge overseeing the contentious recounts in three close Florida elections told lawyers for both sides to “ramp down the rhetoric.”Recounts began over the weekend in the state’s races for Senate, governor and agriculture commissioner. Republicans had suggested, without offering proof, that their candidates’ slim leads were shrinking because elections supervisors were miscounting ballots. Above, the recount in Miami._____3. President Trump’s plans to reshape the Nafta trade agreement with Mexico and Canada could be upended, now that Democrats are taking control of the House.The Democrats are promising to extract greater protections for American workers. One particular concern: a requirement that at least 30 percent of the labor used to build each car in Mexico be completed by workers earning at least $16 an hour. The agreement also has provisions that would affect dairy farmers. Above, an expo in Madison, Wis.The incoming Democrats are the most diverse, most female freshman class in history — and include the first Muslim women and Native American women elected to Congress. More than 50 of them arrive in Washington for an orientation this week._____4. Shortly after Jamal Khashoggi was killed last month at the Saudi Consulate in Istanbul, a member of the kill team instructed a superior over the phone to “tell your boss” — believed to be Crown Prince Mohammed bin Salman — that the operatives had carried out their mission, our reporters learned.The conversation was included in a recording of Mr. Khashoggi’s killing that was collected by Turkish intelligence. It is some of the strongest evidence linking Prince Mohammed to Mr. Khashoggi’s killing.“A phone call like that is about as close to a smoking gun as you are going to get,” said a former C.I.A. officer. Above, a memorial service in Istanbul.The kingdom has denied that Prince Mohammed, its de facto ruler and a close ally of President Trump, ordered the attack. But the new evidence is certain to intensify pressure on the White House over that relationship._____5. It was Afghanistan’s “safe” district.Rural Jaghori was famous for being an oasis in a war-torn country: People couldn’t remember the last murder or robbery, and schooling was nearly universal for boys and girls.Then last week, the Taliban attacked the district from three sides. The Afghan government sent in its Special Forces to combat the threat.When a small team of our journalists made the trek to the isolated area, they expected to find residents defiant against the insurgents.Instead, they found an overwhelmed government force, the bodies of U.S.-trained commandos lined up outside the governor’s office, above, and a situation so perilous that they had to flee by the end of the day._____6. Michelle Obama’s highly anticipated memoir, “Becoming,” hits bookstores Tuesday.The former first lady sheds light on what it was like to live through national tragedies in the White House. During the Sandy Hook massacre in Newtown, Conn., President Obama summoned her to his side for comfort — something he seldom did during work hours.And she is clear about her feelings toward the current administration, calling President Trump a “misogynist” and a “bully.”“I’ve lain awake at night, fuming over what’s come to pass,” she writes. “It’s been distressing to see how the behavior and the political agenda of the current president have caused many Americans to doubt themselves and to doubt and fear one another.”Our reviewer called it “a polished pearl of a memoir.”_____7. School buses that sing may be stopping at your corner soon.New battery-powered buses run so quietly that they have to play a four-tone melody for safety.Electric buses, which cost three times as much as diesel buses, are still rare. But they are less expensive to fuel and maintain, and they’re catching on in districts across the U.S. where officials are concerned about the carbon emissions that drive global warming.There are worries about running out of power on longer routes. But that concern could dissipate as charging stations become more common._____8. What happened to U.S. prescription drug prices?Two decades ago, the costs began rising well beyond that of other nations, and in recent years they’ve shot up again.Spending was about $1,000 per person in 2015, far ahead of other wealthy countries. Switzerland, second to the U.S., was at $783. Sweden was lowest, at $351, one study showed.What can explain it? A medical expert weighs the theories and evidence, and tries to get a glimpse of the future — when the rise of precision medicines could push costs even higher._____9. Stan Lee, a creator of Spider-Man, the X-Men, the Fantastic Four, Iron Man, the Hulk, Thor and many other superheroes, has died. He was 95.Mr. Lee, above, the chief writer and editor for Marvel Comics, revolutionized the comic book world by humanizing its characters, giving them flaws and insecurities shared by mere mortals. Above, at Marvel in 1980.In the 1980s, he moved to Los Angeles to bring his superheroes to the big screen and ended up often making cameo appearances in the Hollywood spinoffs._____10. Finally, the Rockefeller Center Christmas tree is getting a new topper.Daniel Libeskind, the architect for the reconstruction of the World Trade Center, has designed a 900-pound, 3-D star composed of 70 lighted spikes and encrusted with three million Swarovski crystals.We’ve also collected highlights of Rockefeller Center trees of the past from our photo archives.Mr. Libeskind said he hoped the new star would convey a sense of the city “radiating its light in all directions.” The tree will be lighted on Nov. 28 and on view through Jan. 7.Have a brilliant evening.Your Evening Briefing is posted at 6 p.m. Eastern.And don’t miss Your Morning Briefing. Sign up here to get it by email in the Australian, Asian, European or American morning.Want to catch up on past briefings? You can browse them here.What did you like? What do you want to see here? Let us know at briefing@nytimes.com.Advertisement"}