{"id": "At N.F.L. Trade Deadline, Eagles and Texans Pick Up Star Receivers", "paragraph": "Supported byN.F.L. RoundupBy The Associated PressThe Philadelphia Eagles and the Houston Texans used the N.F.L. trade deadline on Tuesday to shore up their wide receiver corps and bolster their playoff hopes.The Eagles, the defending Super Bowl champions, acquired Golden Tate from the Detroit Lions for a 2019 third-round draft pick, and the Texans got Demaryius Thomas from the Denver Broncos for fourth- and seventh-round picks in the 2019 draft. The Broncos will also send a 2019 seventh-rounder to Houston.Tate, 30, has 44 catches for 517 yards and three touchdowns this season. He joins Alshon Jeffery, Nelson Agholor and Jordan Matthews, giving quarterback Carson Wentz another target as the Eagles (4-4) try to catch the Washington Redskins in the N.F.C. East.“The message to our players, our coaches and our fans is that our foot is always going to be on the gas,” the Eagles’ personnel boss, Howie Roseman, said.Tate wrote on Twitter: “It’s been real DETROIT! I’ll love ya forever. Philly Philly let’s get it!!” He then posted a gif of the fictional Philly icon Rocky Balboa jumping up and down on the steps of the Art Museum with the caption: “Mood.”He averaged 93 catches, 1,056 yards receiving and five touchdowns the past four seasons in Detroit. He went to the Pro Bowl after the 2014 season. Tate spent his first four seasons with Seattle, helping the Seahawks win the Super Bowl his last season.Thomas, 30, a ninth-year veteran who was first or second on most of Denver’s receiving records, has 36 catches for 402 yards this season. He was in his last year of his deal with the team. Despite averaging a career-low 11.2 yards a catch, Thomas’s three touchdowns were tied with Emmanuel Sanders for the team lead and gave him 66 for his career, including the playoffs.“We were not hellbent on trading Demaryius,” John Elway, the Broncos’ general manager, said. He added that he was swayed to make the move by the package of picks and the rise of the rookies Courtland Sutton and DaeSean Hamilton, along with that of the second-year player Tim Patrick, who caught his first career touchdown pass last week.The Texans (5-3), who lead the A.F.C. South, found themselves thin at receiver when they lost Will Fuller for the season to a torn knee ligament last week. They have also had trouble keeping the rookie Keke Coutee (hamstrings) on the field. Houston will play at Denver (3-5) on Sunday.Before the 4 p.m. Eastern trading deadline, two other contenders made trades to firm up their defenses.The Los Angeles Rams (8-0), seeking to improve depth on an already formidable defensive line, acquired Dante Fowler from Jacksonville for a third-round draft pick in 2019 and a fifth-rounder in 2020. Fowler, who has two sacks in seven games as a backup, was the third overall pick in 2015. He has been arrested twice, among other controversies, but insists he has matured and is “a teddy bear off the field but a monster on the field.”The Redskins (5-2) gained more experience in the secondary, acquiring Ha Ha Clinton-Dix from Green Bay for a 2019 fourth-round draft pick. Clinton-Dix, who can become a free agent after this season, joins D. J. Swearinger to give the Redskins two veteran ballhawks at safety. Swearinger leads the N.F.L. with four interceptions; Clinton-Dix is among 14 players tied with three.SEAHAWKS DROP MARSHALL Seattle released wide receiver Brandon Marshall, whose role had diminished significantly.Marshall appeared in all seven games this season and had 11 catches for 136 yards and one touchdown, in the season opener. But he had just two catches for 16 yards in the past four games.The Seahawks were the sixth N.F.L. team for the 34-year-old Marshall, who appeared to have recovered from the major ankle injury and toe surgery that cost him the majority of the 2017 season with the Giants.In other Seahawks news, the N.F.L. announced an eight-game suspension for linebacker Mychal Kendricks, who pleaded guilty to one count of securities fraud and one count of conspiracy to commit securities fraud in an insider-trading scheme. He was indefinitely suspended by the league on Oct. 2, so he can return for Week 14.RODGERS-CROMARTIE RETIRES Oakland Raiders cornerback Dominique Rodgers-Cromartie abruptly retired, two days after not playing a single snap on defense for the second time this season.Rodgers-Cromartie, 32, a two-time Pro Bowl defensive back, made the announcement on social media, not long after notifying team officials of his decision to call it quits. He was signed just before the regular season, after four seasons with the Giants, to add experience to the secondary amid an overhaul.Advertisement"}