{"id": "Facebook Fallout Ruptures Democrats’ Longtime Alliance With Silicon Valley", "paragraph": "Supported byBy Nicholas Confessore and Matthew RosenbergThe alliance between Democrats and Silicon Valley has buckled and bent this year amid revelations that platforms like Facebook and Twitter allowed hateful speech, Russian propaganda and conservative-leaning “fake news” to flourish. But those tensions burst into open warfare this past week after revelations that Facebook executives had withheld evidence of Russian activity on the platform for far longer than previously disclosed, while employing a Republican-linked opposition research firm to discredit critics and the billionaire George Soros, a major Democratic Party patron.Democrats now face a painful reckoning with longtime friends in the tech industry, relationships girded by mutual interest in issues like immigration and cemented with millions of dollars in campaign contributions.The news, reported in a New York Times investigation, elicited fury from Democrats, who demanded a Justice Department investigation into Facebook’s lobbying campaign, as well as new regulations that would cut to the core of Facebook and Google’s data-hungry business models.It reinforced criticism from the left — by Senator Elizabeth Warren of Massachusetts, among others — that Amazon, Facebook and Google are unaccountable monopolies, digital analogues to the railroad trusts of the Gilded Age.And it complicated life for tech’s remaining allies in the party, such as Senator Chuck Schumer of New York, a voracious fund-raiser and a tech booster whose relationship with Facebook goes back almost a decade.“I think 2016 exposed the dark side of technology,” said Representative Ro Khanna, a Bay Area Democrat. Widely considered friendly with the tech industry, Mr. Khanna criticized Facebook on Friday for its aggressive tactics, and said the company should “certainly fire the people who were in any way involved in the decision to peddle opposition research.”The clash intensified on Friday when four Democratic senators wrote to the company’s chief executive, Mark Zuckerberg, asking him to provide more details about Facebook’s lobbying activities. The lawmakers also raised a potentially more explosive issue: whether Facebook had ever used its own data and platform against critics.“We need to know if Facebook, or any entity affiliated with or hired by Facebook, ever used any of the vast financial and data resources available to them to retaliate against their critics, including elected officials who were scrutinizing them,” said Senator Amy Klobuchar of Minnesota, one of the Democrats who wrote the letter.Many Democrats now believe that Facebook, Google and Twitter have been too slow to challenge the abusive speech and disinformation on their platforms. Some argue that the companies have bowed to misplaced Republican criticism about bias — President Trump falsely accused Google in August of playing down his State of the Union — in order to protect their businesses from political pressure.“As more and more information comes out about how these guys operate, it’s becoming conventional wisdom among Democrats that there is a serious policy problem here,” said Matt Stoller, policy director at the Open Markets Institute, who has called for big tech platforms to be broken up and regulated.“These companies are not credible,” Mr. Stoller added. “And it’s becoming clear to Democrats that they aren’t friends — they are the problem.”Facebook cut ties with the opposition research firm this past week even as executives there denied acting improperly.”Our strategy was to shore up the security on Facebook and make major investments there,” said Sheryl Sandberg, Facebook’s chief operating officer, in an interview with CBS on Friday. “It was not what I was doing, nor was it the company’s strategy, to deflect, to deny or to hire P.R. firms to do things.”But Facebook and other tech companies now face increasing criticism from within their own ranks. In an interview, Marc Benioff, the billionaire co-founder of the software company Salesforce and a major donor to Democratic causes, said his industry faced “a tension between trust and growth.”“These companies are going to have to recognize that they have to change,” Mr. Benioff added. “And the C.E.O.s have to change. And if they don’t change, those C.E.O.s will be removed by boards and by shareholders.”No Democrat embodies the tensions between tech and Washington like Mr. Schumer himself. In 2011, he joined Ms. Sandberg to announce the opening of the company’s first East Coast engineering office, in New York City, where he had worked to promote start-ups and other tech businesses.In 2015, Ms. Sandberg co-hosted a fund-raiser for Mr. Schumer in her Bay Area home, according to a Facebook employee briefed on the event. (The same trip featured a Schumer fund-raiser held by Bruce Sewell, then Apple’s general counsel, and attended by Timothy D. Cook, Apple’s chief executive, according to an executive who declined to be named.).By the end of the 2016 cycle, Mr. Schumer had raised more money from Facebook employees than any other Washington lawmaker. All told, Senate Democrats have benefited from over $3 million in political contributions from Facebook’s employees and founders over the years.The technology industry — and Facebook in particular — was also a partner to Democrats in policy battles. Mr. Zuckerberg founded a Washington advocacy group to press for immigration reform, a top priority for Mr. Schumer and other Democratic leaders. More recently, tech companies like Netflix allied with Democrats in the fight over net neutrality rules.Relations began to cool after the 2016 elections, when evidence mounted that Facebook and YouTube had become fertile ground for foreign interference and domestic misinformation, threatening not only the party’s values but also its electoral prospects.Early last year, Senator Jon Tester, the Montana Democrat, walked over to the Capitol to deliver a warning to Mr. Schumer, newly elected as Democratic minority leader.Mr. Tester, the departing chief of the Senate Democrats’ campaign arm, looked at social media companies like Facebook and saw propaganda platforms that could cost his party the 2018 elections, according to two congressional aides. If Russian agents mounted a disinformation campaign like the one that had just helped elect Mr. Trump, he told Mr. Schumer, “we will lose every seat.”Mr. Tester’s warning grabbed the attention of Mr. Schumer and other Democrats, who began to press Facebook and other social media companies to fix the problem.Disinformation was a particular focus for Mr. Schumer, according to an aide with knowledge of the senator’s thinking. In March last year, Mr. Schumer summoned Adam Mosseri, then a vice president overseeing Facebook’s News Feed feature, for a briefing on how the company would limit the spread of bogus news and propaganda. He later sent two aides to Silicon Valley to keep pressure on executives at Facebook, Google and Twitter.But as it became clear that the companies had understated their problems — and were moving slowly to fix them — the senator steered a middle course. When he and Nancy Pelosi, the Democratic House leader, unveiled the party’s “Better Deal” platform for the midterm elections, a proposal to attack “corporate monopolies” focused on airlines, beer companies and eyeglass makers.The proposal, drafted in part by Mr. Schumer’s chief counsel, Rebecca Kelly Slaughter, did not mention companies like Google and Facebook, which together dominate the search and digital advertising markets. (Ms. Slaughter, whom Mr. Schumer helped place on the Federal Trade Commission this spring, is now one of five commissioners investigating whether Facebook violated a 2011 consent agreement over privacy practices.)As recently as March, in an interview with Recode, Mr. Schumer called Facebook “a very positive force” overall and expressed concern that overly strict rules for tech companies would affect economic growth.“I am more sympathetic because I think they’re in very difficult position and I worry about government regulation,” he said.But in the wake of the Cambridge Analytica scandal that month, which showed how Facebook’s weak privacy controls had allowed a Trump-connected firm to collect information about tens of millions of people, some Democrats called for broader scrutiny.Senator Mark Warner of Virginia — a former telecommunications executive generally regarded as pro-business, and a ranking member of the Senate Intelligence Committee — excoriated Mr. Zuckerberg and Facebook this summer for failing to disclose major data-sharing arrangements with handset makers, including a Chinese company flagged by American intelligence agencies. At the time, Facebook and Twitter were also coming under attack by prominent Republicans, who said the companies’ new anti-abuse policies were discriminating against conservatives.Mr. Warner’s growing focus on privacy concerns led to a clash with Mr. Schumer, who confronted Mr. Warner in July, The Times reported this week, warning him to back off Facebook.Justin Goodman, a spokesman for Mr. Schumer, said that the senator “worried that Facebook would bow to pressure from Republicans, who oppose the purging of the fake accounts and bots, and has urged Senator Warner and the Senate Intelligence Committee to make this the priority in their ongoing investigation of the company.”Mr. Warner has continued to press Silicon Valley about privacy. In August, he issued a white paper outlining ways to rein in Big Tech, including passing privacy laws like those enacted in Europe this year, and making social media platforms liable for defamatory content.“It’s important for Facebook to recognize that this isn’t a public relations problem — it’s a fundamental challenge for the platform and their business model,” Mr. Warner said.Facebook previously signaled that it was ready to work with Mr. Warner and others in Congress on new regulation. Yet at the same time, Facebook turned to a conservative opposition research firm that sought to undermine detractors by publicizing financial links to Mr. Soros, a harsh critic of both Facebook and Google.The revelations angered Democrats, who accused Facebook of tapping into anti-Semitic conspiracy theories about Mr. Soros — the very kind of propaganda the company has claimed to be battling. Facebook has denied that the effort was anti-Semitic.“Their mantra has been, ‘We’re different, we’re special, we’re tech, all we do is good,’” said Senator Richard Blumenthal, the Connecticut Democrat and ranking member of the Senate subcommittee that oversees consumer protection and data security. “We’ve come to find out, very graphically, that they do a lot of harm, and in fact they cover up the harm they do.”He added, “Tech is now like every other industry, in my view.”Jack Nicas and Cecilia Kang contributed reporting.Advertisement"}