{"id": "Caetano Veloso: Dark Times Are Coming for My Country", "paragraph": "Supported byIn the late 1960s, the military dictatorship in Brazil arrested and imprisoned many artists and intellectuals for their political beliefs. I was one of them. The militarists are back. By Caetano VelosoMr. Veloso is a composer, singer, writer and political activist.RIO DE JANEIRO — “Brazil is not for beginners,” Antonio Carlos Jobim used to say. Mr. Jobim, who wrote “The Girl From Ipanema,” was one of Brazil’s most important musicians, one whom we can thank for the fact that music lovers everywhere have to think twice before pigeonholing Brazilian pop as “world music.”When I told an American friend about the maestro’s line, he retorted, “No country is.” My American friend had a point. In some ways, perhaps Brazil isn’t so special.Right now, my country is proving it’s a nation among others. Like other countries around the world, Brazil is facing a threat from the far right, a storm of populist conservatism. Our new political phenomenon, Jair Bolsonaro, who is expected to win the presidential election on Sunday, is a former army captain who admires Donald Trump but seems more like Rodrigo Duterte, the Philippines’ strongman. Mr. Bolsonaro champions the unrestricted sale of firearms, proposes a presumption of self-defense if a policeman kills a “suspect” and declares that a dead son is preferable to a gay one.If Mr. Bolsonaro wins the election, Brazilians can expect a wave of fear and hatred. Indeed, we’ve already seen blood. On Oct. 7, a Bolsonaro supporter stabbed my friend Moa do Katendê, a musician and capoeira master, over a political disagreement in the state of Bahia. His death left the city of Salvador in mourning and indignation.Recently, I’ve found myself thinking about the 1980s. I was making records and playing to sold-out crowds, but I knew what needed to change in my country. Back then, we Brazilians were fighting for free elections after some 20 years of military dictatorship. If someone had told me then that some day we would elect to the presidency people like Fernando Henrique Cardoso and then Luiz Inácio Lula da Silva, it would have sounded like wishful thinking. Then it happened. Mr. Cardoso’s election in 1994 and then Mr. da Silva’s in 2002 carried huge symbolic weight. They showed that we were a democracy, and they changed the shape of our society by helping millions escape poverty. Brazilian society gained more self-respect.But despite all the progress and the country’s apparent maturity, Brazil, the fourth-largest democracy in the world, is far from solid. Dark forces, from within and from without, now seem to be forcing us backward and down.Political life here has been in decline for a while — starting with an economic slump, then a series of protests in 2013, the impeachment of president Dilma Rousseff in 2016 and a huge corruption scandal that put many politicians, including Mr. da Silva, in jail. Mr. Cardoso’s and Mr. da Silva’s parties were seriously wounded, and the far right found an opportunity.Many artists, musicians, filmmakers and thinkers saw themselves in an environment where reactionary ideologues, who — through books, websites and news articles — have been denigrating any attempt to overcome inequality by linking socially progressive policies to a Venezuelan-type of nightmare, generating fear that minorities’ rights will erode religious and moral principles, or simply by indoctrinating people in brutality through the systematic use of derogatory language. The rise of Mr. Bolsonaro as a mythical figure fulfills the expectations created by that kind of intellectual attack. It’s not an exchange of arguments: Those who don’t believe in democracy work in insidious ways.The major news outlets have tended to minimize the dangers, working in fact for Mr. Bolsonaro by describing the situation as a confrontation between two extremes: the Workers’ Party potentially leading us to a Communist authoritarian regime, while Mr. Bolsonaro would fight corruption and make the economy market friendly. Many in the mainstream press willfully ignore the fact that Mr. da Silva respected the democratic rules and that Mr. Bolsonaro has repeatedly defended the military dictatorship of the 1960s and ’70s. In fact, in August 2016, while casting his vote to impeach Ms. Rousseff, Mr. Bolsonaro made a public show of dedicating his action to Carlos Alberto Brilhante Ustra, who ran a torture center in the 1970s. As a public figure in Brazil, I have a duty to try to clarify these facts. I am an old man now, but I was young in the ’60s and ’70s, and I remember. So I have to speak out.In the late ’60s, the military junta imprisoned and arrested many artists and intellectuals for their political beliefs. I was one of them, along with my friend and colleague Gilberto Gil.Gilberto and I spent a week each in a dirty cell. Then, with no explanation, we were transferred to another military prison for two months. After that, four months of house arrest until, finally, exile, where we stayed for two and a half years. Other students, writers and journalists were imprisoned in the cells where we were, but none was tortured. During the night, though, we could hear people’s screams. They were either political prisoners who the military thought were linked to armed resistance groups or poor youngsters who were caught in thefts or drug selling. Those sounds have never left my mind.Some say that Mr. Bolsonaro’s most brutal statements are just posturing. Indeed, he sounds very much like many ordinary Brazilians; he is openly demonstrating the superficial brutality many men think they have to hide. The number of women who vote for him is, in every poll, far smaller than the number of men. To govern Brazil, he will have to face the Congress, the Supreme Court and the fact that polls show that a greater majority than ever of Brazilians say democracy is the best political system of all.I quoted Mr. Jobim’s line — “Brazil is not for beginners” — to bring a touch of funny color to my view of our hard times. The great composer was being ironic, but he spoke to a truth and underlined the peculiarities of our country, a gigantic country in the Southern Hemisphere, racially mixed, the only country with Portuguese as its official language in the Americas. I love Brazil and believe it can bring new colors to civilization; I believe most Brazilians love it, too.Many people here say they are planning to live abroad if the captain wins. I never wanted to live in any country other than Brazil. And I don’t want to now. I was forced into exile once. It won’t happen again. I want my music, my presence, to be a permanent resistance to whatever anti-democratic feature may come out of a probable Bolsonaro government.Caetano Veloso is a Brazilian composer, singer, writer and political activist.Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.Advertisement"}