{"id": "Pittsburgh, Midterms, Whitey Bulger: Your Tuesday Evening Briefing", "paragraph": "Supported byBy Jean Rutter and Hiroko Masuike(Want to get this briefing by email? Here’s the sign-up.)Good evening. Here’s the latest.1. President Trump visited Pittsburgh as the first funerals began for the 11 victims of Saturday’s synagogue massacre. Above, a service for David and Cecil Rosenthal.Many officials and residents made clear his visit was not welcome. About 1,000 protesters gathered holding signs criticizing Mr. Trump’s divisive language with slogans like “Words matter,” below.The president and the first lady were accompanied by his daughter Ivanka Trump and her husband, Jared Kushner, both practicing Orthodox Jews. They guided the president’s response to the shooting, our reporters learned.Their first stop was at the Tree of Life synagogue, where the president and his family lit candles and were greeted by Rabbi Jeffrey Myers, the congregation’s spiritual leader.Dozens of rabbis let us know how they and their congregations have reacted to the massacre. “I will certainly devote my sermon this week to the need to mourn and bury our dead, then to go on to build a future life,” one rabbi said.Officials said the suspect, Robert Bowers, used an AR-15 assault rifle and three Glock .357 handguns in the shooting spree, among 10 guns he owned legally._____2. With the midterms just a week away, President Trump has made a series of attention-getting moves. Above, a rally in Murphysboro, Ill.Before he went to Pittsburgh, the news site Axios published an interview in which he said he was preparing an executive order to nullify the guarantee of U.S. citizenship for everyone born in the country.The president’s plan was immediately rejected by legal scholars and legislators, including some from his own party. “You obviously cannot do that,” the House speaker, Paul D. Ryan, told a Kentucky radio station.Birthright citizenship, our Supreme Court reporter notes, was embedded in the 14th Amendment in large part to overrule the Dred Scott decision of 1857. That infamous Supreme Court ruling said black slaves were property and not citizens, and barred their descendants from citizenship._____3. This election cycle has already set several records: for the number of women running for Congress, the number of women to win primaries and the number of female candidates of color.But women are still struggling to raise as much campaign money as men, particularly if they are Republicans, are challenging incumbents or are running in places where the opposing party has a big advantage. Above, Rashida Tlaib, the Democratic candidate in Michigan’s 13th Congressional District.The Tip Sheet: Our daily analysis of next week’s elections takes a look at a House district in South Carolina that has become an unexpected battleground._____4. China has a potent economic weapon it could deploy in its trade war with the U.S.It involves the number seven.China’s currency has been losing value since April. Now it hovers around seven renminbi to the dollar, a psychologically important threshold. It’s also the weakest the renminbi, above, has been since the beginning of the financial crisis.If the currency depreciates further, it could give Chinese exporters a price advantage and undermine U.S. tariffs. The Trump administration doesn’t like that idea.But China has good reason to avoid it, too, and it appears to have acted in recent weeks to prop up the renminbi. Currencies may be potent weapons, but they are blunt ones — and they can boomerang against those who use them._____5. A galactic trap door? Scientists in Germany and Chile say they have new evidence that a dark entity in the constellation Sagittarius is a supermassive black hole, a bottomless grave with a mass equal to more than four million of our suns.The giveaway: gas clouds traveling at roughly 30 percent of the speed of light, circling the center of the Milky Way, above.In the coming months, a network of giant telescopes will try to produce an image of the black hole itself._____6. Violent storms lashed the length of Italy early this week, leaving at least 11 people dead.In Venice, locals and tourists tottered on raised walkways throughout the city, while others waded through thigh-high water and even took a swim in historic St. Mark’s Square.Ferocious winds drove the high tide there to more than five feet above average sea level, one of the highest levels ever recorded.It was the highest flood in a decade, though far short of the record set in November 1966._____7. Whitey Bulger, the legendary Boston crime boss turned F.B.I. informant, was killed by fellow inmates at a West Virginia prison, workers there said. He was 89.Mr. Bulger, who was serving two life sentences for 11 murders, had eluded police for 16 years before he and a companion were arrested in Santa Monica, Calif., in 2011. Above, a 1953 mug shot.Topmost in his code of the streets was said to be: Never squeal to the authorities. That facade crumbled with the disclosure that he was a federal informer against the Mafia for 15 years._____8. The Lion Air jet that crashed in Indonesia on Monday, killing all 189 people aboard, was brand new. The aircraft model — the Boeing 737 Max 8 — was introduced only last year, although it has quickly become a mainstay of carriers replacing older 737s. Above, sorting through crash debris.So what went wrong? Experts are looking to see if an underlying problem, either mechanical or human or both, may have caused the crash. The flight had erratic changes in speed, altitude and direction, which could indicate problems with instruments. Investigators are focusing attention on small metal tubes used to calculate airspeed and altitude.The U.S. and the European Union evaluate aviation safety standards of countries and airlines around the world. Here’s where to find that information._____9. Can tiny books change the way we read?A new series of pocket-size novels should feel familiar to people used to scrolling smartphones with their thumbs.The books, printed on paper as thin as onion skin, are meant to be held sideways and read with one hand. The first to be released in the U.S. are novels by John Green, author of “The Fault in Our Stars.”The tiny books are based on dwarsliggers (from the Dutch “dwars,” or crosswise, and “liggen,” to lie), a format that has become popular across Europe.But don’t worry: The effect, Mr. Green said, is much closer to a book than a cellphone. “The whole problem with reading on a phone is that my phone also does so many other things.”_____10. Finally, who’s to say what tastes awful?The Museum of Disgusting Food, a touring pop-up exhibition now in Sweden, is challenging taste buds across the globe.Say you’ve already tasted haggis, Vegemite, Spam and durian fruit (banned on planes and in some hotels). Would you try fruit bat soup, maggot-infested cheese or Chinese mouse wine?Disgust is hard-wired, but it’s highly subjective, researchers say. “People can’t believe that we take their favorite foods and put them in the museum,” said its director, who hopes to stimulate discussion about sustainable protein sources. Like insects.Have an adventurous evening.Your Evening Briefing is posted at 6 p.m. Eastern.And don’t miss Your Morning Briefing. Sign up here to get it by email in the Australian, Asian, European or American morning.Want to catch up on past briefings? You can browse them here.What did you like? What do you want to see here? Let us know at briefing@nytimes.com.Advertisement"}