{"id": "Shadow, and Support, of Government Follows Hungarian Opera", "paragraph": "Supported byBy Anthony TommasiniIts commendable that the Hungarian State Opera and the Hungarian National Ballet, to make their American debuts, brought some 350 artists and technical crew members to New York to present six productions. Inevitably, they carried some political baggage as well.Their arrival at Lincoln Center has drawn fresh attention to the right-wing government of Prime Minister Viktor Orban in Hungary. At a time when Mr. Orban’s increasingly autocratic policies are perceived as fomenting anti-immigrant fervor and cracking down on dissent, his government has been providing enormous support to the opera and ballet companies. He sees culture as a means to achieve prestige and assert national identity.You might have expected everyone involved with this two-week stint at the David H. Koch Theater to steer clear of politics and allow the achievements of these artists from Budapest to take center stage. But in a greeting to the audience on Tuesday to open the series, Katalin Bogyay, Hungary’s ambassador to the United Nations, dived right into the political thickets of her homeland.Among the many distinguished guests, she singled out the president of Hungary, Janos Ader, and the tenor Plácido Domingo, the patron of the opera company’s New York appearances, who were seated together. She spoke of the 1861 work the audience was about to hear — Ferenc Erkel’s “Bank Ban,” considered the Hungarian national opera — as espousing Hungarian values of freedom and patriotism. And she gave special thanks to the government ministries of Hungary. Without their support, she emphasized, “We couldn’t do anything.” That statement seemed all too true.But artistically, “Bank Ban” (“The Viceroy Bank”) was not a great introduction.You can understand why the work has become associated with Hungarian identity. It takes place during the reign of the 13th-century king Endre II, who is off at war when the action starts. Left behind is his queen, Gertrud, whose Meranian descent makes her suspiciously foreign in the eyes of Hungarian noblemen allied with the king. In the opening scene, Gertrud is seen blithely entertaining a roster of Meranian revelers at court.Bank, the viceroy, the opera’s tormented hero, learns that Melinda, his beloved wife, has been pursued by the queen’s self-indulgent younger brother Otto, an overture Gertrud has encouraged. Melinda is repelled by Otto, who forces himself upon her, driving her to madness.There are hints of Donizetti and Verdi in Erkel’s score, passages of plaintive harmonic writing, and hymnlike choruses. Still, the opera is run through with arias that sound like four-square songs. And after the third or fourth (I lost count) stirring choral anthem in praise of the homeland, I had had enough. Despite some compelling singing from several cast members, the performance on this night, conducted by Balazs Kocsar, lacked energy and focus.Things were vastly better for the second production on Thursday, a double-bill of one-act works: the composer Janos Vajda’s “Mario and the Magician,” first performed in 1988; and Bartok’s brooding masterpiece “Bluebeard’s Castle,” which had its premiere a century ago when this company performed it in Budapest.Mr. Vajda’s opera is adapted from Thomas Mann’s 1929 novella “Mario and the Magician,” a veiled critique of emerging fascism. (Was this Hungarian company sending a message to its own government by presenting this opera on tour?)Set in a resort town of Italy on a stormy night, the opera tells of Cipolla, a magician who has come to entertain the residents and visitors. Cipolla proceeds to induce selected attendees into doing things seemingly against their will. The magician is presented as someone who simply draws out of people desires, fears and prejudices that are already lurking within. Finally, Mario, a waiter from a cafe who is suffering from lovesickness, is entranced into thinking the magician is the woman he pines for. He kisses Cipolla. When returned to his senses, Mario shoots the magician to death.In this restless score Mr. Vajda reveals an ear for tart harmonies and unusual instrumental colors. Curiously, whole stretches of the music have a darkly comedic cast, in the manner of Fellini film scores.It was hard to assess the updated production of “Bluebeard’s Castle” because of obvious glitches in the video projections the staging relied upon. But the musical performance of this two-character opera was engrossing.Andras Palerdi (who also sang Cipolla) brought an earthy bass voice and subtly menacing presence to Bluebeard, a mysterious duke who leads his new wife (his fourth) to his gloomy castle with its seven locked doors protecting the secrets of his life. The powerful mezzo-soprano Ildiko Komlosi made an uncommonly formidable Judith, who is convinced she can rescue her new husband from whatever demons plague him, but whose curiosity to know all leads to the opera’s harrowing conclusion. The orchestra, under Mr. Kocsar, played Bartok’s dark, weighty and seething score as if they owned the piece.Friday’s production of Karl Goldmark’s “The Queen of Sheba,” brought out the best from an impressive cast, a large chorus and the tireless orchestra. The Austro-Hungarian Goldmark had his greatest success with this ambitious four-act opera, first presented in Vienna in 1875, now a rarity.With a German libretto, Goldmark’s absorbing, if unabashedly melodramatic, opera tells of a love triangle at the palace of King Solomon between Sulamith, the daughter of a high priest; her fiancé, Assad; and the Queen of Sheba, under whose spell Assad falls while on a mission for Solomon. Though there are long-winded stretches to Goldmark’s score, the music overall is textured, glittery and captivating. You hear influences of French grand opera as well German Romantic styles, including Weber and early Wagner. (As a young critic, Goldmark was a champion of Wagner.) The temple scenes beautifully echo Goldmark’s memories of music from childhood synagogues.The company had three exceptional singers for the punishing lead roles: Boldizsar Laszlo, a feisty tenor with youthful sound and Wagnerian power, as Assad; the silvery soprano Eszter Sumegi as Sulamith; and the bright-voiced, penetrating mezzo-soprano Erika Gal as the seductive Sheba. Janos Kovacs led the orchestra in a rhapsodic performance. And though this touring production was old-fashioned and basic, it looked colorful and exotic. And nothing malfunctioned.The New York tour of the Hungarian State Opera and Hungarian National Ballet continues at the David H. Koch Theater through Nov. 11, 212-721-6500, lincolncenter.org.Advertisement"}