{"id": "America’s Election Grid Remains a Patchwork of Vulnerabilities", "paragraph": "Supported byBy Mike McIntire, Michael Wines and Alan BlinderCounty officials in Maryland miscalculated how many ballots they would need on Election Day — and quickly ran out in more than a dozen precincts.In New York City, voters were given a two-sheet ballot that jammed machines and caused delays and long lines. And in Georgia, some voters failed to provide details like a birth year, leading officials to reject hundreds of absentee ballots for “insufficient oath information” before federal judges intervened.Nearly two decades after voting problems in a handful of Florida counties paralyzed the nation, America’s election grid this month remained a crazy patchwork of inconveniences, confusion and errors, both human-made and mechanical. The lumbering system, combined with claims of voter suppression and skewed maps from redistricting, once again tested confidence in the integrity of the vote.As in 2000, no evidence emerged of widespread fraud or political interference. But just finding enough qualified poll workers to make Election Day happen was once again a challenge, as voters navigated more than 100,000 polling places, staffed by 900,000 mostly volunteer workers and administered by some 10,000 local jurisdictions. (After the 2016 election, nearly two-thirds of local elections officials nationwide reported difficulties in recruiting workers.)The unevenness of the system across the country — in 22 states, elections at the local level were overseen by just one person — made it a political process open to accusations of manipulation.In some states, including New Jersey, South Carolina and Louisiana, officials depended on electronic voting machines that have no paper backups in case of a contested outcome. In Georgia, 16-year-old machines led to the improbable scene of Brian Kemp — the secretary of state overseeing elections and the Republican candidate for governor — being briefly thwarted in his attempt to cast a ballot for himself. The computer system, running on Windows 2000 software, returned an error.Broader worries about the handling of provisional ballots in Georgia and the security of a computer system led a federal judge to delay certification of the state’s results. On Friday, the Democrat Stacey Abrams ended her bid for governor in the race against Mr. Kemp, while denouncing what she called “systemic disenfranchisement, disinvestment and incompetence.”Legal actions were initiated in Florida, where close margins forced recounts in the races for Senate and governor, and questions arose about whether eligible mail-in ballots were improperly rejected. Election officials were to conclude manual recounts in the Senate race by Sunday. But on Saturday evening, with a manual recount not conducted in the contest for governor, Andrew Gillum, the Democratic nominee, conceded to Ron DeSantis, the Republican candidate.Elsewhere, accusations of voter suppression flared. Civil rights lawyers sued Pennsylvania, claiming its requirement that absentee ballots be received on the Friday before Election Day cost thousands of people a chance to vote. In Kansas, where a court recently struck down a law requiring proof of citizenship for new voters, many mistakenly believed they still could not register without a birth certificate, according to Democratic voting organizers.“I think the law did what it was intended to do,” said Johnny Dunlap, the Democratic Party chairman in Kansas’s Ford County, “and that was to discourage people from voting.”With the nation polarized along party lines and many contests fiercely fought, tight races threw a harsh light on weaknesses in the system, fueling partisan accusations and legal challenges.In New Mexico, a Republican congressional candidate, Yvette Herrell, sought to have the police seize 8,000 absentee ballots but cited no evidence of suspected fraud. A judge in Florida rejected efforts by the Republican Senate candidate, Gov. Rick Scott, to impound voting machines, and the authorities declined to investigate claims of fraud, saying they had no evidence of it.And in Arizona, as the counting of mail-in ballots delivered a victory for the Democratic Senate candidate, Kyrsten Sinema, the state Republican Party leader lashed out at the elections official in Maricopa County, a Democrat, declaring, “Such a man cannot be trusted to administer elections.”President Trump fanned the flames of distrust with tweets questioning votes in favor of Democrats in several states. As the counting of ballots continued in Arizona, Mr. Trump tweeted: “Just out — in Arizona, SIGNATURES DON’T MATCH. Electoral corruption — Call for a new Election?”Elections experts said that the process, while hobbled by vulnerabilities, was actually more orderly than one might glean from the partisan posturing, and that it had certainly improved since the 2000 presidential vote. Nationwide, voting equipment was largely more reliable, registration lists more accurate and election administrators better trained, they said.Still, said Marc Racicot, a former governor of Montana who once led the Republican National Committee, no election is perfect because there “is a certain margin of humanity to be expected that doesn’t amount to fraud.”Well-intentioned election officials, he said, should be permitted to do their jobs without fear of attacks.“I think it’s really important for the people of individual states across the country to understand that if they’re going to maintain confidence in their government and their republic and their systems, which I think are critical to us these days, that you have to begin with a presumption of good faith,” he said.The 2000 presidential election recount, with its televised images of hapless county officials in Florida squinting at ballots to discern voter intent, was the debacle that launched a thousand fixes.The race between George W. Bush and Al Gore, ultimately decided by the Supreme Court, exposed the fragility of a system that Americans had previously taken for granted.Technical problems with decrepit machines had caused some votes to be counted more than once or not at all. A badly designed ballot confused thousands of people. And a poorly executed purge of registration rolls led to eligible voters being turned away at the polls.“What we learned in that was how confusing the entire process was,” said Adam Goodman, a Republican consultant who advised Florida’s secretary of state at the time, Katherine Harris, during the recount. “That was something the public back then didn’t understand. It still doesn’t understand.”Fallout from the recount contributed to the passage of the federal Help America Vote Act, which allocated billions of dollars for states to improve technology, ensure voter access and secure systems against fraud. In Florida, legislators rewrote state laws, switched to paper ballots and optical scanners (no more butterfly ballots or hanging chads), and mandated automatic recounts for races with margins of half a percentage point.Charles Stewart III, a leading expert on election administration at the Massachusetts Institute of Technology, said complaints about this month’s elections in some parts of the country should not be seen as evidence of a failing system, or lack of progress since 2000.“Elections are incredibly complicated,” Mr. Stewart said, and officials are legally required to take time beyond Election Day to count votes. “Just the fact that we have a recount in Florida is leading people to say, ‘Ah, here we go again,’” he said. “In fact, it’s just a close election.”Though it wasn’t a 2000 redux, the 2018 midterms exposed persistent problems and the haphazard way the voting process was administered across the country. In Arkansas, three-member boards handle elections at the county level, while in Connecticut all 169 towns and cities use their own registrars.The inherently political nature of running elections can call into question some officials’ decision-making. In New York, party leaders fill county election boards in what critics say is little more than a patronage system.“They are not chosen for their ability to manage or familiarity with election procedures,” said Susan Lerner, the executive director of Common Cause in New York City. “They are chosen for their party loyalty and to provide jobs to the party faithful.”Florida still does not have a standardized, statewide ballot format, and a poorly designed ballot in the heavily Democratic Broward County this month is believed to have led to a significant under-vote for Senator Bill Nelson, a Democrat, who was narrowly behind Mr. Scott. Some 30,000 people in Broward voted for governor but inexplicably bypassed the Senate race, which was tucked away in the lower left corner of the ballot, below the instructions and far from the rest of the contests.Palm Beach County voters were given ballots that required them to draw a line to complete an arrow pointing to their preferred candidates, a potentially confusing alternative to the more common methods of filling in a bubble or making a check mark. Meanwhile, Mr. Nelson has brought a lawsuit in federal court over how Florida counties validate signatures on mail-in and provisional ballots, a process his campaign claims is unconstitutional because of inconsistent criteria applied by elections staff; a judge gave voters till Saturday to validate their mismatched signatures.Improved technology and equipment, a major part of the response to the 2000 election, have in some instances contributed to new worries. Some 30 states use so-called direct-recording devices, usually with electronic screens, that were initially seen as an antidote to hanging chads and other foibles resulting from archaic punch-card devices.But some of them did not offer a paper audit trail, complicating the process of a recount, and there have been complaints about their reliability. Some voters in Texas reported being stymied when trying to cast a party-line vote on electronic screens, saying the machines appeared to reverse or erase their choices; state officials said that the voters had mistakenly touched a button before confirming their selection and that the machines operated correctly.Several counties and states, including all of Delaware, Georgia, Louisiana and South Carolina, use electronic voting machines that don’t print paper copies for officials to review manually during an audit.Machines with no paper trailPaper ballots or machines with paper trailNo dataPa.N.J.Ind.Del.Kan.Ky.Tenn.S.C.Miss.Ga.Tex.La.No dataMachines with no paper trailPaper ballots or machines with paper trailPa.N.J.Ind.Del.Kan.Ky.Tenn.S.C.Ga.Miss.Tex.La.Machines with no paper trailNo dataPaper ballots or machines with paper trailPa.N.J.Ind.Del.Kan.Ky.Tenn.S.C.Ga.Miss.Tex.La.Machines with no paper trailNo dataPaper ballots or machines with paper trailPa.N.J.Ind.Del.Kan.Ky.Tenn.S.C.Ga.Miss.Tex.La.Sources: Election Data Services; Verified Voting Foundation | By Denise LuMore states have been turning to machines with a paper trail or optical scanners, which read paper ballots that the voter fills in with a marker. But voting machines are not expected to last more than 10 to 15 years. Aside from software problems in some states, aging machines at multiple polling places in New York City broke down, forcing voters to deposit ballots in boxes to be scanned later.Nearly half of all voters are registered in counties or townships with voting machines that are more than 10 years old.Machines more thanPaper ballotsNo data51015 years oldMachines more thanPaper ballotsNo data51015 years oldMachines more thanPaper ballotsNo data51015 years oldMachines more thanPaper ballotsNo data51015 years oldSource: Election Data Services | By Denise LuSurveying the long Election Day lines in Cobb County, Ga., Janine Eveler, the director of the Board of Elections, described the challenges of a record turnout for a midterm election, an unusually complicated ballot and a shortage of voting machines.“It’s a perfect storm,” she said.When James White moved from Atlanta to rural Baldwin County in Georgia, he registered to vote and was given a card certifying his eligibility. But when he went to the polls this month, he was turned away because his driver’s license still bore an Atlanta address.Aided by a Democratic Party worker, Mr. White went to the county courthouse, where he was told again that he was ineligible to vote. Eventually, he won a judge’s approval to cast a provisional ballot.“Whether it got counted or not, I really don’t know,” he said.A central aim of the Help America Vote Act was to make it easier for people to cast a ballot on Election Day. But embedded in the law were requirements for voter identification and maintaining registration rolls, objectives that Democrats say Republicans have twisted for partisan ends, effectively disenfranchising certain groups that lean left.Georgia and 16 other states, most of them in the South, demand photo identification that low-income people and minorities disproportionately lack, and conflicting information about addresses and dates of birth — even signature mismatches — can cost someone the ability to vote. An analysis by The Atlanta Journal-Constitution found the laws inconsistently applied, with absentee ballot rejections in one county, Gwinnett, accounting for 37 percent of the total for the entire state in this month’s election.Many states have voter ID laws that require identification from voters, but a portion specifically ask for a photo ID.IdahoWis.S.D.Mich.R.I.Ind.Va.Kan.N.C.Tenn.Ark.North Carolina voters recently approved an amendment to require photo ID in future elections.Ga.Ala.Miss.La.Tex.Fla.IdahoS.D.Wis.Mich.R.I.Ind.Va.Kan.N.C.Tenn.Ark.North Carolina voters recently approved an amendment to require photo ID in future elections.Ga.Ala.Miss.La.Tex.Fla.IdahoS.D.Wis.Mich.R.I.Ind.Va.Kan.N.C.Tenn.Ark.Ga.Ala.Miss.La.Tex.Fla.North Carolina voters recently approved an amendment to require photo ID in future elections.IdahoWis.S.D.Mich.R.I.Ind.Va.Kan.N.C.Tenn.Ark.Miss.Ga.Ala.Tex.La.Fla.North Carolina voters recently approved an amendment to require photo ID in future elections.Sources: National Conference of State Legislatures; Brennan Center for Justice | By Denise Lu and Maggie AstorRestrictive trends have accelerated since the Supreme Court invalidated part of the Voting Rights Act five years ago, with a number of states finding new ways to make it harder to vote. Some have aggressively purged voters’ registrations for inactivity. Still others have closed polling places.Suspicions of political motives have fueled distrust and anger. When construction required relocating the only polling place in the heavily Hispanic Dodge City, Kan., this month, the local election official, a Republican, moved it four miles away, outside the city limits. Democrats cried foul, seeing a plot to discourage voting, which Republicans denied.Democrats’ concerns in Kansas were heightened because of the involvement of the Republican secretary of state, Kris Kobach, in high-profile campaigns to crack down on voter fraud. Mr. Kobach championed a multistate system of checking registrations to prevent voters from casting ballots in two places at once, a system that critics contend is seriously flawed. A recent nonpartisan analysis estimated that it mistakenly flagged about 200 legitimate voters for every double registration it caught.States are required to keep their voting rolls up to date. But in recent years, a number of them have purged or inactivated voters in violation of federal law or based on inaccurate information. Some of these voters were later restored to the rolls.IdahoWis.N.Y.OhioInd.W.Va.Va.Kan.N.C.Okla.Ark.Ga.Ala.IdahoN.Y.Wis.OhioInd.W.Va.Va.Kan.N.C.Okla.Ark.Ga.Ala.IdahoWis.N.Y.OhioInd.W.Va.Va.Kan.N.C.Okla.Ark.Ga.Ala.Wis.IdahoN.Y.OhioInd.W.Va.Va.Kan.N.C.Okla.Ark.Ga.Ala.Sources: American Civil Liberties Union; NAACP Legal Defense Fund; Brennan Center for Justice; news reports | By Denise Lu and Maggie AstorGreg Shufeldt, an assistant professor of political science at Butler University who co-authored a recent study on electoral integrity, said groups most affected by restrictive voting laws tended to lose confidence in the system, which can limit turnout as much as the laws themselves.“If you feel the system is set up in a way to disenfranchise people, and you feel that the wheels of government are turning in a way to make people less likely to participate, eventually you’re going to have less trust in the system,” Dr. Shufeldt said. “And ultimately, you’ll become less likely to participate.”Mr. Kobach, who lost the race for governor in Kansas this month, had been tapped to lead a White House panel investigating voter fraud after Mr. Trump asserted, without evidence, that voting by millions of undocumented immigrants cost him the popular vote in 2016. The panel disbanded without finding any widespread fraud.Reporting was contributed by Maggie Astor, Patricia Mazzei, William Neuman and Simon Romero.Advertisement"}