{"id": "Safe Topics to Discuss This Holiday Season", "paragraph": "Supported byStick to the weather. What could possibly go wrong?By Mary CellaMs. Cella is a comedian.Family. Festivity. Fun! Meeting your significant other’s grandmother for the first time, while the wine is flowing. Holiday meals can be challenging, especially in these charged times, so here’s a cheat sheet of subjects that are safe to talk about with anyone, guaranteed.What could be safer than complimenting your hostess’s delicious cooking? Before you tell her she makes a great turkey, however, think about whether there are any vegans at the table. If there are, a simple compliment like “The bird is moist” could lead to a lecture from Cousin Emily about how factory farming is not only a form of slavery but also one of the greatest environmental hazards of our time. And as if hearing about animal torture as you douse your turkey in gravy weren’t enough, Uncle Dave will inevitably use this as a cue to share anecdotes from his recent big-game hunting trip.There’s certainly no harm in telling your partner’s niece you love her dress, right? Before you say she looks cute as a button, though, you may want to compliment her intelligence. That way you’re not reinforcing the patriarchal message that her value lies in her appearance. Little girls should know brains trump beauty, even in Trump’s America. Just make sure you’re discreet — otherwise, your boyfriend’s “freethinking” stepbrother will turn dinner into a real-life Reddit comment thread.When in doubt, stick to the smallest of small talk, like how you managed to get from your home to your boyfriend’s grandparents’ house. Be careful, though, because whether you drove, flew or took the train, the conversation could easily veer into a debate between cousins about whether the way cars function as a signifier of wealth is problematic. If you took the bus, keep your mouth shut, obviously.Everyone loves Great-Aunt Cindy’s dog, Muffin! Tell Cindy you’ve heard all about the old gal and ask how she’s doing. Just make sure you check with someone beforehand to ensure Muffin is indeed in good health. If she’s not, the mention of something like canine arthritis could be a slippery slope into a discussion about euthanasia. Before you know it, Cindy will be screaming that she’s taking Muffin to Oregon so that they can both die with dignity while her brother Gary calls her a damn hippie and offers to take her out with one of his 20 guns right here and now.The one thing human beings can always talk about, regardless of how well they know one another and how little they have in common, is entertainment. In lieu of any other connection, the monoculture unites us all! To be on the safe side, avoid talking about inherently political shows like “Succession,” “This Is Us,” “The Real Housewives of New York City,” “Sesame Street,” “Barefoot Contessa” or anything on the Home Shopping Network. Instead, talk about a piece of entertainment everyone can agree to hate, like cable news.Actually, there’s no way this won’t immediately lead to a screaming match about climate change so whatever you do, do not comment on the weather.How could the topic of politics possibly arise while chatting about America’s favorite sport? Go 49ers!Mary Cella is a writer and comedian.Follow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.Advertisement"}