{"id": "‘Blackface’ Remarks by Megyn Kelly Lead to Rift With NBC", "paragraph": "Supported byBy John Koblin and Michael M. GrynbaumMegyn Kelly struggled on Wednesday to contain a growing crisis over her racially insensitive remarks during a “Today” show broadcast, statements that propelled longstanding tensions between the former Fox News anchor and her NBC News colleagues into public view.Several of Ms. Kelly’s fellow NBC stars denounced her for wondering aloud, on-air during “Megyn Kelly Today” on Tuesday, why it was inappropriate for white people to dress in blackface on Halloween.On Wednesday’s “Today” show, the NBC anchor Craig Melvin called her comments “racist and ignorant,” and Al Roker, the usually genial weatherman, said that Ms. Kelly “owes a bigger apology to folks of color around the country.” The MSNBC anchor Jacob Soboroff wrote on Twitter that her remarks were “vile.”Ms. Kelly issued a tearful apology of her own at the top of her 9 a.m. broadcast, telling viewers, “I’m Megyn Kelly and I want to begin with two words — I’m sorry.” Hours later, her boss, the NBC News chairman Andrew Lack, criticized her comments at a private gathering of network employees — and offered no praise for her attempts to redeem herself.“There is no other way to put this, but I condemn those remarks,” Mr. Lack said at a midday staff meeting held in the “Saturday Night Live” studios in Midtown Manhattan. “There is no place on our air or in this workplace for them.”[Update: ‘Megyn Kelly Today’ show is cancelled in wake of Kelly’s ‘Blackface’ comments.’]His comments were seen within NBC as a stinging rebuke, according to interviews with four people close to the network who spoke on the condition of anonymity to describe sensitive conversations.Even before this week, the future of Ms. Kelly’s show was up in the air. During a meeting this month, Ms. Kelly and Mr. Lack discussed a possible winding-down of her portion of the “Today” show by the end of the year, according to two people briefed on the conversation. And Ms. Kelly has expressed among friends her dissatisfaction with its top news executives.Late Wednesday, Ms. Kelly and her Hollywood talent agency, Creative Artists Agency, ended their relationship, according to two people informed of the decision.With a reported annual salary of $17 million and the NBC hype machine in full swing, Ms. Kelly, 47, arrived at 30 Rockefeller Plaza last spring hoping to become the first Fox News personality to successfully leap to the gentler realm of morning network TV.Instead, she has struggled to attract viewers and offended celebrity guests (notably the actress Jane Fonda). She also alienated some “Today” show colleagues with her coverage of in-house harassment scandals involving Matt Lauer, the former “Today” anchor, and Tom Brokaw, the former NBC anchor, according to two people with knowledge of the matter.On Tuesday’s show, her comments — in which she suggested to her guests that, when she was a child, dressing in blackface was accepted “as long as you were dressing up as a character” — left many NBC News employees stunned and exasperated. At a post-broadcast meeting, members of Ms. Kelly’s “Today” team expressed discomfort with what she had said on-air, according to several people briefed on the discussion, although Ms. Kelly was not present.Her remarks came during a round-table discussion of how, as she put it, “the costume police are cracking down” on Halloween outfits. “You do get in trouble if you are a white person who puts on blackface on Halloween, or a black person who puts on whiteface for Halloween,” Ms. Kelly said. “Back when I was a kid, that was O.K., as long as you were dressing up as a character.”She added that she was perplexed by the criticism of Luann de Lesseps, a cast member of “The Real Housewives of New York” who was criticized for dressing up as Diana Ross, complete with an outsize Afro wig. “People said that that was racist, and I don’t know, I felt like, who doesn’t love Diana Ross?” Ms. Kelly said, adding: “I can’t keep up with the number of people that we’re offending just by being normal people.”Several hours later, she emailed an apology to colleagues. “The history of blackface in our culture is abhorrent; the wounds too deep,” Ms. Kelly wrote. “I’ve never been a ‘pc’ kind of person — but I understand that we do need to be more sensitive in this day and age.”“NBC Nightly News” devoted segments to Ms. Kelly’s remarks during its Tuesday and Wednesday editions. On Tuesday, the broadcast included a Fox News clip from 2013 in which Ms. Kelly weighed in on the race of Santa Claus. “For all you kids watching at home, Santa just is white,” she said. That same clip was shown again during Wednesday’s 7 a.m. hour of “Today.”For NBC News, the “blackface” flare-up was yet another headache.The news division has come under scrutiny for what its executives may have known about the workplace behavior of Mr. Lauer before he was fired in 2017 after allegations of sexual harassment were made against him. In May, an NBC investigation cleared network executives of any wrongdoing in the matter, but drew criticism because it was conducted by in-house counsel, rather than an outside law firm.Mr. Brokaw was also accused of making unwanted advances — claims that the anchor denied. And in September, the journalist Ronan Farrow and his NBC producer, Rich McHugh, accused the network of impeding a report about Harvey Weinstein and sexual assault, an investigation that Mr. Farrow continued at The New Yorker. (NBC said it did nothing wrong.)Ms. Kelly covered each of those episodes extensively on her morning show. Last month, she suggested on the air that outside investigators should look into the matter of NBC’s handling of the Farrow story.On-air errors, even contentious ones, can sometimes be smoothed over if an anchor has big ratings. But in her first year at NBC, Ms. Kelly’s portion of “Today” has averaged 2.4 million viewers, a drop of nearly 400,000 from the same hour’s average before her arrival, according to Nielsen. Ms. Kelly has also trailed a rival morning program, “Live With Kelly and Ryan,” by a wide margin.Her “blackface” remarks on Tuesday could further complicate her job. A Netflix spokeswoman said on Wednesday that cast members of the political drama “House of Cards” had decided to pull out of a scheduled appearance on “Megyn Kelly Today.”Advertisement"}