{"id": "In N.H.L. Concussion Settlement, Owners Win the Fight", "paragraph": "Supported byOn Pro HockeyBy Ken BelsonA settlement announced Monday between the N.H.L. and several hundred retired hockey players who accused the league of hiding the dangers of repeated head hits did little to quell the emotional intensity surrounding the issue.The deal, which must be approved by the 318 former players who joined the lawsuit, includes free neuropsychological tests, up to $75,000 for medical treatment, a potential cash payment of about $20,000 a player, and the establishment of a Common Good Fund to help other players in need.The settlement will undoubtedly bring a trickle of money to players in need and is a minor legal achievement, given the resources and resolve of the N.H.L., which used brass knuckles to fight the players at every turn. But few on the plaintiff side will be happy with a deal that provides little long-term security for retired players who are suffering.“The N.H.L.’s philosophy was scorched earth and deny every issue,” said Charles Zimmerman, the lead lawyer for the retired hockey players. “They denied the link between neurocognitive problems and the game of hockey, and felt that the players were not injured and wouldn’t participate in large numbers. They were right on that.”After four years of litigation, the N.H.L. knew that far fewer former hockey players, many of them Canadians, were willing to take on a sport that is all but a national religion in Canada, a country with a less litigious tradition than the United States. Fighting a sport synonymous with Canadian toughness and freezing afternoons on frozen ponds goes against the grain with many people above the 49th parallel.Hockey, Zimmerman said, is “a very different culture” than football and the N.F.L.He said, “We had a different game, a different league, a different culture and different commissioners.”The agreement, fairly or not, will be forever compared to the settlement in the N.F.L., which agreed to a far more sweeping settlement in 2013. That deal covers every retired football player, not just those who sued the league, like the N.H.L.’s. All players can get medical tests, but also cash payments of up to $5 million if they have or develop A.L.S., dementia or other cognitive and neurological conditions.The N.F.L. settlement has been plagued with delays and accusations of fraud, and it has more than a few flaws, including covering only a limited number of players who are found to have chronic traumatic encephalopathy, or C.T.E., a degenerative brain disease linked to repeated head hits.But the N.F.L. settlement is more inclusive than the deal the former hockey players struck because the N.F.L. wanted to end potential lawsuits that might have cited evidence already unearthed, like internal league committees that created junk science to discredit those claiming the game was dangerous. In the end, the league agreed to an estimated $1 billion settlement without a single player being deposed or appearing in court.There were different legal realities, too. In the N.F.L. case, hundreds of civil actions that about 5,000 players brought were consolidated in the United States District Court for Eastern Pennsylvania. The N.F.L. actively supported that move, and the judge overseeing the case, Anita B. Brody, appointed a well-known mediator to bring the sides together. Just four months after oral arguments in April 2013, an initial deal was announced covering all 20,000 or so retired players.The former hockey players, meanwhile, won several early decisions in court, but the N.H.L. opposed the creation of a class that would include many more former players. On July 13, Susan Nelson, the judge overseeing the case in United States District Court in St. Paul, denied the former players’ bid to attain class-action status.That would have made it easier for thousands of other players to join the suit. Instead, the decision effectively limited the size of the group of players suing the league, diluting their leverage. In her decision, Nelson wrote that managing the case as a class-action lawsuit would prove too difficult given that different states had different rules about the medical monitoring the players were seeking.With the scales tilted toward the league, negotiations, which were largely stalled, advanced. “We gave it a hell of a shot,” Zimmerman said.Some sports lawyers say that Zimmerman and the other lawyers involved got the best deal they could under the circumstances.“The N.H.L. case makes the N.F.L. settlement look like a grand slam times 10,” said Paul Anderson, a sports lawyer in Kansas City, Mo. “But the facts in the N.F.L. case were far more egregious, the total number of players at the N.F.L. level was larger, and there was nonstop media reporting about it.”Norman O’Reilly, who teaches sports business at the University of Guelph in Ontario, added that the N.H.L. had the good fortune of facing a more fractured opponent: former players not just from Canada and the United States, but also Europe. He also said player resentment of the league was not as virulent in the N.H.L., partly because player contracts are guaranteed.Yet, given the scale of injuries that former hockey players are dealing with, Zimmerman said he was surprised the N.H.L. did not appear more willing to help some of the men who helped make the league and the owners wealthy.On Monday, the fans will have their chance to say whether they think the league should have done more. That’s when Commissioner Gary Bettman, a former litigator who played hardball with the retired players, will be inducted into the Hockey Hall of Fame in a ceremony in Toronto.Bettman is regularly booed when he presents the Stanley Cup to the winning team each June. He has never given an inch when it comes to acknowledging that high-speed collisions and bare-knuckle fistfights might cause long-term brain damage.The settlement his league has agreed to seems sure to protect the financial well-being of the owners. It’s unlikely to win Bettman much in the way of praise from anyone who advocates the long-term health and well-being of hockey players.Advertisement"}