{"id": "FedEx Ends Deal for N.R.A. but Says It’s Not Because of Pittsburgh Shooting", "paragraph": "Supported byBy Tiffany HsuFedEx is ending a partnership with the National Rifle Association that offered discounts to members of the gun-rights group.A spokesman for FedEx said the decision was not prompted by the mass shooting at a Pittsburgh synagogue that left 11 people dead on Saturday.Instead, FedEx said on Tuesday that its decision to end its marketing relationship with the N.R.A. was the result of a review that began months ago. The review showed that members of the group did not bring in enough shipping volume to warrant its participation in the program, the company said. More than 100 companies were dropped from the discount program as part of the review.While FedEx is ending the program, N.R.A. members who had access to the discount previously will continue to be able to use it.The company had faced pressure from gun-control activists to end the program, in particular after a gunman killed 17 people at a high school in Parkland, Fla., in February. At the time, companies including Delta, United Airlines, MetLife and several car-rental outlets dropped deals with the N.R.A.But FedEx had refused to do so. In February, the company said that while it opposed civilian ownership of assault rifles, it “does not and will not deny service or discriminate against any legal entity regardless of their policy positions or political views.”In May, the N.R.A. filed a federal lawsuit against New York State, claiming that state officials had blacklisted the gun group by instructing financial groups and insurers to steer clear. The shunning has cost the N.R.A. tens of millions of dollars, threatening programs like its online video channel NRATV, according to the group.“If I could have put the @NRA out of business, I would have done it 20 years ago,” Gov. Andrew Cuomo said on Twitter in August.A day later, he wrote in a post: “If the @NRA goes bankrupt because of the State of New York, they’ll be in my thoughts and prayers.”The N.R.A. did not immediately respond to a request for comment.Criticism of the gun industry flared after the shooting on Saturday, when a man armed with an AR-15-style assault rifle and at least three handguns opened fire inside the Tree of Life Congregation in Pittsburgh, killing 11 people.Fred Guttenberg, whose daughter Jaime died in the Parkland shooting, wrote on Twitter that the FedEx decision “is a big deal” that left him “overwhelmed that they have decided to finally do this.”Follow Tiffany Hsu on Twitter: @tiffkhsu.Advertisement"}