{"id": "She Helped Save Her Husband’s Life With CPR, Then Gave Birth to Their Son", "paragraph": "Supported byBy Christina CaronAshley Goette of West St. Paul, Minn., is being compared to a superhero these days, and not just because she’s a new mother. (Though her 22 hours of labor alone would qualify.) It’s because in the span of four days, she not only gave birth to her first child, but also saved her husband’s life.It all began last Tuesday, around 5 a.m., when Ms. Goette was awakened by her husband, Andrew. He seemed to be snoring. She nudged him and asked him to roll over. He didn’t respond.Then she realized he wasn’t snoring at all: He was gasping for air.Ms. Goette, 28, who works as a teacher’s aide at an elementary school, called 911 and the dispatcher guided her in performing chest compressions, instructing her to move her husband to a hard surface. But she was 39 weeks pregnant, and though she tried, he wouldn’t budge. She continued performing compressions on the bed. The gasping stopped. He was turning purple.“I thought he for sure was dead,” Ms. Goette said on Wednesday. “I don’t think I really had any time to process what was going on.”After about 10 minutes, paramedics showed up and discovered he wasn’t breathing and didn’t have a pulse. They shocked his heart and rushed Mr. Goette, 28, to the hospital, where his outlook seemed uncertain.“He wasn’t waking up and interacting with us, so that’s always a concerning factor,” Dr. Alex Teeters, a pulmonary and critical care physician at United Hospital in St. Paul, said on Wednesday.Soon, a team of doctors approached Ms. Goette with grim news: Initial testing suggested that Mr. Goette might have sustained severe brain damage.“Those first 24 hours were harrowing for the family,” Dr. Teeters said, and doctors prepared Ms. Goette “for the possibility that this might not be a good outcome.”As she recalled, “there was pretty much no question at that time that he was not coming home with me.”The hospital sedated Mr. Goette and began lowering his body temperature in what would be a daylong procedure to induce mild hypothermia and reduce damage to the brain.“While they were doing that, it was the most terrifying thing to see,” Ms. Goette said. “His body was just convulsing.” The doctors administered a muscle relaxant to prevent involuntary movements.“I would constantly be holding his hand over my stomach on the baby, and telling him: ‘We have not had this baby yet. I’m going to wait for you. You’re going to be the first one to hold this baby. This is not happening until you’re ready,’” Ms. Goette recalled.Then, on Wednesday, when the process ended and the sedation lifted, Mr. Goette began to move.A nurse asked him to open his eyes, and to everyone’s surprise, he sat upright, scanning the faces of his family members.“The screams that were coming from his room and the cries were like nothing else,” Ms. Goette said. “Nobody was expecting that — it was insane.”Had Ms. Goette not acted as quickly as she did, Dr. Teeters said, her husband might not have recovered.“Minutes can make a huge difference in situations like this,” Dr. Teeters said.Mr. Goette later learned that he had Wolff-Parkinson-White syndrome, a rare condition also shared by his uncle that creates abnormal heart rhythms. It is even more rare for patients with this syndrome to go into cardiac arrest, Dr. Teeters said.The condition is caused by an extra electrical pathway between the heart’s upper and lower chambers that is present from birth.Mr. Goette needed a procedure to destroy the tissue in his heart that was creating the improper pathways. But then, on Thursday, Ms. Goette started having contractions. Her blood pressure was rising. The procedure was postponed.She was in labor throughout the night and into Friday, but eventually hospital staff members urged her to consider a C-section. She agreed, and on Friday, Lennon was born.Mr. Goette was the first person to hold him.“I tore open the hospital gown I had on and I was patiently waiting for them to walk through the hospital doors so I could put him on my chest,” Mr. Goette recalled.Seeing the two of them together for the first time “was the most amazing thing I had ever seen,” Ms. Goette said. “That made me very happy.”Mr. Goette had his surgery on Monday and the couple are now both back at home, surrounded by family, as they adjust to life as new parents.“We’re really lucky,” Ms. Goette said.Susan Beachy contributed research.Advertisement"}