{"id": "Broadcast News Snippets", "paragraph": "Supported bydaily crossword columnRoland Huget makes his presence known.By Deb AmlenMONDAY PUZZLE — You might need some earplugs to get through today’s puzzle by Roland Huget. I said, you might need some earplugs to get through today’s puzzle by Roland Huget.What is that unholy noise?A few entries and clues that might be considered tough for a Monday, but you’ve got this. Let’s take a closer look.16A: According to MayoClinic.org: “The uvea is a layer of tissue beneath the white of the eye (sclera). It has three parts: the iris, which is the colored part of the eye; the choroid layer, which is the layer of blood vessels and connective tissue between the sclera and the retina; and the ciliary body, which secretes the transparent liquid (aqueous humor) into the eye.” I know. But even on a Monday, you need to know it. It has been in the Crossword 243 times.38A: This is as gentle a lesson in misdirection as I’ve ever seen, and it’s good practice. The clue “Two marks in ‘résumés’” has the word “résumés” in quotes, so that’s a hint that we are not looking for marks on an actual résumé, we are looking for marks in the word itself. Those would be ACCENTS.43A: Hi, kids! Forgive me for what is going to be a brief rant. Look, the movie “White Christmas” was before my time, too, but you need to know about Danny KAYE. My mother brought me up on his movies, and they are “da bomb,” as you would say. (Do you still say that? Probably not.) For one thing, he was the original and best Walter Mitty (in my opinion), with all respect to Ben Stiller. Here is Mr. KAYE imagining himself as a hat designer:See? An amazing talent he was. Seriously, sit down and watch some Danny KAYE movies. They’re wonderful flights of fantasy.9D: Nice wordplay here. You might not be expecting this on a Monday, but it gives you a tantalizing glimpse into the fun you’ll have when you push further into the week. “Slice from a book?” sounds like you’re cutting up the book, but we’re supposed to be thinking about slicing our fingers and getting PAPERCUTs.Is it noisy in here, or is it just me? Mr. Huget offers us a set of three snacks, whose two word names end in a SOUND. For example, at 17A, the “Chocolaty candy on a stick” is TOOTSIE POP, with POP being the sound.He wraps these snacks in the revealer SOUND BITES, which is clued “Broadcast news snippets … or an apt description for 17-, 28- and 46-Across?”This puzzle has an unusual history. It was first constructed in August 2017. In October, Will and company said that they liked the theme, but that one of the theme entries was too obscure. After settling on a replacement, I was given the challenge of coming up with a polished Monday fill.I ran into a snag in the W and NW. After several attempts, I couldn’t come up with a grid that didn’t have either trite short fill or longer answers that were inappropriate for a Monday puzzle, or both. Finally, Sam Ezersky stepped in and fixed it. I suggested we share construction credit, but Sam declined. The puzzle was accepted for publication almost exactly a year ago.Editors have made significant changes to my grids twice. Both times, I learned a valuable lesson. In this case I learned that when you paint yourself into a corner, as I did here, you really have to go back far enough to revisit key decisions made earlier in the fill. Often, a less preferred option for a word slot ends up opening up the grid later on, resulting in a more successful fill overall.Almost finished solving but need a bit more help? We’ve got you covered.Warning: There be spoilers ahead, but subscribers can take a peek at the answer key.Your thoughts?Deb Amlen is the crossword columnist. She has been writing the Wordplay column since 2011 and believes that everyone can learn to solve the Times crossword. Even the Saturdays.  @NYTimesWordplay Advertisement"}