{"id": "4 Ways World Leaders Have Echoed Trump’s Words and Policies", "paragraph": "Supported byBy Megan SpeciaThe president of the United States has one of the most powerful bully pulpits in the world.President Trump has used that platform to spread his populist message through language often shorn of diplomatic niceties and demeaning of his opponents. And his language has been picked up by a number of leaders in other countries to offer justification of their own actions and to promote like-minded policies.Some leaders — or leaders of national institutions — have used similar language to go after political opponents, push their own populist agendas or even shield themselves from criticism of human rights abuses or the erosion of democratic norms. The latest example came on Friday, when the Nigerian army cited remarks by Mr. Trump to defend its owns actions after fatally shooting unarmed protesters.Mr. Trump has excited his base with calls to crack down on illegal migration on the southern border of the United States. In a news conference on Thursday, he suggested that American military personnel could fire on migrants who threw rocks at them.“They’re going to throw rocks at our military, our military fights back,” Mr. Trump said. “I told them consider it a rifle.” Mr. Trump later qualified his statement by saying, “That doesn't mean shoot them.”But less than 24 hours after his first remarks, the Nigerian army posted a video of the comments on Twitter to justify its own soldiers’ fatal shooting of rock-wielding  protesters earlier in the week. The army later deleted the post, though a spokesman defended its use.The government said three protesters were killed in the confrontation on Monday in the capital, Abuja. Rights groups say more than 40 people died in that episode and in two smaller protests before and after. The soldiers fired on a march of about 1,000 Islamic Shiite activists who had blocked traffic on the outskirts of the capital. Footage posted on social media showed several protesters hurling rocks at soldiers, and soldiers shooting some of the protesters as they fled.Since the 2016 presidential campaign, Mr. Trump has regularly deflected criticism with cries of “fake news.” He has also used the term to sow distrust of established news media and create doubts in the minds of voters as to whom and what can be trusted. The tactic has widely been copied by other leaders, who have used it in their own speeches and interviews, seeking similar effect. In response to a February 2017 Amnesty International report saying his government was responsible for thousands of secret deaths in prisons, President Bashar al-Assad of Syria told Yahoo News: “You can forge anything these days. We are living in a fake-news era.”Speaking to The New York Times in December, a Myanmar security official denied the existence of a large Muslim minority group, the Rohingya. “There is no such thing as Rohingya,” said the official, U Kyaw San Hla, calling the statement “fake news.” The military in Myanmar has carried out brutal and systematic attacks on the Rohingya, using the “fake news” response to dismiss scrutiny. Prime Minister Benjamin Netanyahu of Israel, a close ally of Mr. Trump, regularly invokes “fake news” now to denounce his critics, labeling the work of several major news outlets as that in posts on social media. Poland’s right-wing government, which has aligned itself closely with Mr. Trump, has picked up the phrase, too. President Andrzej Duda has restricted press freedom in his own country, signing into law a bill giving the government broad controls over the news media.  He posted a message on Twitter in January in support of Mr. Trump’s repeated use of the term.Since hundreds of thousands of asylum seekers entered the European Union in 2015, migration has become one of the Continent’s most divisive issues. And in talking about it, Europe’s populists and right-wing politicians have found common cause with Mr. Trump. He has cited and supported their anti-immigration positions, and they have used that backing and his slogans and tough talk to bolster their own positions.Theo Francken, Belgium’s immigration minister and an enthusiastic follower of Mr. Trump on social media, on Friday pointed to Mr. Trump’s call to end birthright citizenship in the United States as a step to emulate. “A lot can be said in favor of this idea,” including in Belgium, he said. Mr. Francken recently wrote a book about Europe, “Continent Without Borders,” that called for locking down European Union bordersThe leader of Italy's right-wing League party, Matteo Salvini, has also drawn inspiration from the American president.Mr. Salvini, who wields considerable sway as the country’s interior minister and deputy prime minister, came to power on an anti-immigrant platform. And he adopted the slogan “Italians First” while campaigning this year, an echo of Mr. Trump’s “America First” motto. Since Mr. Trump’s election, populist leaders with a similarly brash style, have risen to power. Brazil’s newly elected president, Jair Bolsonaro, rallied supporters with calls like “Let’s make Brazil great” that were reminiscent of Mr. Trump’s election slogan. His recent election marked a radical shift to the right in one of the world’s largest democracies.Mr. Bolsonaro, who takes office in January, said this week that he plans to follow suit on one of Mr. Trump’s most contentious foreign policy actions — by moving the Brazilian Embassy in Israel from Tel Aviv to the contested city of Jerusalem. Last year, Mr. Trump reversed nearly seven decades of American foreign policy and set off Palestinian outrage by moving the American Embassy to Jerusalem.And like Mr. Trump, Mr. Bolsonaro has also strongly criticized the United Nations for what he sees as overreach. Milan Schreuer and Rick Gladstone contributed reporting. Megan Specia is a story editor on the International Desk, specializing in digital storytelling and breaking news.  @meganspecia Advertisement"}