{"id": "We Asked for Examples of Election Misinformation. You Delivered.", "paragraph": "Supported byReaders submitted more than 4,000 examples of misinformation. Here are the different types being spread this election season.By Kevin RooseTwo months ago, The New York Times asked readers to send in examples of election-related misinformation they saw online.Readers responded. In all, more than 4,000 examples of misinformation were submitted to The Times from social media feeds, text-messaging apps and email accounts.Each legitimate submission was vetted by reporters and editors at The Times, and many have influenced our journalism in the lead-up to the midterm elections. We are grateful for readers’ submissions, and dedicated to continuing the work of fighting digital misinformation.Here is a review of some of the major types of misinformation submitted by readers, as well as some discovered in our own reporting.Some election-related misinformation is about specific candidates and races. Other misinformation coalesces around major news events in what could be called “hoax floods,” often adding to highly charged partisan conversations.Two news events in particular inspired floods of misinformation in recent months: the confirmation hearings of Justice Brett M. Kavanaugh, and the caravan of Honduran migrants moving through Guatemala and Mexico on its way to the United States border.During Mr. Kavanaugh’s confirmation process, many false claims, mislabeled images and unfounded rumors were used to attack the credibility of the multiple women who accused Mr. Kavanaugh of sexual assault. The Times debunked many of those rumors.One typical piece of misinformation was a graphic that was found by readers on right-wing Facebook pages. The graphic claimed that Christine Blasey Ford, one of Mr. Kavanaugh’s accusers, had been photographed with George Soros, the liberal philanthropist and frequent target of right-wing conspiracy theories. The photograph, shared tens of thousands of times on Facebook, was actually of Mr. Soros posing with Lyudmyla Kozlovska, a Ukranian human rights activist.The migrant caravan also inspired a number of deceptive, mislabeled and out-of-context posts on social media. The Times debunked several of these, but more have continued to spread.One typical example is a post found on numerous right-wing Facebook groups. The post used old and mislabeled photos of injured police officers in order to claim that caravan migrants were behaving violently toward law enforcement. The false post was shared thousands of times.Since 2016, major social media platforms have tried to make themselves less vulnerable to exploitation by bringing more transparency to political ads on their platforms.But the ad transparency push has not always gone smoothly. Investigations by The Times and other news organizations have found numerous problems with social networks’ ad transparency policies. These include a loophole in Facebook’s ad policy that allows advertisers, once they have verified their identities and are approved to run political ads, to fill the “paid for by” field in their ads with whatever text they want, essentially letting them disguise their identity. The extent of this loophole was explored by news organizations reporting on the policy, such as Vice News, which bought ads “paid for by” all 100 United States senators, as well as fictitious groups like “Ninja Turtles PAC.”The Times also found an example of this loophole in action. An anonymous critic of Jennifer Wexton, a Democrat running for Congress in Virginia’s 10th Congressional District, bought negative ads on Facebook that accused Ms. Wexton of being an “evil socialist” and superimposed her next to Nazis. The disclaimer on the ads read “paid for by a freedom loving American Citizen exercising my natural law right, protected by the 1st Amendment and protected by the 2nd Amendment.” Facebook knows who the advertiser is, but the public does not. Readers submitted many examples of confusing and poorly labeled ads in their home districts. One example was an ad placed on Google that took aim at Jared Polis, a Democrat running for Colorado governor. The ad, sponsored by a group called “Save Our State Colorado,” falsely claimed that Mr. Polis supported placing Colorado schools under Islamic Shariah law. No committee under the name “Save Our State Colorado” is registered with the Federal Election Commission, and it is unclear who is behind the ad.Dozens of readers sent in tips about a Russian manipulation campaign playing out on Reddit, the popular online message board.Many of the tips referred to an investigation by a Reddit moderator into suspicious activity on r/the_donald, Reddit’s largest pro-Trump forum. The moderator found that links to USAReally, a site operated by Russian nationals and funded by Russia’s Federal News Agency, were being submitted to r/the_donald under misleading web addresses. The links appeared to be from sites like geotus.army and geotus.band, but in fact, they took readers directly to the Russian website.After the investigation, Reddit banned several of these web addresses. USAReally’s founder called the bans “just another illustration of censorship in America.”Several readers submitted examples of social media misinformation with the ostensible goal of suppressing voter turnout.One Twitter misinformation campaign appears to have originated among right-wing trolls on 4chan, the notorious message board. The campaign used a Democratic Party logo on an image that encouraged Democratic men to stay home on Election Day, in order to make Democratic women’s votes more valuable. Twitter subsequently shut down accounts that were promoting the images.Readers also submitted examples of local and statewide voter suppression misinformation. One Facebook ad, run by North Dakota Democrats under a page titled “Hunter Alerts,” warned North Dakotans that they could lose their out-of-state hunting licenses if they voted in the midterm elections. The ad, whose claims are unsupported, was condemned by Republicans.Many readers submitted tips about deceptive or exaggerated claims targeting individual candidates. Deliberate misinformation about candidates long precedes the internet. (In 1800, Thomas Jefferson wrote anonymous articles about his rival, John Adams, in partisan newspapers.) But social media has supercharged the distribution of politically motivated smears.A manipulated photo of Stacey Abrams, the Democratic candidate for governor of Georgia, was shared thousands of times on Facebook. The image, which was originally posted to Ms. Abrams’s Twitter feed, was doctored to show Ms. Abrams holding a sign that said “Communist Stacey Abrams” and to falsely claim that she had been supported by the Muslim Brotherhood.Several readers submitted a video ad attacking Anthony Delgado, a Democratic congressional candidate in New York’s 19th District. The ad, which portrays Mr. Delgado, an African-American who was a Rhodes Scholar and who attended Harvard Law School, as an “extreme” rapper, was sponsored by the Congressional Leadership Fund, a Republican PAC. And while it was more of a conventional negative ad than a piece of deliberate misinformation, the ad was fact-checked by The Washington Post, which called it “grossly misleading.”False claims were sent to voters offline, too. One reader in Texas sent us a scan of a mailer that falsely warned that Texans displaying lawn signs supporting Beto O’Rourke, the Democratic Senate candidate, would be subject to $500 fines.Dozens of readers sent in screenshots of text messages they received from political campaigns, some of which contained misleading and exaggerated claims.Several readers in Texas reported receiving suspicious text messages purportedly from the O’Rourke campaign. The messages claimed that the campaign was looking for volunteers to drive undocumented immigrants to the polls.But reporting by The Times revealed that the texts were actually sent by an impostor, who volunteered for Mr. O’Rourke’s campaign under false pretenses and was given access to the campaign’s texting software.Supporters of Andrew Gillum, the Democrat running for governor of Florida, also reported receiving suspicious text messages claiming that Mr. Gillum was under an “active criminal investigation,” along with other negative messages. These messages were not labeled with the name of a sponsoring organization or campaign.In recent days, readers also submitted many examples of misleading texts that appeared to be from President Trump. One Indiana resident submitted a text claiming that the recipient’s early ballot had not been received. The texts, which have reportedly been sent to residents of several states, appear to be part of a Republican get-out-the-vote operation.Many readers submitted examples of what could be called “attack pages” — social media pages labeled with the name and picture of a candidate, but actually operated by a group backing the candidate’s opponent. These pages are then used to buy ads opposing the candidate whose picture appears on the page, usually with a mocking nickname.The National Republican Senatorial Committee has started several Facebook pages mimicking Democratic candidates. A page called “The Real Heidi Heitkamp” was used to buy negative ads attacking the Democratic senator from North Dakota. “Millionaire Claire,” a page impersonating Senator Claire McCaskill, the Missouri Democrat, was also used as a vehicle to attack her and promote her Republican opponent, Josh Hawley. “Radical Kyrsten,” another page operated by the N.R.S.C., was used to go after Kyrsten Sinema, the Democrat running for Senate in Arizona.Democrats operated attack pages as well. For Our Future, a liberal PAC, sponsored an attack page for Mike DeWine, the Republican candidate for governor in Ohio. The page, called “The Real Mike DeWine,” was used to promote articles criticizing Mr. DeWine’s political record.Attack pages don’t technically violate Facebook’s rules, since they are labeled in fine print with the name of the sponsoring organization. But they can be confusing to the casual Facebook user scrolling through his or her feed, which led many readers to submit their own examples.An earlier version of this article misidentified Thomas Jefferson's rival in the 1800 presidential election. It was John Adams, not James Madison.Kevin Roose is a columnist for Business Day and a writer-at-large for The New York Times Magazine. His column, “The Shift,” examines the intersection of technology, business, and culture.  @kevinroose • Facebook Advertisement"}