{"id": "Herbert London, Conservative Savant and Social Critic, Dies at 79", "paragraph": "Supported byBy Sam RobertsHerbert London, a self-described “New York liberal mugged by reality” who was transformed into an eloquent and consistently conservative academic, social critic and political candidate, died on Saturday in Manhattan. He was 79.The cause was complications of heart failure, his wife, Vicki London said.A 6-foot-5 former scholastic basketball star and incipient pop singer, Dr. London later was a founding dean of the innovative Gallatin School for Individualized Study at New York University and a prolific voice for scholarly think tanks. He interrupted his career to seek elective office in New York State.In 1989, Dr. London briefly sought the Republican mayoral nomination in New York City. In 1990, denied the party’s nomination for governor by the economist Pierre Rinfret, he persevered as the Conservative Party candidate.Mr. Rinfret not only went on to lose to the Democratic incumbent, Mario M. Cuomo; he also barely managed to place second ahead of Dr. London, by less than one percentage point, or about 38,000 votes, of 1.7 million cast.Dr. London’s four-year campaign for the 1994 Republican nomination for governor ended in defeat when party leaders awarded him a consolation prize: their blessing for state comptroller. He lost that November to H. Carl McCall, a Democrat, who became the first black candidate elected to statewide office in New York.Dr. London was the president of the Hudson Institute, a conservative research group in Washington, from 1997 to 2011; a senior fellow at the Center for the American University at the Manhattan Institute; chairman of the National Association of Scholars; and founder of the London Center for Policy Research.He wrote some 30 books, most recently “Leading from Behind: The Obama Doctrine and the U.S. Retreat from International Affairs” (2017, with Bryan Griffin), three plays and uncountable essays and articles.He was also a television host — of CNN’s “Crossfire” for about a year (as a co-host) and of the series “Myths That Rule America,” on NBC (based on a book of his by the same title, written with Albert L. Weeks), and “The American Character,” on CBS.A defender of Israel and advocate of a robust United States military, Dr. London generally supported President Trump or gave him the benefit of any doubts.Herbert Ira London was born in Brighton Beach, Brooklyn, on March 6, 1939, a grandson of Jewish immigrants from Eastern Europe. His father, Jack, a lapsed socialist, sold fabric, leather and vinyl for upholstery. His mother, Esta (Epstein) London, was a homemaker. He once described his upbringing as “Jewish Calvinist.”“I always think about my dad because I think there are a lot of people like my father who could never understand why there were a growing number of people in our society who were feeding out of the public trough,” he told The New York Times in 1994. “He paid his taxes and never derived any benefits from government. That’s why I refer to him as the quintessential forgotten New Yorker.”Dr. London was raised in Forest Hills, Queens, and graduated from Jamaica High School, where a teacher instilled in him a lifelong habit of writing at least one page a day. He helped lead the school’s basketball team to a city championship in 1955. Years later, he recalled a game in which he had scored 19 points by the end of the first quarter, with his team leading by 20.“I felt confident of breaking the school scoring record and perhaps the city record as well, but to my dismay the coach took me out of the game,” Dr. London wrote in 2012 on mindingthecampus.org. “I was furious. Yet in retrospect, he was right. Had I broken the school record, it would have come at the expense of a marginal team. Moreover, it would have embarrassed the other players. My coach understood what I did not.”He went on to Columbia College on a basketball scholarship and made the starting team. There, originally enrolled in a pre-med curriculum, he was transformed by a course in contemporary civilization and humanities. Influenced by the professors Jacques Barzun, Samuel Huntington and Daniel Bell, he pivoted toward an academic career.“My thoughts strayed from the hardwood to dusty stacks in Butler Library,” he recalled in a memoir, “Diary of a Dean” (2010).After graduating from Columbia in 1960 with a bachelor’s degree in social studies, he was drafted by the Syracuse Nationals of the National Basketball League (the franchise later moved to Philadelphia to become the 76ers), but knee injuries kept him from joining the team.An early devotee of rock ’n’ roll who had already made a demo, he recorded the single “We’re Not Going Steady” while a college student in 1959. (The flip side, possibly foreshadowing his political bent, was titled “Hey Red.”)Dr. London described the song’s lyrics as “bubble gum.”“We’re not going steady because we’re never alone,” he sang at one point. “I can’t even love you, love you on the telephone.”A memorial to those who lost their lives in 2018But the record helped pay for his higher education.He earned a master’s degree in education from Teachers College at Columbia; taught for a year in what he called “a high school for spoiled kids” in Syosset, on Long Island; earned a doctorate at New York University, where his thesis was on nativism in New York; won a Fulbright scholarship to Australia; and returned to N.Y.U. to teach in 1967.His marriage to Joy Weinman ended in divorce. He married Vicki Pops in 1976. In addition to her, he is survived by two daughters from his first marriage, Stacy London and Nancy London Vondrasek; and a daughter, Jaclyn, from his second marriage.Dr. London said he was “radicalized” by the political climate of the late 1960s and 1970s — but in the opposite direction of his students who veered left. On campus, he resented that teenagers whose parents were paying him to teach were lolling in Washington Square Park protesting or experimenting with drugs.When James M. Hester, the university president, told graduating students in 1971 that they were “prepared to solve the issues of war and peace, income disparity and urban woe,” Dr. London demurred, and didn’t hesitate to tell Dr. Hester directly.“It was silly to make claims of the kind he did when you cannot be certain these students ever read a serious book,” Dr. London said.At his prompting, N.Y.U. established its Gallatin Division, what it called a “University Without Walls.” (It later became the Gallatin School of Individualzed Study.) Dr. London was its dean from its inception in 1972 until 1992, when he was named John M. Olin professor of the humanities. He became professor emeritus in 2005.Dr. London, who had been enrolled as a Democrat until 1978, briefly ran in the Republican mayoral primary in 1989, but bowed out and endorsed Ronald S. Lauder against Rudolph W. Giuliani, who won the primary but lost the election that year. He was a Republican district leader in Manhattan before running statewide as a Conservative in 1990.He insisted that his cash-strapped campaigns were not quixotic, and edging Mr. Rinfret that November would have delivered a stunning rebuke to the dwindling number of “Rockefeller Republicans” who believed that his unequivocal anti-abortion stance would alienate moderate voters.In the 1994 campaign against Mr. McCall, the interim incumbent, Dr. London was accused of divisive and racist tactics, linking his opponent to groups or people who espoused anti-Semitism. He cited Mr. McCall’s stock holdings in the parent of WLIB, the black-owned radio station that was criticized for letting callers make anti-Jewish remarks.For all the attacks he leveled against his Democratic opponent, he also wasn’t shy about criticizing his Republican running mate for governor, George E. Pataki. Neither attack stuck. In New York, Dr. London was the only Republican statewide candidate to lose that year.Advertisement"}