{"id": "Mother Is Charged in Death of Boy Swept Away by Hurricane Floodwaters", "paragraph": "Supported byBy Tyler PagerAs Hurricane Florence took the lives of more than 40 people across the Carolinas and Virginia in September, the death of 1-year-old Kaiden Lee-Welch stood out as especially tragic.His mother, Dazia Lee, 20, had tearfully recounted to reporters what had happened: When floodwaters overwhelmed her vehicle and shoved it off the road, she managed to free her son from his car seat and get out, only to have him slip from her hands in the torrent. His body was found the next day, wedged between a car bumper and a tree.“I did everything I could as a parent to save him and protect him,” Ms. Lee told reporters at the time.But Ms. Lee had driven around a barricade and onto a road that the authorities had closed because of flooding. As a result, the sheriff’s office of Union County, N.C., charged her on Monday with involuntary manslaughter, which could carry a sentence of 13 to 16 months in prison.“The tragic death of this child and the circumstances surrounding this case are heartbreaking,” the sheriff, Eddie Cathey, said in a statement. “We continue to pray for all those suffering as a result of this child’s death. However, after a very thorough investigation and taking all facts into consideration and applying the law, we feel that these charges are appropriate.”Ms. Lee also faces a misdemeanor charge of driving on a closed highway.South Carolina authorities are still investigating a similar deadly incident in that state during the storm. Two women seeking mental health treatment were being transported in a van driven by sheriff’s deputies to hospitals away from the coast when the deputies drove around a barricade and onto a closed road. When the van became trapped in floodwaters, the deputies managed to escape but were unable to free the women, Nicolette Green, 43, and Wendy Newton, 45, who drowned.The Horry County Sheriff’s office fired the two deputies, Stephen Flood and Joshua Bishop, last week.Scott Bellamy, a lawyer representing Ms. Green’s family, said the family was satisfied with the dismissal of the deputies, but still planned to pursue a civil suit once the state investigation is completed.“The biggest thing is, they would like to see changes in how we here in South Carolina transport and treat mentally ill people,” Mr. Bellamy said, adding that the women were transported in the same vehicle as would be used for “a murderer and a rapist.”The chairman of the State Senate’s committee on corrections and penology, Shane Martin, said on Monday that he was appointing a subcommittee to study the issue.Follow Tyler Pager on Twitter: @tylerpager.Advertisement"}