{"id": "Pregnant wife gives CPR to husband in cardiac arrest day before giving birth", "paragraph": "The Goette family in Minnesota was eagerly awaiting the birth of their first child, when just days before Ashley brought that new life into the world, she had to save her husband's life.\"I noticed he was not snoring, he was gasping for air,\" said Ashley Goette. \"I called 911.\" Her husband Andrew was in full cardiac arrest. Ashley had never performed CPR and wasn't sure she was up to it.\"They wanted me to get him down to a hard surface but I explained to them I was pregnant,\" she said.But the dispatcher led her through it, until the paramedics arrived. Andrew Goette had been deprived of oxygen long enough that he could have severe brain damage —  if he survived at all. He was placed in a medically induced coma. But the following day, he opened his eyes.\"I don't think Andrew would be here today if it wasn't for the actions of Ashley,\" said Dr. Alex Teeters, with United Hospital in Saint Paul.Ashley Goette gave her husband CPR one day before giving birth to their baby.Andrew would soon witness the birth of his son, in another emergency procedure. \"I was just so excited to be able to see him be born,\" he said. \"To be able to hold him right away, first actually.\"\"He is coming home and that is all that matters,\" Ashley said.It's a double reminder that life is a gift — joyous and fragile.Jeff Glor has reported all over the world for CBS News since 2007. He was named anchor of the \"CBS Evening News with Jeff Glor\" in 2017.\n\"That first kiss being CPR was obviously very magical because here I am and im very grateful that I'm able to experience further kisses\"\n\"I just kind of push myself,\" Ava Blaser said. \"[Dancing] gives me something to look forward to, like during treatment\"Watch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}