{"id": "Riding the waves of Nazaré with Garrett McNamara", "paragraph": "A place in Portugal offers chances to surf record-breaking waves. One world-class surfer tells Anderson Cooper what those waves are likeEvery once in a while we come across a story of people trying to push the limits of what human beings can do. Athletes competing not just against each other, but against mother nature herself. When we first met a surfer named Garrett McNamara six years ago he had just set a world record for riding the biggest wave anyone ever had. Surfers from around the world have been trying to break McNamara's record ever since. As you're about to see someone finally has. Each winter big wave surfers bring their boards and their bravery to an unlikely spot where the waves can get as tall as buildings. It's not in Hawaii or Australia, it's off the coast of Portugal, in an ancient town called Nazaré, where Garrett McNamara first had the ride of his life.The giant waves appear off Nazaré every winter, just as they have for thousands of years. Few surfers knew about this place until 2011 when Garrett McNamara was towed into this 78-foot wave by a Jet Ski. He had a camera mounted on his surfboard, and one on the shore, recording him as he got into place, let go of the tow rope and began his record-setting ride.Garrett McNamara: I didn't realize it was that big of a wave until it came down from above and just boom right on my shoulders and it almost squashed me. I almost collapsed.Anderson Cooper: It's hard for people who have not ridden a 78-foot wave to understand what it feels like, the power of that wave. How do you describe it?Garrett McNamara: A lot of us have snowboarded or skied. Just imagine going as fast as you go down a mountain and then imagine hitting some ice, maybe some moguls. And then imagine an avalanche coming down after you. Then imagine not trying to run away from it, trying to stay as close as possible to it the whole time. And-- and have it ch-- chasing you and now the mountain's moving and-- and not just the avalanche, but the whole mountain is moving. That's what it's like riding these giant waves.Anderson Cooper: It sounds terrifying.Garrett McNamara: For the average person, could easily be hell.If you haven't figured it out by now, Garrett McNamara is not your average person. He started focusing on big waves in the mid 90's, attracted by the challenge and the rush of adrenaline he got riding them. Before setting the world record he'd already made a name for himself with some incredible rides and some epic wipeouts.Garrett McNamara: I broke ribs, three different times. Broke feet, hurt this knee, back, stitches from head to toe.Anderson Cooper: How many times you been stitched up?Garrett McNamara: I don't know, at-- at least a hundred if not more. And-- and I-- I've stopped going to the doctor, I just use Crazy Glue now, so I just—Anderson Cooper: You-- what?Garrett McNamara: Yeah. Yeah. I Crazy Glue everything. If I can Crazy Glue it, it's getting Crazy Glued. If you put it perfectly back together and put some Crazy Glue on it done. And back in the water that day.McNamara first surfed the waters off Nazaré, Portugal in 2010.  Anderson Cooper: What did people think of you here?Garrett McNamara: I know in the beginning they thought I was absolutely crazy…A local resident had emailed him this picture of a wave, hoping to attract surfers and boost the local economy.  For generations, Nazaré was known as a sleepy fishing village. It was only the town's fishermen who braved these treacherous waters. Hundreds have drowned within sight of their loved ones on shore.When we first came here in 2012, there weren't many surfers riding these monster waves. Today, thanks in large part to Garrett McNamara, the water is now crowded with them. And onshore throngs of spectators gather around a 100-year-old lighthouse to watch the incredible rides and dangerous falls.Garrett McNamara: It's-- like Waterworld. Like-- dog fight for waves now. It's really funny.Anderson Cooper: People are competing for waves.Garrett McNamara: Yeah, competing, fighting. Yeah, full on.Anderson Cooper: Surfers wanna challenge themselves here in Nazaré.Garrett McNamara: This is-- the proving ground when it comes to a team. Much more about teamwork here. You need somebody with a Jet Ski to watch over you. And once it gets over 60 feet, everybody's challenging themself and their skills here.Anderson Cooper: It's dangerous even for the Jet Skiers.Garrett McNamara: Oh, the-- it's-- almost more dangerous because you got this big machine, all a sudden-- if a wave lands on you and you're stuck with the machine.Last November, McNamara was riding a Jet Ski, towing his friend, British surfer Andrew Cotton into this massive wave in Nazaré. It didn't go as planned.Garrett McNamara: This thing literally exploded like a bomb. And he flew into mid-air like a cannonball. He was a human cannonball.Cotton was in the wrong spot on the wave, and had to jump off his board. He disappeared momentarily before being thrown forward like a rag doll. He landed hard on the water and broke his back.Andrew Cotton: The shock went through my back. It-- it was like hitting concrete.Cotton was rescued and brought onto the beach. He spent months recovering, but is already back in Nazaré surfing once again.Andrew Cotton: As wipeouts go, it wasn't really that bad.Anderson Cooper: Dude, you broke your back. I mean--Andrew Cotton: Yeah, but it was-- it was an impact. And-- and the thing is, is-- is the-- the amazing thing about Nazaré is you never know what you're gonna get.That's what makes Nazaré so exciting. The same day Andrew Cotton got hurt, a Brazilian surfer named Rodrigo Koxa caught the ride of his life, on this wave that some observers thought might have broken Garrett McNamara's record.And just a few months later, another Brazilian surfer, Maya Gabeira set a new women's world record, on a wave that measured 68 feet.Anderson Cooper: Who do you think will be the next surfer to set a world record here?Andrew Cotton: There's a lot of capable people to set the next world record.We wanted to see these world-famous waves up-close, so we rigged McNamara's Jet Ski with three mini-cameras and attached another to the end of a stick I could easily carry.  We also placed three cameras with high powered zoom lenses on the cliffs overlooking where the waves break and hired another cameraman, Jorge Leal, to follow us.With eight cameras rolling and two Jet Skis, we took off from the harbor in Nazaré. Anderson Cooper: So this is the area you try to surf in?Garrett McNamara: Yeah.We hoped to see for ourselves just how powerful and dangerous the waves here are. Anderson Cooper: I'm good.Garrett McNamara:  Come right on up, hold on tight. We had no idea what we were in for.Garrett McNamara: Woo Hoo! Look at that!McNamara considered these waves relatively tame. They were only 20 to 30 feet high.Garrett McNamara: Wow, look at the rainbow! Rainbow! Look at that! Holy Moly! That's amazing. Now it's time to hold on.It's not just the wind and the current that makes the waves here so massive; it's the existence of an underwater canyon.  At its deepest point, the canyon is nearly three times the depth of the Grand Canyon. It starts about 100 miles off shore and runs nearly all the way onto shore.Garrett McNamara: All this energy and it funnels in like a V, so all this energy it comes down the canyon, and as soon as it hits a shallow point,  kaboom!Getting hit with all that energy is according to McNamara part of the joy of big wave surfing. On this wave in Nazaré, he ditched his board to prevent it from hitting him.  You can see McNamara as a little speck on the lip of the wave.   This is the view from the camera on his board.  Garrett McNamara: A lip lands on me. I get obliterated. And I'm under forever. And I was just-- loving every bit of it. It was amazing.Anderson Cooper: The way you say, \"Obliterated,\" it's sort of blissful and sort-- it's a little weird. What's the enjoyment of getting obliterated, of getting wiped out?Garrett McNamara: I think it's-- you're-- just out-- there's-- out of control. Like, when you're riding a wave, you-- still in control somewhat. You're at the mercy of the wave, but you can choose your path and your destiny. When you're underwater getting pounded, you are at the mercy of the ocean. You're like a grain of sand in the washing machine on spin cycle, going all different directions. And--Anderson Cooper: And that loss of control is…you feel alive.Garrett McNamara: Feel alive.But two years ago McNamara's desire to feel alive, nearly cost him his life. It was in the Northern California surf spot known as Mavericks when he attempted to catch this wave which he thinks was 50-60 feet high.Garrett McNamara: I was in the perfect spot, paddled, stood up, thought I had it. And right when I hit, I was going so fast, it-- just-- broke my-- shattered my head, nine pieces.Anderson Cooper: The-Garrett McNamara: Humeru-- the humerus head shattered in nine pieces and broke the shaft off the head, where it lodged itself in my pec. It was--Anderson Cooper: Wait a minute. The bone lodged in your pec.McNamara was rescued by a rider on a Jet Ski, and loaded into an ambulance.Anderson Cooper: When you went to see a doctor, what did they say?Garrett McNamara: The doctor-- they-- said I may ne-- might never surf again.Garrett McNamaraAt home in Hawaii, his recovery was slow and excruciating. McNamara's shoulder had to be surgically reconstructed, with nine screws and a metal plate. He was bedridden for months.Garrett McNamara: I wanted to die. That's how bad the pain was.His wife Nicole helped him through his rehabilitation, which took more than a year.McNamara is 51 now and he and Nicole live in Portugal during the winter with their son.He still feels the pain in his shoulder when he paddles. But he's back on the water and says he is a different person than he was before the accident.Garrett McNamara: You know the main thing it did is took the monkey off my back.Anderson Cooper: What do you mean?Garrett McNamara: I used to have to ride every single swell everywhere in the world, if I had the ability to get there, or I was on suicide watch.Anderson Cooper: You were always looking for the biggest wave.Garrett McNamara: Biggest, best, perfect. And now, the monkey jumped off. I can-- I can be sittin' at home in Hawaii and see the biggest swell of the year coming here and be so happy and just say, \"No, I'm happy right here.\"Anderson Cooper: It sounds like at 50, one of the biggest daredevils out there is growing up.Garrett McNamara: I don't wanna say I'm growing up, but I definitely feel content.That may be just as well.  Remember that wave Brazilian Rodrigo Koxa caught last November? After the World Surf League analyzed video and photographs they declared it was 80 feet tall. Two feet taller than Garrett McNamara's record-setting wave.McNamara says he couldn't be happier for Koxa and for Nazaré which remains in the record books. He may have lost his world record, but that same month he gained something much more important, a baby daughter. Her middle name is Nazaré. Produced by Keith Sharman. Associate producers, Alex J. Diamond and Erin Horan.Anderson Cooper, anchor of CNN's \"Anderson Cooper 360,\" has contributed to 60 Minutes since 2006. His exceptional reporting on big news events has earned Cooper a reputation as one of television's pre-eminent newsmen.April 15, 2018\nSteve Kroft investigates Allegiant Air, a discount carrier known more for its ultra-low fares than its high record of in-flight breakdownsOctober 15, 2018\nLesley Stahl speaks with President Trump about a wide range of topics in his first 60 Minutes interview since taking officeMarch 11, 2018\nThe secretary of education has been one of the most criticized members of President Trump's Cabinet, but DeVos says she's \"more misunderstood than anything\"October 1, 2018\nIn his first profile on 60 Minutes, McCartney walks down memory lane while looking through old pictures and videos and talks about how he still feels the need to prove himsel...March 27, 2018\nMost people can't pronounce his name, but he's one of the best players in the NBA. And he has quite the story about how he got thereMarch 18, 2018\nA group of survivors of the shooting at Stoneman Douglas High School who refer to themselves as the \"mass-shooting generation\" have made it their mission to bring about gun r...March 11, 2018\nDesperation and fear are driving a dangerous industry that's virtually impossible to completely stopMarch 11, 2018\nOprah Winfrey reports on how trauma plays a role in childhood development and what new methods are being used to help kids who have experienced itMarch 11, 2018\nThe horses of an Argentine polo club may look normal, but the way they came into existence is anything but conventionalFebruary 11, 2018\nA bill passing through Congress could change the way states recognize concealed carry permitsCopyright © 2018 CBS Interactive Inc.All rights reserved."}