{"id": "How The Milk Carton Kids found their sound", "paragraph": "Joey Ryan and Kenneth Pattengale, known as folk duo The Milk Carton Kids, have been together since 2011. Before then, both were pursuing solo careers, but something happened when they sang together.  \"For me, the striking thing about the first time we played together, even though it's just two acoustic guitars and two voices singing together, was that it felt complete,\" Ryan said. \"Physically, the way that our voices blended in the air happened in a way where I had just never had that experience with another person,\" Pattengale said.  So, they abandoned their solo careers. The Milk Carton Kids got their big break in Avatar Studios, when producer T Bone Burnett asked them to be part of \"Another Day, Another Time,\" a concert that celebrated the music of the Joel and Ethan Coen film, \"Inside Llewyn Davis.\" \"So we showed up and we walked into Avatar Studios for rehearsals. And there's Joel and Ethan, and Marcus Mumford and all the Punch Brothers, and Joan Baez sitting in Studio A downstairs. And we walked in and T Bone said, 'Ok, get out your guitars. Let's see what song you might play,'\" Ryan recalled. \"And they've got this beautiful footage of us performing this song and they pan over, and there's Marcus Mumford and a tear comes down his cheek … and then when it ran on Showtime for a long time it made a big difference in our career.\"Their next big break came when they were cast in the HBO show \"Vinyl\" as England Dan and John Ford Coley, who Ryan said had a big influence on their music.  \"I had a lot of fun with it. We got to wear mustaches. My hair was straightened,\" Ryan said.  \"The most noteworthy part of that experience was the day after our episode aired, they cancelled the series,\" Pattengale joked. A folksy sense of humor to go along with their folksy sound. \nCBS News correspondent is joining Gayle King, Norah O'Donnell and John Dickerson\nWe only use about 1 percent of available crops to fuel our diets\n\"We took it very, very seriously, to be funny\"Watch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}