{"id": "Recipe: Salted Caramel Tot Cookies", "paragraph": "Salted Caramel Tot Cookies.Dan Whalen, the man behind \"The Food in My Beard\" blog, says, \"When you hand someone a tot cookie and tell them what it is, they might think they misheard you. You can actually see them puzzling over it. \"What did you say?\" they might ask. \"A tot cookie,\" you will reply. They might be hesitant to try it. After the first bite though, their hesitation will melt away and they will come back for more. These tot cookies are amazing: crunchy, chewy, salty, and sweet.\"Salted Caramel Tot CookiesMakes 24 cookiesIngredients:20 frozen tots3 cups sifted all-purpose flour1 teaspoon baking powder1/2 teaspoon baking soda1 teaspoon kosher salt1 1/4 cups (2 1/2 sticks) unsalted butter, at room temperature1 cup light or dark brown sugar1/2 cup sugar2 large eggs2 teaspoons pure vanilla extract1 cup caramel bits (or chopped caramels)1 cup semisweet chocolate chipsNonstick cooking spray, for coating the baking sheetInstructions: Preheat the oven to 450°F. Lightly coat a rimmed baking sheet with cooking spray.Place the tots in a microwave-safe bowl and microwave on high, pausing occasionally to stir, until defrosted, about 2 minutes. Mash up the tots until they are fully broken up. Spread the tot pieces onto the prepared baking sheet. Bake, stirring every 10 minutes or so, until all the tot bits are browned up and very crispy, about 25 minutes total. (Make sure to break up any bigger chunks each time you stir.) Transfer to a plate and let cool.Reduce the oven temperature to 350°F. Line the baking sheet with parchment paper.Stir together the flour, baking powder, baking soda, and salt in a large bowl.Beat the butter and sugars together in large bowl with an electric mixer on medium-high speed, until the mixture lightens in color and is fluffy, about 4 minutes. Add the eggs and beat until incorporated. Beat in the vanilla.Pour the butter mixture into the flour mixture and beat on medium speed until combined. Using a wooden spoon, stir in the caramel, chocolate, and tot pieces until combined.Scoop the dough in heaping tablespoon portions onto the prepared baking sheet, spacing them about 3 inches apart.Bake until the cookies are pale golden all over and crispy at the edges (they will be chewy and delicious in the centers), about 12 minutes.Salted Caramel Tot Cookies will keep, in an airtight container at room temperature, for 4 to 5 days.      Recipe from \"Tots!: 50 Tot-ally Awesome Recipes from Totchos to Sweet Po-tot-o Pie\" by Dan Whalen (Workman), in Trade Paperback and eBook formats, available via Amazon     For more info:    For more recipes from \"Sunday Morning\" visit the 2018 \"Food Issue\" Recipe Index \nA look back at the esteemed personalities who've left us this year, who touched us with their innovation, creativity and humanity\nRaised in Lisbon, the artist (real name Alexandre Farto) uses not a delicate brush, but drills and jackhammers to create arresting, very large-scale piecesWatch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}