{"id": "California firefighters battle dry conditions, relentless winds to contain deadly wildfires", "paragraph": "CALABASAS, Calif. — More than 3,000 firefighters have been waging an all-out attack on the Woolsey Fire, on land and from the air. But the raging flames have burned almost 150 square miles, threatened tens of thousands of structures and it's not even close to being contained. \"We've got a massive air support going on because as you can see, the terrain here is very rugged and steep,\" said Cal Fire Capt. Richard Cordova. \"What the firefighters have to be worried about is rolling material coming down this way and starting a fire below them.\"Aftermath of the Woolsey Fire in California.After the air support moves through, the hand crews move in and clear vegetation by hand.\"They're out there with no hoses, they're out there just with hand tools removing this brush,\" Cordova said.CBS News saw choppers working nonstop to create a fire line to try and prevent the flames from jumping or going even further. \"CBS Evening News\" anchor Jeff Glor with Cal Fire.\"The super scoopers drop water. They're a great resource for this area because as you can tell the ocean is right next to this fire, so they're able to go to the Pacific Ocean, pick up water and come back at a very short time frame,\" Cordova explained. California is a tinderbox with bone-dry conditions and relentless Santa Ana winds that have helped the fire race along the coast. Firefighters have been struggling to catch up, and the weather forecast shows dire conditions the next few days. With near 40 mile per hour gusts expected, the fire could spread rapidly. Jeff Glor has reported all over the world for CBS News since 2007. He was named anchor of the \"CBS Evening News with Jeff Glor\" in 2017.\n\"That first kiss being CPR was obviously very magical because here I am and im very grateful that I'm able to experience further kisses\"\n\"I just kind of push myself,\" Ava Blaser said. \"[Dancing] gives me something to look forward to, like during treatment\"Watch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}