{"id": "\n\nCBS News Logo\nProgressive Dems back off \"Abolish ICE\" at first meeting since midterms", "paragraph": "Some of the most prominent progressive members of Congress are backing off the idea they'll focus on abolishing the Immigration and Customs Enforcement (ICE) agency, a proposal many of them pushed during the midterm campaign. At the Congressional Progressive Caucus' first press conference since Democrats won control of the House, leaders fielded questions about whether they would continue to push legislation to get rid of ICE. \"We are absolutely still going to be pressing that,\" said Democratic Rep. Mark Pocan of Wisconsin, the caucus co-chair. \"However, I think our main goal of getting out of the gate is going to be the issues that we ran on across all districts — around healthcare, around good-paying jobs, around dealing with the culture of corruption.\"Pocan, who in July released a statement saying ICE must be abolished, added, \"I still think many of us still have issues of immigration reform as a very, very high priority.\" The slogan \"Abolish ICE\" became both a rallying cry and a lightning rod during the 2018 election cycle for the far left across the country.Rep.-elect Alexandria Ocasio-Cortez, D-N.Y., was standing with Progressive Caucus leaders at Monday's press conference. She helped popularize the idea during her successful insurgent campaign. Ocasio-Cortez, who identifies herself as a democratic socialist, unseated 10-term incumbent Joe Crowley during the Democratic primary.Several other representatives-elect who also called for the abolition of ICE, including Ayanna Pressley of Massachusetts and Ilhan Omar of Minnesota, also attended the news conference.Members of the Congressional Progressive Caucus speak to reporters on Capitol Hill on Monday, Nov. 12, 2018.Pocan and two fellow Progressive Caucus leaders introduced legislation over the summer aimed at scrapping the agency. One of the lawmakers who introduced the legislation, Rep. Pramila Jayapal of Washington, took issue with the attention paid to the \"Abolish Ice\" slogan and wondered whether any of the assembled reporters had read her bill, which she said focuses on reforming the immigration system. \"I would really love it if all of you would read the bill and if you would report on what was in the bill and how we propose building immigration that is humane, where enforcement is transparent, saves taxpayers dollars, and is effective,\" Jayapal said.In July, Jayapal's office issued a press release about the bill with the headline, \"Members of Congress Introduce Legislation to Terminate ICE and Transfer Critical Functions to Other Agencies.\" Later Monday, Jayapal told reporters she had \"never used\" the \"Abolish ICE\" slogan. She said progressives \"need to stop taking the president's frame for this issue.\"  \"ICE is the agency that is not accountable, humane and transparent and effective. So I think that this agency as it exists is not doing a good job for us. That doesn't mean we are getting rid of enforcement overall, and I just think there's a real distinction between abolishing an agency and abolishing the function. And it would be great for people to just think about that,\" Jayapal told CBS News.After the legislation was introduced over the summer, House Republicans tried to force a vote on the bill in an apparent effort to put Democrats on the record on abolishing ICE. The progressives responded by saying they would vote down their own bill and called the move a \"political stunt,\" according to The Hill. The bill has not been considered on the floor.\nIt was a night of historic firsts, big wins for both parties\nThe sticker features both Virginia and the American flagCopyright © 2018 CBS Interactive Inc.All rights reserved."}