{"id": "California's Camp Fire burned hot enough to melt aluminum in cars", "paragraph": "PARADISE, Calif. — In northern California, apocalyptic images are revealing entire lives incinerated in a matter of minutes. Four days have passed since the raging Camp Fire first ripped through the retirement community of Paradise and beyond, burning at a rate of 30 football fields per minute and hot enough to melt car parts. Downed PG&E power lines, combined with high winds, are believed to have sparked the fire.One mobile home park was obliterated by the wildfire. Crews are now searching through tons of rubble and bringing in cadaver dogs. With more than 200 people still unaccounted for, families who are desperate for answers are posting pictures of their loved ones online and on message boards at shelters.\"In some cases the remains we are recovering are nothing but ash and bone,\" said Kory Honea, the Butte County sheriff.Leveled residences line a mobile home park on Edgewood Lane after the Camp Fire burned through Paradise, California, on Saturday, Nov. 10, 2018.State DNA experts are helping identify victims with chaplains and hearses nearby as bodies are found. Thousands of homes have been destroyed, including those of dozens of firefighters who continue to battle on the front lines to save other homes. The Camp Fire has ravaged more than 113,000 acres and destroyed more than 6,000 homes.One man, Ed Gleason, didn't evacuate, and his house was one was of the few still standing today. But at least seven people died in their cars as they tried to evacuate. The blaze was so hot that aluminum wheels on vehicles melted.Molten aluminum flowed from a car that burned in front of one of at least 20 homes destroyed just on Windermere Drive in the Point Dume area of Malibu, California, Saturday, Nov. 10, 2018.Darrell Wilken, a registered nurse, is thankful to be alive. He drove right through the towering inferno with three of his elderly patients as they fled Paradise.\"Everywhere the cars were on fire and I didn't see anybody walking and all I could think of is there were people in those cars,\" Wilken said. It took more than three hours to get through hell.\"I'm still shaking. Every time I talk about it,\" he said.\n                                            Dozens have died and thousands of homes destroyed as flames burn through communities in Butte, Ventura and Los Angeles Counties\n                                    Mireya Villarreal is a CBS News correspondent.\n\"That first kiss being CPR was obviously very magical because here I am and im very grateful that I'm able to experience further kisses\"\n\"I just kind of push myself,\" Ava Blaser said. \"[Dancing] gives me something to look forward to, like during treatment\"Watch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}