{"id": "\n\nCBS News Logo\nMattis calls for ceasefire in Yemen within 30 days", "paragraph": "Defense Secretary Jim Mattis looks on during a press conference after a meeting with French Defence Minister at the French Defence ministry in Paris on Oct. 2, 2018.Secretary of Defense James Mattis called for a ceasefire in war-torn Yemen within the next 30 days during a discussion at the U.S. Institute of Peace (USIP) on Tuesday. Mattis told former Bush national security adviser Stephen Hadley that \"only way we're going to really solve this\" conflict is with a ceasefire within the next month.Yemen's civil war, which pits a U.S.-backed, Saudi-led coalition against Houthi rebels supported by Iran, has devastated the Middle Eastern country since its outbreak in 2015. In August, the U.N. issued a report accusing the Saudi-led coalition of carrying out attacks on weddings and schools. Last week, the U.N. said the country was on the brink of famine. Mattis said in his talk with USIP that the U.S. is still providing logistical support and \"certain information\" to the coalition. But he said that the parties involved needed to work towards a long-term solution to end the conflict.\"The longer-term solution, and by longer-term, I mean 30 days from now, we want to see everybody sitting around the table, based on a ceasefire, based on a pullback from the  border, and then based on ceasing dropping of bombs, that will permit the [U.N.] special envoy — Martin Griffiths, who's very good, he knows what he's doing — to get them together in Sweden and end this war,\" Mattis said. The U.S. has been criticized for its financial and diplomatic support of Saudi Arabia, particularly since the death of journalist Jamal Khashoggi at the Saudi consulate in Turkey earlier this month. Mattis said he considered Khashoggi's death and the conflict in Yemen separate issues.\"We've got to move toward a peace effort here and we can't say we're going to be doing this sometime in the future. We need to be doing this in the next 30 days,\" he said.Grace Segers is a politics reporter for CBS News Digital.\nIt was a night of historic firsts, big wins for both parties\nThe sticker features both Virginia and the American flagCopyright © 2018 CBS Interactive Inc.All rights reserved."}