{"id": "Beto O'Rourke says he won't run for president in 2020", "paragraph": "60 Minutes asks Sen. Ted Cruz and Congressman Beto O'Rourke whether they might face off again in 2020 — in a race for the White HouseIn the video above, correspondent Jon Wertheim asks Senator Ted Cruz and Congressman Beto O'Rourke about their possible plans for higher office beyond 2018. Below is a transcript. For 60 Minutes' full report on the Senate race in Texas, click here.JON WERTHEIM: You share the others seem to have that this race may have a rematch. And it may not be the in Texas Senate. That we may be witnessing two future presidential candidates here.TED CRUZ: Look, who knows? I-- I-- I do think Congressman O'Rourke has his eyes set on Iowa and New Hampshire. He--JON WERTHEIM: You?TED CRUZ: --all-- all-- clearly lookin' forward to that. Now, but listen, I'm-- I'm-- you know-- you know, that-- that there's the old line about glass houses. So I've-- I've run for Senate and then run for president. And I-- you know, if he wants to do that, that's-- he can do that. JON WERTHEIM: We've heard a lotta people speculate that you and Sen. Cruz may face each other again, not in a Senate rematch but running for a higher office. What are your thoughts on-- on running for president?BETO O'ROURKE: I don't wanna do it. I will not do it. Amy and I are raisin' an 11-year-old, a 10-year-old and a 7-year-old. And we spent the better part of the last two years not with each other, missing birthdays and anniversaries and time together. And we-- we-- our-- our family could not survive more of that. We, we need to be together. JON WERTHEIM: Is that reversible? You're saying you'll, you'll never run for president?BETO O'ROURKE: I'm saying that if elected to the Senate, I'll serve every day of that six-year term, that I'm not lookin' at 2020. And, and, in fact, am completely ruling that out, not going to do that.JON WERTHEIM: No matter what? Win or lose you're not gonna run--BETO O'ROURKE: Win or lose--JON WERTHEIM: --in 2020?BETO\" O'ROURKE: Win or lose, I'm not-- I'm not running in, in 2020. I gotta tell you, it's incredibly flattering that anyone would ask me the question or that that's even up for discussion. But, but since people have asked, the answer's no.JON WERTHEIM: You didn't sidestep that.BETO O'ROURKE: No.October 28, 2018\nHow did a faithful assistant become a moral objector? For Siobhan O'Connor, the process was gradual — but soon became imperativeOctober 28, 2018\nHolly Williams returns to Raqqa, Syria to report what it looks like when a so-called caliphate crumblesSeptember 30, 2018\nThe Beatle also talks about worrying, songwriting, and how even his famous bandmate was insecureOctober 12, 2018\n60 Minutes cameraman Mark LaGanga explains what happened as he filmed this week's story on wildlife photographer Joel SartoreOctober 14, 2018\nLesley Stahl talks about sparring with the president and the changes she's seen in Donald Trump over the course of three interviewsOctober 7, 2018\nThe best-selling author and YouTube star wants to \"decrease world suck.\" Here's why millions of teenagers are helping him do itMarch 18, 2018\nTeenage activists explain why shootings like the one at their school are not \"inevitable\" -- and not really about school safetyMarch 14, 2018\nIn 2003 the renowned physicist appeared on 60 Minutes in celebration of his 60th birthday—a milestone he never thought he'd reachMarch 11, 2018\nThe mayor of New Orleans took down a monument to the Confederate general. Who asked him to do it? One of the city's most famous musicians: Wynton MarsalisCopyright © 2018 CBS Interactive Inc.All rights reserved."}