{"id": "1.4 million Americans lost their water service recently", "paragraph": "OKLAHOMA CITY —  Water service was cut off to an estimated 1.4 million people living in more than a half-million American households. They got behind on their bills two years ago, as some struggled to keep up with rising costs and governments didn't do enough to help, a group contends in a first-of-its-kind study released Wednesday. Food & Water Watch, a Washington-based nonprofit that advocates for affordable and safe food and water for everyone, made public requests for 2016 residential shut-off records from the two biggest water suppliers in each state and received the information from 73 of them. It found that among the cities with the highest shut-off rates, where at least 10 percent of residential customers lost their water service for some period of time, were Detroit; New Orleans; Springdale, Arkansas; and Oklahoma's two largest cities, Oklahoma City and Tulsa. Poor people and cities with large minority populations frequently had higher shut-off rates, the study found. Report author Mary Grant noted that some poor households in New Orleans and Detroit that year paid more than $1,000 for water service, which amounted to about 9 percent of their household incomes. \"Nine percent of your income just for your basic water service. That's, by any measure, unaffordable,\" Grant said. Jaime Moten, 41, of Oklahoma City, said her water was shut off for three days in 2016 after she lost her job as a grocery store manager. Relatives provided water that she and her children used to drink and brush their teeth, and the Salvation Army paid the $202 needed to turn her water back on. \"I was ashamed for a long time,\" Moten said. \"You feel like you're sneaking water.\" Oklahoma City was listed as No. 1 for cut-off rates in the report, with about 23 percent of customers losing water in 2016. But Jennifer McClintock, a spokeswoman for the Oklahoma City Utilities Department, said after providing the group with its figures, the utility realized it had also included commercial accounts and that the number of residential cutoffs in the city would have been closer to 26,500.  That lower figure would still amount to about 14 percent of its residential customers there and would place Oklahoma City among the cities with the highest shut-off rates. Tulsa ranked second on Food & Water Watch's list, with some 20 percent of its residential customers experiencing water shut-offs. That city's water and sewer manager, Eric Lee, welcomed Food & Water Watch's report, saying it's an issue that needs to be addressed. \"I appreciate that this is actually happening,\" Lee said. \"I don't think any city has solved that problem yet.\" A 2017 Michigan State University study that was funded by the National Science Foundation found that if water rates continue to climb as projected, nearly 36 percent of U.S. households will be unable to pay their bills by 2022. Among the reasons rates are going up quickly are aging infrastructure, climate change and declining populations. The Food & Water Watch report calls on the federal government to invest more to repair aging systems and calls on state governments to require all water utilities to report their shut-off numbers. The group said local governments are closest to the customers and are best placed to make substantive improvements. Philadelphia had a 5 percent shut-off rate in 2016, which the report rated as average. But the nonprofit praises a program the city started last year that sets a cap on water bills for low-income households. \"Local governments can make those policy decisions to be more lenient,\" Grant said. \"They're small changes that can make a big difference in people's lives.\" Some communities, including Eau Claire, Wisconsin, and Leominster, Massachusetts, had zero-percent shut-off rates because they don't allow water service to be cut. Instead they place tax liens on properties that fall behind on bills, but Food & Water Watch considers that punitive for people who are too poor to pay for water. Oklahoma City's utilities department, like those in many other cities, asks customers to voluntarily pay extra on their monthly bills to help other customers who can't pay for their own water. The roughly $35,000 a year that customers contribute is then dispersed to the needy by The Salvation Army. The Salvation Army's social services director, Dee Watts, said that money paid monthly water bills for about 250 families in the past year, which was a drop in the bucket considering the cut-off rate was at least 1,000 times greater. Watts said reasons people can't pay vary widely, from losing a job to lack of knowledge about personal finance. \"Some people had always lived in apartments, the water bill was paid as part of their rent,\" Watts said, \"and now they have their own home and didn't take into account the cost of a monthly water bill.\" \nA decade after the Great Recession, the U.S. economy still hasn't made up the ground it lost\nThe top-paying jobs tend to cluster in two industries -- and may prove less vulnerable automationQuotes delayed at least 15 minutes. Market data provided by ICE Data Services.\n            ICE Limitations.\n            Powered and implemented by FactSet.Legal Statement.Copyright © 2018 CBS Interactive Inc.All rights reserved."}