{"id": "America today: Training kids to be first responders", "paragraph": "\"Stop the Bleed\" is a campaign to teach civilians — including school-age kids — to come to the rescue of people injured in accidents and shootingsFollowing the shooting at Sandy Hook Elementary School, a program called \"Stop the Bleed\" began to teach civilians how to administer first-aid after a shooting. Some of those being trained aren't even teenagers yet.In the clip above, Broward County Medical Director Dr. Peter Antevy tells 60 Minutes his 12-year-old son was so afraid of returning to school following the Parkland shooting that Antevy decided to help him by training him on how to stop bleeding. \"My first instinct was, 'He needs a bleeding kit,'\" Antevy said.For more on 60 Minutes' report on the lethality of the AR-15 style rifle, click here.October 28, 2018\nHow did a faithful assistant become a moral objector? For Siobhan O'Connor, the process was gradual — but soon became imperativeOctober 28, 2018\nHolly Williams returns to Raqqa, Syria to report what it looks like when a so-called caliphate crumblesSeptember 30, 2018\nThe Beatle also talks about worrying, songwriting, and how even his famous bandmate was insecureOctober 12, 2018\n60 Minutes cameraman Mark LaGanga explains what happened as he filmed this week's story on wildlife photographer Joel SartoreOctober 14, 2018\nLesley Stahl talks about sparring with the president and the changes she's seen in Donald Trump over the course of three interviewsOctober 7, 2018\nThe best-selling author and YouTube star wants to \"decrease world suck.\" Here's why millions of teenagers are helping him do itMarch 18, 2018\nTeenage activists explain why shootings like the one at their school are not \"inevitable\" -- and not really about school safetyMarch 14, 2018\nIn 2003 the renowned physicist appeared on 60 Minutes in celebration of his 60th birthday—a milestone he never thought he'd reachMarch 11, 2018\nThe mayor of New Orleans took down a monument to the Confederate general. Who asked him to do it? One of the city's most famous musicians: Wynton MarsalisCopyright © 2018 CBS Interactive Inc.All rights reserved."}