{"id": "Learning how to \"Stop the Bleed\"", "paragraph": "Ballistics tests show how lethal a wound from an AR-15 style rifle can be. Now there's a campaign to teach civilians how to be first responders in mass shootingsA Pittsburgh synagogue, a Florida high school, a Texas church, a Las Vegas concert, a Connecticut elementary school. These are the locations of some of the deadliest mass shootings in America in recent history, and they all have something in common: The style of weapon used at each horrific scene was the AR-15 semiautomatic rifle.  This week on 60 Minutes, correspondent Scott Pelley reports on what the weapon does to the human body, why it's different from the wounds created by a handgun—injury from an AR-15 style rifle round is potentially lethal.Because handguns wound and kill more people than AR-15 style rifles, first responders and emergency room doctors are used to treating injuries sustained from a handgun shot.But most emergency rooms haven't had to treat victims who've been shot with an AR-15 style rifle.\"It is a whole different kind of injury,\" 60 Minutes producer Ashley Velie tells 60 Minutes Overtime's Ann Silvio in the video above. \"When you're hit with an AR-15 bullet, most people die fairly quickly from bleeding out.\"To get a perspective on how an AR-15 bullet differs from a 9-millimeter bullet, the 60 Minutes team spoke to Don Deyo, a former paramedic and Green Beret who witnessed mass casualties up close on the battlefield. He demonstrated the difference in bullets by shooting rounds into a cut of pork that's similar in size to an average adult human thigh. At first glance, the two rounds looked similar, both leaving an entry wound that's nothing more than a tiny hole in the flesh.But flip the pork over, and the difference is stunning. The 9-millimeter exit wound was small, without much damage to the surrounding area. The AR-15 exit wound left an enormous, gaping hole and shattered the surrounding bone. Those bone fragments, Deyo explained, become projectiles that create further tissue damage.   On the broadcast, Pelley speaks with Cynthia Bir, a professor of research surgery at the University of Southern California. Bir also compared the damage done by the two types of bullets in her ballistics lab, where she uses state-of-the-art FBI issued gelatin blocs to represent human soft tissues.\"There's going to be a lot more damage to the tissues, both bones, organs, whatever gets kind of even near this bullet path,\" Bir tells Pelley. \"The bones aren't going to just break; they're going to shatter. Organs aren't just going to tear or have bruises on them; they're going to be, parts of them are going to be destroyed.\"After an AR-15 style rifle bullet blasts a large cavity through soft tissue, blood pressure then pumps that cavity with blood, causing many victims of AR-15 shots to bleed out before rescue workers can reach them.As a result, some doctors are now pushing for everyday people to learn how to stop that bleeding before first responders arrive. Following the shooting at Sandy Hook Elementary School, where 20 first-graders and six educators were killed with AR-15 rounds, a campaign called \"Stop the Bleed\" began nationwide. The movement is an effort to train civilians how to be a kind of first responder in life-threatening scenarios, such as mass shootings.  In Florida, Broward County Medical Director Dr. Peter Antevy holds \"Stop the Bleed\" classes. He teaches basic techniques of bleeding control, including applying a tourniquet, packing a wound with gauze, and holding pressure over a wound. He's even given his 12-year-old son a bleeding kit—a package that includes items like tourniquets, gauze, and a chest seal—and taught him how to use it.\"We have to have the general public understand that they are the first line of defense,\" Antevy says. \"And every city, every community in this country needs to roll out those bleeding kits, or these active killer kits… And every child has to learn how to do it.\"The \"Stop the Bleed\" campaign is an initiative of the American College of Surgeons, the Committee on Trauma, and the Hartford Consensus. You can learn more about it and purchase a bleeding control kit at BleedingControl.orgTo watch how to use a Stop the Bleed kit, click here.  To watch Scott Pelley's report about high-velocity rounds from AR-15 style rifles, click here.The video above was produced by Ann Silvio and Lisa Orlando. It was edited by Lisa Orlando. October 28, 2018\nHow did a faithful assistant become a moral objector? For Siobhan O'Connor, the process was gradual — but soon became imperativeOctober 28, 2018\nHolly Williams returns to Raqqa, Syria to report what it looks like when a so-called caliphate crumblesSeptember 30, 2018\nThe Beatle also talks about worrying, songwriting, and how even his famous bandmate was insecureOctober 12, 2018\n60 Minutes cameraman Mark LaGanga explains what happened as he filmed this week's story on wildlife photographer Joel SartoreOctober 14, 2018\nLesley Stahl talks about sparring with the president and the changes she's seen in Donald Trump over the course of three interviewsOctober 7, 2018\nThe best-selling author and YouTube star wants to \"decrease world suck.\" Here's why millions of teenagers are helping him do itMarch 18, 2018\nTeenage activists explain why shootings like the one at their school are not \"inevitable\" -- and not really about school safetyMarch 14, 2018\nIn 2003 the renowned physicist appeared on 60 Minutes in celebration of his 60th birthday—a milestone he never thought he'd reachMarch 11, 2018\nThe mayor of New Orleans took down a monument to the Confederate general. Who asked him to do it? One of the city's most famous musicians: Wynton MarsalisCopyright © 2018 CBS Interactive Inc.All rights reserved."}