{"id": "\n\nCBS News Logo\nSaudi Arabia's account of Jamal Khashoggi's killing is widely denounced", "paragraph": "ISTANBUL — Turkey will \"never allow a cover-up\" of the killing of Saudi journalist Jamal Khashoggi in Saudi Arabia's consulate in Istanbul, a senior official in Turkey's ruling party said Saturday. The statement reflected international skepticism over the Saudi account that the writer died during a \"fistfight.\" The comment was one of many critical reactions to the Saudi Arabia's announcement of the writer's violent death, indicating the kingdom's efforts to defuse a scandal that has gripped the world were falling short. President Trump, however, was an exception. Asked whether he thought the Saudi explanation was credible, he replied: \"I do. I do.\" Despite widespread outrage over the killing of the columnist for The Washington Post, it is unclear to what extent the top leadership of Saudi Arabia, a key U.S. ally and a powerful player in a volatile region, would be held accountable for what human rights activists describe as an extrajudicial killing by Saudi agents. The only way to find out what happened would be through an international investigation led by a U.N.-appointed panel, the editorial board of The Washington Post said.Saudi Arabia's \"latest version asks us to believe that Mr. Khashoggi died after becoming engaged in a \"brawl\" with officials who had been sent to meet him. His body, Saudi officials told several journalists, was handed over to a \"local collaborator\" for disposal,\" it said, while also criticizing Mr. Trump for allegedly trying to help top Saudi leaders escape \"meaningful accountability.\" Saudi Arabia said 18 Saudi suspects were in custody and intelligence officials had been fired. But critics believe the complex scheme that led to Khashoggi's death could not have occurred without the knowledge of Mohammed bin Salman, the 33-year-old crown prince whose early promises of sweeping reform are being eclipsed by concerns that he is an impulsive, even sinister figure. The Saudi narrative of Khashoggi's death, alleged to have occurred in a brawl following discussions with visiting officials in the consulate, contrasts with Turkish pro-government media reports that a Saudi hit squad, including an autopsy expert, traveled to Istanbul to kill Khashoggi and dispose of his body, which has not yet been found. \"It's not possible for the Saudi administration to wiggle itself out of this crime if it's confirmed,\" said Numan Kurtulmus, deputy head of Turkey's Justice and Development Party. He also said Turkey would share its evidence of Khashoggi's killing with the world and that a \"conclusive result\" of the investigation is close. Another Turkish ruling party official also criticized Saudi Arabia, saying the kingdom should have given its explanation \"before the situation reached this point.\" The official, Leyla Sahin Usta, said it would have been \"more valuable\" if Saudi officials had earlier admitted that Khashoggi was killed in its diplomatic post. Saudi Arabia initially denied any knowledge of the disappearance of Khashoggi, who disappeared after entering its consulate. The overnight admission that the writer died in the consulate came in Saudi state media more than two weeks after Khashoggi, 59, entered the building for paperwork required to marry his Turkish fiancée and never came out. The kingdom has described assertions in Turkish media leaks, based on purported audio recordings that Khashoggi was tortured, killed and dismembered inside the consulate, as \"baseless.\" In firing officials close to Prince Mohammed, Saudi Arabia stopped short of implicating the heir-apparent of the world's largest oil exporter. King Salman, his father, appointed him to lead a committee that will restructure the kingdom's intelligence services after Khashoggi's slaying. No major decisions in Saudi Arabia are made outside of the ultraconservative kingdom's ruling Al Saud family. Khashoggi, a prominent journalist and royal court insider for decades in Saudi Arabia, had written columns critical of Prince Mohammed and the kingdom's direction while living in self-imposed exile in the U.S. \"God have mercy on you my love Jamal, and may you rest in Paradise,\" Khashoggi's fiancée, Hatice Cengiz, tweeted following the Saudi announcements. U.N. Secretary-General Antonio Guterres \"stresses the need for a prompt, thorough and transparent investigation into the circumstances of Mr. Khashoggi's death and full accountability for those responsible,\" spokesman Stephane Dujarric said. Standing outside the Saudi consulate in Istanbul, the head of a media group said the \"authority that gave the orders\" in the killing of Khashoggi should be punished. Turan Kislakci, president of the Turkish Arab Media Association, said Khashoggi was \"slaughtered by bloody murderers\" and that his group wants \"true justice\" for its slain colleague. White House press secretary Sarah Huckabee Sanders said the U.S. will advocate for justice in the Khashoggi case that is \"timely, transparent and in accordance with all due process.\" Mr. Trump has called the Saudi announcement a \"good first step,\" but said what happened to Khashoggi was \"unacceptable.\" The Saudi announcements about Khashoggi came in statements carried by the state-run Saudi Press Agency early Saturday. \"Preliminary investigations conducted by the Public Prosecution showed that the suspects had traveled to Istanbul to meet with the citizen Jamal Khashoggi as there were indications of the possibility of his returning back to the country,\" the statement read. \"Discussions took place with the citizen Jamal Khashoggi during his presence in the consulate of the kingdom in Istanbul by the suspects (that) did not go as required and developed in a negative way, leading to a fistfight. The brawl led to his death and their attempt to conceal and hide what happened.\" There's been no indication Khashoggi had any immediate plans to return to the kingdom. The Saudi statements, which expressed regret and promised accountability, did not identify the 18 Saudis being held by authorities and did not explain how so many people could have been involved in a fistfight.The kingdom at the same time announced the firing of four top intelligence officials, including Maj. Gen. Ahmed bin Hassan Assiri, a one-time spokesman for the Saudi military's campaign in Yemen who later became a confidant of Prince Mohammed.Saud Qahtani, a powerful adviser to the prince, also was fired. Qahtani had led Saudi efforts to isolate Qatar amid a boycott of the country by the kingdom and three other Arab nations as part of a political dispute.On Twitter, where Qahtani had launched vitriolic attacks against those he saw as the kingdom's enemies, he thanked the Saudi government for the opportunity to serve. \"I will remain a loyal servant to my country for all times,\" he wrote.\nBest-selling author of books like \"The Fault in Our Stars,\" opens up about exploring his fears through his writing\nThe U.S. saw a 3.4 percent uptick in violent crime in 2016, though rates remain near historic lows. See which cities fared worst\nIn the year since Hurricane Maria hit Puerto Rico, the island has lost a precious resource: hundreds of thousands of people who've left to build their futures elsewhere\n\n\n\nCopyright © 2018 CBS Interactive Inc.All rights reserved."}