{"id": "\n\nCBS News Logo\nWho is George Soros and why is he blamed in so many right-wing conspiracy theories?", "paragraph": "Last\n          Updated Oct 24, 2018 11:47 PM EDTA day before apparent explosive devices were mailed to top Democratic politicians and CNN's New York office, one figure on the left was the first target: George Soros.  Police said a device sent to Soros' New York home \"had the components\" of a bomb. The package appeared to be sent by the same person who mailed similar devices to the CNN New York newsroom and the homes of Hillary Clinton and former President Barack Obama. The CNN device was addressed to former CIA Director John Brennan, and another package intended for former Attorney General Eric Holder was rerouted to the \"return address,\" the office of former DNC chair Debbie Wasserman Schultz.  The device sent to Soros arrived just a day after he appeared in the headlines for another reason: a vice president of Campbell Soup alleged without evidence on Twitter that Soros' philanthropic group, the Open Society Foundations, planned the caravan of thousands of Central American migrants that is heading toward the U.S. border. (\"Neither Mr. Soros nor Open Society is funding this effort,\" the organization said.)  And that tweet came a few weeks after President Trump tweeted, also without evidence, that Soros was funding the protesters urging senators to vote against Brett Kavanaugh's Supreme Court nomination.  The very rude elevator screamers are paid professionals only looking to make Senators look bad. Don’t fall for it! Also, look at all of the professionally made identical signs. Paid for by Soros and others. These are not signs made in the basement from love! #TroublemakersThese are all just the latest reminders that, for some on the right, Soros remains the world's biggest boogeyman. For more than a decade, he has been somehow blamed for just about every scandal, controversy and protest associated with the left. NFL protests? The Parkland students? The Women's March? If it's in the news and ruffling the right, someone on the internet is blaming Soros for it — whether or not any facts support that.  But why does this keep happening? How did Soros become a perpetual target of political opponents and conspiracy theorists, and what is his true role in America's politics?  Soros is among the 100 richest people in the world, with an estimated net worth of more than $8 billion. He has donated much of the fortune he earned working in finance to Open Society Foundations, a nonprofit that financially supports democracy and human rights causes in more than 100 countries.  George SorosSoros was a born to an upper middle-class Jewish family in Budapest and survived the Nazi occupation of Hungary. Soros moved to England after World War II and studied at the London School of Economics, where he was a student of philosopher Karl Popper, whose book \"The Open Society and its Enemies\" inspired the name of Soros' foundation.  Soros made his fortune through investments and hedge funds on Wall Street and in Europe. His foundation, which was originally called the Open Society Fund, started in 1979 funding scholarships for black students in apartheid-era South Africa. It soon focused on promoting democracy in formerly communist Eastern European countries, including his native Hungary.   Once the U.S.S.R. collapsed in 1991, Soros saw it as an opportunity to build institutions for democracies in countries once ruled by communism. That year, he founded Central European University, a school in Budapest aimed at promoting democratization and international cooperation.   At the time, Soros was known as a global mega-donor, but he didn't have a large political profile. That soon would change — not entirely for the best.  Soros gained more mainstream recognition in the early '90s, but with that came the notoriety and wild accusations that hang over him to this day.   Nationalist politicians in Eastern Europe reviled his plans for promoting democracy there. Meanwhile, in 1992, Soros was one of the investors who bet against the British pound before it was withdrawn from the European Exchange Rate Mechanism. The pound's collapse earned Soros more than $1 billion, and a reputation as the man who \"broke\" the Bank of England.  All of these factors formed central themes behind most Soros conspiracy theories: The beliefs that he is secretly pulling the strings of nations and financial markets, and has a sinister intent behind his worldwide donations.   This is when the condemnation of Soros turned particularly ugly, often infused with blatant anti-Semitism. Hungarian populist Istvan Csurka called Soros a puppet of \"Jerusalem.\" Slovakian President Jan Slota accused Soros of sending \"dirty money.\" The president of Malaysia implied that Soros was involved in a Jewish plot to wreck the country's economy.   But the Soros scorn hit a fever pitch in the early 2000s, once he become more involved in American politics — specifically, opposing President George W. Bush. He compared the Bush administration to \"the Nazi and communist regimes,\" saying Bush had \"improve(d) on the techniques\" of governing by fear, and he spent more than $27 million unsuccessfully opposing Bush's 2004 reelection.  The conservative movement responded by unleashing fury on Soros, and he became a constant target for Fox News and other right-wing commentators. Bill O'Reilly ran a 10-minute segment to Soros, calling him \"an extremist\" and \"off-the-charts dangerous,\" accusing of him funding \"propaganda\" and manipulating liberal politics with his fortune. Glenn Beck devoted a two-hour special to exposing Soros as a supposed \"puppet master.\" Those narratives have remained constant ever since. Rush Limbaugh said Soros was \"pulling the marionette strings\" of President Barack Obama. During the 2016 campaign, when Soros contributed more than $25 million to Hillary Clinton and other Democratic candidates, InfoWars host Alex Jones called Soros \"evil\" and accused him of running a \"Jewish mafia\" and trying to overthrow the government. Donald Trump Jr. and Roseanne Barr are among those who've shared tweets suggesting Soros was actually a Nazi himself. (He wasn't.)  An analysis by Vocativ last year found that between June 2016 and March 2017, conservative news organizations — including Breitbart and InfoWars — had mentioned Soros 7,983 times, compared to 2,473 mentions in other outlets. Many of the stories about Soros' political influence are based in fact but overstate his influence on events happening now. For example, Fox News reported in March 2017 that Soros had donated $246 million to backers of the \"Day Without A Woman\" protest. But the study on which the story is based explained those donations went to 100 of the protest's 544 partner organizations, and that was over a 15-year period ending in 2015.  The vitriol directed at Soros has continued in 2018, especially as the midterms approach. A spokesman for Soros, Michael Vachon, did not comment when reached by CBS News. But he did send a \"media-monitoring\" list he composed, keeping track of news stories about false conspiracy theories of Soros influencing Kavanaugh's confirmation process. It contained 20 stories, all published in just 10 days.Correction: The Campbell Soup employee who alleged a conspiracy theory about Soros supporting the immigration caravan was a vice president at the company, not the vice president.\nBest-selling author of books like \"The Fault in Our Stars,\" opens up about exploring his fears through his writing\nThe U.S. saw a 3.4 percent uptick in violent crime in 2016, though rates remain near historic lows. See which cities fared worst\nIn the year since Hurricane Maria hit Puerto Rico, the island has lost a precious resource: hundreds of thousands of people who've left to build their futures elsewhereWatch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}