{"id": "Recipe: Tots-giving Stuffing", "paragraph": "Tots-giving Stuffing.From Dan Whalen, the man behind \"The Food in My Beard\" blog, comes a natural bread replacement in a twist on a classic stuffing.\"When creating this recipe, I was inspired by a meat stuffing that my grandmother used to make that was loaded with potatoes,\" Whalen writes. \"It's a fun and delicious addition to any Thanksgiving or Friendsgiving table, and as a bonus, it's a bread-free version of stuffing that most everyone can enjoy!\"Tots-giving StuffingServes: 10Ingredients:1 pound sweet Italian sausage, removed from the casings1 cup diced onion1 cup diced carrot1 cup diced celery1 garlic clove, mincedPinch of dried rosemary leavesPinch of dried sage leaves½ cup chopped fresh Italian (flat-leaf) parsley leaves2 pounds frozen tots (about 90 tots)2 cups chicken stock2 large eggs½ cup potato flakes (instant mashed potatoes)Instructions: Preheat oven to 350°F.Place the sausage in a large frying pan over high heat and cook, stirring occasionally to break up the meat, until the sausage is browned and cooked through, about 10 minutes. Transfer the sausage to a large bowl and drain all but 2 tablespoons of the fat in the pan. Add the onion, carrot and celery to the pan and cook over medium heat until softened, about 10 minutes. Add the garlic, rosemary and sage and cook, stirring often, until the garlic is fragrant and lightly golden, about 2 minutes. Add the onion mixture to the sausage in the bowl. Add the parsley and the frozen tots and stir gently to combine. In another bowl, whisk together the stock, eggs and potato flakes to incorporate. Add this mixture to the sausage mixture and stir well. Pour the stuffing mixture into a 9x13-inch baking dish and bake until heated through and crispy on top, about 45 minutes. Serve hot. Note: Tots-giving Stuffing will keep, covered in the refrigerator, for four days. Reheat it in a 350°F oven uintil warmed through.       Recipe from \"Tots!: 50 Tot-ally Awesome Recipes from Totchos to Sweet Po-tot-o Pie\" by Dan Whalen (Workman), in Trade Paperback and eBook formats, available via Amazon     For more info:    For more recipes from \"Sunday Morning\" visit the 2018 \"Food Issue\" Recipe Index  \nA look back at the esteemed personalities who've left us this year, who touched us with their innovation, creativity and humanity\nRaised in Lisbon, the artist (real name Alexandre Farto) uses not a delicate brush, but drills and jackhammers to create arresting, very large-scale piecesWatch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}