{"id": "\n\nCBS News Logo\nGeorgia town evacuates after rail cars fall from overpass", "paragraph": "This photo provided by Montezuma police shows a train derailment on Saturday, Nov. 17, 2018 in Byromville, Ga. Last\n          Updated Nov 17, 2018 5:05 PM ESTBYROMVILLE, Ga. — Rail cars tumbled from an overpass onto a Georgia highway on Saturday, causing an evacuation and traffic headaches in a small town. The trains contained non-odorous propane, which spilled into the roadway, CBS Macon affiliate WMAZ-TV reports.There were no injuries reported. CSX Railroad said 30 cars derailed. That included some that fell from the overpass onto Highway 90 at Byromville, roughly 55 miles south of Macon.Resident Stephanie Chapman said she was on a deer stand more than a mile from town when it happened.\"You could hear the rail cars hitting each other — boom-boom-boom-boom-boom,\" Chapman told The Associated Press.It happened around 7 a.m. Saturday in the town with a population of about 500.In an emailed news release, CSX said four of the cars held petroleum liquefied gas. No leaks were reported, but officials were monitoring air quality.Byromville fire chief Brett Walls told WMAZ-TV there was an early call for an evacuation within a mile of the site. \"If you know the town of Byromville, that's practically the whole town,\" he said.  Chapman said that, initially, an evacuation was called for much of the town but the perimeter was soon reduced. She was allowed to go to her office roughly 300 yards from the site by midday while efforts continued to clear the jumble of cars from Highway 90.\"Crews are working to re-rail the cars without damage and remove the derailed railcars with damage from the area as quickly and safely as possible,\" the CSX statement said.\nBest-selling author of books like \"The Fault in Our Stars,\" opens up about exploring his fears through his writing\nThe U.S. saw a 3.4 percent uptick in violent crime in 2016, though rates remain near historic lows. See which cities fared worst\nIn the year since Hurricane Maria hit Puerto Rico, the island has lost a precious resource: hundreds of thousands of people who've left to build their futures elsewhere\n\n\n\nCopyright © 2018 CBS Interactive Inc.All rights reserved."}