{"id": "Families share devastating impact of rare polio-like illness acute flaccid myelitis", "paragraph": "A rare but potentially paralyzing illness called acute flaccid myelitis, or AFM, has parents on alert. The Centers for Disease Control and Prevention says AFM has spread to 24 states with 72 confirmed cases, including 10 new ones. Camdyn Carr, 4, is just one child impacted by the illness. A photo of Camdyn taken on Aug. 30 shows he had a sinus infection. But within 72 hours, he was paralyzed. \"My son died on that Tuesday,\" his father Chris said. \"He coded.\"Fortunately, doctors revived Camdyn. Now he is at the Kennedy Krieger Institute in Baltimore for intensive therapy. But acute flaccid myelitis has ravaged his body, and he has a tube to help him breathe, with only slight movement in one hand and one foot. Camdyn Carr.\"I do have hope for these kids,\" said Rebecca Martin, who manages the rehabilitation center. \"They make slow incremental progress and they really can change their function level with the right kind of therapy like we provide.\"That's a road Christa Bottomley and her 6-old-son Sebastian know well. Two years ago when AFM cases last peaked, Sebastian's cold turned into the polio-like illness and caused almost complete paralysis. But after 2,000 hours of rehabilitation, he can get dressed by himself, feed himself and stand. But learning to walk again has been a slow, grueling process.\"Occasionally he says things like, 'Mom, why can't I just walk like everybody else does without all this work?' And I said well, 'You know, God knows that you were strong enough to handle this,'\" said Bottomley.Sebastian Bottomley has been undergoing therapy after getting AFM.In an interview with \"CBS This Morning\" co-host John Dickerson, CDC director Dr. Robert Redfield said the agency still doesn't know what's causing the polio-like illness, but it \"doesn't appear to be transmissible from human to human.\" Dr. Jonathan LaPook is the chief medical correspondent for the CBS Evening News. Follow him on Twitter at @DrLaPook\n\"That first kiss being CPR was obviously very magical because here I am and im very grateful that I'm able to experience further kisses\"\n\"I just kind of push myself,\" Ava Blaser said. \"[Dancing] gives me something to look forward to, like during treatment\"Watch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}