{"id": "Meet Swayze Valentine, the UFC's only cutwoman", "paragraph": "Swayze Valentine is used to being the lone female in a profession dominated by men. She is the only cutwoman in the UFC – the elite in mixed martial arts. \"I think to myself, 'I'm not gonna let anyone make me feel like I don't deserve to be here.' Bottom line,\" Valentine told \"CBS This Morning: Saturday\" co-host Dana Jacobson.Her job as a cutwoman is to protect a fighters hands before a bout then to stop any bleeding once it's underway. \"I have 45 seconds or less to get that fighter to the next round. Because if for any reason a doctor comes in and calls it and says, 'Hey, he is not good enough to fight or she's not good enough to fight,' It's on me,\" Valentine said. When Valentine decided she had to be a part of MMA she knew she had to break down some gender stereotypes. She worked just a few days as a ring girl before she decided it wasn't for her. But it was there in the cage that Swayze found what she could do. \"I walked out and that's where I saw, like, all the fighters and the coaches. And the fighters are getting their hands wrapped. And I'm like, 'You know what, there's no greater honor in this sport than to be the person to wrap that fighter's hands,'\" Valentine said. Knowing the what but not the how, Swayze googled \"MMA hand wraps\" and found videos from legendary cutman Jacob \"Stitch\" Duran. From determined to confident, Valentine slowly started building her career in the amateur ranks, adding gyms and fighters all while balancing two kids as a single mom.   \"You know, it took a lot of years, a lot of free time. This definitely isn't a job that you do for the money. I worked a lot of years for free. I was thinking, 'Okay, where can I go to really expand?' And I thought, Las Vegas.' It's the fight capital of the world,\" Swayze said.    But getting there from Washington state wasn't cheap. Valentine said she donated blood and plasma to save up money for the move – for a job that holds no promise of a big payday. She can't really explain why she kept going. Her gut was right and all that sacrifice did pay off when got that first call from the UFC.    \"It's really actually indescribable,\" Valentine said of what it's like inside the ring. \"You know, you just walk through these doors. I'm excited. I'm nervous. I get most comfortable when I finally sit down and get my sheet and it shows who I'm gonna wrap. And then I go in there and when I meet the fighter, I shake everyone's hand. And that, like, totally brings me down,\"  The bigger stage for Valentine is still not enough to pay the bills, so she works at her local post office six days a week comp and vacation time allows her to take off for UFC matches. She says her coworkers are sometimes worried about her, but overall supportive. That support is something she passes along simply by being that lone female face. \"Now I know, after being the first, that there are many more women following my path already. And I just hope that any little girl that sees that just shows that, 'Hey, you can achieve your dreams.' Whether it's you're the first or the 15th or the 30th. You do what you wanna do and love every second of it.\"\nCBS News correspondent is joining Gayle King, Norah O'Donnell and John Dickerson\nWe only use about 1 percent of available crops to fuel our diets\n\"We took it very, very seriously, to be funny\"Watch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}