{"id": "\n\nCBS News Logo\n2 dead in shooting at Kroger grocery store outside Louisville, Kentucky, police say", "paragraph": "Last\n          Updated Oct 24, 2018 6:11 PM EDTJEFFERSONTOWN, Ky. — Police say two people have been killed in a shooting at a grocery store on the outskirts of Louisville, Kentucky. The chief of the Jeffersontown Police Department said a suspect was detained following the shooting Wednesday afternoon.The shooting was reported just after 3 p.m. at the Kroger store in Jeffersontown, located on the eastern outskirts of Louisville.Police Chief Sam Rogers told reporters a suspect entered the store, encountered a man, fired multiple shots at him and left. The suspect then encountered a woman in the parking lot and shot her as well. Both victims were pronounced dead at the scene, Rogers said.Police said the shooter then exchanged fire with an armed citizen in the parking lot, but no one was injured in that exchange, reports CBS affiliate WKLY-TV. The suspect fled, but was apprehended a short distance away.A witness who is an emergency medical technician told the station he prepared to give aid to the woman, but then realized she was dead.\"Once they got the gentleman on the ground, I hollered at them and said, 'Look, I'm an EMT. Let me get out here and try to help this woman,'\" said the witness, Eric Deacon. \"So that's when I went, ran over, I get down. I'm getting ready to start CPR on her, and when I looked at her, I knew she was gone. There was nothing I could do.\"Rogers couldn't speak to a motive and said the shootings were apparently random.Witnesses inside the store told WLKY's Lauren Adams they took cover, fearing for their lives.In a statement released to CBS News, a Kroger spokeswoman said the company is \"shocked and saddened\" by the shooting.\"Thanks to the quick response of the local police department, the suspect was apprehended and our store is secure,\" the statement said.The statement said the store is closed and Kroger is cooperating with law enforcement.\nBest-selling author of books like \"The Fault in Our Stars,\" opens up about exploring his fears through his writing\nThe U.S. saw a 3.4 percent uptick in violent crime in 2016, though rates remain near historic lows. See which cities fared worst\nIn the year since Hurricane Maria hit Puerto Rico, the island has lost a precious resource: hundreds of thousands of people who've left to build their futures elsewhere\n\n\n\nCopyright © 2018 CBS Interactive Inc.All rights reserved."}