{"id": "Immunotherapy drug showing promise for aggressive type of breast cancer", "paragraph": "Scientists say a new treatment is showing promise in the fight against aggressive breast cancer. Three years ago, at age 39, Maribel Ramos was diagnosed with advanced breast cancer. The type was triple negative.\"I was angry and sad,\" Ramos said. \"Because I know that the triple negative is a type of cancer that is really hard to treat.\"Ten to 20 percent of breast cancers are called triple negative because they don't have receptors – such as ones for estrogen – that can be targeted by certain medications. Treatment options are limited, and these cancers tend to be more aggressive, with worse outcomes.   In 2016, Ramos entered a trial to test the immunotherapy drug Tecentriq on patients with advanced triple negative breast cancer. Maribel Ramos.The drug works by targeting proteins found on immune cells and some cancer cells. It's approved for bladder and one type of lung cancer.Dr. Sylvia Adams of NYU-Langone Health was one of the trial investigators. She says the new drug helps the immune system recognize the cancer.\"There are killer cells already in the cancer present and ready to fight, except that this cancer shields itself from the from the immune attack,\" Adams said. \"So this drug is now able to take the shield down and basically paves the way for your own immune response to kill the tumor.\"The trial, at hundreds of sites in 41 countries, followed 902 patients and found the combination of immunotherapy and chemotherapy improved overall survival by nearly four months, (3.7 months) and nearly 10 months for those patients whose tumors tested positive for the targeted protein.Immunotherapy drug Tecentriq.\"Hopefully this will actually improve the treatments for many other women with breast cancer as well,\" Adams said. \"The tumor was getting smaller,\" Ramos said. \"So every time, every four weeks it was getting smaller and smaller and I was so excited.\"\"The last scan from just last week that shows that she's still completely without any evidence of disease,\" Adams said.  Three years ago, Ramos worried she wouldn't see her oldest daughter graduate. In June, she did.Dr. Jonathan LaPook is the chief medical correspondent for the CBS Evening News. Follow him on Twitter at @DrLaPook\n\"That first kiss being CPR was obviously very magical because here I am and im very grateful that I'm able to experience further kisses\"\n\"I just kind of push myself,\" Ava Blaser said. \"[Dancing] gives me something to look forward to, like during treatment\"Watch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}