{"id": "What makes the AR-15 style rifle the weapon of choice for mass shooters?", "paragraph": "Some of the worst massacres in recent memory have had something in common: the AR-15 style rifle. Scott Pelley reports on why the high-velocity rounds used in the gun makes it so deadlyThe mass murder last week at the Pittsburgh Synagogue has something in common with the deadliest massacres: the AR-15 semi-automatic rifle. Variations of the AR-15 were used to kill at a Texas church, a Las Vegas concert, Marjorie Stoneman Douglas High School in Florida and Sandy Hook Elementary School. The AR-15 style rifle is the most popular rifle in America. There are well over 11 million, and they are rarely used in crime. Handguns kill far more people, but the AR-15 is the choice of our worst mass murderers. AR-15 ammunition travels up to three times the speed of sound. And tonight we're going to slow that down - so you can see why the AR-15's high-velocity ammo is the fear of every American emergency roomMass shootings were once so shocking they were impossible to forget. Now they've become so frequent it's hard to remember them all. Last Saturday, in the Pittsburgh Synagogue, 11 were killed, six wounded.Roses memorialize the people who died in the Sutherland Springs, Texas shootingFBI Special Agent Robert Jones: This is the most horrific scene I've seen in 22 years with the Federal Bureau of Investigations. Members of the Tree of Life Synagogue conducting a peaceful service in their place of worship were brutally murdered by a gunman targeting them simply because of their faith.Just 11 months before, it was a church in Sutherland Springs, Texas. Assistant fire chief Rusty Duncan was among the first to arrive.Rusty Duncan: 90 percent of the people in there were unrecognizable. You know the blood everywhere, I mean it just covered them from head to toe. They were shot in so many different places that you just couldn't make out who they were.The church is now a memorial to the 26 who were murdered.Rusty Duncan: I've never had the experience, not with any kind of weapon like this. For me to see the damage that it did was unbelievable, it was shattering concrete, I-- you know, you can only imagine what it does to a human body.Scott Pelley: The police estimate that he fired about 450 rounds.Rusty Duncan: Oh, I believe it. I saw the damage it did. I saw the holes in the church from one side to the other, all the pews, the concrete, the carpet, I saw it all.A gunshot wound is potentially fatal no matter what kind of ammunition is used. But Cynthia Bir showed us the difference in an AR-15 round against gelatin targets in her ballistics lab at the University of Southern California.Cynthia Bir with correspondent Scott PelleyCynthia Bir: Years of research have gone in to kind of what the makeup should be of this ordnance gelatin to really represent what damage you would see in your soft tissues.Scott Pelley: So this is a pretty accurate representation of what would happen to a human being?Cynthia Bir: Yeah, this is currently considered kind of the state of the art.This is a 9 millimeter bullet from a handgun, which we captured in slow motion. The handgun bullet traveled about 800 miles an hour. It sliced nearly straight all the way through the gel.Now look at the AR-15 round.Cynthia Bir: See the difference?Scott Pelley: Yes.It's three times faster and struck with more than twice the force. The shockwave of the AR-15 bullet blasted a large cavity in the gel unlike the bullet from the handgun.Scott Pelley: Wow. There's an enormous difference. You can see it right away.Cynthia Bir: Yeah, exactly. There are fragments in here. There's, kind of took a curve and came out. You can see a much larger area in terms of the fractures that are inside.Now watch from above. On top, the handgun, at bottom, the AR-15.Scott Pelley: It's just exploded.Cynthia Bir: It's exploded and it's tumbling. So what happens is, this particular round is designed to tumble and break apart.The 9 mm handgun round has a larger bullet, but this AR-15 round has more gunpowder, accelerating its velocity. Both the round and the rifle were designed in the 1950's for the military. The result was the M16 for our troops and the AR-15 for civilians.Cynthia Bir: There's going to be a lot more damage to the tissues, both bones, organs, whatever gets kind of even near this bullet path. The bones aren't going to just break, they're going to shatter. Organs aren't just going to tear or have bruises on them, they're going to be, parts of them are going to be destroyed.That fairly describes the wounds suffered by 29-year-old Joann Ward. At Sutherland Springs Baptist Church she was shot more than 20 times while covering her children. Ward was dead, her daughters mortally wounded, as assistant fire chief Rusty Duncan made his way from the back of the sanctuary.Rusty DuncanRusty Duncan: As I got a couple of rows up, Ryland's hand reached out from under his stepmom and grabbed my pant leg. I wouldn't even known he was alive until he did that. I didn't even see him under her. Well, that's where me and him made eye contact for the first time.Joann Ward's five-year-old stepson Ryland Ward was hit five times and was nearly gone when he reached trauma surgeon Lillian Liao at San Antonio's University Hospital.Scott Pelley: How much of Ryland's blood do you think was lost before he came to you?Lillian Liao: At least half.This is Ryland's ER X-ray.Lillian Liao: You see the two bullet fragments that are in him.Scott Pelley: The X-ray shows you the solid fragments of the shrapnel and the bullets, but it doesn't tell you much about the damage to the soft tissue.Lillian Liao: No, and it doesn't tell you what's on the inside. I mean a bomb went off on the inside. And our job is to go in there and clean it up.Scott Pelley: A bomb went off on the inside because of the shockwave from these high-velocity rounds.Lillian Liao: Correct.Ryland endured 24 surgeries to repair his arm, leg, pelvis, intestines, kidney, bladder and hip.Lillian Liao: At some point it's like putting Humpty Dumpty back together again.Scott Pelley: What do you mean?Lillian Liao: Well his organs are now in different pieces and you have to reconstruct them. The arm was missing soft tissue, skin, muscle and part of the nerves were damaged. The bowel has to be put back together some of the areas of injury has to heal itself so you can see that he can walk around like a normal child and behave as normal as possible.Lillian LiaoWith the AR-15, it's not just the speed of the bullet, but also how quickly hundreds of bullets can be fired. The AR-15 is not a fully automatic machine gun. It fires only one round with each pull of the trigger. But in Las Vegas last year, it sounded like a machine gun.A special add-on device called a bump stock allowed the killer to pull the trigger rapidly enough to kill 58 and wound 489. In other mass killings the AR-15 was fired without a bump stock, but even then, it can fire about 60 rounds a minute. Ammunition magazines that hold up to 100 rounds can be changed in about five seconds.Maddy Wilford: I remember hearing the gunshots go off and being so nervous and scared and all of the sudden I felt something hit me.Scott Pelley: You'd been shot how many times?Maddy Wilford: Four times.Scott Pelley: How many surgeries?Maddy Wilford: Three. For my arm, my stomach and my ribs and lung.Maddy WilfordLast February, 17-year-old Maddy Wilford was at school, Marjorie Stoneman Douglas High School in Parkland, Florida. 17 were murdered, 17 wounded.Maddy Wilford: And I just remember thinking to myself, there's no way, like, not me, please, not me. I don't wanna go yet.Laz Ojeda: Her vital signs were almost nonexistent. she looked like all the blood had gone out of her body. She was in a state of deep shock.Paramedic Laz Ojeda saved Maddy Wilford, in part, because Broward County EMS recently equipped itself for the battlefield wounds that the AR-15 inflicts.Laz Ojeda: We carry active-killer kits in our rescues.Scott Pelley: Active-killer kits?Laz Ojeda: Yes.Scott Pelley: What is that?Laz Ojeda: That is a kit that has five tourniquets, five decompression needles, five hemostatic agents, five emergency trauma dressings.Dr. Peter Antevy, Broward County Medical Director, told us today's wounds demand a new kind of training.Peter Antevy: If I take you through one of our ambulances or take you through our protocols, almost everything we do is based on what the military has taught us. We never used to carry tourniquets. We never used to carry chest seals. These were things that were done in the military for many, many years.Scott Pelley: When did all of that change?Peter Antevy: It really changed I think after Sandy Hook.After Sandy Hook Elementary School where 20 first graders and six educators were killed with AR-15 rounds, a campaign called \"Stop the Bleed\" began nationwide. Antevy and doctors including Lillian Liao in San Antonio, are training civilians who are truly the first responders. There have been nearly 30 thousand classes like this in the last three years.Peter Antevy: The day after the shooting, my kids, they're waking up, and they're \"time to go to school.\" And, my son heard kind of heard what happened the night before, when I was on the scene, and he looked at me with the fear of God that he had to go to school that day. My first instinct was, \"He needs a bleeding kit.\" My son today has a bleeding kit on his person.Scott Pelley: How old is he?Peter Antevy: 12 years old. Here it is. This is it. We, we, I've given him this and I've taught him how to use it.Scott Pelley: You believe that these mass casualty events have become so common –Peter Antevy: Absolutely.Scott Pelley: – that it is important for everyone in this country to be prepared.Peter Antevy: Everyone.Scott Pelley: That's where we are in America today?Peter Antevy: That's where we are.Ryland WardRyland Ward survived the church massacre because firefighter Rusty Duncan used his belt as a tourniquet.Over this last year Ryland has worked, often six days a week, learning to sit, stand, and walk again.Ryland Ward: I'm going to see if this actually goes in the hospital. Yep.Scott Pelley: Did you meet some new people in the hospital? You were there for a long time.Ryland Ward: How do you know?Scott Pelley: They told me. I talked to some of the people who helped you.Ryland Ward: Like who?Scott Pelley: There was, uh, Doctor –Ryland Ward: Liao?Scott Pelley: Doctor Liao, yes.He has his strength back. Its remarkable, really. But healing from the loss of his stepmother and sisters won't be as quick.Maddy Wilford is also moving forward. Like many who suffer physical trauma, her interests have turned to medicine and an internship where she is studying the kind of surgeries that saved her.Not long ago, many communities assumed mass murder would never come to themToday, all Americans are being asked to prepare for the grievous wounds of high-velocity rounds. Produced by Ashley Velie. Associate producer, Dina Zingaro.Correspondent, \"60 Minutes\"April 15, 2018\nSteve Kroft investigates Allegiant Air, a discount carrier known more for its ultra-low fares than its high record of in-flight breakdownsOctober 15, 2018\nLesley Stahl speaks with President Trump about a wide range of topics in his first 60 Minutes interview since taking officeMarch 11, 2018\nThe secretary of education has been one of the most criticized members of President Trump's Cabinet, but DeVos says she's \"more misunderstood than anything\"October 1, 2018\nIn his first profile on 60 Minutes, McCartney walks down memory lane while looking through old pictures and videos and talks about how he still feels the need to prove himsel...March 27, 2018\nMost people can't pronounce his name, but he's one of the best players in the NBA. And he has quite the story about how he got thereMarch 18, 2018\nA group of survivors of the shooting at Stoneman Douglas High School who refer to themselves as the \"mass-shooting generation\" have made it their mission to bring about gun r...March 11, 2018\nDesperation and fear are driving a dangerous industry that's virtually impossible to completely stopMarch 11, 2018\nOprah Winfrey reports on how trauma plays a role in childhood development and what new methods are being used to help kids who have experienced itMarch 11, 2018\nThe horses of an Argentine polo club may look normal, but the way they came into existence is anything but conventionalFebruary 11, 2018\nA bill passing through Congress could change the way states recognize concealed carry permitsCopyright © 2018 CBS Interactive Inc.All rights reserved."}