{"id": "\n\nCBS News Logo\nJudge orders Amazon to produce Echo recordings in double murder case", "paragraph": "The base of an Amazon Echo speaker in California on May 31, 2018.DOVER, N.H. — A judge has ruled that New Hampshire authorities investigating the murders of two women can examine recordings made by an Amazon Echo speaker with the Alexa voice assistant.Timothy Verrill, of Dover, is accused of first-degree murder in the deaths of 48-year-old Christine Sullivan and 32-year-old Jenna Pellegrini at a Farmington home in January 2017. The bodies of Sullivan and Pellegrini were found under the porch of the home with stab wounds and blunt force trauma, CBS Boston reported.Verrill pleaded not guilty and is awaiting a May 2019 trial.Prosecutors believe there may be Echo recordings capturing the attack on Sullivan and removal of her body that could be found on the server maintained by Amazon. The Echo had been taken from the kitchen while the home was initially searched, the station reports. The device records audio when activated by a \"wake word.\"\"Investigators believe Sullivan was attacked in the kitchen of 979 Meaderboro Road where the Echo was located, and prosecutors believe there is probable cause to believe there is evidence on the Echo, such as audio recordings of the attack and events that followed it,\" said court documents obtained by CBS Boston.An Amazon spokesperson wouldn't say whether the company would contest the judge's order, but said in a statement: \"Amazon will not release customer information without a valid and binding legal demand properly served on us. Amazon objects to overbroad or otherwise inappropriate demands as a matter of course.\" Last year, Amazon dropped its objection to an Echo search warrant in a death investigation after a suspect, who owned the speaker, agreed to release the information. A murder charge in that case was later dropped.\nBest-selling author of books like \"The Fault in Our Stars,\" opens up about exploring his fears through his writing\nThe U.S. saw a 3.4 percent uptick in violent crime in 2016, though rates remain near historic lows. See which cities fared worst\nIn the year since Hurricane Maria hit Puerto Rico, the island has lost a precious resource: hundreds of thousands of people who've left to build their futures elsewhere\n\n\n\nCopyright © 2018 CBS Interactive Inc.All rights reserved."}