{"id": "Investigators studying clues about explosive devices sent to top Democrats", "paragraph": "WASHINGTON — Authorities are trying to determine who is behind crude bombs and other suspicious packages sent to several prominent Democrats and critics of the president. Multiple law enforcement sources say one of the bombs consisted of PVC tubing and used a digital clock connected to a small battery as a possible trigger device. Pyrotechnic powder was the explosive, and in order to keep it lightweight, glass was used as shrapnel. Investigators think whoever put the device together was trying to keep the weight down so that they could put in a mailbox without having to appear at a post office for mailing. Former assistant director of the FBI Ron Hosko said the fact that they didn't explode could provide clues.This photo obtained by CBS News shows what is described as the explosive device sent to former CIA Director John Brennan at CNN's New York City offices.\"It may say that that they were intercepted prior to their ability to explode,\" he said. \"It may say that they were never capable of exploding even though they may have had black powder in them.\"The six packages were all similar in appearance. The large manila envelopes with six American flag \"Forever\" stamps will now be analyzed at the FBI laboratory in Quantico, Virginia. Investigators will deconstruct them, looking to trace the origin of the wiring and the other components to see where and when they may have been purchased and by whom.On the package itself, they'll look for fingerprints and potentially the suspect's DNA if the stamps were licked.\"What markings are on the outside or on the inside of a piece of end cap, to see who was the manufacturer? Where is that product distributed? Is it unique in some way, looking at the tape, looking at the end cuts on the tape, if I tear something off, and a piece of that tape is left on a subject at my house, they may be able to match ends,\" Hosko said.\n\"That first kiss being CPR was obviously very magical because here I am and im very grateful that I'm able to experience further kisses\"\n\"I just kind of push myself,\" Ava Blaser said. \"[Dancing] gives me something to look forward to, like during treatment\"Watch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}