{"id": "Entergy accused of hiring actors to support power plant at hearing", "paragraph": "A utility company allegedly hired actors to attend and speak at a public hearing in support of a power plant project in New Orleans.Entergy, which serves 2.9 million customers and 13,000 employees, hired actors to pose as \"alleged genuine supporters\" of the project, claims the report prepared by a law firm for the New Orleans city council. Entergy had earlier denied knowledge of the plan, reported CBS affiliate WWL-TV in New Orleans.Entergy said in a statement that it took issue with the report.\"Upon initial review, we take exception to certain characterizations and omission of key facts from the report, including specific evidence Entergy provided that confirms it did not pay, nor did it authorize any other person or entity to pay, individuals to attend or speak at Council meetings,\" the company said in the statement.Entergy's alleged hiring of actors may fall into the realm of \"astroturfing,\" or when companies pay for a supposedly grassroots effort that masks their corporate support. The practice appears to be legal in Louisiana, according to New Orleans' The Lens, an investigative journalism publication. But like the proliferation of bots across social media, such efforts raise ethical concerns, including whether lawmakers may be swayed by such misrepresentations.\"On a human level, it is heartbreaking to read that Entergy continues to abuse the public's trust and misuse the vital financial resources that are desperately needed for distribution improvements,\" Public Advocate Happy Johnson told WWL-TV. \"This public service company has completely mismanaged the public's trust.\"According to the city council report, Entergy allegedly contracted with a public relations firm to hire 60 actors at a budget of about $26,000 to appear at an October 2017 hearing. Charles Rice, then-CEO of Entergy, allegedly called the power-plant campaign \"war.\"One employee of the public relations firm who was interviewed for the report said finding actual supporters for the plant would be \"time consuming\" and difficult. An actor who appeared at the hearing told the investigators he was paid $200 per appearance at two city hall hearings and that he was given a prepared script to read from, according to the report.The city council voted to approve the New Orleans Power Station in March. The project is slated to be completed in 2020 and will cost about $210 million to build, the company has said. \nA decade after the Great Recession, the U.S. economy still hasn't made up the ground it lost\nThe top-paying jobs tend to cluster in two industries -- and may prove less vulnerable automationQuotes delayed at least 15 minutes. Market data provided by ICE Data Services.\n            ICE Limitations.\n            Powered and implemented by FactSet.Legal Statement.Copyright © 2018 CBS Interactive Inc.All rights reserved."}