{"id": "How to weigh safety of foreign airlines? These tools can help travelers", "paragraph": "International air travel has become remarkably safe in recent years, with deadly accidents like last month's Lion Air crash in Indonesia becoming more rare. But statistics aside, the accident is making travelers wary of flying in some countries or on certain foreign airlines. The safety of Indonesia's airlines had been questioned long before the Lion Air accident.\"There has been a lot more trepidation about flying smaller airlines that Americans have never heard of\" since the Oct. 29 Lion Air crash, said Blake Fleetwood, president of Cook Travel in New York. \"It is pushing people to the bigger airlines. People are scared.\"Before plunking down big money to book international flights, nervous flyers can tap into resources that can provide red-flag warnings if there are doubts about a carrier's safety.Fatal airline accidents have been declining for about two decades. By some accounts, 2017 was the safest year yet. The Aviation Safety Network and To70 , an aviation consultant in the Netherlands, said there were no fatal crashes involving commercial passenger airlines last year. The reports excluded cargo planes, military aircraft and flights on planes certified to carry fewer than 14 people.\"Aviation safety has become much better even in places that were notoriously unsafe at one time,\" said Alberto Riva, managing editor of The Points Guy , a website for frequent flyers.Within a country, Riva said, some airlines have better safety records than others. He said he would not worry about flying on Garuda Indonesia, the national carrier, \"but if I could find a way to circumvent Lion Air, I would do that.\"Fleetwood, the travel agent, said, \"I would steer clear of any airline that is not certified to fly to the European Union.\"Matt Kepnes, who wrote \"How to Travel the World on $50 a Day,\" said he follows the news closely enough to have a sense of which airlines have good safety records. \"I don't do much digging beyond that unless it is an airline I haven't heard of, especially one that doesn't fly to the U.S. or [European Union], as they have tight airline regulations. Then I look.\"Kepnes said airlines that fly to many countries tend to have a better safety record. He is more cautious about smaller airlines and domestic carriers in countries where he doesn't trust the safety standards.\"I won't fly a Russian carrier ... they have a history of poor safety and the planes are quite old,\" he said. \"Indonesia has a spotty safety record, so I don't like flying their domestic airlines. The same for India.\"Jay Johnson, president of Coastline Travel Advisors in Garden Grove, California, said clients frequently ask about personal safety, but are less likely to ask if transportation is risky.\"Because there is so much attention placed on dangerous countries or regions, travelers tend to ask questions of safety on the ground rather than how they get there,\" he said. He said air travel in the U.S. is so safe that when people ask about a specific airline, it's usually about creature comforts and not safety records.\"It's almost as if travelers assume they will arrive safely, but does the airline have lay-flat beds?\" he said.Travel agents frequently recommend buying travel insurance for overseas itineraries in case you are unable to make the trip. However, if you try to cancel because the airline on which you are scheduled to fly has an accident, insurance is unlikely to reimburse you. Cancellations are covered only if the reason is specifically listed in the policy — such as terrorism, a weather event or illness — said Jenna Hummer of Squaremouth.com , a travel insurance-comparison site.The exception is for people who buy a \"cancel for any reason\" policy. However, such policies generally must be bought when you book the trip or soon after, and they typically cost about 40 percent more than standard trip-cancellation insurance, Hummer said.\nA decade after the Great Recession, the U.S. economy still hasn't made up the ground it lost\nThe top-paying jobs tend to cluster in two industries -- and may prove less vulnerable automationQuotes delayed at least 15 minutes. Market data provided by ICE Data Services.\n            ICE Limitations.\n            Powered and implemented by FactSet.Legal Statement.Copyright © 2018 CBS Interactive Inc.All rights reserved."}