{"id": "\n\nCBS News Logo\nYoga student hailed as hero after fighting gunman who killed 2 women", "paragraph": "TALLAHASSEE, Fla. — A yoga student is being lauded as a hero for wrestling with a gunman who posed as a customer to get into a yoga studio in Florida and started firing. Joshua Quick spoke to ABC's \"Good Morning America\" on Sunday and said he grabbed Scott Paul Beierle's gun after it jammed, and hit him. Tallahassee police have identified Beierle as the 40-year-old man who entered the Hot Yoga Tallahassee during a Friday night class and started shooting, killing two and wounding six. Police said Beierle then turned the gun on himself but have offered no motive in the attack.Quick said Beierle was able to grab the gun back and then pistol-whip him. \"I jumped up as quickly as I could,\" said Quick, who had visible injuries on his face. \"I ran back over and the next thing I know I'm grabbing a broom, the only thing I can, and I hit him again.\"It created a window of opportunity for some people in the studio time to flee. \"Thanks to him I was able to rush out the door,\" Daniela Garcia Albalat told \"Good Morning America.\" She was in the class and thought she was going to die when the shooting broke out. \"He saved my life.\"Two women — a 61-year-old faculty member at Florida State University and a 21-year-old FSU student from Atlanta who was due to graduate in May — were fatally shot.Dr. Nancy Van Vessem was an internist who also served as chief medical director for Capital Health Plan, the area's leading health maintenance organization. She was also a faculty member at FSU and a mother. Maura Binkley grew up in Atlanta, was a member of a sorority and was studying for a double major in English and German.A gunman killed two people in Florida. He was a brooding military veteran and former teacher, who appeared to have made videos in which he detailed his hatred of everything from the Affordable Care Act to girls who'd allegedly mistreated him in middle school. The videos were posted four years ago, and have been removed from YouTube in the wake of the shooting.Numerous disturbing details about him emerged over the weekend. He'd once been banned from FSU's campus and had been arrested twice for grabbing women — even though the charges were ultimately dropped.Beierle, who had moved to the central Florida town of Deltona after obtaining a graduate degree from FSU, appeared to post a series of videos on YouTube in 2014 where he called women \"whores\" if they dated black men, said many black women were \"disgusting\" and described himself as a misogynist.\nBest-selling author of books like \"The Fault in Our Stars,\" opens up about exploring his fears through his writing\nThe U.S. saw a 3.4 percent uptick in violent crime in 2016, though rates remain near historic lows. See which cities fared worst\nIn the year since Hurricane Maria hit Puerto Rico, the island has lost a precious resource: hundreds of thousands of people who've left to build their futures elsewhere\n\n\n\nCopyright © 2018 CBS Interactive Inc.All rights reserved."}