{"id": "\n\nCBS News Logo\nFDA approves new single-dose drug to treat flu", "paragraph": " For the first time in two decades, the U.S. Food and Drug Administration has approved a new type of antiviral flu drug.The single oral dose of Xofluza (baloxavir marboxil) is for the treatment of uncomplicated flu in patients aged 12 and older who have had symptoms for no more than 48 hours.When used within 48 hours of getting sick with the flu, antiviral drugs can reduce symptoms and duration of the illness, according to the FDA.\"This is the first new antiviral flu treatment with a novel mechanism of action approved by the FDA in nearly 20 years,\" FDA Commissioner Dr. Scott Gottlieb said in a statement Wednesday.\"With thousands of people getting the flu every year, and many people becoming seriously ill, having safe and effective treatment alternatives is critical,\" he added. \"This novel drug provides an important, additional treatment option.\"One expert welcomed the new option for flu sufferers.\"Xofluza is unique in that it acts to inhibit replication of the flu virus in the first place, at a step much earlier than the current medications available, such as oseltamivir or zanamivir, which only block release of virus that has already been produced from a host cell,\" explained Dr. Robert Glatter, an emergency physician at Lenox Hill Hospital in New York City.This new method of action may \"reduce and shorten the duration of bothersome symptoms, such as fever and muscle aches,\" he said. \"In theory, it might also reduce the chance of developing downstream complications such as pneumonia.\"Xofluza is also \"simpler to take -- just one tablet, compared with other options, one of which requires twice daily dosing for 5 days,\" Glatter said.The drug's approval was based on two clinical trials of more than 1,800 patients who took either Xofluza, a placebo or another antiviral flu treatment within 48 hours of experiencing flu symptoms.In both trials, patients who took Xofluza had quicker relief of symptoms than those who took the placebo. In the second trial, the time to symptom relief was the same for patients who took Xofluza as those who took the other antiviral flu treatment, according to the FDA.The most common side effects in patients taking Xofluza were diarrhea and bronchitis.According to Dr. Debra Birnkrant, director of the Center for Drug Evaluation and Research's division of antiviral products, \"Having more treatment options that work in different ways to attack the virus is important because flu viruses can become resistant to antiviral drugs.\"Still, Gottlieb noted, \"while there are several FDA-approved antiviral drugs to treat flu, they're not a substitute for yearly vaccination.\"The U.S. Centers for Disease Control and Prevention recommends getting a flu shot before the end of October.\nPet health care bills can climb into the tens of thousands of dollars as new technologies and treatments drive up costs\nIf you're having a hard time shedding pounds, try adjusting these common eating habitsCopyright © 2018 CBS Interactive Inc.All rights reserved."}