{"id": "First husband-and-wife duo to fly B-2 stealth bombers retire after making history", "paragraph": "BOISE, Idaho — The B-2 stealth bomber is able to fly into enemy territory undetected, making it one of the most feared aircraft in the world. Lt Col. Jennifer Avery was the first woman to fly it.\"Honestly, I never thought I would be a pilot... I was very kind of insecure in high school,\" Avery said.But she overcame that insecurity and earned her Air Force wings in 1997. Then she heard there was a search for B-2 pilots.\"I decided to throw my name in the hat,\" she said, adding that she didn't intend to blaze a trail for women. \"I just applied because it intrigued me.\"Jennifer Avery seen in an undated photo.She got the job, but there was a problem. It meant she'd have to leave her boyfriend John, who was also an Air Force pilot, and move to the B-2 base in Missouri. \"It's obviously an incredible airplane. But that had a significant role in the decision process,\" he said.So they both became B-2 pilots and eventually, husband and wife. It was another first in Air Force history, but it also meant they could never be in the same plane.\"You're not allowed to fly together if you are married,\" Jennifer said.She went on to fly a mission in Operation Iraqi Freedom. She is still the only woman to fly a B-2 in combat. When asked why more women don't go after these jobs, she said there could be \"a perception problem.\"\"That they think they won't be accepted,\" Jennifer said.Jennifer and John Avery retired from the military in September.The couple went on to fly B-2s for the Air National Guard until they both retired from the military in September, giving them more time to focus on the ultimate mission: Their two children.\"I have ultimate respect for her because I know that she's an incredible pilot, but I know that she's an even better mother,\" John said.They'll always have that connection to that exclusive club in the sky.\n\"That first kiss being CPR was obviously very magical because here I am and im very grateful that I'm able to experience further kisses\"\n\"I just kind of push myself,\" Ava Blaser said. \"[Dancing] gives me something to look forward to, like during treatment\"Watch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}