{"id": "\n\nCBS News Logo\nTrump says written responses to questions will go to Mueller team next week", "paragraph": "WASHINGTON -- President Donald Trump says he \"very easily\" answered written questions from special counsel Robert Mueller, though he speculated that the questions had been \"tricked up\" to try to catch him in a lie. \"They're all done,\" Trump told reporters at the White House early Saturday before leaving for California, adding that his responses will soon be submitted to Mueller's team. \"We do that next week,\" he said, in what signals a new phase of the inquiry. In a swipe the day before at the investigation into 2016 election interference and possible ties between Moscow and the Trump campaign, the president said that \"you have to always be careful when you answer questions with people that probably have bad intentions.\" Mueller has signaled a willingness to accept written answers on matters related to collusion with Russia. Trump lawyer Rudy Giuliani has said repeatedly the president would not answer Mueller's questions on possible obstruction of justice. During months of back-and-forth negotiations with the special counsel office, Mr. Trump's lawyers have repeatedly counseled the president against sitting down for an in-person interview. Though he spent hours with his attorneys, Mr. Trump on Friday insisted: \"My lawyers don't write answers, I write answers.\" The president's remarks were fresh evidence of his return to the ominous rhythms of the Russia probe after spending heady weeks enjoying adulation-soaked campaign rallies before the midterm elections. Despite Mr. Trump's insistence that he's \"very happy\" with how things are going, his frustrations with the probe have been evident everywhere from his Twitter feed this past week to his private grousing that the special counsel may target his family. There's also the criticism he's getting over his choice for acting attorney general, as well as late-arriving election results that have largely been tipping toward House Democrats. On Saturday, President Trump left Washington, D.C., for California after the death toll from the state's Camp Fire climbed to 71 and the number of people unaccounted for jumped to more than 1,000. Mr. Trump is set to visit Northern California, where the destructive Camp Fire is raging. U.S. President Donald Trump speaks to the media before departing the White House for California, on November 17, 2018 in Washington, D.C.Gov. Jerry Brown and Gov.-elect Gavin Newsom, both Democrats, have welcomed Mr. Trump's visit, declaring it's time \"to pull together for the people of California.\" They will join Mr. Trump on his visit, according to the governor's office, although details of Mr. Trump's itinerary were not released as of Saturday morning. \nIt was a night of historic firsts, big wins for both parties\nThe sticker features both Virginia and the American flagCopyright © 2018 CBS Interactive Inc.All rights reserved."}