{"id": "\n\nCBS News Logo\nJavier Bardem, Jennifer Aniston, Reese Witherspoon reportedly make more than $1 million per TV episode", "paragraph": "Javier Bardem on September 16, 2018 in West Hollywood.It's no secret that with the advent of streaming services, the TV industry is more competitive than ever — and that means companies are shelling out fat salaries for big stars. Variety reports that Javier Bardem, Jennifer Aniston and Reese Witherspoon are each set to make more than $1 million per episode for their upcoming TV series. Variety reports that Bardem will make $1.2 million per episode for starring in a show by Amazon and Amblin TV about 16th-century explorer Hernán Cortés. Meanwhile, Aniston and Witherspoon will reportedly each make $1.1 million per episode for an upcoming Apple drama about a TV morning show and the New York media scene. Steve Carell, who will also star with Aniston and Witherspoon, is reportedly set to earn $600,000 per episode.That's just for acting, by the way. Bardem, Aniston and Witherspoon have all been named executive producers on their respective shows, and will earn more cash accordingly. Other high earners include Kevin Hart for his CBS competition show, \"TKO,\" at a reported $500,000 per episode, and Dwayne \"The Rock\" Johnson for NBC's \"Titan,\" at a reported $450,000. Meanwhile, John Goodman and Laurie Metcalf reportedly earn $375,000 for each episode of \"The Conners.\" The network salaries are nothing to sneeze at, but pale in comparison to those offered to top talent by streaming services. Unsurprisingly, as movie stars move into TV, many of the highest-paid TV stars are also bona fide film stars — but not all of them. Elisabeth Moss, who gained more fame for her role on \"Mad Men\" than in films, reportedly earns $1 million per episode for acting in Hulu's hit, \"The Handmaid's Tale.\" However, TV stars making their debuts command much smaller salaries. The cast members of \"Queer Eye\" reportedly make $7,500 per episode, for example. Variety also attributes the proliferation of high TV salaries to a new law in California that barred employers from asking prospective workers how much money they made in previous jobs. This meant that networks and streaming services could no longer look at actors' pay history in order to determine their offers. Grace Wu, executive VP of casting for NBC, told Variety that now, many studios instead consider the value the actors would add to the project. She said doing so \"has helped people that have been marginalized in the past. Which is really, I would say, women and people of color.\" Unsurprisingly, though, the increases in salaries mean that studios need bigger budgets. The salaries of Bardem and Aniston might sound shocking, but they are not unprecedented. Jerry Seinfeld reportedly made $1 million per episode of \"Seinfeld,\" Ray Romano reportedly made between $1.8 and $1.9 million for \"Everybody Loves Raymond\" and Charlie Sheen reportedly made nearly $2 million per episode of \"Two and a Half Men.\" Andrea is an entertainment producer at CBSNews.com\nFilm, TV, music and digital stars gathered for the People's Choice Awards on Sunday\nShows and movies you'll want to stream soonCopyright © 2018 CBS Interactive Inc.All rights reserved."}