{"id": "Can scanning social media help prevent a shooting? Some schools think so", "paragraph": "In the wake of the Sandy Hook school shooting, Greg Boulanger said he started to think about security differently. He is the director for public safety in Bristol, Connecticut, a district with 8,000 students. \"About six years ago when all the districts around put things together and got district crisis teams, we didn't know, we didn't have much … but we added different tools in our tool box for school security,\" Boulanger said. Upgraded security cameras and a more robust screening process for visitors were two of those tools. Another is Social Sentinel, a social media threat alert service that costs less than $2 per student. It scans public social media posts for \"threat indicators.\" On the day CBS News correspondent Don Dahler visited, Boulanger received an alert when a young man tweeted, \"stress can kill you.\"\"I have about 33,000 posts a month. The actual actionable posts are 0.97 per thousand … I get five or six per day,\" he said. \"And what I learned is that we're not invading – people are posting stuff publicly. One post that said, \"I'll kill you,\" was flagged. Another alert said, in part, \"I gotta kill you all,\" but the person who posted it was not a student, and the line was a rap lyric.   As Social Sentinel data scientist Polly Mangan explained, some sentences that are lexically similar to something that's considered a threat like \"my hangnail is literally going to kill me\" do get flagged unnecessarily. Greg Boulanger   \"Sometimes our model is very conservative, sometimes false positives do get sent through because it is very complicated. But we but we hope to remove some of the noise,\" Mangan said.    Gary Margolis, a 30-year veteran of law enforcement and security, is the founder and CEO of Social Sentinel. He said the company has hundreds of contracts in more than 30 states. \"It's about being a part of a layered security approach, much like cameras met a need to be able to put eyeballs in places where they couldn't have human beings all the time,\" he said. \"The fact that doors are locked and access control systems reasonably let you keep people out when they shouldn't get in.\"\"All of these technologies addressed a reasonable concern. They mitigated a reasonable risk and were another part of that layered strategy,\" Margolis said.    The service scans public posts on Twitter, Instagram, ASKfm, and Tumblr, among others. Social Sentinel would not give us examples of the several hundreds of thousands of phrases that can trigger an alert.  \"The challenge we have now is long after the game is over and the class is done and band practice is over, you're continuing the conversation digitally and you're doing it almost constantly. ... They're sharing things there that I think we have an obligation to be aware of,\" Margolis said.    The business of social media watchdogs is controversial. Two years ago, Twitter, Facebook and Instagram stopped providing user data access to a company called Geofeedia, which analyzes posts within a geographic location because the ACLU found police were using it to monitor activists and protesters. \"We're looking for potential harm. So our system is designed that you can't input that information. ... We're not a general search tool where you can log into our system and throw a word in there. In fact, we are purposely not that for a number of reasons including we don't think it's appropriate for you to be able to throw something that might be politically charged or potentially troubling as a search term in and just search for that. That's just not what we do,\" Margolis said.    Greg Boulanger said he's been able to get intervention for at least two young adults threatening self-harm. Despite its flaws, Social Sentinel gives some peace of mind. \"Could something happen? Yes it can. I don't want to say how, but I know that when I go home at night that we're doing all that we can to try to protect the kids,\" Boulanger said. \nCBS News correspondent is joining Gayle King, Norah O'Donnell and John Dickerson\nWe only use about 1 percent of available crops to fuel our diets\n\"We took it very, very seriously, to be funny\"Watch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}