{"id": "Trump calls for unity despite slamming targets of explosive devices in the past", "paragraph": "MOSINEE, Wis. — President Trump called for unity after suspicious packages were sent to several prominent Democrats. But in the past, he has hurled some of his harshest insults at the same people who were sent letter bombs.The president still attacks his 2016 Democratic rival Hillary Clinton, nearly two years after defeating her in the election. Crowds at his rallies continue to erupt in angry chants of \"Lock her up!\" Clinton has not remained silent either.\"You cannot be civil with a political party that wants to destroy what you stand for, what you care about,\" she said.Mr. Trump also frequently calls out California Rep. Maxine Waters, calling her \"low IQ.\"Their feud started in June, when Waters encouraged protests against Trump administration officials.\"If you see anybody from that Cabinet in a restaurant and a department store at a gas station you get out and you create a crowd and you push back on them,\" she said.Recently, former U.S. Attorney General Eric Holder also triggered a response from Mr. Trump. Speaking of Democrats' political opponents, Holder quipped, \"When they go low, we kick 'em.\"\"He'd better be careful what he's wishing for, that I can tell you. He better be careful what he's wishing for,\" Mr. Trump said. In August, the president revoked the security clearance for former CIA Director John Brennan, after slamming him for his handling of Russian meddling. \"I have no confidence in a guy like Brennan. I think he's a total low-life,\" Mr. Trump said. The package for Brennan was delivered to CNN's offices in New York City. The news outlet has been a frequent target of the president, who blasts it as \"fake news.\" In a statement, CNN Worldwide president Jeff Zucker said: \"There is a total and complete lack of understanding at the White House about the seriousness of their continued attacks on the media. The President, and especially the White House Press Secretary, should understand their words matter.\"More than anywhere else, the president unleashes attacks on his opponents at campaign rallies. During a prayer to kick off Wednesday's rally in Wisconsin, the pastor asked for safety for both political parties and their leaders.\n\"That first kiss being CPR was obviously very magical because here I am and im very grateful that I'm able to experience further kisses\"\n\"I just kind of push myself,\" Ava Blaser said. \"[Dancing] gives me something to look forward to, like during treatment\"Watch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}