{"id": "\n\nCBS News Logo\nGeorgia police officer fatally shot near middle school", "paragraph": "Antwan ToneyLast\n          Updated Oct 21, 2018 1:54 AM EDTSNELLVILLE, Ga. — A Georgia police officer has been killed after being shot while responding to a suspicious vehicle parked near a middle school. Two teen-aged suspects have been charged, including one man who remains on the loose.Gwinnett County Police said in a statement that Isaiah Pretlow, 19, was arrested about 11:30 p.m. Saturday and charged with aggravated assault. A second suspect Tafahree Maynard, 18, has been charged with aggravated assault and felony murder but remains on the loose. Both men are suspected in the afternoon shooting near Snellville of Officer Antwan Toney, the Gwinnett County Police Department said in a news release. Toney died at a hospital from his injuries, police said. The 30-year-old from Southern California had been with the Gwinnett County Police Department for nearly three years. It was his first police job. \"The people that worked with Officer Toney on a daily basis recalled a very jovial person who was dedicated to his job and dedicated to his community,\" Gwinnett County Police Chief Butch Ayers said. The shooting happened near Shiloh Middle School, about 25 miles northeast of Atlanta. At least one officer returned fire. The suspects crashed their vehicle a short time later and witnesses reported seeing as many as four people running from the scene, police said. It's unclear if any of the suspects were injured. \nBest-selling author of books like \"The Fault in Our Stars,\" opens up about exploring his fears through his writing\nThe U.S. saw a 3.4 percent uptick in violent crime in 2016, though rates remain near historic lows. See which cities fared worst\nIn the year since Hurricane Maria hit Puerto Rico, the island has lost a precious resource: hundreds of thousands of people who've left to build their futures elsewhere\n\n\n\nCopyright © 2018 CBS Interactive Inc.All rights reserved."}