{"id": "Health care remains top issue in Florida as voters decide tight midterm races", "paragraph": "MIAMI — One week before the midterm elections, the CBS News Battleground Tracker shows Democrats have the advantage as they try to take control of the House for the first time since 2010. It will be harder for them to take back the Senate.In Florida, where there are a number of key races, Democrats have made health care the major issue. More than 1.2 million Floridians have already cast their ballots, nearing early voting totals from 2014. And there's still a week to go.The marquee race for governor pits Tallahassee Mayor Andrew Gillum, a Democrat, against the Republican, former Rep. Ron DeSantis.Health care has actually edged out the economy as the top issue in Florida this year. Three out of four Floridians tell CBS News it is very important to their vote, and they say Democrats are far more likely than Republicans to protect people with preexisting conditions. In Florida's 26th District south of Miami, GOP Rep. Carlos Curbelo has been hammered with ads over his votes to repeal Obamacare. His district has the second-highest number of Obamacare recipients in the country and Curbelo insists the GOP's replacement bill would have been better.\"It's an honest position, and I'm not willing to role play. I'm not willing to lie to people in order to get elected,\" he said.When CBS News sat down with four Miami voters from across the political spectrum, Obamacare was less of a lightning rod than expected.\"I'm able to pay for my insurance. But I think that we need to expand something for the poor,\" said Wanda Rufin, a lawyer who voted early for Republicans.\"I'm not saying that Obamcare is perfect but I think that it gave us a pretty great framework to work with,\"said Devondra Shaw, a Democrat who works for the Red Cross.Nancy Cordes is CBS News' congressional correspondent.\n\"That first kiss being CPR was obviously very magical because here I am and im very grateful that I'm able to experience further kisses\"\n\"I just kind of push myself,\" Ava Blaser said. \"[Dancing] gives me something to look forward to, like during treatment\"Watch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}