{"id": "House Democrats prepare to unload flurry of Trump investigations", "paragraph": "WASHINGTON — As the nation observed Veterans Day, President Trump spent the day out of public view, but his tweets suggested he is thinking about how a House controlled by the Democrats might impact his presidency.Mr. Trump warned of \"the prospect of presidential harassment by the Dems,\" using the label Republicans have been using to refer to possible investigations of the executive branch once Democrats assumes control of the House in January.In an interview with Axios, New York Democrat Nita Lowey, who is set to chair the powerful Appropriations Committee, checked off a laundry list of potential areas for inquiry. She mentioned the family separation policy and hurricane relief in Puerto Rico.Add to that dozens of other topics, including campaign-era payments to women who allege affairs with Mr. Trump, Russian involvement in the 2016 election and the appointment of non-Senate confirmed acting Attorney General Matt Whitaker, who Democrats already accuse of bias against the special counsel's investigation.California Rep. Adam Schiff will lead the House Intelligence Committee.\"Mr. Whitaker needs to understand that he will be called to answer, and any role that he plays will be exposed to the public,\" he said. House Democratic leader Nancy Pelosi, likely to become the next speaker, told \"Face the Nation\" Democrats will be \"strategic.\"\"We are not scattershot. We are not doing any investigation for a political purpose, but to seek the truth,\" Pelosi said.Last week, the president said Democratic investigations could backfire.\"Now we can investigate, they look at us, we look at them, it goes on for two years and then at the end of two years nothing's done,\" he said.\n\"That first kiss being CPR was obviously very magical because here I am and im very grateful that I'm able to experience further kisses\"\n\"I just kind of push myself,\" Ava Blaser said. \"[Dancing] gives me something to look forward to, like during treatment\"Watch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}