{"id": "\n\nCBS News Logo\nDemocrats, GOP battle for Latino voters ahead of midterms", "paragraph": "Last\n          Updated Oct 31, 2018 6:26 AM EDTAs their party vies to seize control of the U.S. House of Representatives during next week's midterm elections, some Democrats are apprehensive about the turnout of Latino voters — a nearly 30 million strong voting bloc. \"The attitude of taking this vote for granted is very much felt within the Latino community,\" Rep. Raúl Grijalva, D-Arizona, told CBS News. \"How we break away from that history I think is going to be key in this election.\"Hispanic voters will make up 12.8 percent of the American electorate on Nov. 6 and have the potential to swing elections across the country, from tight congressional races in Republican-held seats in south Florida and California's south coast, to high-profile gubernatorial and U.S. Senate contests in Arizona, Florida, Nevada, New Mexico and Texas.The challenge for Democrats is galvanizing an electorate that historically has not turned out to cast their ballots in large numbers in midterm elections. According to the non-partisan Pew Research Center, the Latino voter turnout rate in midterm elections has continuously declined since 2006 — and hit an all-time low of 27 percent during the elections in 2014. In a Marist poll released earlier this month, 41 percent of Hispanics surveyed backed the president's performance in office. However, a study published last week by the Pew Research Center found that 67 percent of Hispanics believe the administration's policies have been harmful to Latinos.According to the same survey, 52 percent of Latino voters said they've thought \"quite a lot\" about the Nov. 6 election — a 16 percentage point increase from the 2014 midterms. Despite this, Grijalva said his party should be cautious and continue working to build long-lasting and deeply-rooted connections with growing Hispanic communities in the U.S., like his sprawling, majority Latino border district in southern Arizona.\"You don't wait for the Latino vote on the last week and then just assume that it's going to turn out,\" he cautioned. The eight-term lawmaker stressed that Democrats can't expect Latinos to vote for them simply because many are alienated by President Trump's harsh rhetoric on immigration and the stringent policies enacted by his administration. \"Trump can't be the only motivating point in this election,\" Grijalva said. \"There has to be an agenda that talks about some boldness and the inclusion of Latinos in that future.\"In deep-red Texas, where bullish Democrats dream of unseating Republican Sen. Ted Cruz, Latinos are a three-million strong voting group that represents nearly 30 percent of the state's electorate. Cristina Tzintún, a progressive Mexican-American activist, told CBS News that Texas' Hispanic community is a sleeping giant that has largely been overlooked by political campaigns. \"Both major parties have failed to invest in our communities,\" she said. \"You have Democratic candidates say that Latinos don't go out and vote in larger numbers, so they don't put money into voting for them. But then Latinos say they're not voting because nobody is contacting them.\"In late 2016, Tzintún founded Jolt, a liberal advocacy organization focused on mobilizing young Latinos voters in the Lone Star State. She said the common denominator in the Hispanic communities her group has visited and contacted is the conspicuous absence of voter engagement by Republicans and Democrats.  In fact, a nine-month study by her organization found that 37 percent of the Texas Latinos surveyed said they lacked information to vote. According to a national survey in September by the polling firm Latino Decisions, nearly 60 percent of Hispanic voters said they had not been contacted by a political party or candidate. \"Sadly, right now, Latino voters are being taken for granted,\" Tzintún said. She added that Latinos will be vital in any long-term Democratic endeavor to turn Texas blue and in Rep. Beto O'Rourke's insurgent campaign to oust Cruz, who Tzintún believes shares little with Latinos in the state despite being of Cuban descent. \"He may have a Latino last name, but that ends the commonality with our community right there,\" she said. Texas is not the only state where the Democratic Party hopes to topple incumbent Hispanic Republicans with the help of large Latino electorates. In Florida, Democrats are eying two congressional seats held by moderate Republicans Rep. Carlos Curbelo and Rep. Mario Diaz-Balart, as well as the open Miami-Dade County seat left vacant by the retirement of the first Latina to serve in Congress, Republican Rep. Ileana Ros-Lehtinen. Latinos make up more than 65 percent of eligible voters in these three Republican-held districts in south Florida. In California — home to a 7.7 million strong Hispanic electorate, the nation's largest — Latinos represent more than 25 percent of eligible voters in five of the eight districts on the Democratic Congressional Campaign Committee's \"Red to Blue\" program and more than 10 percent in the remaining three. Hispanics also make up large voting blocs in several battleground, Republican-held congressional districts in the Southwest, most notably New Mexico's 2nd, a large district where nearly half of the electorate is Latino, and Texas 23rd, a border district in which Latinos represent 64.5 percent of eligible voters. Despite the important role of Hispanic voters in close contests across the nation, Democrats have only recruited seven Latino candidates in the over 90 U.S. House races part of their \"Red to Blue\" initiative. They are Gil Cisneros and Mike Levin in California's 39th and 49th Congressional Districts; Debbie Murcasel-Powell in Florida's 25th; Antonio Delgado in New York's 19th; Xochitl Torres Small in New Mexico's 2nd; Randy Bryce in Wisconsin's 1st; and Jana Lynne Sanchez in Texas' 6th.  Asked if fielding more Hispanic candidates would help Democrats energize Latinos voters, Rep. Grijalva emphasized that a progressive platform on health care, environmental issues and immigration is more important than having a Latino last name. \"The surname is a pull, but a surname with content I think is a huge pull,\" he said. The mission of making sure Latinos continue to be an integral part of the Democratic Party's electoral coalition is a personal one for Tom Perez, the first Latino to chair the Democratic National Committee (DNC). And he knows his Party needs them to turn out on Nov. 6. The stakes, he said, are too high. \"You can't be a casual participant every four years in our democracy because look what happens when you do that,\" Perez told CBS News, referring to President Trump's unexpected and poll-defying victory in 2016. \"We've worked really hard to impress in Latino communities the importance of voting now.\" The former Secretary of Labor under President Barack Obama is well-aware of the difficulty his party has encountered in mobilizing Hispanic voters in off-year campaign seasons. \"I think everybody understands that we need to build meaningful, permanent relationships with Latinos across the country because they share the values of the Democratic Party,\" he said. According to internal figures, the DNC has allocated $3 million this cycle to fund organizing and voter registration efforts in Latino communities across 15 states. A committee official said the group has reached out to more than 55 million people this campaign season, but that it does not have statistics on the number of Latino voters it has contacted. Its counterpart, the Republican National Committee (RNC), has reached out to approximately 58 million voters this cycle and 15.7 million of those have been within Hispanic communities, according to internal statistics. An RNC official said the GOP has been hosting engagement events in 11 states where it believes Latinos are crucial to its electoral success. Both national committees have undertaken concerted efforts to court the tens of thousands of Puerto Ricans who fled the island in the aftermath of the devastation caused by Hurricane Maria and settled in the mainland, primarily in Florida.  Perez said the Puerto Rican diaspora is motivated to vote for Democrats in this election. \"They all remember vividly the horrific image of Donald Trump throwing paper towels in the ultimate statement of arrogance,\" he said. The Director of Strategic Initiatives at the RNC, Edith Jorge, however, is certain that Puerto Rican voters — like other Latinos in the U.S. — will consider the strong economic numbers and low unemployment rates under the current Republican administration, as well as the GOP's support for school choice, when they cast their ballots on Nov. 6. Jorge acknowledged that Republicans face an uphill battle in wooing the Latino electorate, which has overwhelmingly favored Democrats in recent elections. But she stressed that her party is not afraid of engaging with Hispanic voters through tough and often uncomfortable conversations — particularly on immigration.She said she understands that many Hispanic voters have serious concerns about the president's hardline remarks on immigration, but added that Latinos should look to accomplishments in other areas, like the job market. \"We can sit here and talk about how divisive he is or how you don't agree with his tone, but we're still looking at approval numbers on the rise. We're still looking at promises made, promises kept,\" she said. Borrowing from the political playbook of his successful campaign in 2016, Mr. Trump has again weaponized the issue of immigration this election cycle, speaking out against the caravans of migrants fleeing poverty, persecution and gang violence that are heading to the U.S. through Central America and Mexico. In an operation critics have accused of being politically motivated, his administration is deploying more than 5,000 troops to the southern border to anticipate the arrival of the caravans.The White House is also reportedly preparing to challenge the long-standing precedent of birthright citizenship under the 14th Amendment by rolling out an executive order that would attempt to deny citizenship to children born in the U.S. to parents who are undocumented or have a temporary immigration status. \"The president is using lies, fear, division and distraction. That was the staple of his closing argument in 2016 and he's doing it again,\" Perez said. The DNC Chairman predicts that Mr. Trump's attempt to \"put fear on the ballot\" will backfire and prompt Latinos to vote for Democrats. Rep. Adriano Espaillat, D-New York, told CBS News that although Mr. Trump \"feels that it's a wedge issue that will divide America and that will feed red meat to his base,\" Democrats can craft \"a very positive message\" on immigration that \"anybody in the country can gravitate around.\"Espaillat, who represents heavily Latino populated neighborhoods in Upper Manhattan, said he is optimistic about his Party's chances to retake the House. The nation's first formerly undocumented immigrant to serve in Congress expects Latinos to play an important role in this effort. \"This is a historic election that will determine what road we will take as a country for the next 10, 20, 30 years,\" he said. \"And Latinos should be writing part of that chapter in history.\"\nIt was a night of historic firsts, big wins for both parties\nThe sticker features both Virginia and the American flagCopyright © 2018 CBS Interactive Inc.All rights reserved."}