{"id": "Iranians feel the impact of U.S. sanctions while bracing for more", "paragraph": "TEHRAN, Iran — Iranians are bracing for a new round of U.S. sanctions that President Trump plans to impose as early as next Monday. According to the White House, one of the main goals of the sanctions is to pressure Iran's government into negotiating a new and improved nuclear deal.CBS News was in Tehran for a day of mourning in Iran's religious calendar, as thousands of the devout joined a solemn procession. There wasn't a soul in the crowd that hasn't already felt the bite of U.S. sanctions that were reimposed in August.Mr. Trump says he has no quarrel with the Iranian people, but they're already hurting. Iran's currency has plunged 70 percent against the U.S. dollar. That means everything, starting with basics like food and medicine, is more expensive. Millions are struggling, including Sarah Abadan.\"The price of everything is increasing. We can feel it easily,\" she said. When asked what she thinks of the current U.S. government, Abadan said \"they are awful.\"The White House gets a lot of the blame, but not all of it. People rarely say it out loud, but demonstrations across Iran show there's public fury with Iran's own inefficient, corrupt government.For Iran's poor, violence and chaos will make their hardship worse. For now, they will grit their teeth and scrape by with less. Elizabeth Palmer has been a CBS News correspondent since August 2000. She has been based in London since late 2003, after having been based in Moscow (2000-03). Palmer reports primarily for the \"CBS Evening News.\"\n\"That first kiss being CPR was obviously very magical because here I am and im very grateful that I'm able to experience further kisses\"\n\"I just kind of push myself,\" Ava Blaser said. \"[Dancing] gives me something to look forward to, like during treatment\"Watch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}