{"id": "\n\nCBS News Logo\nAlexander Hamilton's fifth great-grandson loans heirlooms to museum", "paragraph": "Alexander Hamilton's window Elizabeth (Liza) Hamilton's gold mourning ring with a piece of her late-husband's hair encased under the glass jewel is among the items loaned to the Museum of the American Revolution in Philadelphia.PHILADELPHIA -- The fifth great-grandson of Alexander Hamilton loaned some family heirlooms, including a ring that has a lock of his hair inside, to the Museum of the American Revolution Monday.Douglas Hamilton was in Philadelphia to give the artifacts to the museum to be featured as part of the museum's \"Year of Hamilton\" in an exhibit called \"Hamilton Was Here: Rising Up in Revolutionary Philadelphia.\" The items include a Society of the Cincinnati Eagle insignia worn and owned by Hamilton and a gold mourning ring - featuring a lock of his hair set under a glass jewel - worn by his wife Elizabeth after his death.\"My dad never talked to me about it,\" Douglas Hamilton said of growing up as a Founding Father descendant. \"The only story I got from my father was that being a descendant from Alexander Hamilton and 10 cents would get you a cup of coffee.\"The 67-year-old Ohio man said their famous distant relative wasn't something the family focused on. He said a cardboard box containing the heirlooms was passed quietly from generation to generation, and stowed away until it passed on again.Shown is Alexander Hamilton's window Elizabeth Hamilton's handkerchief embroidered with her name at the Museum of the American Revolution in Philadelphia, Monday, Nov. 12, 2018. This and other items loaned by the fifth great-grandson of Hamilton will be featured as part of the museum's \"Year of Hamilton.\"But as Hamilton's legacy has re-emerged with the hit Broadway musical and a number of books in recent years, he has been embracing his ancestor and sharing his stories and objects. He even has a grandson named Alexander Hamilton who was born on what might have been the 250th anniversary of the Founding Father's birth. (His birthday has been speculated as Jan. 11, 1755 or Jan. 11, 1757.)\"I think it's important as time goes by to make sure they're remembered,\" he said Monday inside the workroom at the museum, where curators were preparing his loaned items, which also include a never-before-displayed handkerchief embroidered with Elizabeth's name, and a baby dress with an accompanying note saying it was made by her. After they undergo conservation, the heirlooms will be put on display in early 2019.\"These items give us a glimpse into the personal lives of Alexander and Elizabeth Hamilton and we're honored and delighted that Doug and his family have chosen to loan them to us,\" said Philip Mead, the museum's chief historian and director of curatorial affairs.The Alexander Hamilton Awareness Society connected Doug Hamilton with the museum.Displayed is Alexander Hamilton's Society of the Cincinnati Eagle insignia at the Museum of the American Revolution in Philadelphia, Monday, Nov. 12, 2018. This and other items loaned by the fifth great-grandson of Hamilton will be featured as part of the museum's \"Year of Hamilton.\"\"He just called me one day out of the blue and introduced himself and I said, 'Boy, this doesn't happen every day that a Hamilton calls you and offers to loan national treasures,'\" Mead said. That Hamilton offered to drive the items to the museum himself to drop them off was even better, he added.Alexander Hamilton was an original member of the Society of the Cincinnati, which was founded by officers of the Continental Army at the American Revolutionary War. The pendant on loan has its original ribbon, which is significantly worn from use.Doug Hamilton said the last time Aaron Burr and Alexander Hamilton met before their fateful duel was at a meeting of the Society of the Cincinnati at Fraunces Tavern in New York City, and he speculates his ancestor was wearing the pendant during that last interaction.The mourning ring dates from about 1804, and follows a common practice of the 18th century, encasing a lock of Elizabeth Hamilton's late-husband's hair under a glass jewel. She lived for more than 50 years after Hamilton was killed in the duel with Burr, dying on Nov. 9, 1854 at the age of 97.The exhibit runs through March 17, 2019.\nBest-selling author of books like \"The Fault in Our Stars,\" opens up about exploring his fears through his writing\nThe U.S. saw a 3.4 percent uptick in violent crime in 2016, though rates remain near historic lows. See which cities fared worst\nIn the year since Hurricane Maria hit Puerto Rico, the island has lost a precious resource: hundreds of thousands of people who've left to build their futures elsewhere\n\n\n\nCopyright © 2018 CBS Interactive Inc.All rights reserved."}