{"id": "\n\nCBS News Logo\nVideo shows police officer punching 14-year-old girl during arrest", "paragraph": "Police in Coral Springs, Florida, are defending an officer's actions after he was filmed punching a 14-year-old girl while she was pinned to the ground during an arrest. The Coral Springs Police Department has issued a statement saying the cellphone video doesn't tell the entire story. \"The officer's actions were 100 percent within policy, legal and were not excessive,\" Dept. Chief Brad McKeone told reporters, CBS Miami reports.The department said officers were called to the Coral Springs Mall on Thursday because teens were harassing patrons, and a mother claimed one of the teens shoved her 5-year-old child to the ground. Police banned the group from the mall at the request of its security team, but police said they eventually returned. After one person was arrested, police said the girl in the video attempted to \"incite\" other teens. \"Officers attempted to take her into custody, at which time she began to fight and resist arrest. Due to her stature and aggressive behavior, officers took her to the ground attempting to get her to release her fists,\" the department said in a statement. The teen's mother, Jessica Dennis, said the officer went \"completely overboard.\"\"Her hands are pinned up, he's fish tailing her whole body with her shorts. It was just too much going on and she clearly wasn't aggressive,\" Dennis said in a news conference, CBS Miami reports. The family's attorney, Meeghan Moldof, only spoke about the moments captured on video and said she wouldn't comment on the criminal aspect of the case. \"But to say that the police officer was justified to punch her continuously while he has his knee on her back and her hands under her belly, the video speaks for itself.\"Police said they are not investigating the officer's actions, however, that could change if the mother decides to file a formal complaint, CBS Miami reports. Justin Carissimo is a breaking news editor at CBS News.\nBest-selling author of books like \"The Fault in Our Stars,\" opens up about exploring his fears through his writing\nThe U.S. saw a 3.4 percent uptick in violent crime in 2016, though rates remain near historic lows. See which cities fared worst\nIn the year since Hurricane Maria hit Puerto Rico, the island has lost a precious resource: hundreds of thousands of people who've left to build their futures elsewhere\n\n\n\nCopyright © 2018 CBS Interactive Inc.All rights reserved."}