{"id": "\n\nCBS News Logo\n1 dead and more than 100 injured in fuel tax protests in France", "paragraph": "PARIS -- One protester was killed and 106 others were injured at roadblocks set up around France on Saturday as citizens angry at rising fuel taxes rose up in a grassroots movement and posed a new challenge to President Emmanuel Macron. Police officers lobbed tear gas canisters at demonstrators on the famed Champs-Elysees Avenue in Paris as groups tried to make their way to the presidential Elysee Palace. Later, hundreds of protesters entered the bottom of the street dotted with luxury shops where the palace is located -- and where Macron lives. They were seen on BFMTV talking with riot police when the officers suddenly raised their shields and pushed the group back. French Interior Ministry officials estimated that about 244,000 protesters were involved in several thousand protests around the country, many of them spontaneous. The protester who died, a 63-year-old woman, was killed when a driver caught in the blockade accelerated in a panic at Pont-de-Beauvoisin, near Chambery, according to Louis Laugier, the prefect, or top state official, in the eastern Savoie region.  According to various French media reports, protesters reportedly knocked on her car as she tried to take her daughter to a hospital. An investigation was opened. Five people were seriously injured, while the others had more minor injuries, the Interior Ministry said in an early evening statement, raising an earlier count. It said 52 people were detained and 38 held for questioning. Protesters, wearing yellow safety vests and dubbing themselves the \"yellow jackets,\" pledged to target tollbooths, roundabouts and the bypass that ring Paris. The fluorescent yellow vests donned by the protesters must be kept in the vehicles of all French drivers in case of car troubles. People wearing yellow vests, a symbol of a French drivers' protest against higher fuel prices, block the motorway in Antibes, France, November 17, 2018.The ministry said security forces used tear gas in several places besides the Champs-Elysees to unblock major routes, including firing about 30 canisters at the entrance to the Mont Blanc tunnel. The nationwide protest was unusual due to its grassroots origins. It arose from within the citizenry, backed neither by unions nor politicians, although some took part in a clear bid for supporters. The amateur nature of the protests, often spontaneous and therefore illegal, made it tricky for police, who had orders to use dialogue over force but to stop protesters from completely blocking major routes or endangering lives or property. Police fired tear gas when a group moved into a street near the presidential palace. Hundreds of protesters took over the Place de la Concorde at the bottom of the avenue, shouting \"Macron resign\" as police looked on. By evening, 1,200 protesters remained in the Place \"protected by police,\" the Interior Ministry said. The rise in fuel taxes, notably for diesel fuel, spoke to those French who feel the president has asked ordinary citizens to make the largest efforts in his bid to transform France. The taxes are part of Macron's strategy to wean France off fossil fuels. Many drivers see them as emblematic of a presidency they view as disconnected from day-to-day economic difficulties and serving the rich. Robert Tichit, 67, a retiree, referred to the president as \"King Macron.\" \"We've had enough of it. There are too many taxes in this country,\" he said.People wearing yellow vests, a symbol of French drivers' nationwide protest against higher fuel prices, block the Paris-Brussels motorway in Haulchin, France, November 17, 2018.\n    Instead of a paintbrush, Alexandre Farto uses drills and jackhammers to create large-scale public art that exposes layers of a city's history. Once seen as a vandal known by his tag, Vhils, he has fueled the flourishing street art scene in his native Lisbon, Portugal, where murals have added a colorful touch to the otherwise overlooked or mundane, and he has transformed buildings in cities around the world by exposing layers of history. Seth Doane reports.\nResearchers say a new vaccine might prevent half of full-blown illnesses in infected people who receive the shotCopyright © 2018 CBS Interactive Inc.All rights reserved."}