{"id": "Astronaut Scott Kelly on capturing an Earth without borders", "paragraph": "Just before his launch into space in 2015, astronaut Scott Kelly got a shoutout during President Obama's State of the Union address: \"Scott Kelly will begin a yearlong stay in space. So good luck, captain. Make sure to Instagram it.\"   Kelly took the president's Instagram challenge to heart. On his fourth mission into space, from 250 miles up, he pointed his camera at the planet. Kelly has collected those space photographs in his new book, \"Infinite Wonder.\" \"You see continents and countries without any political borders. It gives you the impression that we're all in this thing called humanity together,\" Kelly told \"CBS This Morning: Saturday\" co-host Anthony Mason. \"Actually, the whole experience makes you feel insignificant.\"  It offered a unique vantage point on the vastness of it all. From Manhattan to the Milky Way. Kelly would spend 340 days in space. Some of his photography was for scientific purposes, but most was for his own pleasure.  \"Sometimes it was as simple as, 'Hey, that spot looks a little interesting down there.' You know, some dry lakebed in Iran, as an example. Let me take a picture of it and see what it looks like,\" Kelly said.   I'm going to miss the colors of #Africa! #EarthArt. #YearInSpace #ColorsOfEarth #earth #space #spacestation #issA post shared by  Scott Kelly (@stationcdrkelly) on Feb 22, 2016 at 3:43pm PSTThrough his lens he found a lake in Bolivia, wetlands in Brazil, a mountain meeting a desert in Algeria, valleys full of iron ore and manganese in Libya, and a lake in western Australia. Many of his photos look like abstract paintings, which, Kelly said, is exactly what he was going for. He became a master of microgravity photography.  \"So you're looking at a small spot on the Earth and the Earth is going by at five miles a second. You know it takes a very steady tracking motion to be able to take a picture that's not blurry,\" Kelly said. \"A lot of people, when they first get to space, you're very clumsy. … It's interesting when you see a bunch of new astronauts show up. They're like bouncing off the wall, stuff flying all over the place.\" The book also offers a look at life in space. One photo captures Kelly watching his brother on a TV in the International Space Station – losing on \"Celebrity Jeopardy.\"  Nursed the #SpaceFlowers all the way to today and now all that remains are memories. Happy #Valentines Day! #valentinesday #flowers #spaceflower #space #spacestation #iss #memoriesA post shared by  Scott Kelly (@stationcdrkelly) on Feb 14, 2016 at 11:18am PSTKelly, who now has well over a million Instagram followers, shared many of his photos online. \"Which was great because you could see the reaction you got from people,\" he said. \"I could see the comments. I would read the comments sometimes.\" One follower commented on the plants he was growing on the space station, writing that Kelly was \"no Mark Watney,\" a reference to the gifted botanist trapped on Mars in the movie \"The Martian.\" \"After that, you know, fight's on. I was gonna do whatever it took to make those flowers look better.\" He succeeded and posted a picture to prove it.  \"Earth is a beautiful place, whether you're looking at it, you know, all in one view. Or with a real close up lens.\" \nCBS News correspondent is joining Gayle King, Norah O'Donnell and John Dickerson\nWe only use about 1 percent of available crops to fuel our diets\n\"We took it very, very seriously, to be funny\"Watch CBS News anytime, anywhere with the our 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.Copyright © 2018 CBS Interactive Inc.All rights reserved."}