{"id": "\n\nCBS News Logo\nJayme Closs: Investigators receive 1,000 tips on missing teen", "paragraph": "Investigators said they have received over 1,000 tips in the case of missing 13-year-old Jayme Closs. The Wisconsin teen has not been seen since her parents were found shot to death inside their home.More than 800 of the tips received have been investigated, Barron County Sheriff Chris Fitzgerald said Saturday.\"We are using every resource available, and have conducted hundreds of interviews, multiple searches, and are using the technical and forensic expertise of our state and federal resources to locate the person or persons who committed this offense and to locate Jayme,\" Fitzgerald said in a statement.Authorities told CBS News that Jayme was home when her parents – 46-year-old Denise and 56-year-old James Closs –  were killed. Investigators said the front door was shot in. Jayme was ruled out as a suspect on the first day, and investigators believe she is in danger.This undated photo provided by Barron County, Wisconsin, Sheriff's Department, shows Jayme Closs.On Friday, investigators released a log of the 911 call, which was inaudible except for screaming in the background. The 911 call indicates Jayme was at home when it was made. The log indicated the 911 call came from Jayme's mother.Fitzgerald said earlier this week that investigators still have a \"100 percent expectation that she's alive.\"Jayme has been placed at the top of the FBI's Missing list, CBS Minnesota reports.\"It just breaks your heart that it's this close to home, because Barron's a small town. It's quiet,\" a neighbor told CBS Minnesota.\nBest-selling author of books like \"The Fault in Our Stars,\" opens up about exploring his fears through his writing\nThe U.S. saw a 3.4 percent uptick in violent crime in 2016, though rates remain near historic lows. See which cities fared worst\nIn the year since Hurricane Maria hit Puerto Rico, the island has lost a precious resource: hundreds of thousands of people who've left to build their futures elsewhere\n\n\n\nCopyright © 2018 CBS Interactive Inc.All rights reserved."}