{"id": "\n\nCBS News Logo\nTrump says U.S. will pull out of intermediate range nuke pact", "paragraph": "ELKO, Nevada — President Trump said Saturday he will pull the United States from the Intermediate-Range Nuclear Forces Treaty because Russia has violated the agreement. The president provided no details on the violations.The 1987 pact, which helps protect the security of the U.S. and its allies in Europe and the Far East, prohibits the United States and Russia from possessing, producing or test-flying a ground-launched cruise missile with a range of 300 to 3,400 miles.\"Russia has violated the agreement. They have been violating it for many years,\" Mr. Trump said after a rally in Elko, Nevada. \"And we're not going to let them violate a nuclear agreement and go out and do weapons and we're not allowed to.\"The agreement has constrained the U.S. from developing new weapons, but America will begin developing them unless Russia and China agree not to possess or develop the weapons, Mr. Trump said. China is not currently party to the pact.\"We'll have to develop those weapons, unless Russia comes to us and China comes to us and they all come to us and say let's really get smart and let's none of us develop those weapons, but if Russia's doing it and if China's doing it, and we're adhering to the agreement, that's unacceptable,\" he said.National Security Adviser John Bolton was headed Saturday to Russia, Azerbaijan, Armenia and Georgia. His first stop is Moscow to meet with senior Russian officials at a time when Moscow-Washington relations remain frosty over the Ukrainian crisis, the war in Syria and allegations of Russian meddling in the 2016 presidential race and upcoming U.S. midterm elections.There was no immediate comment from the Kremlin or the Russian Foreign Ministry on Mr. Trump's announcement.\"We are slowly slipping back to the situation of cold war as it was at the end of the Soviet Union, with quite similar consequences, but now it could be worse because (Russian President Vladimir) Putin belongs to a generation that had no war under its belt,\" said Dmitry Oreshkin, an independent Russian political analyst. \"These people aren't as much fearful of a war as people of Brezhnev's epoch. They think if they threaten the West properly, it gets scared.\"U.S. officials have previously alleged that Russia violated the treaty by deliberately deploying a land-based cruise missile in order to pose a threat to NATO. Russia has claimed that U.S. missile defenses violate the pact.In the past, the Obama administration worked to convince Moscow to respect the INF treaty but made little progress.\"If they get smart and if others get smart and they say let's not develop these horrible nuclear weapons, I would be extremely happy with that, but as long as somebody's violating the agreement, we're not going to be the only ones to adhere to it,\" Mr. Trump said.\nIt was a night of historic firsts, big wins for both parties\nThe sticker features both Virginia and the American flagCopyright © 2018 CBS Interactive Inc.All rights reserved."}