{"id": "\n\nCBS News Logo\nCounter-protesters, protesters spar at conservative rally in Philadelphia", "paragraph": "A conservative rally being held in Philadelphia on Saturday is drawing counter-protesters amid fears that more extreme right-wing groups such as the Proud Boys could make an appearance. The \"We the People\" rally was scheduled to start late morning and take place at Philadelphia's Independence Mall through the early afternoon.The event's Facebook page describes it as a rally for the \"silent majority,\" comprised of \"Patriots, Militia, 3%, constitution loving Americans, pro good cop, pro ICE, pro law and order, pro life, pro American value, pro gun and anti illegal immigration.\" The event description adds, \"ITS [sic] TIME TO SHOW PHILLY WHAT PATRIOTISM REALLY IS!!\"Although the Facebook page said that \"any violence, racism, or display of hate by any group or individual is extremely prohibited,\" some are concerned that the rally could turn violent if any violent right-wing groups show up. The Proud Boys, an all-men white nationalist group whose members often attend white supremacist rallies such as the \"Unite the Right\" rally in Charlottesville in 2017, may make an appearance at the rally.Protestors gather on Independence Mall in Philadelphia on November 17, 2018. A few counter-protests have been organized, including one by the progressive PushBack Campaign. The Facebook event for the counter-protest said \"the residents and allies of Philadelphia must stand in opposition to this escalation of the far-right's push into the city's culture and politics.\"On Saturday morning, some counter-protesters arrived well ahead of the rally itself. Police have arrested at least one person.  Several counter-protesters were holding signs with images of Gritty, the Philadelphia Flyers mascot who has been co-opted as an antifa symbol by some on the left. Daily Beast reporter Will Sommer tweeted pictures of a homemade sign. There were around a dozen protesters who showed up for the \"We the People,\" and they were far outnumbered by the counter-protesters.Max M. Marin, a political editor and reporter for Billy Penn, posted a video to Twitter showing an alleged \"proud boy\" head-butted as he was led away from the protest. The attacker was detained and more riot police were sent to Independence Mall, according to Marin.Grace Segers is a politics reporter for CBS News Digital.\nIt was a night of historic firsts, big wins for both parties\nThe sticker features both Virginia and the American flagCopyright © 2018 CBS Interactive Inc.All rights reserved."}