{"id": "How Ted Cruz vs. Beto O'Rourke could predict America's political future", "paragraph": "Few political races say more about the current state of American politics than the tight race for the U.S. Senate in Texas36 hours from now, polls will open for the midterm elections, and 470 congressional seats will be up for grabs. One of the most surprisingly competitive races has been unfolding in Texas. The Senate election there pitting incumbent Ted Cruz in the red corner, against challenger Beto O'Rourke in the blue corner, represents more than just gripping political theater, a clash of big personalities, and record-setting fundraising. On the surface, the candidates have plenty in common: two Texans a year apart in age who left the state for Ivy League schools before returning. They were even elected to Congress the same day six years ago. But in this divided cultural and political moment, Cruz-O'Rourke has become a national barometer for American politics, in the unlikeliest of places.Gov. Greg Abbott: As goes Texas, so will go the future of the United States of America! [CHEERS]At age 47, Senator Ted Cruz has gone from Tea Party disruptor to Republican Party stalwart.Gov. Greg Abbott: I welcome my good friend, your Senator Ted Cruz! [CHEERS]On a recent Sunday, he shared the stage with Texas Governor Greg Abbott in a roadhouse in his hometown of Houston.Sen. Ted Cruz: God bless Texas! [CHEERS]Cruz is equally familiar with the levers of power… and the art of politics.Sen. Ted Cruz: Now why is it that people come to Texas? Because Texas is where the opportunity is. Because Texas is where the freedom is!Ted Cruz at a campaign stop in TexasWe sat down with the incumbent at a Houston BBQ joint.Jon Wertheim: We've had our cameras following you for weeks. You're, you're working hard out there. What are the central principles you're trying to get across?Sen. Ted Cruz: When I ran six years ago, I told the people of Texas I'd fight every day for low taxes, low regulations, and lots of jobs. My twin passions in life have been the American free enterprise system and the U.S. Constitution.In this solidly red state, Cruz comes to battle armed with a loyal base: gun rights advocates, suburbanites, evangelicals, and big business. He also has the support of the sitting president.President Trump: Ted's opponent in this race is a stone cold phony named Robert Francis O'Rourke. Sometimes referred to as \"Bay—to.\"Actually, it's pronounced \"Beto,\" a nickname for Robert that he picked up in his hometown of El Paso. He's a three-term U.S. Congressman from the West Texas border. A former bass player in a punk band, O'Rourke has finally, at age 46, achieved rock star status.Beto O'Rourke while campaigning in TexasRep. Beto O'Rourke: We are the defining immigrant story and experience. A border state that understands the bilateral relationship with Mexico.O'Rourke counts on the vote of Texas' millennials, minorities and urban professionals. He's spent months threading his way through Texas. While his small team livestreams everything, even the most mundane moments. When we met him in Waco recently, both his odometer and his voice were tapped.Rep. Beto O'Rourke: I don't know that there could be much more on the line than there is today. I don't know if the choices could be any more clear, the contrast any greater.Jon Wertheim: Why do you think so many people, both inside Texas but beyond Texas, are so captivated by this race?Rep. Beto O'Rourke: I think the way in which we are running it, without PACs, without special interests, without pollsters, without consultants, going to every county, all 254. At this really divided moment, everybody, knowing that they're invited to be part of this. And the fact that some of your stereotypes about what you think Texas is, aren't necessarily true.He's right. The state's longtime slogan says it all: \"Texas - it's like a whole other country.\" But no more. Forget the image of Texas as this outsized outlier. Right now, it's actually a strikingly accurate reflection of the United States as a whole. Like America, the state is more diverse than ever. Four in ten Texans are Hispanic. And Cruz's hometown of Houston is set to overtake Chicago as the third largest American city after New York and L.A.Sen. Ted Cruz: Texas is growing like crazy. There's no state like Texas. I think we've got over 1,000 people a day moving to Texas.Texas may be carpeted with flatlands and prairies, but the open skies are being pierced with skyscrapers.Lawrence Wright: Texas is an urban state. Three of the most populist, top-ten cities are in Texas. And number 11 is Austin.Lawrence Wright is a longtime resident of Austin and the author of the book, \"God Save Texas.\" He characterizes the state in terms of two different radio frequencies.Lawrence WrightJon Wertheim: You've divided Texas into what you call AM Texas and FM Texas. Explain that.Lawrence Wright: Well, I think AM Texas is what most people outside of Texas think the state is. AM Texas is you know, Rush Limbaugh.Jon Wertheim: Social conservative. Care about their gun rights.Lawrence Wright: Very much so. Evangelicals and so on. And yet, there's a side of Texas that many people don't really understand, and that's the FM Texas, which is more urban, progressive, more like other cities in the country.The big question: which frequency will have the greater signal strength on Tuesday.Lawrence Wright: I think that a lot of the Tea Party political figures in power right now see over the horizon. And what they see is a big change coming their way. And that change is brown. And that change is young. And that change is not so conservative. That's the wave that's coming into Texas.Like all the midterm races, the specter of Donald Trump hovers over the campaigns. In the case of Cruz, his newfound coziness with the president strikes many as hypocritical given how bitterly they opposed each other in the last presidential election.Jon Wertheim: In 2016, you're running against President Trump and he disparages your father and your wife. You're accepting his support now. Reconcile that.Sen. Ted Cruz: Listen, 2016 was a hard-fought campaign. And there were hard blows thrown all around. Now, I could've said, you know, I've got hurt feelings. I don't like the things he said on the campaign. So I'm gonna take my marbles and go home. Frankly, I think that would've been a really selfish decision.Jon Wertheim: Marbles implies this is schoolyard stuff. What he said about your father.Sen. Ted Cruz: At the end of the day, it's not about me. It's not about being selfish and worrying about my hurt feelings. And so, listen, I don't apologize for not being self-centered and pounding my foot and refusing to work with the president. I'm gonna do my job for the people of Texas.Jon Wertheim: To what extent are you running against Ted Cruz? To what extent are you running against Donald Trump?Rep. Beto O'Rourke: I'm not running against anyone. I really mean that. I wanna make sure that we are aware of the choice before us. Yep, it's walls, it's Muslim bans, it's \"the press is the enemy of the people.\" We know where that road takes us. We've seen that movie before. But given the stakes, if we're only organized against those things, then we demean our opportunity to define this country in the most positive, ambitious way possible.Here's an old Texas saying: \"there's nothing in the middle of the road but yellow stripes and dead armadillos.\" In this case, both candidates are squarely in their lanes.Sen. Ted Cruz: He wants to abolish ICE; I want to abolish the IRS! [CHEERS]Rep. Beto O'Rourke: What if we ended that war on drugs, ended the prohibition on marijuana. [CHEERS]Lawrence Wright: Texans are gonna have a choice between a person who's seen as being too far right and another who's seen as being too far left. I think if Beto is elected you can then say Texas is no longer red, it's purple. If Texas is in play, if it's no longer the old reliable red that it's been for such a long time. Then the politics of the country are gonna change.Right now, the politics of the country are split in two, with Americans taking unyielding positions on climate change, guns, health care and immigration, a topic that has particular resonance in Texas, and may be the biggest divide between the candidates.  Rep. Beto O'Rourke: Although I'll tell you, I've lived almost my entire life, 46 years on this planet in El Paso, one half of the largest binational community in the hemisphere, also happens to be one of, if not the safest cities in the United States of America. Not in spite of, but because we're a city of immigrants.Sen. Ted Cruz: He wants to make it no longer a crime to cross the border illegally. (BOOING) That would be the very definition of open borders.Rep. Beto O'Rourke: I just think that the politics of trying to scare you about me is a politics that all of us are sick of. He'll tell you that I want open borders. His mischaracterization, his dishonesty, his lies, he employs those tactics because in the past they've been shown to be effective.Cruz has practiced traditional retail politics, and relies on his party's infrastructure, PAC money and traditional media. O'Rourke has kept his party's establishment at arm's length.Jon Wertheim: We've noticed you haven't had a lotta the stars of the Democratic Party, Elizabeth Warren, Bernie Sanders, former President Obama, they haven't come to Texas. Are you trying to distance yourself from the Party?Rep. Beto O'Rourke: I'm not distancing myself. But I don't want anyone coming in from the outside. I want the people of Texas to decide this on, on their own terms.This election may not come down to ideas, personalities, or even money, so much as who shows up. Early voting in Texas has shattered expectations, up more than 500 percent among young voters from the previous midterm.Jon Wertheim: We keep hearing about the importance of turnout on election day for this election.Sen. Ted Cruz: Yes. If you look at the dynamics, we've got numbers on our side. There are a lot more conservatives than there are liberals. What the O'Rourke campaign has had on their side is intensity. The liberals who are in Texas are really, really mad. They hate President Trump. That anger is dangerous. I mean, that anger is mobilizing. It means they're gonna show up no matter what. As I've said, they'll crawl over broken-- broken glass to show up.Jon Wertheim: That's not a good thing?Sen. Ted Cruz: Look, intensity is, is always potent. Intensity turns people out at the polls.Jon Wertheim: You working on the assumption that the more people that show up, the better your odds of winning?Rep. Beto O'Rourke: Yeah, I think the more people that show up, the better we do.Jon Wertheim: Why?Rep. Beto O'Rourke: Because the people who are fired up right now are-- are fired up to do something great for this country. That's my sense. I don't have a pollster, so I-- I c-- I can't quantify this assumption for you. But the turnout that we're seeing-- is already off the charts.Jon Wertheim: You mentioned no pollsters, no PAC money, and from the looks of it you're running this campaign out of the front seat of your minivan.Rep. Beto O'Rourke: Yeah.Jon Wertheim: Is that a good idea?Rep. Beto O'Rourke: Yeah, it's a great idea.Jon Wertheim: Why's that?Rep. Beto O'Rourke: It's fun. It's, it's the most direct way to connect with people. I love being on the road every day going to one community after the next. It's the only way to really get to know the state and the people that you wanna serve.Rep. Beto O'Rourke: When we decide that we're going to invest in people, great things happen ...Sen. Ted Cruz: If you believe in low taxes, and low regulations, and lots of jobs, if you believe in defending the Constitution.Jon Wertheim: You have two polished politicians, both in their 40s, ascending stars in their parties. Is there a sense, in Texas, the stakes are really high in this race?Lawrence Wright: Yeah, because you know, we already had one who ran for president. And but for Donald Trump, might've gotten the nomination. And then we have one that's already being talked about as a future presidential contender without regard to whether he wins this race or not. They each have a core constituency that wants to be heard. That's something they have in common and it runs very deep.Sen. Ted Cruz: If we lose our freedom here, where do we go? And so, look, I believed this when I was ten. I believed this when I was in college. I believe this now, that freedom works. Freedom matters.Rep. Beto O'Rourke: This, this is gonna be a defining moment for us. I'm confident that people in the future will look back on 2018. They'll look back on this state specifically and say that Texas decided all.Produced by Graham Messick. Associate producer, Jack Weingart.April 15, 2018\nSteve Kroft investigates Allegiant Air, a discount carrier known more for its ultra-low fares than its high record of in-flight breakdownsOctober 15, 2018\nLesley Stahl speaks with President Trump about a wide range of topics in his first 60 Minutes interview since taking officeMarch 11, 2018\nThe secretary of education has been one of the most criticized members of President Trump's Cabinet, but DeVos says she's \"more misunderstood than anything\"October 1, 2018\nIn his first profile on 60 Minutes, McCartney walks down memory lane while looking through old pictures and videos and talks about how he still feels the need to prove himsel...March 27, 2018\nMost people can't pronounce his name, but he's one of the best players in the NBA. And he has quite the story about how he got thereMarch 18, 2018\nA group of survivors of the shooting at Stoneman Douglas High School who refer to themselves as the \"mass-shooting generation\" have made it their mission to bring about gun r...March 11, 2018\nDesperation and fear are driving a dangerous industry that's virtually impossible to completely stopMarch 11, 2018\nOprah Winfrey reports on how trauma plays a role in childhood development and what new methods are being used to help kids who have experienced itMarch 11, 2018\nThe horses of an Argentine polo club may look normal, but the way they came into existence is anything but conventionalFebruary 11, 2018\nA bill passing through Congress could change the way states recognize concealed carry permitsCopyright © 2018 CBS Interactive Inc.All rights reserved."}