{"id": "Tesla's stock soars after hours on news of third-quarter profit", "paragraph": "Tesla on Wednesday reported a net profit for its third quarter, topping Wall Street forecasts and bolstering CEO Elon Musk as he tries to turn the money-losing electric car maker into a major auto manufacturer.Tesla posted net income of $312 million for the period on revenue of $6.8 billion, a sharp reversal from a loss of $717 million in the second quarter. That represents only the third time the company has notched a profitable quarter during its eight years as a public company. It has never turned a profit for a full year.Tesla said it delivered 83,000 vehicles from July through September, producing an average of 4,300 a week. Tesla's stock rose nearly 12 percent in after-hours trading. Andrew Left of Citron Research, a noted short-seller who for years had bet against Tesla stock, reversed his position. \"The story has become too compelling to ignore,\" he wrote in an analysis. Citron published charts showing that Tesla was \"destroying the competition,\" with the luxury Model S selling more than double the amount of the next competitor, the Mercedes C-class, and the mid-class Model 3 taking sales from Toyota and Honda.\"Tesla appears to be the only company that can actually produce and sell electric cars,\" Left wrote. \"As much as you can't believe you are reading this, we can't believe we are writing this!\"Earlier on Wednesday, Consumer Reports delivered a blow when it dropped Tesla six spots in its annual reliability rankings, putting it third from the bottom among 29 brands.  The Model S luxury car fell from \"above average\" reliability to \"below  average\" while Tesla's Model X SUV remained \"much worse than average.\"  The Model 3, Tesla's mass-market sedan, received an \"average\" reliability rating.-- The Associated Press contributed to this report. \nA decade after the Great Recession, the U.S. economy still hasn't made up the ground it lost\nThe top-paying jobs tend to cluster in two industries -- and may prove less vulnerable automationQuotes delayed at least 15 minutes. Market data provided by ICE Data Services.\n            ICE Limitations.\n            Powered and implemented by FactSet.Legal Statement.Copyright © 2018 CBS Interactive Inc.All rights reserved."}