{"id": "\n        Netflix Sees Oscar Gold in ‘Roma,’ but Hollywood Isn’t So Sure\n      ", "paragraph": "November 17, 2018https://www.wsj.com/articles/netflix-sees-oscar-gold-in-roma-but-hollywood-isnt-so-sure-1542464971 Los Angeles  Netflix Inc.’s shiny new lobby looks like the bedroom of a Little League champion—full of trophies for the television programming that has made the streaming service into one of the industry’s most powerful players.Blink and you’ll miss the Oscar among the Emmys and Peabodys, a 2017 prize for “The White Helmets,” which won best documentary short.This year, Netflix has its best shot yet at a major Academy Award with “Roma,” a portrait of a live-in nanny in 1970s Mexico City directed by Oscar winner Alfonso Cuarón. It opens in a few theaters later this month and begins streaming in December, but awards pundits already consider it among the front-runners for best picture, best director and best foreign-language film. First, however, Netflix executives must contend with forces within Hollywood that have no interest in helping the company win a major Oscar. Though watching a new movie on Netflix might seem unremarkable to the average consumer, the rollout of “Roma” has reignited a debate within Hollywood about whether a movie that doesn’t get a meaningful big-screen release should even be considered a movie. Netflix declined to comment on “Roma’s” Academy Award prospects. The Los Gatos, Calif.-based company has had Oscar hopefuls before, such as 2015’s “Beasts of No Nation” and last year’s “Mudbound.” It won the best documentary award last year for “Icarus,” on the Russian doping operations. But executives at traditional studios say “Roma” is the first time Netflix is playing in their sandbox, with a marquee director and a movie widely considered best-picture material. The movies to see this holiday season: This year’s winter films turn up the drama in ‘Ben Is Back’ and ‘If Beale Street Could Talk’ while providing moviegoers some escape from reality in ‘Mary Poppins Returns’ and a new ‘Spider-Man’For a company built on a subscription model, winning a best-picture Oscar is about more than just bragging rights. It would help Netflix convince more filmmakers of Mr. Cuarón’s caliber to come on board, potentially attracting more subscribers. In turn, their monthly $10.99 payments would subsidize movies and awards campaigns for years to come. Netflix bought distribution rights to “Roma” after Mr. Cuarón and Participant Media, which financed the budget of about $15 million, screened 10 minutes of footage for potential buyers. Executives from traditional studios were quick to point out the film’s commercial drawbacks. “We love the film. We all cried,” Mr. Cuarón said the executives would tell him and his associates, before launching into the liabilities. “It’s in Spanish. With nonactors. In black-and-white.”Netflix didn’t voice such concerns, said Mr. Cuarón. But its longstanding refusal to grant movies an exclusive theatrical release presented a problem for a director known for big-screen spectacle like the long tracking shots of his dystopian thriller “Children of Men” or the outer-space special effects of “Gravity,” for which he won the best-director Oscar in 2014. And a straight-to-Netflix release would likely alienate Academy members who remain purists about only awarding films with a major theatrical rollout, not just those that receive a qualifying run in at least one Los Angeles theater. Netflix’s initial conversations with Mr. Cuarón guaranteed some kind of theatrical treatment for “Roma.” That proved easier said than done. Major U.S. theater chains like\n\n\n\n\n\n\n            AMC Entertainment Holdings\n Inc.\n\n\n      and\n\n\n\n\n\n\n            Cinemark Holdings\n            \n\n\n      have consistently avoided showing movies that open around the same time as their streaming release. That left Netflix with only a handful of independent cinemas to show “Roma.” “This is a token release, a little gesture to play in cinemas for a little while and get awards,” said John Fithian,  president of the National Association of Theatre Owners, the exhibitors’ main lobbying group.Netflix appears determined to get as many people to watch “Roma” on the big screen as possible. It has taken “Roma” to film festivals all over the world, from Cairo to Toronto, Key West to Tokyo and Scottsdale to Mumbai.Though the film explores the private life of a young woman living with an upper-middle-class family, “Roma” features scenes of cinematic spectacle: Long shots featuring a human cannonball, dozens of young men in choreographed martial-arts exercises, a sequence featuring hundreds of student protesters storming the streets of Mexico City. Mr. Cuarón, for his part, thinks the best way to see it is in a theater, too. “The cinema experience and theatergoing experience is still the ultimate experience,” he said. But he can hardly get his own children to the theater to see a movie, he said, “no matter how much I beg.” The Netflix rollout of “Roma,” he said, is a compromise. “The two models, they can coexist,” Mr. Cuarón said. Netflix is learning just what winning the best-picture Oscar entails. The awards season in Hollywood has stretched into six months of schmoozing, coordinated by strategists who know how to glad-hand every Academy member and craft a narrative around why their client is the most deserving winner. In July, Netflix signaled to Hollywood that it was in the awards game for good, acquiring a prominent awards-consulting firm that has helped numerous movies win a raft of Oscars. The firm, LT-LA, is run by veteran strategist Lisa Taback,  a protégé of awards-campaign guru Harvey Weinstein who is known throughout the industry for an encyclopedic understanding of the dinners, cocktail parties and baby-kissing that build a successful voter-charming campaign. She has led campaigns for movies like “La La Land” (14 nominations, six wins), “Spotlight” (six nominations, two wins) and “Chicago” (12 nominations, six wins).While “Roma” may be Ms. Taback’s first big test at Netflix, it’s one she’ll soon face again. Martin Scorsese is in production now on “The Irishman,” a Netflix mob thriller starring Robert De Niro that many in Hollywood suspect will also try for a theatrical release and awards consideration.Netflix won’t report box-office figures for the “Roma” limited release, leading some competing studios to complain that it’s gaining the public-relations advantages of a theatrical release without the potential liabilities. Universal’s “First Man,” for instance, has seen its awards momentum slow among pundits since it underperformed at the box office. (Universal declined to comment.)“That’ll be their message: We sent it to theaters like you wanted,” griped one rival awards campaigner. Some Academy members may be warming to streamers. At 81 years old and with two Oscars for best editing (“Who Framed Roger Rabbit,” “Forrest Gump”), Arthur Schmidt might seem like the kind of Academy constituent not interested in the Netflix model. But the Santa Barbara, Calif., retiree said watching on the streaming service isn’t much different than watching the DVD “screeners” of awards hopefuls that studios send every year. “I would prefer to see it in the cinema because it’s the dark cinema and it’s a commitment,” said Mr. Schmidt. “But for so many years we’ve been getting the DVDs and that’s been a wonderful convenience.”Mr. Cuarón himself has mixed feelings about the obsession with awards. Speaking at a press conference last year following the production wrap of “Roma,” he said Hollywood overthinks the prize.“We shouldn’t give it more importance than it deserves,” he said.  Write to Erich Schwartzel at erich.schwartzel@wsj.com\n‘Green Book’ Review: Trying to Get AlongIn the 1960s, a black musician and his white chauffeur head south in this touching if didactic movie.Click to Read StoryWhy Director Luca Guadagnino Chose the Path of HorrorWith his remake of the scary ‘Suspiria,’ director Luca Guadagnino departs from lush love stories and embraces a life-long passion: the horror movie.Click to Read StoryMelissa McCarthy and the Strange Fun of an Unlikable RoleThe Emmy-winning actress, who plays a literary forger in ‘Can You Ever Forgive Me?,’ talks about her new movie, turning Sean Spicer into comedy, and why she doesn’t read the comments.Click to Read StoryAdvertisementClaire Foy’s MomentClaire Foy, who won an Emmy for her performance in Netflix’s “The Crown,” has starring roles in the coming movies “First Man” and “The Girl in the Spider’s Web.”Click to Read StoryHired for ‘A Star Is Born,’ Lukas Nelson Ascends, TooLukas Nelson joined “A Star Is Born” as a music adviser to Bradley Cooper, but his role soon expanded to an on-screen one.Click to Read StoryIn ‘The Favourite,’ Filmmaker Yorgos Lanthimos Upends a Period PieceThe main characters can all be found in British history. But to make the movie his own, Yorgos Lanthimos laced the story with invented touches that reflect his darkly comic style.Click to Read StoryAdvertisementMore on FilmAlfonso Cuarón’s new film has reignited a debate about whether a movie that doesn’t get a meaningful big-screen release should even be considered a movieAn error has occurred, please try again later.Thank youThis article has been sent toWSJ MembershipCustomer ServiceTools & FeaturesAdsMore"}