{"id": "The Wall Street JournalMagazine\n        Jonah Hill Makes Directing Look Easy\n      ", "paragraph": "November 17, 2018https://www.wsj.com/articles/jonah-hill-makes-directing-look-easy-1540915111 JONAH HILL WROTE and directed one of the best movies of the year. I’ll stop and do it for you here: Jonah Hill? Yes, Jonah Hill. Now, here I could spend the next 2,000 words regaling you with all the reasons that any surprise over the strength of Hill’s debut feature is unfair—rude, really—because while Hill, who is 34, may have launched to fame in 2007 as a smartass comic imp in Superbad, he quickly and nimbly repositioned himself, still in his 20s, into a brilliant character actor, working with some of the greatest directors. I could yank up the IMDb to show that Hill has collaborated with, among others, Judd Apatow (in The 40-Year-Old Virgin; Knocked Up), Bennett Miller (Moneyball), Quentin Tarantino (Django Unchained), Martin Scorsese (The Wolf of Wall Street) and the Coen brothers (Hail, Caesar!)—what Hill refers to as “the best film school in the world.” I could remind you that Hill has been nominated for best supporting actor Oscars twice—as Brad Pitt’s numbers-crunching protégé in Moneyball and as Leonardo DiCaprio’s drug-vacuuming consigliere in The Wolf of Wall Street. But I know how it is. I could tell you all these things, and you’d still come back to me with a look: Jonah Hill wrote and directed one of the best movies of the year? It’s OK. This is how narratives develop—sometimes fairly, sometimes not. And it is pretty crazy, even to Hill, all of what’s happening now. It’s midafternoon in New York City, and we are in the airy offices of A24, the boutique studio releasing Hill’s film, Mid90s. Dressed in a crisp white shirt and black pants—conservative attire for a man recently photographed bopping down the street in a Phoenix Suns basketball jersey—Hill bounces as if he’s an expectant father in the waiting room. Mid90s is fresh from its September premiere at the Toronto film festival, where it got strong reviews, so A24 is allowing Hill to go back in and add a few final flourishes, like the Next Auteur he very well may be. “Heaven,” Hill says, beaming and taking a sip from his bottled water. “I love being in this world. I could edit it for five more years.”Sometimes you interview people in the movie business and it’s clear that, while they may like the film they’re promoting, it’s a job, and they have their stories and quotable lines dialed in and soon will be on to the next shiny object. Hill does not give off that impression. Making Mid90s seems to have filtered deeply into his bones. (And atop his skin—Hill now has a tattoo on his arm that reads STRONG BABY and features a baby lifting a barbell, a nod to one of the funnier scenes in the movie.) All he wants to do is stuff like this, he says. “I just want to make things from my heart,” Hill says. “That’s all I care about, making things. If there’s a great part, I’m lucky enough to get a great part. If I’m lucky enough to write another film that means something to me and direct it.... I want to make things with people I love.”It’s the kind of earnest mission statement that might have provoked Hill’s Superbad character, Seth, to bang his head against a locker door. But after a few minutes with Hill, you realize this Hill is closer to the real one. In conversation, he is self-aware, sensitive, effusive. He gushes. He loves. If you’re expecting a snarky quip machine, you’re going to be disappointed.“Jonah has this openness,” says Hill’s good friend Emma Stone, who starred with him 11 years ago in Superbad and recently reunited with him in the surreal Netflix series Maniac. “I’ve always felt so loving and connected to him, because whenever we’d talk, it was just the most raw, sweet thing—the way he expressed himself. I love that quality in people; it’s rare. I’ve been watching him in everything he’s done, and I’ve been blown away. Jonah’s hysterically funny, but I also think he’s heartbreaking. I really do think he’s a genius.”Hill’s new film is putatively about a small group of teen skateboarders in Los Angeles, but skateboards are just an entry point. Set before the millennium, as its title says—pre-iPhones, pre-Yeezys, pre–everyone being terrible to each other on social media—Mid90s is really an immersive look at male adolescence and all its conflicting joys and toxicities. It owes more than a small debt to Kids, director Larry Clark and screenwriter Harmony Korine’s gritty firecracker about New York teens. (It’s a knowing homage—Korine has a cameo in the film.) Mid90s is not as bleak as Kids, but it does not airbrush the skateboard scene like a Mountain Dew commercial. Hill’s movie harks back to an era when the activity was rough, DIY and marginalized, illegal in some settings and definitely not cool with every parent. At its center, Mid90s tells the story of Stevie (played by Sunny Suljic), an undersize kid with a single mom (Katherine Waterston) and a menacing older brother (Lucas Hedges) who finds comfort in a crew of skaters at a local shop. Stevie is intoxicated by the rebellion of the scene. Sometimes, he’s just intoxicated. The kids drink, smoke, say horrible things about women and make brainless mistakes. Mid90s is often laugh-out-loud and, at other times, harrowing and hard to watch, but it nails the seductive tedium of boys hanging out. It’s a crisp postcard at 82 minutes.The film roiled around inside Hill for years. He’s friends with the director Spike Jonze, and for a time, he tinkered with a script and talked with Jonze about the project, reshaping the idea (originally the skateboarders’ story was told in flashback). Directing appealed to Hill, but he hadn’t quite summoned the nerve until he went to see then-29-year-old director Damien Chazelle’s Whiplash with Jonze and Bennett Miller, who directed him in Moneyball. As Chazelle’s name flashed on the screen, Hill says, “Bennett turned to me and said, ‘That guy’s younger than you…you better get to it.’ ” Hill smiles. “That’s what really kicked my ass into gear. I have to thank Damien Chazelle if I ever meet him.”Hill is an L.A. kid who grew up in an L.A. family not deeply into show business but close enough. An oft-repeated detail of his bio is that his father, Richard Feldstein, served as an accountant for rock clients including Guns N’ Roses. This is not as exotic as it sounds, Hill warns. “My dad said, ‘[In L.A.,] even if you’re a dentist, you’re the dentist for so-and-so.’ ” Hill’s mother, Sharon Lyn Chalkin, worked for a period as a costume designer and in other jobs on set. His kid sister, Beanie Feldstein, is an actress who played Saoirse Ronan’s best friend in Lady Bird. (“It’s a good thing I can direct, because once the world discovers her, there’s really no use for me,” Hill says of Beanie.) Hill’s older brother, Jordan Feldstein, was the manager of Maroon 5, helping propel the L.A. act to global stardom. Jordan died suddenly last year of a heart attack at age 40: “I love him, and I miss him very much. And that’s really all I’m gonna say about that,” Hill says of his brother. It’s a quote he’s given before, in an interview with New York magazine, and the only topic Hill declines to elaborate on.Like his Mid90s protagonist, Stevie, Hill was drawn to skateboarding in his childhood—he describes himself as enthusiastic but “not very good.” “Still, it came into my life at a time where I really needed it,” he says. “It was a group of outsiders who found one another.” Mid90s ripples with hyperprecise period details and cameos that will please the hard-to-impress skate crowd. Its soundtrack is an utter banger—I haven’t stopped listening to the Pharcyde since I saw it. (Oscar-winning musicians Trent Reznor and Atticus Ross contributed to the score.) But what really pops is its cast. Hill turned to real skaters, with limited or no acting backgrounds, and coaxed moving performances from all of them (there are a handful of true pros, like Hedges, who got an Oscar nomination for Manchester by the Sea). He hunted for talent in skate parks—it’s where he found Suljic, who, hilariously, had to skate worse than he’s capable of to play the newbie Stevie. Given all the youth and lack of experience, camaraderie was important, Hill says. He had flashbacks to Superbad, when he himself was barely underway as an actor. “Now I am the old guy at the table,” he says, laughing. “Like the dad. Everyone’s sitting around at lunch roasting each other, it’s so fun.” One day, Hill noticed one of the skater/actors, Olan Prenatt, looking pensively at something below the table. “I look down, and he has his rumpled-up script under the table, and he’s working his ass off,” Hill says. “I went outside and cried. I was emotional. He worked so hard.”“Jonah’s an amazing actor, and he explains it from an actor perspective,” says Suljic, who had one significant credit (Yorgos Lanthimos’s The Killing of a Sacred Deer) before taking on an intense part in which he’s on-screen for virtually the entire film. “He also just came at me as a friend. He made it comfortable for me and the cast to just, like, go all out.”  Mid90s moves fluidly and it crackles with life—to the point it seems improvised, but it’s almost all in Hill’s script. It’s a paradoxical feat, a director and crew working their guts out to make a film feel like it was done on the fly. “There’s lot of work in naturalism if it’s not naturalism,” Hill explains.There’s a scene midway through the movie that speaks to this achievement. Stevie and the crew have come to a local skate hangout teeming with life—skaters doing tricks, homeless people clustered on the outskirts. There’s a moving interaction between Stevie’s crew and a homeless man (played by the rapper Del the Funky Homosapien), but what’s most striking about the scene is all the concurrent action—there are a thousand things happening at once, all around, and the scene envelops you, as if you’ve parachuted into a real-life skate world. Hill says the moment was at least partly inspired by his time around Scorsese in The Wolf of Wall Street, and how the 75-year-old director and his cinematographer, Rodrigo Prieto, labored to create elaborate, artful scenes.“You do so much work to build this thing, that by the time the actors get there, they don’t even know a movie’s happening,” Hill says. On Wolf, “I would walk in with Leo [DiCaprio] and we’d shoot. But Rodrigo and Marty, they’d done the work.” That’s also Hill’s style, says Mid90s producer Eli Bush. “Jonah has a crazy work ethic,” Bush says. “He puts in the work, he puts in the time. He spent a lot of time in a kind of film school and has a huge amount of respect for the craft and [its] heroes. He really put in the effort.”Could Hill be planning to walk away from acting to focus on directorial work? Acting remains part of his agenda, Hill says—he just needs a good reason to do it. For Netflix’s Maniac, a darkly comic series in which Hill and Emma Stone play troubled souls seeking inner peace in a radical pharmaceutical trial, his reason was simple: He wanted to work with his friend Emma again. “Honestly, I wanted to hang out with her,” Hill says. “We’re both so busy, we never get to hang out. I was like, ‘OK, cool, I get to work with Emma? Amazing.’ ”The pair had not worked together since Superbad—Stone’s first movie—and one of the many odd pleasures of Maniac is seeing how far Superbad’s Seth and Jules have come in the decade since home economics class. Hill and Stone now have four Oscar nominations between them, with Stone winning best actress last year for La La Land, which, of course, was directed by Chazelle, who inspired Hill to direct Mid90s and—it’s all perfect.“She’s unbelievable,” Hill says. “To see how she’s flourished as an actor?” He shakes his head.Before we go, I would be remiss if I didn’t address Hill’s side life as a style maven. In the Instagram era, he has become something of an exemplar of unselfconscious cool, mixing hypercurrent streetwear with sui generis personal touches. A Jonah Hill outfit is ready for anything, anytime. For the past couple of years, fans have gathered in Brooklyn to celebrate Jonah Hill Day, which Hill himself attended this summer (and showed up an hour early for, awkwardly). The internet is full of photos and tributes to Hill fashion: a flowing brown overcoat, tie-dyes, soccer shirts, a brief interlude with pink hair. The attention appears to delight him. “It’s really flattering, because I do love fashion, and I do care about style,” Hill says. “And it’s been amazing to have your style recognized. It’s so personal, you know.” Sometimes, he will purposely have fun with it—as in the case of that Phoenix Suns jersey, which he ridiculously tucked into his pants before going outside for a walk. Photos of a smiling Hill in the curious get-up immediately went viral. “I was trying to make my sister laugh,” he says now. “I looked in the mirror and I was like, ‘This is sick. I’m wearing dress shoes, dress pants and a basketball jersey.’ I knew [paparazzi] were going to photograph me, because they’re always just outside of my house. So I had fun with it. It was me playing with everyone. That’s me commenting on the joke.”It’s such a strange planet now. A famous man can walk outside in a funny shirt, and a few hours later, it’s a global sensation, shared like photos of a moon landing. “More people will see that than [Mid90s]!” Hill exclaims. “That’s where we’re at in the world. But it’s just where we’re at, you know?” •  Write to Jason Gay at Jason.Gay@wsj.comHow the Record-Breaking Sale of a Lichtenstein Painting Changed Agnes Gund’s LifeAn art collector and patron turns her talents to criminal justice.Click to Read StoryDavid Chang’s Culinary Universe Is Still Growing“It’s like, ‘Be better or f—ing see you later.’”Click to Read StoryAdvertisementIn ‘Black Panther,’ Costume Designer Ruth E. Carter Found a Career-Defining Challenge‘Black Panther’ pushed Carter to abandon rigorous historicism for fantastical Afrofuturism—and put her talents in even higher demand.Click to Read StoryThe Columnists - The Columnists on AdviceActor Rainn Wilson, author Fran Lebowitz, chef Yotam Ottolenghi and others open up about advice -- whether to give it, when to heed it and choosing to ignore it -- in this second episode of WSJ. Magazine’s series, The Columnists.Click to Read StoryWSJ. Magazine\n\nCome for the egg freezing, stay for the juice bar.\n\nTo add to chart-topping ballads, Oscar-winning anthems, Emmy-winning broadcasts, Tony-winning revivals and a holiday album, the singer-songwriter has emerged as a force for social justice.\n\nOver five decades, the designer has created a sweeping vision of America. Now he’s looking ahead to what’s next for his $9.85 billion corporation.\n\nWith “Fleabag” and “Killing Eve,” the writer-actor-producer has emerged as one of television’s most distinctive voices—and she is looking forward to her next act.Once Hollywood’s go-to comedic sidekick, the two-time Oscar nominee is the writer and director of a new film, ‘Mid90s’An error has occurred, please try again later.Thank youThis article has been sent toWSJ MembershipCustomer ServiceTools & FeaturesAdsMore"}