{"id": "Daimler Starts Ride-Hailing Venture with China’s Geely ", "paragraph": "November 17, 2018https://www.wsj.com/articles/daimler-starts-ride-hailing-venture-with-chinas-geely-1540377483SHANGHAI—\n\n\n\n\n\n\n            Daimler\n AG\n\n        DMLRY -0.76%\n\n\n      and Zhejiang Geely Holding Group Co. will form a premium ride-hailing company in China, using the German auto maker’s Mercedes-Benz cars and electric vehicles made by Geely, the companies said Wednesday.A partnership between the Chinese car maker and Daimler has looked likely ever since Geely Chairman Li Shufu amassed a 9.7% stake in Daimler in February, becoming its largest shareholder. Geely also owns Sweden’s Volvo Car Group.Daimler builds cars in China with another local auto maker, state-run\n\n\n\n\n\n\n            BAIC Motor\n Corp.\n\n        1958 3.45%\n\n\n      , making mobility services an obvious business in which to collaborate with Geely. The new ride-hailing service, which will be a 50-50 joint venture, is expected to begin operations in 2019, the companies said.Geely offers a ride-hailing service called CaoCao, but it remains small compared with Didi Chuxing, which outlasted Uber in a costly battle for control of the Chinese ride-hailing market. Uber quit China in 2016 in return for a 20% stake in Didi, which is backed by tech giants\n\n\n\n\n\n\n            Tencent Holdings\n Ltd.\n\n\n      and\n\n\n\n\n\n\n            Alibaba Group Holding\n Ltd.\n“With Geely Group, we have found an excellent partner to expand our mobility services in China,” said Klaus Entenmann,  chief executive of Daimler’s financial-services unit, following the signing of a memorandum of understanding at Daimler’s Stuttgart headquarters.\n“\n        The biggest challenge is getting onto people’s phones as an app.\n        ”\nThe ride-hailing service will be part of Geely’s “transformation from a vehicle manufacturer into a global automotive-technology group,” Geely President An Conghui said.The century-old automotive industry is facing top-down technological change that has auto makers envisioning a future in which fewer people will buy automobiles and more will use Uber-style smartphone-based mobility services. Some are choosing to pool resources to help manage the transition from focusing on making cars to increasingly providing digital services.In March, Daimler and\n\n\n\n\n\n\n            BMW\n AG\n\n\n      said they would team up to provide mobility services in Germany. Last month,\n\n\n\n\n\n\n            Ford Motor\n Co.\n\n\n      set up a 50-50 joint venture in China with local manufacturer Zotye Auto to deliver ride-hailing services.“It’s a smart move for Geely to collaborate with Daimler to play this new game,” said Bill Russo, founder of Shanghai-based consultancy Automobility. Geely taps into a prestigious brand and a technology pipeline, while Daimler gets access to a large mobility-services market, he said. Challenging China’s tech giants for a slice of the ride-hailing market won’t be easy for companies that, like Daimler and Geely, come from a manufacturing background, auto analysts say.“The biggest challenge is getting onto people’s phones as an app,” said Janet Lewis, Macquarie Capital Research’s managing director of equity research. Moreover, the big ride-hailing incumbents like Didi and Uber provide a full range of services through their apps, blunting auto makers’ efforts to differentiate themselves by offering premium rides.Some auto makers are seeking to join forces with Didi and draw on its software smarts rather than attempt to offer rival services.In April,\n\n\n\n\n\n\n            Volkswagen\n AG\n\n\n      said it was close to forming a joint venture with Didi to develop ride-hailing services. The same month, Didi said it had formed an alliance with 31 other entities—including\n\n\n\n\n\n\n            Toyota Motor\n Corp.\n\n\n      , Volkswagen and the Renault-Nissan-Mitsubishi partnership—to develop vehicles and operating platforms for future mobility services. Write to Trefor Moss at Trefor.Moss@wsj.com\n      Appeared in the October 25, 2018, print edition as 'Daimler Targets China Ride Hailing.'\n    Premium ride-hailing company will use Daimler’s Mercedes-Benz cars and electric vehicles made by Geely An error has occurred, please try again later.Thank youThis article has been sent toWSJ MembershipCustomer ServiceTools & FeaturesAdsMore"}