{"id": "\n        A Model Gondolier With a Relentless Regimen\n      ", "paragraph": "https://www.wsj.com/articles/a-model-gondolier-with-a-relentless-regimen-1540040400 For most, a gondola ride evokes a romantic cruise powered by a crooning boatman through the winding canals of Venice.That’s not how Michael Angelo Ruffino thinks of it. The 35-year-old has facilitated his fair share of marriage proposals in his 10-year career as a gondolier in Newport Beach and Sunset Beach, Calif. “I get to be a footnote in one of the most important days in people’s lives,” he says. But for him, the job is about fitness as much as entertaining customers.“I’d love before my days are done to see gondola racing making it into the Olympics,” he says. He’s hoping to win multiple medals to add to his collection at the U.S. Gondola Nationals (yes, a real thing) in Providence, R.I., in November.This unusual career piqued Mr. Ruffino’s interest several years ago. He was planning to work as a teacher and looking to make some extra money during the summer. Mr. Ruffino liked having the opportunity to sing while on the job. A connection to his Italian heritage also appealed to him. Mr. Ruffino soon discovered rowing a gondola offered an opportunity for him to compete, too. Now, in addition to working as a yoga and fitness instructor and nude model for artists, Mr. Ruffino spends several hours a week training. About two times a week, Mr. Ruffino spends about an hour doing a form of yoga called sculpt, which he describes as hot yoga with weights. He will wear a weighted vest and an altitude mask while practicing. He’ll also spend about an hour four times a week doing traditional yoga. Mr. Ruffino also spends about a half-hour four times a week doing exercises that focus on his joints, tendons and ligaments. He’ll do strength training, using machines and free weights, for 90 minutes twice a week. He added the weight training to his regimen after a competition in Stillwater, Minn., where strong winds caused him to fall behind. “That made me realize you can have the best technique in the world, but if it’s a windy day, it’s just a matter of who is stronger,” he says. Mr. Ruffino developed his own twist on burpees—an exercise that involves a jump in the air followed by a push-up—to help him train. Instead of a traditional push-up, Mr. Ruffino will do a staggered push-up. His left hand rests on the ground and his right hand on a block and a bit closer to his hip, to help mimic the angle of the oar. Rather than jumping, he does a lunge hop. Mr. Ruffino calls these gurpees, or gondola burpees, and by the time the competition comes around, he likes to be able to do 45 minutes of them straight.He also spends as much time in the boat as possible perfecting his stroke, including practicing with teammates. Finally, Mr. Ruffino exercises his mind. About seven to 10 times a week, he’ll visualize his races. Since Mr. Ruffino competes in the distance races, which can last as long as 45 minutes, maintaining focus is important. “If you have a bad stroke, it takes a long time to re-correct,” he says. Mr. Ruffino uses a variety of equipment in his workout throughout the week. He spent about $80 on the weighted vest, about $80 on the altitude training mask and roughly $10 on a metronome, which he and his teammates will use to stay in sync. He’s also well-stocked with more typical exercise equipment, like a jump rope ($10) and medicine ball ($30).For competitions he wears a blue, striped T-shirt in the mode of the classic gondolier look, and white work pants.Mr. Ruffino describes his body type—he’s 5-foot-11 and 160 pounds—as “light and slender,” which makes it difficult for him to bulk up and build muscle mass. To counter that, Mr. Ruffino says he tries to get as many healthy calories as possible. He’s frequently drinking shakes with foods like banana, peanut butter, berries, açaí and added protein powder. He’ll also try to eat carbohydrate-heavy meals in advance of workouts. “I eat more pizza than any two people I’ve ever seen in my life,” he says. When Mr. Ruffino and his teammates train together, they sometimes use a metronome to keep their strokes on the same rhythm. When he’s training alone, Mr. Ruffino gravitates toward music with a high energy, but that also has a steady drumbeat, like punk or Afrobeat.Want to become a competition-level gondolier? (Or at least learn how to row one of the boats?) Experience in other sports can help. Athletes who understand the water, like surfers, stand-up paddlers and rowers, make some of the best gondoliers, says Greg Mohr, who owns Gondola Adventures, a company that offers gondola rides in Irving, Texas, and Newport Beach, Calif. Michael Ruffino works for Mr. Mohr.Cyclists and motocross racers also have “a little bit of an edge,” Mr. Mohr says. Those sports also require athletic control of a vehicle.For John Kerschbaum, 61, who has taken passengers on gondolas in Minnesota’s St. Croix River since 2001, decades of experience in tai chi have been crucial to his success driving the boats. “It’s the only thing that’s kept me on the boat a number of times,” he says.Both agree that the key to success in gondoliering is practice. That’s perfecting the technique, voga alla veneta, used to propel gondolas and other, similar boats. It’s been “tweaked and perfected to be effective and yet easy on the body,” Mr. Mohr says. The efficiency of the Venetian stroke allows gondoliers to continue rowing beyond their athletic prime. Matthew “Marcello” Haynes, who owns La Gondola Providence in Rhode Island, which will host the U.S. Gondola Nationals this year, is 39. That’s almost twice the age of many of the rowers working for him. Thanks to a technique he’s honed over the past 20 years, Mr. Haynes can hold his own against gondoliers half his age and, if the distance is long enough, even beat them. “Give me enough time and I could smoke them all,” he jokes. What’s your workout? Tell us at  workout@wsj.com \nAn Ageless Ultramarathon RunnerIntrigued by the idea of running farther than a 26.2-mile marathon, a 71-year-old former CEO started training for 50, sometimes 100, miles instead.Click to Read StoryA Breakdancing Underdog at 60An ad executive looking for a more fun way to lose weight discovers he can’t stop dancing against competitors half his age.Click to Read StoryAdvertisementThe Sport Where You Kick a Hole in OneFootGolf, an unusual hybrid of soccer and golf, was enough to motivate a Miami man to get in shape.Click to Read StoryA Golf Obsession With Balance at the CoreA competitive amateur athlete abandoned tennis for golf years ago, but has reached a new level of fitness on the links with a stability ball.Click to Read StoryShe Collects Marathons Between Deals for MicrosoftHow Peggy Johnson prepared for the race in Berlin as part of her goal of running the five major events in her favorite sport.Click to Read StoryAdvertisementMore on FitnessA Southern California boatman puts in hours each week to prepare for the U.S. Gondola NationalsAn error has occurred, please try again later.Thank youThis article has been sent to"}