{"id": "The Wall Street JournalMagazineSwiss Architecture Firm Herzog & De Meuron Celebrates 40 Years ", "paragraph": "November 15, 2018https://www.wsj.com/articles/swiss-architecture-firm-herzog-de-meuron-celebrates-40-years-1541342966 KLEINBASEL IS A LITTLE wedge of Basel, Switzerland, stranded in Germany, just across the Rhine from the city proper. Today the district is a hub for both commerce and culture—most famously as the home of Art Basel, the annual fair that turns the city into the capital of the global art world every June. But in the 1950s, Kleinbasel was a sleepy place, a working- and middle-class redoubt bounded to the north by woods and vineyards and to the south by the river, warm enough in summer to swim in despite the rushing current.This is where Pierre de Meuron met Jacques Herzog. “We grew up 200 yards from each other,” recalls de Meuron, now 68. The pair first became acquainted when they were preschool age. Though they were from differing backgrounds—de Meuron’s family was Francophone, Herzog’s German-speaking—such distinctions meant little in polyglot Basel. And what they had in common was more compelling. “Our interest was always in doing something with our hands, understanding how things worked,” says de Meuron. They harbored a special enthusiasm, he adds, for “roller coasters and ships.”The two men haven’t gotten terribly far from the playrooms and schoolyards of their youth. Today their studio is a scant five-minute walk from the old neighborhood, and they spend much of their time at the office tinkering with models and dreaming up gee-whiz notions. But the pair now have a firm of 390 employees playing alongside them, with another 62 scattered across five satellite branches around the world. And they’re no longer dealing in idle fancies but creating some of the most challenging and startling architecture to be found anywhere.Now celebrating its 40th-anniversary year, the firm of Herzog & de Meuron (H&dM) enjoys a reach extending from Kleinbasel, where it designed the 2013 Messe building, in which Art Basel is now held, to Hong Kong, where its upcoming M+ museum will be a cultural landmark in a city better known for high-rises. After six decades of mind-melding friendship, the founders have succeeded in forging a shared sensibility and then diffusing it through their immense body of work, without ever seeming to dilute the formula. “We have never stopped being involved in every project, starting each project,” says Herzog, also 68. It’s a level of commitment that helps give the firm’s projects their ineffable presence. Other than that, it can be difficult at times to say what does tie together the firm’s diverse portfolio. Lower Manhattan’s looming 56 Leonard apartment building, familiar to locals as the “Jenga” tower; the sublime void of the turbine hall at London’s Tate Modern; San Francisco’s de Young Museum, resembling a rusty dinosaur grazing in Golden Gate Park: H&dM has been all over the map in every sense, taking a different formal tack with every banner commission. Fashion designer and arts patron Miuccia Prada,  who has collaborated with the architects many times, says she is “always attracted by the beauty of their work”—though the sheer range of projects they’ve done together, from an eye-popping retail location in Tokyo to an austere runway design for last spring’s 2019 cruise show in New York, demonstrates just how flexible H&dM’s sense of beauty can be. As difficult as it is to fix an aesthetic label to the firm, its conceptual MO is even harder to describe, and talking to the founders doesn’t necessarily clarify anything. “You can ask me how I see it,” de Meuron hedges. “It doesn’t mean I know exactly what it is.” His colleague is even less forthcoming. “I don’t want to do any self-interpretation,” says Herzog.For critics and fans who have followed the designers’ ascent—starting with their first projects around Basel that earned them a cult following, through their 2001 Pritzker Prize win, to the enthusiastic reception of their glittering Elbphilharmonie concert hall complex, which opened in Hamburg, Germany, last year—the relative taciturnity of the partners can be convenient, allowing for various explanations to be projected onto them. For curator and architect Terence Riley, who commissioned the firm to design the Pérez Art Museum Miami when he was its director, the key is culture: “Jacques and Pierre have this very Swiss thing,” he says, pointing to their sense of “orderliness” combined with their “amazingly innovative ideas.” For photographer and collaborator Thomas Ruff, who helped create murals for H&dM’s 1999 library at Germany’s Eberswalde University for Sustainable Development, it’s all about the partners’ artistic predilections. In working with them, Ruff says, he has found that they “really feel like artists themselves, and that’s why they have this outlook and this great interest in contemporary art as well as architecture.” Others might point to the importance of collaboration or materials or history or any one of a dozen-odd elements and attributes that mark H&dM’s unique practice. Theories abound, and the designers seem to revel in the confusion. What really defines the practice is a combination of all these things—including, and perhaps especially, the obfuscation. The playwright Tom Stoppard once said that a good piece of theater should be “a series of ambushes,” emotional and intellectual sneak attacks launched against the audience. Herzog & de Meuron buildings often seem to deploy a similar stratagem. Does the firm’s Dominus Valley winery in Yountville, California, look like a flat black block? Go inside and you’ll see the skin is made of wire cages filled with stones, the light peeking through them to cast a mottled pattern on the floor. Are the piers in the 1111 Lincoln Road complex in Miami Beach just solid slabs of concrete? Look closer: They’re as softly textured as old wood, and they gleam like alabaster at sunset. More than simply subverting expectations, the architects practice a kind of radical defamiliarization, using every tool at their disposal to create environments so perfectly off-kilter that they achieve an entirely new kind of balance.  A FEW DAYS BEFORE ART BASEL gets underway, in advance of a busy week of meetings and openings, Herzog takes a moment to reflect. The firm’s offices range over a collection of conjoined buildings, including lofted model warehouses and book-lined meeting rooms; but the weather is warm, the swimmers back in the Rhine, so Herzog is out in one of the open-air courtyards. “I’m someone who leaps into things,” he says, and it’s easy to believe him: Wiry and lean, the architect balances spryly on a porcelain stool. “Pierre reveals possibilities to anchor a concept, and then I’m more the person who makes these changes, these jumps,” Herzog continues. The dynamic between the partners has always been an essential feature of their practice, and their differences have only compounded their mystique. Where de Meuron is subdued, contemplative, almost impassive, Herzog is frank and energetic. That two so very distinct personalities have managed to forge an effective partnership is a testament to their years of professional coevolution. Well before the present glut of studios with acronymic titles, H&dM garnered international attention in the 1990s as a relative rarity in a profession then dominated by big-name lone wolves. The firm’s earlier projects, like the 1994 signal box for the Swiss railway, an inscrutable parallelogram of ribbed copper, stood in stark contrast to the work of many contemporaries whose “personal interest,” as Herzog sees it, was in “revealing the individual through the gestural stroke.” \n“\n        Our collaboration is a complete involvement, a love affair. it is an act of passion and trust.\n        ”\nTrying to recall his earliest thoughts about architecture, de Meuron claims not to have had any. “I had no idea what it was,” he says, and his partner concurs. When the two young men were finishing high school, although both were art enthusiasts steeped in Picasso and Manet, de Meuron thought he would go on to pursue engineering, while Herzog was considering biology and chemistry. Wanting something more, something that combined the humanities and the sciences, the two friends talked through their options, landing on design almost by default. They both enrolled in Zurich’s polytechnic institute. “Immediately I was sucked in,” says de Meuron, “because [design] touches so many different domains, so many different disciplines.” The same process of dialogue that led them to their shared métier remains at the center of their approach, always undertaken in the same intrepid spirit. To understand how Herzog and de Meuron progressed from that initial decision, it helps to visit the enormous archive the firm opened in 2014 in its mixed-use building in Basel’s Dreispitz neighborhood. The structure, a sort of neo-brutalist pagoda on one side of a reinvented cultural district (its master plan was also created by the architects), houses a satellite office, fabrication facility and five stories of curios and castoffs dating back to the late 1970s. Among its treasures is one of the first H&dM projects to win public notice, Lego House, a 1985 work composed partly of the famed plastic bricks. Just a couple of feet high, it’s little more than a miniature of a suburban home with a conventional gabled roof—“a form that even children draw,” as Herzog notes. But this was no dollhouse. Originally exhibited at Paris’s Centre Pompidou, it was stuffed with tiny versions of everyday objects and appeared alongside video stills of the interior, turning it into a meditation on memory and the idea of home.The penchant for evocative artistry has been a staple of the architects’ catalog ever since—as has the gable, the closest thing H&dM has to a signature trope. Elsewhere in the Dreispitz archive are the original concept models for VitraHaus, a flagship for the eponymous furniture maker on its nearby campus. “We wanted a building that would show to the public that we were very serious about this issue of the home,” says Vitra’s chairman emeritus and board member Rolf Fehlbaum,  who made the headquarters site an architectural wonderland, featuring celebrated buildings by Zaha Hadid and others. Herzog & de Meuron’s contribution, opened in 2009, is a series of oblong houses stacked atop one another, their plain, dark facades capped at both ends by enormous windows; inside is a light-filled aerie with curving staircases and warm organic finishes. Fehlbaum was so pleased with the results that he turned to H&dM again for Vitra’s Schaudepot, a brick open-storage facility, completed seven years later, that also features the telltale roofline. “There’s something anonymous about it,” Fehlbaum says of the motif, “something that allows a number of associations.” Whatever the formal or cultural source material, the true hallmark of Herzog and de Meuron’s work is their artistic ambition. The scale of that ambition can be measured in the caliber of the artists with whom they regularly collaborate, including Rosemarie Trockel, Michael Craig-Martin and, perhaps most prominently, Ai Weiwei. “Our common ground,” says Ai, “is that we see architecture as an ethical practice…in between the highest aesthetic judgment and the most practical problem solving.” The architects and the artist discovered their shared affinities in 2002; Ai had long been interested in design, and together they won a competition to produce one of H&dM’s highest-profile structures to date: the celebrated Bird’s Nest stadium, a gleaming coil of steel ribbons built in Beijing for the 2008 Olympics. The Sino-Swiss team reunited last year to create Hansel & Gretel, an immersive installation at Manhattan’s Park Avenue Armory that confronted visitors with projected images of their own movements as tracked by overhead drones. A sharp-eyed critique of the 21st-century surveillance state, it was a project very close to the artist’s heart, and he found the architects well attuned to his ideas, capable of creating an environment that could spark a sense of information overload and anxiety, topics that have long been among Ai’s chief preoccupations. “Our collaboration is a complete involvement, a love affair,” says Ai. “It is an act of passion and trust.”  ONE DAY IN EARLY JUNE, Pierre de Meuron is in Kleinbasel to attend the groundbreaking of one of the firm’s newest undertakings, the second tower for pharmaceutical giant Roche. Nearly identical to its predecessor, the high-rise will make a double icon out of what is already the most recognizable figure on the Basel skyline. In suit and tie, de Meuron blends almost seamlessly with his corporate clients, and as he picks up the ceremonial spade he seems somewhat embarrassed to be the center of attention.“If you’d [told] me when I was 5 or 10 that I would do most of the buildings on that site,” says de Meuron, laughing. Still evidently bewildered by his own success, the architect is hardly less determined to capitalize on it than his energetic partner. A couple of weeks later, de Meuron is in New York preparing for a prospective client meeting in the lobby of the Public hotel. Opened only last year, the Lower East Side hot spot has already become a local standby, and the upstairs lounges are crowded with creatives in various attitudes of hip—an unlikely setting for a sexagenarian Swiss in business attire. But then H&dM’s sense of chic has always involved an element of the improbable. Ian Schrager, the hospitality magnate behind the Public, has sought out the firm for that very reason, beginning with their first collaboration, the nearby 40 Bond condominium completed in 2007, and continuing through to the brand-new 160 Leroy residential mid-rise. All of their projects together, Schrager notes, have been risky bets on high design in unlikely urban locales, which suits the developer’s style. “I like to pull a rabbit out of my hat,” says Schrager. “If there’s something that I really want to build, I build it with them.” It doesn’t hurt, the developer adds, that “they’re very sensitive and intelligent about the budget.”This aptitude for combining the avant-garde with the pragmatic helped the firm score the commission for the new Upper East Side home of Dasha Zhukova, the international collector and the founder of Moscow’s Garage Museum of Contemporary Art. The particulars of the design remain very much under wraps, but Zhukova confirms that the facade will feature a pattern of inverted brickwork, a subtle nod to the surrounding buildings that still preserves “a flicker of innovation.” “One of the special things about them as architects is that they’re always thinking about the economic, political, even the spiritual landscape, as well as the practical,” Zhukova says. “They think about civilization as much as functionalism.” On a sensitive residential project like this one, the client’s baseline prerequisites come first, but H&dM’s subversive streak is bound to assert itself.Part of being subversive means being secretive, a quality rare among architects and one at which the Basel duo excel. Back at firm headquarters, whole studios are closed-door affairs, with clandestine projects in the works. The compound teems with young employees from around the world, an atmosphere “like a college campus,” as Schrager puts it, or maybe more like a government laboratory. Even the precise nature of the founders’ collaboration—who makes what decision and when—is something of a mystery, and according to Herzog, that’s just the way they like it. “We’ve never really revealed what we do,” he says. “It would be wrong.” The coyness seems at odds with an office that also prefers to be “f—ing straightforward,” as Herzog adds, punching the air with his fist. Then again, it’s not clear that any explanation, either for the practice or for its projects, would be half as gratifying as the mental revolutions one experiences when encountering a Herzog & de Meuron building for the first time. With all that the architects’ work has to reveal, their greatest innovations are the ones still waiting to be discovered. Corrections & Amplifications An earlier version of this article had reversed the captions identifying Jacques Herzog and Pierre de Meuron. (11/6/2018)\nJonah Hill Makes Directing Look EasyOnce Hollywood’s go-to comedic sidekick, the two-time Oscar nominee is the writer and director of a new film, ‘Mid90s’.Click to Read StoryHow the Record-Breaking Sale of a Lichtenstein Painting Changed Agnes Gund’s LifeAn art collector and patron turns her talents to criminal justice.Click to Read StoryDavid Chang’s Culinary Universe Is Still Growing“It’s like, ‘Be better or f—ing see you later.’”Click to Read StoryAdvertisementIn ‘Black Panther,’ Costume Designer Ruth E. Carter Found a Career-Defining Challenge‘Black Panther’ pushed Carter to abandon rigorous historicism for fantastical Afrofuturism—and put her talents in even higher demand.Click to Read StoryThe Columnists - The Columnists on AdviceActor Rainn Wilson, author Fran Lebowitz, chef Yotam Ottolenghi and others open up about advice -- whether to give it, when to heed it and choosing to ignore it -- in this second episode of WSJ. Magazine’s series, The Columnists.Click to Read StoryWSJ. Magazine\n\nCome for the egg freezing, stay for the juice bar.\n\nTo add to chart-topping ballads, Oscar-winning anthems, Emmy-winning broadcasts, Tony-winning revivals and a holiday album, the singer-songwriter has emerged as a force for social justice.\n\nOver five decades, the designer has created a sweeping vision of America. Now he’s looking ahead to what’s next for his $9.85 billion corporation.\n\nWith “Fleabag” and “Killing Eve,” the writer-actor-producer has emerged as one of television’s most distinctive voices—and she is looking forward to her next act.And Jacques Herzog and Pierre de Meuron celebrate 60 years of friendshipAn error has occurred, please try again later.Thank youThis article has been sent toWSJ MembershipCustomer ServiceTools & FeaturesAdsMore"}