{"id": "Ireland coach Schmidt laughs off Hansen claim Irish are World Cup favourites", "paragraph": "Share this withIreland coach Joe Schmidt laughed off his New Zealand counterpart Steve Hansen's claim that the Irish are now World Cup favourites after beating the All Blacks 16-9 in Dublin on Saturday.The world's number-two side secured their first ever home win over Hansen's top-ranked world champions.\"I guess they are favourites [for the World Cup],\" said Hansen.However, Kiwi native Schmidt described the New Zealand's coach as \"a little bit of banter\".\"So for us to be favourites when they have been the world number-one team for nine years, and continue to be the world number-one team?\" said Schmidt, when asked to respond to Hansen's comments.\"We were at home, and they were coming off a long series of games where they have travelled around the world a number of times.\"The crowd were phenomenal tonight. And that's a lot of things stacked in our favour.\"So we'll take tonight, and leave 11 months' time for 11 months' time.\"The World Cup? In 12 months' time? We've got to work hard to make sure we're ready for the USA [next week],\" said Schmidt, who is expected to decide by the end of this month whether he will agree to a contract extension with Ireland beyond next year's global championship.It remains unclear whether twice World Cup-winning coach Hansen will stay after next year's tournament in Japan and Schmidt has been suggested a possible successor after the All Blacks boss does step down.\"I've huge respect for Steve, Fozzy [Ian Foster], and Scott MacLeod, their coaching staff,\" added Schmidt.The All Blacks will retain their number-one ranking despite Saturday's defeat but Hansen said before the contest that the winner would earn the global bragging rights.\"As I said earlier in the week this was number one versus number two in the world,\" said Hansen. \"So as of now they are the number-one team in the world.\"So if you want to make them World Cup favourites, go ahead.\"The New Zealand coach said his side were \"gutted\" by Saturday's defeat as the Irish, helped by Jacob Stockdale's second-half try, earned a deserved victory despite late All Blacks pressure.\"[But] This  will be very useful as this team hasn't suffered many [defeats] over the past three years,\" he said.Share this withNorthern Ireland have the better chances but have to settle for a 0-0 draw in the friendly against the Republic of Ireland in Dublin.Paul McGinley says he is baffled by Rory McIlroy's intention to play just two European Tour events in 2019.Josh Warrington and Carl Frampton feel a pay-per-view clash between two shows is \"unfair\" on fans and \"not good for boxing\".Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}