{"id": "Can listening to bees help save them - and us?", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowCan artificial intelligence (AI) and machine learning help save the world's bees? That's the hope of scientists who are scrambling to reverse the dramatic declines in bee populations.Bees are in trouble, but we're not quite sure why. It could be the overuse of insecticides; air pollution; warming temperatures; the varroa destructor mite; or even interference from electromagnetic radiation.Or it could be a combination of all these factors. But until we have more data, we won't know for sure.So the World Bee Project and IT firm Oracle are creating a global network of AI \"smart hives\" to give scientists real-time data into the relationships between bees and their environments.Up to six sensors will be mounted on hives, capturing the sound of the bees' buzzing, the movement of their feet and wings, the weight of their honey, the hive's humidity, as well as local weather and pollution levels.Sensors on beehives aren't new, but using AI and machine learning to analyse the data they collect should yield new insights, says John Abel, vice-president of cloud and technology at Oracle.  \"Sound is probably the most important data set,\" he says.\"We convert it into a data feed and use this via machine learning to inform the beekeeper. And with Oracle Cloud we can get lots of data into it very quickly - we've got technology which is self-learning, self-tuning and self-patching, so it can automate what it needs to do.\"Oracle - which says the data will be owned by the World Bee Project - will use blockchain to verify that the data is coming from a particular hive and hasn't been tampered with.Simon Potts, professor of biodiversity at Reading University, says it can be quite hard with simple laboratory or field experiments to tease out what is affecting bees. \"With AI and machine learning we can start to put together the signature of health and unhealthy hives,\" he says.\"The holy grail would be to indentify early warning indicators of problems.\"For instance, when bees swarm, the existing hive can lose half its population and half of its honey, as those bees about to leave will gorge themselves first. So beekeepers want to minimise swarming. Bees often swarm due to inadequate ventilation or high temperatures, so having live data on humidity, temperature and the weight of a hive's honey would all give early indications of problems. A beekeeper would then be able to take preventative action.Bees are crucial for agriculture: 1.4 billion farming jobs and three-quarters of the world's food supply - worth about $577bn (£447bn) a year - depend on the pollination of crops. And of the 100 crop species that feed 90% of the world's population, 70 are pollinated by domesticated and wild bees.\"Honey bees are the single most important pollinator on the planet,\" says Prof Simon Potts.In the past 50 years, the volume of agricultural production dependent on pollination has risen by 300%, yet at the same time bee populations have plunged. In the UK, for instance, the number of honey bees fell by 54% between 1985 and 2005. In the US the number of honey-producing bee colonies fell from 5.9 million to 2.4 million between 1947 and 2008 - a fall of 59%.\"Over-industrialisation, the use of pesticides, the destruction of natural habitats and climate change are all behind this,\" says Sabiha Rumani Malik, founder and executive president of the World Bee Project, which aims to monitor the health of bees across the planet.More than 40% of invertebrate pollinator species - particularly bees and butterflies - are facing extinction, and the potential impact of this on agricultural production is just one of the factors behind last year's stark warning on global food security from the Food and Agriculture Organisation (FAO).Yet what scientists have lacked is a comprehensive set of data to analyse the rates of bee declines in different regions of the world and the differing reasons for this.In the UK, an invasive species that is now threatening honey bees is the Asian hornet. When the much larger hornet enters a hive, worker bees will surround it and effectively cook it - and themselves - to death by raising their own body temperatures. Live monitoring would again allow earlier action to be taken in removing such predators.In Manchester, Cisco and the city's Mi-Idea innovation centre have partnered with Australia's data innovation group, Data61, to track bees' movements by using IoT technology.The team wants to understand phenomena such as colony collapse disorder, which sees the worker bees disappearing and leaving the queen isolated.The project fits RFID [radio-frequency identification] chips safely onto individual bees so researchers can record their movements.\"We need to increase food production in the next two decades and we have declining bee populations around the world,\" says Peter Carter at Data61.\"So we're using the data analytics and machine learning to accelerate the rate at which we're making discoveries. We can then make smart decisions about where we invest our human resources, our scientists.\"More Technology of BusinessOnce the AI has been taught what to look for on UK bee hives, the World Bee Project plans to roll out these smart hives globally. Farmers and beekeepers around the world have already expressed interest in joining the AI hive network.\"Every additional hive we connect gives us hundreds of thousands more data points,\" says Oracle's John Abel. \"It will get more and more accurate.\" The aim is to attune the AI to different environments.\"The challenge for a beekeeper in, say Burkina Faso, is different from one outside London,\" says Mr  Potts. \"There will be some general points that all honey bees respond to, but that won't tell us the full story, so we will have to work with local keepers.\"Sabiha Malik is hopeful: \"Technology can allow us to move swiftly and make a significant change. With collaboration we can arrest the decline of bees and improve the situation.\"The BBC is not responsible for the content of external Internet sitesFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}