{"id": "How a capsule wardrobe helps women fleeing abuse", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowWhen Rachael Bews left her abusive partner and returned home to Ross-shire, it was a room full of bin bags and the words of an old friend that inspired her to help other women in crisis. The black bags in the women's aid support centre were full of old clothing donations for women who had fled their relationship and had been forced to leave behind all their possessions.While the donations were well meaning, Rachael was told the old clothes were sometimes in poor condition and \"could smell a bit foosty and unpleasant\".Rachael remembered the words of an old friend who had suffered domestic abuse.She had told her that having a good coat and a pair of shoes gave her the confidence to keep going.The friend had said that being able to dress with dignity helped her hold her head high as she took her children to school and looked for work to get her life back on track.Rachael told BBC Scotland's Mornings with Kaye Adams she thought that giving women a bag of somebody else's old clothes would not make them feel good about themselves.She wondered if what women needed were new clothes that could boost their self-esteem and dignity.Rachael set up Alicas in February and is now about to send out the first of 300 packs of clothing to women in need.They are made up 30 essential items of new clothing, chosen to be the right size and style and packaged to include a hand-written note of support.The woman who inspired the name of Rachael's charity is Alison Grant, a nurse who is also one of the directors of Inverness Women's Aid. Alison, who is originally from the north east of England, fled to Inverness in 2007, with her three young children.She says she had given up a good job as a nursing sister and taken off from her partner without any possessions so that she would not get caught.Alison says: \"I couldn't take a pram, couldn't take my baby's clothes, could not take anything. I was fleeing for my life. \"It is a reality that a lot of women are having to survive daily.\"She says that her aunt in Inverness bought her a red coat that was her \"suit of armour\".Along with a pair of shoes, an application of lipstick and a hair do, Alison says the coat meant she could adopt a \"fake it till you make it\" attitude.\"I left with my final shred of dignity and I held onto it with my coat and my shoes,\" she says. \"The damage to your self-esteem is the greatest cost to women who are living in emotionally abusive relationships.\" \"It is about maintaining dignity,\" she says. \"At the end of the day that's what is chipped away from you.\" Rachael was about 18 when she worked in a restaurant with Alison and they became friends.Alison made a huge impression on the teenager, who says she was positive and strong despite having lost everything.Rachael soon moved to Edinburgh to study and then went to teach in Italy for the summer.It was here that Rachael herself was forced to escape a violent partner.She says the relationship started as a whirlwind romance but soon turned sour and Rachael was forced to flee the country.She returned to her parents in Ross-shire in a traumatised state and sought help from the local women's aid branch.\"I sat in that support room surrounded by bin bags and I had Ali's words echoing in my ears about how important it was to have a good coat and a pair of shoes,\" Rachael says.After some research she discovered that many retailers were incinerating new clothing when it reached the end of a sales cycle.She set about convincing them to donate it to her cause.Despite having lost touch with Alison, she named the charity Alicas (Ali's coat and shoes) in Alison's honour.It has launched a project to get 10,000 items to make 300 clothing packs to give to women in crisis.It is supported by Scottish Women's Aid and Shakti, who will distribute the parcels through referrals from their local support workers for domestic abuse survivors\"It is all new and unworn, the vast majority with the tags still on,\" Rachael says. \"We take donations from clothing retailers and designers but also from members of the public who have maybe bought something and it has sat in the back of the wardrobe unused.\"\"We also include wardrobe staples, such as packets of tights and socks and ladies' underwear. \"We are saying to folk that if they are out doing their shopping and can pop an extra packet in their basket and send it on to us we will make sure it gets into the hands of women who really need it,\" she says.Alison knew nothing about the charity in her name until recently when Rachael managed to track her down.She says she is honoured to have inspired the idea.For Rachael it is all about women to be able to retain their dignity, identity and self-confidence.She says: \"It is the difference between women receiving a bin bag of old clothing and how that impacts her self-worth versus receiving a parcel of 30 items chosen specifically to meet her size, style and religious or cultural needs.\"Something packed with love and finished with a handwritten note of support and solidarity.\"Details of organisations offering information and support with domestic violence are available at bbc.co.uk/actionline, or you can call for free, at any time to hear recorded information on 0800 888 809.The BBC is not responsible for the content of external Internet sitesFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}