{"id": "Tottenham boss Mauricio Pochettino will not 'risk' players at West Ham", "paragraph": "Share this withMauricio Pochettino will not \"risk\" the welfare of his players in search of his first trophy as Tottenham manager.His side play West Ham at London Stadium in the Carabao Cup on Wednesday just two days after being beaten by Manchester City on a Wembley pitch that had been used for an NFL match a day earlier. \"It is going to be difficult to repeat some players,\" said Pochettino.\"I don't believe too many players will be ready and fresh to play.\"Tottenham had to rearrange their top-flight match against City because of delays to their new stadium and that has resulted in the short turnaround before the visit to face the Hammers in the fourth round.\"I can put out the same players [as Monday] with a risk that they become injured,\" Pochettino said, who took over at Spurs in 2014.\"It is so difficult, it is not easy. We are going to assess all the players and it is less than 48 hours to compete again having had the circumstance of playing on a pitch that is so difficult to play on - it was tough and a very competitive game.\"We will see which players can repeat, some can be on the bench and some they need to rest.\"The game against West Ham will be the second of four outings for Spurs in nine days, with games against Wolves on 3 November and PSV Eindhoven on 6 November to come.Midfielders Dele Alli and Christian Eriksen came on as substitutes against City after returning from injury and Pochettino has to decide whether to give them more game time as they get back up to match fitness.He added: \"We are going to use players that normally are not involved in the last few games and, of course, we are going to have the opportunity to see them and give the opportunity to play.\"Will be very competitive, it is a derby. Of course there are no excuses, no complaints and on Wednesday [we will be] ready again to compete and try to win.\"Share this with            Get latest scores and headlines sent straight to your phone, sign-up to our newsletter and learn where to find us on online.The latest rumours and stories from around the world of football.Analysis and opinion from our chief football writer.How to get into football - the most popular sport in the world, with clubs and facilities throughout the UK.Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}