{"id": "Breadboards and dog collars: England's unusual museums", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowA village famous for its new year tradition of men prancing around with flaming barrels of tar on their heads has added another unusual string to its bow, by becoming home to a museum of science fiction props - which has opened in the cellar of the curator's house.Adventures in Science Fiction is the latest historical depository to join the 2,500 museums already in the UK.And with so many to choose from, there must be a museum to please pretty much everybody.So if you're into dog collars (of the canine rather than clerical variety), or simply adore antique breadboards, we've got it covered. The Allendale attraction, which held its grand opening on Saturday, was a labour of love for founder Neil Cole who describes it as his \"passion project\".Located in the cellar of his Grade II-listed home, the museum includes original items from Dr Who and part of Thor's costume from the Avengers.\"It's a wonderful place to keep all my things, and at the same time it's great to open it up. Science fiction has become more mainstream so I thought 'people might actually want to see this',\" says Mr Cole.And if you don't want to visit, you could just let Zygons be Zygons.A veritable nightmare for those with chronomentrophobia, xylophobia and ornithophobia, this collection of more than 600 cuckoo clocks from the Black Forest region in Germany has been amassed by brothers Roman and Maz Piekarski.They began training as horologists and restorers at the age of 15. Now in their 60s, the clock-loving duo \"eat, sleep and live cuckoo clocks\" at their museum, Cuckooland, housed in an old school building in Tabley, Cheshire.\"It's a way of life\", Roman says.\"When I look at it all we must be mad, we're even working on them on Christmas Day - I can't remember the last holiday we had.\"Their hard work seems to be paying off - all of the reviews on TripAdvisor are five out of five, apart from those by people who visited without making an appointment. Sitting alongside the museum's cuckoo clock collection is a smaller one reflecting an earlier passion of theirs - vintage motorcycles. Time trials must be fairly easy to organise.The British Lawnmower Museum might already be familiar to fans of the long-running BBC One comedy Would I Lie to You? after Lee Mack told his fellow panellists he had donated some dibbers - hand tools for making holes in the ground for seeds - to the attraction in Southport, Merseyside. They disbelieved him, although the comedian was, in fact, telling the truth.Mack isn't the only celebrity to feature in the museum. A section dedicated to \"lawnmowers of the rich and famous\", boasts contraptions formerly owned by Prince Charles and Princess Diana, Queen guitarist Brian May and the mild-mannered TV gardener-turned-novelist Alan Titchmarsh.Founded by lawnmower-mad Brian Radam, the museum - home to garden machinery dating from the Victorian era - is \"devoted to keeping a small part of British engineering heritage alive\".Lee Mack's Dibber at the National Lawnmower Museum, Southport. pic.twitter.com/Cu8JY8oPsUEnd of Twitter post  by @RogierDeWeydenOne reviewer described the attraction as \"certainly justifying the short walk from Southport town centre\". Praise indeed.Based at Leeds Castle near Maidstone in Kent, the Dog Collar Museum is another collection that's arisen from a personal passion.Described by the castle publicity as \"fun for children and adults alike\", the museum contains canine neckwear donated by Gertrude Hunt in 1977 - both she and her husband were keen collectors of art and antiquities, but she had a particular - some might say peculiar - interest in dog collars.Exhibits date back to the late 15th Century and include iron collars with spikes, used to protect hunting dogs in case their prey turned on them and attacked them.There are also finely-crafted prestige collars in brass or silver, the ultimate in doggy bling, for highly prized pets.Peter Bonta, from Leeds Castle, says \"such is the universal appeal of man and his best friend that this collection continues to be a steadfast attraction\".Visitors ought to be aware - no dogs are allowed in.The Antique Breadboard Museum, based in the front room of founder Madeleine Neave's house in Putney, London, claims to be the world's first - and we suspect, only - such establishment.Rapt visitors can feast their eyes on a \"stunning collection of breadboards and bread knives, butter dishes, butter knives, cheeseboards and related items dating from the 1840s\".Pride of place are several decorative and bespoke breadboards that were popular in Victorian times.Ms Neave says: \"The concept of personalised breadboards with Bible quotes and uplifting morals has been forgotten. So we are looking at rediscovering and hopefully reviving a worthwhile aspect of English heritage.\"Although open for less than a year, she says the museum has already attracted \"bakers, craftspeople, nostalgia hunters, eco-warriors... and those wanting brownie points when troublesome mothers-in-law visit\".Because mothers-in-law just love breadboards.We confess that it would be, ahem, quite the inconvenience for most British tourists to visit the Toilet Seat Museum, which is located in a nonagenarian's garage in the Texas city of San Antonio.Now in his late 90s, Barney Smith has been charming visitors to his unusual attraction for decades.The King of the Commodes proudly shows off his collection of hundreds of loo seats, all of which are decorated and personalised.However, he has finally decided to call time on his toilet seat enterprise and is selling off his collection - with the stipulation that it remains intact.There have been reports of interest from buyers in other countries, and so, who knows, perhaps it will one day join the list of bizarre British museums.The BBC is not responsible for the content of external Internet sitesFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}