{"id": "In pictures: Follow Ghana's 'yellow-brick road'", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowIf you follow the yellow-brick road in Ghana, it does not take you to the Land of Oz's Emerald City, but rather to La - a district in the capital Accra.This is where artist Serge Attukwei Clottey periodically carpets the dusty streets with giant yellow plastic tapestries.Clottey told the BBC his work is about property rights. The residents of many poor communities in Africa cannot prove land ownership because they do not have the paperwork.Each of the squares is cut from a distinctive type of jerrycan, known in Ghana as a \"Kufuor gallon\" - named after former President John Kufuor - and then sewn together to form plastic carpeting.In the early 2000s, when Mr Kufuor was in power, there were water shortages and the large yellow containers began to be seen around the country as people used them on their long treks to collect water.Some are still in use, but many now lie discarded and Clottey repurposes them for his art, which he calls \"Afrogallonism\".Clottey estimates that he has used 30,000 Kufuor gallons since 2005 when he started using them in his artwork. About 3,000 of them have gone into the yellow-brick road project that began in 2016, he says.The artist works with an assistant, but local people also get involved in cutting up the Kufuor gallons and stitching the pieces together.They are excited to be making an artwork that gets to be shown in their home rather than sent around the world - and they are happy that it draws foreign visitors to La, Clottey says.He sketches what he wants the work to look like, but its exact form emerges organically as different people get involved.As part of the project he also gets people to help him collect the Kufuor gallons.Clottey goes to dumpsites with friends and they dress up in drag to symbolise how the Kufuor gallons are associated with women. People take the Kufuor gallons that they have collected to Clottey's workshop, where they are weighed and paid $3 (£2.30) per kilogramme.Clottey expects to complete the project in 2020 when he hopes to have marked out an area in La which he says belongs to his family. Pictures by Nii Odzenma"}