{"id": "Football gossip: Sanchez, Martinez, Pochettino, Bale, Karius, Neymar, Mbappe", "paragraph": "Share this withParis St-Germain are interested in signing Manchester United and Chile forward Alexis Sanchez, 29, next summer. (Sun)Belgium manager and former Everton boss Roberto Martinez is the favourite to become the next Real Madrid manager. (Mail)Tottenham players fear manager Mauricio Pochettino, who has been linked with Real Madrid and Manchester United, could leave the club next summer. (Telegraph)DC United striker Wayne Rooney on life in the USReal Madrid will double Pochettino's wages to £17m a year if they move for the 46-year-old Argentine, but are prepared to wait until the summer. (Sun)Former Real Madrid player Michael Laudrup has turned down the chance to become manager of the Spanish club. (AS)Wales winger Gareth Bale, 29, came top of a poll of Real Madrid fans asked who the team's worst performing player has been this season. (Marca)West Ham midfielder Declan Rice, 19, will commit to playing for England, rather than the Republic of Ireland. (Star)Chelsea are interested in signing AC Milan's 24-year-old Spanish forward Suso in January. (Tutto Mercato Web via Express)Newcastle United could face a struggle to keep English defender Jamaal Lascelles in January with Tottenham and Chelsea continuing to monitor the 24-year-old. (Newcastle Chronicle)Arsenal are being priced out of signing British players and will have to look overseas if they are to strengthen their squad in the next two transfer windows. (Mail)Hoffenheim's on-loan Arsenal forward Reiss Nelson, 18, has played down the chances of leaving the Gunners on a permanent basis to move to the Bundesliga. (Independent)Liverpool goalkeeper Loris Karius' two-year loan move to Besiktas will not be cut short in January. (Liverpool Echo)Manchester United manager Jose Mourinho expects the club to sign a central defender in the January transfer window. (Manchester Evening News)Juventus would be keen to sign Colombia playmaker James Rodriguez in January if Bayern Munich are willing to cut short the 27-year-old's loan deal from Real Madrid. (Mail)Arsenal striker Pierre-Emerick Aubameyang, 29, \"skipped team meetings before games or refused to run during the final training\" to force through a move from Borussia Dortmund to the Gunners, according to the German club's former manager Peter Stoger. (Bulinews via Mirror)Neymar, 26, says Paris St-Germain boss Thomas Tuchel was right to drop striker Kylian Mbappe, 19, and Adrien Rabiot, 23, for the win against Marseille after they were late for a team meeting. (Mail)Manchester United will not hire a director of football unless manager Jose Mourinho approves the appointment. (ESPN)RB Leipzig head of recruitment and development Paul Mitchell says there has been no contact with Manchester United about a possible director of football role at Old Trafford. (Manchester Evening News)Mitchell also says RB Leipzig would be interested in signing Everton forward Ademola Lookman, who spent a stint on loan with the German club last season, if the 21-year-old ever leaves Goodison Park. (Sun)Share this withFind ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}