{"id": "Patisserie Valerie chairman waives salary", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowThe chairman of Patisserie Valerie has said he will waive his salary as he focuses on reviving the cake and cafe chain after an accounting scandal. Luke Johnson, who holds a large stake in the business, told the board he would not collect his £60,000 salary for the rest of his time at the group.He will also give up directorships at other firms amid criticism he holds too many. It follows shareholder anger about a rescue deal to keep the firm afloat. The chain, which owns 200 cafes, has been forced to raise £25m in emergency funding after it uncovered black hole in its accounts in October. As part of this, it issued £15m of new shares at a steep discount, but at a meeting last week some investors criticised Mr Johnson, saying they had been forced into the deal and felt cheated.Mr Johnson, 56, also promised to focus on his chairman role \"for the foreseeable future\" amid concerns he has been stretched too thin.The serial entrepreneur holds more than 30 active directorships at other firms, and has already quit four roles since the cafe chain's troubles emerged. Patisserie Valerie's problems first emerged in early October when its owner - Patisserie Holdings - announced it had discovered \"potentially fraudulent\" irregularities in its accounts. Finance director Chris Marsh has since been suspended and is the subject of a criminal investigation.Mr Johnson was forced to lend the business £20m of his own money and later admitted it had been \"three hours from going into bankruptcy\".Trading in the firm's shares has been temporarily halted and some are concerned the stock could plummet when it resumes. The shares were worth £4.29 before the scandal but market watchers believe they could fall as low as 60p. Former Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}