{"id": "White poppy: How is it different from the red remembrance symbol?", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowThe 2018 poppy appeal has launched, and for two weeks many people will wear them to remember British soldiers who died in wartime.The Royal British Legion chose the National Maritime Museum in Greenwich, London, for its big reveal at the start of the campaign -  a six metre high red poppy installation.It is surrounded by threads with quotes from the World War One generation, marking the centenary since that war came to an end and highlighting how their legacy is \"woven through the fabric of our nation today\".Many will stick to the traditional red paper flower for this period of remembrance, but other colours may catch the eye - white poppies, or perhaps even purple - and there are black poppies too.More people than ever before are wearing white poppies, says the group which makes them.But they are also controversial - earlier this week, Tory MP Johnny Mercer called white poppies \"attention seeking rubbish\".Does he speak for the majority - or are white poppies a valid symbol of remembrance?Red poppies began being used as a symbol in 1921 to help to remember those who fought in war.The flower was chosen because it grows wild in many fields in northern France and Belgium - where some of the deadliest battles of World War One took place. Its use was inspired by a poem, written by serving soldier John McCrae, which begins:\"In Flanders' fields the poppies blow\"Between the crosses, row on row...\"The Royal British Legion, which sells the red poppy, is clear that it is not a sign of support for war and death. Instead, the RBL stresses it is a symbol for remembrance and hope and should not be seen as a symbol of religion or politics.Nonetheless, some people feel the red poppy has become political, and that politicians use it to help justify war. Meanwhile, white poppies are distributed by the Peace Pledge Union - the UK's oldest secular and pacifist group. Created in 1933 - just 12 years after the red version - many people wore white poppies to stress the \"never again\" message, which emerged after World War One, and which pacifists feared was slipping away.Like the red poppy, the white badge also symbolises remembrance for victims of war. The Peace Pledge Union says the white poppy also represents a lasting commitment to peace and the belief that war should not be celebrated or glamorised.It says the white poppy remembers \"all those killed in war\" - while the Royal British Legion says it \"advocates a specific type of remembrance connected to the British Armed Forces\".You may also see purple poppies. These are less common and created to remember the animals who die in war.Black poppies remember the African, Black and Caribbean communities who contributed to various war efforts.Lots of people feel very strongly about wearing a red or white poppy and the issue comes up every year.This week, Mr Mercer called on people to \"ignore\" those who wear white poppies.\"If you don't want to wear a poppy don't bother; they fought and died so you could choose,\" the MP said. \"But don't deliberately try and hijack its symbolism for your own ends.\"White poppies are attention seeking rubbish. Ignore the wearers of them. If you don’t want to wear a poppy don’t bother; they fought and died so you could choose. But don’t deliberately try and hijack it’s symbolism for your own ends. Well done @BrianWoodMC https://t.co/HRK3wW3qY5End of Twitter post  by @JohnnyMercerUKFalklands veteran Simon Weston previously said he believes those who think the red poppy glorifies war are \"hijacking a campaign that helps families of the injured and the dead\".In 2014, RAF veteran and activist Harry Leslie Smith tweeted to say that he was against wearing a poppy.I am against wearing of the poppy b/c it has been co-opted by politicians to justified our present wars on terror that are eroding democracyEnd of Twitter post  by @HarryslaststandAnd news presenter Jon Snow famously refused to wear a poppy on air, saying viewer demands for him to wear a poppy were a kind of \"poppy fascism\". He said he would wear a poppy \"not on the telly... but on Remembrance Sunday in concert with others\".The Royal British Legion says it is. It \"defends the right to wear different poppies\" - and some of its volunteers wear different colours side by side.But it will not sell red poppies alongside other colours, because - it says - it may cause confusion.The charity says the red poppy \"is a symbol of peace inclusive of all regardless of race, belief, origin, or sexual/gender identity.\"Remembrance is neutral on both the causes and consequences of individual conflicts and is above partisan and political interpretation,\" it adds.And the Legion highlights that the red poppy raises money to support Britain's Armed Forces, veterans and their families in their time of need.Orders have risen considerably in recent years said Symon Hill, a co-ordinator at Peace Pledge Union which makes white poppies.\"In the last four years we have sold around 100,000 each year,\" he said. \"The record was in 2015, when we sold 110,000. In 2017, we sold 101,000.\"Sales this year - the 100th anniversary of the end of WW1 - have been \"going very well\" and the group has already sold more than 75,000. \"There is a realistic chance we might exceed the record,\" he said. Sales of the white version might be on the rise but they have a long way to go before they match the number of red poppies distributed every year - more than 40 million forecast in 2018, according to the Legion.Last year, House of Lords peer Jenny Jones, from the Green Party, tweeted that she was wearing both.Am wearing both poppies. Remember the dead, but don't repeat the mistakes that killed them. #Peace pic.twitter.com/LoaS9185OEEnd of Twitter post  by @GreenJennyJonesAnd this year people have already been sharing photos of them wearing or getting ready to sell the white badges.Looking forward to selling #WhitePoppies in the Forum @UniofExeter tomorrow between 12 and 2.  We think it's the first time it's happened! @BritishQuakers pic.twitter.com/NXhWK1bqfHEnd of Twitter post  by @GheeBowmanFormer Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}