{"id": "K-beauty: The rise of Korean make-up in the West", "paragraph": "Share this withEmailFacebookMessengerMessengerTwitterPinterestWhatsAppLinkedInCopy this linkThese are external links and will open in a new windowFor thousands of years the fashion conscious have used make-up to get their look just right, and keep up with fast-moving trends. Now, the global beauty industry is experiencing a revolution driven by South Korea. Say hello to K-beauty.Young people in Western countries have become infatuated with K-pop - Korean pop music - and Korean soap operas. Many Korean celebrities and pop stars, including the seven-member boy band BTS, are known for their signature looks.But it's not just Korean entertainment - in the last 18 months, there has also been a rise in Korean beauty trends coming over to the West.In 2017, South Korea's beauty industry was estimated to be worth just over $13bn (£10bn), according to retail researchers Mintel.The fascination with Korean cosmetics is due to how innovative they are, says Marie Claire's digital beauty editor Katie Thomas.South Korea's beauty industry is typically about 10-12 years ahead of the rest of the world, she says.\"It's not that there's been a big boom, we're just catching up with them essentially, [helped by] the expansion of Instagram and beauty blogging.\"Before even putting any make-up on, Koreans put in a lot of effort to take care of their skin. \"It's sort of ingrained in Korean culture from a very young age to look after your skin,\" Ms Thomas says, explaining that the Korean ethos is to ensure that you have good skin, rather than needing foundation and other products to cover up unsightly blemishes.You might be used to the typical daily three-step routine of using cleanser, toner and moisturiser before applying make-up, but in South Korea, skincare regimes range from seven to 12 steps, with a focus on hydrating the skin using gentle, natural ingredients.\"Some people would see it as excessive, but the fact is, you're feeding your skin with these incredible ingredients. It's so different in the UK [in comparison],\" says Ms Thomas.Much more research is carried out into new products in South Korea than in other countries, she says, because there are so many competing brands, each trying to be the best. \"The Korean beauty industry doesn't shy away from introducing new, unique ingredients to their formulas that would never be considered in the West,\" says Karen Hong, the founder of K Beauty Bar, a concession stand for Korean beauty products found in Topshop's flagship store in London's Oxford Street.Unique ingredients such as...? \"Snail mucin for moisturising, pearl for brightening, green tea for oil control and propolis from bees for soothing and nourishing,\" she reels off.In the US, 13% of 10 to 17-year-old girls are interested in trying K-beauty products, and 18% of 18 to 22-year-old women have used these products. According to Mintel's global beauty analyst Andrew McDougall, Korean beauty trends have grown in popularity thanks to \"clever digital marketing strategies\" on social media that have gained the interest of Western beauty influencers, bloggers and journalists.Consumers' interests are piqued by colourful packaging, as well as reviews and demonstrations on Instagram and YouTube, he explains.\"It's consumers who are more informed and do their own research, and it's influencers who put them on the K-beauty path in the first place,\" says Mr McDougall.Katie Thomas agrees: \"That K-pop fun quite cartoony approach is very much part of their industry. But it does do very well. People do buy into fun packaging - things they can take a picture of on their bathroom shelf.\"Some products can be found in Topshop and TKMaxx, but other than that, most British consumers can only buy these products online.YesStyle.com is one such company, and it sees Korean make-up as big business.The Hong Kong-based e-commerce firm carries more than 150 Korean brands, and it expects sales of K-beauty products to top $25m in 2018.Its founder Joshua Lau says the website's success has been down to reviews from verified buyers that give Western consumers the confidence to take a chance on new items.YesStyle's beauty editor Romy Rose Reyes says that Western consumers have been intrigued by the \"Chok Chok\" no make-up make-up look, where the aim is to have \"dewy and bouncy skin with an extra glow\".According to Ms Reyes and Ms Hong, looking \"natural\" and \"youthful\" is in, and the matte look favoured by European and US markets is now out.To that end, there is an emphasis on:Western cosmetics makers have been taking notice too.\"We see some Western brands take on a few of these skincare steps into their own regimes,\" says Marie Claire's Katie Thomas.\"For example, Yves Saint Laurent has cushion foundation and cushion blushers. It's a bit less scary for consumers - an easy way into K-beauty with a known brand.\"This summer, Primark launched its K-Pop range of cosmetics, which sold out quickly.Primark told the BBC that it was inspired by a \"huge trend\" it saw based on skincare innovations from South Korea, and it is continuing to stock face masks.\"We found this was a range that really worked for the younger consumer, who was not necessarily after serious skincare,\" a company spokesperson said.So is it just a fad, or is the K-beauty trend likely to last?Ms Thomas thinks it's here to stay, because young people are very concerned about the environment, and how damage to it affects humans as well as plants and animals. \"People are becoming more attuned to what is happening to their skin - there's so much pollution that gets into our skin that we don't know about,\" she says. \"Anything related to environmental damage is very much coming over to the Western market.\"But while much of this applies to women, in Korea cosmetics is big business for both male and female consumers, so is K-beauty likely to take off with men in the West?\"In Korea there is a different attitude amongst men towards skincare and make-up - they're not afraid to express themselves as long as they look and feel good, especially the younger generation. But this isn't a trend that has reached the general male population in the West yet,\" says Karen Hong.Mintel's Andrew McDougall agrees. \"Men in the West are increasingly becoming more active consumers in the beauty and personal care area, though there is a long way to catch up,\" he says.He points to Chanel's recent launch of a make-up line targeted at men called Boy de Chanel - the company chose to debut the products in South Korea, rather than its native France. Mr McDougall also adds that he doesn't wear make-up or use a fancy skincare routine himself.Former Brexit Secretary Dominic Raab criticises the \"lack of will and resolve\" in dealing with the EU.What are the differences between the two?"}