{"id": "Ice hockey: Pete Russell slams 'negative and lazy' Glasgow Clan", "paragraph": "By Craig AndersonFor BBC Sport ScotlandShare this withGlasgow Clan were \"negative and lazy\" in their defeat to Belfast Giants claimed head coach Pete Russell.Clan, Fife Flyers and Dundee Stars all failed to halt the progress of the Giants in the Elite League.The Scottish trio were all beaten on home ice by the Northern Irish side. However, the coach with the biggest gripe of the week was Clan's Russell, whose team failed to perform against Belfast on Saturday, losing 4-1 to the visitors.After Blair Riley and David Rutherford scored the take the 2-1 win from Fife Flyers on Friday night, the Giants moved on to Glasgow as the new league leaders and were keen to keep it. The Clan couldn't burst their bubble and when Riley opened the scoring in the second period, it gave a clear indication of where the game was going.From there, the Giants strengthened their grip on the game and while Riley completed his hat-trick, it left Russell far from happy. \"It's the same old from us,\" he moaned. \"The second period was negative and lazy and the fans and the guys in the locker room deserve better than that. \"It's not about individuals and that's four or five times we've lost games in the second period. If I knew the answer, I would go and fix it. \"Consistency is important and whenever you play the top teams, you have to show that. In fact, you must be consistent when you play anyone in this league. \"We have to be better than a 50% team and you have to work hard to do that. I don't think we did that enough, particularly in the second period.\" A three-game weekend for the Flyers yielded only one win, coming in overtime at Coventry Blaze on Sunday, edging them 6-5 in a contest where they were 4-2 down at one point. Joe Basaraba scored twice in the game, which was decided 18 seconds into the extra period when Danick Gauthier struck the winner. It ended the weekend on a happy note for the Flyers, who had lost 3-2 at Manchester Storm on Saturday, despite goals from Evan Stoflet and Basaraba in the second period. Dundee Stars saw hopes of building on their win over MK Lightning last week dashed with two losses against Sheffield Steelers then the Giants, rounding off their trip on Tayside. Coach Omar Pacha couldn't find a way past the Steelers, who shut them out in a 4-0 success in Yorkshire on a miserable night. Then at home on Sunday, Dundee couldn't halt Belfast's winning run as they went down 6-3, with Stars netting through Charles Corcoran, Jordan Cownie and Shawn Boutin.\"The beauty of hockey is you get to do it all again\" - Fife Flyers coach Todd Dutiaume looked on the positive side despite seeing his team beaten at Manchester Storm on Saturday.Share this with            Are any of these bizarre music myths true or false?Check out the BBC Sport Live Guide for details of all the forthcoming live sport on the BBC.Learn how to get involved in ice hockey to put your skating and hand-eye co-ordination to the test.Live scores, fixtures and results for Elite League ice hockey (external website).Live scores, fixtures and results for ice hockey Champions League (external website).Find ways to get activeHow to get involved in just about any sport or activityFind a club, activity or sport near you"}